[
    {
        "text": " Entonces, la clase de hoy, el intento es el teorema de Sorda, que había quedado pendiente",
        "start": 0.0,
        "end": 6.3
    },
    {
        "text": " del vio en el pasado, pero cuando empecé para esa clase entre la semana pasada y ayer",
        "start": 6.3,
        "end": 12.16
    },
    {
        "text": " me di cuenta que prefiero hacerlo bien despacito y entonces va a haber como media ahora que",
        "start": 12.16,
        "end": 17.68
    },
    {
        "text": " se nos ha ido con matemática de secundaria, pero bienvenido o sea no es algo malo, sino",
        "start": 17.68,
        "end": 23.12
    },
    {
        "text": " otra vez aprovechemos lo para repasar algunas cosas. Ha cambiado muchísimo la formación",
        "start": 23.12,
        "end": 31.96
    },
    {
        "text": " del secundaria y también por ende la formación con que estoy bien, para vino para mal, porque",
        "start": 31.96,
        "end": 39.519999999999996
    },
    {
        "text": " para mí es distinta completamente y entonces trabajar sobre otras formaciones no es lo mismo",
        "start": 39.519999999999996,
        "end": 51.400000000000006
    },
    {
        "text": " que antes y mi generación incluso ya no estaba también formada como en las generaciones",
        "start": 51.4,
        "end": 57.28
    },
    {
        "text": " anteriores, no? Hay un desnivel continuo en la formación que la universidad lo siente.",
        "start": 57.28,
        "end": 64.56
    },
    {
        "text": " Sin embargo, la universidad intenta siempre sacar el mejor producto al final de la carrera",
        "start": 64.56,
        "end": 69.28
    },
    {
        "text": " y por ahora la oderá ese concepto, lo defiende y lo defiende. Vamos a ver si seguimos",
        "start": 69.28,
        "end": 73.92
    },
    {
        "text": " el mismo. Entonces hoy vamos a empezar si quieren el primer pizarrón y quizás las dos",
        "start": 73.92,
        "end": 82.76
    },
    {
        "text": " partes de pizarrón le voy a enseñar de matemática básica, si quieren la nota o no. Voy a empezar",
        "start": 82.76,
        "end": 88.92
    },
    {
        "text": " diviendo a números naturales, enteros y quizás por acá diviendo polinomios, se acuerdan",
        "start": 88.92,
        "end": 94.88
    },
    {
        "text": " y ya habíamos hablado de vivir polinomios. El objetivo es dividir, aprender como se dividía,",
        "start": 94.88,
        "end": 103.04
    },
    {
        "text": " acordar como se dividía y ya pasar al algoritmo de uclides eso se va en inscrito 2, o sea",
        "start": 103.04,
        "end": 110.04
    },
    {
        "text": " si algún inscrito 2 lo va a recordar, pero son cuentas del diseo, la podemos hacer el",
        "start": 110.04,
        "end": 116.56
    },
    {
        "text": " diseo o sea si alguno está con el hermano menor en el diseo se las pueden enseñar,",
        "start": 116.56,
        "end": 123.36000000000001
    },
    {
        "text": " porque y después que hacemos todas esas cuentitas vamos a entender cómo sale el tema de",
        "start": 123.36000000000001,
        "end": 129.44
    },
    {
        "text": " besut en los enteros, en los polinomios y poco importa que si se me leemos de besut, lo que",
        "start": 129.44,
        "end": 137.04
    },
    {
        "text": " importa es el resultado y entonces de poco tenemos eso que nos lleva como media hora, eso lo vamos",
        "start": 137.04,
        "end": 144.8
    },
    {
        "text": " a encajar dentro de la demostración del tema de sorda, el libro como le comenté es un libro",
        "start": 144.8,
        "end": 149.36
    },
    {
        "text": " hecho para el diseo y se atuera matemática, lo sea sume que te sabe la elema de besut y",
        "start": 149.36,
        "end": 156.68
    },
    {
        "text": " nosotros lo vamos a hacer, porque esa es la idea degranar el libro de tal manera que",
        "start": 156.68,
        "end": 161.84
    },
    {
        "text": " todo podemos comprender completamente del libro y adquirirlo, así mirad. Entonces por ejemplo",
        "start": 161.84,
        "end": 169.24
    },
    {
        "text": " lo que está atrás de lo que vamos a exponer la primera parte es el concepto de máximo",
        "start": 169.24,
        "end": 174.88
    },
    {
        "text": " común diviso. Aquí mismo si yo me ha devuelto ahora y pregunto quien sabe que máximo común",
        "start": 174.88,
        "end": 187.96
    },
    {
        "text": " diviso se va, se revela digamos una gran diferencia entre las formaciones lisares, el diseo que lo",
        "start": 187.96,
        "end": 194.88
    },
    {
        "text": " trabajan todavía y el diseo que le ignoran completamente. Entonces aprovechemos a recuperar eso,",
        "start": 194.88,
        "end": 202.96
    },
    {
        "text": " por ejemplo el máximo común diviso les pregunto usted levanta en la mano de 72 y 16,",
        "start": 203.56,
        "end": 212.84
    },
    {
        "text": " quien se anima a decirme cuánto es el máximo común diviso.",
        "start": 214.64000000000001,
        "end": 217.20000000000002
    },
    {
        "text": " ¿Qué dijo? Bien, ¿por qué? 8, está bien que es 8.",
        "start": 223.44,
        "end": 228.4
    },
    {
        "text": " ¿Qué es?",
        "start": 228.96,
        "end": 229.96
    },
    {
        "text": " ¿Por qué el siguiente diviso o sea? ¿Por qué 8 de día a los dos?",
        "start": 231.48000000000002,
        "end": 235.20000000000002
    },
    {
        "text": " Primero y fundamental, primero y fundamental, 8 de vida de los dos, y además...",
        "start": 235.20000000000002,
        "end": 241.88
    },
    {
        "text": " Y después, ¿tás probas más grande 16 no de vida a su empresa?",
        "start": 241.88,
        "end": 248.16
    },
    {
        "text": " Dito, bien. ¿Cuáles son todos los divisores comunis en 3 dedíos y 16?",
        "start": 248.16,
        "end": 255.8
    },
    {
        "text": " Lo que dijiste está perfecto, ¿eh?",
        "start": 256.8,
        "end": 258.68
    },
    {
        "text": " ¿Cuáles son los divisores comunes de 16 y 72? A ver, la compañera.",
        "start": 258.68,
        "end": 268.2
    },
    {
        "text": " Muy bien, muy bien. 1, 2, 4, 8 creo que no nos falta ninguno, ¿no?",
        "start": 276.2,
        "end": 281.8
    },
    {
        "text": " ¿Lo que le pusimos todos? Sí.",
        "start": 281.8,
        "end": 283.8
    },
    {
        "text": " ¿Estoy trabajando con el sistema de diviso?",
        "start": 283.8,
        "end": 285.8
    },
    {
        "text": " Sí, estoy trabajando en la centera, pero cuando hacemos diviso de los comunes",
        "start": 285.8,
        "end": 289.8
    },
    {
        "text": " pongamos los positivos para no mariano con...",
        "start": 289.8,
        "end": 293.8
    },
    {
        "text": " ...menos 1, menos 2, menos 4, menos 8,",
        "start": 293.8,
        "end": 296.8
    },
    {
        "text": " que le pido a hacer replicas negativas de los mismos diviso.",
        "start": 297.8,
        "end": 300.8
    },
    {
        "text": " Pero sí estoy trabajando en ese tiempo porque a veces voy a necesitar calcular",
        "start": 301.8,
        "end": 305.8
    },
    {
        "text": " diviso de común de menos 24 y 32, entonces tengo que permitir los negativos.",
        "start": 305.8,
        "end": 310.8
    },
    {
        "text": " Y de estos el máximo es el 8.",
        "start": 312.8,
        "end": 315.8
    },
    {
        "text": " O sea, para buscar el máximo común divisor la estrategia del compañero fue...",
        "start": 317.8,
        "end": 320.8
    },
    {
        "text": " ...bueno, a ver, ¿cuál es el más grande que 8 hay 1, 16 pero ya no divide a lot.",
        "start": 320.8,
        "end": 325.8
    },
    {
        "text": " Pero los formales, fuzca, ¿cuáles son todos los diviso de los comunes de ambos?",
        "start": 325.8,
        "end": 330.8
    },
    {
        "text": " ¿Y cuál es el más grande de los diviso de los comunes?",
        "start": 330.8,
        "end": 332.8
    },
    {
        "text": " Ese concepto, cuál es el más grande del diviso de los comunes,",
        "start": 332.8,
        "end": 335.8
    },
    {
        "text": " es el que vamos a trabajar en el pizarro en derecho para polinomias.",
        "start": 335.8,
        "end": 339.8
    },
    {
        "text": " Que como se visualiza menos, voy a insistir de este lado.",
        "start": 340.8,
        "end": 343.8
    },
    {
        "text": " Ahora bien, acá lo hiciste fácil porque el 72 y 16 son números que más o menos los manejamos.",
        "start": 344.8,
        "end": 351.8
    },
    {
        "text": " Pero si yo voy a máximo común divisor que también quizás...",
        "start": 352.8,
        "end": 356.8
    },
    {
        "text": " ...algu uno lo puede hacer rápidamente mentalmente, pero ahora digo 722 y 432.",
        "start": 356.8,
        "end": 364.8
    },
    {
        "text": " ¿Has complicado? Hay que empezar a dividir este lado otro.",
        "start": 365.8,
        "end": 369.8
    },
    {
        "text": " Hay varias formas, a ver, tienenme alguna otra.",
        "start": 370.8,
        "end": 373.8
    },
    {
        "text": " ¿Qué dijiste?",
        "start": 378.8,
        "end": 379.8
    },
    {
        "text": " Bien, ahora voy a esa boca dijiste antes.",
        "start": 383.8,
        "end": 385.8
    },
    {
        "text": " Por factores primo.",
        "start": 386.8,
        "end": 387.8
    },
    {
        "text": " Yo voy a recordarlo de los factores primo, aunque esta parte no me interesa tanto para los polinomios,",
        "start": 387.8,
        "end": 393.8
    },
    {
        "text": " porque es muy importante en sí.",
        "start": 393.8,
        "end": 395.8
    },
    {
        "text": " Y después voy a tu argumento que es el que quiero seguir hacia la.",
        "start": 396.8,
        "end": 399.8
    },
    {
        "text": " Lo de factores primo, 722 es 2x361.",
        "start": 401.8,
        "end": 408.8
    },
    {
        "text": " Bueno, hay que buscar si 361 es primo o no, no es divisible entre 3,",
        "start": 409.8,
        "end": 413.8
    },
    {
        "text": " no es divisible entre 4, 5, 6, entre 7, a ver, muchos, tampoco,",
        "start": 413.8,
        "end": 418.8
    },
    {
        "text": " porque 350 más 11.",
        "start": 418.8,
        "end": 420.8
    },
    {
        "text": " Hasta que número de que buscar?",
        "start": 420.8,
        "end": 423.8
    },
    {
        "text": " De 360, más o menos, porque quedó 361, estoy buscando descomponer 361.",
        "start": 424.8,
        "end": 430.8
    },
    {
        "text": " La raíz de 361, más o menos 17 para ahí, 18.",
        "start": 431.8,
        "end": 437.8
    },
    {
        "text": " Entonces habrá que ver si el 11, el 11 tampoco, porque el terreno de divisibilidad no es divisor de 321.",
        "start": 438.8,
        "end": 444.8
    },
    {
        "text": " Y es, por supuesto que no, 9 tampoco, 11, 12 tampoco, 13, capaz 13, 390 menos 29 tampoco.",
        "start": 445.8,
        "end": 456.8
    },
    {
        "text": " Creo que este es primo, a que me falta ver revisar 17 por las dudas, 340 y 21 tampoco.",
        "start": 457.8,
        "end": 464.8
    },
    {
        "text": " O sea que esta es la decomposition de 722.",
        "start": 464.8,
        "end": 467.8
    },
    {
        "text": " Y la de 432 sería 2x216, 2x216 es 2x18, 2x54, 2x27, 3x al cubo, que es 27.",
        "start": 467.8,
        "end": 482.8
    },
    {
        "text": " O sea que en definitiva esto es 2x al 4x3 al cubo.",
        "start": 482.8,
        "end": 486.8
    },
    {
        "text": " Entonces lo que nos dijo el compañero después que lo factorizaste completamente,",
        "start": 488.8,
        "end": 492.8
    },
    {
        "text": " que esto siempre se puede factorizar completamente en los polinomios, cuando el cuerpo se algebraicamente cerrado,",
        "start": 493.8,
        "end": 499.8
    },
    {
        "text": " también vamos a poder factorizar completamente.",
        "start": 499.8,
        "end": 502.8
    },
    {
        "text": " Después que factorizaste completamente, acá encontrarás que el máximo común divisor, cuáles,",
        "start": 504.8,
        "end": 511.8
    },
    {
        "text": " vamos a mirar los primos en común.",
        "start": 512.8,
        "end": 514.8
    },
    {
        "text": " Y este es muy chiquitito, hay uno solo y una sola vez, podría estar 2x2, quizás.",
        "start": 514.8,
        "end": 518.8
    },
    {
        "text": " Y entonces ya tenés 2x2, pero el máximo común divisor como surgió el compañero con factorización,",
        "start": 519.8,
        "end": 527.8
    },
    {
        "text": " uno lo encuentra diciendo, es solo el 2, porque aparece solo ese primo elevado de la 1 en ambas factorizaciones.",
        "start": 527.8,
        "end": 534.8
    },
    {
        "text": " Muy bien, pero el otro compañero aquí adelante, tu nombre era,",
        "start": 536.8,
        "end": 540.8
    },
    {
        "text": " Nicolás, ¿y tu nombre?",
        "start": 541.8,
        "end": 543.8
    },
    {
        "text": " Nicolás, nos sugerió esto, también me acordé que tiene que ver con lo que vamos a hacer la derecha después,",
        "start": 543.8,
        "end": 549.8
    },
    {
        "text": " así que gracias Nicolás, y lo de Facundo dijo así, se lo voy a cambiar un poquito Facundo.",
        "start": 549.8,
        "end": 555.8
    },
    {
        "text": " Para encontrar el máximo común divisor me dijo, ¿por qué no agarras y restas?",
        "start": 555.8,
        "end": 560.8
    },
    {
        "text": " Y entonces se encontras el máximo común divisor entre el más chico y la resta.",
        "start": 561.8,
        "end": 565.8
    },
    {
        "text": " ¿De dónde está la esencia de eso? Está muy bien, ¿eh?",
        "start": 566.8,
        "end": 570.8
    },
    {
        "text": " Y yo voy a dar un salto después de eso, ¿pero cuál es la esencia?",
        "start": 570.8,
        "end": 574.8
    },
    {
        "text": " Ay, va. ¿Entonces ya me voy, ¿cómo era tu nombre?",
        "start": 576.8,
        "end": 579.8
    },
    {
        "text": " Otro Nicolás.",
        "start": 582.8,
        "end": 583.8
    },
    {
        "text": " Entonces Nicolás, ya da un paso más que justo en este ejemplo es casi la resta,",
        "start": 584.8,
        "end": 590.8
    },
    {
        "text": " porque lo que dice Nicolás es, toma la división que en este caso entra solo una vez y el resto da cuánto,",
        "start": 591.8,
        "end": 602.8
    },
    {
        "text": " 3290, ¿no? Este es el resto.",
        "start": 602.8,
        "end": 607.8
    },
    {
        "text": " Termine siendo la resta, casualmente, para que no se pele en los compañeros.",
        "start": 609.8,
        "end": 613.8
    },
    {
        "text": " Y entonces lo que me está diciendo Nicolás es, los divisores de estos dos van a ser los divisores de estos dos.",
        "start": 614.8,
        "end": 621.8
    },
    {
        "text": " Tendrá que acuerdo con eso, o sea, el conjunto de divisores de 722, no el máximo, de apuevemos lo del máximo,",
        "start": 623.8,
        "end": 633.8
    },
    {
        "text": " pero el conjunto de divisores de estos dos muchachos es lo mismo que el conjunto de divisores,",
        "start": 634.8,
        "end": 639.8
    },
    {
        "text": " de 432 y 290, ¿qué es el resto? Vamos a poner la palabra, ¿qué danse, ¿cueren?",
        "start": 644.8,
        "end": 648.8
    },
    {
        "text": " Dividendo, dividendo, divisor, esto nos enseñando el diseño, ¿cociente?",
        "start": 650.8,
        "end": 658.8
    },
    {
        "text": " Y resto, así se amaban, ¿cierto? ¿Por qué los divisores de 722 y 432 son lo mismo que los divisores de 432 y 290?",
        "start": 662.8,
        "end": 672.8
    },
    {
        "text": " ¿Cuándo es la idea de la idea de la idea?",
        "start": 674.8,
        "end": 677.8
    },
    {
        "text": " Sí, pero por qué, ¿en qué se basa eso? ¿Cómo te llamabas a vos?",
        "start": 678.8,
        "end": 681.8
    },
    {
        "text": " Cati.",
        "start": 682.8,
        "end": 683.8
    },
    {
        "text": " Tirame el por qué, cati, una estudiante ingeniería físico, matemática, tiene que aprender los inocinios que nos sabe. ¿Cómo sacamos eso?",
        "start": 683.8,
        "end": 692.8
    },
    {
        "text": " Les voy a dar una pista en azul, estar una forma de presentar la división, ¿sacurar?",
        "start": 695.8,
        "end": 701.8
    },
    {
        "text": " Pero otra forma es, lo mismo se escribe así, exactamente lo mismo.",
        "start": 701.8,
        "end": 706.8
    },
    {
        "text": " 722 es igual a 432 por 1 más 290, más junto con I, ¿no?",
        "start": 707.8,
        "end": 719.8
    },
    {
        "text": " Que el 290 tenía que ser menor que quién, que el divisor, ¿qué 432, ¿no verdad?",
        "start": 720.8,
        "end": 727.8
    },
    {
        "text": " Es otra forma de plantar la división, la división, cuando vos dividís, te da esto, el resto tenía que ser menor que el divisor,",
        "start": 728.8,
        "end": 736.8
    },
    {
        "text": " si no, estás haciendo más la división. Entonces la forma de decirlo es otra forma sexta, pero tenés que agregar para que quede...",
        "start": 737.8,
        "end": 744.8
    },
    {
        "text": " En esta simbología ya está agregado, el resto tiene que ser menor que el día, y en esta simbología lo tenés que poner explícitamente, bien.",
        "start": 745.8,
        "end": 752.8
    },
    {
        "text": " Pero quizás en la simbología de la derecha, ¿sí?",
        "start": 753.8,
        "end": 755.8
    },
    {
        "text": " Porque si pasas el 430, vas a agregar y se van a poder ver cómo eso es en la derecha.",
        "start": 756.8,
        "end": 760.8
    },
    {
        "text": " Exactamente. Entonces esto, lo mismo que decir esto, ¿no verdad?",
        "start": 761.8,
        "end": 767.8
    },
    {
        "text": " La voy a usar las dos, 722 menos 432 por 1 es igual a 290.",
        "start": 768.8,
        "end": 775.8
    },
    {
        "text": " Entonces si vos tenés un divisor, vamos a llamar los de chiquita, yo voy a poner el otro color en verde.",
        "start": 776.8,
        "end": 784.8
    },
    {
        "text": " Si dé, divide a 290 y dé divide a 432, miren acá, ¿a quién divide?",
        "start": 785.8,
        "end": 795.8
    },
    {
        "text": " En particular aquí, a 722.",
        "start": 796.8,
        "end": 801.8
    },
    {
        "text": " Perfecto. Ahora bien, si otros deprimas, divide a 722, miren esta ahora, y deprima divide a 432. ¿a quién divide?",
        "start": 803.8,
        "end": 814.8
    },
    {
        "text": " A cualquier combinación lineal, o sea, a 290.",
        "start": 817.8,
        "end": 820.8
    },
    {
        "text": " Con eso tienen los mismos divisores, planteado de una manera y de la otra, pasas restando como dijo el compañero y otra cosa mariposa.",
        "start": 821.8,
        "end": 829.8
    },
    {
        "text": " Entonces el conjunto de divisores, lo pongo en verde acá, este recuadro para que entiendan que viene de la argumentación que está en verde, es el mismo.",
        "start": 830.8,
        "end": 839.8
    },
    {
        "text": " Si el conjunto de divisores es el mismo, el máximo también, el máximo común divisor también,",
        "start": 840.8,
        "end": 847.8
    },
    {
        "text": " y entonces ya están en la base del algoritmo de Euclides, ya entendieron el algoritmo de Euclides, que es base de toda la parte de discreto 2 para la criptografía que viene al final, etc.",
        "start": 848.8,
        "end": 861.8
    },
    {
        "text": " ¿Por qué? Porque están diciendo que este proceso, yo lo poseí, así como el hiciste con 322 y 432,",
        "start": 863.8,
        "end": 874.8
    },
    {
        "text": " lo podemos hacer ahora con 432 y 290, y al dividirlo, bueno, casualmente nuevamente medio cociente 1 y al resto de 142, y ya saben que voy a seguir, ¿no verdad?",
        "start": 875.8,
        "end": 895.8
    },
    {
        "text": " Y ahora sigo con 290 y vídeo 142, me da 2 y el resto 8, no, el resto 6, disculpen.",
        "start": 895.8,
        "end": 906.8
    },
    {
        "text": " Y después lo tengo que seguir, con 142 y 6, esto cuantos da 23, 23, hay que ser la cuenta, pueden hacer la cuenta como nos enseñan del liseo,",
        "start": 906.8,
        "end": 930.8
    },
    {
        "text": " vamos a hacer la cuenta como le enseñan el liseo, para repasarla, pongo 2, 2 por 6, 12, 12, quedando bajo 2, 3, 3 por 6 y 18, al 22, resto 4, y entonces sigo 6, dividido 4, 1, resto 2, sigo 4, dividido 2, 2, resto 0.",
        "start": 930.8,
        "end": 956.8
    },
    {
        "text": " Entonces, acá, yo lo voy a continuar, como naturalmente todos imagina, esto es el conjunto divisor de 722 y 432, ya dijimos, ya argumentamos,",
        "start": 957.8,
        "end": 981.8
    },
    {
        "text": " se sigúa el conjunto divisor de 432 y 290 y el conjunto divisor de 432 y 290 por la misma tipo de argumentación es la misma que el conjunto divisor de 290 y 142.",
        "start": 981.8,
        "end": 995.8
    },
    {
        "text": " Y este a la vez coincide con el conjunto divisor de 142 y 6 y este coincide con el conjunto divisor de 6 y cuáles 4 y este coincide con el conjunto divisor de 4 y 2,",
        "start": 995.8,
        "end": 1022.8
    },
    {
        "text": " que esto termina acá, cierto, porque el conjunto divisor de 4 y 2 es unidos, digo termino acá porque el siguiente resto es 0, entonces esto termino acá,",
        "start": 1022.8,
        "end": 1041.8
    },
    {
        "text": " dicho de otra manera, el máximo va a ser el último resto, no enulo, lo pongo en rojo para que siempre el máximo marca un rojo,",
        "start": 1042.8,
        "end": 1053.8
    },
    {
        "text": " el máximo es el último resto, no enulo, acá está el nulo, resta enulo, el máximo termina siendo el último resto, no enulo.",
        "start": 1053.8,
        "end": 1065.8
    },
    {
        "text": " Entonces el máximo como un divisor de 722 y 432, este es el algoritmo de Euclides, estamos hablando de 2000 años atrás, ¿no?",
        "start": 1066.8,
        "end": 1083.8
    },
    {
        "text": " Por ahí se sospecha que viene de antes, hay algunas tablillas por ahí que marcan que está aburrimos esta de antes,",
        "start": 1084.8,
        "end": 1098.8
    },
    {
        "text": " o sea matemática que tiene 2000 y pico ahí, ¿sí entendió? ¿Cómo se encuentra el máximo como un divisor?",
        "start": 1098.8,
        "end": 1109.8
    },
    {
        "text": " ahí lo que armamos entre todos es todas las herramientas de comprender por qué el algoritmo de Euclides funciona,",
        "start": 1110.8,
        "end": 1119.8
    },
    {
        "text": " primero que los divisores comunes se conservan cuando vas al resto y el gran truco está en aquello en azul,",
        "start": 1120.8,
        "end": 1127.8
    },
    {
        "text": " lo expresa de esta manera y de esta manera, poco importa el 1 jugo en algo el 1 ahí, que el cosiente era 1,",
        "start": 1127.8,
        "end": 1134.8
    },
    {
        "text": " si en vez de 1 le pongo Q, que los cosientes siempre generales, el dice de llamaban Q, de igual ¿no?",
        "start": 1135.8,
        "end": 1140.8
    },
    {
        "text": " ¿no? Le ve ya más Q y este argumento que hicimos juntos, vale igual.",
        "start": 1140.8,
        "end": 1144.8
    },
    {
        "text": " Por lo tanto, no importaba que fuera 1 o cosiente fuera 2 o 23, cosiente casi que no se usó.",
        "start": 1146.8,
        "end": 1153.8
    },
    {
        "text": " Lo que se va trasladando es que el conjunto de divisores sigue siendo el mismo, ¿no? que está incluido en uno o otro,",
        "start": 1153.8,
        "end": 1160.8
    },
    {
        "text": " sigue siendo el mismo. Entonces, al final del proceso, el conjunto de divisores es muy chiquito porque te van quedando restos machicos.",
        "start": 1160.8,
        "end": 1169.8
    },
    {
        "text": " ¿Por qué el algoritmo es un algoritmo que funciona por esta propiedad?",
        "start": 1170.8,
        "end": 1175.8
    },
    {
        "text": " acá la dijimos en la primera división, pero esa propiedad al resto que ustedes conocen del Liseo,",
        "start": 1176.8,
        "end": 1183.8
    },
    {
        "text": " están todas las divisiones, siempre el resto es machico, porque si no te aseguran que el resto es machico y el algoritmo se da computadora,",
        "start": 1183.8,
        "end": 1192.8
    },
    {
        "text": " puede seguir bucliendo ahí. Entonces, ¿qué pasa? como el resto, realmente se va chicando, es un momento para.",
        "start": 1192.8,
        "end": 1201.8
    },
    {
        "text": " Tansen si yo como eso. Profes, y si yo hubiera arrancado con 432 divididos, 722, hubiera arrancado al revés.",
        "start": 1202.8,
        "end": 1211.8
    },
    {
        "text": " ¿Por qué? El principio yo que sé, ¿por qué tengo que vivir en el más grande por el machico? ¿Qué pasaba inmediatamente?",
        "start": 1212.8,
        "end": 1220.8
    },
    {
        "text": " El primero cosiente queda, el primero cosiente queda así, ¿sí? ¿Cero? ¿Y el resto?",
        "start": 1221.8,
        "end": 1225.8
    },
    {
        "text": " Claro, y se te dan vuelta, o sea que en siguiente paso ya te quedan dando a vuelta. ¿Te imaginan?",
        "start": 1226.8,
        "end": 1231.8
    },
    {
        "text": " 432 divididos, 722, cociente 0, resto, 432 y así es de paso que quedó como acá.",
        "start": 1232.8,
        "end": 1239.8
    },
    {
        "text": " O sea que no sé, preocupa, digo todo esto porque en polinomia nos va a pasar, ¿quién tiene el grado más grande?",
        "start": 1240.8,
        "end": 1245.8
    },
    {
        "text": " Sí, si los ves acá, las polinomias, mira, sí, este es más grande.",
        "start": 1246.8,
        "end": 1249.8
    },
    {
        "text": " Pero forma generica, si te dan dos polinomias, que no sabes bien en dos polinomias teóricos, y si cuéles y yo que sé,",
        "start": 1250.8,
        "end": 1256.8
    },
    {
        "text": " y vivo en un entriot, no se preocupen. Arrancada de una manera u otra en el algodismo sirvigual,",
        "start": 1257.8,
        "end": 1262.8
    },
    {
        "text": " lo primero que hace te lo da vuelta, sino vale, quedó claro eso.",
        "start": 1263.8,
        "end": 1266.8
    },
    {
        "text": " Antes dimos a polinomias, ¿cómo estamos acá?",
        "start": 1269.8,
        "end": 1272.8
    },
    {
        "text": " Acá hay un paso más que no estoy dando en los números que sí se hacen discretados,",
        "start": 1273.8,
        "end": 1277.8
    },
    {
        "text": " que es el final del hemés de sud, que me parece a mí mucho más claro hacerlo directamente polinomias que hacerlo en los centeros.",
        "start": 1279.8,
        "end": 1285.8
    },
    {
        "text": " Lo vamos a hacer en polinomias que es donde lo necesitamos además.",
        "start": 1287.8,
        "end": 1290.8
    },
    {
        "text": " O sea, lo que va a hacer en polinomias ahora es todo lo mismo y un paso más,",
        "start": 1292.8,
        "end": 1297.8
    },
    {
        "text": " en toda esta recreación de matemáticas de secundario.",
        "start": 1298.8,
        "end": 1301.8
    },
    {
        "text": " Pero preguntas antes de borrar este pizarro, lo sé escucho, dudas.",
        "start": 1302.8,
        "end": 1306.8
    },
    {
        "text": " Yo ahí los saludo que me quedó, que ya subían, no está ahí lo que estoy tendr,",
        "start": 1310.8,
        "end": 1315.8
    },
    {
        "text": " o sea que, como diría, una y...",
        "start": 1316.8,
        "end": 1319.8
    },
    {
        "text": " Acá, claro, lo que estamos usando esto muy importante es que si alguien divide a estos dos, o sea,",
        "start": 1320.8,
        "end": 1326.8
    },
    {
        "text": " el divisor y al resto entonces divide al dividendo.",
        "start": 1327.8,
        "end": 1332.8
    },
    {
        "text": " ¿Por qué? Porque si dé divide a 290 y dé divide a 432,",
        "start": 1333.8,
        "end": 1338.8
    },
    {
        "text": " entonces, bueno, el principio dé divide también a 432 por el cociante,",
        "start": 1339.8,
        "end": 1342.8
    },
    {
        "text": " cuál fuera, lo que fuera.",
        "start": 1343.8,
        "end": 1345.8
    },
    {
        "text": " Y entonces, dé divide a la suma y si divide la suma, divide a este muchacho.",
        "start": 1347.8,
        "end": 1353.8
    },
    {
        "text": " Ahora bien, ve este lado, si dé divide a este y dé divide de prima, ¿no?",
        "start": 1354.8,
        "end": 1359.8
    },
    {
        "text": " Divide a este y divide a este, divide también por supuesto al producto por cualquier cosa, por cualquier cú,",
        "start": 1360.8,
        "end": 1365.8
    },
    {
        "text": " divide a la resta, entonces divide a este.",
        "start": 1366.8,
        "end": 1369.8
    },
    {
        "text": " Estamos usando eso, que si alguien divide a 2, divide a la suma o el resto.",
        "start": 1370.8,
        "end": 1374.8
    },
    {
        "text": " ¿Sabes? ¿Se acuerdan de eso, no? Porque esto es si dé divide a x y dé divide a y,",
        "start": 1375.8,
        "end": 1381.8
    },
    {
        "text": " esto es que quiere decir que existe un e, tal que dé x, que existe un h, tal que dé por hc,",
        "start": 1381.8,
        "end": 1392.8
    },
    {
        "text": " entonces, lo se sumemos, entonces dé por e, más dé por h, es x más y,",
        "start": 1393.8,
        "end": 1400.8
    },
    {
        "text": " y acá les haga factor como un d, dé por ms h.",
        "start": 1401.8,
        "end": 1404.8
    },
    {
        "text": " Y si es la resta, le de por les comer, ¿no?",
        "start": 1405.8,
        "end": 1407.8
    },
    {
        "text": " Si dé divide a 1, divide a 2 y divide a la suma o alguien dijo por ella cualquier combinación niñar,",
        "start": 1407.8,
        "end": 1412.8
    },
    {
        "text": " que es más polienta, todavía porque estamos usando combinación niñar.",
        "start": 1413.8,
        "end": 1415.8
    },
    {
        "text": " ¿Tá? Muy bien, alguna otra pregunta antes de borrar y nos vamos a polinomios, bien.",
        "start": 1416.8,
        "end": 1423.8
    },
    {
        "text": " El truco ahora es buscar el máximo común divisor de polinomios.",
        "start": 1425.8,
        "end": 1429.8
    },
    {
        "text": " El tema es, mientras borro, comento, que desde el punto de vista algebrayco,",
        "start": 1430.8,
        "end": 1436.8
    },
    {
        "text": " el comportamiento de los enteros y el comportamiento de los polinomios,",
        "start": 1437.8,
        "end": 1443.8
    },
    {
        "text": " es igual, tienen el mismo comportamiento.",
        "start": 1444.8,
        "end": 1448.8
    },
    {
        "text": " Entonces, las propiedades se comparten esta propiedad del algoritmo duquilidez,",
        "start": 1452.8,
        "end": 1457.8
    },
    {
        "text": " el mismo duquilidez se puede hacer en ambas estructuras algebraycas.",
        "start": 1457.8,
        "end": 1462.8
    },
    {
        "text": " Entonces, ahora nos vamos a máximo común divisor,",
        "start": 1470.8,
        "end": 1472.8
    },
    {
        "text": " y se pone el negro acá, en polinomios.",
        "start": 1475.8,
        "end": 1478.8
    },
    {
        "text": " Y empecemos con un ejemplo, pero rápidamente nos vamos a la parte más teórica,",
        "start": 1478.8,
        "end": 1488.8
    },
    {
        "text": " pero no sé, empecemos con 12x3 menos x.",
        "start": 1489.8,
        "end": 1493.8
    },
    {
        "text": " Si está desordenado lo primero que hay que hacer es ordenarlo,",
        "start": 1495.8,
        "end": 1498.8
    },
    {
        "text": " más 5, ya vemos este pdx y acude x,",
        "start": 1499.8,
        "end": 1504.8
    },
    {
        "text": " 3x cuadrado, menos 1.",
        "start": 1504.8,
        "end": 1509.8
    },
    {
        "text": " En este caso, como me están dando dos polinomios claritos, cuáles son,",
        "start": 1512.8,
        "end": 1515.8
    },
    {
        "text": " sé cuáles son el que tienen más grado, más grande, etcétera,",
        "start": 1516.8,
        "end": 1518.8
    },
    {
        "text": " entonces ya voy a plantear más ordenada de la situación y voy a hacer claro.",
        "start": 1519.8,
        "end": 1523.8
    },
    {
        "text": " Ya me voy, la pregunta por supuesto de cuál es el máximo común divisor entre pdx y cdx.",
        "start": 1524.8,
        "end": 1530.8
    },
    {
        "text": " La misma pregunta, pero ahora en polinomios.",
        "start": 1531.8,
        "end": 1536.8
    },
    {
        "text": " Capas que no hay divisor común acá, pero a la hora de descubrir esto,",
        "start": 1537.8,
        "end": 1544.8
    },
    {
        "text": " podría ser el método de Nicolás, que es la factorización,",
        "start": 1545.8,
        "end": 1549.8
    },
    {
        "text": " lo factorizo todo en cuanto a las raíces,",
        "start": 1550.8,
        "end": 1552.8
    },
    {
        "text": " es la factorización que hicimos con número prima,",
        "start": 1553.8,
        "end": 1555.8
    },
    {
        "text": " ahora hay que encontrar las raíces y poner polinomios de grado 1.",
        "start": 1556.8,
        "end": 1560.8
    },
    {
        "text": " Y fijamos si tienen raíces en común,",
        "start": 1561.8,
        "end": 1563.8
    },
    {
        "text": " esa es la metodología 1, la metodología 2, algo ritmo de ucris.",
        "start": 1564.8,
        "end": 1568.8
    },
    {
        "text": " Yo en mi me preocupo cuál son las raíces y me voy directamente a dividir,",
        "start": 1569.8,
        "end": 1572.8
    },
    {
        "text": " a dividir por el truco de que sí, perdón, me llevan estas,",
        "start": 1573.8,
        "end": 1581.8
    },
    {
        "text": " vamos a cambiar p1, p2, porque el Q ya sabemos que el Q es para cociente.",
        "start": 1581.8,
        "end": 1588.8
    },
    {
        "text": " Y si no, p1 dividido p2, un cociente Q1 y un resto de r1 de x.",
        "start": 1590.8,
        "end": 1600.8
    },
    {
        "text": " Esa es la división del punto de vista formal",
        "start": 1601.8,
        "end": 1603.8
    },
    {
        "text": " y hago la analogía, decir esto, es lo mismo que decir,",
        "start": 1605.8,
        "end": 1609.8
    },
    {
        "text": " que p1 es igual a p2 por Q de x,",
        "start": 1610.8,
        "end": 1616.8
    },
    {
        "text": " más por Q1 de x, más r1 de x,",
        "start": 1617.8,
        "end": 1621.8
    },
    {
        "text": " y los escuchos, qué es lo que me está faltando en la parte de abajo de esa llave,",
        "start": 1622.8,
        "end": 1627.8
    },
    {
        "text": " para que sean las dos cosas iguales, si solo sí.",
        "start": 1629.8,
        "end": 1633.8
    },
    {
        "text": " R1 sea menor, el grado, la forma de medir en polinomios es el grado, ¿se acuerdan?",
        "start": 1634.8,
        "end": 1643.8
    },
    {
        "text": " El grado de R1 de x tiene que ser menor que quien,",
        "start": 1644.8,
        "end": 1649.8
    },
    {
        "text": " menor que quien, que el grado de p2, ahí va.",
        "start": 1651.8,
        "end": 1655.8
    },
    {
        "text": " Dara una división de polinomios es dar esto,",
        "start": 1656.8,
        "end": 1662.8
    },
    {
        "text": " dar esta expresión con esta condición y dar una división de polinomios.",
        "start": 1663.8,
        "end": 1667.8
    },
    {
        "text": " Es lo mismo que habíamos escrito con números de arriba, ¿se acuerdan?",
        "start": 1668.8,
        "end": 1671.8
    },
    {
        "text": " Esa es la división entre polinomios.",
        "start": 1673.8,
        "end": 1675.8
    },
    {
        "text": " Creo que sí, división entre polinomios lo vimos todos en la división, ¿no?",
        "start": 1676.8,
        "end": 1679.8
    },
    {
        "text": " O alguien no le dio.",
        "start": 1680.8,
        "end": 1682.8
    },
    {
        "text": " No hay vergüenza hacia el inútil.",
        "start": 1682.8,
        "end": 1684.8
    },
    {
        "text": " Pero posiblemente ya quedó medio olvidada, eso es dividente polinomios.",
        "start": 1686.8,
        "end": 1690.8
    },
    {
        "text": " Y es exactamente lo mismo que hicimos en números.",
        "start": 1691.8,
        "end": 1693.8
    },
    {
        "text": " Entonces, empecemos con este ejemplo y te pegamos a la parte teórica.",
        "start": 1694.8,
        "end": 1698.8
    },
    {
        "text": " Y en el ejemplo, en el arranco con p1 y p2, ya sé cuál tiene grado más alto,",
        "start": 1699.8,
        "end": 1703.8
    },
    {
        "text": " pero que me quede más fácil.",
        "start": 1704.8,
        "end": 1705.8
    },
    {
        "text": " Me queda 2x³, menos x más 5,",
        "start": 1707.8,
        "end": 1710.8
    },
    {
        "text": " divido a 3x² menos u.",
        "start": 1710.8,
        "end": 1713.8
    },
    {
        "text": " Entonces, ¿se acuerdan como era, no?",
        "start": 1715.8,
        "end": 1718.8
    },
    {
        "text": " Toma el polinomio, el coeficiente del término mayor para aproximar la cosa.",
        "start": 1719.8,
        "end": 1724.8
    },
    {
        "text": " Y acá me queda 2x³ de x.",
        "start": 1725.8,
        "end": 1727.8
    },
    {
        "text": " La primera aproximación.",
        "start": 1728.8,
        "end": 1729.8
    },
    {
        "text": " Sí. 2x³ de x por 3x² me queda,",
        "start": 1730.8,
        "end": 1733.8
    },
    {
        "text": " acá hay un menos, se pone un menos, ¿no? ¿no? ¿verdad?",
        "start": 1734.8,
        "end": 1736.8
    },
    {
        "text": " 2x³ por 3x² me queda 2x³ para eso me dio 2x³,",
        "start": 1736.8,
        "end": 1740.8
    },
    {
        "text": " para que ya se vaya lo de mayor grado.",
        "start": 1741.8,
        "end": 1744.8
    },
    {
        "text": " Después me queda 2x³ menos 1, multiplicado por menos 1,",
        "start": 1745.8,
        "end": 1750.8
    },
    {
        "text": " acá me queda menos 2x³.",
        "start": 1751.8,
        "end": 1753.8
    },
    {
        "text": " Ojo que hay que restar, aunque tengo menos, hay que restar todo, ¿no? ¿no? ¿verdad?",
        "start": 1754.8,
        "end": 1758.8
    },
    {
        "text": " Ustedes se hago algún error, me corrigen y media también.",
        "start": 1759.8,
        "end": 1762.8
    },
    {
        "text": " 2x³ se va cuando se equivoco, por supuesto para eso sí se le divisió en así,",
        "start": 1763.8,
        "end": 1768.8
    },
    {
        "text": " menos x menos menos 2x³ me queda menos 1³ de x.",
        "start": 1769.8,
        "end": 1774.8
    },
    {
        "text": " Y se baja el más 5.",
        "start": 1775.8,
        "end": 1777.8
    },
    {
        "text": " Igual que en las divisiones de nubras se baja lo que está la derecha.",
        "start": 1778.8,
        "end": 1781.8
    },
    {
        "text": " Menos 1³ más 5 no es divisible entre 3x² menos 1 porque el grado ya es menor.",
        "start": 1782.8,
        "end": 1788.8
    },
    {
        "text": " Entonces este es el resto, este es el resto, este es el consciente de la división.",
        "start": 1789.8,
        "end": 1800.8
    },
    {
        "text": " Y lo que estamos diciendo entonces es que el conjunto de divisores de 2x³ menos x más 5,",
        "start": 1801.8,
        "end": 1814.8
    },
    {
        "text": " pero el conjunto de divisores de este polinomio p1 y el polinomio p2 3x² menos 1,",
        "start": 1814.8,
        "end": 1827.8
    },
    {
        "text": " el conjunto de divisores es igual al conjunto de divisores de 3x² menos 1 y que este es p2,",
        "start": 1828.8,
        "end": 1839.8
    },
    {
        "text": " vamos a ponerlo todo y el resto se llama R1, lo pusimos al resto si R1 de x,",
        "start": 1840.8,
        "end": 1848.8
    },
    {
        "text": " que se llama que tiene la forma menos 1³ de x más 5.",
        "start": 1849.8,
        "end": 1855.8
    },
    {
        "text": " Ahí se podemos parar y revisar porque acá está muy fácil, este polinomio menos 1³ de x más 5,",
        "start": 1857.8,
        "end": 1866.8
    },
    {
        "text": " es menos 1³, menos 1³ por x menos 15 y ya sabemos entonces la raíz es 15,",
        "start": 1870.8,
        "end": 1882.8
    },
    {
        "text": " por lo tanto podemos revisar, podemos revisar este si 15 raíz de este otro y con eso ya concluimos y",
        "start": 1883.8,
        "end": 1893.8
    },
    {
        "text": " pero si no podemos seguir con el algoritmo deuclides y lo vamos a hacer simplemente para insistir con el procedimiento y",
        "start": 1893.8,
        "end": 1899.8
    },
    {
        "text": " te queda, siguiente paso es dividir 3x² menos 1 dividido menos 1³ de x más 5,",
        "start": 1900.8,
        "end": 1908.8
    },
    {
        "text": " vamos a encontrar a ver cuál es el acá nos queda menos 9x,",
        "start": 1909.8,
        "end": 1915.8
    },
    {
        "text": " 3 y divido menos 1³, me da menos 9x, menos 9 por menos 1³ de 3x²,",
        "start": 1915.8,
        "end": 1926.8
    },
    {
        "text": " de 9x, acá disculpen, gurises acá, mire el pizarrón, el menos 1 lo voy a lejar un poquito,",
        "start": 1927.8,
        "end": 1934.8
    },
    {
        "text": " voy a poner por acá porque falta el término en x que va a aparecer ahora,",
        "start": 1935.8,
        "end": 1938.8
    },
    {
        "text": " entonces menos 9x por 5 queda menos 45x, se van estos términos para eso el hicimos y me quedó menos",
        "start": 1938.8,
        "end": 1952.8
    },
    {
        "text": " menos 45x queda 45x y se baja el menos 1 y ahora divido 45x divido menos 1³,",
        "start": 1953.8,
        "end": 1963.8
    },
    {
        "text": " esto me da menos 135x, pero menos 135, el x no va, cuelten,",
        "start": 1963.8,
        "end": 1978.8
    },
    {
        "text": " también 45 queda menos 135, hago menos 135 por menos 1³ de 45x que acabo de arrestar por supuesto y",
        "start": 1979.8,
        "end": 1992.8
    },
    {
        "text": " menos 135x, 5 da 675, menos 675 creo, revisenta por favor, se va a los 45 y me queda menos",
        "start": 1992.8,
        "end": 2010.8
    },
    {
        "text": " por lo más 674 y este sería el segundo arresto, el último arresto, o sea lo que estamos diciendo que el conjunto de divisores de estos dos",
        "start": 2010.8,
        "end": 2027.8
    },
    {
        "text": " ahora que pasa, a diferencia de hoy, acá es lo que va bajando en el algoritmo, oye era lo que va bajando eran los restos, ¿se acuerdan?",
        "start": 2027.8,
        "end": 2038.8
    },
    {
        "text": " cada vez más chiquitos, acá lo que va bajando es los grados de los polinomios, entonces a ver, lo vamos,",
        "start": 2039.8,
        "end": 2044.8
    },
    {
        "text": " el primer polinomio resto tenía grado 1 y el segundo arresto tiene grado 0, hoy terminaba justamente cuando lleguamos al 0,",
        "start": 2044.8,
        "end": 2061.8
    },
    {
        "text": " al 0 acaba a terminar justamente cuando lleguis a un polinomio grado 0, le he dicho si quieres puede dar un paso más, porque podemos dividir cualquier polinomio entre un número, un polinomio grado 0 es un número,",
        "start": 2061.8,
        "end": 2075.8
    },
    {
        "text": " si el número no es 0, por supuesto, puedes dividirlo y te va a dar exacto porque la división entre un número te da exacto,",
        "start": 2076.8,
        "end": 2081.8
    },
    {
        "text": " dividir todos los coeficientes entre ese número y ya está, entonces el siguiente paso va a ser resto 0, es lo mismo que hoy cuando te dio resto 0,",
        "start": 2081.8,
        "end": 2091.8
    },
    {
        "text": " el último divisor que no es resto 0 vendría ser el máximo como un divisor, claro, no sé lo que esperamos que el máximo como un divisor entre el polinomio se un polinomio,",
        "start": 2092.8,
        "end": 2106.8
    },
    {
        "text": " este es un polinomio pero constante, ¿por qué? porque no comparte ninguna raíz, porque estos dos polinomios que yo puse al azar no comparten ninguna raíz,",
        "start": 2106.8,
        "end": 2116.8
    },
    {
        "text": " entonces el máximo como un divisor, en este caso, y un detalle más, cuando yo estoy buscando a los divisores,",
        "start": 2117.8,
        "end": 2127.8
    },
    {
        "text": " vamos a suponer que estamos trabajando aquí en los reales, que toda esta cuenta es NR, NRDX, no dije dónde estábamos,",
        "start": 2127.8,
        "end": 2136.8
    },
    {
        "text": " pero para no complicar, trabajemos NRDX, entonces yo es lo que digo que los divisores es todo NR,",
        "start": 2137.8,
        "end": 2144.8
    },
    {
        "text": " porque claro, si 674 divide, también divide 1 y divide 8 y divide menos 7, todos los números divide ambos polinomios,",
        "start": 2145.8,
        "end": 2154.8
    },
    {
        "text": " siempre todos los números divide en 2 polinomios, el problema era lo rico es haberse encontrado algún narraijo de los dos y entonces es un polinomio que divide a los dos,",
        "start": 2155.8,
        "end": 2167.8
    },
    {
        "text": " hay que ver el último, es un número constante, todos los constantes, perdón, cuidado, excepto el cero, que el cero no divide,",
        "start": 2168.8,
        "end": 2180.8
    },
    {
        "text": " todos los constantes son divisores de ambos, ejemplo un ejemplo muy chiquito y muy tanto, pero para que vean que si yo busco en los máximos como un divisor,",
        "start": 2181.8,
        "end": 2194.8
    },
    {
        "text": " de X cuadrado menos 1 y X cuadrado, más 12X más 1, que te da, cuáles es máximo como, no puse divisores, puse máximo como un divisor, ¿quién da?",
        "start": 2194.8,
        "end": 2211.8
    },
    {
        "text": " ¿eh? X más 1 y en realidad cualquiera alpha por X más 1, o sea lo que pasa que les acole alpha inmediatamente,",
        "start": 2212.8,
        "end": 2225.8
    },
    {
        "text": " porque el máximo como un divisor en los polinomios se toma de todos los polinomios que divide en ambos, el que tiene coeficiente mayor 1,",
        "start": 2226.8,
        "end": 2235.8
    },
    {
        "text": " se llama el mónico, por eso el compañero dijo X más 1, pero si ponían 12X más 1, 2 por X más 1 y también está bien, porque el 2 por X más 1 divide a los dos,",
        "start": 2236.8,
        "end": 2247.8
    },
    {
        "text": " porque el X más 1 rápidamente lo vió porque divisor de este y es divisor de este, ¿ok? entonces el máximo con un divisor es X más 1,",
        "start": 2248.8,
        "end": 2256.8
    },
    {
        "text": " si subir a puesto los divisores de ambos, los divisores de ambos, justamente cualquier alpha, el conjunto de los polinomios de la forma alpha por X más 1 con alpha n,",
        "start": 2256.8,
        "end": 2276.8
    },
    {
        "text": " sin que sea 0, ¿no? porque si no me queda el polino menor,",
        "start": 2278.8,
        "end": 2281.8
    },
    {
        "text": " y se toma el mónico como el máximo como un divisor, ¿qué o claro, URICES? por supuesto, esto también lo podríamos haber hecho por división,",
        "start": 2282.8,
        "end": 2294.8
    },
    {
        "text": " lo hago inmediatamente, X cuadrado más 2X más 1 dividido, X cuadrado menos 1, pongo 1 menos X cuadrado menos 1, resto,",
        "start": 2296.8,
        "end": 2310.8
    },
    {
        "text": " se van a ser X cuadrado, me queda 2X menos 1, ojo menos 1 más 2, entonces resto 2X más 2, fíjense que no me dio a X más 1 si no 2X más 2, mejor, más lindo,",
        "start": 2311.8,
        "end": 2325.8
    },
    {
        "text": " este vendría a ser el divisor común de ambos que te detecta el máximo con un divisor, lo único que tiene que hacer es 2 de factor común y quedarte con el mónico,",
        "start": 2326.8,
        "end": 2336.8
    },
    {
        "text": " muy bien, dudas hasta acá, porque ahora me voy cuando polinomios cualquiera, los ni, no, vos serás, ¿facundo?",
        "start": 2337.8,
        "end": 2348.8
    },
    {
        "text": " sí, porque acá yo ya saqué que la raíces 15 y uno puede ver rápidamente que 15 no es raíces, claro, entonces no hay ningún polino, me degrado o uno que divide,",
        "start": 2353.8,
        "end": 2364.8
    },
    {
        "text": " porque tenían que compartir una raíces, porque 15 al cuadrado por 3 nunca va a dar uno, entonces ya saqué que 15 raíces ya habíamos cortado por ahí, ¿dícola?",
        "start": 2364.8,
        "end": 2376.8
    },
    {
        "text": " ¿Tú te di por qué el primer ejemplo se dice hasta encontrar el número y ahí pagaste el mismo polino en el plazo?",
        "start": 2377.8,
        "end": 2384.8
    },
    {
        "text": " no, claro, ¿por qué hay que verlo? no se dice hasta un día o no",
        "start": 2385.8,
        "end": 2388.8
    },
    {
        "text": " bien, debería seguir, los X más 2, entonces que me queda menos un, no probo, un medio de X, ¿tabién?",
        "start": 2390.8,
        "end": 2404.8
    },
    {
        "text": " un medio de X sí, acá me queda X2 y vamos a separar un poquito, un medio de X por 2 me queda X, divido, digo resto, se va y me queda menos X, menos 1",
        "start": 2404.8,
        "end": 2422.8
    },
    {
        "text": " ¿cierto? bien, tener razón, tendría que haber dado un paso más ni cura, gracias, acá tengo otro resto y acá ya ven que uno es múltiplo de otro, o sea 12X más 2, dividido menos X menos 1 y menos 2 restosero",
        "start": 2423.8,
        "end": 2446.8
    },
    {
        "text": " el último resto y tinto cero, menos X menos 1, que también digamos es menos 1 por el mónico, sí tendría que haber dado un paso más, sólo que lo vi ahí ya me tente con el 2X más 2, gracias",
        "start": 2447.8,
        "end": 2463.8
    },
    {
        "text": " el máncio con mónico no puede ser lo que yo, no no se como preguntable, pero...",
        "start": 2463.8,
        "end": 2472.8
    },
    {
        "text": " ah, ¿por qué no lo que un polinomio como el ISO, como más sin polinomía? sí, quedó por el ménio y el otro máncio, que los quedó 674, todo lo real y todo",
        "start": 2472.8,
        "end": 2484.8
    },
    {
        "text": " sí, porque cuando llegaste al... acá el último, acá no tenías grado cero, ¿no? Tenías grado 1, acá llegaste grado cero, es claro, en realidad lo que pasa es que en este caso,",
        "start": 2484.8,
        "end": 2507.8
    },
    {
        "text": " vos podés seguir dividiendo y encontrar un resto de grado cero y ese sigue siendo un divisor común por el proceso de algoritmo de Ucrides, entonces en realidad los divisores son tienen que ser",
        "start": 2507.8,
        "end": 2522.8
    },
    {
        "text": " divisores 674, o sea todos los reales, en cambio acá cuando llegas a cero, el cero no es divisor común, tenéis que parar antes, o sea igual esto te lo detecta, dice, está bien, acá llegaste a un número, pero este cero no es divisor, quiere decir que este es el último divisor, este en común, sí.",
        "start": 2522.8,
        "end": 2544.8
    },
    {
        "text": " ¿Tienes esto de la razón del mundo? Otro ron más, los dejo en fin me van a matar, reententado con que tiene que ser, este me quedó por ahí, mucha chacho, muchas gracias, todavía tenían el mismo grado, muchas gracias, reententado con que me estaba dando lo que tenía que dar en paraba por ahí, sí,",
        "start": 2544.8,
        "end": 2573.8
    },
    {
        "text": " ya tengo que seguir, muchas gracias, acá es menos un medio, ¿no verdad? menos un medio, y acá te quedan entonces menos X, y menos un medio por 2, me queda bueno, menos 1, justo, y al restarme queda cero, ahí está, acá mismo me quedo el cero, gracias, y por lo tanto, bueno sería este, que en definitiva el lo mismo, ¿no?",
        "start": 2573.8,
        "end": 2598.8
    },
    {
        "text": " es 2 veces por aquí más sub, bueno, errores de cuentas, espero que no se embarucen con esos, pero es un ejemplo que traje ahora medio rápido para observar nada más como es el comportamiento, a veces te dan números, a veces te dan polinom, el camino podría ser la factorización, como dijo el compañero, pero a veces cuando te dan polinom me he de grado 7 y el otro grado 11, factorizarlo es muy difícil,",
        "start": 2598.8,
        "end": 2626.8
    },
    {
        "text": " creo que justamente encontrar la raíz de polinom, el grado 7 y 11, no hay técnicas en principio, allá por el 1670 se encontraron los de grado 4, de grado 5 y no todos, por supuesto no todos se pueden, con radicales, etcétera, esto es una teoría eso, demostrar que no todos se pueden, el grado 5, y pero bueno, también las cuentas para hacer el grado 4, ¿no?",
        "start": 2626.8,
        "end": 2655.8
    },
    {
        "text": " para hacer el grado 4 son larguísimas y complicadas, pero el grado 7, 11, etcétera, ¿cómo se hace? Bueno, están las aproximaciones, las métodas de aproximación, etcétera, pero en principio los que estáis en el gorismo deuclides no tenéis que hacer aquel proceso de factorización, que en los naturales, que en los enteros se hace muy fácilmente, en cierto sentido, tenéis entre 2, 3, buscar los prismos y más o menos la va llevando, ¿no?",
        "start": 2655.8,
        "end": 2681.8
    },
    {
        "text": " y en esas palabras últimas está justamente todo el truco de criptografía, a no ser que aparecan primos grandes, ahí está el gran truco de la criptografía, buscar primos grandes, por eso se pagan tanto los primos grandes, acá en polinomios directamente,",
        "start": 2681.8,
        "end": 2700.8
    },
    {
        "text": " en polinomios, lo que hacemos es el algoritmo de criptografía, derecho, vamos vamos dividiendo y dividiendo y dividiendo y el algoritmo es eficaz termina porque los grados son cada vez más chicos, los grados de los restos son cada vez más chicos, ¿no?",
        "start": 2700.8,
        "end": 2718.8
    },
    {
        "text": " entonces, más allá de los cerrocitos cuentan que pido disculpa voy a borrar este pizarron y ahora voy a plantear de vuelta, todo el algoritmo con 2 polinomios, este paso tiene como objetivo final la descripción delema de besut, que no le hicimos para la centera, y además se voy a aprovechar porque directamente voy a hacer con 2 polinomios, mexionamos pe 1 y pe 2, que después van a hacer los 2 polinomios que están adentro el teorema de llora, pe 1 y pe 2, ¿no?",
        "start": 2718.8,
        "end": 2746.8
    },
    {
        "text": " que van a formar parte del teorema yo, entonces si no hay más 2 acá agradezco las preguntas aquí si hayan para corregir lo que haremos hecho, nos vamos a lo mismo pero en forma teórica, entonces el objetivo es hacer el mismo buscar divisores en común, buscar el máximo común divisor de 2 polinomios pe 1 de x y pe 2 de x, ahora se ha lo escribo directamente en cualquier cuerpo, en cada x",
        "start": 2746.8,
        "end": 2774.8
    },
    {
        "text": " al tener un cuerpo sabemos dividir como si fueran los reales, como si fueran los racionales y el algoritmo división es el mismo, supongamos que el grado de pe 1 de x es mayor igual que el grado de pe 2 de x, simplemente para ordenar la división ya saben que si así no fuera lo primero que va a ser el algoritmo es cambiarlo del lugar, gastamos un paso más sin nada más",
        "start": 2774.8,
        "end": 2802.8
    },
    {
        "text": " entonces lo que te dice el algoritmo es dividir pe 1 de x, dividir pe 2 de x, te va a dar un cociante con 1 de x y un resto el re 1 de x",
        "start": 2802.8,
        "end": 2814.8
    },
    {
        "text": " si quieren lo agregamos esplicitamente para que nos quede bien claro el grado de re 1 de x va a ser menor que el grado, menor menor, del grado de pe 2 de x",
        "start": 2815.8,
        "end": 2836.8
    },
    {
        "text": " al re 1 lo voy a llamar pe 3, simplemente para que quede lo mismo en nombre, para que se repita en los nombres, o sea a re 1 de x lo llamo pe 3 de x y entonces el siguiente paso es dividir pe 2, dividir pe 3 de x",
        "start": 2837.8,
        "end": 2861.8
    },
    {
        "text": " vea un cociante con 2 de x y un resto el re 2 de x y agrego en azul porque soy muy denso que el grado de re 2 de x es menor que el grado de pe 3 de x que era el grado porque pe 3 es el re 1 de re 1 de x",
        "start": 2862.8,
        "end": 2888.8
    },
    {
        "text": " y esto continúa punto supensivo continúa hasta que sigo a que pe su n menos 1 de x está dividido en pe su n de x",
        "start": 2889.8,
        "end": 2905.8
    },
    {
        "text": " aquí pongo cu su n menos 1 de x vamos así pe su n dividido pe su n más 1 así que a más lindo dividir cu su n y re su n de x con el grado de re n de x",
        "start": 2906.8,
        "end": 2929.8
    },
    {
        "text": " menor que el grado de pe su n más 1 de x que era justamente 2, 2, 1, 1, n y acá es el grado de pe su n más 1, es el grado de re n menos 1",
        "start": 2929.8,
        "end": 2958.8
    },
    {
        "text": " de x que es menor que el grado de re n menos 2 de x menor que su pesivo que es grado de re 1 de x que es menor que el grado de pe 2",
        "start": 2959.8,
        "end": 2980.8
    },
    {
        "text": " ahí puse toda la cadena para que se vea esto que está en azul a la derecha abajo más o sea de que sea un poco aburridor pero quiero ser insistente",
        "start": 2981.8,
        "end": 2993.8
    },
    {
        "text": " es lo que me garantiza que el algoritmo de ukriz termina porque los grados",
        "start": 2993.8,
        "end": 3000.8
    },
    {
        "text": " todo esto lo que se llama el gorimo de ukriz no esto lo que me garantiza que el algoritmo de ukriz termina porque justamente el grado de pe 2 no sé cuanto a",
        "start": 3000.8,
        "end": 3019.8
    },
    {
        "text": " de pero es un número, creo que sé, todos son menores menores menores menores menores y este a la vez menor igual esto no es muy importante pero lo agrego por completitud",
        "start": 3019.8,
        "end": 3031.8
    },
    {
        "text": " no más entonces vos tenés pe 1, pe 2 es menor igual su grado, este es menor menor menor menor menor menor menor menor menor en algún momento",
        "start": 3031.8,
        "end": 3042.8
    },
    {
        "text": " en algún momento es que va a pasar, en el momento llegase a grado 0 o sea o llegase cuando llegase a grado 0 es porque llegaste a un número o llegaste a 0 directamente al número 0",
        "start": 3042.8,
        "end": 3057.8
    },
    {
        "text": " entonces vamos a suponer quien en ese momento llegamos a grado 0 para parar en algún lugar, entonces si este tiene grado 0",
        "start": 3058.8,
        "end": 3069.8
    },
    {
        "text": " hay posibilidades que tenga grado 0 y sea 0 o no sea 0, si el distinto de 0 o sea si no es el número 0 quiere decir, entonces este bueno",
        "start": 3070.8,
        "end": 3084.8
    },
    {
        "text": " vamos a poner acá, R su N de X supongamos que tiene grado 0, entonces ha ido posibilidades que R su N de X sea 0 o que R su N de X sea distinto de 0",
        "start": 3085.8,
        "end": 3102.8
    },
    {
        "text": " que son los dos ejemplos que nos dieron en el pizarro en el santerior no, entonces si R su N de X es 0 el último que era distinto de 0 era R su N menos 1 que es este que está acá",
        "start": 3103.8,
        "end": 3118.8
    },
    {
        "text": " se llamaba p su N más 1, entonces el máximo común divisor de p1 de X y p2 de X es p su N más 1 de X que es exactamente R su N menos, es el anterior, el resto anterior en este caso",
        "start": 3119.8,
        "end": 3139.8
    },
    {
        "text": " y si R su N de X es de grado 0 pero es distinto de 0, entonces el máximo común divisor va a ser L porque es un número, un número real",
        "start": 3140.8,
        "end": 3156.8
    },
    {
        "text": " o sea es una constante, no nula",
        "start": 3160.8,
        "end": 3164.8
    },
    {
        "text": " y entonces ese va a ser el máximo común divisor porque si cuando hagas un paso más de división te va a dar restoseros porque siempre se puede vivir exactamente entre un número",
        "start": 3169.8,
        "end": 3180.8
    },
    {
        "text": " entonces ha ido posibilidades en un momento ya ha salrado 0, te da 0, te da 0, si es grado 0 pero distinto de 0 es el máximo común divisor, es un número",
        "start": 3180.8,
        "end": 3190.8
    },
    {
        "text": " y si es un polinomio, si es directamente 0 entonces el anterior polinomio, el anterior resto es el máximo común divisor",
        "start": 3190.8,
        "end": 3199.8
    },
    {
        "text": " bien, ¿en qué está basado todo esto? ¿Por qué los escribo de nuevo? ¿Por qué lo necesito?",
        "start": 3199.8,
        "end": 3207.8
    },
    {
        "text": " Primero para reafirmarlo para todos, ¿en qué está basado en esto la conclusión final que ya le sienta bien natural porque lo vinimos trabajando desde hace rato?",
        "start": 3207.8,
        "end": 3219.8
    },
    {
        "text": " Pero lo voy a escribir en verde porque ¿en qué está basado esto? Y además porque lo necesito para el despeje de Besut",
        "start": 3219.8,
        "end": 3227.8
    },
    {
        "text": " ¿está basado en la otra forma de expresar? Bien, ¿os que cada división yo insiste y se puede escribir de esta manera o se puede escribir de la otra manera?",
        "start": 3227.8,
        "end": 3236.8
    },
    {
        "text": " Voy a escribirla de la otra manera abajo o sea como ya tengo lo de los grados, yo no me falta de una parte",
        "start": 3236.8,
        "end": 3243.8
    },
    {
        "text": " que p1dx es p2dx por q1dx más r1dx y acá que p2dx es p3dx por q2dx más r2dx y lo de los grados que ya estaban azul",
        "start": 3243.8,
        "end": 3264.8
    },
    {
        "text": " y así sigo el último que pndx es pnm1dx por q1dx más r2dx y lo de los grados que ya está puesto",
        "start": 3264.8,
        "end": 3281.8
    },
    {
        "text": " Excelente, ahora bien ¿por qué insisto que se basa en eso? Por aquel truco de que los divisores",
        "start": 3282.8,
        "end": 3291.8
    },
    {
        "text": " vienen el pizarro de p1 y p2 terminan siendo los divisores de p2dx y r1dx y como se hace eso profe de la misma manera",
        "start": 3291.8,
        "end": 3300.8
    },
    {
        "text": " los divisores de p2 y r1 terminan siendo divisores de p1 y si pasas este restando como mi dijeron hoy con los números",
        "start": 3301.8,
        "end": 3312.8
    },
    {
        "text": " los divisores de p1 y p2 son los divisores de r1, es el mismo truco que hicimos hoy para números",
        "start": 3312.8,
        "end": 3319.8
    },
    {
        "text": " los divisores de p3 y r2 son los divisores de p2",
        "start": 3319.8,
        "end": 3326.8
    },
    {
        "text": " pasas restando este bloque para cáis los divisores de p2 y p3 son los divisores de r2",
        "start": 3326.8,
        "end": 3331.8
    },
    {
        "text": " entonces te vas trasladando el conjunto de divisores hasta el final y en eso está basado esta conclusión",
        "start": 3331.8,
        "end": 3338.8
    },
    {
        "text": " y en eso está basado esta conclusión y en eso está basado todo el algoritmo de Euclides",
        "start": 3338.8,
        "end": 3346.8
    },
    {
        "text": " ahora lo que yo escribí en verde no es solamente para machacar y entender por qué el algoritmo de Euclides funciona",
        "start": 3347.8,
        "end": 3355.8
    },
    {
        "text": " sino porque ahora voy a dar el paso de sultz, el paso de sultz lo que va a hacer es mostrar que el máximo común divisor",
        "start": 3355.8,
        "end": 3364.8
    },
    {
        "text": " y esto es casi mágico que ese último máximo común divisor a pesar de que hagas 75 divisiones",
        "start": 3364.8,
        "end": 3373.8
    },
    {
        "text": " termina siendo una combinación lineal de p1 y p2",
        "start": 3374.8,
        "end": 3378.8
    },
    {
        "text": " combinación lineal es con que fiscientes en los polinomios disculpen, no tan linear",
        "start": 3378.8,
        "end": 3385.8
    },
    {
        "text": " termina siendo una expresión",
        "start": 3385.8,
        "end": 3389.8
    },
    {
        "text": " p1 por un polinomio más p2 por otro polinomio es igual al máximo común divisor",
        "start": 3390.8,
        "end": 3397.8
    },
    {
        "text": " y como si hace eso simplemente despejando, mire",
        "start": 3397.8,
        "end": 3404.8
    },
    {
        "text": " acá el r1 lo puedo despejar en función de estos dos",
        "start": 3404.8,
        "end": 3408.8
    },
    {
        "text": " entonces r1 de x es igual a p1 de x menos q1 de x por p2 de x",
        "start": 3408.8,
        "end": 3418.8
    },
    {
        "text": " cierto",
        "start": 3418.8,
        "end": 3421.8
    },
    {
        "text": " o sea que si yo hubiera terminado acá con r1",
        "start": 3421.8,
        "end": 3424.8
    },
    {
        "text": " si este fuera el máximo común divisor que de aclaro que es combinación de p1 y p2 multiplicado por polinomios",
        "start": 3424.8,
        "end": 3430.8
    },
    {
        "text": " q1 y un número que es el 1",
        "start": 3430.8,
        "end": 3433.8
    },
    {
        "text": " pero capaz que no hay que seguir un paso más",
        "start": 3433.8,
        "end": 3436.8
    },
    {
        "text": " entonces venimos acá, recuerden que r1 es p3, es un brise, recuerden que r1 es p3",
        "start": 3436.8,
        "end": 3443.8
    },
    {
        "text": " y entonces supongamos que terminamos acá en r2",
        "start": 3443.8,
        "end": 3447.8
    },
    {
        "text": " ¿Qué pasa? r2 de x, hago más chiquito porque necesito más espacio",
        "start": 3447.8,
        "end": 3452.8
    },
    {
        "text": " es p2 de x menos p3 de x por q2 de x",
        "start": 3452.8,
        "end": 3459.8
    },
    {
        "text": " cierto, pero el p3 es r1 y en vez de poner r1",
        "start": 3459.8,
        "end": 3466.8
    },
    {
        "text": " o sea en vez de poner p3",
        "start": 3466.8,
        "end": 3468.8
    },
    {
        "text": " incluso toda esta combinación al niña al acá dentro",
        "start": 3468.8,
        "end": 3472.8
    },
    {
        "text": " y entonces me queda p2 de x menos p3 que es r1",
        "start": 3472.8,
        "end": 3478.8
    },
    {
        "text": " lo meto todo esto adentro",
        "start": 3478.8,
        "end": 3481.8
    },
    {
        "text": " entonces me queda menos p1 de x menos",
        "start": 3481.8,
        "end": 3487.8
    },
    {
        "text": " q1 de x por p2 de x",
        "start": 3487.8,
        "end": 3493.8
    },
    {
        "text": " todo esto por q2 de x",
        "start": 3493.8,
        "end": 3497.8
    },
    {
        "text": " ¿Está bien?",
        "start": 3497.8,
        "end": 3500.8
    },
    {
        "text": " y si la gente de openfing puede captar este reglón acá abajo",
        "start": 3502.8,
        "end": 3509.8
    },
    {
        "text": " lo que voy a hacer ahora es hago el producto y pongo todo lo que tiene p2 por un lado o lo que tiene p1 por otro",
        "start": 3509.8,
        "end": 3524.8
    },
    {
        "text": " lo hago ahora el primero queda p2 de x menos",
        "start": 3524.8,
        "end": 3529.8
    },
    {
        "text": " p1 de x por q2 más q1 por q2 por p2",
        "start": 3529.8,
        "end": 3537.8
    },
    {
        "text": " todo lo que tiene p2 por un lado lo que tiene p1 por otro",
        "start": 3537.8,
        "end": 3541.8
    },
    {
        "text": " y entonces esto me queda",
        "start": 3541.8,
        "end": 3545.8
    },
    {
        "text": " esto es igual a menos q2 de x por p1 de x",
        "start": 3545.8,
        "end": 3553.8
    },
    {
        "text": " y después queda más 1 por p2 de x acá",
        "start": 3553.8,
        "end": 3563.8
    },
    {
        "text": " y que más me queda por p2 más q1 o q2",
        "start": 3563.8,
        "end": 3573.8
    },
    {
        "text": " por favor revisen las cuentas a ver si le sirve si se bien",
        "start": 3573.8,
        "end": 3579.8
    },
    {
        "text": " pero les marco un aranja",
        "start": 3580.8,
        "end": 3583.8
    },
    {
        "text": " el r1 de xp3 queda en función de p1 y de p2",
        "start": 3583.8,
        "end": 3590.8
    },
    {
        "text": " el r2 bueno que va a ser p4 también si esto sigue",
        "start": 3590.8,
        "end": 3596.8
    },
    {
        "text": " quedo en función de p1 y de p2",
        "start": 3596.8,
        "end": 3602.8
    },
    {
        "text": " y así cada paso",
        "start": 3602.8,
        "end": 3604.8
    },
    {
        "text": " y en cada paso de espejo en función",
        "start": 3604.8,
        "end": 3609.8
    },
    {
        "text": " bueno de espejo el resto y el resto lo escribo como lo tenía antes",
        "start": 3609.8,
        "end": 3614.8
    },
    {
        "text": " conclusión que dice a partir del algoritmo de ukulez viene el lemma de vesut",
        "start": 3614.8,
        "end": 3620.8
    },
    {
        "text": " la conclusión es que ese último resto",
        "start": 3624.8,
        "end": 3627.8
    },
    {
        "text": " viene que podría ser el rn de x su rn en el 1 de x",
        "start": 3628.8,
        "end": 3633.8
    },
    {
        "text": " y por eso sumamos que se resuene de x para no tener que escribirlo 2 veces",
        "start": 3633.8,
        "end": 3637.8
    },
    {
        "text": " también, sumamos que se resuene de x pero si fuera resuena ponga abajo",
        "start": 3637.8,
        "end": 3642.8
    },
    {
        "text": " si fuera resuena de x para guante y el lo mismo",
        "start": 3642.8,
        "end": 3645.8
    },
    {
        "text": " entonces qué es lo que te dice vesut?",
        "start": 3645.8,
        "end": 3647.8
    },
    {
        "text": " que el máximo común divisor de p1 de x y p2 de x que por el algoritmo de ukulez",
        "start": 3647.8,
        "end": 3654.8
    },
    {
        "text": " y acá vamos a probar",
        "start": 3654.8,
        "end": 3656.8
    },
    {
        "text": " que es el último resto, asumamos el segundo caso",
        "start": 3656.8,
        "end": 3659.8
    },
    {
        "text": " rn de x",
        "start": 3659.8,
        "end": 3662.8
    },
    {
        "text": " se puede escribir como alpha por x por p1 de x más beta por x por p2 de x",
        "start": 3662.8,
        "end": 3674.8
    },
    {
        "text": " despejando despejando despejando despejando",
        "start": 3674.8,
        "end": 3679.8
    },
    {
        "text": " o sea, a mí lo que me importa es que se puede escribir el máximo común divisor",
        "start": 3679.8,
        "end": 3683.8
    },
    {
        "text": " como una combinación disculpa en por un instante",
        "start": 3683.8,
        "end": 3686.8
    },
    {
        "text": " lineal, aunque no está lineal porque lo que fisciente no son en casi no en cada x",
        "start": 3686.8,
        "end": 3691.8
    },
    {
        "text": " este lema de vesut que también se ven discretado pero para los números centeros",
        "start": 3691.8,
        "end": 3700.8
    },
    {
        "text": " y se hace exactamente igual, se hace todo el algoritmo de división de números centeros",
        "start": 3700.8,
        "end": 3707.8
    },
    {
        "text": " y se va despejando de atrás hacia adelante",
        "start": 3707.8,
        "end": 3709.8
    },
    {
        "text": " o de adelante hacia atrás como hicimos nosotros, lo mismo",
        "start": 3709.8,
        "end": 3712.8
    },
    {
        "text": " va despejando, despejando, despejando hasta llegar a que todos se pueden escribir en función de los dos números iniciales",
        "start": 3712.8,
        "end": 3719.8
    },
    {
        "text": " acá de los dos polinomios iniciales",
        "start": 3719.8,
        "end": 3721.8
    },
    {
        "text": " está claro y es muy fuerte en muchos chachos porque en particular lo que está diciendo",
        "start": 3721.8,
        "end": 3729.8
    },
    {
        "text": " ojo que estos los polinomios tienen que tener coeficientes en positivos integrativos, está tome esclado ahí",
        "start": 3729.8,
        "end": 3735.8
    },
    {
        "text": " entonces las cosas empiezan a restarse entre sí y aliminarse",
        "start": 3735.8,
        "end": 3739.8
    },
    {
        "text": " porque en general este tiene grado mucho más chico que esto de acá",
        "start": 3739.8,
        "end": 3743.8
    },
    {
        "text": " y por qué como este que tiene grado más chico es combinación lineal, por lo que no amete por lo sin",
        "start": 3743.8,
        "end": 3749.8
    },
    {
        "text": " el inal, pero yo, porque este combinación es peún y peor",
        "start": 3749.8,
        "end": 3753.8
    },
    {
        "text": " y porque se va multiplicando y se va restando",
        "start": 3753.8,
        "end": 3756.8
    },
    {
        "text": " se va restando y queda justamente el resto",
        "start": 3756.8,
        "end": 3759.8
    },
    {
        "text": " lo que dice el lema de vesut es que la fuerza está en esto, existen",
        "start": 3759.8,
        "end": 3764.8
    },
    {
        "text": " alpha de x y beta de x en cada x",
        "start": 3765.8,
        "end": 3773.8
    },
    {
        "text": " tal que el máximo común divisor se creve esta manera, ahí está la fuerza de la marzo",
        "start": 3773.8,
        "end": 3780.8
    },
    {
        "text": " nosotros los demostramos, lo podría haber impuesto, bueno chachados sepan que existe púmulta",
        "start": 3780.8,
        "end": 3785.8
    },
    {
        "text": " no vamos a tener mayoros, no me interesa imponerles ningún resultado si ustedes lo pueden comprender",
        "start": 3785.8,
        "end": 3791.8
    },
    {
        "text": " sé que la clase de hoy se fue en matemática más de tipo secundaria",
        "start": 3792.8,
        "end": 3798.8
    },
    {
        "text": " pero bueno aprovechemos estos poco minutos que nos quedan",
        "start": 3802.8,
        "end": 3806.8
    },
    {
        "text": " para cerrar el objetivo en esto de polinomios, primero preguntándoles si tienen dudas",
        "start": 3806.8,
        "end": 3812.8
    },
    {
        "text": " consultas, dudas de todo lo que hicimos hasta ahora",
        "start": 3812.8,
        "end": 3816.8
    },
    {
        "text": " dale",
        "start": 3817.8,
        "end": 3819.8
    },
    {
        "text": " o sea si alpha de x y beta de x son de su cualquier polinomio",
        "start": 3819.8,
        "end": 3826.8
    },
    {
        "text": " saber que existe, no sabe por eso, pero daba saber que existen",
        "start": 3826.8,
        "end": 3830.8
    },
    {
        "text": " porque lo podéis llegar a desarmar con tu el proceso",
        "start": 3830.8,
        "end": 3833.8
    },
    {
        "text": " una compul va a ser el toque, nosotros te haremos horas y meses",
        "start": 3833.8,
        "end": 3837.8
    },
    {
        "text": " o sea es que va a ser, no me siento bien pero siento bien",
        "start": 3837.8,
        "end": 3841.8
    },
    {
        "text": " si me ha tenido un impedor, bueno o sea no parece tan difícil",
        "start": 3842.8,
        "end": 3848.8
    },
    {
        "text": " haría llorar el fibeta para que no pede",
        "start": 3848.8,
        "end": 3851.8
    },
    {
        "text": " el máximo condicior pero es que el proceso conocido es todo este proceso de algoritmo de uklides",
        "start": 3851.8,
        "end": 3855.8
    },
    {
        "text": " para llegar hasta el final y empieza a despejar hasta encontrarlo",
        "start": 3855.8,
        "end": 3859.8
    },
    {
        "text": " es el proceso conocido",
        "start": 3859.8,
        "end": 3862.8
    },
    {
        "text": " otro algoritmo que se hace pero ya este computacional es",
        "start": 3862.8,
        "end": 3868.8
    },
    {
        "text": " no sé cuán eficaces, tenerlo de polinomios",
        "start": 3868.8,
        "end": 3872.8
    },
    {
        "text": " empezás a multiplicar por polinomios al azar y quiero que querés",
        "start": 3872.8,
        "end": 3876.8
    },
    {
        "text": " encontrar de todos los resultados el menor de lo posible",
        "start": 3876.8,
        "end": 3880.8
    },
    {
        "text": " porque es que va a pasar, si vos sabes que este tipo es el menor de lo posible",
        "start": 3880.8,
        "end": 3885.8
    },
    {
        "text": " dentro de todos estos",
        "start": 3885.8,
        "end": 3888.8
    },
    {
        "text": " porque ese será el resto, entonces empezar a multiplicar",
        "start": 3888.8,
        "end": 3891.8
    },
    {
        "text": " ¿cuán seguro estás que es el que encontraste después de un tiempo finito",
        "start": 3892.8,
        "end": 3896.8
    },
    {
        "text": " es? bueno porque se supone que lo que tenemos a aplicar por polinomios de grado",
        "start": 3896.8,
        "end": 3900.8
    },
    {
        "text": " 7000 cosas así, no verdad? porque por esto lo hace uno",
        "start": 3900.8,
        "end": 3905.8
    },
    {
        "text": " bueno, ahí está la cosa, este proceso de garantiza que lo encontrás",
        "start": 3905.8,
        "end": 3910.8
    },
    {
        "text": " y después lo desarmadas va a pasarlo, desarmadas y lo encontraste",
        "start": 3910.8,
        "end": 3913.8
    },
    {
        "text": " para nosotros es complicado, hay que remar, hacer división,",
        "start": 3913.8,
        "end": 3916.8
    },
    {
        "text": " y uno se pierde mucho en estas cuentas, ¿sacapa?",
        "start": 3917.8,
        "end": 3920.8
    },
    {
        "text": " ¿cómo despejo acá? cuando tenés dos polinomios claritos,",
        "start": 3920.8,
        "end": 3923.8
    },
    {
        "text": " así como en el ejemplo, aunque sea uno de grado 11 o otro de grado 5",
        "start": 3923.8,
        "end": 3927.8
    },
    {
        "text": " los tenés ahí identificado es más fácil despejando",
        "start": 3927.8,
        "end": 3930.8
    },
    {
        "text": " porque siempre es en función de ellos dos",
        "start": 3930.8,
        "end": 3933.8
    },
    {
        "text": " pero es muy fuerte el resultado del final, muy fuerte",
        "start": 3934.8,
        "end": 3938.8
    },
    {
        "text": " porque muchas veces pasa que el máximo común divisor",
        "start": 3938.8,
        "end": 3942.8
    },
    {
        "text": " es un número, un número real",
        "start": 3942.8,
        "end": 3944.8
    },
    {
        "text": " y esto se está diciendo que al FB te existe en tal manera que te da número real",
        "start": 3945.8,
        "end": 3949.8
    },
    {
        "text": " no se podría saber el máximo grado de al FB",
        "start": 3950.8,
        "end": 3954.8
    },
    {
        "text": " por el grado de 1, de 2 por el 3, son de 1, de 1, de 1, de 1, de 1 y entonces",
        "start": 3954.8,
        "end": 3961.8
    },
    {
        "text": " ojo, al FB te no son únicos, al FB te no son únicos, mira",
        "start": 3961.8,
        "end": 3965.8
    },
    {
        "text": " si existen al FB te ha dado una cuenta rápida, yo digo que al FADX",
        "start": 3966.8,
        "end": 3972.8
    },
    {
        "text": " más P2 de X también sirve porque multiplicado por P1 de X",
        "start": 3972.8,
        "end": 3979.8
    },
    {
        "text": " y acá le pongo beta de X menos P1 de X por P2 de X",
        "start": 3980.8,
        "end": 3986.8
    },
    {
        "text": " fijate, ¿cuándo te da esta cuenta?",
        "start": 3987.8,
        "end": 3989.8
    },
    {
        "text": " Hace la rapida en el aire te ha dado mismo",
        "start": 3990.8,
        "end": 3993.8
    },
    {
        "text": " entonces ¿qué pasa? no son únicos",
        "start": 3994.8,
        "end": 3997.8
    },
    {
        "text": " ese al FB está no son únicos",
        "start": 3997.8,
        "end": 4000.8
    },
    {
        "text": " existen, pero mira acá la cuenta es de lo mismo",
        "start": 4000.8,
        "end": 4003.8
    },
    {
        "text": " al final porque se van, ¿no verdad?",
        "start": 4003.8,
        "end": 4005.8
    },
    {
        "text": " entonces este puede jugar el rol de Alpha y este puede jugar el rol de beta",
        "start": 4005.8,
        "end": 4008.8
    },
    {
        "text": " no son únicos pero existen y eso es muy fuerte",
        "start": 4009.8,
        "end": 4012.8
    },
    {
        "text": " incluso en todo lo que necesitamos para el TNM de XOR",
        "start": 4012.8,
        "end": 4015.8
    },
    {
        "text": " un detalle más",
        "start": 4016.8,
        "end": 4018.8
    },
    {
        "text": " y esto apunta ya directamente a nuestro TNM de XOR",
        "start": 4019.8,
        "end": 4024.8
    },
    {
        "text": " pero en este espacio",
        "start": 4024.8,
        "end": 4025.8
    },
    {
        "text": " supongamos que tenemos P1 de X y P2 de X",
        "start": 4025.8,
        "end": 4029.8
    },
    {
        "text": " 2 polinomios que le voy a hacer el máximo común división",
        "start": 4030.8,
        "end": 4032.8
    },
    {
        "text": " y además sabemos que no tienen raíces comunes",
        "start": 4032.8,
        "end": 4035.8
    },
    {
        "text": " por alguna razón sabemos que no tiene raíces comunes",
        "start": 4042.8,
        "end": 4044.8
    },
    {
        "text": " entonces ¿qué me dice el lema de Besut?",
        "start": 4046.8,
        "end": 4049.8
    },
    {
        "text": " ¿qué me explica en este caso? ¿qué dice el lema de Besut?",
        "start": 4049.8,
        "end": 4052.8
    },
    {
        "text": " ¿cómo se expresa el lema de Besut en ese caso?",
        "start": 4052.8,
        "end": 4054.8
    },
    {
        "text": " ¿o cuál es la conclusión en la que se llega?",
        "start": 4056.8,
        "end": 4058.8
    },
    {
        "text": " diría lema de Besut existe en Alpha de X",
        "start": 4061.8,
        "end": 4064.8
    },
    {
        "text": " y beta de X",
        "start": 4064.8,
        "end": 4066.8
    },
    {
        "text": " 2 polinomios",
        "start": 4066.8,
        "end": 4068.8
    },
    {
        "text": " ¿cáles qué?",
        "start": 4069.8,
        "end": 4070.8
    },
    {
        "text": " Alpha de X",
        "start": 4073.8,
        "end": 4075.8
    },
    {
        "text": " por P1 de X",
        "start": 4075.8,
        "end": 4077.8
    },
    {
        "text": " más beta de X",
        "start": 4077.8,
        "end": 4079.8
    },
    {
        "text": " por P2 de X",
        "start": 4079.8,
        "end": 4080.8
    },
    {
        "text": " es igual a cuanto",
        "start": 4080.8,
        "end": 4081.8
    },
    {
        "text": " exactamente a una constante excelente",
        "start": 4084.8,
        "end": 4087.8
    },
    {
        "text": " que no es 0 además",
        "start": 4088.8,
        "end": 4090.8
    },
    {
        "text": " porque si no tendrían raíces... bueno",
        "start": 4090.8,
        "end": 4093.8
    },
    {
        "text": " a una constante que no es 0",
        "start": 4094.8,
        "end": 4096.8
    },
    {
        "text": " exactamente",
        "start": 4096.8,
        "end": 4097.8
    },
    {
        "text": " vamos a llamarla",
        "start": 4097.8,
        "end": 4099.8
    },
    {
        "text": " como la podemos llamar R",
        "start": 4099.8,
        "end": 4101.8
    },
    {
        "text": " porque en general ese último resto",
        "start": 4101.8,
        "end": 4103.8
    },
    {
        "text": " así que vamos a llamar R la constante",
        "start": 4103.8,
        "end": 4105.8
    },
    {
        "text": " una constante quiere decir",
        "start": 4106.8,
        "end": 4108.8
    },
    {
        "text": " un número en C",
        "start": 4109.8,
        "end": 4111.8
    },
    {
        "text": " y porque es una constante",
        "start": 4112.8,
        "end": 4114.8
    },
    {
        "text": " y no es un polinomio",
        "start": 4114.8,
        "end": 4115.8
    },
    {
        "text": " cuando un grado 1, grado 2 o 3",
        "start": 4115.8,
        "end": 4117.8
    },
    {
        "text": " porque no tiene raíces en común",
        "start": 4118.8,
        "end": 4119.8
    },
    {
        "text": " porque ese polinomio",
        "start": 4119.8,
        "end": 4120.8
    },
    {
        "text": " si fuera un polinomio de grado",
        "start": 4120.8,
        "end": 4121.8
    },
    {
        "text": " mayor igual que 1",
        "start": 4121.8,
        "end": 4123.8
    },
    {
        "text": " toda su raíz se señal raíces",
        "start": 4123.8,
        "end": 4124.8
    },
    {
        "text": " en común de los otros 2",
        "start": 4124.8,
        "end": 4126.8
    },
    {
        "text": " se entiende?",
        "start": 4127.8,
        "end": 4128.8
    },
    {
        "text": " y ahí está la clave",
        "start": 4128.8,
        "end": 4130.8
    },
    {
        "text": " de la demostración del terema de Jordán",
        "start": 4130.8,
        "end": 4132.8
    },
    {
        "text": " en eso que estamos diciendo ahí",
        "start": 4132.8,
        "end": 4134.8
    },
    {
        "text": " una pregunta más",
        "start": 4134.8,
        "end": 4136.8
    },
    {
        "text": " y nos vamos... me voy feliz",
        "start": 4136.8,
        "end": 4137.8
    },
    {
        "text": " si me la contestan bien",
        "start": 4137.8,
        "end": 4139.8
    },
    {
        "text": " acá",
        "start": 4139.8,
        "end": 4141.8
    },
    {
        "text": " lo que me dijeron está muy bien",
        "start": 4141.8,
        "end": 4143.8
    },
    {
        "text": " está muy bien",
        "start": 4144.8,
        "end": 4145.8
    },
    {
        "text": " en estas clases que estamos trabajando",
        "start": 4145.8,
        "end": 4147.8
    },
    {
        "text": " pero estamos usando algo muy importante",
        "start": 4149.8,
        "end": 4151.8
    },
    {
        "text": " para ese razonamiento que me hicieron recién",
        "start": 4155.8,
        "end": 4157.8
    },
    {
        "text": " todos estos están bien",
        "start": 4157.8,
        "end": 4159.8
    },
    {
        "text": " pero ahí una hipótesis central",
        "start": 4159.8,
        "end": 4161.8
    },
    {
        "text": " si no lo podríamos hacer",
        "start": 4161.8,
        "end": 4162.8
    },
    {
        "text": " sí que el casa es que daicamente es raro",
        "start": 4162.8,
        "end": 4167.8
    },
    {
        "text": " porque si hay 2 polinomios",
        "start": 4167.8,
        "end": 4169.8
    },
    {
        "text": " que no tienen raíces en común",
        "start": 4169.8,
        "end": 4171.8
    },
    {
        "text": " porque no tienen raíces",
        "start": 4172.8,
        "end": 4174.8
    },
    {
        "text": " equicuadrado más 1",
        "start": 4174.8,
        "end": 4175.8
    },
    {
        "text": " y otro hecho que es",
        "start": 4175.8,
        "end": 4176.8
    },
    {
        "text": " 2 equicuadrado más 2",
        "start": 4176.8,
        "end": 4178.8
    },
    {
        "text": " para hacerlo burdo el ejemplo",
        "start": 4178.8,
        "end": 4180.8
    },
    {
        "text": " no?",
        "start": 4180.8,
        "end": 4181.8
    },
    {
        "text": " no tiene raíces en común",
        "start": 4181.8,
        "end": 4183.8
    },
    {
        "text": " porque no tiene raíces en los reales",
        "start": 4183.8,
        "end": 4185.8
    },
    {
        "text": " el argumento final estaba mal",
        "start": 4186.8,
        "end": 4188.8
    },
    {
        "text": " porque el máximo común divisor de equicuadrado más 1",
        "start": 4188.8,
        "end": 4190.8
    },
    {
        "text": " y 2 equicuadrado más 2",
        "start": 4190.8,
        "end": 4192.8
    },
    {
        "text": " es equicuadrado más 1",
        "start": 4192.8,
        "end": 4194.8
    },
    {
        "text": " y no es una constante",
        "start": 4194.8,
        "end": 4196.8
    },
    {
        "text": " o sea que es fundamental",
        "start": 4196.8,
        "end": 4197.8
    },
    {
        "text": " en el razonamiento que me hicieron recién",
        "start": 4197.8,
        "end": 4199.8
    },
    {
        "text": " que el cuerpo es algeorraicamente cerrado",
        "start": 4200.8,
        "end": 4202.8
    },
    {
        "text": " que tenés todas las raíces",
        "start": 4202.8,
        "end": 4204.8
    },
    {
        "text": " y me voy feliz",
        "start": 4204.8,
        "end": 4205.8
    },
    {
        "text": " de poner y observar que en este razonamiento",
        "start": 4206.8,
        "end": 4210.8
    },
    {
        "text": " usamos ese hipótesis",
        "start": 4210.8,
        "end": 4212.8
    },
    {
        "text": " y el ejemplo es",
        "start": 4212.8,
        "end": 4214.8
    },
    {
        "text": " equicuadrado más 1 y 2 equicuadrado más 2",
        "start": 4214.8,
        "end": 4217.8
    },
    {
        "text": " en los reales",
        "start": 4217.8,
        "end": 4218.8
    },
    {
        "text": " no tiene raíces en común",
        "start": 4218.8,
        "end": 4220.8
    },
    {
        "text": " porque no tiene raíces en ningún lado",
        "start": 4220.8,
        "end": 4222.8
    },
    {
        "text": " y sin embargo el máximo común divisor",
        "start": 4222.8,
        "end": 4224.8
    },
    {
        "text": " no sería un número",
        "start": 4224.8,
        "end": 4225.8
    },
    {
        "text": " quedó claro",
        "start": 4226.8,
        "end": 4227.8
    },
    {
        "text": " es lo que queremos mucho en los reales",
        "start": 4227.8,
        "end": 4230.8
    },
    {
        "text": " calculo 1, calculo 3",
        "start": 4230.8,
        "end": 4232.8
    },
    {
        "text": " pero viene que se comporta bastante mal",
        "start": 4232.8,
        "end": 4234.8
    },
    {
        "text": " a veces lo real",
        "start": 4234.8,
        "end": 4235.8
    },
    {
        "text": " bueno",
        "start": 4237.8,
        "end": 4238.8
    },
    {
        "text": " nos quedan 5 minutos",
        "start": 4240.8,
        "end": 4242.8
    },
    {
        "text": " hoy fue una clase fácil",
        "start": 4242.8,
        "end": 4244.8
    },
    {
        "text": " pero dura el mismo tiempo",
        "start": 4244.8,
        "end": 4246.8
    },
    {
        "text": " el viernes arrancamos con el teorema de Sordan",
        "start": 4246.8,
        "end": 4250.8
    },
    {
        "text": " paso 1, paso 2, el paso 2",
        "start": 4250.8,
        "end": 4252.8
    },
    {
        "text": " está basado en todo esto",
        "start": 4252.8,
        "end": 4254.8
    },
    {
        "text": " paso 1 es algebral ni al paso 2",
        "start": 4255.8,
        "end": 4257.8
    },
    {
        "text": " está basado en todo esto",
        "start": 4257.8,
        "end": 4258.8
    },
    {
        "text": " paso 3 es algebral ni al de vuelta",
        "start": 4258.8,
        "end": 4260.8
    },
    {
        "text": " esta",
        "start": 4261.8,
        "end": 4263.8
    },
    {
        "text": " el lema de Besut va a ser esencial",
        "start": 4263.8,
        "end": 4265.8
    },
    {
        "text": " y el caso del teorema de Sordan",
        "start": 4266.8,
        "end": 4268.8
    },
    {
        "text": " si le en el libro",
        "start": 4268.8,
        "end": 4269.8
    },
    {
        "text": " los dos polinomios",
        "start": 4270.8,
        "end": 4271.8
    },
    {
        "text": " no tienen raíces en común",
        "start": 4271.8,
        "end": 4272.8
    },
    {
        "text": " los que vamos a usar",
        "start": 4272.8,
        "end": 4273.8
    },
    {
        "text": " en la demostración",
        "start": 4273.8,
        "end": 4274.8
    },
    {
        "text": " no tienen raíces en común",
        "start": 4274.8,
        "end": 4275.8
    },
    {
        "text": " o sea que vamos a usar esta conclusión",
        "start": 4275.8,
        "end": 4278.8
    },
    {
        "text": " claro",
        "start": 4278.8,
        "end": 4279.8
    },
    {
        "text": " en particular",
        "start": 4280.8,
        "end": 4281.8
    },
    {
        "text": " me permiten borrar una cosa",
        "start": 4281.8,
        "end": 4283.8
    },
    {
        "text": " y cambiarlo",
        "start": 4283.8,
        "end": 4284.8
    },
    {
        "text": " pero a usted no dijo que los polinomios",
        "start": 4284.8,
        "end": 4285.8
    },
    {
        "text": " tenía que ser mónicos",
        "start": 4285.8,
        "end": 4287.8
    },
    {
        "text": " entonces",
        "start": 4288.8,
        "end": 4290.8
    },
    {
        "text": " más que R",
        "start": 4290.8,
        "end": 4291.8
    },
    {
        "text": " 1, ¿no?",
        "start": 4291.8,
        "end": 4292.8
    },
    {
        "text": " por máximo como un divisor",
        "start": 4293.8,
        "end": 4294.8
    },
    {
        "text": " se entiende que tiene que ser mónico",
        "start": 4294.8,
        "end": 4296.8
    },
    {
        "text": " eso se asume así",
        "start": 4296.8,
        "end": 4298.8
    },
    {
        "text": " se define así que el máximo que un divisor",
        "start": 4299.8,
        "end": 4301.8
    },
    {
        "text": " es el que",
        "start": 4302.8,
        "end": 4303.8
    },
    {
        "text": " también cualquier de recibe",
        "start": 4303.8,
        "end": 4304.8
    },
    {
        "text": " pero se dice que se tiene que ser el mónico",
        "start": 4304.8,
        "end": 4306.8
    },
    {
        "text": " entonces 1",
        "start": 4306.8,
        "end": 4307.8
    },
    {
        "text": " que o claro",
        "start": 4308.8,
        "end": 4309.8
    },
    {
        "text": " señores",
        "start": 4310.8,
        "end": 4311.8
    },
    {
        "text": " piaciere de estar con",
        "start": 4312.8,
        "end": 4314.8
    },
    {
        "text": " voy",
        "start": 4314.8,
        "end": 4315.8
    }
]