[
    {
        "text": " ¿Cuál es el primer impacto de esto yo que debido a la Sua de Befresio del Petróleo?",
        "start": 0.0,
        "end": 22.16
    },
    {
        "text": " En primer lugar, hay un aumento en la demanda de las materias primas, pero después",
        "start": 22.16,
        "end": 26.12
    },
    {
        "text": " la subida de precios hay una caída negativa en los volúmenes vendidos. Y después, otro",
        "start": 26.12,
        "end": 36.760000000000005
    },
    {
        "text": " fenómeno importante es la internacionalización financiera en América Latina.",
        "start": 36.760000000000005,
        "end": 50.400000000000006
    },
    {
        "text": " América Latina tiene un proceso importante en esta época con medidas de liberalización financiera",
        "start": 51.4,
        "end": 57.4
    },
    {
        "text": " que lo que buscaba en esas medidas era la tracción de capitales, pero a la vez es un",
        "start": 57.4,
        "end": 61.839999999999996
    },
    {
        "text": " aumento importante de los flujos de capitales internacionales en la famosa del",
        "start": 61.839999999999996,
        "end": 66.03999999999999
    },
    {
        "text": " entrada de los petrodólares en la región y lo que generan es un fuerte proceso de endeugamiento.",
        "start": 66.03999999999999,
        "end": 71.44
    },
    {
        "text": " El crecimiento en la región, si bien entre el 68 y el 74, fue relativamente bueno,",
        "start": 81.4,
        "end": 90.60000000000001
    },
    {
        "text": " de 6 y con 6, después ya empieza a bajar y entre el 74 y el 80 fue de 5,2, pero entre el 80 y el 89",
        "start": 90.60000000000001,
        "end": 107.92
    },
    {
        "text": " más o menos fue de 1 con 2. Solo que hoy veíamos.",
        "start": 107.92,
        "end": 112.68
    },
    {
        "text": " Financiera.",
        "start": 116.68,
        "end": 117.36
    },
    {
        "text": " América Latina.",
        "start": 119.36,
        "end": 120.04
    },
    {
        "text": " Gualta ahí. Y de otros fenómenes muy importantes es la inflación importada que",
        "start": 123.04,
        "end": 127.52000000000001
    },
    {
        "text": " socede por una mayor apertura externa.",
        "start": 127.52,
        "end": 130.79999999999998
    },
    {
        "text": " La década de los 80 fue la década que se llamó la década a perdida y de la crisis de la",
        "start": 138.07999999999998,
        "end": 142.51999999999998
    },
    {
        "text": " deuda porque se da con un conjunto de fenómenes. En primer lugar, década a perdida por la falta",
        "start": 142.51999999999998,
        "end": 147.51999999999998
    },
    {
        "text": " de crecimiento, uno con cuatro y negativo en términos per cápita.",
        "start": 147.51999999999998,
        "end": 151.68
    },
    {
        "text": " La década de la crisis de la deuda hubo, se caracteriza por un excesivo endeugamiento y",
        "start": 151.68,
        "end": 160.8
    },
    {
        "text": " ese excesivo endeugamiento está generado en la década anterior que comenzó a provocar salida",
        "start": 160.8,
        "end": 165.44
    },
    {
        "text": " de capitales cada vez más grandes, pago de intereses de deuda, un gran porcentaje del",
        "start": 165.44,
        "end": 169.96
    },
    {
        "text": " producto debía destinarse al pago de intereses de la deuda. Cuando las condiciones de los países",
        "start": 169.96,
        "end": 174.76000000000002
    },
    {
        "text": " centrales cambia, empiezan a aumentar las tasas de interés y entonces ese endeugamiento",
        "start": 174.76000000000002,
        "end": 181.64000000000001
    },
    {
        "text": " se hace cada vez más caro. Hay un aumento de los pago de deuda en la medida que algunos",
        "start": 181.64,
        "end": 186.6
    },
    {
        "text": " países que está en una situación compleja de falta de crecimiento no pueden cumplir",
        "start": 186.6,
        "end": 192.07999999999998
    },
    {
        "text": " con esas obligaciones, en caso más importante fue México que entró en default. Los",
        "start": 192.07999999999998,
        "end": 198.48
    },
    {
        "text": " acreedores perdieron la confianza en el resto y dejan de volcar a la región por ser considerado",
        "start": 198.48,
        "end": 204.56
    },
    {
        "text": " una región ríes gosta con incapacidad de pagar ese endeugamiento. Entonces, había tenido",
        "start": 204.56,
        "end": 214.4
    },
    {
        "text": " un relativo crecimiento via el ingreso de capitales, invía el endeugamiento que me permitía",
        "start": 214.4,
        "end": 219.2
    },
    {
        "text": " financiar ese déficit comercial, eso era más o menos en el 70 y ahora en el 80 cuando",
        "start": 219.2,
        "end": 226.72
    },
    {
        "text": " tengo dificultades para pagar la deuda quienes son los acreedores, cortan un poco el",
        "start": 226.72,
        "end": 233.4
    },
    {
        "text": " disfrujo de capitales. Hay una falta de financiamiento externo que se suma a esa característica",
        "start": 233.4,
        "end": 241.20000000000002
    },
    {
        "text": " de la falta de ahorro interno y que tiene un impacto negativo en la inversión y por lo tanto",
        "start": 241.20000000000002,
        "end": 246.64000000000001
    },
    {
        "text": " un impacto negativo en el producto. Es un círculo vicioso que no permite ninguna manera",
        "start": 246.64000000000001,
        "end": 254.56
    },
    {
        "text": " romper con esa situación de no crecimiento, de inflación, de dificultades a nivel del",
        "start": 254.56,
        "end": 261.08
    },
    {
        "text": " empleo y que está basado en la incapacidad de inversión y en la capacidad de disponar",
        "start": 261.08,
        "end": 267.15999999999997
    },
    {
        "text": " de recursos para invertir. La decisión de los acreedores externos de",
        "start": 267.15999999999997,
        "end": 279.0
    },
    {
        "text": " suspender el financiamiento voluntario y las rígides de los programas de ajuste impuestos",
        "start": 279.0,
        "end": 283.12
    },
    {
        "text": " por el Fondo Monetario Internacional obligan a los países latinoamericanos a basarse",
        "start": 283.12,
        "end": 289.24
    },
    {
        "text": " en el incremento de las exportaciones y en la reducción de las importaciones para",
        "start": 289.24,
        "end": 293.48
    },
    {
        "text": " financiar el endeudamiento con saldo favorables en la balanza comercial. Esto se tradujo",
        "start": 293.48,
        "end": 300.28000000000003
    },
    {
        "text": " en una drástica caída del coeficiente de importaciones de los niveles de invasión",
        "start": 300.28000000000003,
        "end": 304.72
    },
    {
        "text": " de consumo y el nivel de empleo. Entonces se configura en América Latina procesos",
        "start": 304.72,
        "end": 309.68
    },
    {
        "text": " desde industrialización y de rupturas de las cadenas productivas internas donde cae",
        "start": 309.68,
        "end": 315.48
    },
    {
        "text": " el peso de la industria como porcentaja del PBI. Esto fue un poco el proceso a nivel de",
        "start": 315.48,
        "end": 321.84000000000003
    },
    {
        "text": " la región. En algunos países se dan forma más asentuada y en otros países se dan",
        "start": 321.84000000000003,
        "end": 328.20000000000005
    },
    {
        "text": " forma menos asentuada. Los problemas que enfrenta a la región en los 80 influyen en",
        "start": 328.20000000000005,
        "end": 335.36
    },
    {
        "text": " el pensamiento económico dominante. Entonces, ¿qué empieza a cobrar importancia la solución",
        "start": 335.36,
        "end": 345.08000000000004
    },
    {
        "text": " de los primeros problemas macroeconómicos de corto plazo? O sea, necesito atender el crecimiento,",
        "start": 345.08,
        "end": 350.44
    },
    {
        "text": " necesito atender la inflación y el endeudamiento dejando del lado a que el debate de desarrollo",
        "start": 350.44,
        "end": 355.88
    },
    {
        "text": " de mediano plazo. Se acuerdan que el pensamiento de la cepal tenía esa lógica de buscar a",
        "start": 355.88,
        "end": 360.8
    },
    {
        "text": " mediano plazo el crecimiento via el desarrollo de determinados sectores. Ahora, los problemas",
        "start": 360.8,
        "end": 365.88
    },
    {
        "text": " a nivel macroeconómico de estabilización son los que están primando y necesariamente",
        "start": 365.88,
        "end": 371.03999999999996
    },
    {
        "text": " aquellos que el pensamiento económico más orientado hacia el combate de tratar de",
        "start": 371.04,
        "end": 376.40000000000003
    },
    {
        "text": " cortar la recessión, de cortar con la inflación y el endeudamiento son los que priman.",
        "start": 376.40000000000003,
        "end": 381.64000000000004
    },
    {
        "text": " Esa van a ser las prioridades dentro de las políticas. Afinas de los 80 y principios de",
        "start": 381.64000000000004,
        "end": 387.28000000000003
    },
    {
        "text": " las 90, las propuestas para superar los problemas de la década perdida surgen a partir de lo",
        "start": 387.28000000000003,
        "end": 392.28000000000003
    },
    {
        "text": " que se llamó el plan Brady, que lo que buscaba era cambiar la deuda de los países",
        "start": 392.28000000000003,
        "end": 397.0
    },
    {
        "text": " americanos por bonos en los que los capitales del sector privado podían invertir. Era una",
        "start": 397.0,
        "end": 403.36
    },
    {
        "text": " forma de restructurar la deuda estarda. Entonces, se ponían determinadas condicionantes a los países y se",
        "start": 403.36,
        "end": 411.48
    },
    {
        "text": " ponían condicionantes en términos de políticas de estabilización para poder hacer esas restructuras",
        "start": 411.48,
        "end": 416.48
    },
    {
        "text": " a nivel de la deuda de la deuda estarda. La sugerencia es el Fondo Monetario Internacional para",
        "start": 416.48,
        "end": 422.76
    },
    {
        "text": " salir de la crisis. Se basaron en un plan de reformas estructurales y esas reformas estructurales",
        "start": 422.76,
        "end": 430.32
    },
    {
        "text": " se basaban en algunos pilares que eran la mayor apertura económica y la mayor liberalización.",
        "start": 430.32,
        "end": 438.68
    },
    {
        "text": " A apertura económica y asignaron un rol importante a los mercados, una reducción del rol",
        "start": 438.68,
        "end": 446.03999999999996
    },
    {
        "text": " del Estado que se lo diagnosticaba como muy grande y muy inesficiente. Entonces, lo que se",
        "start": 446.04,
        "end": 455.6
    },
    {
        "text": " buscaban en este conjunto de reformas estructurales era planes de estabilización y planes de reformas",
        "start": 455.6,
        "end": 463.08000000000004
    },
    {
        "text": " de los estados para el chicamiento del cerro del Estado, donde hubiera mayor liberalización",
        "start": 463.08000000000004,
        "end": 467.0
    },
    {
        "text": " económica, comercial, financiera y dejar actuar a los mercados libremente y mayores políticas",
        "start": 467.0,
        "end": 474.48
    },
    {
        "text": " de flexibilización que incluían también al mercado laboral. Además, eran planes de estabilización",
        "start": 474.48,
        "end": 481.64000000000004
    },
    {
        "text": " para contener la inflación y que se basaban generalmente en el en el angla cambiaria en el",
        "start": 481.64000000000004,
        "end": 487.36
    },
    {
        "text": " tipo de cambio. En estos momentos surgen los tipos de cambio fijo, no, o por bandas de",
        "start": 487.36,
        "end": 494.16
    },
    {
        "text": " flotación como existía Uruguay, habían diferentes grados de de de de rigidez en el tipo",
        "start": 494.16,
        "end": 500.04
    },
    {
        "text": " de cambio. La década de los 90 llega con la implementación de lo que es el modelo",
        "start": 500.04,
        "end": 510.28000000000003
    },
    {
        "text": " neoliberal y el consistido de Washington que tuvo diferentes grados de aplicación, el",
        "start": 510.28000000000003,
        "end": 516.6
    },
    {
        "text": " modelo de los modelos más extremos fue el caso chileno, por ejemplo. Y el modelo neoliberal",
        "start": 516.6,
        "end": 523.72
    },
    {
        "text": " fue consecuencia de las tendencias mundiales, no, consistentes con proyectar sistemas",
        "start": 523.72,
        "end": 529.64
    },
    {
        "text": " productivos hacia el exterior como resultado de la quise pretelera de los años 70 de los",
        "start": 529.64,
        "end": 535.04
    },
    {
        "text": " países desarrollados. Y los décadas de los 80 sin haber dado",
        "start": 535.04,
        "end": 541.56
    },
    {
        "text": " soluciones, esos problemas que se habían generado los 70. Esta crisis coincide con el final",
        "start": 541.56,
        "end": 548.84
    },
    {
        "text": " definitivo del modelo sustitutivo de importaciones, ¿no? La apertura empieza los 70, la mayor",
        "start": 548.84,
        "end": 555.84
    },
    {
        "text": " flexibilización y liberalizaciones de capitales, de tasas de interés, de las aperturas regionales,",
        "start": 555.84,
        "end": 563.2800000000001
    },
    {
        "text": " los procesos de integración regional se dan en los en los años 70, las primeras tendencias.",
        "start": 563.2800000000001,
        "end": 570.2800000000001
    },
    {
        "text": " La globalización se convierte en una estrategia de salida de la crisis para las empresas",
        "start": 570.2800000000001,
        "end": 574.96
    },
    {
        "text": " transnacionales. Buscan otros, de realidad, desnacionales, no? Del centro que decidieron invertir",
        "start": 574.96,
        "end": 584.0
    },
    {
        "text": " sus capitales en las principales industrias en las economías perifericas.",
        "start": 584.0,
        "end": 587.68
    },
    {
        "text": " Sin embargo, esto provocó un fuerte endeudamiento externo de las economías latinoméricanas en",
        "start": 587.68,
        "end": 595.68
    },
    {
        "text": " los años siguientes, que las políticas o ortodoxas de los 80 no pudieron resolver.",
        "start": 595.68,
        "end": 602.2
    },
    {
        "text": " A los problemas inflacionarios se les sumó la desindustrialización, la caída de la inversión",
        "start": 602.2,
        "end": 611.56
    },
    {
        "text": " al convertirse en una región guiegosa con incapacidad de pago del endeudamiento, el",
        "start": 612.56,
        "end": 620.3599999999999
    },
    {
        "text": " estancamiento del producto y con eso una caída del consumo y las dificultades para el",
        "start": 620.3599999999999,
        "end": 628.28
    },
    {
        "text": " aumento de empleo y con unos caídas en los ingresos reales también. Si nosotros miramos",
        "start": 628.28,
        "end": 634.28
    },
    {
        "text": " las gráficas del salario real desde el 60, empiezan a caer en el salario real, cae.",
        "start": 634.28,
        "end": 640.16
    },
    {
        "text": " Recíen la recuperación del salario real se da a partir del 2005, donde a pesar de",
        "start": 640.16,
        "end": 650.0799999999999
    },
    {
        "text": " las mejoras de producto en los 90, el salario real no se recuperó.",
        "start": 650.0799999999999,
        "end": 653.3199999999999
    },
    {
        "text": " A la nueva estrategia que consistía en las medidas de política económica que abarcaban",
        "start": 653.3199999999999,
        "end": 660.9599999999999
    },
    {
        "text": " desde la disciplina fiscal hasta la librerización comercial y financiera se le denominó el consenso",
        "start": 660.9599999999999,
        "end": 666.12
    },
    {
        "text": " de Washington. En el consenso de Washington lo quedaba a decir a las directrices y básicamente",
        "start": 666.12,
        "end": 670.48
    },
    {
        "text": " venía con políticas fuertes de cortenio liberal, el modelo más de cortenio liberal y",
        "start": 670.48,
        "end": 676.0
    },
    {
        "text": " excruciente, que se basaba en la idea de liberalizar los mercados y que del crecimiento económico",
        "start": 676.0,
        "end": 683.24
    },
    {
        "text": " determinado sectores iba a dar derrame hacia la economía y va a generar beneficios",
        "start": 683.24,
        "end": 688.36
    },
    {
        "text": " en términos de empleo, de mejoras de ingresos y mejores de bienestar. Ese fue un poco",
        "start": 688.36,
        "end": 693.48
    },
    {
        "text": " de la política de los 90 y lo que tenía la lógica era que los mercados funcionaran",
        "start": 693.48,
        "end": 698.2
    },
    {
        "text": " libremente y que el Estado se retirara de aquellos espacios donde su actuaria inefica",
        "start": 698.2,
        "end": 704.88
    },
    {
        "text": " sin necesario. Y se dan también un fuerte proceso de privatizaciones en la región,",
        "start": 704.88,
        "end": 711.32
    },
    {
        "text": " Uruguay fue de los que menos tuvo procesos de privatización, pero hubo lugares donde",
        "start": 711.32,
        "end": 715.2
    },
    {
        "text": " las privatizaciones fueron muy fuertes el ejemplo de Argentina, es uno de los más cercanos",
        "start": 715.2,
        "end": 720.2
    },
    {
        "text": " que tenemos. Y que esos procesos de privatización, esos sistemas de estabilización basados en",
        "start": 720.2,
        "end": 727.96
    },
    {
        "text": " el ancla cambiaria generan los primeros momentos de ingresos de ingresos fiscales, pero después",
        "start": 727.96,
        "end": 734.0
    },
    {
        "text": " van a la baja. No sé si una piensa, por ejemplo, en lo que son las políticas de privatización,",
        "start": 734.0,
        "end": 738.44
    },
    {
        "text": " bueno, uno vende patrimonio del Estado, eso hace el ingreso de capitales, mejoran los",
        "start": 738.44,
        "end": 748.88
    },
    {
        "text": " ingresos del Estado, pero después no se siguen generando esas ingresas. No es una",
        "start": 748.88,
        "end": 754.96
    },
    {
        "text": " posición de a favor ni en contra, pero y después los sistemas de ancla cambiaria, como existieron",
        "start": 754.96,
        "end": 762.32
    },
    {
        "text": " en Uruguay, existieron en la región, con sistemas de cambios más fijo, nosotros teníamos",
        "start": 762.32,
        "end": 767.72
    },
    {
        "text": " un sistema de bandas de flotación que cayó con la evaluación del 2002 y pasamos a un",
        "start": 767.72,
        "end": 773.0
    },
    {
        "text": " sistema de flotación, que ahora es un sistema de flotación, se llama Asucia, porque",
        "start": 773.0,
        "end": 777.44
    },
    {
        "text": " es intervenido, al Banco Central, de alguna forma no quiere modificar el tipo de cambio",
        "start": 777.44,
        "end": 784.0400000000001
    },
    {
        "text": " largo plazo, pero sí en el corto plazo para mortiguar los efectos. Hasta hace poco se estaba",
        "start": 784.0400000000001,
        "end": 789.6400000000001
    },
    {
        "text": " tratando de que el tipo de cambio no subiera demasiado, que el dólar no subiera demasiado",
        "start": 789.6400000000001,
        "end": 793.48
    },
    {
        "text": " y ahora se está tratando de que no baja demasiado. Y hay las intervenciones a través de operaciones",
        "start": 793.48,
        "end": 801.36
    },
    {
        "text": " de corto plazo en el mercado cambiario tienen esa lógica. Los sistemas basados en el",
        "start": 801.36,
        "end": 810.8000000000001
    },
    {
        "text": " ancla cambiaria generan, primero años de crecimiento, pero después cánica y no abruptamente.",
        "start": 810.8000000000001,
        "end": 817.5600000000001
    },
    {
        "text": " Y lo que se da a cien las regiones es una tendencia fuerte a la concentración del ingreso.",
        "start": 817.5600000000001,
        "end": 821.52
    },
    {
        "text": " Nosotros lo vamos a dar más detalle a nuestro país, pero en Uruguay, a la de largo de",
        "start": 821.52,
        "end": 825.9200000000001
    },
    {
        "text": " la década del 90, nosotros tuvimos un período de crecimiento hasta el 95, después como",
        "start": 825.92,
        "end": 831.76
    },
    {
        "text": " un estancamiento, empezó a caer el producto en el 98, donde la devaluación de Brasil en el 98",
        "start": 831.76,
        "end": 836.56
    },
    {
        "text": " influyó durante todo el periodo hasta el 95 y una disminución de la pobreza, pero durante",
        "start": 836.56,
        "end": 842.92
    },
    {
        "text": " todo el periodo hay un proceso de concentración del ingreso. Desde el 95 en adelante la pobreza",
        "start": 842.92,
        "end": 851.48
    },
    {
        "text": " empieza a aumentar, empieza, hay un deterioro fuerte en términos del salario real y de las condiciones",
        "start": 851.48,
        "end": 857.6
    },
    {
        "text": " del mercado de trabajo y así llega la crisis del 2002 con una crisis social bastante fuerte,",
        "start": 857.6,
        "end": 862.5600000000001
    },
    {
        "text": " niveles de desempleo altísimos, ingresos salariales, salario real muy bajo, una salida fuerte,",
        "start": 862.5600000000001,
        "end": 871.64
    },
    {
        "text": " un proceso de inmigración importante, sobre todo en aquellos en la población activa y con",
        "start": 871.64,
        "end": 879.52
    },
    {
        "text": " los mayores potenciales de aporte en términos del mercado de trabajo y con niveles de pobreza",
        "start": 879.52,
        "end": 884.36
    },
    {
        "text": " que llegaron más del 30%. Nosotros estamos por debajo del 10, nosotros de Uruguay los vamos a",
        "start": 884.36,
        "end": 892.1999999999999
    },
    {
        "text": " ver bien en detalle, y ahora vamos a ver un poco los de América Latina. Bueno, ¿cuál es la idea central",
        "start": 892.1999999999999,
        "end": 901.3199999999999
    },
    {
        "text": " del modelo neoliberal? La idea central del modelo neoliberal era de alguna forma romper con lo que",
        "start": 901.3199999999999,
        "end": 908.56
    },
    {
        "text": " veníamos hasta ahora, de los 80. Era cuidar los equilibrios macroeconómicos, sobre todo la",
        "start": 908.56,
        "end": 915.06
    },
    {
        "text": " inflación y el déficit fiscal como principales preocupaciones, asignar un rol más importante al",
        "start": 915.06,
        "end": 922.0799999999999
    },
    {
        "text": " mercado y menos al Estado, disminuyendo las regulaciones en los casos en que fuera posible.",
        "start": 922.0799999999999,
        "end": 928.76
    },
    {
        "text": " Hay un documento del Banco Mundial del año 97 que está dedicado al rol del Estado y",
        "start": 930.5999999999999,
        "end": 936.88
    },
    {
        "text": " el Estado debe hacer aquello en lo que es eficiente y en el resto retirarse. Si vea ustedes,",
        "start": 936.88,
        "end": 943.48
    },
    {
        "text": " hoy leen algún documento que venga del Banco Mundial o de fondamentes, ya la visión es diferente,",
        "start": 943.48,
        "end": 948.64
    },
    {
        "text": " porque este modelo también se agotó y se vio que el modelo neoliberal en realidad no dio",
        "start": 948.64,
        "end": 954.6
    },
    {
        "text": " respuesta a los términos que se buscaba, o sea, la liberalización, en este momento se hablaba de",
        "start": 954.6,
        "end": 960.96
    },
    {
        "text": " la liberalización financiera como un proceso va a hacer un sistema financiero moderno. Hoy la idea",
        "start": 960.96,
        "end": 966.08
    },
    {
        "text": " que existe es totalmente diferente en los mercados financieros modernos son altamente regulados y",
        "start": 966.08,
        "end": 971.36
    },
    {
        "text": " nosotros tenemos un mercado financiero muy regulado. Entonces, asignarle un rol más importante al",
        "start": 971.36,
        "end": 981.76
    },
    {
        "text": " mercado y menos al Estado, hay fuertes procesos de reforma del Estado, disminuyendo las regulaciones",
        "start": 981.76,
        "end": 991.2800000000001
    },
    {
        "text": " en los casos que fuera posible, todo lo que el Estado no tiene, se sea intervenido, se aleja,",
        "start": 991.28,
        "end": 998.28
    },
    {
        "text": " aumentar la integración financiera y comercial, la de Cal90, en el año 91 se filmó el proceso del",
        "start": 998.28,
        "end": 1004.6
    },
    {
        "text": " marcosur en la región. En la década del 70 se firmó el cauce y el pequero en acuerdos",
        "start": 1004.6,
        "end": 1011.68
    },
    {
        "text": " bilaterales de complementaría comercial por cuotas que Uruguay firmó con Argentina y con Brasil.",
        "start": 1011.68,
        "end": 1017.36
    },
    {
        "text": " Los vamos a ver también un poco más en talles, cuáles se enan los objetivos y cómo se implementaron.",
        "start": 1017.36,
        "end": 1026.04
    },
    {
        "text": " Los procesos de integración nos fueron tan sencillos tampoco, pero sí el mercado regional",
        "start": 1027.54,
        "end": 1033.76
    },
    {
        "text": " cubra relevancia. De hecho, para nosotros el peso de la región en nuestra balanza comercial es",
        "start": 1033.76,
        "end": 1039.68
    },
    {
        "text": " un más mente importante en particular de Argentina y Brasil.",
        "start": 1039.68,
        "end": 1042.76
    },
    {
        "text": " Promover reformas estructurales de manera de consolidar economías más estables y integradas",
        "start": 1048.0800000000002,
        "end": 1053.2
    },
    {
        "text": " al comercio internacional y todo esto proveía de una mayor inserción y de la mano de obra",
        "start": 1053.2,
        "end": 1061.4
    },
    {
        "text": " con mayor crecimiento que ser derramaba al resto de la economía, la famosa teoría del derramé.",
        "start": 1061.4,
        "end": 1068.68
    },
    {
        "text": " Si yo iba a lograr determinadas condiciones macroeconómicas que me dieran determinada estabilidad",
        "start": 1068.68,
        "end": 1075.16
    },
    {
        "text": " iba a lograr determinado crecimiento y el mercado solo lo iba a volcar hacia la mejora del emperio,",
        "start": 1075.16,
        "end": 1081.88
    },
    {
        "text": " hacia la mejora del ingreso y a las mejores de las condiciones de vida. Este teoría del derramé",
        "start": 1081.88,
        "end": 1087.68
    },
    {
        "text": " como tal no se cumplió. El mercado por sí solo no tiene la capacidad de trasladar esos beneficios",
        "start": 1087.68,
        "end": 1094.8
    },
    {
        "text": " que se determina en determinados sectores. ¿Cuáles fueron las principales reformas que acompañaron",
        "start": 1094.8,
        "end": 1106.1200000000001
    },
    {
        "text": " estas ideas de lo que fue el modelo neoliberal? Se llama muchas cosas liberal y excruyentes.",
        "start": 1106.1200000000001,
        "end": 1112.24
    },
    {
        "text": " Les podemos saber la etapa de crecimiento con inclusión en América Latina.",
        "start": 1112.96,
        "end": 1117.52
    },
    {
        "text": " La liberalización comercial, procesos de integración, baja de aranceles, dejo liberado al mercado,",
        "start": 1117.52,
        "end": 1127.52
    },
    {
        "text": " no le pongo barreras comerciales. La liberalización financiera, la desregulación total de los",
        "start": 1127.52,
        "end": 1137.08
    },
    {
        "text": " mercados financieros, las reformas tributarias, la reforma del Estado con búsqueda se reducir el",
        "start": 1137.08,
        "end": 1145.8799999999999
    },
    {
        "text": " Estado, procesos de privatización más profundos o menos profundos. Uruguay fue un caso casi del libro",
        "start": 1145.8799999999999,
        "end": 1154.6799999999998
    },
    {
        "text": " porque en realidad fue la propia ciudadanía que trae de un referendo, un dijo no a la privatización.",
        "start": 1154.6799999999998,
        "end": 1160.0
    },
    {
        "text": " Si se dieron algunos esquemas fuertes de reforma y uno de los procesos fuertes de reforma del",
        "start": 1161.0,
        "end": 1168.04
    },
    {
        "text": " Estado se da partido del año 96 en el segundo gobierno de San Guinetti donde el componente fuerte",
        "start": 1168.04,
        "end": 1176.48
    },
    {
        "text": " de la reforma administrativa estuvo contenida en la ley de presupuesto en 96. Hay reforma en los",
        "start": 1176.48,
        "end": 1183.16
    },
    {
        "text": " mercados laborales con una menor participación estatal y una mayor libertad de mercado, un mercado",
        "start": 1183.16,
        "end": 1191.16
    },
    {
        "text": " laboral menos regulado, más flexible, con mayor posibilidad de parte de los empresarios de",
        "start": 1191.16,
        "end": 1198.64
    },
    {
        "text": " contratar o de expedir o de fijar salarios. Por ejemplo, en Uruguay se, en la partir del 91 se",
        "start": 1198.64,
        "end": 1209.1200000000001
    },
    {
        "text": " dejó de convocar a los consejos de salario. En Uruguay los consejos de salario es uno de los países",
        "start": 1209.12,
        "end": 1214.56
    },
    {
        "text": " que tienen más orantiguadas, surgen en el año 47. Eso fue hasta la década el 60 cuando en el",
        "start": 1214.56,
        "end": 1223.1999999999998
    },
    {
        "text": " gobierno de Pachihuahreco se dejaron de convocar si a la congelación de presupuesto de salarios,",
        "start": 1223.1999999999998,
        "end": 1227.08
    },
    {
        "text": " si se dejó de convocar al consejo de salarios, durante después la etapa de la dita dura tampoco",
        "start": 1227.08,
        "end": 1231.8799999999999
    },
    {
        "text": " hubo convocatoria de los consejos de salarios en el 85 cuando vino la apertura democrática, se volvió",
        "start": 1231.8799999999999,
        "end": 1238.32
    },
    {
        "text": " a convocar al consejo de salarios y en el 91 en el gobierno de la Casi se dejó de convocar",
        "start": 1238.32,
        "end": 1245.08
    },
    {
        "text": " con todo el proceso de mayor liberalización flexibilidad laboral.",
        "start": 1245.08,
        "end": 1248.36
    },
    {
        "text": " Residen fue en el 2005 que se volvió a la negociación tripartita con la característica en el 2005",
        "start": 1253.32,
        "end": 1259.8
    },
    {
        "text": " que se abrieron más grupos, y por ejemplo se nombraron lugares donde no, ese sector es donde",
        "start": 1259.8,
        "end": 1266.4399999999998
    },
    {
        "text": " nunca había existido la negociación salarial y los dos casos más extremos o más notorios",
        "start": 1266.44,
        "end": 1274.1200000000001
    },
    {
        "text": " fueron lo que es las domésticas y los rurales, que además son sectores que da sus características",
        "start": 1274.1200000000001,
        "end": 1283.92
    },
    {
        "text": " siempre fueron los más informales, los de ingresos más bajos y los de más or dificultad",
        "start": 1283.92,
        "end": 1295.96
    },
    {
        "text": " para la agremiación, por la dispersión que tiene. Hoy es un proceso interesante y hasta",
        "start": 1295.96,
        "end": 1303.96
    },
    {
        "text": " de análisis todo el proceso de sinvicalización en el empleo doméstico y en el rural con las",
        "start": 1303.96,
        "end": 1311.1200000000001
    },
    {
        "text": " dificultades que tiene, digo fue en Otorio un poco el caso este que se dio en la prensa",
        "start": 1311.1200000000001,
        "end": 1315.1200000000001
    },
    {
        "text": " otra semana, pero hoy existe una negociación a nivel de consejos salarial.",
        "start": 1315.12,
        "end": 1321.6799999999998
    },
    {
        "text": " El rol del Estado es importante en esa negociación por su rol como negociador, como uno más de las",
        "start": 1327.8799999999999,
        "end": 1335.6799999999998
    },
    {
        "text": " partes, pero también sobre todo en la acompañamiento de las partes más débiles.",
        "start": 1335.6799999999998,
        "end": 1340.9599999999998
    },
    {
        "text": " Bueno, cuál es el proceso económico que sea como sigue, hay una reanudación del crecimiento",
        "start": 1340.96,
        "end": 1354.44
    },
    {
        "text": " económico tras la década perdida, los primeros años la de la década, el 90 fueron de crecimiento",
        "start": 1354.44,
        "end": 1359.92
    },
    {
        "text": " económico a nivel de la región, simplemente han planes de estabilización como se les comentaba",
        "start": 1359.92,
        "end": 1369.2
    },
    {
        "text": " que a mediados de la década se van a controlar la inflación, pasa a superar el 800% promedio de",
        "start": 1369.2,
        "end": 1376.4
    },
    {
        "text": " un dígito y se genera las anclas de precio, anclas cambiarias que llevan un tipo de cambio",
        "start": 1376.4,
        "end": 1382.3600000000001
    },
    {
        "text": " fijo para contener la inflación. El menor manejo de la política frente a los y eso",
        "start": 1382.3600000000001,
        "end": 1390.4
    },
    {
        "text": " de quien era un menor manejo de la política frente a los yos que están los negativos, porque",
        "start": 1390.4,
        "end": 1395.64
    },
    {
        "text": " en este control era el tipo de cambio y pierdo control de qué cosa lo vieron en el macro.",
        "start": 1395.64,
        "end": 1402.4
    },
    {
        "text": " Puedo controlar la política económica, puede controlar todas las variables a la vez, o control",
        "start": 1402.4,
        "end": 1410.88
    },
    {
        "text": " el tipo de cambio, o control la base monetaria, o control el déficit fiscal. Entonces, si",
        "start": 1410.88,
        "end": 1418.0
    },
    {
        "text": " tengo que estar siempre interveniendo en el mercado de cambio, para manter ese tipo de",
        "start": 1418.0,
        "end": 1421.2800000000002
    },
    {
        "text": " cambio fijo pierdo control sobre la variabilidad. Además, tiene una economía mucho más abierta",
        "start": 1421.28,
        "end": 1427.8799999999999
    },
    {
        "text": " con lo cual es más sensible a los yos que están. Por eso, Uruguay, que pasa tener una economía",
        "start": 1427.8799999999999,
        "end": 1432.2
    },
    {
        "text": " más abierta, más dependiente de los flujos de comercio internacional, de los flujos financidos",
        "start": 1432.2,
        "end": 1437.32
    },
    {
        "text": " internacionales, está muy pendiente de lo que pasa en sus principales socios comerciales.",
        "start": 1437.32,
        "end": 1444.56
    },
    {
        "text": " En particular, cuando Brasil devalua, al poco tiempo, nosotros lo sabemos que pasamos",
        "start": 1444.56,
        "end": 1450.48
    },
    {
        "text": " al mismo proceso. Imagínense que Brasil devalua en el 98, empieza la reacción en Brasil.",
        "start": 1450.48,
        "end": 1457.8799999999999
    },
    {
        "text": " Ahí se empieza la reacción en Uruguay. En diciembre del 2001, devalua Argentina y no todos",
        "start": 1457.8799999999999,
        "end": 1462.72
    },
    {
        "text": " en junio de 2002. El modelo suponía poder superar la restricción",
        "start": 1462.72,
        "end": 1470.12
    },
    {
        "text": " externa, cambiando la orientación de la producción hacia fuera y superaría el cejo",
        "start": 1470.12,
        "end": 1475.2399999999998
    },
    {
        "text": " protección y estadélisis, posibilitaría la obtención de divisas necesarias para la",
        "start": 1475.2399999999998,
        "end": 1479.52
    },
    {
        "text": " continúa del crecimiento económico. Se generaría si una base en 2 genada acumulación",
        "start": 1479.52,
        "end": 1485.04
    },
    {
        "text": " de capital lo que tendría eliminar la dependencia de la perifería del financiamiento externo.",
        "start": 1485.04,
        "end": 1491.28
    },
    {
        "text": " Esto era la ciudad en la tería. Ahora, en los hechos, en los hechos, en los hechos.",
        "start": 1491.28,
        "end": 1516.36
    },
    {
        "text": " La apertura financiera y el ingreso masivo de capital externo sumado a los planes de",
        "start": 1516.36,
        "end": 1520.8
    },
    {
        "text": " estabilización inflacionaria, viaan clacambiaria, provocaron una apreciación de las monedas",
        "start": 1520.8,
        "end": 1525.9199999999998
    },
    {
        "text": " locales y generaron un nuevo ciclo de endeudamiento externo que agravaron la frasquilidad financiera",
        "start": 1525.9199999999998,
        "end": 1533.24
    },
    {
        "text": " de las grandes economías latinoamericanas. Se dio la crisis del tequila en el 95. ¿Se",
        "start": 1533.24,
        "end": 1538.36
    },
    {
        "text": " ponen que todos nos acuérdan? No sé, pues, son todos más jóvenes. Estaban nasciendo",
        "start": 1538.36,
        "end": 1542.84
    },
    {
        "text": " por ahí. O después, es eso peor. La crisis del tequila en México en el 95. La crisis del",
        "start": 1542.84,
        "end": 1552.04
    },
    {
        "text": " Brasil del 99. La crisis del peso argentino en el 2001. El peso de Uruguayo en el 2002,",
        "start": 1552.04,
        "end": 1559.8799999999999
    },
    {
        "text": " anunciado ya un poquito antes. ¿Qué iban a tener fuertes impactos en las economías",
        "start": 1559.8799999999999,
        "end": 1566.28
    },
    {
        "text": " pequeñas? El modelo neoliberal asentuó y se tornó más compleja la heterogenería",
        "start": 1566.28,
        "end": 1573.24
    },
    {
        "text": " estructural del sistema productivo y social. Con un proceso fuerte de desindustrialización,",
        "start": 1573.24,
        "end": 1578.68
    },
    {
        "text": " de crecimiento. En la CUPI se encontraba el sector esportador con altos niveles de",
        "start": 1578.68,
        "end": 1584.2
    },
    {
        "text": " productividad pero aislado y alejado al resto de la economía y con incapacidad de derivar",
        "start": 1584.2,
        "end": 1589.0
    },
    {
        "text": " hacia el resto de la economía. Eso es acumulado. El modelo se encontraba el antiguo sector",
        "start": 1589.0,
        "end": 1598.6
    },
    {
        "text": " industrial creado por el modelo Isis formado por mediana si hasta grandes industrias separadas",
        "start": 1598.6,
        "end": 1604.16
    },
    {
        "text": " del sector esportador y dependientes del mercado interno. Y en la parte baja de la estructura",
        "start": 1604.16,
        "end": 1610.36
    },
    {
        "text": " productiva se encontraban los sectores atrasados con bajos niveles de productividad y formado",
        "start": 1610.36,
        "end": 1614.68
    },
    {
        "text": " por empresas pequeñas que operaban en la economía informal. Las características de América",
        "start": 1614.68,
        "end": 1619.16
    },
    {
        "text": " latínica parece que nunca se superan siempre tienden como asentuarse. El progreso técnico",
        "start": 1619.16,
        "end": 1628.8400000000001
    },
    {
        "text": " incorporado por el sector esportador no se derrame hacia el resto de los sectores, tal",
        "start": 1628.8400000000001,
        "end": 1632.72
    },
    {
        "text": " como se obtenía los neoliberales. No, esa economía del derrame no se dio, no existía",
        "start": 1632.72,
        "end": 1638.3200000000002
    },
    {
        "text": " ese efecto desde un sector hacia el resto y esto impidió la construcción de una base en",
        "start": 1638.32,
        "end": 1645.8
    },
    {
        "text": " 2 gena de la acumulación de capital. Al concentrar los el progreso técnico se concentran",
        "start": 1645.8,
        "end": 1652.8
    },
    {
        "text": " también los niveles de productividad y por lo tanto de ingresos. Voy a generar más",
        "start": 1652.8,
        "end": 1657.08
    },
    {
        "text": " ingresos en función de qué sectores estoy asociado y la desigualdad de ingresos se asentúa",
        "start": 1657.08,
        "end": 1663.4399999999998
    },
    {
        "text": " más en la región. Eso fue una característica muy destacada a esa época. América latina,",
        "start": 1663.44,
        "end": 1669.96
    },
    {
        "text": " que era una economía que se avenía con grandes niveles de desigualdad se asentúa mucho",
        "start": 1669.96,
        "end": 1675.28
    },
    {
        "text": " más con el modelo neoliberal. Ahí se dio totalmente la ruptura con eso que decían",
        "start": 1675.28,
        "end": 1682.76
    },
    {
        "text": " las teorías neoliberales. Quiero pasar. Como el modelo esportador funciona bajo la",
        "start": 1682.76,
        "end": 1688.24
    },
    {
        "text": " premisa de salarios reales de primidos que permite en generar másores niveles de",
        "start": 1688.24,
        "end": 1693.88
    },
    {
        "text": " ganancias y que esas ganancias se vuelvan a invertir y después va a derivar en una mejora.",
        "start": 1693.88,
        "end": 1699.8
    },
    {
        "text": " La inúe intervención es total en las relaciones laborales y un mercado interno se estanca afectando",
        "start": 1699.8,
        "end": 1704.6
    },
    {
        "text": " gran cantidad de las empresas que dependen de este. Se acuerdan que cuando nosotros dimos",
        "start": 1704.6,
        "end": 1709.44
    },
    {
        "text": " mercado de trabajo en descripción una de las cosas que decíamos el mercado de trabajo,",
        "start": 1709.44,
        "end": 1712.96
    },
    {
        "text": " su análisis sumamente relevante por la interrelación que tiene hacia otros sectores y los",
        "start": 1712.96,
        "end": 1717.52
    },
    {
        "text": " derrames que tiene hacia otros sectores. ¿Cómo se conecta con otros sectores? Y fundamentalmente",
        "start": 1717.52,
        "end": 1723.04
    },
    {
        "text": " que tiene mucho que ver con su vínculo con el mercado del consumo. ¿Por qué? Porque una",
        "start": 1723.04,
        "end": 1727.92
    },
    {
        "text": " amasa muy importante de la población son asalariados. Entonces, represión mercado de trabajo",
        "start": 1727.92,
        "end": 1735.8799999999999
    },
    {
        "text": " está sumamente deprimido y bueno, termina afectando el mercado del consumo. Por eso cuando",
        "start": 1735.8799999999999,
        "end": 1743.2
    },
    {
        "text": " se dan dos datos de crecimiento, dicen bueno, pero el consumo igual sigue bien y a pesar de",
        "start": 1743.2,
        "end": 1747.72
    },
    {
        "text": " seguir. La gente tiene expectativas de que van a dar bien. Así se asentúa la heterogeneidad",
        "start": 1747.72,
        "end": 1755.8
    },
    {
        "text": " estructural, un pequeño sector el exportador que puede crecer y mantener buenas niveles",
        "start": 1755.8,
        "end": 1760.76
    },
    {
        "text": " de productividad en basas salarios vascos con vive con gran número de industrias que dependen",
        "start": 1760.76,
        "end": 1765.0800000000002
    },
    {
        "text": " de la demanda interna para sostenerse, al cual hay que sumarla la existencia de un sector",
        "start": 1765.0800000000002,
        "end": 1770.2
    },
    {
        "text": " económico aún más deprimido que encuentran la economía informal, su única vía de subsistencia.",
        "start": 1770.2,
        "end": 1775.28
    },
    {
        "text": " Y a su vez, la gran desregulación del mercado de trabajo es fomente, anónmemente la informalidad,",
        "start": 1775.28,
        "end": 1781.72
    },
    {
        "text": " el en trabajo precario. El producto interno bruto per cápita en la década del 90 tuvo un crecimiento",
        "start": 1781.72,
        "end": 1793.6000000000001
    },
    {
        "text": " relativamente bajo, uno con tres promedio anual, lo que contrasta claramente con el crecimiento",
        "start": 1793.6,
        "end": 1800.56
    },
    {
        "text": " registrado en los años 50 y en los años 60 que habían sido de más del 3% y hasta más",
        "start": 1800.56,
        "end": 1806.8799999999999
    },
    {
        "text": " del 5. Las monedas locales fortalecidas basadas en estos sistemas de tipo de cambio fijo provoca",
        "start": 1806.8799999999999,
        "end": 1816.28
    },
    {
        "text": " un crecimiento de las importaciones, el coeficiente de ellas se ubica en el 22,3% y",
        "start": 1816.28,
        "end": 1823.36
    },
    {
        "text": " esto repercute negativamente las balancias de pavos, la balanza comercial. La gran dependencia",
        "start": 1823.36,
        "end": 1828.9199999999998
    },
    {
        "text": " de los bienes importados provoca desde equilibrios en la balanza comercial que se agudizan lo que",
        "start": 1828.9199999999998,
        "end": 1835.28
    },
    {
        "text": " requiere de recursos financieros externos para poder viaj inversiones extranjeras, poder",
        "start": 1835.28,
        "end": 1840.76
    },
    {
        "text": " financiar estos deficiencias en cuenta corriendo. Para traer dichas inversiones serán",
        "start": 1840.76,
        "end": 1847.4399999999998
    },
    {
        "text": " necesarias tener tasas reales de interés, lo que obliga a mantener una política monetarifesca,",
        "start": 1847.44,
        "end": 1855.28
    },
    {
        "text": " el restrictiva, condicionando el aumento del producto. Tengo poco margen para crear la política",
        "start": 1855.28,
        "end": 1866.68
    },
    {
        "text": " fiscal pueda de una forma incentivar el crecimiento del producto y incentivar la demanda.",
        "start": 1866.68,
        "end": 1872.3600000000001
    },
    {
        "text": " Se acuerdan cuando vimos macro, no, las diferentes alternativas. El modelo provocó grandes",
        "start": 1872.36,
        "end": 1883.28
    },
    {
        "text": " cambios en el empleo, se reduce el peso de la industria y se espande el peso del sector",
        "start": 1883.28,
        "end": 1888.4799999999998
    },
    {
        "text": " de servicios. Eso se da en casi todos las economías de la región. Los empleos se destruyen",
        "start": 1888.4799999999998,
        "end": 1898.32
    },
    {
        "text": " en el mercado de regulado y crecen la informa de los empleos, la precalidad del empleo y",
        "start": 1898.32,
        "end": 1913.8
    },
    {
        "text": " baja la calidad del empleo. La expansión de la economía informa la debilidad del mercado",
        "start": 1913.8,
        "end": 1919.36
    },
    {
        "text": " de trabajo y la pérdida de puestos de trabajo en la industria, que son parte del marco neoliberal,",
        "start": 1919.36,
        "end": 1926.4399999999998
    },
    {
        "text": " han sido elementos claves para el deterioro del salario real, que cae en toda la región,",
        "start": 1926.44,
        "end": 1932.8
    },
    {
        "text": " la concentración del ingreso y la aumento de la pobreza. Y todas las consecuencias de fenómenos",
        "start": 1932.8,
        "end": 1939.8
    },
    {
        "text": " sociales que se dan en la región. Hay fenómenos que van un poco de la mano, que América Latina",
        "start": 1939.8,
        "end": 1948.6000000000001
    },
    {
        "text": " tiene grandes complejidades, Uruguay siempre se ha mantenido un poco alejado de esos niveles,",
        "start": 1948.6000000000001,
        "end": 1954.76
    },
    {
        "text": " pero tampoco hemos estado a genos. Las niveles de pobreza también han sido importantes,",
        "start": 1954.76,
        "end": 1959.48
    },
    {
        "text": " pero todo lo que son el desarrollo de narcotráfico, la violencia. Hay países de centro-américa",
        "start": 1959.48,
        "end": 1966.24
    },
    {
        "text": " y hasta en el norte de Brasil que hay un geno, sí, de gente joven, producto de la violencia",
        "start": 1966.24,
        "end": 1971.8799999999999
    },
    {
        "text": " de narcotráfico. La cantidad de muertes es impresionante. También los temas laborales,",
        "start": 1971.8799999999999,
        "end": 1980.76
    },
    {
        "text": " que como también afectan, diferencial por determinados lugares geográficos, por el tema",
        "start": 1980.76,
        "end": 1987.68
    },
    {
        "text": " de la capacitación de la mano de obra, las edades. La economía informal no solo pasa",
        "start": 1987.68,
        "end": 1997.24
    },
    {
        "text": " a hacer un refugio para quienes no encuentran empleos en la economía formal, sino que se",
        "start": 1997.24,
        "end": 2001.32
    },
    {
        "text": " constituye el piso de valor de la fuerza de trabajo. Los salarios mínimos no peran como",
        "start": 2001.32,
        "end": 2008.34
    },
    {
        "text": " fijador de trabajo, tampoco son representativos en mercado de trabajo, recién relativamente",
        "start": 2008.34,
        "end": 2014.22
    },
    {
        "text": " poco. Pero siempre tengo una oferta potencial que me está condicionando los niveles de",
        "start": 2014.22,
        "end": 2023.4599999999998
    },
    {
        "text": " salariales. De esta forma, el modelo neoliberal no solo agudiza la heterogenea estructural,",
        "start": 2023.4599999999998,
        "end": 2029.82
    },
    {
        "text": " sino que también aumenta notablemente y agudiza el tema de las desigualades sociales",
        "start": 2029.82,
        "end": 2034.82
    },
    {
        "text": " dentro de la región. Algunos indicadores para analizar la década",
        "start": 2034.82,
        "end": 2044.98
    },
    {
        "text": " en la venta, las tasas de crecimiento del producto y del producto para habitante per cápita",
        "start": 2044.98,
        "end": 2049.38
    },
    {
        "text": " en las diferentes décadas promedios. Si ustedes ven 50, 60, 4,9, 2,2 por habitante. Estos",
        "start": 2049.38,
        "end": 2058.2799999999997
    },
    {
        "text": " no están denunciados. En el 673, 5 con 5, 3 con 3. En el 73, 80, 5 con 1, 2 con 2. En el",
        "start": 2058.28,
        "end": 2067.2000000000003
    },
    {
        "text": " 80, 90, 1 con 4, me lo acero con 1. Hay una baja para capita. Entre el 90 y el 99, 3 con",
        "start": 2067.2000000000003,
        "end": 2075.1600000000003
    },
    {
        "text": " 2 y 1 con 3. Casinula. El crecimiento económico mejor respecto a la década anterior, 3 con",
        "start": 2075.1600000000003,
        "end": 2085.0
    },
    {
        "text": " 1 con 4. Y volvió a ser positivo en términos per cápita, pero siguió siendo infetióral",
        "start": 2085.0,
        "end": 2090.64
    },
    {
        "text": " alcanzado en las décadas anteriores. Y de hecho, después empiezas a bajar. Y cuando",
        "start": 2090.64,
        "end": 2096.58
    },
    {
        "text": " empiezas a caer, cuando se empieza a ver la recepción económica, las condiciones de",
        "start": 2096.58,
        "end": 2101.12
    },
    {
        "text": " la población en general están deterioradas, porque hay salariales, reales bajos, hay",
        "start": 2101.12,
        "end": 2106.88
    },
    {
        "text": " mercados laborales muy flexibles, hay niveles de desempleo altos. Entonces, no hay una red",
        "start": 2106.88,
        "end": 2115.92
    },
    {
        "text": " que permita a nivel social, es muy complicado. La tasa de crecimiento del producto en los",
        "start": 2115.92,
        "end": 2122.6400000000003
    },
    {
        "text": " 90 y las variaciones porcentuales promedios en los países latinoamericanos. Si ustedes",
        "start": 2122.6400000000003,
        "end": 2127.52
    },
    {
        "text": " ven, 90 era de baja, 91, tienen crecimiento. Vieron que tiene 95. Esta ciudad es una baja importante,",
        "start": 2127.52,
        "end": 2141.92
    },
    {
        "text": " 97 crece y después ya. A partir del año 91 el crecimiento fue siempre positivo,",
        "start": 2141.92,
        "end": 2149.0
    },
    {
        "text": " antes con mucha volatilidad. Vieron ese comportamiento. De destacándose las tasas del 94 y el",
        "start": 2149.0,
        "end": 2156.08
    },
    {
        "text": " 97 que fueron superiores al 5%. En el 95, que sea la crisis en México, el efecto de",
        "start": 2156.08,
        "end": 2163.72
    },
    {
        "text": " Kila, que afecta puntualmente a la Argentina y en el 99 sea la crisis asiática, 97 y 98,",
        "start": 2163.72,
        "end": 2172.92
    },
    {
        "text": " que provoca fuertes efectos y caí en el producto internobruto en Brasil, que luego repercute",
        "start": 2172.92,
        "end": 2178.0
    },
    {
        "text": " en los restos del país desde el connozur. Son las dos grandes economías de la región.",
        "start": 2178.0,
        "end": 2184.0
    },
    {
        "text": " Otro indicado importante, la inversión como porcentaje del producto promedio latinoamericano,",
        "start": 2184.0,
        "end": 2193.48
    },
    {
        "text": " la recuperación del crecimiento económico no se tradujo en un aumento importante",
        "start": 2193.48,
        "end": 2199.56
    },
    {
        "text": " de la inversión en los 90 y si bien este aumento comienza en la década, esto nos fue",
        "start": 2199.56,
        "end": 2204.92
    },
    {
        "text": " una homogenea entre los países de la región. En Iníunca alcanzó los niveles de los años",
        "start": 2204.92,
        "end": 2210.6
    },
    {
        "text": " 70. La crisis más importante del 95 y el 99 volvieron a retroceder en tal más",
        "start": 2210.6,
        "end": 2218.92
    },
    {
        "text": " inversiones y apenas creció a comienzos y fines de la década de 18 con 2 a 20%. La inflación",
        "start": 2218.92,
        "end": 2234.52
    },
    {
        "text": " promedio en los países latinoamericanos, estos de los promedios se esconde muchas",
        "start": 2234.52,
        "end": 2237.96
    },
    {
        "text": " realidad de esta manera. Si ustedes observan, 91, 92, 93, 94, se distinguen dos",
        "start": 2237.96,
        "end": 2248.68
    },
    {
        "text": " periodos distintos en cuanto a la evolución de la inflación en América Latina. Hasta",
        "start": 2248.68,
        "end": 2253.0
    },
    {
        "text": " el 95, un periodo hiperinflacionario con tasas de más del 100% anual en promedio y",
        "start": 2253.0,
        "end": 2262.44
    },
    {
        "text": " posteriores al 95 del en la inflación llevada a un dijeito hacia finales de la década.",
        "start": 2262.44,
        "end": 2268.44
    },
    {
        "text": " Lo anterior permite concluir que más allá de las consecuencias que se dan en temas de crecimiento",
        "start": 2268.44,
        "end": 2273.92
    },
    {
        "text": " en versión colaterales, los planes de estabilización fueron eficiente en el control de la inflación.",
        "start": 2273.92,
        "end": 2287.7200000000003
    },
    {
        "text": " Si bien el déficit fiscal también estamos en términos promedios, se mantuvo en terreno",
        "start": 2287.72,
        "end": 2295.64
    },
    {
        "text": " negativo en los 90 no se dio un deterioro significativo del mismo como en el pasado. Lo que",
        "start": 2295.64,
        "end": 2300.8799999999997
    },
    {
        "text": " muestra la importancia que se otorgó en estos años a la prudencia fiscal y aquí lo que",
        "start": 2300.8799999999997,
        "end": 2306.24
    },
    {
        "text": " se buscó fortemente fue una reducción, fue en todas las políticas de buscar una reforma",
        "start": 2306.24,
        "end": 2314.9599999999996
    },
    {
        "text": " del Estado reduccionista. En la evolución del déficit se observa un claro deterioro del",
        "start": 2314.96,
        "end": 2322.2400000000002
    },
    {
        "text": " mismo durante las crisis macroconómicas que atravesó la región y en particular en el año 99",
        "start": 2322.2400000000002,
        "end": 2327.48
    },
    {
        "text": " que ahí empieza la baja generalizada. Los indicadores del sector externo promedio",
        "start": 2327.48,
        "end": 2336.76
    },
    {
        "text": " latinoamericanos, las exportaciones crecieron en los 90 en una mayor medida que en las",
        "start": 2336.76,
        "end": 2341.48
    },
    {
        "text": " décadas anteriores, pero crecieron básicamente impulsadas por el crecimiento económico,",
        "start": 2341.48,
        "end": 2350.04
    },
    {
        "text": " no se dio esa evolución igual entre los distintos sectores, pero el crecimiento de las importaciones",
        "start": 2350.04,
        "end": 2356.8
    },
    {
        "text": " fue mucho más importante lo que provoco que el saldo comercial a lo largo del periodo",
        "start": 2356.8,
        "end": 2360.96
    },
    {
        "text": " en peorara. El dato significativo de las exportaciones es que crecieron más ormente hacia",
        "start": 2360.96,
        "end": 2367.0
    },
    {
        "text": " la región y por ende el aumento del componente industrial de las mismas.",
        "start": 2367.0,
        "end": 2373.6
    },
    {
        "text": " Este fue un elemento importante. El crecimiento de, se dio un crecimiento fuerte del peso del",
        "start": 2373.6,
        "end": 2380.84
    },
    {
        "text": " comercio regional y en particular de las exportaciones hacia la región.",
        "start": 2380.84,
        "end": 2384.08
    },
    {
        "text": " Necesitamos sumamente al elevante el proceso regional y se da procesos de integración regional",
        "start": 2384.08,
        "end": 2392.28
    },
    {
        "text": " de más importante. Pisen a quedar los bloques económicos, que se dan en esta región y se",
        "start": 2392.28,
        "end": 2397.1600000000003
    },
    {
        "text": " dan en otros. Se desarrolla el mercosurista y se desarrolla el avión europea. La comunidad",
        "start": 2397.1600000000003,
        "end": 2402.52
    },
    {
        "text": " económica europea, en aquella época, que después llega la unión europea cuando se unifica",
        "start": 2402.52,
        "end": 2406.0800000000004
    },
    {
        "text": " la moneda. Bueno, pese el crecimiento económico",
        "start": 2406.0800000000004,
        "end": 2410.36
    },
    {
        "text": " registro en los 90 y a la deregulación implementada los resultados no se trasladaron al mercado",
        "start": 2410.36,
        "end": 2415.44
    },
    {
        "text": " laboral y la tasa de desempleo no disminución esta época sino que aumentó este levemente",
        "start": 2415.44,
        "end": 2422.64
    },
    {
        "text": " durante el periodo. Y otro de los características fue el empeoramiento en la calidad del empleo,",
        "start": 2422.64,
        "end": 2429.68
    },
    {
        "text": " la precariedad, la aumentó la informalidad, no? Y también aumentó la pobreza en esta",
        "start": 2429.68,
        "end": 2436.08
    },
    {
        "text": " década respecto al anterior. Las condiciones sociales empeoraron y empeoró la desigualdad",
        "start": 2436.08,
        "end": 2443.36
    },
    {
        "text": " del ingreso de eso sí durante todo el periodo. Pese al crecimiento económico, la deregulación",
        "start": 2443.36,
        "end": 2451.2000000000003
    },
    {
        "text": " implementada los resultados no se trasladaron al mercado laboral y la tasa de desempleo siempre",
        "start": 2451.2000000000003,
        "end": 2458.04
    },
    {
        "text": " vino aumentando. Bien, bueno.",
        "start": 2458.04,
        "end": 2475.12
    },
    {
        "text": " Bueno, y con esa situación llegamos a los últimos años.",
        "start": 2475.12,
        "end": 2492.24
    },
    {
        "text": " Disculpen que no vena.",
        "start": 2505.12,
        "end": 2524.12
    },
    {
        "text": "ten muy seguido en la oportunidad de la flea y que ahora no ven här con su nombre al que",
        "start": 2525.12,
        "end": 2532.7599999999998
    },
    {
        "text": " etc.",
        "start": 2532.7599999999998,
        "end": 2542.42
    },
    {
        "text": " Habrían mismo.",
        "start": 2542.42,
        "end": 2544.42
    },
    {
        "text": " Te vi el último.",
        "start": 2572.42,
        "end": 2574.42
    },
    {
        "text": " Gracias.",
        "start": 2582.42,
        "end": 2584.42
    },
    {
        "text": " Es indísimo que te filme la clase cuando no te funciona.",
        "start": 2590.42,
        "end": 2594.42
    },
    {
        "text": " No te preocupes, pero si te las crees, te aburren.",
        "start": 2602.42,
        "end": 2606.42
    },
    {
        "text": " Y la situación en la región no cambió notablemente.",
        "start": 2614.42,
        "end": 2620.42
    },
    {
        "text": " Si bien ahora estamos en un periodo que ha cambiado la realidad",
        "start": 2620.42,
        "end": 2624.42
    },
    {
        "text": " y vamos a llegar a analizar que pasó con él en estos últimos tres años.",
        "start": 2624.42,
        "end": 2630.42
    },
    {
        "text": " A América Latina entra en una etapa de crecimiento con inclusión.",
        "start": 2630.42,
        "end": 2634.42
    },
    {
        "text": " Y que se da también de la mano de las crisis financieras,",
        "start": 2634.42,
        "end": 2638.42
    },
    {
        "text": " los países desarrollados.",
        "start": 2638.42,
        "end": 2640.42
    },
    {
        "text": " Entonces, con el fracaso de la política más de corte neoliberal,",
        "start": 2640.42,
        "end": 2652.42
    },
    {
        "text": " que se basó en el consenso de Washington,",
        "start": 2652.42,
        "end": 2655.42
    },
    {
        "text": " y las políticas neoliberales tuvieron como resultado unas puertes crises,",
        "start": 2655.42,
        "end": 2659.42
    },
    {
        "text": " que no fueron no solo económicas, sino que también fueron de corte político",
        "start": 2659.42,
        "end": 2664.42
    },
    {
        "text": " con un empeoramiento generalizado de todos los indicadores sociales,",
        "start": 2664.42,
        "end": 2670.42
    },
    {
        "text": " con niveles de salariales muy bajos, con altos niveles de desempleo,",
        "start": 2670.42,
        "end": 2674.42
    },
    {
        "text": " con una informalidad muy fuerte, con un fuerte empobrecimiento,",
        "start": 2674.42,
        "end": 2677.42
    },
    {
        "text": " concentración del ingreso.",
        "start": 2677.42,
        "end": 2679.42
    },
    {
        "text": " Y eso se da un poco en términos generalizados a nivel de América Latina.",
        "start": 2679.42,
        "end": 2683.42
    },
    {
        "text": " Estos generos condiciones políticas institucionales",
        "start": 2684.42,
        "end": 2687.42
    },
    {
        "text": " para que los gobiernos o positores al gobierno neoliberal asumieran el poder",
        "start": 2687.42,
        "end": 2692.42
    },
    {
        "text": " político en la mayoría de los países de la región.",
        "start": 2692.42,
        "end": 2695.42
    },
    {
        "text": " Y junto con este cambio, a nivel político,",
        "start": 2697.42,
        "end": 2701.42
    },
    {
        "text": " se dan una tendencia a cambios en todo lo que son las políticas económicas,",
        "start": 2701.42,
        "end": 2706.42
    },
    {
        "text": " las políticas sociales, y también hasta los procesos de integración.",
        "start": 2706.42,
        "end": 2714.42
    },
    {
        "text": " Así de esta manera, los intereses principales de los gobiernos",
        "start": 2715.42,
        "end": 2719.42
    },
    {
        "text": " dejaron ser el equilibrio de la balanza de pagos, el equilibrio de las cuentas públicas",
        "start": 2719.42,
        "end": 2723.42
    },
    {
        "text": " y el desarrollo del sector financiero y la dereregulación del mercado de trabajo",
        "start": 2723.42,
        "end": 2727.42
    },
    {
        "text": " y pasaron a hacer el combate a la pobreza, la desigualdad,",
        "start": 2727.42,
        "end": 2730.42
    },
    {
        "text": " así como la recuperación de los puestos de trabajo y las mejoras de las condiciones laborales.",
        "start": 2730.42,
        "end": 2735.42
    },
    {
        "text": " Y a su vez se dio en un contexto de que se dio una tendencia a favorecer",
        "start": 2735.42,
        "end": 2740.42
    },
    {
        "text": " al crecimiento económico, porque no puedo atender las situaciones sociales y laborales",
        "start": 2740.42,
        "end": 2744.42
    },
    {
        "text": " sino generos ingresos, sino tengo un estado relativamente equilibrado.",
        "start": 2744.42,
        "end": 2750.42
    },
    {
        "text": " Entonces, la relojería de la política fiscal no atendiendo las diferentes funciones,",
        "start": 2752.42,
        "end": 2759.42
    },
    {
        "text": " lo que es la asignación de bienes y servicios, lo que es la distribución",
        "start": 2760.42,
        "end": 2768.42
    },
    {
        "text": " y lo que es la estabilización económica que pasa con la inflación, con el crecimiento,",
        "start": 2768.42,
        "end": 2774.42
    },
    {
        "text": " con la balanza de pagos, con el producto, con el empleo, requiere de una batería",
        "start": 2774.42,
        "end": 2779.42
    },
    {
        "text": " de herramientas y de objetivos que muchas veces son contrapuestos entre sí.",
        "start": 2779.42,
        "end": 2784.42
    },
    {
        "text": " Entonces, articulares a la vez es todo un tema sumamente complejo.",
        "start": 2785.42,
        "end": 2788.42
    },
    {
        "text": " Asumo el partido de los trabajadores en Brasil, el quisellismo en Argentina,",
        "start": 2790.42,
        "end": 2793.42
    },
    {
        "text": " el chavismo en Venezuela, Morales en Bolivia, Correa en Ecuador, el frente de Ambiú en Uruguay, entre otros",
        "start": 2793.42,
        "end": 2798.42
    },
    {
        "text": " y se configura un marco político institucional que hasta el momento era absolutamente desconocido",
        "start": 2798.42,
        "end": 2805.42
    },
    {
        "text": " en América Latina.",
        "start": 2805.42,
        "end": 2806.42
    },
    {
        "text": " La realidad política también cambia por las condiciones no, económicas que había en la región.",
        "start": 2807.42,
        "end": 2815.42
    },
    {
        "text": " Bajo la premisa de que el crecimiento económico es una condición necesaria,",
        "start": 2820.42,
        "end": 2825.42
    },
    {
        "text": " pero no suficiente para avanzar las sociedades más igualitarias, justas e incluyentes,",
        "start": 2825.42,
        "end": 2832.42
    },
    {
        "text": " los gobiernos se centraron en la calidad del crecimiento.",
        "start": 2832.42,
        "end": 2835.42
    },
    {
        "text": " Entonces, necesitamos la premisa, era necesitamos crecimiento,",
        "start": 2837.42,
        "end": 2842.42
    },
    {
        "text": " pero también necesitamos de intervenciones concretas de forma tal de que los efectos o las consecuencias",
        "start": 2842.42,
        "end": 2849.42
    },
    {
        "text": " del crecimiento se deriven en términos de mejores en las condiciones sociales,",
        "start": 2849.42,
        "end": 2854.42
    },
    {
        "text": " de mejores en las condiciones de trabajo y de sociedades más justas igualitarias.",
        "start": 2854.42,
        "end": 2861.42
    },
    {
        "text": " Un caso bien interesante de análisis es el mercado de trabajo mismo.",
        "start": 2863.42,
        "end": 2867.42
    },
    {
        "text": " El mercado de trabajo no es un mercado que pueda trabajarse a través de una política general o a través",
        "start": 2867.42,
        "end": 2875.42
    },
    {
        "text": " solo el crecimiento económico, sino que requiere de un conjunto de regulaciones y de medidas específicas",
        "start": 2875.42,
        "end": 2881.42
    },
    {
        "text": " porque imagínense que hay tantos mercado de trabajo como tipos de trabajo.",
        "start": 2881.42,
        "end": 2886.42
    },
    {
        "text": " El concepto de derechos y, digo, la conectividad surge como muy importante en esta época.",
        "start": 2887.42,
        "end": 2898.42
    },
    {
        "text": " Entonces, se dan un conjunto de bajo esta premisa del crecimiento económico es condición necesaria,",
        "start": 2898.42,
        "end": 2905.42
    },
    {
        "text": " pero no es suficiente y para llegar a mejorar las condiciones sociales,",
        "start": 2905.42,
        "end": 2909.42
    },
    {
        "text": " necesito de intervenciones concretas en esta línea, se requiere de un desarrollo de medidas de política económica",
        "start": 2910.42,
        "end": 2918.42
    },
    {
        "text": " y de una institucionalidad y de reformas necesarias que acompañen en ese paquete y se dan a un proceso de reformas",
        "start": 2918.42,
        "end": 2925.42
    },
    {
        "text": " económicas y sociales.",
        "start": 2925.42,
        "end": 2928.42
    },
    {
        "text": " Muchas veces hay que gente que dice que la primera reforma social es la reforma económica.",
        "start": 2932.42,
        "end": 2937.42
    },
    {
        "text": " La primera política social es la política económica.",
        "start": 2938.42,
        "end": 2940.42
    },
    {
        "text": " Es el marco.",
        "start": 2943.42,
        "end": 2944.42
    },
    {
        "text": " Entonces, el marco de los derechos en el que se lleva adelante crecimiento económico, sus impactos distributivos,",
        "start": 2944.42,
        "end": 2949.42
    },
    {
        "text": " así como el vincule, las relaciones sociales políticas se establecen como importantes.",
        "start": 2949.42,
        "end": 2954.42
    },
    {
        "text": " Y son uno de los factores que explican el crecimiento por lo menos la cepal,",
        "start": 2954.42,
        "end": 2960.42
    },
    {
        "text": " lo explica de esa lógica, documento cepal 2003.",
        "start": 2960.42,
        "end": 2963.42
    },
    {
        "text": " En el contexto latinoamericano favorable, no existe un contexto regional favorable para el crecimiento,",
        "start": 2964.42,
        "end": 2973.42
    },
    {
        "text": " con alta en el precio de los comodites en los países de latinoamerica,",
        "start": 2973.42,
        "end": 2977.42
    },
    {
        "text": " los precios de los comodites estaban muy bajos,",
        "start": 2979.42,
        "end": 2983.42
    },
    {
        "text": " más el proceso de evaluación de muchas economías que después asuduó.",
        "start": 2983.42,
        "end": 2988.42
    },
    {
        "text": " Hay un crecimiento del precio de los comodites que ayudan a que los países latinoamericanos aprovechen ese crecimiento",
        "start": 2989.42,
        "end": 2999.42
    },
    {
        "text": " para intentar o para llevar adelante procesos de cambio en las estructuras económicas,",
        "start": 2999.42,
        "end": 3005.42
    },
    {
        "text": " donde se combinan un conjunto de políticas económicas con un cambio en lo que son las políticas laborales activas,",
        "start": 3005.42,
        "end": 3015.42
    },
    {
        "text": " donde se atiende mucho lo que es la mejora del ingreso y los derechos de los trabajadores.",
        "start": 3015.42,
        "end": 3021.42
    },
    {
        "text": " Hay reformas importantes en los sistemas tributarios, donde el impuesto a las retribuciones personales",
        "start": 3021.42,
        "end": 3031.42
    },
    {
        "text": " pasa a ser una figura importante, los sistemas de salud",
        "start": 3031.42,
        "end": 3039.42
    },
    {
        "text": " y las políticas que vendieron a la mejora en la distribución del ingreso y a la caída de la pobreza.",
        "start": 3040.42,
        "end": 3045.42
    },
    {
        "text": " A ver, el conjunto de políticas que se dieron en Uruguay no fueron exclusivos de Uruguay,",
        "start": 3046.42,
        "end": 3052.42
    },
    {
        "text": " fueron una tendencia a nivel de la región, con diferentes nombres.",
        "start": 3052.42,
        "end": 3056.42
    },
    {
        "text": " El Plan de Merger, la creación de los ministerios de Desarroz Social,",
        "start": 3056.42,
        "end": 3059.42
    },
    {
        "text": " año más a año menos, se dio con el Ministerio de Desarroz Social en Argentina, MDS en Argentina,",
        "start": 3059.42,
        "end": 3065.42
    },
    {
        "text": " en Brasil, la Secretaría de Planificación en Chile,",
        "start": 3066.42,
        "end": 3072.42
    },
    {
        "text": " el Plan de Mergencia se llamó el Bolsa Escóla en Brasil, el Jef Sijefa Ciudad en Argentina,",
        "start": 3072.42,
        "end": 3079.42
    },
    {
        "text": " las políticas de trabajo protegido, que lo que tienden a buscar es la generación de empleo",
        "start": 3079.42,
        "end": 3087.42
    },
    {
        "text": " via directamente el Estado o a través de determinados incentivos a las empresas,",
        "start": 3087.42,
        "end": 3092.42
    },
    {
        "text": " para que esas personas que por sus condiciones o por falta de capacitación",
        "start": 3092.42,
        "end": 3099.42
    },
    {
        "text": " o porque están en una situación de marginalidad que no les permiten ingresar al mercado trabajo,",
        "start": 3099.42,
        "end": 3104.42
    },
    {
        "text": " lo que cubren ese mercado incompleto de poder generar empleo que les permite",
        "start": 3104.42,
        "end": 3110.42
    },
    {
        "text": " alguna manera generar las capacidades para después pasar a formar parte de la fuerza de trabajo.",
        "start": 3110.42,
        "end": 3115.42
    },
    {
        "text": " Todos los programas de microcredito de expo momento a la pequeña empresa de regulación",
        "start": 3116.42,
        "end": 3122.42
    },
    {
        "text": " de determinados sectores son parte de todas las políticas que se acompañan de los créditos sociales,",
        "start": 3122.42,
        "end": 3128.42
    },
    {
        "text": " de la inclusión financiera, no como que este habla sino de poder integrar a la gente",
        "start": 3128.42,
        "end": 3135.42
    },
    {
        "text": " al mercado de crédito con créditos blandos de la negociación colectiva,",
        "start": 3135.42,
        "end": 3144.42
    },
    {
        "text": " son procesos que se dan en esta etapa en la región con diferentes formas de implementación",
        "start": 3144.42,
        "end": 3150.42
    },
    {
        "text": " más profundos o menos profundos con diferentes importancias, pero son parte del homie.",
        "start": 3150.42,
        "end": 3156.42
    },
    {
        "text": " Este cuadro lindo para estudiarse en memoria, voy a dar un gráfico, ¿no?",
        "start": 3162.42,
        "end": 3168.42
    },
    {
        "text": " Ahí van a tener un poco las tasas de crecimiento a nivel de la región y van a ver",
        "start": 3169.42,
        "end": 3173.42
    },
    {
        "text": " de 2000 argentinas, tenía menos 1,9 en 2001, menos 5,5 en 2002, menos 11,5 y después",
        "start": 3173.42,
        "end": 3181.42
    },
    {
        "text": " a partir del 2013, la mayoría de todos los países empiezan a crecer y a crecer las tasas importantes.",
        "start": 3181.42,
        "end": 3188.42
    },
    {
        "text": " Uruguay estamos acá, menos 1 con algo en el 2002, 12 casi y después",
        "start": 3188.42,
        "end": 3197.42
    },
    {
        "text": " del 2003 en adelante es un periodo de crecimiento a las importantes y que se empiezan a contraer",
        "start": 3197.42,
        "end": 3203.42
    },
    {
        "text": " recién después de los 2014.",
        "start": 3203.42,
        "end": 3206.42
    },
    {
        "text": " Ahí pueden ver un poco la evolución de todas, nos vamos a agregar algún gráfico en esto.",
        "start": 3207.42,
        "end": 3212.42
    },
    {
        "text": " La distribución del ingreso media a través del índice de cine también, ¿no?",
        "start": 3213.42,
        "end": 3217.42
    },
    {
        "text": " ¿Qué característica tuvo estas políticas que en ese contexto se dio un proceso de crecimiento",
        "start": 3218.42,
        "end": 3223.42
    },
    {
        "text": " generalizado a nivel de la región, pero este proceso de crecimiento se dio un mes con mejoras",
        "start": 3223.42,
        "end": 3228.42
    },
    {
        "text": " en los niveles de empleo, en los niveles de salario reales y en la distribución del ingreso.",
        "start": 3228.42,
        "end": 3233.42
    },
    {
        "text": " En la distribución del ingreso no todo lo que se esperaba y de hecho,",
        "start": 3234.42,
        "end": 3237.42
    },
    {
        "text": " hubieron dos casos que se despegan en la región del resto y uno es el de Uruguay.",
        "start": 3237.42,
        "end": 3241.42
    },
    {
        "text": " Uruguay fue de los países que logró mejor recuperar la distribución del ingreso.",
        "start": 3241.42,
        "end": 3248.42
    },
    {
        "text": " Y después, un ejercicio económico muy complejo de hacer,",
        "start": 3249.42,
        "end": 3253.42
    },
    {
        "text": " decir, ¿cuáles de las políticas fueron las que mejor contribuyeron a esta mejora la distribución del ingreso",
        "start": 3253.42,
        "end": 3260.42
    },
    {
        "text": " y fuertemente fue el mercado trabajo?",
        "start": 3260.42,
        "end": 3263.42
    },
    {
        "text": " La mejora del ingreso en el salario real, las mejoras en la tasa de empleo,",
        "start": 3264.42,
        "end": 3269.42
    },
    {
        "text": " la disminución de la tasa de desempleo, ¿no?",
        "start": 3269.42,
        "end": 3272.42
    },
    {
        "text": " Fueron las que más contribuyeron a mejorar la distribución del ingreso,",
        "start": 3272.42,
        "end": 3278.42
    },
    {
        "text": " que van acompañadas de toda una gama de protección social, de asignaciones familiares,",
        "start": 3278.42,
        "end": 3284.42
    },
    {
        "text": " de políticas de la justi, pensiones a la bejeste, el embejecimiento",
        "start": 3284.42,
        "end": 3291.42
    },
    {
        "text": " y de una institucionalidad que se acomoda mucho en esa política.",
        "start": 3291.42,
        "end": 3295.42
    },
    {
        "text": " Bueno, en los primeros años,",
        "start": 3295.42,
        "end": 3299.42
    },
    {
        "text": " después de los 2000 para adelante, siquiera.",
        "start": 3299.42,
        "end": 3303.42
    },
    {
        "text": " El panorama político institucional cambió, ¿no?",
        "start": 3303.42,
        "end": 3307.42
    },
    {
        "text": " Los escándalos de corrupción en diversos gobiernos han generado desconfiancias",
        "start": 3307.42,
        "end": 3311.42
    },
    {
        "text": " y crisis institucionales de alto nivel que precipitó el cambio para la vuelta de algunos países",
        "start": 3311.42,
        "end": 3316.42
    },
    {
        "text": " de gobierno de cortenio liberal.",
        "start": 3316.42,
        "end": 3318.42
    },
    {
        "text": " Hay un claro ejemplo que son argentinos y brasileños, cuyos objetivos económicos",
        "start": 3318.42,
        "end": 3325.42
    },
    {
        "text": " han cambiado y nuevamente en los desequilibrios macroeconómicos como la de regulación",
        "start": 3325.42,
        "end": 3329.42
    },
    {
        "text": " del mercado laboral, se han puesto en marcha,",
        "start": 3329.42,
        "end": 3332.42
    },
    {
        "text": " ustedes han escuchado de las últimas propuestas en Brasil,",
        "start": 3332.42,
        "end": 3336.42
    },
    {
        "text": " la reforma laboral, hay una desregulación,",
        "start": 3336.42,
        "end": 3340.42
    },
    {
        "text": " se está proponiendo una reforma de regulación absoluta del mercado laboral,",
        "start": 3340.42,
        "end": 3349.42
    },
    {
        "text": " donde se puede emplearse, puede despedir, que ha generado mucho debate,",
        "start": 3349.42,
        "end": 3354.42
    },
    {
        "text": " en las más diversas niveles a nivel de los gobiernos de la región,",
        "start": 3354.42,
        "end": 3359.42
    },
    {
        "text": " porque además nosotros tenemos un proceso que nos opuamos a estudiar la mano,",
        "start": 3359.42,
        "end": 3363.42
    },
    {
        "text": " que es el del Mercosul y el Mercosul tiene la libre circulación de bienes y servicios,",
        "start": 3363.42,
        "end": 3369.42
    },
    {
        "text": " y de servicios factoriales y de trabajadores.",
        "start": 3369.42,
        "end": 3372.42
    },
    {
        "text": " Entonces, de alguna manera, lo que se implementa en términos de política económica,",
        "start": 3372.42,
        "end": 3377.42
    },
    {
        "text": " de política comercial y calar, pero de política económica, de política laboral,",
        "start": 3377.42,
        "end": 3381.42
    },
    {
        "text": " también influye a nosotros.",
        "start": 3381.42,
        "end": 3384.42
    },
    {
        "text": " Por ejemplo, para ver a un caso extremo de lo que es la política en Brasil,",
        "start": 3387.42,
        "end": 3391.42
    },
    {
        "text": " de lo que es la propuesta de esta reforma de flexibilidad laboral en Brasil,",
        "start": 3391.42,
        "end": 3395.42
    },
    {
        "text": " las mujeres embarazadas no pueden trabajar en determinadas condiciones.",
        "start": 3395.42,
        "end": 3400.42
    },
    {
        "text": " Acá dice que si el médico la sabilita y que si las mujeres quieren,",
        "start": 3400.42,
        "end": 3404.42
    },
    {
        "text": " pueden trabajar en cualquier condición, aunque están embarazados,",
        "start": 3404.42,
        "end": 3407.42
    },
    {
        "text": " a actividades de alto riesgo.",
        "start": 3407.42,
        "end": 3409.42
    },
    {
        "text": " Generan planteos de los lados, a favor y en contra.",
        "start": 3412.42,
        "end": 3418.42
    },
    {
        "text": " Y por ejemplo, muchas de las cámaras empresariales, si miran en la prensa,",
        "start": 3418.42,
        "end": 3423.42
    },
    {
        "text": " están saliendo, decir, bueno, este uruguay está muy regulado,",
        "start": 3423.42,
        "end": 3427.42
    },
    {
        "text": " las relaciones laborales son muy complejas, los niveles de conflictidad son muy altos,",
        "start": 3427.42,
        "end": 3431.42
    },
    {
        "text": " los costos laborales son altos, entonces pierdo competitividad.",
        "start": 3431.42,
        "end": 3436.42
    },
    {
        "text": " Por otro lado, todo lo que uno gana en derechos, después perdarlo,",
        "start": 3436.42,
        "end": 3442.42
    },
    {
        "text": " hay muchos avances que se logran nivel de la marca de trabajo,",
        "start": 3442.42,
        "end": 3448.42
    },
    {
        "text": " que ha sido uno de los temas recientes en la región que ha sido de mayor impacto,",
        "start": 3448.42,
        "end": 3455.42
    },
    {
        "text": " por el nivel que tiene.",
        "start": 3455.42,
        "end": 3457.42
    },
    {
        "text": " En nuestro país, hasta mucha gente que famosa por sus defensas,",
        "start": 3460.42,
        "end": 3465.42
    },
    {
        "text": " más a los modelos neoliberales y flexial laborales,",
        "start": 3465.42,
        "end": 3468.42
    },
    {
        "text": " así decir, como bueno, esto es mucho.",
        "start": 3468.42,
        "end": 3471.42
    },
    {
        "text": " Algunos países se mantienen los gobiernos de corte progresista,",
        "start": 3472.42,
        "end": 3476.42
    },
    {
        "text": " aunque con ciertos cambios, ¿no?",
        "start": 3476.42,
        "end": 3479.42
    },
    {
        "text": " Que tienen que ver.",
        "start": 3479.42,
        "end": 3480.42
    },
    {
        "text": " Con mayor preocupación por los equilibrios macroeconómicos,",
        "start": 3480.42,
        "end": 3484.42
    },
    {
        "text": " aunque sin dejar los objetivos sociales, sin llegar adelante las regulaciones laborales.",
        "start": 3484.42,
        "end": 3489.42
    },
    {
        "text": " Los ejemplos más claros son nuestro país y son ecuador.",
        "start": 3489.42,
        "end": 3494.42
    },
    {
        "text": " Y en nuestro país que ha pasado, en realidad,",
        "start": 3496.42,
        "end": 3498.42
    },
    {
        "text": " hemos tenido un contexto internacional diferente,",
        "start": 3498.42,
        "end": 3501.42
    },
    {
        "text": " los precios de los comodities que han bajado.",
        "start": 3501.42,
        "end": 3504.42
    },
    {
        "text": " Uruguay tuvo muy buenas inversiones externas,",
        "start": 3504.42,
        "end": 3511.42
    },
    {
        "text": " tuvo unas tasas de crecimiento bien interesantes,",
        "start": 3511.42,
        "end": 3515.42
    },
    {
        "text": " que se mantuvieron durante muchos años, pero los últimos años han bajado.",
        "start": 3515.42,
        "end": 3519.42
    },
    {
        "text": " Entonces, eso genera problemas a nivel fiscal,",
        "start": 3519.42,
        "end": 3522.42
    },
    {
        "text": " donde las estructuras de gasto, a veces, son complejas de gastos que están muy comprometidos.",
        "start": 3522.42,
        "end": 3527.42
    },
    {
        "text": " Entonces, un poco la política ha sido y tuvimos niveles de inflación,",
        "start": 3527.42,
        "end": 3532.42
    },
    {
        "text": " bastante importantes, que superaron las metas de inflación.",
        "start": 3532.42,
        "end": 3535.42
    },
    {
        "text": " El sistema de metas de inflación, lo que hace es gobernó fija de terminadas metas",
        "start": 3535.42,
        "end": 3539.42
    },
    {
        "text": " y maneja la política de forma dada de que la inflación no pase esa meta.",
        "start": 3539.42,
        "end": 3543.42
    },
    {
        "text": " Entonces, de alguna forma, tener esa meta de inflación,",
        "start": 3543.42,
        "end": 3546.42
    },
    {
        "text": " lo que nos permite es que las previsiones económicas puedan estar atadas.",
        "start": 3546.42,
        "end": 3549.42
    },
    {
        "text": " Cuando no logró concretar esa meta y me paso en la meta de inflación",
        "start": 3549.42,
        "end": 3553.42
    },
    {
        "text": " y tengo algunos inconvenientes en términos de la confianza y las expectativas.",
        "start": 3553.42,
        "end": 3558.42
    },
    {
        "text": " En este año, lo que se ha logrado retomar un ascender de crecimiento",
        "start": 3558.42,
        "end": 3564.42
    },
    {
        "text": " en el primer y el segundo semestre el año se ha verificado un crecimiento",
        "start": 3564.42,
        "end": 3568.42
    },
    {
        "text": " que estuvo un poco por encima de las previsiones.",
        "start": 3568.42,
        "end": 3570.42
    },
    {
        "text": " El año pasado, cuando yo di esta clase, comente que lo opuesto.",
        "start": 3570.42,
        "end": 3575.42
    },
    {
        "text": " Es que había determinado previsiones de baja en el crecimiento",
        "start": 3575.42,
        "end": 3580.42
    },
    {
        "text": " y fueron mayores de las que se prevían.",
        "start": 3580.42,
        "end": 3583.42
    },
    {
        "text": " Había diferencias entre las previsiones oficiales y las privadas.",
        "start": 3583.42,
        "end": 3587.42
    },
    {
        "text": " Y las oficiales tuvieron que ajustarse a la baja.",
        "start": 3587.42,
        "end": 3590.42
    },
    {
        "text": " Y la inflación todavía se ha siendo un tema de mucha preocupación.",
        "start": 3590.42,
        "end": 3596.42
    },
    {
        "text": " Si bien los efectos no estaban tandados en un mercado de trabajo.",
        "start": 3596.42,
        "end": 3599.42
    },
    {
        "text": " En este año, los efectos empezaron a sentir en un mercado de trabajo",
        "start": 3599.42,
        "end": 3603.42
    },
    {
        "text": " durante todo el primer semestre del año, hubo un deterioro en términos del desempleo.",
        "start": 3603.42,
        "end": 3609.42
    },
    {
        "text": " Básicamente explicado por la falta de generación de empleo.",
        "start": 3609.42,
        "end": 3615.42
    },
    {
        "text": " Se controlo el tema de la inflación. A partir de marzo pasamos estar por debajo del rango meta y en baja.",
        "start": 3615.42,
        "end": 3623.42
    },
    {
        "text": " Y los niveles de crecimiento fueron mayores que se esperaban muy magros, pero fueron mayores.",
        "start": 3623.42,
        "end": 3634.42
    },
    {
        "text": " De hecho, en el 2015 se hablaba del tema de crecimiento y se decía que en el 17-18 se va a retomar la agenda de crecimiento.",
        "start": 3634.42,
        "end": 3642.42
    },
    {
        "text": " Este crecimiento no es uniforme en todos los sectores, hay sectores que están más potenciados que otros.",
        "start": 3642.42,
        "end": 3648.42
    },
    {
        "text": " Y sobre todo, el sector agroesportador y ese uno de los que está más comprometido.",
        "start": 3649.42,
        "end": 3656.42
    },
    {
        "text": " Les recomendamos para la parte Uruguay leer el último informe del Banco Central que lo tomamos como parte de los datos.",
        "start": 3656.42,
        "end": 3663.42
    },
    {
        "text": " Si ahí tienen un poco el comportamiento de las variables por origen, los distintos sectores de producción",
        "start": 3663.42,
        "end": 3670.42
    },
    {
        "text": " y también por destino que pasa con inconsumo, que pasa con inversión pública, que pasa con inversión privada.",
        "start": 3670.42,
        "end": 3676.42
    },
    {
        "text": " Seportaciones, las importaciones. Bien. Bueno, el contexto internacional ha cambiado.",
        "start": 3676.42,
        "end": 3683.42
    },
    {
        "text": " La caída de los precios de los comoditos ha sido una dificultad notoria para el crecimiento.",
        "start": 3683.42,
        "end": 3688.42
    },
    {
        "text": " Ahora está mejorando un poco los precios relativos de entredenidos de la leche, de la soja, de amenido mejorando.",
        "start": 3688.42,
        "end": 3700.42
    },
    {
        "text": " Los sectores de exportadores se dicen que no pueden captar esa mejora en los precios porque tienen un incremento fuerte en los costos de producción",
        "start": 3700.42,
        "end": 3708.42
    },
    {
        "text": " y dentro de los diagnósticos que manejan, manejan. Algunos son un poco la mano de obra, otros los sistemas tributarios, otros las tarifas públicas.",
        "start": 3708.42,
        "end": 3717.42
    },
    {
        "text": " Eso depende de un poco de la estructura de costos que tengan cada uno y de la propensión de su producción al mercado externo.",
        "start": 3717.42,
        "end": 3725.42
    },
    {
        "text": " Yo tengo una producción que más de 90% se va a la exportación y tengo que ver los temas de competitividad.",
        "start": 3725.42,
        "end": 3731.42
    },
    {
        "text": " Si tengo un porcentaje importante colocado en nivel del mercado externo y bueno tengo otras mercados que atender.",
        "start": 3731.42,
        "end": 3739.42
    },
    {
        "text": " Los sistemas impositivos hoy no es en general un peso porque el sistema impositivo está muy asociado a la renta.",
        "start": 3739.42,
        "end": 3750.42
    },
    {
        "text": " Entonces bueno, la realidad voy a aportar en la medida que es en general de renta.",
        "start": 3750.42,
        "end": 3756.42
    },
    {
        "text": " Bien, eliraré y también hay un fomento a las inversiones vía a los descuentos impositivos.",
        "start": 3756.42,
        "end": 3765.42
    },
    {
        "text": " Bien, el crecimiento del producto interno bruto per cápita, ahí vemos la comparación para los distintos países, tampoco borroso por la lámpara.",
        "start": 3765.42,
        "end": 3775.42
    },
    {
        "text": " Ahí tienen para los años 2016, 2015 y 2014.",
        "start": 3776.42,
        "end": 3783.42
    },
    {
        "text": " Las proyecciones 2017 están ajustando pero hay algunos documentos que lo ven.",
        "start": 3784.42,
        "end": 3790.42
    },
    {
        "text": " Y bueno, ¿qué ha pasado en este 2016, 2017? Vamos a hacer tratar de llevarlo un poco a la cusuntura de estos últimos meses, lo que nos preocupa a ver a todos.",
        "start": 3790.42,
        "end": 3799.42
    },
    {
        "text": " Para este análisis, tomamos como referencia un documento del acepal, que es el último análisis de crecimiento donde ustedes les pedimos que sí o sí estudien el resumen ejecutivo.",
        "start": 3800.42,
        "end": 3817.42
    },
    {
        "text": " Si quieren leer los libros, tomamos así, lo pueden imprimir o lo pueden leer en la web, como aquí.",
        "start": 3817.42,
        "end": 3824.42
    },
    {
        "text": " Lean el resumen ejecutivo, que les datos, estos conceptos, si bien hicimos una presentación bastante detallada y les recomendamos leer el capítulo de Uruguay, que son no son ni diez carillas, son ocho.",
        "start": 3825.42,
        "end": 3842.42
    },
    {
        "text": " ¿Dónde está el análisis 2016, 2016? ¿Era el acepal y incorporamos los datos un poco de la región?",
        "start": 3843.42,
        "end": 3848.42
    },
    {
        "text": " Cuando analizamos estas análisis de proyecciones o tendencias, ustedes van a ver que según dónde leamos la proyección o tendencia, pueden tener diferencias de los niveles que bárden, pero no hay diferencias en cuanto a las tendencias.",
        "start": 3849.42,
        "end": 3861.42
    },
    {
        "text": " Es un poco lo que nos interesa ver. Esos por los modelos de construcción, básicamente.",
        "start": 3861.42,
        "end": 3868.42
    },
    {
        "text": " Pero esta material está super actualizado, hay una publicación que salió en mi pasado, así que la idea es un poco traerlos a aplicar conceptos macro, a aplicar los modelos scriptivos, pero también con información que sea actualizado.",
        "start": 3868.42,
        "end": 3885.42
    },
    {
        "text": " Después el tipo de análisis que uno hace, es más o menos el mío, ni importar, ni que estemos, pero también entiendo que si les damos algo y decimos cómo analizar, ¿qué pasó en el 90 más o menos?",
        "start": 3885.42,
        "end": 3897.42
    },
    {
        "text": " ¿Pero qué vamos a analizar? Bueno, los queremos meter un esquema de razonamiento económico que conozcan un poco cuál es la realidad regional y cuál es el mercado trabajo que les toca a ustedes insertarse, ¿no?",
        "start": 3897.42,
        "end": 3911.42
    },
    {
        "text": " Y cuál son las restricciones que tenemos. Yo siempre digo que el manejo de las variables económicas, ni importa la porofesión que uno esté, más o sea que a veces, en persona de sacar un examen y de usted que es un medio raro.",
        "start": 3911.42,
        "end": 3926.42
    },
    {
        "text": " ¿Cómo entendían natas número era? Me sorprendió que dije, no, usted que son medio raro, pero bueno, tenemos una cabeza razonamiento diferente, los ingenieros que los economistas.",
        "start": 3926.42,
        "end": 3937.42
    },
    {
        "text": " Nosotros somos más blandos, el economista siempre dice, está previsto que ahí después no se sabe de qué pasa.",
        "start": 3937.42,
        "end": 3948.42
    },
    {
        "text": " Pero en general, el manejo y las variables económicas en las disciplinas que ustedes trabajan es un momento relevante.",
        "start": 3948.42,
        "end": 3957.42
    },
    {
        "text": " ¿Por qué? Los costos de producción te condicionan el realizar en un determinado proyecto, la disponibilidad de los recursos, la generación o no de ingresos o vanancias, entonces,",
        "start": 3957.42,
        "end": 3974.42
    },
    {
        "text": " ustedes vean los desistápticas y cuál es el contexto económico en el cual lo van a desarrollar y bueno, va a ser sumamente importante.",
        "start": 3974.42,
        "end": 3982.42
    },
    {
        "text": " Bien, la economía mundial, cuál es el contexto internacional? Entonces, en este análisis, estos últimos dos años, siempre cuál vamos a hacer los pasos, cuál es el contexto regional, internacional y cuál es el contexto de la región y después vamos a ver a la realidad país.",
        "start": 3982.42,
        "end": 4000.42
    },
    {
        "text": " En este caso, nos vamos a quedar un poco en América Latina y cuando analizamos a América Latina con esas dificultades, después tenemos qué pasa a nivel de cada región, de cada país y hay diferencias.",
        "start": 4000.42,
        "end": 4012.42
    },
    {
        "text": " Entonces, contexto internacional en el cual estamos en estos 2016, principios 2017.",
        "start": 4012.42,
        "end": 4021.42
    },
    {
        "text": " La economía regional creció en el mundial, perdón, creció en el 2016 a una taza de 2,4%, y para el 2017 se espera un crecimiento del 2,7%, un poquito por encima de lo que estaba en el 2016, como resultado de un más sordinamismo del grupo de las economías desarrolladas como de las emergentes y la centrancisión.",
        "start": 4021.42,
        "end": 4046.42
    },
    {
        "text": " O sea, esa proyección que mejora un poquito el crecimiento, se espera que sea nivel generalizado, tanto en las economías más desarrolladas como en las economías en desarrollo.",
        "start": 4046.42,
        "end": 4058.42
    },
    {
        "text": " Sí. La taza de crecimiento de las economías en desarrollo que ha mostrado una tendencia a la baja en los últimos años estaría recuperándose un 4,2%.",
        "start": 4058.42,
        "end": 4070.42
    },
    {
        "text": " Esto es el último año que ha venido en baja y estaríamos mejor. Y para las economías desarrolladas se proyecta una taza de crecimiento de 2%, superior a la registrada, en el año anterior, con Estados Unidos como principal motor de este grupo, cuya expansión podría pasar de el 1,6%.",
        "start": 4070.42,
        "end": 4093.42
    },
    {
        "text": " Y creo que era, sí, 1,6 al 2,1 en el 2017. El comercio mundial ha cobrado bajo ordina mismo en el primer trimestre de 2017, aunque las tazas de crecimiento aún continúan muy por debajo de las observadas antes de la crisis financiera mundial.",
        "start": 4093.42,
        "end": 4110.42
    },
    {
        "text": " Las tazas de crecimiento del volumen de comercio mundial han superado, no, han crecido partido en noviembre en el 2016.",
        "start": 4110.42,
        "end": 4120.42
    },
    {
        "text": " Entonces, la recuperación de la actividad y del comercio mundial en el año 2017 con precios de los productos básicos más altos que este año, bien encreciéndolo los precios de los productos básicos, no, de alguna manera han mejorado fundamentalmente en energía y en materia prima, en metales minerales, no.",
        "start": 4121.42,
        "end": 4147.42
    },
    {
        "text": " Los mercados financieros han bajado sus niveles de volatilidad y eso se debe fundamentalmente a momentos importantes en los precios de los mercados accionarios.",
        "start": 4147.42,
        "end": 4159.42
    },
    {
        "text": " Y a pesar de la consolidación del crecimiento y de una menor volatilidad, todavía existe algún tema de incertidumbre en temas de las políticas comerciales.",
        "start": 4159.42,
        "end": 4168.42
    },
    {
        "text": " ¿Por qué? Porque en los últimos años uno de los grandes problemas que tenemos a nivel del comercio es que hay una tendencia a la regulación, a las mayores medidas proteccionistas y a las distorsiones.",
        "start": 4168.42,
        "end": 4179.42
    },
    {
        "text": " Si bien los países se entran en pro... Nosotros tenemos, los países tienen acuerdos internacionales a través de la remisación mundial del comercio que se comprometen a determinados niveles de...",
        "start": 4179.42,
        "end": 4190.42
    },
    {
        "text": " Hay cosas que son desleales, que no se pueden hacer, pero si se ha visto en los últimos años, medidas proteccionistas importantes.",
        "start": 4190.42,
        "end": 4199.42
    },
    {
        "text": " Muchas veces que están salvaguardadas en temas sanitarios, pero que detrás siempre hay un fin comercial, dicen no, entonces hay medidas que son de corte arancelarios, pero otras que son para arancelarias y que de algunas formas generan distorsiones.",
        "start": 4199.42,
        "end": 4216.42
    },
    {
        "text": " Uruguay, en eso a veces tiene complejidades altas. Por ejemplo, todos esta negociación que hay entre la Unión Europea y el Mercosur, que surge desde la creación está planteado desde el año 95, que la Unión Europea, el Mercosur van a traer un proceso de negociación, tuvieron algunos negociaciones iniciales, después de tubo y ahora se está retomando y quieren se dar un acuerdo, ¿cuál es el gran bloqueo que tiene la discusión hoy?",
        "start": 4216.42,
        "end": 4245.42
    },
    {
        "text": " Están a... tuvieron esta semana reunidos en Brasilia, este año hubo dos instancias en Procele, se ha dado en Brasilia.",
        "start": 4245.42,
        "end": 4252.42
    },
    {
        "text": " Queréis que ver con la cuota de los productos aeropequarios. Uruguay, este pretendía entrar una... perdón, Mercosur pretendía entrar una cuota de 300 mil doneladas de carnes anuales en la Unión Europea que representan un porcentaje menor al 20% del consumo que tiene.",
        "start": 4252.42,
        "end": 4272.42
    },
    {
        "text": " Y hoy están hablando de 70 mil doneladas, prácticamente nada. Y después tiene que ponerse a negociar en la internet loque, ¿no?",
        "start": 4272.42,
        "end": 4285.42
    },
    {
        "text": " Como si tengo una cuota para entrar en el mercado europeo que es altamente regulado y sobre todo en los productos primarios porque hay sectores muy regulados, los lácteos, en Holanda, en Francia, Alemania.",
        "start": 4285.42,
        "end": 4298.42
    },
    {
        "text": " Y después hay todo otro canjunto de medidas, que después hay sistemas de protecciones a través de subsidios, a través de temas...",
        "start": 4298.42,
        "end": 4309.42
    },
    {
        "text": " Ahora todo el tema sanitario y si hay determinadas producciones que de aplican determinados productos eso no pueden ingresar y funcionan como barreras al comercio.",
        "start": 4309.42,
        "end": 4320.42
    },
    {
        "text": " Bien. Bueno, el contexto a nivel de la región, la situación económica y las progreditivas para el 2017, ¿cuáles son?",
        "start": 4320.42,
        "end": 4334.42
    },
    {
        "text": " En un contexto demoderado pero sostenido crecimiento, mejorando la situación de la economía mundial y de mejora en los precios de las materias primas que exporta la región.",
        "start": 4334.42,
        "end": 4344.42
    },
    {
        "text": " Ideal de incertidumbre derivada de los riesgos políticos globales se mantiene la proyección de un cambio positivo en la dinámica de crecimiento regional para el año un curso,",
        "start": 4344.42,
        "end": 4354.42
    },
    {
        "text": " lo que llevaría una lenta expansión económica de dos años de contracción del PVIR regional. Después de dos años de contracción estaríamos en una situación de empezar a mejorar.",
        "start": 4354.42,
        "end": 4364.42
    },
    {
        "text": " ¿Por qué? Porque el contexto económico internacional, a pesar de que hay nivel de incertidumbre altos, lo estaría potenciando y hay una mejora en los precios que la región exporta.",
        "start": 4364.42,
        "end": 4375.42
    },
    {
        "text": " Para el 2017 se espera un alza del 1 con 1 en la tasa de crecimiento promedio. Significa un aumento en 1 del producto interno per capita en promedio y a nivel de las sub-regionales se mantendrían distintas intensidades en la dinámica de crecimiento entre los países y las regiones.",
        "start": 4375.42,
        "end": 4396.42
    },
    {
        "text": " En América del Sur se espera un crecimiento del 0 con 6% en Centroamérica y México del 2 con 5 y en el Caribe del 1 con 2.",
        "start": 4396.42,
        "end": 4405.42
    },
    {
        "text": " Eso sería más o menos los grandes bloques a nivel de la región y las diferencias grandes en términos de crecimiento.",
        "start": 4405.42,
        "end": 4413.42
    },
    {
        "text": " El crecimiento de América del Sur está muy comprometido por la realidad de Brasil.",
        "start": 4414.42,
        "end": 4420.42
    },
    {
        "text": " Porque si ponemos lo que pesa Uruguay y está en mis ponderados, va a estar muy chico.",
        "start": 4420.42,
        "end": 4429.42
    },
    {
        "text": " Más o nivel de los precios los productos básicos y contextos financieros de menor volatilidad, aunque persiste en muchas incertidumbre.",
        "start": 4429.42,
        "end": 4437.42
    },
    {
        "text": " La situación política internacional está muy inestable.",
        "start": 4437.42,
        "end": 4440.42
    },
    {
        "text": " Finaliza la contracción se recupera lentamente el crecimiento de las economías en América Latina y se mantiene la elevada de teogenidad entre los países.",
        "start": 4441.42,
        "end": 4450.42
    },
    {
        "text": " En el primer trimestre en 2017 la tasa de crecimiento regional mostraba una aceleración respecto a los resultados del trimestre del mismo trimestre del 2016.",
        "start": 4450.42,
        "end": 4460.42
    },
    {
        "text": " Siempre se comparan los mismos trimestres, ¿por qué? Por el efecto astral, didad y los años.",
        "start": 4460.42,
        "end": 4466.42
    },
    {
        "text": " No puedo comparar marzo con diciembre.",
        "start": 4467.42,
        "end": 4470.42
    },
    {
        "text": " La demanda crece impulsada por la recuperación en la inversión y en menor medida por el consumo privado.",
        "start": 4473.42,
        "end": 4483.42
    },
    {
        "text": " A pesar de que en el segundo semestre del 2016 la inflación promedio de las economías se ha reducido,",
        "start": 4483.42,
        "end": 4489.42
    },
    {
        "text": " a que 13 economías han mantenido tasas superiores al 20%. Una de esas se Venezuela.",
        "start": 4490.42,
        "end": 4498.42
    },
    {
        "text": " Desde mediados del 2016 la inflación se ha reducido en los distintos componentes del índice de precios al consumo y la que tiene más orcaidad es la inflación en el alimento,",
        "start": 4498.42,
        "end": 4510.42
    },
    {
        "text": " que es la que más afecta a las clases trabajadoras o de las clases de menores ingresos por el peso que tiene la alimentación en el ingreso total.",
        "start": 4510.42,
        "end": 4517.42
    },
    {
        "text": " El trimestre del 2016, los indicadores laborales muestran un nuevo deterioro pero de una magnitud menor a la registra en el 2016.",
        "start": 4520.42,
        "end": 4529.42
    },
    {
        "text": " Vieron que el análisis del después ya vamos a ver muy parecido a lo que pasa en Uruguay.",
        "start": 4529.42,
        "end": 4536.42
    },
    {
        "text": " Uruguay siguió bastante esta tendencia. El problema más fuerte ahora en las regiones y los temas laborales que el deterioro en el mercado de trabajo se sigue manteniendo.",
        "start": 4536.42,
        "end": 4545.42
    },
    {
        "text": " Hay un tema de expectativas que está jugando a nivel empresarial.",
        "start": 4546.42,
        "end": 4550.42
    },
    {
        "text": " Se espera que en el 2017 el saldo en la cuenta corriente se mantenga a niveles similares al 2 del 2016.",
        "start": 4550.42,
        "end": 4556.42
    },
    {
        "text": " La balanza de bienes continuaría ampliando su super hábit, pero a diferencia de lo ocurrido que se bruja una fuerte contra acción de las importaciones,",
        "start": 4556.42,
        "end": 4565.42
    },
    {
        "text": " el resultado será por una mejora en la nivel de las exportaciones.",
        "start": 4565.42,
        "end": 4570.42
    },
    {
        "text": " En la línea de que mejoraron los precios y mejoraron los términos de intercambio para la región.",
        "start": 4571.42,
        "end": 4576.42
    },
    {
        "text": " Durante el 2016 la recuperación de las precios de los productos básicos y el aumento del volumen exportado tendría un impacto positivo en el valor de las exportaciones regionales,",
        "start": 4576.42,
        "end": 4584.42
    },
    {
        "text": " pero podría crecer por primera vez en cuatro años consecutivos. Hay un crecimiento de las exportaciones y un crecimiento de la demanda interna y estarma.",
        "start": 4584.42,
        "end": 4592.42
    },
    {
        "text": " Entonces, a nivel de los componentes del crecimiento podemos ver eso.",
        "start": 4592.42,
        "end": 4597.42
    },
    {
        "text": " Mi importado de tenernos un poco en el tema de empleo, que es un poco lo que más está preocupando, por eso nos vamos a tener además de la importancia que tiene porque es el tema central.",
        "start": 4598.42,
        "end": 4608.42
    },
    {
        "text": " El tema odio de la agenda política de Noruguay es el empleo. Con tuve la inflación, el déficit, el táno sé que estoy recuperando en la Ley de Presimiento que pasa con el empleo,",
        "start": 4608.42,
        "end": 4616.42
    },
    {
        "text": " que no recién ahora en estos últimos dos datos del lipes de la actividad y el mercado trabajo está el desempleo bajo en vencedir a aumentar.",
        "start": 4617.42,
        "end": 4630.42
    },
    {
        "text": " El empleo en el primer trimestre de 2017 en nivel de la región que pasó con el mercado laboral, incrementa la oferta laboral.",
        "start": 4630.42,
        "end": 4639.42
    },
    {
        "text": " Un aumento de la tasa de participación se acuerdan. Hay una caída del empleo por una debilidad básicamente en la creación del empleo a salariado.",
        "start": 4639.42,
        "end": 4648.42
    },
    {
        "text": " Y eso lleva a tres importantes cosas. Empiornamiento a los niveles de desempleo, pero también un deterioro en la calidad del empleo y un peor de desempeño se da a nivel urbano que rural.",
        "start": 4648.42,
        "end": 4660.42
    },
    {
        "text": " Que también es donde hay masiones niveles de concentración de la población en el mucho país.",
        "start": 4661.42,
        "end": 4667.42
    },
    {
        "text": " El déficit fiscal, pero a medio en América Latina se mantendrá estable, menos tres por no por ciento o más o menos del PI.",
        "start": 4667.42,
        "end": 4674.42
    },
    {
        "text": " Y las tendencias van a ser bien diferentes en las regiones. En América del Sur los presupuestos parece indicar que hay una mejora en términos del déficit,",
        "start": 4674.42,
        "end": 4683.42
    },
    {
        "text": " se reduce el déficit fiscal no básicamente como resultado de políticas de ajuste.",
        "start": 4683.42,
        "end": 4690.42
    },
    {
        "text": " La concentración significativo baja del gasto público. En Centroamérica de Caribe se espera que el déficit aumenta,",
        "start": 4690.42,
        "end": 4700.42
    },
    {
        "text": " mientras que los ingresos públicos se estiman a la baja para 2017. Las políticas anuncian que hay un recorte generalizado del gasto público.",
        "start": 4700.42,
        "end": 4710.42
    },
    {
        "text": " En términos de inflación se ha logrado una baja en las niveles de inflación que estuvieron presiones salalzas muy puertes durante 2014-2015,",
        "start": 4713.42,
        "end": 4728.42
    },
    {
        "text": " la dinámica de inflación en las economías de América Latina y Caribe tiene una gran heterogeneidad de todas formas.",
        "start": 4728.42,
        "end": 4735.42
    },
    {
        "text": " En el medio de 2016 la inflación se ha reducido en las economías de América Latina del Sur, en las economías del Caribe,",
        "start": 4735.42,
        "end": 4742.42
    },
    {
        "text": " de Nueva La Ispana, mientras que se ha incrementado en la subrecisión que figura Centroamérica,",
        "start": 4742.42,
        "end": 4747.42
    },
    {
        "text": " IT, México y República Dominicana.",
        "start": 4747.42,
        "end": 4750.42
    },
    {
        "text": " La dinámica del Cicloctual se va impulsar esencialmente por el consumo privado y por el gasto del gobierno,",
        "start": 4754.42,
        "end": 4760.42
    },
    {
        "text": " y en el que se ha cambiado la inversión de las exportaciones que son determinantes,",
        "start": 4760.42,
        "end": 4764.42
    },
    {
        "text": " más importantes de la demanda agregada para la acumulación de capital, la generación de capital,",
        "start": 4764.42,
        "end": 4769.42
    },
    {
        "text": " han jugado un papel secundario en el ciclo económico si vemos un poco más amplio los últimos años.",
        "start": 4769.42,
        "end": 4777.42
    },
    {
        "text": " Básicamente el cicloctual y las características responden a los cambios en las economías desarrolladas",
        "start": 4778.42,
        "end": 4784.42
    },
    {
        "text": " que se han plasmado en una disminución de la tasa de crecimiento del Producto Bruto Interno,",
        "start": 4784.42,
        "end": 4790.42
    },
    {
        "text": " un estancamiento de la inversión bruta básicamente de como impacto de la crisis financiera mundial.",
        "start": 4790.42,
        "end": 4796.42
    },
    {
        "text": " Las incertidumbre de corte político han de alguna forma jugado fuertemente en todo lo que son las decisiones de inversión,",
        "start": 4796.42,
        "end": 4804.42
    },
    {
        "text": " la debilidad en la demanda agregada mundial ha decidido significativamente en la caída del comercio",
        "start": 4804.42,
        "end": 4811.42
    },
    {
        "text": " que recién ahora en estos años se ha recuperado y hay importantes desafíos en lo que es el manejo",
        "start": 4811.42,
        "end": 4817.42
    },
    {
        "text": " de la cusuntura en el corto plazo, sobre todo como elemento para poder manejar la estabilidad económica",
        "start": 4817.42,
        "end": 4824.42
    },
    {
        "text": " como elemento para manejar el crecimiento de mediano y largo plazo en la región,",
        "start": 4824.42,
        "end": 4828.42
    },
    {
        "text": " que es un poco lo que está más comprometido.",
        "start": 4828.42,
        "end": 4830.42
    },
    {
        "text": " El sector es portador que es de gran peso, no se estima a carreter tomar el dinamismo ni es viable",
        "start": 4830.42,
        "end": 4838.42
    },
    {
        "text": " que se pueda incentivar la demanda de interna como el consumo,",
        "start": 4838.42,
        "end": 4841.42
    },
    {
        "text": " o sea que a pesar de que venimos en una senda de mejores crecimiento y se espera",
        "start": 4841.42,
        "end": 4846.42
    },
    {
        "text": " al mejor desempeños en las precios de las materias primas,",
        "start": 4846.42,
        "end": 4849.42
    },
    {
        "text": " no vamos a llegar a tener picos como estaban antes.",
        "start": 4849.42,
        "end": 4852.42
    },
    {
        "text": " Esa es una preocupación del sector esportador.",
        "start": 4853.42,
        "end": 4855.42
    },
    {
        "text": " Han venido mejorando el precio de la leche, han venido mejorando el precio de la roja,",
        "start": 4859.42,
        "end": 4862.42
    },
    {
        "text": " han venido mejorando pero no va a ser significativo, no para dar vuelta a la ecuación.",
        "start": 4862.42,
        "end": 4869.42
    },
    {
        "text": " El sector esportador muchas veces se centraba en crisis y dos por tres tenía picos de su precio",
        "start": 4870.42,
        "end": 4874.42
    },
    {
        "text": " y que le daban ingresos para salvarla que venía.",
        "start": 4874.42,
        "end": 4879.42
    },
    {
        "text": " En este momento, por lo menos lo que trabajamos en el sector esportador,",
        "start": 4879.42,
        "end": 4884.42
    },
    {
        "text": " no estamos visualizando eso.",
        "start": 4884.42,
        "end": 4886.42
    },
    {
        "text": " Yo trabajo en un sector que ha venido en cinco años de pérdida, que es el sector arrosero",
        "start": 4889.42,
        "end": 4893.42
    },
    {
        "text": " y el diagnóstico que tenemos es que hase aguantado estos cinco años",
        "start": 4893.42,
        "end": 4896.42
    },
    {
        "text": " porque cuando tuvo el pico de precio alto, uso buenas inversiones y uso un uso racional",
        "start": 4896.42,
        "end": 4902.42
    },
    {
        "text": " para aguantar estos cinco años, pero ahora como que estarían en un límite.",
        "start": 4903.42,
        "end": 4906.42
    },
    {
        "text": " Y el diagnóstico que tenemos es que si bien hemos tenido una mejora relativa",
        "start": 4906.42,
        "end": 4911.42
    },
    {
        "text": " en el ingreso de las esportaciones con el 95% de la producción esportada,",
        "start": 4911.42,
        "end": 4916.42
    },
    {
        "text": " los costos nos estarían siendo palencima, por eso las propuestas que hemos hecho",
        "start": 4916.42,
        "end": 4921.42
    },
    {
        "text": " es hacerse a fondos más críticos y de mayor que podrían ser de mayor de esas justas",
        "start": 4921.42,
        "end": 4926.42
    },
    {
        "text": " que es de tarifa públicas, o sea, podríamos, como la electricia del combustible tiene peso,",
        "start": 4926.42,
        "end": 4931.42
    },
    {
        "text": " el análisis que hacemos es decir, bueno, tienen peso nuestra costos,",
        "start": 4931.42,
        "end": 4936.42
    },
    {
        "text": " Uruguay ha logrado tener mejores ingresos en términos de energía eléctrica",
        "start": 4936.42,
        "end": 4941.42
    },
    {
        "text": " a través de la diversificación de la matriz energética, a través de la generación",
        "start": 4941.42,
        "end": 4945.42
    },
    {
        "text": " de energía saltamativa, si ahora está haciendo buenas esportaciones de energía,",
        "start": 4945.42,
        "end": 4950.42
    },
    {
        "text": " hay ingresos mejores para UTI y después en términos de combustible parece que,",
        "start": 4950.42,
        "end": 4957.42
    },
    {
        "text": " bueno, las medidas tomadas en UNCAP estarían posibilitando generar mejores resultados",
        "start": 4957.42,
        "end": 4964.42
    },
    {
        "text": " de la empresa y también analizamos la paría de importación que es un dato que presenta",
        "start": 4964.42,
        "end": 4971.42
    },
    {
        "text": " el propio gobierno a través de los sentos de contra laboraje y bueno,",
        "start": 4971.42,
        "end": 4975.42
    },
    {
        "text": " como se puede acceder a combustible más competitivo, para mostrar el tipo",
        "start": 4975.42,
        "end": 4981.42
    },
    {
        "text": " de razonamiento que estemos, a nivel sectorial y comparamos los costos de producción",
        "start": 4981.42,
        "end": 4987.42
    },
    {
        "text": " con la región y nuestros costos están bastante parecidos a las de Brasil pero muy",
        "start": 4987.42,
        "end": 4992.42
    },
    {
        "text": " por encima de los de Paraguay que se ha surgido con un competidor interesante en muchos",
        "start": 4992.42,
        "end": 4997.42
    },
    {
        "text": " rugos y hay muchos capitales que se están molcando hacia Paraguay.",
        "start": 4997.42,
        "end": 5001.42
    },
    {
        "text": " Si bien tiene una institucionalidad que todavía es muy débil.",
        "start": 5001.42,
        "end": 5005.42
    },
    {
        "text": " Bueno, el comentario este fue un anexo para analizar un poco el razonamiento",
        "start": 5006.42,
        "end": 5013.42
    },
    {
        "text": " que se estaba haciendo del sector esportador que retomara su dinamismo pero que no tiene",
        "start": 5013.42,
        "end": 5017.42
    },
    {
        "text": " las expectativas de que a nivel de los precios agrícolas a veces algún levento climático",
        "start": 5017.42,
        "end": 5023.42
    },
    {
        "text": " nos espuesta al jugando pero a pesar de todo esto el cambio climático no hay",
        "start": 5023.42,
        "end": 5027.42
    },
    {
        "text": " este nada que nos cambia el movimiento de las monzones y que nos haga un déficit",
        "start": 5027.42,
        "end": 5032.42
    },
    {
        "text": " de algún tipo de producción en Asia se dinamice desde acá.",
        "start": 5032.42,
        "end": 5037.42
    },
    {
        "text": " Para retomar el crecimiento de mediano y largo plazo sería necesario cambiar un poco",
        "start": 5037.42,
        "end": 5041.42
    },
    {
        "text": " la dinamica del ciclo y eso es un poco lo que todavía no está tan claro.",
        "start": 5041.42,
        "end": 5047.42
    },
    {
        "text": " Bueno, el material que les comentaba es estudios económicos sepal,",
        "start": 5047.42,
        "end": 5052.42
    },
    {
        "text": " la dinamica del ciclo económico actual y los desafíos de la política para la inmensar",
        "start": 5052.42,
        "end": 5056.42
    },
    {
        "text": " la inversión 2017, no evito, no evito, el razon menos ejecutivo.",
        "start": 5056.42,
        "end": 5061.42
    },
    {
        "text": " Porque igual de todas formas este material lo armamos con varios capítulos pero en el razon",
        "start": 5062.42,
        "end": 5069.42
    },
    {
        "text": " el ejecutivo tienen todos los conceptos que es importante que lo le han clickado y directo y dentro.",
        "start": 5069.42,
        "end": 5074.42
    },
    {
        "text": " Este material de Roderick está en inglés, después de María la Núñe Paloza",
        "start": 5074.42,
        "end": 5082.42
    },
    {
        "text": " de Sejrecimiento Economico de Sejrecimiento Social que también es este pal,",
        "start": 5082.42,
        "end": 5086.42
    },
    {
        "text": " y la actualización de las proyecciones de crecimiento de Sejrecimiento de Sejrecimiento",
        "start": 5086.42,
        "end": 5090.42
    },
    {
        "text": " son también los materiales, están todos en la web.coines.",
        "start": 5090.42,
        "end": 5093.42
    },
    {
        "text": " Bien.",
        "start": 5093.42,
        "end": 5094.42
    },
    {
        "text": " Bueno, la próxima clase vamos a dedicarnos a globalización, integración y comercio exterior",
        "start": 5100.42,
        "end": 5107.42
    },
    {
        "text": " y vamos a ver el concepto de globalización, vamos a analizar si la globalización es buena,",
        "start": 5107.42,
        "end": 5115.42
    },
    {
        "text": " no es buena, vamos a ver todo el tema de integración en particular el proceso de Mercosur",
        "start": 5116.42,
        "end": 5122.42
    },
    {
        "text": " pero lo que le vamos a agregar este año como nuevos, vamos a dar más en detalle al resto de los procesos",
        "start": 5122.42,
        "end": 5127.42
    },
    {
        "text": " de integración en los cuales está Uruguay y vamos a diferenciar el concepto entre proceso de integración y mecanismo",
        "start": 5127.42,
        "end": 5133.42
    },
    {
        "text": " integración y ahí lo que se les voy a proponer es que el único proceso de integración que Uruguay",
        "start": 5133.42,
        "end": 5139.42
    },
    {
        "text": " está metido es Mercosur los otros son mecanismos porque todavía no se han concretado",
        "start": 5139.42,
        "end": 5143.42
    },
    {
        "text": " en el proceso genuinos de intercambio del bienes y de servicios y vamos a ampliar un poco",
        "start": 5143.42,
        "end": 5150.42
    },
    {
        "text": " hacia esos conceptos más actuales.",
        "start": 5150.42,
        "end": 5153.42
    },
    {
        "text": " Nos vemos el miércoles.",
        "start": 5154.42,
        "end": 5156.42
    },
    {
        "text": " La lógica de la clase va a tratar de ser un poco la misma, vamos a dar todo medio en conjunto",
        "start": 5156.42,
        "end": 5162.42
    },
    {
        "text": " para poder hacer un análisis más detallado de la realidad actual y actualizar todos los valores indicadores.",
        "start": 5162.42,
        "end": 5168.42
    },
    {
        "text": " Muy bien, ese mal.",
        "start": 5168.42,
        "end": 5170.42
    }
]