[
    {
        "text": " muy largo. Ahí me dice que están lavando. Me había olvidado gracias a mi compañero.",
        "start": 0.0,
        "end": 7.44
    },
    {
        "text": " Y bueno, eso va por ahí. No sé qué más, contarle de mí, tengo 31 años, se recen",
        "start": 7.44,
        "end": 16.68
    },
    {
        "text": " 2015, conozco a Jorge desde 2013, la sufrir primera vez en programación 4. Y bueno,",
        "start": 16.68,
        "end": 26.28
    },
    {
        "text": " después es algo que me gustó y la estalea de los sigos sufriendo, pero bueno, la verdad",
        "start": 26.28,
        "end": 33.32
    },
    {
        "text": " es un gran amigo, un gran colegas. Y bueno, ya que nombramos a los centros del curso,",
        "start": 33.32,
        "end": 39.68
    },
    {
        "text": " quería que ya era a Belén también, que hizo un gran trabajo desde el año pasado, tomando",
        "start": 39.68,
        "end": 44.64
    },
    {
        "text": " estas dispositivas que están bastante más aburridas y la convirtió en un lindo material",
        "start": 44.64,
        "end": 50.08
    },
    {
        "text": " para que tengamos hoy para la clase. Así que velo, muchas gracias por por eso. Y bueno,",
        "start": 50.08,
        "end": 56.16
    },
    {
        "text": " si te parece, ya arrancamos un poco con esto. Vale, vamos arriba.",
        "start": 56.16,
        "end": 64.0
    },
    {
        "text": " Este, bueno, ¿por qué aborda esto de emprender, no? Primero que nada, porque hablamos de esto",
        "start": 64.0,
        "end": 71.92
    },
    {
        "text": " en la escuela de ingeniería. Y bueno, creo que sovió, ¿no? Es sovió cuando vemos,",
        "start": 71.92,
        "end": 78.08
    },
    {
        "text": " por ejemplo, que el local salen bolsas, que es eso y todo lo que nos entusiasmos, todo lo",
        "start": 78.08,
        "end": 83.96
    },
    {
        "text": " que a mucho nos puso orgulloso, es otro que nos llamó la atención. Y bueno, hay ingenieras",
        "start": 83.96,
        "end": 89.72
    },
    {
        "text": " haciendo que empresas lleguen a través de la tecnología, que es poco lo que nosotros",
        "start": 89.72,
        "end": 96.8
    },
    {
        "text": " nos formamos y nos especializamos en hacer. Lo que enito están importantes para el país",
        "start": 96.8,
        "end": 101.63999999999999
    },
    {
        "text": " en este caso, pero bueno, para el industria en general, como es, o va a resolver lo que",
        "start": 101.63999999999999,
        "end": 106.11999999999999
    },
    {
        "text": " y lo que al resuelve, ¿no? Y bueno, simplemente perló solo con un ejemplo. La realidad es que",
        "start": 106.12,
        "end": 112.24000000000001
    },
    {
        "text": " hoy por hoy, la conciutura para emprender, es algo que no se había dado antes, tanto",
        "start": 112.24000000000001,
        "end": 119.72
    },
    {
        "text": " a nivel nacional como loval, esto lo venimos diciendo todos los años, ¿no? Y yo pienso en las",
        "start": 119.72,
        "end": 124.68
    },
    {
        "text": " mujeres que dije esto hace cuatro años y pienso ahora que he ido lo mismo. Y cada vez",
        "start": 124.68,
        "end": 128.64000000000001
    },
    {
        "text": " es más cierta esta frase o cada vez es más agudo. El hecho de que cada vez tenemos",
        "start": 128.64000000000001,
        "end": 134.24
    },
    {
        "text": " más oportunidades, digamos, las personas, los indivígos de poder generar o valor nuevo,",
        "start": 134.24,
        "end": 140.44
    },
    {
        "text": " de generar este conocimiento, y eso es lo que hace que cualquiera que se forma, que el intente",
        "start": 140.44,
        "end": 147.68
    },
    {
        "text": " tenga esa oportunidad real y tenga instrumentos para poder llevarla a la práctica, ¿no? Hay",
        "start": 147.68,
        "end": 152.32000000000002
    },
    {
        "text": " que dar apenas 20 años, 30 años, 40 años, 10 años, si no están lejos, está reservado",
        "start": 152.32000000000002,
        "end": 158.04000000000002
    },
    {
        "text": " para muy poco. Después, el otro objetivo es decir, bueno, ok, es cierto que es fácil",
        "start": 158.04,
        "end": 164.35999999999999
    },
    {
        "text": " intentarlo, pero hay que asumir esa tal responsabilidad, este hay riesgo que estar con",
        "start": 164.35999999999999,
        "end": 169.72
    },
    {
        "text": " sociados, y hay posibilidad de lograr o no los objetivos, que bueno, que es poco lo que",
        "start": 169.72,
        "end": 176.39999999999998
    },
    {
        "text": " uno tiene que visualizar a la hora de decir o no emprender. Y bueno, después finalmente",
        "start": 176.39999999999998,
        "end": 183.32
    },
    {
        "text": " dejar algunos punteros hablando del lenguaje de términos de programación, este patrones",
        "start": 183.32,
        "end": 189.16
    },
    {
        "text": " hías, este a cosas, este a bibliografía, a disciplinas, actividades, a un montón de cosas",
        "start": 189.16,
        "end": 196.56
    },
    {
        "text": " que tienen que ver con el desarrollo empresarial, con el desarrollo emprendedor, y que bueno,",
        "start": 196.56,
        "end": 202.07999999999998
    },
    {
        "text": " que la medida que ustedes empiecen a transitar ese camino van a ir conectando, se van a ir aprendiendo",
        "start": 202.07999999999998,
        "end": 207.2
    },
    {
        "text": " eso, van a conseguir socios que se pande eso, van a tener que resolver eso de alguna forma,",
        "start": 207.2,
        "end": 211.95999999999998
    },
    {
        "text": " este, y bueno, es importante que por lo menos sepan de lo que no saben, así de esa manera pueden",
        "start": 211.95999999999998,
        "end": 217.56
    },
    {
        "text": " accionar en este, bueno, en delegájaro, en aprender, en alguno ese tipo de cosas. Así que,",
        "start": 217.56,
        "end": 224.83999999999997
    },
    {
        "text": " nada, con terminada de contextualizar esto, ¿no? Este, y usted sabe en que están estrenos",
        "start": 224.83999999999997,
        "end": 233.04
    },
    {
        "text": " una disciplina que es completamente de transbarzal a toda la Secretaría de Humanas, ¿no? Eso",
        "start": 233.04,
        "end": 237.92
    },
    {
        "text": " es algo que tiene la computación que es fabuloso, que no es que eso ingeniero civil, y bueno,",
        "start": 237.92,
        "end": 245.23999999999998
    },
    {
        "text": " que tengo que cargar, que si es ingeniero civil, que tengo que ver a dentro una cocina,",
        "start": 245.23999999999998,
        "end": 248.76
    },
    {
        "text": " bueno, cuando se ingenio en computación, digo, tu ámbito de aplicación es infinito,",
        "start": 248.76,
        "end": 255.0
    },
    {
        "text": " porque realmente hoy por hoy, la tecnología de información están presentes en todas las",
        "start": 255.0,
        "end": 260.4
    },
    {
        "text": " Secretaría de Humanas, entonces, realmente el rol que usted mana tiene la sociedad es totalmente",
        "start": 260.4,
        "end": 266.44
    },
    {
        "text": " transbarzal y va a aplicar a diferentes problemáticas, entonces, las tecnologías de información juegan",
        "start": 266.44,
        "end": 271.23999999999995
    },
    {
        "text": " ese papel, este, y bueno, después todo lo que tiene que ver con, cuando estamos parados,",
        "start": 271.23999999999995,
        "end": 278.0
    },
    {
        "text": " estamos en el UI, y, y por suerte, creo, tenemos a disposición nuestra de, de, de, de, de,",
        "start": 278.0,
        "end": 286.03999999999996
    },
    {
        "text": " de un ecosistema, estamos parados en el ecosistema en prendedor, que están dando las primeras señales,",
        "start": 286.04,
        "end": 291.32
    },
    {
        "text": " creo, de Madurez, en términos de, de cosas que van pasando, no, nombrábelo de local, pero también,",
        "start": 291.32,
        "end": 297.28000000000003
    },
    {
        "text": " por nombrar que hoy por hoy, hay creo que seis, este, incuadoras, que son apoyadas por ánimas,",
        "start": 297.28000000000003,
        "end": 302.88
    },
    {
        "text": " otras tantas que están, este también dipuylense en el mercado, que son organizaciones que, que se dedican",
        "start": 302.88,
        "end": 308.72
    },
    {
        "text": " a apoyar el desarrollo de emprendedores, pero después están también las pincuadoras,",
        "start": 308.72,
        "end": 313.0
    },
    {
        "text": " aseradoras, algún fondo de riesgo, entonces, hay un montón de ingredientes que hacen que",
        "start": 313.0,
        "end": 318.48
    },
    {
        "text": " se une opción para los ingenieros, este, o para las personas en general, nuestro no está limitado",
        "start": 318.48,
        "end": 323.96
    },
    {
        "text": " los ingenieros, este, poder, eh, nada, eh, ocupar un lugar de, de, de, de, de, de,",
        "start": 323.96,
        "end": 330.76
    },
    {
        "text": " transformación en la sociedad o de, o de acción desde lo que es el, el emprendar, ¿no?",
        "start": 330.76,
        "end": 335.28
    },
    {
        "text": " La siguiente.",
        "start": 336.28,
        "end": 338.55999999999995
    },
    {
        "text": " Este, y bueno, para hacer concreto, este, vamos, vamos a ver ahí punto a punto, ¿no?",
        "start": 340.55999999999995,
        "end": 347.03999999999996
    },
    {
        "text": " De, de eso, de ser amigable, ¿no? Apoyo financiero, este, hoy por hoy,",
        "start": 347.03999999999996,
        "end": 351.15999999999997
    },
    {
        "text": " ¿considio dinero para, para valer un ingenio ocio, para, para poder comenzar un negocio o para",
        "start": 351.15999999999997,
        "end": 357.23999999999995
    },
    {
        "text": " hacerlo agresar? Es algo que, que, que, que, que, que, que, que, que, que, que, que, que, que,",
        "start": 357.23999999999995,
        "end": 362.52
    },
    {
        "text": " que, que, bueno, son organismos estatales que, que promueven la innovación en el emprendedorismo,",
        "start": 362.52,
        "end": 368.24
    },
    {
        "text": " este, y quedaran, pues, yo financiero muchas veces sin ningún tipo de contradidad,",
        "start": 368.24,
        "end": 374.4
    },
    {
        "text": " obviamente, si, este, con ciertos criterios, digamos, para para, bueno, que el dinero y,",
        "start": 374.4,
        "end": 379.0
    },
    {
        "text": " y esos fondos, utilizen, para, para lo que el Estado, lo hago, yo quiere, que, para",
        "start": 379.0,
        "end": 382.59999999999997
    },
    {
        "text": " generar innovación, este, eso es la mano con el siguiente índice, ¿no?",
        "start": 382.59999999999997,
        "end": 387.0
    },
    {
        "text": " Política, su bueno, ¿no?",
        "start": 387.0,
        "end": 389.4
    },
    {
        "text": " eso de la mano con el siguiente ítema, políticas gubernamentales,",
        "start": 389.4,
        "end": 393.03999999999996
    },
    {
        "text": " hay una política segura a día en los períodos antiguos",
        "start": 393.03999999999996,
        "end": 397.03999999999996
    },
    {
        "text": " gobiernos de fomento de innovación en este periodo,",
        "start": 397.03999999999996,
        "end": 399.59999999999997
    },
    {
        "text": " ustedes saben que hubo una transición de gobierno y de punto de",
        "start": 399.59999999999997,
        "end": 403.71999999999997
    },
    {
        "text": " extambree de abrir un hubo cambios, este, y bueno,",
        "start": 403.71999999999997,
        "end": 407.91999999999996
    },
    {
        "text": " nada, en contexto donde si bien se restringió el dinero disponible,",
        "start": 407.91999999999996,
        "end": 411.32
    },
    {
        "text": " ya vamos a nivel estatal para este tipo de inversiones,",
        "start": 411.32,
        "end": 413.91999999999996
    },
    {
        "text": " este, si hay una intención de seguir haciendo lo y siguen",
        "start": 413.91999999999996,
        "end": 418.0
    },
    {
        "text": " habiendo aunque menor medida capital disponible,",
        "start": 418.0,
        "end": 420.64
    },
    {
        "text": " pero si hay otros programas y políticas con el programa",
        "start": 420.64,
        "end": 422.88
    },
    {
        "text": " sembrando, este, y bueno, después,",
        "start": 422.88,
        "end": 425.52
    },
    {
        "text": " el sector estatal no es el único, no es el único lugar,",
        "start": 425.52,
        "end": 432.44
    },
    {
        "text": " digamos, para tener una innecesión, no?",
        "start": 432.44,
        "end": 434.0
    },
    {
        "text": " Estamos a dar sin dar formas, pero también hay cierta",
        "start": 434.0,
        "end": 436.72
    },
    {
        "text": " abundancia de capital, este, en la sociedad que antes no",
        "start": 436.72,
        "end": 441.12
    },
    {
        "text": " ocurría, este, y bueno, vemos por ejemplo,",
        "start": 441.12,
        "end": 443.88
    },
    {
        "text": " que como ahora se usa, por ejemplo, más tradicional,",
        "start": 443.88,
        "end": 447.32
    },
    {
        "text": " lo de, en uno de los capaces de escuchar de campilla pila,",
        "start": 447.32,
        "end": 449.96
    },
    {
        "text": " donde no puede ir triendo en el marco de moviliario,",
        "start": 449.96,
        "end": 452.28
    },
    {
        "text": " comprando, este, participaciones en el apartamento,",
        "start": 452.28,
        "end": 455.32
    },
    {
        "text": " y bueno, eso después se transforma en su casa,",
        "start": 455.32,
        "end": 457.88
    },
    {
        "text": " eso es una otra cosa que instrumentos de,",
        "start": 457.88,
        "end": 459.71999999999997
    },
    {
        "text": " bueno, ahora todo el curso de trading que hay, o sea,",
        "start": 459.71999999999997,
        "end": 463.0
    },
    {
        "text": " son entramatidos un poco más tradicionales o más quizás",
        "start": 463.0,
        "end": 465.92
    },
    {
        "text": " del lado de, de colocaciones de dinero para captar",
        "start": 465.92,
        "end": 469.4
    },
    {
        "text": " inversión, y bueno, también puede ser,",
        "start": 469.4,
        "end": 472.12
    },
    {
        "text": " ustedes pueden ser captadores de inversión,",
        "start": 472.12,
        "end": 474.28
    },
    {
        "text": " pueden atraves un prendimiento, este de un día en negocio,",
        "start": 474.28,
        "end": 477.35999999999996
    },
    {
        "text": " poder a nivel privado hacer una propuesta, un plan,",
        "start": 477.35999999999996,
        "end": 481.91999999999996
    },
    {
        "text": " presentarlo, y, bueno, comprometarse a cambio de dinero,",
        "start": 481.91999999999996,
        "end": 485.32
    },
    {
        "text": " con determinadas obligaciones de punto de vista del desarrollo",
        "start": 485.32,
        "end": 490.55999999999995
    },
    {
        "text": " empresarial.",
        "start": 490.55999999999995,
        "end": 492.35999999999996
    },
    {
        "text": " Después, educación para el emprendimiento,",
        "start": 492.35999999999996,
        "end": 495.44
    },
    {
        "text": " un indicador puede ser la cantidad de inscritos en este curso,",
        "start": 495.44,
        "end": 498.2
    },
    {
        "text": " este que cada vez o más, después hay muchos talleres,",
        "start": 498.2,
        "end": 503.08
    },
    {
        "text": " hay muchos cursos en ese momento más early, digamos,",
        "start": 503.08,
        "end": 508.76
    },
    {
        "text": " como están ustedes ahora, se están preguntando,",
        "start": 508.76,
        "end": 511.59999999999997
    },
    {
        "text": " estoy honesto, yo estoy en ingeniería,",
        "start": 511.59999999999997,
        "end": 512.96
    },
    {
        "text": " ¿qué quiere hacer con esto?",
        "start": 512.96,
        "end": 514.36
    },
    {
        "text": " Entonces, de esas preguntas,",
        "start": 514.36,
        "end": 516.28
    },
    {
        "text": " arrepente surgen entre ustedes de estudiar",
        "start": 516.28,
        "end": 518.04
    },
    {
        "text": " algunas de estas temáticas que vamos a ver en el curso,",
        "start": 518.04,
        "end": 520.88
    },
    {
        "text": " en estas clases, y bueno, van a tener herramientas,",
        "start": 520.88,
        "end": 524.6
    },
    {
        "text": " van a tener acceso a conocimiento,",
        "start": 524.6,
        "end": 526.96
    },
    {
        "text": " más allá de que lo pueden obligar y pueden otra cosa,",
        "start": 526.96,
        "end": 529.96
    },
    {
        "text": " además, hay actividades específicas entre el negocio,",
        "start": 529.96,
        "end": 532.76
    },
    {
        "text": " este tema para que ustedes puedan formarse.",
        "start": 532.76,
        "end": 536.48
    },
    {
        "text": " Infraestructura comercial y profesional,",
        "start": 536.48,
        "end": 538.36
    },
    {
        "text": " o sea, realmente el sector LTI, en Uruguay,",
        "start": 538.36,
        "end": 540.88
    },
    {
        "text": " es un sector que está súper desarrollado",
        "start": 540.88,
        "end": 544.52
    },
    {
        "text": " para la población que tenemos,",
        "start": 544.52,
        "end": 546.4399999999999
    },
    {
        "text": " y tenemos una densidad espectacular para esto.",
        "start": 546.4399999999999,
        "end": 549.4399999999999
    },
    {
        "text": " Quizás acá es donde también digo que tenemos algunas carencias,",
        "start": 549.4399999999999,
        "end": 555.2
    },
    {
        "text": " lo que tiene que ver con infraestructura profesional,",
        "start": 555.2,
        "end": 557.84
    },
    {
        "text": " y me refiero puntualmente a todo lo que tiene que ver",
        "start": 557.84,
        "end": 561.56
    },
    {
        "text": " con la parte de diseño, de negocio,",
        "start": 561.56,
        "end": 567.52
    },
    {
        "text": " la parte de modelado de negocios,",
        "start": 567.52,
        "end": 570.28
    },
    {
        "text": " cosas que vamos a ver ahora,",
        "start": 570.28,
        "end": 572.2399999999999
    },
    {
        "text": " este recenas a lo que es dinestarta,",
        "start": 572.2399999999999,
        "end": 574.28
    },
    {
        "text": " piezo de roles que quizás no abundan tanto en Uruguay,",
        "start": 574.28,
        "end": 577.16
    },
    {
        "text": " o quizás no estén conectados con el encostito de emprendedor.",
        "start": 577.16,
        "end": 580.52
    },
    {
        "text": " Y bueno, nada, después, nada,",
        "start": 580.52,
        "end": 584.64
    },
    {
        "text": " la transferencia de MAD,",
        "start": 584.64,
        "end": 585.8
    },
    {
        "text": " hoy por hoy estamos parado a Ría de Hombre de Gigantes,",
        "start": 585.8,
        "end": 588.28
    },
    {
        "text": " o sea, realmente tenemos acceso a mucha información,",
        "start": 588.28,
        "end": 591.52
    },
    {
        "text": " muchas herramientas para poder desarrollar tecnología,",
        "start": 591.56,
        "end": 594.48
    },
    {
        "text": " hay una apertura de mercado interno,",
        "start": 594.48,
        "end": 596.92
    },
    {
        "text": " hay acceso a la infraestructura física,",
        "start": 596.92,
        "end": 598.52
    },
    {
        "text": " es decir, todos tenemos un buen acceso a lo que es a equipos,",
        "start": 598.52,
        "end": 603.0799999999999
    },
    {
        "text": " digamos, para poder desarrollar estas iniciativas.",
        "start": 603.0799999999999,
        "end": 605.52
    },
    {
        "text": " Y bueno, después que el contexto social cultural de Uruguay,",
        "start": 605.52,
        "end": 608.88
    },
    {
        "text": " yo diría que es neutro hacia esto,",
        "start": 608.88,
        "end": 611.88
    },
    {
        "text": " porque si bien cada vez más, por un lado,",
        "start": 611.88,
        "end": 614.1999999999999
    },
    {
        "text": " estamos aceptando esto en el emprendedorismo,",
        "start": 614.1999999999999,
        "end": 617.04
    },
    {
        "text": " lo estamos viendo con buenos ojos,",
        "start": 617.04,
        "end": 618.56
    },
    {
        "text": " también somos un paio bastante tradicional",
        "start": 618.56,
        "end": 621.92
    },
    {
        "text": " y que normalmente mucha gente mira el que está haciendo el otro",
        "start": 621.92,
        "end": 626.04
    },
    {
        "text": " y bueno, y en algún punto se inmociendo bastante conservadores.",
        "start": 626.04,
        "end": 629.2399999999999
    },
    {
        "text": " Pero, o sea, creo que estamos en un punto de neutro ahí,",
        "start": 629.2399999999999,
        "end": 633.0799999999999
    },
    {
        "text": " y no es un freno para poder desarrollarse en esto.",
        "start": 633.0799999999999,
        "end": 636.5999999999999
    },
    {
        "text": " Y bueno, que vamos a ver qué es emprendedor,",
        "start": 638.68,
        "end": 640.8399999999999
    },
    {
        "text": " o qué se entiende por emprendedor,",
        "start": 640.8399999999999,
        "end": 645.0799999999999
    },
    {
        "text": " primero vamos a ver una visión clacia que es la de Drucker,",
        "start": 645.0799999999999,
        "end": 648.4399999999999
    },
    {
        "text": " que creo que le he librado en el año 64 sobre eso y no es",
        "start": 648.44,
        "end": 651.24
    },
    {
        "text": " ese emprendimiento, y habla de un emprendedor,",
        "start": 651.24,
        "end": 654.2
    },
    {
        "text": " busca el cambio, responde a él y explotas su oportunidad,",
        "start": 654.2,
        "end": 657.8000000000001
    },
    {
        "text": " en una opción es una herramienta específica de un emprendedor",
        "start": 657.8000000000001,
        "end": 660.8800000000001
    },
    {
        "text": " y si un emprendedor efectivo convierte una fuente en un recurso.",
        "start": 660.8800000000001,
        "end": 664.5600000000001
    },
    {
        "text": " Vamos a desarmar esto.",
        "start": 664.5600000000001,
        "end": 668.36
    },
    {
        "text": " Primero habla de que el emprendedor busca el cambio.",
        "start": 668.36,
        "end": 672.5600000000001
    },
    {
        "text": " Si las cosas se quedan quietas, digamos, nada, cambia,",
        "start": 672.5600000000001,
        "end": 676.12
    },
    {
        "text": " y eso tiene que ver con muchas dimensiones.",
        "start": 676.12,
        "end": 678.52
    },
    {
        "text": " La dimensión práctica, digamos,",
        "start": 678.52,
        "end": 681.44
    },
    {
        "text": " me anudo sucediendo.",
        "start": 681.44,
        "end": 683.52
    },
    {
        "text": " La dimensión empresarial nos está generando más ingresos,",
        "start": 683.52,
        "end": 688.28
    },
    {
        "text": " son menos ingresos.",
        "start": 688.28,
        "end": 691.28
    },
    {
        "text": " La dimensión humana, si bueno, hacemos las cosas de la misma manera.",
        "start": 691.28,
        "end": 695.96
    },
    {
        "text": " Y eso, normalmente, se no lo lleva a lo práctico,",
        "start": 695.96,
        "end": 700.44
    },
    {
        "text": " a lo que uno experimenta, digamos,",
        "start": 700.44,
        "end": 703.52
    },
    {
        "text": " tiene que ver con la comodidad.",
        "start": 703.52,
        "end": 706.16
    },
    {
        "text": " A veces hay una cosa que uno se siente como no la quiere cambiar,",
        "start": 706.16,
        "end": 709.6
    },
    {
        "text": " no quiere tocar.",
        "start": 709.6,
        "end": 711.64
    },
    {
        "text": " Pero sin embargo, uno también siempre siente problemas.",
        "start": 711.64,
        "end": 714.56
    },
    {
        "text": " Uno siempre siente cosas que uno le incomoda,",
        "start": 714.56,
        "end": 717.0
    },
    {
        "text": " que no están resuelta.",
        "start": 717.0,
        "end": 718.88
    },
    {
        "text": " Y bueno, si no lo lleva a la sociedad,",
        "start": 718.88,
        "end": 720.24
    },
    {
        "text": " a las organizaciones, siempre tenemos problemas.",
        "start": 720.24,
        "end": 722.4399999999999
    },
    {
        "text": " Seguro que, si miramos la facultad,",
        "start": 722.4399999999999,
        "end": 726.8
    },
    {
        "text": " seguro que encontramos cosas que no nos gustan con funcionan,",
        "start": 726.8,
        "end": 730.48
    },
    {
        "text": " o, repente, pensamos que nos gustaría que hubiera otros cursos",
        "start": 730.48,
        "end": 735.84
    },
    {
        "text": " o hubiera otras formas de evaluación.",
        "start": 735.84,
        "end": 737.84
    },
    {
        "text": " Entonces, la realidad es que la verdad es que sigue siendo un poco",
        "start": 737.84,
        "end": 740.48
    },
    {
        "text": " incómodo.",
        "start": 740.48,
        "end": 741.84
    },
    {
        "text": " Y el emprendedor se mueve en este espectro incómodo, digamos,",
        "start": 741.84,
        "end": 745.5600000000001
    },
    {
        "text": " y busca cambios.",
        "start": 745.5600000000001,
        "end": 746.88
    },
    {
        "text": " Busca llevar las cosas de la a esta vez,",
        "start": 746.88,
        "end": 749.64
    },
    {
        "text": " de un estado en el cual se encuentra ahora",
        "start": 749.64,
        "end": 754.0
    },
    {
        "text": " a un estado diferente.",
        "start": 754.0,
        "end": 755.52
    },
    {
        "text": " Y, bueno, justamente, observa donde están las oportunidades",
        "start": 755.52,
        "end": 758.72
    },
    {
        "text": " para poder lograr esos cambios.",
        "start": 758.72,
        "end": 761.0
    },
    {
        "text": " Y ahí aparece una segunda frase de dice,",
        "start": 761.0,
        "end": 764.96
    },
    {
        "text": " la innovación es una herramienta específica o un emprendedor.",
        "start": 764.96,
        "end": 769.28
    },
    {
        "text": " Y la innovación refiere a poder hacer algo de una forma diferente",
        "start": 769.28,
        "end": 774.84
    },
    {
        "text": " y que sea útil.",
        "start": 774.84,
        "end": 776.08
    },
    {
        "text": " Vamos a grande rasgo de la definición de innovación.",
        "start": 776.08,
        "end": 779.6
    },
    {
        "text": " Pocasar la forma diferente, pero si no se utiliza a nadie,",
        "start": 779.6,
        "end": 783.84
    },
    {
        "text": " eso no tendría mucho sentido.",
        "start": 783.84,
        "end": 786.4
    },
    {
        "text": " O, repente, podría considerarse como algo artístico.",
        "start": 786.4,
        "end": 789.4399999999999
    },
    {
        "text": " Pero lo que define innovación es también que sea útil.",
        "start": 789.4399999999999,
        "end": 793.0
    },
    {
        "text": " Entonces, la innovación es esta herramienta que nos permite",
        "start": 793.0,
        "end": 799.0799999999999
    },
    {
        "text": " los cambios, esto de poder hacerlo de otra manera.",
        "start": 799.0799999999999,
        "end": 802.16
    },
    {
        "text": " Entonces, parece que cuando hablamos emprendedor,",
        "start": 802.16,
        "end": 805.48
    },
    {
        "text": " hablamos de cambio, hablamos de innovación,",
        "start": 805.48,
        "end": 807.76
    },
    {
        "text": " hablamos de tomar cosas y poder mejorarlas.",
        "start": 807.76,
        "end": 813.4399999999999
    },
    {
        "text": " Vamos a la definición de Timons, dice,",
        "start": 813.44,
        "end": 816.12
    },
    {
        "text": " tomar acciones humanas creativas para construir algo de valor",
        "start": 816.12,
        "end": 819.12
    },
    {
        "text": " a partir de prácticamente nada.",
        "start": 819.12,
        "end": 821.2
    },
    {
        "text": " Busque insistente de la oportunidad,",
        "start": 821.2,
        "end": 822.6800000000001
    },
    {
        "text": " independientemente de los recursos, requiere visión,",
        "start": 822.6800000000001,
        "end": 825.2800000000001
    },
    {
        "text": " pasión y compromiso para ir a la otra",
        "start": 825.2800000000001,
        "end": 826.84
    },
    {
        "text": " en la persecución de dicha visión,",
        "start": 826.84,
        "end": 829.12
    },
    {
        "text": " requiere la disposición de tomar riesgos calculados.",
        "start": 829.12,
        "end": 833.1600000000001
    },
    {
        "text": " En mi interés, a esta definición,",
        "start": 833.1600000000001,
        "end": 834.44
    },
    {
        "text": " si siempre las contamos, porque empiezan a hablar de lo que es,",
        "start": 834.44,
        "end": 837.5600000000001
    },
    {
        "text": " emprenden lo que es realmente.",
        "start": 837.5600000000001,
        "end": 840.0400000000001
    },
    {
        "text": " Y ahí habla de tomar acciones humanas creativas,",
        "start": 840.04,
        "end": 844.8
    },
    {
        "text": " construir valor a partir de la nada.",
        "start": 844.8,
        "end": 847.36
    },
    {
        "text": " Y eso es una visión un poquito naïf,",
        "start": 847.36,
        "end": 850.52
    },
    {
        "text": " si me permite, en esa visión un poquito idealizada",
        "start": 850.52,
        "end": 853.76
    },
    {
        "text": " en el emprendedorismo.",
        "start": 853.76,
        "end": 854.5999999999999
    },
    {
        "text": " Es que poco más que vienen a la ancha sin remos,",
        "start": 854.5999999999999,
        "end": 857.4
    },
    {
        "text": " se bajan a playa y a los 10 años de un imperio comercial.",
        "start": 857.4,
        "end": 861.8399999999999
    },
    {
        "text": " Eso no sucede, digo, realmente,",
        "start": 861.8399999999999,
        "end": 864.16
    },
    {
        "text": " si soy alguna vez, fue una excepción en una casualidad.",
        "start": 864.16,
        "end": 868.0
    },
    {
        "text": " Pero sí, este mismo tour en otra parte,",
        "start": 868.0,
        "end": 872.2
    },
    {
        "text": " habla de tomar recursos y sacarlos",
        "start": 872.2,
        "end": 875.4
    },
    {
        "text": " de una zona de baja productividad",
        "start": 875.4,
        "end": 876.84
    },
    {
        "text": " y molos por una zona de alta productividad.",
        "start": 876.84,
        "end": 879.08
    },
    {
        "text": " Es decir, de repente hay cosas que ya están disponibles",
        "start": 879.08,
        "end": 883.28
    },
    {
        "text": " y una persona con su acción, a las transformas.",
        "start": 883.28,
        "end": 886.32
    },
    {
        "text": " Quiero poner un ejemplo, o sea,",
        "start": 886.32,
        "end": 889.4
    },
    {
        "text": " a ver, el que llevó a los que es en empiezan a ir adelante",
        "start": 889.4,
        "end": 894.12
    },
    {
        "text": " los emprendimientos tipo RAPI,",
        "start": 894.24,
        "end": 896.64
    },
    {
        "text": " este pedillo ya, la parte...",
        "start": 896.64,
        "end": 900.24
    },
    {
        "text": " Bueno, justo pedillo ya, bueno, el ejemplo de otra cosa,",
        "start": 900.24,
        "end": 902.6
    },
    {
        "text": " pero, flow RAPI, las motos ya existían,",
        "start": 902.6,
        "end": 905.64
    },
    {
        "text": " las bicicletas ya existían,",
        "start": 905.64,
        "end": 907.12
    },
    {
        "text": " las personas ya tenían diempocioso,",
        "start": 907.12,
        "end": 909.4
    },
    {
        "text": " este, y lo que, pero para mí están en sus casas,",
        "start": 909.4,
        "end": 912.68
    },
    {
        "text": " o sea, o están haciendo otra cosa.",
        "start": 912.68,
        "end": 914.12
    },
    {
        "text": " Entonces, esa idea, lo que transformó a esas personas,",
        "start": 914.12,
        "end": 918.44
    },
    {
        "text": " este ahora, y indifiquen en eso una fuente ingreso,",
        "start": 918.44,
        "end": 921.6
    },
    {
        "text": " este, una fuente laboral.",
        "start": 921.6,
        "end": 923.08
    },
    {
        "text": " Entonces, todos esos recursos que estaban ausiosos,",
        "start": 923.08,
        "end": 926.28
    },
    {
        "text": " estos emprendedores, los transformaron, los movieron,",
        "start": 926.28,
        "end": 930.08
    },
    {
        "text": " o crearon algo que los transforman en herramientas útiles",
        "start": 930.08,
        "end": 933.52
    },
    {
        "text": " y de esa manera, este es el genero valor,",
        "start": 933.52,
        "end": 936.6
    },
    {
        "text": " este, y no estoy entrando ahora en la discusión de, bueno,",
        "start": 936.6,
        "end": 939.28
    },
    {
        "text": " del trabajo que sí, si se estalló y si es un sube en pliego,",
        "start": 939.28,
        "end": 941.6
    },
    {
        "text": " y entonces, esa otra tema aparte.",
        "start": 941.6,
        "end": 943.48
    },
    {
        "text": " Víamos los ahora de esta óptica,",
        "start": 943.48,
        "end": 946.32
    },
    {
        "text": " este, y bueno, veamos esto de que,",
        "start": 946.32,
        "end": 948.88
    },
    {
        "text": " hay veces que están los recursos ahí, pero no se usan.",
        "start": 948.88,
        "end": 951.76
    },
    {
        "text": " Entonces, un emprendedor muchas veces,",
        "start": 951.76,
        "end": 953.92
    },
    {
        "text": " este, tiene esa,",
        "start": 953.92,
        "end": 954.92
    },
    {
        "text": " esa, tipo, tiene esa vocación de arrar eso y transformar",
        "start": 954.92,
        "end": 957.76
    },
    {
        "text": " en algo que, que pueda ser utilizado.",
        "start": 957.76,
        "end": 960.52
    },
    {
        "text": " Después, vale a la de busque insistente.",
        "start": 960.52,
        "end": 963.16
    },
    {
        "text": " Aquí, de, de pasada, nombre a uno de los principales valores,",
        "start": 963.16,
        "end": 967.4
    },
    {
        "text": " de lo que es un emprendedor,",
        "start": 967.4,
        "end": 968.84
    },
    {
        "text": " que vamos a la masa delante,",
        "start": 968.84,
        "end": 969.8
    },
    {
        "text": " y tiene que ir con la resiliencia, o sea,",
        "start": 969.8,
        "end": 973.12
    },
    {
        "text": " la realidad es que por algo, hay un estatucubo,",
        "start": 973.12,
        "end": 975.44
    },
    {
        "text": " por algo de las cosas funcionan como funcionan,",
        "start": 975.44,
        "end": 977.24
    },
    {
        "text": " y eso es porque después de mucha evolución,",
        "start": 977.24,
        "end": 979.92
    },
    {
        "text": " en mucho tiempo,",
        "start": 979.92,
        "end": 981.28
    },
    {
        "text": " eso, las cosas de estabilizan en cierto punto.",
        "start": 981.28,
        "end": 983.64
    },
    {
        "text": " Entonces, transformar y mover las cosas desde ahí,",
        "start": 983.64,
        "end": 985.76
    },
    {
        "text": " lleva mucho trabajo.",
        "start": 985.76,
        "end": 987.28
    },
    {
        "text": " Y realmente, no es un acto,",
        "start": 987.28,
        "end": 989.92
    },
    {
        "text": " muchas veces produce para el accidente,",
        "start": 989.92,
        "end": 991.28
    },
    {
        "text": " pero, pero en la lidada de tránsese,",
        "start": 991.28,
        "end": 993.6800000000001
    },
    {
        "text": " accidente, hay una insistencia permanente",
        "start": 993.6800000000001,
        "end": 996.6
    },
    {
        "text": " de poder transformar la realidad.",
        "start": 996.6,
        "end": 998.8
    },
    {
        "text": " Entonces, quiero, quiero hacer,",
        "start": 998.8,
        "end": 1001.96
    },
    {
        "text": " quiero pueden gritas a balada,",
        "start": 1001.96,
        "end": 1003.12
    },
    {
        "text": " el emprendedor es insistente.",
        "start": 1003.12,
        "end": 1005.5600000000001
    },
    {
        "text": " O sea, la realidad emprendedora",
        "start": 1005.5600000000001,
        "end": 1006.52
    },
    {
        "text": " es insistente, por naturaleza propia,",
        "start": 1006.52,
        "end": 1009.76
    },
    {
        "text": " porque poder identificar qué cosas",
        "start": 1009.76,
        "end": 1013.36
    },
    {
        "text": " están siendo subutilizadas,",
        "start": 1013.36,
        "end": 1015.4
    },
    {
        "text": " y con ella, general valor para la sociedad,",
        "start": 1015.4,
        "end": 1017.3199999999999
    },
    {
        "text": " es algo muy complejo,",
        "start": 1017.3199999999999,
        "end": 1019.4
    },
    {
        "text": " y que requiere justamente",
        "start": 1019.4,
        "end": 1020.84
    },
    {
        "text": " de un proceso de iteración y de trabajo.",
        "start": 1020.84,
        "end": 1024.48
    },
    {
        "text": " Después, esa referencia a la,",
        "start": 1024.48,
        "end": 1026.36
    },
    {
        "text": " a la, a la, digamos,",
        "start": 1026.36,
        "end": 1028.48
    },
    {
        "text": " dimensión un poco más humana y más personal,",
        "start": 1028.48,
        "end": 1031.72
    },
    {
        "text": " habla de requiere visión, pasión y compromiso,",
        "start": 1031.72,
        "end": 1035.4
    },
    {
        "text": " para guiar a otros,",
        "start": 1035.4,
        "end": 1036.76
    },
    {
        "text": " este, visión es discutible,",
        "start": 1036.76,
        "end": 1041.44
    },
    {
        "text": " yo creo que, que, que sí igual,",
        "start": 1041.44,
        "end": 1043.0800000000002
    },
    {
        "text": " es un emprendedor,",
        "start": 1043.0800000000002,
        "end": 1043.8400000000001
    },
    {
        "text": " mínimamente debe haber un horizonte,",
        "start": 1043.8400000000001,
        "end": 1045.64
    },
    {
        "text": " o un, o un mundo que bueno es,",
        "start": 1045.64,
        "end": 1048.64
    },
    {
        "text": " el que vivimos, porque si no,",
        "start": 1048.64,
        "end": 1050.0800000000002
    },
    {
        "text": " no hay cambios,",
        "start": 1050.0800000000002,
        "end": 1051.68
    },
    {
        "text": " que muchas veces simplemente",
        "start": 1052.48,
        "end": 1054.0
    },
    {
        "text": " sonadores copian y ideas de otros mercados",
        "start": 1054.0,
        "end": 1056.0
    },
    {
        "text": " que yo funcionan, pero",
        "start": 1056.0,
        "end": 1057.76
    },
    {
        "text": " hay, hay con una anticipación en el futuro,",
        "start": 1057.76,
        "end": 1060.96
    },
    {
        "text": " hay pasión, bueno,",
        "start": 1060.96,
        "end": 1062.8000000000002
    },
    {
        "text": " yo creo que sí, yo creo que,",
        "start": 1062.8000000000002,
        "end": 1064.3200000000002
    },
    {
        "text": " que el ser humano,",
        "start": 1064.32,
        "end": 1067.2
    },
    {
        "text": " en su,",
        "start": 1067.2,
        "end": 1068.2
    },
    {
        "text": " su conducta, en su desarrollo,",
        "start": 1068.2,
        "end": 1071.4399999999998
    },
    {
        "text": " es imposible que,",
        "start": 1071.4399999999998,
        "end": 1073.4399999999998
    },
    {
        "text": " que a guarde una,",
        "start": 1073.4399999999998,
        "end": 1074.72
    },
    {
        "text": " una tarea tan demandante,",
        "start": 1074.72,
        "end": 1076.76
    },
    {
        "text": " como emprender sin pasión,",
        "start": 1076.76,
        "end": 1078.6399999999999
    },
    {
        "text": " este, quizás, un emprendedor,",
        "start": 1078.6399999999999,
        "end": 1080.4399999999998
    },
    {
        "text": " este, con mucho desarrollo,",
        "start": 1080.4399999999998,
        "end": 1082.24
    },
    {
        "text": " con mucha experiencia,",
        "start": 1082.24,
        "end": 1083.32
    },
    {
        "text": " mucho conocimiento, pero,",
        "start": 1083.32,
        "end": 1085.2
    },
    {
        "text": " creo que, creo que el niridente de las pasiones",
        "start": 1085.2,
        "end": 1087.6399999999999
    },
    {
        "text": " algo que, que, que es relevo ante en esto,",
        "start": 1087.6399999999999,
        "end": 1089.8799999999999
    },
    {
        "text": " en emprendedorismo,",
        "start": 1089.8799999999999,
        "end": 1091.36
    },
    {
        "text": " y a la de compromiso, y bueno,",
        "start": 1091.36,
        "end": 1092.8799999999999
    },
    {
        "text": " sí, este,",
        "start": 1092.88,
        "end": 1094.16
    },
    {
        "text": " normalmente estas batallas",
        "start": 1094.16,
        "end": 1095.16
    },
    {
        "text": " son del largo plazo,",
        "start": 1095.16,
        "end": 1096.0400000000002
    },
    {
        "text": " entonces yo no sé,",
        "start": 1096.0400000000002,
        "end": 1096.72
    },
    {
        "text": " compromete este,",
        "start": 1096.72,
        "end": 1097.92
    },
    {
        "text": " en el tiempo a tomar esa bandera,",
        "start": 1097.92,
        "end": 1100.2800000000002
    },
    {
        "text": " y a llevarla adelante,",
        "start": 1100.2800000000002,
        "end": 1101.88
    },
    {
        "text": " es muy difícil que,",
        "start": 1101.88,
        "end": 1103.2
    },
    {
        "text": " que estas no vaciones se produzcan, no?",
        "start": 1103.2,
        "end": 1106.0400000000002
    },
    {
        "text": " Este, y después,",
        "start": 1106.0400000000002,
        "end": 1107.0
    },
    {
        "text": " finalmente, de la guía,",
        "start": 1107.0,
        "end": 1107.8400000000001
    },
    {
        "text": " a guía de otros,",
        "start": 1107.8400000000001,
        "end": 1109.0
    },
    {
        "text": " eh, es muy difícil emprendar",
        "start": 1109.0,
        "end": 1110.8400000000001
    },
    {
        "text": " solo, realmente es muy difícil",
        "start": 1110.8400000000001,
        "end": 1112.4
    },
    {
        "text": " emprendar solo,",
        "start": 1112.4,
        "end": 1113.2800000000002
    },
    {
        "text": " y es muy difícil no ser resultados,",
        "start": 1113.2800000000002,
        "end": 1114.8000000000002
    },
    {
        "text": " este, entonces,",
        "start": 1114.8000000000002,
        "end": 1115.8000000000002
    },
    {
        "text": " este, este, esto del liderazgo,",
        "start": 1115.8000000000002,
        "end": 1117.6000000000001
    },
    {
        "text": " esto del, del, del, del guía,",
        "start": 1117.6000000000001,
        "end": 1119.5200000000002
    },
    {
        "text": " este, es algo,",
        "start": 1119.5200000000002,
        "end": 1120.7600000000002
    },
    {
        "text": " es algo importante.",
        "start": 1120.7600000000002,
        "end": 1122.5200000000002
    },
    {
        "text": " Y bueno, finalmente habla de,",
        "start": 1123.04,
        "end": 1124.56
    },
    {
        "text": " una, una cuestión central,",
        "start": 1124.56,
        "end": 1126.4
    },
    {
        "text": " entonces, también,",
        "start": 1126.4,
        "end": 1126.84
    },
    {
        "text": " emprender que tiene que ver con los riesgos,",
        "start": 1126.84,
        "end": 1129.32
    },
    {
        "text": " este, emprender es no que dar pejosa,",
        "start": 1129.32,
        "end": 1132.04
    },
    {
        "text": " con naturalesas,",
        "start": 1132.04,
        "end": 1133.32
    },
    {
        "text": " este, ya habla de riesgos calculados,",
        "start": 1133.32,
        "end": 1134.92
    },
    {
        "text": " eh,",
        "start": 1134.92,
        "end": 1135.92
    },
    {
        "text": " uno no puede tomar,",
        "start": 1135.92,
        "end": 1137.36
    },
    {
        "text": " eh, cualquier riesgo,",
        "start": 1137.36,
        "end": 1138.6399999999999
    },
    {
        "text": " porque,",
        "start": 1138.6399999999999,
        "end": 1139.68
    },
    {
        "text": " las consecuencias de ese riesgo pueden ser el fin,",
        "start": 1139.68,
        "end": 1142.12
    },
    {
        "text": " este,",
        "start": 1142.12,
        "end": 1143.36
    },
    {
        "text": " incluso de la vida de uno, no?",
        "start": 1143.36,
        "end": 1145.2
    },
    {
        "text": " Este, si uno está,",
        "start": 1145.2,
        "end": 1146.6399999999999
    },
    {
        "text": " eh, haciendo una startup de paracaídas,",
        "start": 1146.6399999999999,
        "end": 1149.52
    },
    {
        "text": " este,",
        "start": 1149.52,
        "end": 1151.04
    },
    {
        "text": " eh, de papel maye,",
        "start": 1151.04,
        "end": 1152.28
    },
    {
        "text": " porque somos baratos y,",
        "start": 1152.28,
        "end": 1153.72
    },
    {
        "text": " bueno, decide probarlo con,",
        "start": 1153.72,
        "end": 1155.48
    },
    {
        "text": " eh, con uno mismo, este,",
        "start": 1155.48,
        "end": 1157.04
    },
    {
        "text": " bueno, entemente,",
        "start": 1157.04,
        "end": 1157.68
    },
    {
        "text": " ahí hay un error,",
        "start": 1157.68,
        "end": 1158.52
    },
    {
        "text": " este, muy grave de que el culo de riesgo,",
        "start": 1158.52,
        "end": 1160.52
    },
    {
        "text": " este, y probablemente,",
        "start": 1160.52,
        "end": 1162.68
    },
    {
        "text": " de, de, de conocimiento de,",
        "start": 1162.68,
        "end": 1163.96
    },
    {
        "text": " de materiales, un montón de cosas,",
        "start": 1163.96,
        "end": 1165.56
    },
    {
        "text": " pero, este,",
        "start": 1165.56,
        "end": 1166.92
    },
    {
        "text": " quería ponerle este ejemplo,",
        "start": 1166.92,
        "end": 1167.96
    },
    {
        "text": " pero en realidad,",
        "start": 1167.96,
        "end": 1169.2
    },
    {
        "text": " algo mucho menos,",
        "start": 1169.2,
        "end": 1171.16
    },
    {
        "text": " eh, ha sido muchos,",
        "start": 1171.16,
        "end": 1171.96
    },
    {
        "text": " los emprendadores que han muerto,",
        "start": 1171.96,
        "end": 1173.44
    },
    {
        "text": " este, tratando de,",
        "start": 1173.44,
        "end": 1174.96
    },
    {
        "text": " de validar sus,",
        "start": 1174.96,
        "end": 1176.16
    },
    {
        "text": " sus experimentos,",
        "start": 1176.16,
        "end": 1177.3999999999999
    },
    {
        "text": " este,",
        "start": 1177.3999999999999,
        "end": 1178.56
    },
    {
        "text": " y, y bueno,",
        "start": 1178.56,
        "end": 1179.6399999999999
    },
    {
        "text": " si no es a esos casos de extremo,",
        "start": 1179.6399999999999,
        "end": 1181.84
    },
    {
        "text": " si, es, es, es importante,",
        "start": 1181.84,
        "end": 1184.0
    },
    {
        "text": " digo que hay muchas personas,",
        "start": 1184.0,
        "end": 1186.36
    },
    {
        "text": " que, por un negocio,",
        "start": 1186.36,
        "end": 1187.76
    },
    {
        "text": " eh, han invertido dinero,",
        "start": 1187.76,
        "end": 1189.6
    },
    {
        "text": " parte de su capital,",
        "start": 1189.6,
        "end": 1191.08
    },
    {
        "text": " en, en esta idea que es muy riesgoosa,",
        "start": 1191.08,
        "end": 1193.28
    },
    {
        "text": " y bueno, y han terminado en deudadas,",
        "start": 1193.28,
        "end": 1195.24
    },
    {
        "text": " o han perdido en parte de su patrimimonio,",
        "start": 1195.24,
        "end": 1197.0
    },
    {
        "text": " o en la, de su patrimonio,",
        "start": 1197.0,
        "end": 1198.12
    },
    {
        "text": " entonces, es,",
        "start": 1198.12,
        "end": 1198.8799999999999
    },
    {
        "text": " es realmente,",
        "start": 1198.8799999999999,
        "end": 1199.6799999999998
    },
    {
        "text": " eh, desde este punto de vista,",
        "start": 1199.6799999999998,
        "end": 1201.04
    },
    {
        "text": " hay que ser cauteloso,",
        "start": 1201.04,
        "end": 1203.12
    },
    {
        "text": " y el punto de vista empresarial,",
        "start": 1203.12,
        "end": 1204.08
    },
    {
        "text": " muchas veces,",
        "start": 1204.08,
        "end": 1204.6
    },
    {
        "text": " dentro de una empresa,",
        "start": 1204.6,
        "end": 1205.3999999999999
    },
    {
        "text": " hay una puesta de riesgo,",
        "start": 1205.3999999999999,
        "end": 1207.12
    },
    {
        "text": " y bueno, también hay que medir,",
        "start": 1207.12,
        "end": 1208.8799999999999
    },
    {
        "text": " cuánto dinero invertimos,",
        "start": 1208.8799999999999,
        "end": 1210.36
    },
    {
        "text": " y cual es elotono esperado,",
        "start": 1210.36,
        "end": 1211.52
    },
    {
        "text": " y hasta cuando podemos invertir,",
        "start": 1211.52,
        "end": 1213.08
    },
    {
        "text": " y bueno,",
        "start": 1213.08,
        "end": 1213.8
    },
    {
        "text": " este,",
        "start": 1213.8,
        "end": 1214.28
    },
    {
        "text": " habla de tomar riesgos,",
        "start": 1214.28,
        "end": 1215.44
    },
    {
        "text": " si, hay que tomar riesgos,",
        "start": 1215.44,
        "end": 1217.24
    },
    {
        "text": " pero hay que tomar los riesgos que se pueden,",
        "start": 1217.24,
        "end": 1219.48
    },
    {
        "text": " y hay que gestionar los de manera de cual,",
        "start": 1219.48,
        "end": 1221.32
    },
    {
        "text": " entonces, este,",
        "start": 1221.32,
        "end": 1222.72
    },
    {
        "text": " esto es central,",
        "start": 1222.72,
        "end": 1223.96
    },
    {
        "text": " en lo de todo lo que tiene con,",
        "start": 1223.96,
        "end": 1225.0
    },
    {
        "text": " con en plunder,",
        "start": 1225.0,
        "end": 1225.76
    },
    {
        "text": " y bueno, este,",
        "start": 1230.24,
        "end": 1232.08
    },
    {
        "text": " acá, eh,",
        "start": 1232.08,
        "end": 1233.96
    },
    {
        "text": " habla de otras,",
        "start": 1233.96,
        "end": 1235.04
    },
    {
        "text": " un poquito más modernas, no,",
        "start": 1235.04,
        "end": 1236.52
    },
    {
        "text": " dice a persona que toma decisiones",
        "start": 1236.52,
        "end": 1238.0
    },
    {
        "text": " sobre la base de la complicada riesgo,",
        "start": 1238.0,
        "end": 1239.76
    },
    {
        "text": " y el ingenio inusado,",
        "start": 1239.76,
        "end": 1240.72
    },
    {
        "text": " eh,",
        "start": 1241.56,
        "end": 1242.44
    },
    {
        "text": " lo queríamos,",
        "start": 1242.44,
        "end": 1243.16
    },
    {
        "text": " poníamos para algo más,",
        "start": 1243.16,
        "end": 1244.0
    },
    {
        "text": " más nuevo acá,",
        "start": 1244.0,
        "end": 1245.24
    },
    {
        "text": " este, y después lo mismo,",
        "start": 1245.24,
        "end": 1246.76
    },
    {
        "text": " y llegamos en el emprendedor,",
        "start": 1246.76,
        "end": 1248.28
    },
    {
        "text": " eh, en el emprendedor,",
        "start": 1248.28,
        "end": 1250.08
    },
    {
        "text": " si un empresario puede ser emprendedor,",
        "start": 1250.08,
        "end": 1251.96
    },
    {
        "text": " un emprendedor nunca deja de ser innovador,",
        "start": 1251.96,
        "end": 1254.64
    },
    {
        "text": " no de unidad de criterios,",
        "start": 1254.64,
        "end": 1256.04
    },
    {
        "text": " en la definición de términos,",
        "start": 1256.04,
        "end": 1257.16
    },
    {
        "text": " ni en la cara de utilización,",
        "start": 1257.16,
        "end": 1258.16
    },
    {
        "text": " de quien emprenden,",
        "start": 1258.16,
        "end": 1258.84
    },
    {
        "text": " y quien da empresas.",
        "start": 1258.84,
        "end": 1260.48
    },
    {
        "text": " Y esto, un poco,",
        "start": 1260.48,
        "end": 1261.24
    },
    {
        "text": " esa referencia también,",
        "start": 1261.24,
        "end": 1262.2
    },
    {
        "text": " a que los últimos años,",
        "start": 1262.2,
        "end": 1263.44
    },
    {
        "text": " la palabra emprendedor,",
        "start": 1263.44,
        "end": 1265.04
    },
    {
        "text": " se ha venido utilizando,",
        "start": 1265.04,
        "end": 1266.84
    },
    {
        "text": " para casi todos,",
        "start": 1266.84,
        "end": 1268.0
    },
    {
        "text": " a ahora,",
        "start": 1268.0,
        "end": 1268.4
    },
    {
        "text": " son, hay mucha gente que,",
        "start": 1268.4,
        "end": 1270.04
    },
    {
        "text": " que pone,",
        "start": 1270.04,
        "end": 1271.04
    },
    {
        "text": " esté subiendo online,",
        "start": 1271.04,
        "end": 1271.96
    },
    {
        "text": " de ropa y dice,",
        "start": 1271.96,
        "end": 1273.68
    },
    {
        "text": " bueno,",
        "start": 1273.68,
        "end": 1273.96
    },
    {
        "text": " soy emprendedor.",
        "start": 1273.96,
        "end": 1274.96
    },
    {
        "text": " Eh,",
        "start": 1274.96,
        "end": 1275.96
    },
    {
        "text": " bueno, no, no,",
        "start": 1275.96,
        "end": 1276.96
    },
    {
        "text": " que nadie,",
        "start": 1276.96,
        "end": 1277.48
    },
    {
        "text": " no quiero propiarme",
        "start": 1277.48,
        "end": 1278.8
    },
    {
        "text": " de lo que significa esa palabra,",
        "start": 1278.8,
        "end": 1281.12
    },
    {
        "text": " hay decir que,",
        "start": 1281.12,
        "end": 1282.08
    },
    {
        "text": " quienes,",
        "start": 1282.08,
        "end": 1282.6
    },
    {
        "text": " y quienes no es emprendedor,",
        "start": 1282.6,
        "end": 1284.08
    },
    {
        "text": " eh, justamente este,",
        "start": 1284.08,
        "end": 1285.48
    },
    {
        "text": " este autor propone que,",
        "start": 1285.48,
        "end": 1286.84
    },
    {
        "text": " que no hay unidad de criterios,",
        "start": 1286.84,
        "end": 1288.32
    },
    {
        "text": " y que,",
        "start": 1288.32,
        "end": 1288.8
    },
    {
        "text": " y que está bastante abierto.",
        "start": 1288.8,
        "end": 1290.72
    },
    {
        "text": " Yo creo que,",
        "start": 1290.72,
        "end": 1291.96
    },
    {
        "text": " que,",
        "start": 1291.96,
        "end": 1293.48
    },
    {
        "text": " para definir emprendedor, no,",
        "start": 1293.48,
        "end": 1295.0
    },
    {
        "text": " o para,",
        "start": 1295.0,
        "end": 1295.56
    },
    {
        "text": " se ha rompido este,",
        "start": 1295.56,
        "end": 1296.52
    },
    {
        "text": " este, este cap,",
        "start": 1296.52,
        "end": 1297.44
    },
    {
        "text": " este,",
        "start": 1297.44,
        "end": 1298.44
    },
    {
        "text": " esta definición de emprendedor,",
        "start": 1298.44,
        "end": 1299.96
    },
    {
        "text": " yo creo que es importante,",
        "start": 1300.2,
        "end": 1301.92
    },
    {
        "text": " que,",
        "start": 1301.92,
        "end": 1302.28
    },
    {
        "text": " que intentar los ingredientes",
        "start": 1302.28,
        "end": 1303.4
    },
    {
        "text": " que hay en emprendedor,",
        "start": 1303.4,
        "end": 1304.28
    },
    {
        "text": " no,",
        "start": 1304.28,
        "end": 1305.44
    },
    {
        "text": " el eneentemente fundamental,",
        "start": 1305.44,
        "end": 1307.16
    },
    {
        "text": " este, la transformación,",
        "start": 1307.16,
        "end": 1309.3600000000001
    },
    {
        "text": " la innovación,",
        "start": 1309.3600000000001,
        "end": 1310.3600000000001
    },
    {
        "text": " como otro y un de los fundamentales,",
        "start": 1310.3600000000001,
        "end": 1312.4
    },
    {
        "text": " el riesgo,",
        "start": 1312.4,
        "end": 1313.2
    },
    {
        "text": " como otro ingrediente fundamental,",
        "start": 1313.2,
        "end": 1316.04
    },
    {
        "text": " y después, este,",
        "start": 1316.04,
        "end": 1318.0
    },
    {
        "text": " ese desingrediente humano,",
        "start": 1318.0,
        "end": 1319.48
    },
    {
        "text": " no,",
        "start": 1319.48,
        "end": 1319.8
    },
    {
        "text": " esa pasión,",
        "start": 1319.8,
        "end": 1320.76
    },
    {
        "text": " ese compromiso.",
        "start": 1320.76,
        "end": 1322.52
    },
    {
        "text": " Eso creo,",
        "start": 1322.52,
        "end": 1322.96
    },
    {
        "text": " son los ingredientes de,",
        "start": 1322.96,
        "end": 1324.0
    },
    {
        "text": " de, de, de,",
        "start": 1324.0,
        "end": 1324.52
    },
    {
        "text": " en emprendimiento o en emprendedor.",
        "start": 1324.52,
        "end": 1326.92
    },
    {
        "text": " Este, y bueno,",
        "start": 1326.92,
        "end": 1328.8
    },
    {
        "text": " después obviamente esa mi percepción, más estas definiciones, pero se está",
        "start": 1328.8,
        "end": 1335.7
    },
    {
        "text": " se amplia bastante el uso del término. Y bueno, acerca de emprender, no sé si",
        "start": 1335.7,
        "end": 1344.34
    },
    {
        "text": " quieren que ofrean un poquito acá, callamos el empreendedor, no sé si alguien",
        "start": 1344.34,
        "end": 1348.08
    },
    {
        "text": " tiene alguna duda o algo para comentar sobre esto.",
        "start": 1348.08,
        "end": 1352.48
    },
    {
        "text": " No, no, no. Jorge, vos ahí se amese a en escribir eso porque estoy",
        "start": 1352.48,
        "end": 1358.7
    },
    {
        "text": " presentando y...",
        "start": 1358.7,
        "end": 1360.14
    },
    {
        "text": " Sí, sí, cada vez que...",
        "start": 1360.14,
        "end": 1361.9
    },
    {
        "text": " Bueno, vamos a hablar de emprender un poco, no?",
        "start": 1361.9,
        "end": 1366.38
    },
    {
        "text": " Y acá me encanta esta frase de Ben Jorowood que es muy conocido, de que escribió",
        "start": 1366.38,
        "end": 1372.46
    },
    {
        "text": " en elincostio de empreendedor, norteamericano, que escribió esto de",
        "start": 1372.46,
        "end": 1376.3
    },
    {
        "text": " dejar sin saber ojar sin, en ese, la verdad, real en el dependeurismo no hay",
        "start": 1376.3,
        "end": 1381.78
    },
    {
        "text": " reglas. Y bueno, esto es fabuloso, no? Pues nosotros tenemos muchas",
        "start": 1381.78,
        "end": 1386.66
    },
    {
        "text": " materias en facultad que nos dicen cómo construir software, cómo realizar",
        "start": 1386.66,
        "end": 1390.1
    },
    {
        "text": " requerimiento, cómo hacer testing, cómo hacer esta promoción funcional, pero para",
        "start": 1390.1,
        "end": 1396.1
    },
    {
        "text": " hacer emprender, parece que es un terreno un poquito más, este, blando, un",
        "start": 1396.1,
        "end": 1401.1399999999999
    },
    {
        "text": " terreno un poquito más, este, desconocido y y es así, es interesante porque todo",
        "start": 1401.1399999999999,
        "end": 1408.98
    },
    {
        "text": " esto de emprender se trata de gestionar la incertidumbre, se trata de cómo",
        "start": 1408.98,
        "end": 1414.98
    },
    {
        "text": " navegar en el agua de desconocidas. Entonces, esta frase, creo que hay que",
        "start": 1414.98,
        "end": 1420.58
    },
    {
        "text": " aprenderla, hay que entenderla bien, este es cierto que no en reglas, es cierto",
        "start": 1420.58,
        "end": 1425.7
    },
    {
        "text": " que nadie en este curso, ni en ningún curso, y si les dicen que les están",
        "start": 1425.7,
        "end": 1430.02
    },
    {
        "text": " dando la receta para emprender, les están mintiendo, nadie les va a dar la receta",
        "start": 1430.02,
        "end": 1434.54
    },
    {
        "text": " para para emprender, entonces no hay reglas, entonces lo que tenemos que aprender",
        "start": 1434.54,
        "end": 1439.78
    },
    {
        "text": " es a navegar en ese incertidumbre, y bueno, después aparece este herramientas para",
        "start": 1439.78,
        "end": 1445.7
    },
    {
        "text": " navegar en ese incertidumbre, como la que vamos a ver ahora que lina esta",
        "start": 1445.7,
        "end": 1451.42
    },
    {
        "text": " ¿Pero no me tinta por favor? Alía ahí como que me chocaba un poco la paz con lo que",
        "start": 1453.98,
        "end": 1459.34
    },
    {
        "text": " estuvimos viendo en la clase pasado, que empezamos a ver como los caba y determinadas",
        "start": 1459.34,
        "end": 1465.3799999999999
    },
    {
        "text": " herramientas, que son como que te empiezan a ayudar a plantear las ideas, empezar a",
        "start": 1465.3799999999999,
        "end": 1470.76
    },
    {
        "text": " historitarlo, entonces como que choco un poco con eso de que no hay reglas, o sea,",
        "start": 1470.76,
        "end": 1475.6599999999999
    },
    {
        "text": " está receta perfecta, pero está, tiene herramientas quizás como que te ayudan a",
        "start": 1475.6599999999999,
        "end": 1481.5
    },
    {
        "text": " navegar esas aguas.",
        "start": 1481.5,
        "end": 1482.5
    },
    {
        "text": " Asi Martin, que vos mismo lo estás diciendo, si te escuchas ahí con con doble click,",
        "start": 1484.5,
        "end": 1490.82
    },
    {
        "text": " son herramientas, no son reglas, o sea reglas tenemos en el libro de físiga o en el",
        "start": 1490.82,
        "end": 1498.3
    },
    {
        "text": " libro de Calcuro hay un montón, o sea, pero esto distinto, son herramientas,",
        "start": 1498.3,
        "end": 1502.5
    },
    {
        "text": " o lo estás diciendo bien, no tenéis que ver. Y es más difícil cuando vemos cómo aplico",
        "start": 1502.5,
        "end": 1509.22
    },
    {
        "text": " las herramientas, ese es un segundo nivel, un aparece otro conocimiento que creo que en el mundo",
        "start": 1509.22,
        "end": 1515.54
    },
    {
        "text": " de hoy es de los conocimientos más valiosos que es la experiencia, ¿no? Este aplicío",
        "start": 1515.54,
        "end": 1520.66
    },
    {
        "text": " está herramienta, me sirvió, este o como puedo aprendre la experiencia de otros,",
        "start": 1520.66,
        "end": 1524.7
    },
    {
        "text": " este como aplicaban estas herramientas, pero bueno, sí quédense con la idea,",
        "start": 1524.7,
        "end": 1529.94
    },
    {
        "text": " que cuando sale a emprendedurismo busquen herramientas y si alguien les promete o les",
        "start": 1529.94,
        "end": 1534.74
    },
    {
        "text": " creven de otra cosa, este bueno, sepan que les está mintiendo, no vale más, este,",
        "start": 1534.74,
        "end": 1540.54
    },
    {
        "text": " entonces nada, está bueno, está bueno para estar acá y entender y por el contrario,",
        "start": 1540.54,
        "end": 1548.18
    },
    {
        "text": " no es que las herramientas que van a haber en el curso que ya habieron, que van a haber,",
        "start": 1548.18,
        "end": 1551.54
    },
    {
        "text": " digamos, hoy no hacían para nada, sino todo lo contrario, o sea, es lo que nos permite",
        "start": 1551.54,
        "end": 1555.46
    },
    {
        "text": " minimizar ese riesgo y oposar a nos cuenta cuando nos estaba metiendo en el poso,",
        "start": 1555.46,
        "end": 1561.86
    },
    {
        "text": " o cuando nos estamos acercando el lugar de lo arranco, este, o cuando no hay salida,",
        "start": 1561.86,
        "end": 1566.06
    },
    {
        "text": " este, y bueno, nada, con esas herramientas, este, poder, poder, este, poder pilotear el",
        "start": 1566.06,
        "end": 1573.8999999999999
    },
    {
        "text": " lo arco. Y acá, esta, esta ya por siempre la ponemos en esta clase porque es un poco eco en",
        "start": 1573.8999999999999,
        "end": 1586.2199999999998
    },
    {
        "text": " donde están ustedes parados, no, este, creo que eso es importante, yo creo que ninguno",
        "start": 1586.22,
        "end": 1592.34
    },
    {
        "text": " en la clásica, más que mi vivo, que tiene en emprendimiento funcionando, entonces quizás",
        "start": 1592.34,
        "end": 1596.46
    },
    {
        "text": " el, lo primero que se preguntan es este, nada, de dónde se se parte, ¿no? Este, cuál es el",
        "start": 1596.46,
        "end": 1602.8600000000001
    },
    {
        "text": " punto cero. Y esto es interesante, este, porque, porque muchas veces, por ejemplo,",
        "start": 1602.8600000000001,
        "end": 1611.38
    },
    {
        "text": " ya ni hoy comentaba este, un poco el emprendimiento que, que donde él trabaja, que, bueno,",
        "start": 1612.38,
        "end": 1619.0600000000002
    },
    {
        "text": " es un software que desarrolla una emprenda y es interesante, verlo desde donde se dan",
        "start": 1619.0600000000002,
        "end": 1625.42
    },
    {
        "text": " arrancano, ¿no? Yo creo que, que ese, ese emprendimiento arrancado es una visión, este, la visión",
        "start": 1625.42,
        "end": 1632.3400000000001
    },
    {
        "text": " de, y corregime ya ni se me equivoco, de, de, de, de, de, de, directora se emprenda,",
        "start": 1632.3400000000001,
        "end": 1636.74
    },
    {
        "text": " decir, bueno, quiero digitalizar, este, los procesos de un emprenda, o yo creo que hoy,",
        "start": 1636.74,
        "end": 1641.54
    },
    {
        "text": " con la gestión que hay, no es suficiente, o no puedo planar todo el rendimiento del negocio,",
        "start": 1641.54,
        "end": 1647.26
    },
    {
        "text": " y creo que la simprenda funcionaría mejor así, entonces eso es una visión, o sea, no, no,",
        "start": 1647.26,
        "end": 1652.58
    },
    {
        "text": " no es, este, otra cosa que una, este, una imaginación de futuro que, bueno, después en el futuro,",
        "start": 1652.58,
        "end": 1658.98
    },
    {
        "text": " puede generar un valor. Este es el, el, el estereotipo de, de, de, el rendimiento, ¿no?",
        "start": 1658.98,
        "end": 1664.38
    },
    {
        "text": " De carranca, de, de, de una visión, de una idea, muchas veces de cómo debería hacer el mundo,",
        "start": 1664.38,
        "end": 1669.1000000000001
    },
    {
        "text": " cómo haría ser determinado proceso, y vamos a ver que, y, y creo y me arrejaría decir,",
        "start": 1669.1000000000001,
        "end": 1674.9
    },
    {
        "text": " este, que es la que, una de las que más siguen, los ingenieros, y quizás fue la que yo se",
        "start": 1674.9,
        "end": 1681.0600000000002
    },
    {
        "text": " y este, y me anemaría decir que es de los puntos de partida más complicados y con menos",
        "start": 1681.0600000000002,
        "end": 1686.14
    },
    {
        "text": " probabilidad de éxito de todos, este, entonces, nada, salvo que se hace Steve Jobs, este, no,",
        "start": 1686.14,
        "end": 1693.3400000000001
    },
    {
        "text": " es un tipo de tu una visión de transformar la vida de todos, este, seguramente, encontremos en",
        "start": 1693.3400000000001,
        "end": 1698.14
    },
    {
        "text": " historia personajes con esta visión, en realidad, no es, o sea, la visión es una cosa que tenemos",
        "start": 1698.14,
        "end": 1706.8600000000001
    },
    {
        "text": " en la cabeza, este, como se lavora este, bueno, es un lo tema, pero pero ahí ya ni capaz que,",
        "start": 1706.8600000000001,
        "end": 1712.8200000000002
    },
    {
        "text": " que dale vos capaz que contárselo más respecto a esto, sí que más allá de la visión que",
        "start": 1712.82,
        "end": 1718.82
    },
    {
        "text": " podría ser tener, el dueño en emperta había una necesidad también porque en el ruro no hay algo,",
        "start": 1718.82,
        "end": 1725.22
    },
    {
        "text": " es un, es un ruro muy enicho y no hay algo tan específico y lo poco que había, no estaba bien,",
        "start": 1725.78,
        "end": 1731.6599999999999
    },
    {
        "text": " y, y, y un poco de ahí salió la necesidad y está, este, justo será la casualidad que el hermano",
        "start": 1733.46,
        "end": 1740.8999999999999
    },
    {
        "text": " del dueño en emperta estudia ingeniería software, entonces, y como, y ahí jame jamás el",
        "start": 1740.9,
        "end": 1749.22
    },
    {
        "text": " tu poquito, yo no hay, yo, Jorge ya se llama la rey, pues, me encanta hacer estas cosas,",
        "start": 1749.22,
        "end": 1754.02
    },
    {
        "text": " ¿cómo sabes que en el sector necesita eso? O sea, las de que el sector tiene una necesidad,",
        "start": 1755.46,
        "end": 1759.7
    },
    {
        "text": " pero ¿cómo se manifiestas la necesidad?",
        "start": 1759.7,
        "end": 1762.66
    },
    {
        "text": " En qué sentido?",
        "start": 1762.66,
        "end": 1765.74
    },
    {
        "text": " Claro, o es el sector, no hay nada en el sector, digamos, de imprentas que tengan software y amo de",
        "start": 1765.74,
        "end": 1772.5800000000002
    },
    {
        "text": " administración, es que, no, eso es lo que os afirmaste. Claro, es que real tipo,",
        "start": 1772.5800000000002,
        "end": 1777.3000000000002
    },
    {
        "text": " hay algunas cosas, pero están como, o sea, la solución está que nosotros estamos tratando de hacer,",
        "start": 1777.3000000000002,
        "end": 1784.74
    },
    {
        "text": " es una, es un, como, una mezcla entre CRM, un RP, potenciado con un cotizador, entonces,",
        "start": 1785.3,
        "end": 1792.82
    },
    {
        "text": " cotizadores no había muchos, o eran muy difíciles de conseguir, y claro, en tipo de la cotización,",
        "start": 1792.82,
        "end": 1800.34
    },
    {
        "text": " ya te da la producción, entonces, tenía que juntar ese cotizador, o la salía ese cotizador,",
        "start": 1800.34,
        "end": 1805.86
    },
    {
        "text": " con toda la parte de, de cómo, este, manejar la, la, la efectividad de cada usuario de cada",
        "start": 1805.86,
        "end": 1813.22
    },
    {
        "text": " repuso. Entonces, como que tenías tipo cosas separadas, pero que no las voy a unir en ningún momento,",
        "start": 1813.22,
        "end": 1819.06
    },
    {
        "text": " y capaz de unirla, será, era mucho más difícil que tener un sistema medio precario, excel y,",
        "start": 1819.06,
        "end": 1825.3
    },
    {
        "text": " y alguna cosa más. Sí, y ahí la pregunta es ¿quién tenía ese problema de unir las cosas?",
        "start": 1825.3,
        "end": 1832.98
    },
    {
        "text": " Una manera una persona.",
        "start": 1832.98,
        "end": 1834.98
    },
    {
        "text": " Que me jefe. Ahí está, este, entonces, ahí, entre en este juego incomo, gracias,",
        "start": 1834.98,
        "end": 1845.14
    },
    {
        "text": " Y, y, y, y, y, no quiero que te jodas, baladar la mano, queremos favorecer que se hace,",
        "start": 1845.14,
        "end": 1850.02
    },
    {
        "text": " todo lo contrario, existe una parte muy bueno, este, entramos en ese juego incomo de desarrollar",
        "start": 1850.02,
        "end": 1856.18
    },
    {
        "text": " productos, no, de, dearnos cuenta de que, de que, pero, ¿quién lo necesita? O sea, la",
        "start": 1856.18,
        "end": 1862.66
    },
    {
        "text": " misma persona que le está impulsando, digo, pero los otros también lo necesitan, ¿cómo sabemos que",
        "start": 1862.66,
        "end": 1866.66
    },
    {
        "text": " lo necesitan? Y si lo necesitan, porque ya no lo tuvieron de la manera. Entonces, este,",
        "start": 1866.66,
        "end": 1871.46
    },
    {
        "text": " este, es un juego, este, o es una serie de preguntas que uno se empieza a hacer, este, y ahí empieza",
        "start": 1871.46,
        "end": 1877.18
    },
    {
        "text": " uno a descubrir, digamos, este, ¿qué hay? ¿Por qué? ¿No? Entonces, nada, el juego está ahí,",
        "start": 1877.18,
        "end": 1883.42
    },
    {
        "text": " simplemente era para, para ilustrar eso, este, obviamente, no tengo idea, ¿no? De, de, de esto,",
        "start": 1883.42,
        "end": 1889.42
    },
    {
        "text": " este, en particular, así que bueno, este, pero también me parece un ejemplo para mostrar,",
        "start": 1889.42,
        "end": 1895.3400000000001
    },
    {
        "text": " instra un poco esa visión, ¿no? La visión de esa persona que, que tenía ese problema, que",
        "start": 1895.3400000000001,
        "end": 1899.5
    },
    {
        "text": " salió al sol, su problema, así que, ve que otras personas, este pueden tener el mismo problema,",
        "start": 1899.5,
        "end": 1903.9
    },
    {
        "text": " que uno, ¿no? Entonces, ese es el punto de partida de muchos emprendimientos. Después,",
        "start": 1903.9,
        "end": 1909.9
    },
    {
        "text": " nada, hay otras emprendimientos que, que ahora vamos a dar ejemplo, pueden arrancar de un",
        "start": 1911.42,
        "end": 1916.38
    },
    {
        "text": " cliente, decir, bueno, el típico grupo de amigos, o que, que, realmente, conocen a alguien,",
        "start": 1916.38,
        "end": 1921.42
    },
    {
        "text": " este, que, que bueno, que, que no bajan en una empresa, de tener un tema de sojo,",
        "start": 1921.42,
        "end": 1926.7800000000002
    },
    {
        "text": " en entonces, los contratan y, ya se en ese programa, después le piden otro, este, y después,",
        "start": 1926.7800000000002,
        "end": 1932.0600000000002
    },
    {
        "text": " esa organización empieza más cosa, entonces, empiezan a, a ser por ahí, este, a veces,",
        "start": 1932.06,
        "end": 1937.22
    },
    {
        "text": " ha pasado en equipo, decir, bueno, acá, tengo mi compañero de, de grupo de negocios de sofo,",
        "start": 1937.22,
        "end": 1943.6599999999999
    },
    {
        "text": " este, me he hecho particular con ellos, y somos recomplementarios, y tengo la misma onda,",
        "start": 1943.6599999999999,
        "end": 1948.1399999999999
    },
    {
        "text": " entonces, este, queremos seguir trabajando juntos, entonces salimos a buscar clientes, que nos",
        "start": 1948.1399999999999,
        "end": 1952.22
    },
    {
        "text": " piden por lo que nos gusta, os sabemos hacer, este, después ha pasado, se en la tecnología,",
        "start": 1952.22,
        "end": 1956.8999999999999
    },
    {
        "text": " que es un poco, también, mi, mi caso, este, que es, y bueno, yo, se mucho, a mí te",
        "start": 1956.9,
        "end": 1964.18
    },
    {
        "text": " desamucho, no sé, el Machine Learning, entonces, salgo, me, me aprendo todo y, si usar muy bien",
        "start": 1964.18,
        "end": 1971.38
    },
    {
        "text": " ese martillo, y salgo, este, a, bueno, ver que, que, claro, salí para, para mi martillo,",
        "start": 1971.38,
        "end": 1977.38
    },
    {
        "text": " y, y, y puedo dar un negocio a partir de, de esa idea, este, simplemente para, para",
        "start": 1977.38,
        "end": 1982.22
    },
    {
        "text": " ilustrarles, este, hay unos ejemplos de, de, de, bueno, la idea, visión, vamos a poner",
        "start": 1982.22,
        "end": 1987.98
    },
    {
        "text": " ejemplos de éxito, ¿no? o, test, la Apple, realmente, son, me caso a los más, estamos,",
        "start": 1987.98,
        "end": 1994.22
    },
    {
        "text": " estamos nombrando, de minencias de esto, ¿no? Personas que, de alguna manera, este, si",
        "start": 1994.22,
        "end": 1999.42
    },
    {
        "text": " me hajeado en un futuro, este, hace mucho tiempo, de, donde, no existían, de, de, las",
        "start": 1999.42,
        "end": 2005.54
    },
    {
        "text": " para computar las personas, y el tipo se ocurrió, este, que la gente va a necesitar computar",
        "start": 2005.54,
        "end": 2010.42
    },
    {
        "text": " las personas, y, un trajente de los tildos del oco, este, y bueno, de hecho, seguro, lo",
        "start": 2010.42,
        "end": 2016.6200000000001
    },
    {
        "text": " estaba, y, y, y bueno, de esa manera logró, este, e aportar una innovación que, después",
        "start": 2016.6200000000001,
        "end": 2022.1000000000001
    },
    {
        "text": " cuando la mostró, la gente, la, aquí hizo y fue un éxito, ¿no? este, lo mismo con",
        "start": 2022.1000000000001,
        "end": 2026.8200000000002
    },
    {
        "text": " Tesla, creo que Tesla, sobre ejemplo, claro, a nivel nacional, pedió ya, en el equipo de",
        "start": 2026.8200000000002,
        "end": 2033.8600000000001
    },
    {
        "text": " un chico de la RTE que, que, bueno, que, nada, se dijo, bueno, no, no quiero llamar, más",
        "start": 2033.86,
        "end": 2039.6999999999998
    },
    {
        "text": " por teléfono, para mí, lo mejor es, el pelo, tras mi internet, este, y bueno, el plantearon",
        "start": 2039.6999999999998,
        "end": 2045.86
    },
    {
        "text": " eso, y, y, voy a estar, ¿no? este, después, hay otros ejemplos, este, de equipo humano,",
        "start": 2045.86,
        "end": 2054.54
    },
    {
        "text": " quiero nombrar el, el píxis que es el que mejor conozco, este, donde, bueno, ah, grupo",
        "start": 2054.54,
        "end": 2060.5
    },
    {
        "text": " de personas que trabajaba en Amaldo Castro, no, no le gustaba tanto cómo se va el trabajo",
        "start": 2060.5,
        "end": 2066.74
    },
    {
        "text": " ahí, tenía mucha finidad entre ellos, este, en el profesional muy bueno, entonces, dijieron,",
        "start": 2066.74,
        "end": 2071.74
    },
    {
        "text": " bueno, vamos a abrir una empresa de software, este, donde, nosotros podamos las relas, este, y,",
        "start": 2071.74,
        "end": 2077.86
    },
    {
        "text": " bueno, eh, no, oí por hoy esa idea, no ha sido hace 11 años, y ese no nos formó una empresa",
        "start": 2077.86,
        "end": 2083.1
    },
    {
        "text": " de 300 personas, este, con su curso en el 6 países, y bueno, lo que, lo que, y identifica",
        "start": 2083.1,
        "end": 2088.62
    },
    {
        "text": " esa empresa, sobre todo, a las cosas es, eh, la part humana y, y los pensamientos y, y la",
        "start": 2088.62,
        "end": 2094.66
    },
    {
        "text": " comodidad de esas personas que los fundaron, ¿no? Entonces, este, nada, eh, eso es un poco,",
        "start": 2094.66,
        "end": 2101.66
    },
    {
        "text": " esa forma de, de emprender, ¿no? Obviamente, eh, pone encima de la tecnología, poca ni",
        "start": 2101.66,
        "end": 2106.94
    },
    {
        "text": " de mutando, encima del sector, que quise que quise arrancar con turismo, este, y en turismo",
        "start": 2106.94,
        "end": 2112.14
    },
    {
        "text": " no, no le fue muy bien, entonces, buscaron eso otra cosa, o sea, lo que se mantuvo en el tiempo,",
        "start": 2112.14,
        "end": 2115.9
    },
    {
        "text": " se le equipó humano, y fueron buscando alguna forma que, qué cosas podían atender con ese",
        "start": 2115.9,
        "end": 2121.38
    },
    {
        "text": " equipo humano? Este, bueno, basaba la tecnología, no me ponía dos ejemplos, eh, Trilab, este,",
        "start": 2121.38,
        "end": 2130.78
    },
    {
        "text": " es una empresa muy conocida, este, que tuve la genialidad de poner este policía en la",
        "start": 2130.78,
        "end": 2135.98
    },
    {
        "text": " cabeza de escucho de panes, realmente, en las cosas más brillantes que he visto, este",
        "start": 2135.98,
        "end": 2140.02
    },
    {
        "text": " mi diente era, este, y bueno, eh, nada, eh, Trilab también, un grupo de socios que les",
        "start": 2140.02,
        "end": 2148.18
    },
    {
        "text": " decía bueno, mas inlamo y más plotar, se dedicaron a 100% a eso y, y bueno, se enfocaron",
        "start": 2148.18,
        "end": 2153.94
    },
    {
        "text": " ahí y no sé, y siempre se arrogan esa tecnología, bueno, Dr. Onfis, un poco lo mismo,",
        "start": 2153.94,
        "end": 2158.9
    },
    {
        "text": " Dr. Onfis es una empresa especialista en el sector de drones y hemos vivido ya,",
        "start": 2158.9,
        "end": 2162.86
    },
    {
        "text": " fuertemente dos veces, ahora con este nuevo pivot que estamos haciendo, este, y sin embargo,",
        "start": 2163.58,
        "end": 2169.38
    },
    {
        "text": " siempre hemos estado en una tecnología donde, donde tenemos si hay los despertidos,",
        "start": 2169.38,
        "end": 2174.7000000000003
    },
    {
        "text": " donde, no sé, nos vamos a especializar y donde ya tenemos cierto reconocimiento. La",
        "start": 2174.7000000000003,
        "end": 2179.54
    },
    {
        "text": " ventaja de esto es que de a poquito te vas este, que con el correo del tiempo va a generar una",
        "start": 2179.54,
        "end": 2184.7000000000003
    },
    {
        "text": " experiencia en el área, este, que, nada, que, o sea, que te mantiene, que te palanca,",
        "start": 2184.7,
        "end": 2191.3799999999997
    },
    {
        "text": " digamos, para la nueva cosa. Las ventaja es que a veces estás como un poquito batado,",
        "start": 2191.3799999999997,
        "end": 2196.3399999999997
    },
    {
        "text": " capaz que hay un oportunidad mejor, es, no sé, en FinTech, este, con el equipo que",
        "start": 2196.3399999999997,
        "end": 2200.7799999999997
    },
    {
        "text": " tenés, pero bueno, el acuerdo tenés perfilado para ahí, entonces, este, nada, eh, ventaja",
        "start": 2200.7799999999997,
        "end": 2207.06
    },
    {
        "text": " si ventaja. Y bueno, la última es, es, a partir de un cliente, este, nada, el tema de,",
        "start": 2207.06,
        "end": 2215.74
    },
    {
        "text": " de, de prender a partir un cliente, tiene que ver con, con eso, bueno, contratar bien y le damos,",
        "start": 2215.74,
        "end": 2221.62
    },
    {
        "text": " ahí las ventaja que tiene es que, es que bueno, eh, que hemos muy atados al principio con ese",
        "start": 2221.62,
        "end": 2227.38
    },
    {
        "text": " cliente y que, alguna forma, este, no, que, nuestra demanda en nuestro éxito va a depender",
        "start": 2227.38,
        "end": 2237.1800000000003
    },
    {
        "text": " de ese cliente, no? Por más que, pues, pongo un caro otro, el, el ciclo de ese negocio se",
        "start": 2237.1800000000003,
        "end": 2242.98
    },
    {
        "text": " va a hacer principio muy en eso, entonces ese cliente después nos va a jala llave, este,",
        "start": 2242.98,
        "end": 2246.38
    },
    {
        "text": " uno va a jala mitad del equipo, eh, dos fuimos mucho, es muy difícil, este, moverse ahí también,",
        "start": 2246.38,
        "end": 2251.7000000000003
    },
    {
        "text": " porque ese cliente va a agarrar la mayoría de los recursos del principio, de la empresa, es muy",
        "start": 2251.7000000000003,
        "end": 2256.58
    },
    {
        "text": " difícil salir esa situación, entonces, este, nada, por lo tanto, es muy provisible, ¿no? Porque,",
        "start": 2256.58,
        "end": 2261.02
    },
    {
        "text": " uno sabe que tiene ese cliente, este, de color a todos los meses, entonces, eso pito, las, las",
        "start": 2261.02,
        "end": 2266.34
    },
    {
        "text": " ventaja, si ventaja de cada caso, quizás para complementar, no cosa que me faltó decir, ese,",
        "start": 2266.34,
        "end": 2272.62
    },
    {
        "text": " este, nada, que, las ventaja de, de, de, de, de, de, de, de, de, de, de entender a partir una",
        "start": 2272.62,
        "end": 2278.5
    },
    {
        "text": " visión es que, es que facilita todo lo que es la planificación y es en una dirección clara,",
        "start": 2278.5,
        "end": 2282.58
    },
    {
        "text": " no, es la que quería auto-selectrico y vamos a hacer auto-selectrico, después hemos",
        "start": 2282.58,
        "end": 2286.8199999999997
    },
    {
        "text": " de cuatro, seis o dos ruedas, si son para ricos, o son este, semento medio, este, pero vamos a",
        "start": 2286.8199999999997,
        "end": 2292.94
    },
    {
        "text": " hacer auto-selectrico, entonces, eso es un unito a la planificación es muy claro y muy, muy fácil,",
        "start": 2292.94,
        "end": 2297.98
    },
    {
        "text": " ¿no? este, la ventaja es que es a todo nada, o sea, si realmente la gente no hubiera querido",
        "start": 2297.98,
        "end": 2303.54
    },
    {
        "text": " de los electro-selectricos, o realmente lo que se podía pagar por ellos, no, no, no era lo que,",
        "start": 2303.54,
        "end": 2308.02
    },
    {
        "text": " lo que se puede pagar, entonces, este, quizás te les hubiera desaparecido, entonces, este, nada,",
        "start": 2308.02,
        "end": 2314.18
    },
    {
        "text": " lo mismo, a, o sea, no sé cómo era que a Steve Jobs, si era gente no quisiera compotorar",
        "start": 2314.18,
        "end": 2318.7
    },
    {
        "text": " a las personas, eso le vamos por obvio, pero, este, realmente, yo tomo, todo mucho río en esa decisión.",
        "start": 2318.7,
        "end": 2323.94
    },
    {
        "text": " Y bueno, vamos a sementiéndonos en el tema de, fuerte el día que es Linus Tarta, este, y acá,",
        "start": 2327.62,
        "end": 2334.98
    },
    {
        "text": " quiero citar a Daga Bazaki, es que es profesor de, de la Universidad de Berkeley, este, y",
        "start": 2334.98,
        "end": 2341.5
    },
    {
        "text": " Linus Tarta viene a, es como es mucho más que una metología, es un poco, la siguiente si es",
        "start": 2342.7,
        "end": 2349.98
    },
    {
        "text": " un espíritu que viene impregnado en el coste de amaprendedor, digamos, notamérica, no,",
        "start": 2349.98,
        "end": 2353.86
    },
    {
        "text": " y creo que si lo extrañé en esta frase, dice, el primer paso no debería ser",
        "start": 2353.86,
        "end": 2357.94
    },
    {
        "text": " elegir un plan de negocios, una presentación o modelo financiero, si eres capaz de construir un",
        "start": 2357.94,
        "end": 2362.62
    },
    {
        "text": " prototipo y mostrarlo con éxito, puede que nunca tenga la necesidad o el tiempo para ningún",
        "start": 2362.62,
        "end": 2367.3399999999997
    },
    {
        "text": " tipo de plan. Miren cómo, cómo choca esto, con seguramente lo que, lo que vemos en ingenieros",
        "start": 2367.3399999999997,
        "end": 2374.98
    },
    {
        "text": " software o las bateras ingenierías, ¿no? Lo primero que voy a hacer es un ingenieros un plan,",
        "start": 2374.98,
        "end": 2379.2599999999998
    },
    {
        "text": " y sin embargo, este, este, este señor, este, nos propone, este, hacer todo lo contrario, ¿no?",
        "start": 2381.2599999999998,
        "end": 2389.2599999999998
    },
    {
        "text": " No hacer un plan, sino, este, construir un prototipo, mostrarlo y bueno, y avanzar en base a",
        "start": 2389.7400000000002,
        "end": 2398.1400000000003
    },
    {
        "text": " eso. Entonces, acá, acá se empieza a ver un poco de qué se trata a aprender, a aprender,",
        "start": 2398.1400000000003,
        "end": 2405.9
    },
    {
        "text": " y vamos a verlo atrás de Linus Tarta. Es una, es una, bueno, también es una metología,",
        "start": 2405.9,
        "end": 2417.26
    },
    {
        "text": " ya se ha venido aplicando desde 2011, es utilizada por la mayoría de los empresarios en Silicon",
        "start": 2417.26,
        "end": 2422.78
    },
    {
        "text": " Valley, este, bueno, particularmente se utiliza para el desarrollo de, de producto, digamos, y bueno,",
        "start": 2422.78,
        "end": 2430.7000000000003
    },
    {
        "text": " fue propuesta por, por el ITRICE 2011, y lo que se busca es experimentación basada en hipótesis",
        "start": 2430.7000000000003,
        "end": 2436.7000000000003
    },
    {
        "text": " y en negocios, o sea, eso es lo que, es lo que busca, me, me de imaginarnos y tal persona,",
        "start": 2436.7000000000003,
        "end": 2442.5400000000004
    },
    {
        "text": " precisario, este, vamos, vamos a un, vamos a un experimento para ver si lo precisó, no,",
        "start": 2442.54,
        "end": 2447.02
    },
    {
        "text": " o en vez de imaginarnos que la gente lo va a pedir por internet, me de llamar por teléfono,",
        "start": 2447.02,
        "end": 2452.62
    },
    {
        "text": " vamos a hacer una página, este, y vemos si dan clic ahí, este, y en todo caso, este, después",
        "start": 2452.62,
        "end": 2458.22
    },
    {
        "text": " llamo por teléfono para pedir lo que pidieron, que eso fue lo que hizo que dio ya, este, en sus comienzas,",
        "start": 2458.22,
        "end": 2462.7
    },
    {
        "text": " entonces, eso es la experimentación, esa es el foco, habla también de liberación de productos",
        "start": 2462.7,
        "end": 2468.14
    },
    {
        "text": " iterativas, o sea, implica, no, no buscar un producto perfecto, como normalmente los ingenieros,",
        "start": 2468.14,
        "end": 2476.06
    },
    {
        "text": " solemos hacer, porque nos enamoramos, lo que nos lo casemos, si nos encanta, lo que hacemos,",
        "start": 2476.06,
        "end": 2480.06
    },
    {
        "text": " bueno, lo que busca el INSTARTP es justamente generar iteraciones, este, y lo gran algo que",
        "start": 2480.06,
        "end": 2485.9
    },
    {
        "text": " se domina, aprende, denomina aprendizaje validado, este, que tiene que ver con, uno tiene",
        "start": 2485.9,
        "end": 2492.14
    },
    {
        "text": " ciertas hipótesis, y a partir de esto, este, uno lo, las comporé a realmente, y uno puede decir,",
        "start": 2492.14,
        "end": 2497.8199999999997
    },
    {
        "text": " no es que las imprentas necesitan un software, o me imagino que eso, sino que, entreviste a 20",
        "start": 2497.8199999999997,
        "end": 2506.62
    },
    {
        "text": " imprentas, y las 20 tienen el problema, o 15 tienen el problema de que, el SARME que tienen,",
        "start": 2506.62,
        "end": 2513.1
    },
    {
        "text": " no está integrado con el sistema de evacuación, y eso no les permite trazar, en qué clientes",
        "start": 2515.1,
        "end": 2521.2599999999998
    },
    {
        "text": " enfocarse, y todos quieren tener, y todos sus anteriores información para tomar decisiones,",
        "start": 2521.26,
        "end": 2525.1000000000004
    },
    {
        "text": " entonces, si vos tenés ese dato de la realidad, el quinto a poder proyectar lo digamos, en función",
        "start": 2525.1000000000004,
        "end": 2530.86
    },
    {
        "text": " de, de, de un hipótesis.",
        "start": 2530.86,
        "end": 2532.86
    },
    {
        "text": " Y bueno, en respecto a la metodología Lin, este, también surge, un poco como, como respuesta,",
        "start": 2539.5,
        "end": 2547.42
    },
    {
        "text": " necesidades de inversores, ¿no? Ese, ustedes saben que, que hay mucha plata de invertida,",
        "start": 2547.42,
        "end": 2552.3
    },
    {
        "text": " bueno, en San Francisco todo el tema de las startups, y, y el SARME te lo gien hacia ahí, y bueno, y, y lo que se busca",
        "start": 2552.3,
        "end": 2559.1800000000003
    },
    {
        "text": " también, es, maximizar el rendimiento, ese, no, no, ustedes saben que tal, los inversores de riesgo,",
        "start": 2559.1800000000003,
        "end": 2567.58
    },
    {
        "text": " normalmente, en VR, tienen, en muchas empresas, en muchas startups, este, pero bueno, en finalía,",
        "start": 2567.58,
        "end": 2571.7400000000002
    },
    {
        "text": " que en retorno, quieren maximizar ese retorno, entonces, este tanto para los inversores,",
        "start": 2571.7400000000002,
        "end": 2575.58
    },
    {
        "text": " yo diría que para los inversores, en la forma óptima, de que sucede dinero, que las empresas en las que",
        "start": 2576.06,
        "end": 2579.8199999999997
    },
    {
        "text": " invierten, usan el inestarta. Para el emprendedor, lo que hace, el inestarta, pues, minimizar el costo de",
        "start": 2579.8199999999997,
        "end": 2587.2599999999998
    },
    {
        "text": " los fallos, o mejor dicho, equivocarse una manera inteligente, no significa que, en final de el día,",
        "start": 2587.2599999999998,
        "end": 2594.7799999999997
    },
    {
        "text": " le permita mitigar todos los riesgos, y no significa que le permita, digamos, desde una perfectión",
        "start": 2594.7799999999997,
        "end": 2599.9
    },
    {
        "text": " individual asegurarse el éxito de, de, de su empresa, yo, porque bueno, está ahí, ahí, ahí,",
        "start": 2599.9,
        "end": 2606.86
    },
    {
        "text": " hay otras cuestiones que, que ya vamos a ir viendo. Y bueno, hay una cosa importante,",
        "start": 2606.86,
        "end": 2613.6600000000003
    },
    {
        "text": " entonces, estamos hablando de hipótesis y experimentación, creo que en claras hezados palabras,",
        "start": 2615.02,
        "end": 2620.62
    },
    {
        "text": " asociadas a Lin, que yo no es, es, es, visión, no es, este, imaginarlo, no es un cliente,",
        "start": 2620.62,
        "end": 2626.3
    },
    {
        "text": " tengo un hipótesis, creo que las cosas son una manera y creo experimento para, para verificar",
        "start": 2626.86,
        "end": 2632.0600000000004
    },
    {
        "text": " qué es donde se maner. Y esto nos lleva a esta última frase que dice quien valida es siempre",
        "start": 2632.0600000000004,
        "end": 2637.54
    },
    {
        "text": " en el mercado, o sea, nosotros, o sea, nuestras ideas todo bien, pero, pero en el fin de día, la verdad,",
        "start": 2637.54,
        "end": 2643.02
    },
    {
        "text": " de un negocio, la verdad, de una, de una, de una, de una tecnología, de una innovación, es,",
        "start": 2643.02,
        "end": 2648.78
    },
    {
        "text": " es, si en el mercado las aceptaron. Y de punto de vista, de, vamos, del desarrollo de la operativa,",
        "start": 2648.78,
        "end": 2655.26
    },
    {
        "text": " lo que busca de estas filosofías es, es, realmente, que, que decanten las actividades que aportan",
        "start": 2655.26,
        "end": 2661.5
    },
    {
        "text": " valor a la cana de producción y quitar todo lo que superfluyamos y generen gastos que son",
        "start": 2661.5,
        "end": 2666.1400000000003
    },
    {
        "text": " innecesarios para, para el desarrollo de la empresa. Y vamos a ver estos tres ideales. La primera",
        "start": 2666.1400000000003,
        "end": 2673.82
    },
    {
        "text": " es, entregar valor, desde la, y, hay infasible desde la perspectiva de cliente. Uno se imagina que",
        "start": 2673.82,
        "end": 2682.46
    },
    {
        "text": " algo es, para mí algo es muy útil para uno, como aprended, la idea de algo que uno son los cotillanos,",
        "start": 2682.46,
        "end": 2687.6200000000003
    },
    {
        "text": " pero, de punto de vista de cliente, no es lo más, lo más que digamos útil. A mí pasó con,",
        "start": 2687.6200000000003,
        "end": 2697.3
    },
    {
        "text": " por ejemplo, funcionalidades de productos míos, o sea, yo también el operador, de dron, o sea,",
        "start": 2698.3,
        "end": 2707.34
    },
    {
        "text": " por un tema digamos, de que también lo usaba a veces, y bueno, a veces hay cosas que, que a mí",
        "start": 2707.34,
        "end": 2713.94
    },
    {
        "text": " más resultaban reprácticas, pero bueno, los clientes no, no es realmente pagaban por eso. Entonces,",
        "start": 2713.94,
        "end": 2719.1000000000004
    },
    {
        "text": " nada, eso significaba que, por hacer eso no, mi empresa no iba a dar más dinero. Entonces,",
        "start": 2720.1,
        "end": 2726.2999999999997
    },
    {
        "text": " eso es importante, no, poder tener una sensibilidad y poder generar experimentos que valíes desde la",
        "start": 2726.2999999999997,
        "end": 2732.38
    },
    {
        "text": " perspectiva de cliente. Después, a la deliminada cualquier actividad superflua o residuos, lo que no",
        "start": 2732.38,
        "end": 2738.38
    },
    {
        "text": " aporte valor al producto final. Bueno, eso, muchas veces los ingenieros, sobre todo, tenemos un cejo y",
        "start": 2738.38,
        "end": 2747.86
    },
    {
        "text": " ahora me fáciles decir en estos cejos porque estoy hablando de estudiantes y generías.",
        "start": 2747.86,
        "end": 2751.54
    },
    {
        "text": " Buscamos esa construcción perfecta, acababa que super óptima, performante, está bien escrito el",
        "start": 2751.54,
        "end": 2761.46
    },
    {
        "text": " código, este, como dos cosas que, que el cliente no se entera, si está bien escrito, no está bien",
        "start": 2761.46,
        "end": 2767.34
    },
    {
        "text": " aquí lo que es el código. O sea, el cliente, si hace clic y pasa lo que les espera, está ok.",
        "start": 2767.34,
        "end": 2771.9
    },
    {
        "text": " Si ese código se crió en 10 líneas, son 500, si está escrito en Pascal o en Java, o sea,",
        "start": 2771.9,
        "end": 2777.34
    },
    {
        "text": " le da lo mismo. Entonces, esto es importante porque, si bien, los atributos de calidad,",
        "start": 2777.34,
        "end": 2784.6600000000003
    },
    {
        "text": " eso fue van a tener, van a condicional, desarrollo empresarial, o el desarrollo del producto,",
        "start": 2784.6600000000003,
        "end": 2789.34
    },
    {
        "text": " en algún instancia, muchas veces el valor, no lo cliente no parcibe ese valor. Entonces,",
        "start": 2789.34,
        "end": 2794.58
    },
    {
        "text": " esto ha aplicado un prototipo, vale más la pena agarrar, ya sea un superclase, en ángulo,",
        "start": 2796.1800000000003,
        "end": 2804.86
    },
    {
        "text": " agarrar toda despagueti, para hacer un prototipo en una tarde, que de repente pasamos",
        "start": 2804.86,
        "end": 2809.86
    },
    {
        "text": " una semana, ordenando todo eso, aplicando bien los patrones de diseño, y al final del día",
        "start": 2809.86,
        "end": 2814.78
    },
    {
        "text": " hay cliente valor mismo. Entonces, a nivel digamos de desarrollo y negocio, hay que observar eso,",
        "start": 2814.78,
        "end": 2822.38
    },
    {
        "text": " y hay que entender que muchas veces para aliar hipótesis nos conviene ir por un camino",
        "start": 2822.38,
        "end": 2828.46
    },
    {
        "text": " poquito más directo y un poquito más de generación de valor. Y después, bueno, finalmente dice,",
        "start": 2828.46,
        "end": 2834.3
    },
    {
        "text": " avanzar a hacer excelencia, esa mejora continua, y siempre de la perspectiva del usuario, o sea,",
        "start": 2834.3,
        "end": 2839.6600000000003
    },
    {
        "text": " es lo que le decía, si tengo 10 clientes que me pagan por algo que entranías en click, por más que",
        "start": 2839.6600000000003,
        "end": 2845.5
    },
    {
        "text": " les mejor el código, por más que lo... después me podrá ser más eficiente mantener esa herramienta y",
        "start": 2845.5,
        "end": 2850.3
    },
    {
        "text": " bajar a costos operativos a mí, eso sí puede pasar cuando uno mejora la calidad del código,",
        "start": 2850.3,
        "end": 2855.3
    },
    {
        "text": " por ejemplo, pero para el cliente, el cliente es el lo mismo, o sea, el cliente es una página que entra y",
        "start": 2855.3,
        "end": 2860.6200000000003
    },
    {
        "text": " hace click y les sean los zapatos a la casa, o sea, hace click y viene un delivery, toma una bolsa con",
        "start": 2861.1,
        "end": 2867.5
    },
    {
        "text": " la ropa sucia y les sea trae limpia, entonces no importa por atrás cómo está eso.",
        "start": 2867.5,
        "end": 2872.8599999999997
    },
    {
        "text": " Y bueno, sólo la metodología, metodología link, hay algunos principios acá que quería compartir.",
        "start": 2875.74,
        "end": 2881.66
    },
    {
        "text": " El Learn, Build and Measure, una parte sida y ideas, una trata de partir el problema lo más",
        "start": 2882.46,
        "end": 2890.7
    },
    {
        "text": " posible, a partir de esas ideas construye, construye un prototipo, construye un pequeño, la pequeña",
        "start": 2890.7,
        "end": 2898.94
    },
    {
        "text": " muestra, digamos, vamos a poner en caso de pido ya, o sea, pido ya tenía la idea de, bueno,",
        "start": 2898.94,
        "end": 2903.3399999999997
    },
    {
        "text": " pegamos comida por internet y bueno, lo primero que hicieron fue armar un fronte en que imagino",
        "start": 2903.34,
        "end": 2912.7000000000003
    },
    {
        "text": " que tocadas un botón y te llegaba en un load, lo que pidió lo dato y después ellos tenían",
        "start": 2912.7000000000003,
        "end": 2919.38
    },
    {
        "text": " atrás un call center, imagino que el primer día, uno de ellos mismo atendía el teléfono,",
        "start": 2919.38,
        "end": 2925.26
    },
    {
        "text": " agarraba la idea, lo que pedía a la persona, llamaba por teléfono al barque hacia la pizza y se",
        "start": 2925.26,
        "end": 2931.5
    },
    {
        "text": " la mandaba a la casa. Entonces, qué valido ese prototipo, lo que valido es que la gente quiere",
        "start": 2931.5,
        "end": 2937.66
    },
    {
        "text": " pedir comida a través de internet. Entonces, esa idea queda a validar lo que podía pasar,",
        "start": 2937.66,
        "end": 2944.14
    },
    {
        "text": " es que pusieran la página de internet y que la gente supiera esta la opción internet, esta",
        "start": 2944.14,
        "end": 2949.9
    },
    {
        "text": " la opción por teléfono y que la gente sigiera llamando por teléfono. Entonces ahí la etoba,",
        "start": 2949.9,
        "end": 2954.62
    },
    {
        "text": " la idea de pido ya estaría bastante en jaque porque estaríamos mostrando que la gente a priori",
        "start": 2954.62,
        "end": 2960.38
    },
    {
        "text": " no carría suara el internet para pedir comida. Después obviamente la pena, si usted",
        "start": 2960.38,
        "end": 2967.58
    },
    {
        "text": " tiene un resultado negativo positivo, hace un doble clic y entender por qué, y ahí estonde viene todo",
        "start": 2967.58,
        "end": 2972.86
    },
    {
        "text": " lo de toquinto y humas que es poco de la lectura enemotiva. Ahí está el call, que es un poco",
        "start": 2972.86,
        "end": 2979.98
    },
    {
        "text": " lo que genera ese pequeño MVP y después viene el mayor, el mayor es justamente saber cuánta",
        "start": 2979.98,
        "end": 2990.06
    },
    {
        "text": " gente se dije a 10 personas que pediran comida, les dices las dos opciones, según el capaz",
        "start": 2990.06,
        "end": 2996.94
    },
    {
        "text": " jugó 5 que hicieron por internet y 5 que llamaban en el web por teléfono. Y bueno, me fue bastante",
        "start": 2996.94,
        "end": 3002.7
    },
    {
        "text": " bien y esa 5 que usaban internet en la siguiente vez, la 5, volvió a una película por internet,",
        "start": 3002.7,
        "end": 3008.7
    },
    {
        "text": " es un buen dato. Ahora, para repente pasa que esas 10 hay 5 que piden la primera vez, solo 4 que",
        "start": 3009.98,
        "end": 3017.22
    },
    {
        "text": " piden la segunda y 3 que quedan pidiendo toda la semana a la internet. Y bueno, es un resultado,",
        "start": 3017.22,
        "end": 3023.1
    },
    {
        "text": " y en base eso no es un buen animal, o sea lo que hay que ver es si con esa gente",
        "start": 3023.1,
        "end": 3030.1
    },
    {
        "text": " da para construir un negocio y ahí van a entrar otras actividades, esas valoraciones que hay que",
        "start": 3030.1,
        "end": 3035.98
    },
    {
        "text": " casar, pero tenemos el dato, tengo el dato 1 de cada 10, una muestra electa de esta manera,",
        "start": 3035.98,
        "end": 3040.18
    },
    {
        "text": " o 3 de cada 10 se comportan de la determinada manera. Entonces, eso es lo que se llama aprendizaje",
        "start": 3040.18,
        "end": 3045.42
    },
    {
        "text": " validado. Y bueno, y ahí hablé entonces, emprendé a gestionar esta vuelta, ahí se minimizar el",
        "start": 3045.42,
        "end": 3054.78
    },
    {
        "text": " tiempo de darle el loop, o sea, si nosotros cuanto más rápido vamos a esto, más rápido vamos a poder",
        "start": 3054.78,
        "end": 3060.02
    },
    {
        "text": " tomar input para tomar decisiones, entonces, este más rápido vamos a poder acumular, ¿no?",
        "start": 3060.02,
        "end": 3065.1
    },
    {
        "text": " Cuando más rápido vamos a esto, más fallos, entre comillas vamos a obtener, sea más",
        "start": 3065.1,
        "end": 3070.14
    },
    {
        "text": " incómodo hacer, podemos presentar algo que no está completo, vamos a presentar algo que seguramente",
        "start": 3070.14,
        "end": 3076.02
    },
    {
        "text": " no les sirva el todo al usuario, pero al mismo tiempo si vamos a poder reconocer por qué sí,",
        "start": 3076.02,
        "end": 3082.7
    },
    {
        "text": " por qué no, entonces vamos a poder si tomando decisiones sobre eso. Si yo me decía rumés un año,",
        "start": 3082.7,
        "end": 3087.2599999999998
    },
    {
        "text": " un año a desarrollar algo, este después lo prego y de repente, arrastrón por la que eso",
        "start": 3087.26,
        "end": 3092.5
    },
    {
        "text": " no sirve, me le voy a dar cuenta la semana 1, se imaginen si si lo de pedido ya suena en el",
        "start": 3092.5,
        "end": 3096.1400000000003
    },
    {
        "text": " cerrado, hacer toda la plataforma como la conocemos ahora, la ponía en un día en producción,",
        "start": 3096.1400000000003,
        "end": 3101.42
    },
    {
        "text": " y yo les he visto que la gente no quería pedir por teléfono, no podía poder ponientarnos la comida,",
        "start": 3102.42,
        "end": 3107.42
    },
    {
        "text": " o sea, y o tal, uno lo voy ahora a conectar el lunes y lo es fácil, pero bueno,",
        "start": 3107.42,
        "end": 3115.1000000000004
    },
    {
        "text": " en mi paso en mi primer producto, o sea, mi primer producto no tuvo mucho dixito,",
        "start": 3115.1,
        "end": 3118.42
    },
    {
        "text": " este y bueno, en parte fue por eso, después, bueno, un poco de los conceptos de MVP y Pivot,",
        "start": 3118.42,
        "end": 3130.58
    },
    {
        "text": " MVP es mi mismo producto viable, ahora lo vamos a dar y este Ipivot es cuando uno hace un cambio",
        "start": 3130.58,
        "end": 3137.54
    },
    {
        "text": " sustancial hacia donde va más de product, ahora vamos a profundizar en eso, este,",
        "start": 3137.54,
        "end": 3144.38
    },
    {
        "text": " esto es otra forma de ilustrarlo simplemente para que vean cómo van el tiempo y bueno,",
        "start": 3144.38,
        "end": 3152.1
    },
    {
        "text": " como al final de esa procesorificación, tenemos que aprender este y bueno, ya habla de",
        "start": 3152.1,
        "end": 3157.14
    },
    {
        "text": " perseverar o pivotar la idea, significa que perseverar es uno tuvo un resultado, normalmente",
        "start": 3157.14,
        "end": 3162.74
    },
    {
        "text": " con algunas adorosidades, entonces uno busca probar otra cosa dentro de la misma idea,",
        "start": 3163.2599999999998,
        "end": 3168.18
    },
    {
        "text": " este oh bueno, no dice no, este día no funciona, me decara a otra cosa.",
        "start": 3168.18,
        "end": 3172.58
    },
    {
        "text": " Y bueno, acá, acá, le dejo herramientas para crear esos experimentos, entonces,",
        "start": 3175.3399999999997,
        "end": 3180.62
    },
    {
        "text": " el ejemplo, por ejemplo, landing page, este, ese ejemplo, pero ya, no,",
        "start": 3180.62,
        "end": 3186.06
    },
    {
        "text": " siempre uno cree una página que permite completar el frujo, o sea, permite ir a",
        "start": 3187.06,
        "end": 3192.54
    },
    {
        "text": " la usuario tan o lo que quiere, pero por atrás, o sea, no hay software, o sea, no tiene por qué",
        "start": 3192.54,
        "end": 3197.34
    },
    {
        "text": " haber una capa de negocios, o sea, la cansaría con una persona, leyendo de la base de datos igual y",
        "start": 3197.34,
        "end": 3202.94
    },
    {
        "text": " haciendo que para el usuario la magia pase, este y bueno, a lo de vos dice, consiste en",
        "start": 3202.94,
        "end": 3209.22
    },
    {
        "text": " un servicio de forma anual para entrar rápidamente al cliente, ese también con el compatible con el",
        "start": 3209.22,
        "end": 3214.82
    },
    {
        "text": " caso de pedido ya, quizás landing page, es un poquito más, lo puedo poner un ejemplo más",
        "start": 3214.82,
        "end": 3221.7400000000002
    },
    {
        "text": " claro sería, no sé, tengo un quiero vender zapatos de colores personalizables, entonces agarro",
        "start": 3221.7400000000002,
        "end": 3229.98
    },
    {
        "text": " una landing, como diez mule de zapatos, y pongo una paleta de 20 colores, entonces hago eso y veo",
        "start": 3229.98,
        "end": 3235.78
    },
    {
        "text": " si la gente se copa cambiando de color los zapatos, si me hacen ordenes, eso sería más una",
        "start": 3235.78,
        "end": 3242.06
    },
    {
        "text": " landing, después de otro, como se dice, maos dos, vendí hace un poquito más el caso de pedido ya,",
        "start": 3242.06,
        "end": 3251.2999999999997
    },
    {
        "text": " este el test de con serje es como como nada dos, pero la gente lo sabe, este básicamente sabe que",
        "start": 3252.9,
        "end": 3260.62
    },
    {
        "text": " por atrás se está llamando a alguien y sabe realmente de cómo funciona, sabe solamente que es un",
        "start": 3260.62,
        "end": 3267.22
    },
    {
        "text": " truco, después el 3D humo, este que está aquí básicamente es un elazo en un producto y",
        "start": 3267.22,
        "end": 3277.06
    },
    {
        "text": " ves si lo compran o no, no, no se producto no existe, o sea, nada, así es un poco variado,",
        "start": 3277.06,
        "end": 3282.7799999999997
    },
    {
        "text": " farta de manda, y bueno, si está demandado por el cliente, entonces hay una oportunidad de producto,",
        "start": 3282.7799999999997,
        "end": 3288.4599999999996
    },
    {
        "text": " y después el tzb un poco comunica el nombre, este uno puede una idea de producto que se ha",
        "start": 3289.46,
        "end": 3296.7
    },
    {
        "text": " ejecutado en manera de distintas, uno presenta las dos y en función de esa, este cual,",
        "start": 3296.7,
        "end": 3300.7400000000002
    },
    {
        "text": " cual la que funciona mejor, incluso no puede probar con cosas aleatorias hasta que bueno,",
        "start": 3302.5,
        "end": 3307.78
    },
    {
        "text": " finalmente le pega, y tal, así está Secret Funding, que saben que está muy de modo, que también",
        "start": 3307.78,
        "end": 3312.54
    },
    {
        "text": " tiene que ver con el tzb humo, pero bueno, capaz que un poquito más de certeza de que puedes hacer",
        "start": 3312.54,
        "end": 3317.46
    },
    {
        "text": " el producto con cierta tracción, real, digamos, cierta evaluación, este es uno,",
        "start": 3317.46,
        "end": 3321.38
    },
    {
        "text": " nada, buscar a ver si la gente efectivamente paga por obtener ese producto de manera anticipada.",
        "start": 3321.38,
        "end": 3327.54
    },
    {
        "text": " Después, está, otro ejemplo de experimento, no, bueno, todo lo que tiene con",
        "start": 3329.94,
        "end": 3335.3
    },
    {
        "text": " investigación, digamos, de escritorio, o sea, buscar artículos, ver reportes,",
        "start": 3335.3,
        "end": 3342.82
    },
    {
        "text": " marcados, o sea, hace un poco mi estilación de base, después de observación de clientes,",
        "start": 3342.82,
        "end": 3347.86
    },
    {
        "text": " tiene que ver con mirar lo que hace la gente en un lugar de trabajo, ver que dificultad de",
        "start": 3347.86,
        "end": 3353.3
    },
    {
        "text": " tiene, ver en qué cosas se tranca, qué cosas, les generan todo lo de cabeza, ver si hay cierta",
        "start": 3353.3,
        "end": 3359.26
    },
    {
        "text": " disponibilidad, digamos, de pagar por mejorar esas cosas, para parte de entrevistas, hablar con",
        "start": 3359.26,
        "end": 3366.2200000000003
    },
    {
        "text": " los potenciales clientes, usuarios, que es el método más común, digamos, de que usan los",
        "start": 3366.2200000000003,
        "end": 3372.3
    },
    {
        "text": " equipos de innovación, este, y que además muchas veces nos pueden llevar a insights muy buenos sobre",
        "start": 3372.3,
        "end": 3377.78
    },
    {
        "text": " sobre costas, digamos, sobre sobre lo que realmente les está sucediendo, este, y bueno, hay una, hay",
        "start": 3377.78,
        "end": 3384.3
    },
    {
        "text": " montona ahí que se le dejamos este un poquito ahí en el tintero para que tengan idea y acá",
        "start": 3384.3,
        "end": 3391.02
    },
    {
        "text": " hacer un pequeño freno, no sé si alguno quiere hacer un comentario, preguntas sobre los experimentos.",
        "start": 3391.02,
        "end": 3395.78
    },
    {
        "text": " Bueno, seguimos.",
        "start": 3402.3,
        "end": 3403.54
    },
    {
        "text": " Jorge, creo que yo te veo y me parece que es como si te estás comiendo pop mientras yo",
        "start": 3409.26,
        "end": 3415.82
    },
    {
        "text": " doy la clase.",
        "start": 3415.82,
        "end": 3416.42
    },
    {
        "text": " El parecido.",
        "start": 3416.42,
        "end": 3418.1800000000003
    },
    {
        "text": " Bueno, una vez tengo que disfrutar del arte lava, ¿no?",
        "start": 3418.1800000000003,
        "end": 3421.86
    },
    {
        "text": " Bueno, a ver, aquí, la te disfrutan este, bueno, vamos a hablar ahora de",
        "start": 3421.86,
        "end": 3432.1800000000003
    },
    {
        "text": " algunas, está algunos conceptos del INES TARTA.",
        "start": 3432.18,
        "end": 3434.58
    },
    {
        "text": " Vamos a hablar de MP, el mínimo producto viable, ¿no?",
        "start": 3434.58,
        "end": 3439.02
    },
    {
        "text": " Este, una pregunta así general, o sea, levanten la mano quienes están familiarizados con el",
        "start": 3439.02,
        "end": 3444.98
    },
    {
        "text": " concepto MP y por la hora de no bajar.",
        "start": 3444.98,
        "end": 3449.22
    },
    {
        "text": " Y dejen la levantada un segundo y todo así.",
        "start": 3449.22,
        "end": 3454.3399999999997
    },
    {
        "text": " Bien, orce 15 16.",
        "start": 3454.34,
        "end": 3465.6200000000003
    },
    {
        "text": " No, no me da que le llaman el curso, Jorge, porque me mandaste el experimento.",
        "start": 3465.6200000000003,
        "end": 3472.38
    },
    {
        "text": " Es, es, es, déjelo que era la, la sigla, pero no lo dimonos.",
        "start": 3472.38,
        "end": 3477.06
    },
    {
        "text": " Bueno, bien, este, bueno, simplemente para andar, este, que tan presente está en, en, en,",
        "start": 3478.06,
        "end": 3485.7
    },
    {
        "text": " imaginario colectivo de, de la gente, este, el MP, es algo que, que cuando pensamos en",
        "start": 3485.7,
        "end": 3492.46
    },
    {
        "text": " NoArt, tiene que estar en el, muchas gracias a todos, hay que cantar la mano.",
        "start": 3492.46,
        "end": 3496.66
    },
    {
        "text": " Este, el MP tiene que estar en el centro de, digamos, de todo proceso de, sin mención",
        "start": 3496.66,
        "end": 3504.58
    },
    {
        "text": " de producto o de creación de producto, ¿no?",
        "start": 3504.58,
        "end": 3507.62
    },
    {
        "text": " Eh, y hay que entenderlo bien.",
        "start": 3507.62,
        "end": 3510.7
    },
    {
        "text": " Porque, ¿qué, qué, qué, vamos a hablar de la característica de tiene?",
        "start": 3510.7,
        "end": 3514.5
    },
    {
        "text": " O sea, son las características básicas para satisfacer la necesidad de los clientes.",
        "start": 3514.5,
        "end": 3518.54
    },
    {
        "text": " Eh, vamos al ejemplo pedido, ya, y me encanta, porque estoy seguro que todos pido en comida",
        "start": 3518.54,
        "end": 3524.42
    },
    {
        "text": " en un día.",
        "start": 3524.42,
        "end": 3525.42
    },
    {
        "text": " Eh, ¿qué preciso yo para pedir comida?",
        "start": 3525.42,
        "end": 3528.58
    },
    {
        "text": " Eh, preciso.",
        "start": 3528.58,
        "end": 3530.1
    },
    {
        "text": " Quizás hoy, hoy ya está bastante consolidado, pero piensen tres años para atrás, cuatro",
        "start": 3530.62,
        "end": 3534.94
    },
    {
        "text": " años para atrás, ¿no?",
        "start": 3534.94,
        "end": 3536.62
    },
    {
        "text": " Preciso tener hambre, lo ganas de comer, pero, no sé, preciso tener un poco el deseo",
        "start": 3536.62,
        "end": 3542.58
    },
    {
        "text": " de comprar comida.",
        "start": 3542.58,
        "end": 3544.2999999999997
    },
    {
        "text": " Eh, preciso conocer el precio, pero eso sabe ver algo de la comida que puede ser, este,",
        "start": 3544.2999999999997,
        "end": 3553.38
    },
    {
        "text": " o sea, que, que, bueno, que, que no sé si la pisa de diez buenas, no es buena.",
        "start": 3553.38,
        "end": 3559.02
    },
    {
        "text": " Es que eso es algo que, ¿qué tipo de pisas tenés?",
        "start": 3559.02,
        "end": 3562.3
    },
    {
        "text": " Y creo que con eso, en aquel momento, el cansaio sobrado para pedir, no, pues yo creo",
        "start": 3562.3,
        "end": 3566.46
    },
    {
        "text": " que por teléfono, bueno, quizás un campo de comentario para decirle, no sé, ponerle",
        "start": 3566.46,
        "end": 3570.42
    },
    {
        "text": " más alza, o sea, este, pero, pero no mucho más que eso.",
        "start": 3570.42,
        "end": 3575.74
    },
    {
        "text": " Este, y bueno, eh, yo creo que con eso, perfectamente, podrías empatarlo que la comunicación",
        "start": 3575.74,
        "end": 3583.3
    },
    {
        "text": " telefónica te da, en cuanto a presividad, ¿no?",
        "start": 3583.3,
        "end": 3586.46
    },
    {
        "text": " Bueno, puede preguntar también tener todo el menú, este, la vista que uno podría preguntar",
        "start": 3586.46,
        "end": 3592.1800000000003
    },
    {
        "text": " también, este, cuando uno pide, que, que, que, que, que, contame que, que, que, que",
        "start": 3592.1800000000003,
        "end": 3596.6200000000003
    },
    {
        "text": " acés, este, pero, tenés milanesa de, no sé qué, o sea, pero, entonces, eso, eso es",
        "start": 3596.6200000000003,
        "end": 3603.78
    },
    {
        "text": " lo mínimo, ¿no?",
        "start": 3603.78,
        "end": 3604.86
    },
    {
        "text": " Y como mínimo, podemos hablar de, tú, unas listas, este, y un carrito de compras, y",
        "start": 3604.86,
        "end": 3611.2200000000003
    },
    {
        "text": " ya está, ¿no? Entonces, eh, y, y por atrás, nada, ¿no? Por atrás, es un, es un,",
        "start": 3611.22,
        "end": 3618.8999999999996
    },
    {
        "text": " podemos estar en personas leyendo el registro de la base en, en un, o sea, que va leyendo",
        "start": 3618.8999999999996,
        "end": 3625.1
    },
    {
        "text": " un log llamando por teléfono, al, al, al horroctoranes para, para poder pedir, y después, lo",
        "start": 3625.1,
        "end": 3631.66
    },
    {
        "text": " que empezamos es que la persona le llegue en las cosas, o sea, eso es la otra parte y no",
        "start": 3631.66,
        "end": 3636.2599999999998
    },
    {
        "text": " tiene que con eso, ¿fuerzo? Entonces, este, el MVP, he pedido ya, eso, o sea, es algo",
        "start": 3636.26,
        "end": 3643.5
    },
    {
        "text": " muy básico, es algo que usted, pues, ¿qué a ustedes? En dos semanas desarrollando lo",
        "start": 3643.5,
        "end": 3649.5800000000004
    },
    {
        "text": " hace, entonces, eh, nada, eh, eh, eh, eh, es, es un poco, eh, interesante que vean,",
        "start": 3649.5800000000004,
        "end": 3661.5400000000004
    },
    {
        "text": " que es una fracción, digamos, este, muchas veces, que cosas no son un MVP, este, un",
        "start": 3661.54,
        "end": 3667.2599999999998
    },
    {
        "text": " cosa que no, no son MVP, y ahora te de la palabra, ya ni este, este, es, eh, nada, no",
        "start": 3667.2599999999998,
        "end": 3672.98
    },
    {
        "text": " sé, por ahí, eh, tener, no sé, descuentos, este, o para que hacía el cupone de descuentos",
        "start": 3672.98,
        "end": 3679.98
    },
    {
        "text": " dentro de la aplicación, y que a más que no es, es algo puede ser que genere valor,",
        "start": 3679.98,
        "end": 3684.18
    },
    {
        "text": " pero no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no,",
        "start": 3684.18,
        "end": 3686.38
    },
    {
        "text": " entonces ahí, este, nada, quería ir usted a ver un poquito, que, que es esto como funciona",
        "start": 3686.9,
        "end": 3691.54
    },
    {
        "text": " en la práctica, y ahora vamos a ver un poquito cómo son las situaciones, entonces, ya ni",
        "start": 3691.54,
        "end": 3695.3
    },
    {
        "text": " que querías comentar ahí, que diga que le mandaste la mano.",
        "start": 3695.3,
        "end": 3697.3
    },
    {
        "text": " Eee, un ejemplo de MVP, tipo para WoW sería una lista de mails y tener contacto de lugares,",
        "start": 3697.3,
        "end": 3705.1400000000003
    },
    {
        "text": " y que la gente, o sea, mandas, sumé, hasta el mundo, y la gente te dice que iró tal o",
        "start": 3705.1400000000003,
        "end": 3712.6600000000003
    },
    {
        "text": " tal y iró a la rara, llamar o tener, y entonces lo vas, eso podría ser un MVP y vamos para,",
        "start": 3712.66,
        "end": 3719.66
    },
    {
        "text": " para una especie WoW, o lo que era WoW en un momento.",
        "start": 3719.66,
        "end": 3723.54
    },
    {
        "text": " Bien, si, es una buena pregunta, eh, porque me le gaza definido otra cosa, digamos, de lo",
        "start": 3723.54,
        "end": 3729.3799999999997
    },
    {
        "text": " que tiene que ir con mi pino, y acá si quieren, ahora contesto eso, y ahora un poquito",
        "start": 3729.3799999999997,
        "end": 3734.8799999999997
    },
    {
        "text": " de alguna cosa más a la, a la, a la definición, ¿no?",
        "start": 3734.88,
        "end": 3739.88
    },
    {
        "text": " Este, este, este, a la reacción de público que tío con un respecto al producto, evaluar",
        "start": 3739.88,
        "end": 3744.26
    },
    {
        "text": " hipótesis fundamentales de negocio y ayudar a desemprenderles a comenzar la prensa",
        "start": 3744.26,
        "end": 3748.76
    },
    {
        "text": " jepe lo más rápido posible.",
        "start": 3748.76,
        "end": 3750.76
    },
    {
        "text": " Hipótesis fundamentales de negocio, haría que ver cuál es tu hipótesis de negocio,",
        "start": 3750.76,
        "end": 3754.8
    },
    {
        "text": " en ese, en el WoW.",
        "start": 3754.8,
        "end": 3756.4
    },
    {
        "text": " Yo creo que la hipótesis de negocio de WoW es que ofreciendo que hay una demanda de gente",
        "start": 3756.4,
        "end": 3763.6800000000003
    },
    {
        "text": " que está dispuesta a, digamos, a observar, lo dedical de tiempo a buscar dentro de",
        "start": 3763.68,
        "end": 3772.3199999999997
    },
    {
        "text": " una selección de ofertas, ¿no?",
        "start": 3772.3199999999997,
        "end": 3774.12
    },
    {
        "text": " De productos que están por debajo, de, del precio, digamos, regulada de mercado.",
        "start": 3774.12,
        "end": 3779.04
    },
    {
        "text": " Eso sería la propuesta de bator, me parece central de WoW.",
        "start": 3779.04,
        "end": 3782.2
    },
    {
        "text": " Y, y queremos ver si la gente le dica tiempo, por lo menos a buscar, este, y después",
        "start": 3782.2,
        "end": 3786.16
    },
    {
        "text": " definitivamente a comprar.",
        "start": 3786.16,
        "end": 3787.68
    },
    {
        "text": " Entonces, si es por el lado de si le dica tiempo, yo creo que la dificultad que tendrías",
        "start": 3787.68,
        "end": 3793.08
    },
    {
        "text": " ahí con el correo, es ver, o sea, lo que podrías medir, por ejemplo, es cuánta gente",
        "start": 3793.08,
        "end": 3797.04
    },
    {
        "text": " lo abre y cuánta gente se explique las ofertas.",
        "start": 3797.04,
        "end": 3799.9199999999996
    },
    {
        "text": " O sea, es un MP, podría ser un MP1, seguramente necesites más, pero sí, me parece un buen",
        "start": 3799.9199999999996,
        "end": 3806.8399999999997
    },
    {
        "text": " ejemplo MP y, bueno, está, es la versión 0, pero, bueno, desde ese punto a vista, sí,",
        "start": 3806.8399999999997,
        "end": 3815.2799999999997
    },
    {
        "text": " es un MP.",
        "start": 3815.2799999999997,
        "end": 3816.6
    },
    {
        "text": " No sé, este, bueno, ¿qué más querida participar ahí que vi que le mandaba en la mano?",
        "start": 3816.6,
        "end": 3821.48
    },
    {
        "text": " Sí, está, maximillando, ¿no?",
        "start": 3821.48,
        "end": 3826.72
    },
    {
        "text": " Sí, se me escucha bien ahí.",
        "start": 3826.72,
        "end": 3830.72
    },
    {
        "text": " Sí, perfecto.",
        "start": 3830.72,
        "end": 3831.72
    },
    {
        "text": " No, no, no.",
        "start": 3831.72,
        "end": 3832.72
    },
    {
        "text": " Era bueno que le das en un comentario que, a veces, el MP es tipo, es muy lindo decir,",
        "start": 3832.72,
        "end": 3839.12
    },
    {
        "text": " yo quiero hacer, pudo la cosa de mi proyecto, quiero hacerlo mínimo y, pues, es, es,",
        "start": 3839.12,
        "end": 3843.6
    },
    {
        "text": " necesario, pero después, en la punto de vista de clientes, tipo, no sé, mi proyecto",
        "start": 3843.6,
        "end": 3847.88
    },
    {
        "text": " por febrero de paz, estamos construyendo el MPP y quieren que sea famoso, quieren que sea,",
        "start": 3847.88,
        "end": 3854.4
    },
    {
        "text": " que tengan toda la funcionalidad, porque, porque, cuando estábamos muchas plata, están",
        "start": 3854.4,
        "end": 3857.56
    },
    {
        "text": " invertiendo mucho tiempo, entonces, es como muy difícil hacer un MP, porque siempre le",
        "start": 3857.56,
        "end": 3862.44
    },
    {
        "text": " quieren agregar más cosas.",
        "start": 3862.44,
        "end": 3864.44
    },
    {
        "text": " Está muy bueno, está muy buena su aporte.",
        "start": 3864.44,
        "end": 3866.36
    },
    {
        "text": " Me, me puedes decir, ¿qué tiene ese cliente?",
        "start": 3866.36,
        "end": 3870.36
    },
    {
        "text": " No, no la empresa, ¿no? ¿Qué que hace?",
        "start": 3870.36,
        "end": 3872.7200000000003
    },
    {
        "text": " Y para que haya su...",
        "start": 3872.7200000000003,
        "end": 3874.04
    },
    {
        "text": " No, no, es un...",
        "start": 3874.04,
        "end": 3875.04
    },
    {
        "text": " Es una...",
        "start": 3875.04,
        "end": 3876.04
    },
    {
        "text": " ¿Alga de Salud para Estados Unidos?",
        "start": 3876.04,
        "end": 3879.04
    },
    {
        "text": " Bien.",
        "start": 3879.04,
        "end": 3880.04
    },
    {
        "text": " Bueno, esa tensión, es una tensión permanente, es una decisión que uno tiene que tomar todo",
        "start": 3880.04,
        "end": 3887.76
    },
    {
        "text": " el tiempo, de dar si le da más bola o no al usuario, pero ahí es interesante porque el",
        "start": 3887.76,
        "end": 3893.28
    },
    {
        "text": " productor no es si pesta a la lado de ellos, ¿no?",
        "start": 3893.28,
        "end": 3895.1200000000003
    },
    {
        "text": " ¿Os hace un ellos?",
        "start": 3895.1200000000003,
        "end": 3896.1200000000003
    },
    {
        "text": " ¿O otro productor normal?",
        "start": 3896.1200000000003,
        "end": 3897.1200000000003
    },
    {
        "text": " Sí, sí.",
        "start": 3897.1200000000003,
        "end": 3898.1200000000003
    },
    {
        "text": " Es una forma de este proyecto, este proceso, en una forma lo define en ellos.",
        "start": 3898.12,
        "end": 3903.56
    },
    {
        "text": " O sea, nosotros como sobrefálturi acá, deberíamos hacer lo que nos piden entre comillas.",
        "start": 3903.56,
        "end": 3909.4
    },
    {
        "text": " Y bueno, está bueno, también, desde la impronta que le ponemos, que muchas veces,",
        "start": 3909.4,
        "end": 3914.48
    },
    {
        "text": " donde no están americanos, no se imagina que un ingeniero en un lugar de un técnico",
        "start": 3914.48,
        "end": 3918.16
    },
    {
        "text": " que le está haciendo el software está formado en línea startup, este o que por lo menos",
        "start": 3918.16,
        "end": 3922.0
    },
    {
        "text": " conocer las bases.",
        "start": 3922.0,
        "end": 3923.0
    },
    {
        "text": " Entonces, hay una tensión, es una tensión que está bien que le identifique, y, de un",
        "start": 3923.0,
        "end": 3927.64
    },
    {
        "text": " punto de vista, acá me voy más a lo al día a día, hay que saber gestionar.",
        "start": 3927.64,
        "end": 3936.2799999999997
    },
    {
        "text": " Yo creo que hay segmentos que están más familiarizados, tienen más propiedad,",
        "start": 3936.2799999999997,
        "end": 3945.16
    },
    {
        "text": " pueden tomar estos riesgos, y hay otros que no.",
        "start": 3945.16,
        "end": 3949.52
    },
    {
        "text": " La salud, creo que es uno de los que son más aduarsos a estos riesgos, porque todo",
        "start": 3949.52,
        "end": 3954.52
    },
    {
        "text": " lo que tiene con salud tiene un vuelo que a la vi humana.",
        "start": 3954.52,
        "end": 3957.3599999999997
    },
    {
        "text": " Entonces, quizás, y además los médicos en particular, y no tengo nada contra ellos,",
        "start": 3957.36,
        "end": 3963.48
    },
    {
        "text": " pero sí son personas que, como que se cure mucho, o sea que tratan de, está bien,",
        "start": 3963.48,
        "end": 3968.04
    },
    {
        "text": " porque en una forma están las decisiones que toma muchas veces en el sistema de salud",
        "start": 3968.04,
        "end": 3971.92
    },
    {
        "text": " humana, entonces quizás un poco tienen algo con el perfil de equivalente.",
        "start": 3971.92,
        "end": 3976.44
    },
    {
        "text": " Yo trabajo en abronáutica también, este DroneFist se centra en el sistema de abronáutica,",
        "start": 3976.44,
        "end": 3980.6400000000003
    },
    {
        "text": " entonces también, en un software, un sistema de abronáutico, por ejemplo, este desencadena",
        "start": 3980.64,
        "end": 3987.96
    },
    {
        "text": " catástrofe, como la que conocemos el 737 Max en el teopía, y otro que se ve esto,",
        "start": 3987.96,
        "end": 3992.8799999999997
    },
    {
        "text": " creo que no es un poco de no, pero, entonces hay que entender lo que es un comportamiento,",
        "start": 3992.8799999999997,
        "end": 4001.12
    },
    {
        "text": " digamos, digamos, difunccionado, luego que no funciona bien, también en general del otro",
        "start": 4001.12,
        "end": 4006.8399999999997
    },
    {
        "text": " lado, y ahí fíjate cómo lo puedes ver de otra manera, del punto de vista de la propuesta",
        "start": 4006.84,
        "end": 4013.56
    },
    {
        "text": " de valor, quizás el cliente, este cliente en particular, o los clientes de este cliente,",
        "start": 4013.56,
        "end": 4019.08
    },
    {
        "text": " ven valor en la calidad de un sistema, entonces tu MVP tiene que tener calidad, o sea que",
        "start": 4019.08,
        "end": 4024.0
    },
    {
        "text": " no pasa siempre, pero bueno, dándole una hueltita a esto de Link y pensarlo desde el lado",
        "start": 4024.0,
        "end": 4030.76
    },
    {
        "text": " de cliente, quizás, bueno, lo que tenemos que hacer es las construcciones, lo más pequeñas",
        "start": 4030.76,
        "end": 4035.92
    },
    {
        "text": " posibles con el nivel de calidad más alto, o algo por el estilo, entonces, no sé,",
        "start": 4035.92,
        "end": 4042.6
    },
    {
        "text": " ¿qué fue que me preguntó para algo muy bien nombre? Maxibliano, ¿no?",
        "start": 4042.6,
        "end": 4045.92
    },
    {
        "text": " Yo, sí, Maxibliano, sí. ¿Cómo te reesunas esto que estoy comentando?",
        "start": 4045.92,
        "end": 4050.64
    },
    {
        "text": " Que es básicamente lo que estamos haciendo, siempre le intentamos de bajar el scope,",
        "start": 4050.64,
        "end": 4055.92
    },
    {
        "text": " hacer cosas, me da cosas, pero que saben también, y él siempre dice, yo quiero llevar el",
        "start": 4055.92,
        "end": 4061.32
    },
    {
        "text": " hospital, a vendar esto, tipo, tiene que estar perfecto, pues, si no me patear y nunca",
        "start": 4061.32,
        "end": 4066.76
    },
    {
        "text": " más. Claro, ese es exactamente eso. Hay que ver si si está, si el tipo está familiarizado",
        "start": 4066.76,
        "end": 4072.4
    },
    {
        "text": " con todo esto, o sea, evidentemente no, no veo cuáles lo que el tipo está haciendo,",
        "start": 4072.4,
        "end": 4077.2000000000003
    },
    {
        "text": " porque el tipo de estado suño que no conozco, es un cliente que menos conozco, quizás",
        "start": 4077.2000000000003,
        "end": 4081.44
    },
    {
        "text": " tiene razón y te no den una día, entonces, acá no es trata de tener razón o no, se trata",
        "start": 4081.44,
        "end": 4086.0
    },
    {
        "text": " de, ¿qué hacemos? Casi hemos congestionado las recursos que tenemos y conseguimos o no",
        "start": 4086.0,
        "end": 4090.7200000000003
    },
    {
        "text": " resultados que queremos. Entonces, está bueno que se está atención y llama de un puntito",
        "start": 4090.72,
        "end": 4095.56
    },
    {
        "text": " humano. Parece bueno que haya un hí de vuelta ahí, que le muestre en esto y que vaya",
        "start": 4095.56,
        "end": 4100.8
    },
    {
        "text": " a miendo que el resultado se cosecha. No, sí que se empezamos, sacuán la frase de",
        "start": 4100.8,
        "end": 4107.04
    },
    {
        "text": " principio, no hay reglas. Bueno, empezamos a darlos en la realidad. Ahí otra mano le",
        "start": 4107.04,
        "end": 4112.88
    },
    {
        "text": " plantaba a goesar. Sí, a realidad me he quedado pensando en lo que ha planteado",
        "start": 4112.88,
        "end": 4121.56
    },
    {
        "text": " Yañe, decía un MVP hacer la lista de esa de Males y después una persona llamada,",
        "start": 4121.56,
        "end": 4127.92
    },
    {
        "text": " sé que yo lo veo más como un intento de validar el mercado, o sea que si efectivamente",
        "start": 4127.92,
        "end": 4134.08
    },
    {
        "text": " recibís Males de cinta personas todo el tiempo, pues, que es un par de meses, efectivamente",
        "start": 4134.08,
        "end": 4140.8
    },
    {
        "text": " o capa que ni meses, semanas, efectivamente, podéis decir, bueno, acá hay algo que se",
        "start": 4140.8,
        "end": 4144.84
    },
    {
        "text": " puede explotarse, si se quiere, pero un MVP lo consideraría más, como no sé, una web o",
        "start": 4144.84,
        "end": 4151.0
    },
    {
        "text": " una aplicación lo más básica posible, o sea que esté todo atago en el hambre igual,",
        "start": 4151.0,
        "end": 4155.72
    },
    {
        "text": " pero que mínimamente cumpla ese hecho de, bueno, esta persona eligió el hotel y le",
        "start": 4155.72,
        "end": 4162.12
    },
    {
        "text": " queré la, la, la, la, la reserva a lo que sea sin caso, literalmente una persona",
        "start": 4162.12,
        "end": 4168.52
    },
    {
        "text": " entre medio, sino la llama.",
        "start": 4168.52,
        "end": 4170.360000000001
    },
    {
        "text": " Bien, sí, bien, sí, no, acá está interesante la discusión, o sea, en MIP puede ser cualquier",
        "start": 4170.360000000001,
        "end": 4178.88
    },
    {
        "text": " cosa que quiero para validar un hipótesis, lo importante es que no hay claro cuál es nuestro",
        "start": 4178.88,
        "end": 4183.96
    },
    {
        "text": " hipótesis, cuál es la forma óptima de validarlo, o sea, si nuestro hipótesis, si es la gente",
        "start": 4183.96,
        "end": 4189.0
    },
    {
        "text": " destina tiempo en realizar o farta de cosas que están por abajo el precio de mercado, quizás",
        "start": 4189.0,
        "end": 4193.4800000000005
    },
    {
        "text": " el mismo el funcione. Ahora, si queremos validarle hipótesis de la gente utilizaría,",
        "start": 4193.48,
        "end": 4199.24
    },
    {
        "text": " un portal de ícómeros para comprar cosas que están por debajo de verdad de mercado,",
        "start": 4199.24,
        "end": 4203.599999999999
    },
    {
        "text": " hay claramente la lista de mail, no te sirve.",
        "start": 4203.599999999999,
        "end": 4206.04
    },
    {
        "text": " O sea, porque no, no te permite comprar cosas, o sea, entonces, este, nada, creo que el MVP",
        "start": 4206.04,
        "end": 4214.04
    },
    {
        "text": " que ha definido por el hipótesis de alguna manera, creo que vale, el MVP es un experimento,",
        "start": 4214.04,
        "end": 4218.04
    },
    {
        "text": " si querés, este, o mejor dicho, el MVP es el medio de través de cuál redizás el experimento,",
        "start": 4218.04,
        "end": 4222.4
    },
    {
        "text": " entonces, este, está bueno, está bueno porque los dos cosas que hicieron son en mi piz, son en",
        "start": 4222.4,
        "end": 4228.879999999999
    },
    {
        "text": " mi piz diferentes de cosas diferentes y quizás está yo diferente, es el entendimiento, o sea, porque quizás",
        "start": 4228.879999999999,
        "end": 4234.639999999999
    },
    {
        "text": " nada, esto, lo primero que hiciste fue armada de salista de correos, después de que viste que la gente",
        "start": 4236.16,
        "end": 4242.32
    },
    {
        "text": " tabría los correos, una tasa de apertura de 75% cuando la media del correo frío del 11%",
        "start": 4242.32,
        "end": 4249.28
    },
    {
        "text": " entonces, y bueno, para la gente le interesa ver esto, que más que más puedo hacer, o sea,",
        "start": 4249.28,
        "end": 4253.36
    },
    {
        "text": " este, bueno, andarles, este, vamos a ver, vamos a ver si la gente compra y ahí armarlo los",
        "start": 4253.36,
        "end": 4259.24
    },
    {
        "text": " decisiones, entonces, sin dudas, cuando vas a la práctica, a los hechos, sin cartandola teórico,",
        "start": 4259.24,
        "end": 4267.12
    },
    {
        "text": " este, hay proces, hay sí, y uno, ese quiere saltar, este, determinados, este, está ahí,",
        "start": 4267.12,
        "end": 4275.719999999999
    },
    {
        "text": " y yo sí uno que directamente a armar una página de lo que fuera, ¿no? Eso lo hacemos porque",
        "start": 4275.72,
        "end": 4282.88
    },
    {
        "text": " básicamente, la única explicación por la cual tiene sentido hacer eso es porque somos ingenieros,",
        "start": 4282.88,
        "end": 4286.88
    },
    {
        "text": " o sea, y es lógico, o sea, armar una página para que nosotros o para un equipo ingeniero,",
        "start": 4286.88,
        "end": 4291.8
    },
    {
        "text": " es muy fácil, pero ponerle, pensar si fueras una persona que obviamente nunca había una línea de código",
        "start": 4291.8,
        "end": 4297.96
    },
    {
        "text": " y, y, y quieres, o sea, hacer esto, ¿no? Entonces, lo último que vas a crear es armar un sofo, o sea,",
        "start": 4297.96,
        "end": 4304.84
    },
    {
        "text": " porque básicamente, vas a que valida con tu sarramía, ¿no? Es, vas a querer aprender todo lo que",
        "start": 4304.84,
        "end": 4310.84
    },
    {
        "text": " puede ver, para después el recurso de plazo sin vertiglo, lo mejor posible, entonces,",
        "start": 4310.84,
        "end": 4316.12
    },
    {
        "text": " si estamos conscientes de ese ego que tenemos, esta es una frase de Humphrey que me encanta,",
        "start": 4317.64,
        "end": 4322.72
    },
    {
        "text": " que creo que está más adelante, que es si tenemos un martillo, todos nos parecer un clavo y tenemos",
        "start": 4322.72,
        "end": 4328.28
    },
    {
        "text": " un martillo, o sea, el martillo que tenemos es la ingeniería y siempre vamos a hacer ese martillo y",
        "start": 4328.28,
        "end": 4333.4800000000005
    },
    {
        "text": " siempre lo vamos a hacer muy buenos en usarlo, creo que la clave está en, en, en saber que hay otras",
        "start": 4333.48,
        "end": 4339.919999999999
    },
    {
        "text": " herramientas, creo que más adelante, sobre la segunda clase abordamos el común corporal de esas",
        "start": 4339.919999999999,
        "end": 4345.4
    },
    {
        "text": " herramientas, han emprendimiento, ¿no? Entonces, este, está, me encanta todo, me encanta esta discusión y, y no, no sé, si alguno",
        "start": 4345.4,
        "end": 4352.4
    },
    {
        "text": " quiera por dar alguna cosa más a esto.",
        "start": 4352.4,
        "end": 4353.799999999999
    },
    {
        "text": " No, parece que lo desejo y lo de martillo tiene sentido, pues, se lo estaba mirando mucho por ese lado,",
        "start": 4353.8,
        "end": 4363.24
    },
    {
        "text": " lo entiendo, lo entiendo, tiene mucho sentido. Había, hay un ejemplo que, te da no recordar,",
        "start": 4363.24,
        "end": 4369.88
    },
    {
        "text": " no, no, acuerdo que supuso el ejemplo de una página de zapato, no, no me acuerdo, ahí en",
        "start": 4369.88,
        "end": 4376.320000000001
    },
    {
        "text": " un mayor orgullo, un emprendedor, que quería hacer algo también de, no sé, relacionada a zapatos, era, y no me",
        "start": 4376.32,
        "end": 4383.5199999999995
    },
    {
        "text": " acuid justamente, o sea, una persona era diseñadora, o sea, la landing creo que era, o sea, no sé, una",
        "start": 4383.5199999999995,
        "end": 4389.719999999999
    },
    {
        "text": " spuligación de Facebook marketing, o sea, el producto era innovador, o sea, el producto, no sé si,",
        "start": 4389.719999999999,
        "end": 4393.84
    },
    {
        "text": " no sé si, o sea, zapato, que era pues pinta raíbal, pero que quiera, no sé, no me acuerdo por la innovación, pero, pero bueno,",
        "start": 4393.84,
        "end": 4399.0
    },
    {
        "text": " o sea, como uno se te podía tocar con el encodido, su siguiente iteración fue subir las cosas a Facebook",
        "start": 4399.0,
        "end": 4403.759999999999
    },
    {
        "text": " marketing, le decía, bueno, ahí yo cuando a gente veía las cosas, cuando a gente le preguntaba cuántas",
        "start": 4403.76,
        "end": 4408.360000000001
    },
    {
        "text": " vendía, y no, no, no, no, no, no, no, no, no, no, entonces, no significa, son caminos, no, en fin de la",
        "start": 4408.360000000001,
        "end": 4414.64
    },
    {
        "text": " día, se supone que todos compargen en lo mismo, pero, nada, justamente, identificar el cejo, yo creo",
        "start": 4414.64,
        "end": 4424.52
    },
    {
        "text": " que no tiene que quedar de esta charla, le decía, bueno, la primera vez que se no va a ocurrir, esa",
        "start": 4424.52,
        "end": 4428.68
    },
    {
        "text": " charla, se va a hacer una para, o vamos a hacer esta funcionalidad para ver si lo primero que",
        "start": 4428.68,
        "end": 4433.280000000001
    },
    {
        "text": " es pensar es decir, lo puedo hacer de la manera, y ahí van a ver que hay un universo enorme de cosas",
        "start": 4433.280000000001,
        "end": 4438.280000000001
    },
    {
        "text": " para hacer, y bueno, y no, seguramente, con el tiempo y la experiencia se vaya descantando por esas",
        "start": 4438.280000000001,
        "end": 4444.88
    },
    {
        "text": " otras, por que esas otras, salen, salecana, hay una mano levantada y nos queda media ahora, sí, dale, venimos bien igual de",
        "start": 4444.88,
        "end": 4453.08
    },
    {
        "text": " mi tío, si querés, sí, yo quería contar una experiencia que tuve con una trabajando por un",
        "start": 4453.08,
        "end": 4459.24
    },
    {
        "text": " para un emprendimiento de Estados Unidos, que ellos tenían una idea de una red social, como de",
        "start": 4459.24,
        "end": 4468.96
    },
    {
        "text": " viajes, y lo que hicieron como para poder salir, o sea, valiar más rápido si idea era, ahí",
        "start": 4468.96,
        "end": 4478.2
    },
    {
        "text": " ella era un app, entonces lo que intentaron hacer fue primero tener una web que funcionara como",
        "start": 4478.2,
        "end": 4485.04
    },
    {
        "text": " un app que tuviera la funcionalidad core que buscaban y de esa forma ellos lo casi",
        "start": 4485.04,
        "end": 4493.04
    },
    {
        "text": " han era poniendo esa app con un código QR en determinados productos que normalmente usa",
        "start": 4493.04,
        "end": 4501.48
    },
    {
        "text": " viajeros, y a través de ese link era que destruían esa primera impresión hacia la app, y",
        "start": 4501.48,
        "end": 4510.48
    },
    {
        "text": " y eso estaba bueno era que ya de forma muy rápida, podían variar si si la haya estado",
        "start": 4510.48,
        "end": 4519.24
    },
    {
        "text": " buena sin tener que hacer un app que realmente esté funcionando.",
        "start": 4519.24,
        "end": 4524.96
    },
    {
        "text": " Buenísimo díos excelente ejemplo, bueno, va por ahí, va por ahí, y creo que lo claga",
        "start": 4527.24,
        "end": 4534.36
    },
    {
        "text": " acá que entiendan es de este punto y para cerrarlo es mínimo, mínima codificación",
        "start": 4534.36,
        "end": 4541.24
    },
    {
        "text": " y la realidad, le renombrarían en una escuela ingeniería de esto, y bueno, y que entiendan que por nuestros",
        "start": 4541.24,
        "end": 4549.36
    },
    {
        "text": " hijos siempre se no van a ocurrir cosas que involucren codificar y hacer y quizás allá",
        "start": 4549.36,
        "end": 4556.2
    },
    {
        "text": " hay otras cosas, y bueno que un carse pronto y un barato, y como lo dice acá, así que esto",
        "start": 4556.2,
        "end": 4562.48
    },
    {
        "text": " del MVP va por ahí. Bueno, vamos a ir un poquito, ¿qué pasa cuando esas validaciones",
        "start": 4562.48,
        "end": 4572.36
    },
    {
        "text": " no dicen que esa idea se entra y que uno tiene? No, no camina, o sea, capaz que yo no sé",
        "start": 4572.36,
        "end": 4580.839999999999
    },
    {
        "text": " qué, si yo he pedido ya como arrancar, creo que arrancamos el tema de la comida, pero imagínense",
        "start": 4580.839999999999,
        "end": 4584.799999999999
    },
    {
        "text": " que ellos no sé, no sé, dijieron bueno, la gente va a querer pedir a su comarcado por internet,",
        "start": 4584.799999999999,
        "end": 4591.16
    },
    {
        "text": " entonces, bajando luego es super, creo que ya existía hace años eso, este, y si un alán",
        "start": 4591.88,
        "end": 4597.599999999999
    },
    {
        "text": " y vieron que la gente no, no sé, no, no, no, no, no, enganchaba con esto, pero es muy",
        "start": 4597.599999999999,
        "end": 4602.28
    },
    {
        "text": " muy complicado, entonces, bueno, ahí, en los empleandadores podrían pensar, ok, a la gente no",
        "start": 4602.28,
        "end": 4610.04
    },
    {
        "text": " le interesa comprar cosas supermercados, buen internet, o quizás la gente que le intensa muy poca",
        "start": 4610.04,
        "end": 4616.72
    },
    {
        "text": " o el valor generado, pero bueno, no sé, hay que cambiar, hay que mobarse, entonces, cuando",
        "start": 4616.72,
        "end": 4623.16
    },
    {
        "text": " uno hace un cambio de rumbo fuerte, uno hace una corrección en el curso, eso le llama pivot, o sea,",
        "start": 4623.16,
        "end": 4627.88
    },
    {
        "text": " este puedo dar decir bueno, no, está bien la gente, vamos a validar otra cosa, vamos a",
        "start": 4627.88,
        "end": 4635.12
    },
    {
        "text": " ver si la gente quiere pedir comida por internet, entonces ese cambio este, inclican un giro, un",
        "start": 4635.12,
        "end": 4641.400000000001
    },
    {
        "text": " giro fuerte, o sea, un giro en la problemática enfrentada o la audiencia objetiva, este, quizás",
        "start": 4641.4,
        "end": 4647.08
    },
    {
        "text": " no sé, con un giro de audiencia, ese caso de broncis, no sé, es una empresa que que en sus",
        "start": 4647.08,
        "end": 4652.5599999999995
    },
    {
        "text": " segundos, dos primeros años trabajaba principalmente con clientes, haciendo operadores de drones, y ahora",
        "start": 4652.5599999999995,
        "end": 4659.08
    },
    {
        "text": " su cliente son empresas, este, y lo que es lo que a mente en el siguiente period, volvemos a",
        "start": 4659.08,
        "end": 4664.879999999999
    },
    {
        "text": " aplicar a operadores de drones, así que este, nada, este bueno emperiadores, pero fabricantes y",
        "start": 4665.400000000001,
        "end": 4671.64
    },
    {
        "text": " empresas copieran, entonces este, nada, eso es otro tipo de pivot también, no sé, bueno, tal lo que",
        "start": 4671.64,
        "end": 4678.6
    },
    {
        "text": " hacemos, lo aplicamos a otro segmento de negocios, y esto es muy difícil de hacer pivotiar, es muy",
        "start": 4678.6,
        "end": 4686.4800000000005
    },
    {
        "text": " difícil, no porque, no por la variedad exterior, sino la realidad interior de uno, no, ese es",
        "start": 4686.4800000000005,
        "end": 4693.2
    },
    {
        "text": " una mucha cierta idea, sus cartas visiones, y bueno, esta es una invitación que les hago,",
        "start": 4693.2,
        "end": 4700.72
    },
    {
        "text": " cuando se enfrenten a un resultado de arso, de narida, de encogar cosa, no, decir, bueno,",
        "start": 4700.72,
        "end": 4705.32
    },
    {
        "text": " está, hago las cosas de la misma manera, hago las hago, o probarlo una manera diferente, y",
        "start": 4705.32,
        "end": 4711.72
    },
    {
        "text": " aplicado esto de emprendedurismo, es un poco la definición de pivot, no, decir, bueno, está,",
        "start": 4711.72,
        "end": 4717.04
    },
    {
        "text": " esto, sino camina, y cuando antes me de cuenta que no camina, menos tiempo y plata,",
        "start": 4717.04,
        "end": 4721.76
    },
    {
        "text": " voy a perder, y más rápido voy a poder intentar hacer algo diferente, muchas veces no sabemos",
        "start": 4721.76,
        "end": 4727.280000000001
    },
    {
        "text": " bien que es, pero probamos algo diferente, y bueno, de esa manera muy experimental, uno puede",
        "start": 4727.280000000001,
        "end": 4732.64
    },
    {
        "text": " llegar a autar los resultados, pero me quedó la barra arriba de... bueno, ahí un poco",
        "start": 4732.64,
        "end": 4746.24
    },
    {
        "text": " ola de los principios básicos de la linea startup, me preocupa que nada que habla de la actitud,",
        "start": 4746.24,
        "end": 4752.08
    },
    {
        "text": " si uno se pone ese plan, yo soy el emprendedor y tengo en la supervisión, ya parte de una actitud,",
        "start": 4753.679999999999,
        "end": 4759.76
    },
    {
        "text": " y me pongo esos zapatos y esos hombres, porque en algún momento me los puse, y creí una actitud que",
        "start": 4761.04,
        "end": 4769.12
    },
    {
        "text": " no es la masa de guá para... nada, no es la masa de guá, no porque T-Shots, si son",
        "start": 4769.12,
        "end": 4776.46
    },
    {
        "text": " funcionarios y no hacen fantasias, simplemente no es lo que linea startup propone, linea startup propone",
        "start": 4776.46,
        "end": 4782.0
    },
    {
        "text": " a la actitud más curiosa, más observadora, más científica, se quiere desapegar, de todas esas",
        "start": 4782.0,
        "end": 4788.24
    },
    {
        "text": " ideas, que uno trae, y decir, bueno, esto funciona, la realidad, y ahí hay un proceso, ese proceso que",
        "start": 4788.24,
        "end": 4795.4
    },
    {
        "text": " vimos de Bill Mechurlano, y ese proceso requiere cierto orden, ahí aparecen herramientas como en",
        "start": 4795.4,
        "end": 4802.0
    },
    {
        "text": " Canvas, donde uno puede rápidamente anotar su cidad, su hipótesis, registrar qué",
        "start": 4802.0,
        "end": 4809.96
    },
    {
        "text": " primerimento funciona, qué resultados tienen los experimentos de refutación hipótesis,",
        "start": 4809.96,
        "end": 4813.879999999999
    },
    {
        "text": " después lo que tiene con la contabilidad tiene que ver con justamente, o sea, poder medir,",
        "start": 4815.879999999999,
        "end": 4821.32
    },
    {
        "text": " cuanta gente le dio clic a esto, o sea, o sea, a ver cosas un poco más quantitativas,",
        "start": 4821.32,
        "end": 4829.84
    },
    {
        "text": " cómo aumentaron las ventas de tal producto para hacer tal cosa, entonces ahí es importante,",
        "start": 4829.84,
        "end": 4835.799999999999
    },
    {
        "text": " si, bueno, tener cierta cierta información objetiva, y finalmente bueno,",
        "start": 4835.799999999999,
        "end": 4840.24
    },
    {
        "text": " con esa cierta riesgo, a mirarse con ese riesgo, con ese incertigumbre, de qué hacemos,",
        "start": 4840.24,
        "end": 4848.599999999999
    },
    {
        "text": " qué no hacemos, y para también a la clase de hoy, ese es poquito el cierre de Line Startup,",
        "start": 4848.599999999999,
        "end": 4855.8
    },
    {
        "text": " creo que ahora si quieren recomparse a las partes más de pregunta, hacer repuesta, pero",
        "start": 4855.8,
        "end": 4860.86
    },
    {
        "text": " vimos las cosas básicas, hay otras aproximaciones como ShowsTudan que la que vamos a la hora,",
        "start": 4860.86,
        "end": 4870.74
    },
    {
        "text": " como un poco para decir de ese otro camino, no es que no están en contra de posición,",
        "start": 4870.74,
        "end": 4878.74
    },
    {
        "text": " son ópticas diferentes, creo que lo mismo, entonces acá en ShowsTudan, darías trabajos",
        "start": 4878.74,
        "end": 4885.0199999999995
    },
    {
        "text": " por hacer hechos, el poco se centra en la motivación de los clientes, y por qué ellos",
        "start": 4885.02,
        "end": 4893.3
    },
    {
        "text": " carrian hacer algo, comprar un producto o hacer las cosas, entonces se enfoca mucho en",
        "start": 4893.3,
        "end": 4902.18
    },
    {
        "text": " mejorar cómo se hacen las cosas, y no deben introducir necesidades nueve, más o",
        "start": 4902.18,
        "end": 4908.780000000001
    },
    {
        "text": " veces del mercado se presiona esas crear necesidades, o olvidar ser producto, o sea no ser producto,",
        "start": 4909.74,
        "end": 4918.139999999999
    },
    {
        "text": " sino lo que atarea, lo que lo valió acá, después el prohreso define valor, si bueno,",
        "start": 4918.139999999999,
        "end": 4924.86
    },
    {
        "text": " si el valor de lo que nosotros estamos haciendo está relacionado a qué tanto prohreso,",
        "start": 4924.86,
        "end": 4932.7
    },
    {
        "text": " el cliente o el usuario realiza con esas tecnologías, lo que fuera, quizás la parte que más",
        "start": 4932.7,
        "end": 4941.0199999999995
    },
    {
        "text": " cuestiones la parte de estar basado en datos, algo muchas veces, estas cuestiones de la motivación",
        "start": 4941.0199999999995,
        "end": 4946.82
    },
    {
        "text": " humana están por fuera, digamos, a veces no son tan fácil de descensar, digamos, de lo frío,",
        "start": 4946.82,
        "end": 4953.42
    },
    {
        "text": " de los datos, y ahí es donde se pone el foco en la motivación humana, por qué hacemos las",
        "start": 4953.42,
        "end": 4960.179999999999
    },
    {
        "text": " cosas, y ahí volvamos a selektura, volvamos a que es una forma muy distinta a las cosas,",
        "start": 4961.18,
        "end": 4969.06
    },
    {
        "text": " es una forma que yo no personales estoy aplicando hace mucho tiempo ya, que es cuando hablamos de",
        "start": 4969.06,
        "end": 4975.9800000000005
    },
    {
        "text": " cliente, no uno se imagina gente, pero cuando piensen ahora a todos los que trabajan en",
        "start": 4975.9800000000005,
        "end": 4982.54
    },
    {
        "text": " el cliente piensen en esa persona, esa persona que paga por los servicios que ustedes que son",
        "start": 4982.54,
        "end": 4988.66
    },
    {
        "text": " empresas, pongan el nombre a bellido, ese persona tiene un nombre, tiene una cara, tiene una vida,",
        "start": 4988.66,
        "end": 4995.22
    },
    {
        "text": " tiene una familia, tiene actividad, tiene motivaciones, y tiene un trabajo, un trabajo,",
        "start": 4995.22,
        "end": 5001.9
    },
    {
        "text": " y quieren hasta cierre en los ojos, imagínense lo al tipo, en su oficina, en su tallar, en su vehículo,",
        "start": 5004.3,
        "end": 5010.9
    },
    {
        "text": " en su lo que sea, haga su trabajo, y esa persona tiene cosas para hacer, o sea, tiene cosas para",
        "start": 5011.42,
        "end": 5019.42
    },
    {
        "text": " hacer en su día y cómo las hace, y qué problemas tiene, o sea, qué cosas le molestan, o sea,",
        "start": 5019.42,
        "end": 5025.179999999999
    },
    {
        "text": " hasta de un punto de vista emocional, no tanto económico, es decir, esto por ahí son 10 minutos",
        "start": 5025.179999999999,
        "end": 5031.179999999999
    },
    {
        "text": " al día, pero la verdad que el tipo se le cae en internet, por lo que tiene que hacer eso y realmente",
        "start": 5031.179999999999,
        "end": 5036.219999999999
    },
    {
        "text": " es algo que le duvela, le molesta, entonces es una aproximación distinta, es una aproximación más",
        "start": 5036.22,
        "end": 5042.5
    },
    {
        "text": " entraba en el humano, no sé, como anego, tal si les, nosotros somos proveedores de sistema",
        "start": 5042.5,
        "end": 5050.14
    },
    {
        "text": " de esa mayutía, en un lugar que es un sistema de gestión de trafico a diadrones, y el problema,",
        "start": 5050.14,
        "end": 5055.9400000000005
    },
    {
        "text": " uno de los grandes problemas, a ver, uno podría, usted ven el nervisto, muchos de ustedes cosas",
        "start": 5055.9400000000005,
        "end": 5061.14
    },
    {
        "text": " fabulosas del tema de drones, en internet, en la teleno, que fue el adrón de Liberty, y yo,",
        "start": 5061.14,
        "end": 5066.820000000001
    },
    {
        "text": " muchas veces veo, o sea, el sistema nuestro, que se promociona como algo que va a habilitar las",
        "start": 5066.820000000001,
        "end": 5071.22
    },
    {
        "text": " entreas con drones, no, y no se imagina, el de Liberty y de Amazon, llegando a la casa, no sé",
        "start": 5071.22,
        "end": 5076.9400000000005
    },
    {
        "text": " una pisa bajando en el patio de la casa, y todo ese inventario que le activo, que ahí se",
        "start": 5076.9400000000005,
        "end": 5081.54
    },
    {
        "text": " imaginara, que le activo, ahora, como ese sistema yo le podría vender así, pero, o sea,",
        "start": 5081.54,
        "end": 5088.02
    },
    {
        "text": " realmente, por qué le vendí ese sistema, o por qué ese sistema es tan producción, y ahí me acuerdo",
        "start": 5088.5,
        "end": 5094.42
    },
    {
        "text": " de dos personas, no, que no lo voy a dar el nombre, pero son las personas que están acá,",
        "start": 5094.42,
        "end": 5100.34
    },
    {
        "text": " o el tema de drones, una tiene 60, pocos años, yo te tiene 35 por ahí, y bueno, ellos se dedicaban a",
        "start": 5100.34,
        "end": 5111.580000000001
    },
    {
        "text": " todas las gestiones de seguridad operacional, se llamaban la área, donde, bueno, cada tanto",
        "start": 5111.58,
        "end": 5117.5
    },
    {
        "text": " recibían llamados de nuevas operaciones, como una helolina, se habilitan el país, o alguien que",
        "start": 5117.5,
        "end": 5122.74
    },
    {
        "text": " haces un vuelo en condiciones particulares, estamos hablando de lesión tripulada,",
        "start": 5122.74,
        "end": 5126.3
    },
    {
        "text": " habilitar nuevas zonas de vuelo, nuevas perrústas de áreas comercial, ese tipo de cosas,",
        "start": 5130.0599999999995,
        "end": 5135.82
    },
    {
        "text": " en el guay por las callas que tenemos además, estamos hablando de unas pocas decenas",
        "start": 5136.86,
        "end": 5141.22
    },
    {
        "text": " de intervenciones al año, este tipo de cosas, por más que, repente les ha dado trabajo,",
        "start": 5141.22,
        "end": 5144.820000000001
    },
    {
        "text": " ya está dado un tiempo, trabajar en cada una de ellas, y de repente, una cuestión normativa y",
        "start": 5144.820000000001,
        "end": 5150.820000000001
    },
    {
        "text": " tecnológica, aparecen las drones, y bueno, además son baratos, o literalmente baratos, entonces,",
        "start": 5150.820000000001,
        "end": 5157.38
    },
    {
        "text": " muchos fotógrafos, mucha gente se compra uno, y pasaron de gestionar, no sé, por si está",
        "start": 5157.38,
        "end": 5163.900000000001
    },
    {
        "text": " siendo 100 aeronaves por día, a tener que gestionar 5.000 aeronaves por día, entonces,",
        "start": 5163.9,
        "end": 5169.219999999999
    },
    {
        "text": " no es un tema económico, porque el valor que genera esas 5.000 aeronaves todavía no empatan",
        "start": 5170.379999999999,
        "end": 5175.98
    },
    {
        "text": " lo que genera los atacien, no es un tema fungista humano, porque la realidad es que los riesgos reales",
        "start": 5175.98,
        "end": 5182.82
    },
    {
        "text": " que generan los drones, en lo que es la sociedad, en este momento, no son tan pesados, como el",
        "start": 5182.82,
        "end": 5189.099999999999
    },
    {
        "text": " riesgo que pues genera, por ejemplo, un accidente aero, pero claro, los tipos están con la cabeza",
        "start": 5189.1,
        "end": 5196.26
    },
    {
        "text": " así, de recid llamada, para gente que les pide autorizaciones especiales, porque la normativa es",
        "start": 5196.26,
        "end": 5201.620000000001
    },
    {
        "text": " muy restrictiva, entonces, lo que quiero pegar legalmente, requieren a su montón de trámites,",
        "start": 5201.620000000001,
        "end": 5207.660000000001
    },
    {
        "text": " no tan des que, bueno, que le van a decir que no lo salgan, porque si no se hace pasan",
        "start": 5207.660000000001,
        "end": 5211.780000000001
    },
    {
        "text": " legalmente, y eso tampoco quieren que, que opinan legalmente, pues un problema, bonén,",
        "start": 5211.780000000001,
        "end": 5216.06
    },
    {
        "text": " idea de lo que está posuciendo en el espacio de herido, lo llama la policía para denunciar algo,",
        "start": 5216.06,
        "end": 5221.54
    },
    {
        "text": " y yo no saben qué está pasando, entonces, el centro de la venta de esta que dice,",
        "start": 5221.54,
        "end": 5229.5
    },
    {
        "text": " es el dolor de cabeza que le genera esas dos personas, o sea, la incertidumbre que le genera,",
        "start": 5229.5,
        "end": 5236.54
    },
    {
        "text": " no saber, o sea, o sea, es como que quedan pegados, o sea, le pregunto, ya policía che,",
        "start": 5236.54,
        "end": 5242.660000000001
    },
    {
        "text": " tenunciaron algo, o sea, o también, o sea, no sé, hace unos meses, un avión de la TAM,",
        "start": 5242.66,
        "end": 5255.0599999999995
    },
    {
        "text": " en final, el aeroporto de Carrasco, reportó que tuvo un encuentro cercano, y quizá habían ellos,",
        "start": 5255.0599999999995,
        "end": 5261.54
    },
    {
        "text": " o sea, no se llama, o sea, no se habían siga volando ahí, o sea, entonces, el problema",
        "start": 5261.54,
        "end": 5266.98
    },
    {
        "text": " que yo le resuelvo a la gente que toma decisiones, básicamente, es algo en el horro de cabeza,",
        "start": 5266.98,
        "end": 5273.379999999999
    },
    {
        "text": " de saco, algo que le toma mucho tiempo en el día, que le genera cierta molestia, que le genera",
        "start": 5273.379999999999,
        "end": 5279.219999999999
    },
    {
        "text": " incertidumbre, entonces, capaz que de punto de vista objetivo, económico, no están pesados,",
        "start": 5279.219999999999,
        "end": 5284.9
    },
    {
        "text": " entonces, y eso tiene otras connotaciones, pero el centro de todo esto es esto, no, de la,",
        "start": 5284.9,
        "end": 5292.099999999999
    },
    {
        "text": " de la parte emocional y motivacional de las personas, entonces, que le gustaron que este ejemplo,",
        "start": 5292.740000000001,
        "end": 5298.34
    },
    {
        "text": " porque quizás, en aquellas primeras reuniones que tú y con esta gente, hubiera justo el",
        "start": 5298.34,
        "end": 5306.3
    },
    {
        "text": " Iba algo de esto, y me fue que bastante en esto, en mi lado de esta manera, y creo que me",
        "start": 5306.3,
        "end": 5311.46
    },
    {
        "text": " iba a ir a un resultado, mirarlo así, entonces, nada, a ver si va quedando un poquito más claro,",
        "start": 5311.46,
        "end": 5319.54
    },
    {
        "text": " no, hay un esquema ahí, digamos, de cómo se daría el proceso de innovación, o sea,",
        "start": 5319.54,
        "end": 5326.34
    },
    {
        "text": " hay una propuesta de valor, de producto de servicio, y tal cual son las necesidades,",
        "start": 5326.34,
        "end": 5331.5
    },
    {
        "text": " cual son los shows tuidad, entonces, puedo pensar en los trabajos funcionales principales,",
        "start": 5331.5,
        "end": 5336.78
    },
    {
        "text": " no, así bueno, ¿táquen hacer esta persona? La persona llega a la 8 de la mañana de la",
        "start": 5336.78,
        "end": 5340.94
    },
    {
        "text": " oficina, se sienta, dejara mochila, se levanta, vais, esas un café, vuelve a ver los correos,",
        "start": 5340.94,
        "end": 5348.46
    },
    {
        "text": " a ti en ese bueno, en cualquier momento le pude zona del teléfono, porque la, como se dice, le",
        "start": 5348.46,
        "end": 5356.099999999999
    },
    {
        "text": " piden que haga una utilización especial, pero no le ya está haciendo otra cosa que la requiere",
        "start": 5356.099999999999,
        "end": 5360.82
    },
    {
        "text": " concentración, entonces me meto, me meto, y cómo se sienta esa persona, siente contenta con ese",
        "start": 5360.82,
        "end": 5367.139999999999
    },
    {
        "text": " me que le se con esa interrupción, le molesta, entonces ahí empezamos a entrar en la dimensión social",
        "start": 5367.139999999999,
        "end": 5372.38
    },
    {
        "text": " y personal, no que lo que dice ahí, o sea, en la dimensión social, y bueno, ¿tá? Si la social",
        "start": 5372.38,
        "end": 5379.62
    },
    {
        "text": " importa eso, si realmente hay una molestia con conencia aspecto, ya no se ve por hoy temática que",
        "start": 5379.62,
        "end": 5386.38
    },
    {
        "text": " quinta que importa mucho, por ejemplo, en medio ambiente, o sea, hay una cuestión colectiva,",
        "start": 5386.9400000000005,
        "end": 5391.26
    },
    {
        "text": " rego de eso, por ejemplo, ahí podríamos hacer una dimensión social, o la dimensión social del",
        "start": 5391.26,
        "end": 5395.78
    },
    {
        "text": " ejemplo pasado que le puse, bueno, todo que tenía con la seguridad, digamos, del espacio de",
        "start": 5395.78,
        "end": 5401.74
    },
    {
        "text": " héroe, que decía ahí una error en la gestión, puede impactar en vida sumana, y bueno, la dimensión",
        "start": 5401.74,
        "end": 5408.9400000000005
    },
    {
        "text": " personal, esa persona, esa persona que a las 9 de la mañana estaba reconcentrada haciendo algo,",
        "start": 5408.9400000000005,
        "end": 5413.54
    },
    {
        "text": " el esonal teléfono por un flaco que quería sacar fotos en la plaza independencia, entonces,",
        "start": 5413.54,
        "end": 5417.7
    },
    {
        "text": " esa pa no puedo creer que me están llamando por esto, entonces ahí una dimensión personal y para esa",
        "start": 5417.7,
        "end": 5424.78
    },
    {
        "text": " persona, importa mucho eso, entonces por ahí para mí o para ustedes o para el mundo, o sea, no es tan",
        "start": 5424.78,
        "end": 5429.98
    },
    {
        "text": " importante, pero para esa persona sí, entonces estamos ayudando a esa persona, y bueno,",
        "start": 5429.98,
        "end": 5435.26
    },
    {
        "text": " esto mismo se puede aplicar los trabajos relacionados, he dicho, bueno, quizás",
        "start": 5435.26,
        "end": 5442.58
    },
    {
        "text": " es discutible si esto que yo le puse es un trabajo principal o relacionado para mí principal,",
        "start": 5442.58,
        "end": 5448.58
    },
    {
        "text": " pero bueno podría tomarse también un trabajo relacionado, cosas que le generan interrupciones,",
        "start": 5448.58,
        "end": 5453.5
    },
    {
        "text": " que de repente no es su responsabilidad principal, pero bueno, todos los días tienen que atender.",
        "start": 5453.5,
        "end": 5457.9400000000005
    },
    {
        "text": " Así que bueno, queríamos hacerles esas metodologías, por supuesto esto es una vez,",
        "start": 5458.9,
        "end": 5464.46
    },
    {
        "text": " si que una vez, creo que es una una, este, el base, tienen que leer, hay que aguasar aquí,",
        "start": 5464.46,
        "end": 5471.98
    },
    {
        "text": " mejor, o sea, cosas estilos, yo tu dirán también hay unas lecturas muy interesantes,",
        "start": 5471.98,
        "end": 5476.94
    },
    {
        "text": " creo que en la en la librografía este está, y bueno, ahora quería, quería reunir a",
        "start": 5476.94,
        "end": 5482.94
    },
    {
        "text": " dejar un espacio ahí para una pregunta, este que pueden llegar a tener este tema.",
        "start": 5482.94,
        "end": 5487.179999999999
    }
]