[
    {
        "text": " Bueno arrancamos, vamos a terminar con la cuestión de complementos ortobodali",
        "start": 0.0,
        "end": 24.560000000000002
    },
    {
        "text": " en la protección, uno tiene, esto mismo es visto, a modo de repaso lo que era el complemento ortobonal",
        "start": 24.56,
        "end": 31.56
    },
    {
        "text": " para definir esto uno trabaja en un espacio vectorial con producto interno",
        "start": 38.56,
        "end": 42.56
    },
    {
        "text": " y lo que hacemos en el espacio vectorial, es un espacio vectorial con producto interno",
        "start": 54.56,
        "end": 69.56
    },
    {
        "text": " y lo que hacemos en ese espacio vectorial es considerar un conjunto ese contenido en vez",
        "start": 69.56,
        "end": 88.56
    },
    {
        "text": " que se contiene en vez, ese conjunto puede ser un espacio vectorial o cualquier conjunto",
        "start": 88.56,
        "end": 95.56
    },
    {
        "text": " el complemento ortobonal es el conjunto de todos los vectores en vez que son ortobonales a todos los elementos de ese",
        "start": 96.56,
        "end": 106.56
    },
    {
        "text": " y eso es el conjunto de todos los vectores, tal es que el producto interno debe con cualquier elemento de este conjunto me da ser",
        "start": 106.56,
        "end": 118.56
    },
    {
        "text": " esa es la definición de complemento ortobonal",
        "start": 121.56,
        "end": 125.56
    },
    {
        "text": " en la clase pasada vimos que esto era un subespacio vectorial, más allá de que ese sea o no se un subespacio esto siempre es un subespacio",
        "start": 126.56,
        "end": 137.56
    },
    {
        "text": " y después vimos que en el caso particular de que este fue un subespacio para calcular, para caracterizar los vectores que están acá dentro",
        "start": 138.56,
        "end": 145.56
    },
    {
        "text": " basta con ver aquellos vectores que son ortobonales a todos los elementos de una base del espacio ese",
        "start": 146.56,
        "end": 151.56
    },
    {
        "text": " eso fue lo último que vimos y dejamos una proposición pendiente de demostración, decir uno tiene el espacio vectorial ver un conjunto ese y en general tiene el complemento ortobonal",
        "start": 151.56,
        "end": 168.56
    },
    {
        "text": " vamos a ver que en el caso de que ese sea un subespacio esto siempre un subespacio entonces después ver que ve es suma directa de esto, más esto",
        "start": 169.56,
        "end": 177.56
    },
    {
        "text": " es decir que cualquier vector acá, cualquier vector en este espacio se puede componer la suma de algo que está acá, más la suma de algo que está acá",
        "start": 177.56,
        "end": 187.56
    },
    {
        "text": " lo graficamos así y digo, usando un poco la notación, todo vector en el espacio vectorial se descompone una única manera como un elemento acá, más un elemento acá",
        "start": 188.56,
        "end": 196.56
    },
    {
        "text": " eso lo que vamos a probar ahora, en el caso de que esto se se un subespacio entonces habíamos anunciado la siguiente proposición",
        "start": 196.56,
        "end": 205.56
    },
    {
        "text": " de nuevo como siempre, espacio vectorial con producto interno",
        "start": 205.56,
        "end": 219.56
    },
    {
        "text": " ese un subespacio, vamos a restringir el caso en que ese sí, ese un subespacio vectorial",
        "start": 225.56,
        "end": 230.56
    },
    {
        "text": " de dimensión finita, recordemos que siempre en el curso cuando usamos bases estamos trabajando en dimensión finita",
        "start": 235.56,
        "end": 242.56
    },
    {
        "text": " entonces lo que se cumple es que ves, escribe como suma directa de ese, más el complemento ortobonal de ese",
        "start": 243.56,
        "end": 254.56
    },
    {
        "text": " eso lo que vamos a probar, eso lo habíamos anunciado, la clase pasada y ahí hemos terminado",
        "start": 255.56,
        "end": 262.56
    },
    {
        "text": " la demostración de esto es muy linda y muy sencilla, miren lo que hay que ver, son dos cosas, primero",
        "start": 263.56,
        "end": 272.56
    },
    {
        "text": " primero hay que ver que ve efectivamente se escribe como es la suma de ese, más el complemento ortobonal de ese",
        "start": 272.56,
        "end": 285.56
    },
    {
        "text": " es decir que todo vector acá se escribe como suma de esto, más esto y después hay que ver que la suma es la descomposición es única y eso es equivalente a probar que la intersección entre estos dos subespacios tiene un único elemento que es el número",
        "start": 286.56,
        "end": 301.56
    },
    {
        "text": " el número es el único elemento que está en ese y en ese ortobonal",
        "start": 303.56,
        "end": 309.56
    },
    {
        "text": " entonces para demostrar esto vamos a considerar una base de ese pero en particular vamos a concentrar en una base ortonormal de ese",
        "start": 311.56,
        "end": 320.56
    },
    {
        "text": " acá entran, empiezan a aparecer las bases ortonormales, entonces vamos a considerar una base cualquiera ortonormal",
        "start": 320.56,
        "end": 329.56
    },
    {
        "text": " cuyo elemento le vamos a llamar ese uno, ese dos hasta ese acá y esto es una base ortonormal del espacio de tutorial",
        "start": 330.56,
        "end": 343.56
    },
    {
        "text": " ahí estamos suponiendo obviamente que ese no es el espacio trivial el cero, si ese fue el espacio trivial el cero entonces el conjunto de vector es que son ortobonales al cero son todo ve",
        "start": 343.56,
        "end": 355.56
    },
    {
        "text": " en este caso particular es obvio, si esto es cero esto es todo ve, entonces vamos a considerar que tengo una base acá en",
        "start": 356.56,
        "end": 366.56
    },
    {
        "text": " perdón base ortonormal, ahí ya me equivoco del espacio es, perdón ahí, entonces yo tengo una base ortonormal de ese y dado un vector cualquiera puede hacerlo siguiente",
        "start": 366.56,
        "end": 381.56
    },
    {
        "text": " no, entonces yo lo que tengo acá es una base ortonormal",
        "start": 385.56,
        "end": 407.56
    },
    {
        "text": " Entonces yo lo que tengo acá es una base ortonormal del sub espacio B, esa base tiene",
        "start": 407.56,
        "end": 419.22
    },
    {
        "text": " cada elementos y ahora agarra un vector cualquiera en el espacio que estoy trabajando y me",
        "start": 419.22,
        "end": 425.2
    },
    {
        "text": " construyo un nuevo vector que le llamamos ahí B sub B sub B se lo construyo así, agarra",
        "start": 425.2,
        "end": 431.6
    },
    {
        "text": " B toma el producto interno con cada uno de los elementos de la base, a ese escalarlo",
        "start": 431.6,
        "end": 436.28
    },
    {
        "text": " multiplico por el correspondiente elemento de la base y sumo sobre todo los elementos de",
        "start": 436.28,
        "end": 440.44
    },
    {
        "text": " la base de ese. Así de fino este vector B sub B, que obviamente depende de B, me dan B, tengo",
        "start": 440.44,
        "end": 448.84
    },
    {
        "text": " la base yo calculo eso. Bien, entonces como esto es una combinación lineal de los elementos",
        "start": 448.84,
        "end": 457.91999999999996
    },
    {
        "text": " de la base de la base de la base y B esto acá obviamente está en E, en conjunto ese",
        "start": 457.92,
        "end": 464.56
    },
    {
        "text": " grande. Ese es el primer paso, me dan una base cualquiera y yo dado un vector B, me construyo",
        "start": 464.56,
        "end": 475.92
    },
    {
        "text": " este vector B sub B, ese que es un elemento de ese. Y ahora vamos a hacer lo siguiente. Vamos a",
        "start": 475.92,
        "end": 492.32
    },
    {
        "text": " probar que si ustedes me dan el vector B y le restan ese otro vector, esto está en el",
        "start": 492.32,
        "end": 504.24
    },
    {
        "text": " complemento ortobonal. Es decir, este vector es ortobonal a todos los",
        "start": 504.24,
        "end": 509.96000000000004
    },
    {
        "text": " vectores de ese. Esto lo hago para cada vector B, agarra un vector B, me construyo esto",
        "start": 509.96000000000004,
        "end": 518.5600000000001
    },
    {
        "text": " que está en E y veo que aquella resta está en el complemento ortobonal de ese. Y para",
        "start": 518.5600000000001,
        "end": 523.96
    },
    {
        "text": " eso me basta a comprobar que este vector es ortobonal a cada uno de los elementos de la",
        "start": 523.96,
        "end": 530.36
    },
    {
        "text": " base, porque ya vimos probar la clase pasada que está en el complemento ortobonal si",
        "start": 530.36,
        "end": 534.2
    },
    {
        "text": " esto es un sub espacio, si solo sí es ortobonal a cada uno de los elementos de la base. Entonces",
        "start": 534.2,
        "end": 538.88
    },
    {
        "text": " veamos efectivamente que B menos B es ortobonal a cada uno de estos elementos de la base.",
        "start": 538.88,
        "end": 544.4
    },
    {
        "text": " Agarrro un elemento js y modela base y vamos a calcular B menos B es producto interno con",
        "start": 544.4,
        "end": 566.0
    },
    {
        "text": " el elemento js y modela base y vamos a ver que es efectivamente de 0. ¿Se entiende? Es importante",
        "start": 566.0,
        "end": 583.0
    },
    {
        "text": " que esto sea un base ortobonal, entonces la construcción. Entonces lo que hacemos es llevamos",
        "start": 583.0,
        "end": 592.56
    },
    {
        "text": " este b sub es allá y hacemos la cuenta. Esto es B menos ese vector.",
        "start": 592.56,
        "end": 601.0799999999999
    },
    {
        "text": " B menos ese vector está acá y eso tengo que tomar producto interno con ese j. Este es un",
        "start": 601.08,
        "end": 624.44
    },
    {
        "text": " elemento fijo de la base, es js y modela base de la base, que está fijo y el argumento va a",
        "start": 624.44,
        "end": 631.1
    },
    {
        "text": " valer para cada para todos j, para uno, dos hasta acá. Entonces desarrollo esto acá usando las",
        "start": 631.1,
        "end": 638.84
    },
    {
        "text": " propiedades de liñalidad del producto interno con respecto a la primera entrada, esto es una suma",
        "start": 638.84,
        "end": 643.72
    },
    {
        "text": " o sea que me queda B producto interno con ese j por un lado y después esta suma sale para",
        "start": 643.72,
        "end": 653.76
    },
    {
        "text": " afuera propiedades del producto interno y ahora me queda el producto interno de esto con ese",
        "start": 653.76,
        "end": 666.1600000000001
    },
    {
        "text": " j, estos escalares salen para afuera del producto interno porque están en la primera entrada.",
        "start": 666.1600000000001,
        "end": 671.72
    },
    {
        "text": " Entonces los escalares esto salen para afuera y finalmente me queda el producto interno de",
        "start": 671.72,
        "end": 682.52
    },
    {
        "text": " ese I con ese j, bien, entonces cuando desarrollo, cuando hago desarrollo esto me queda B producto",
        "start": 682.52,
        "end": 693.5
    },
    {
        "text": " interno con ese j, menos la suma sale para afuera y me queda estos escalares salen para afuera y me",
        "start": 693.5,
        "end": 699.2
    },
    {
        "text": " queda S I producto interno con ese j y ahora como esto es una base orto normal, el producto interno",
        "start": 699.2,
        "end": 705.9200000000001
    },
    {
        "text": " de S I con ese j me da que coge, me da Cero si es distinto de J y uno si es igual a J, o sea que esto acá es",
        "start": 705.9200000000001,
        "end": 712.4000000000001
    },
    {
        "text": " esto acá es Cero si es distinto de J y uno si es igual a J, en el caso igual a J tengo el",
        "start": 715.2,
        "end": 725.36
    },
    {
        "text": " producto interno de S I con S I o mismo que es la norma y cuadrado que es uno porque eso está",
        "start": 725.36,
        "end": 729.92
    },
    {
        "text": " normalizado. Entonces fíjense de todos estos sumandos en y solamente sobrevivia que el que",
        "start": 729.92,
        "end": 737.12
    },
    {
        "text": " tiene igual a J, entonces me queda aquí, me queda esto primero y después como les decía,",
        "start": 737.12,
        "end": 747.6
    },
    {
        "text": " de todos estos sumandos sobrevivia que tiene igual a J, que es B producto interno con ese J y acá",
        "start": 747.6,
        "end": 755.9200000000001
    },
    {
        "text": " me quedaría ese J con ese J que es uno y ahí fíjense lo que me queda, B producto interno",
        "start": 755.9200000000001,
        "end": 761.44
    },
    {
        "text": " con ese J, menos B producto interno con ese J esto me da Cero, o sea que efectivamente esta",
        "start": 761.44,
        "end": 768.64
    },
    {
        "text": " diferencia acá es orto-gonal a cada uno de los factores de la base de S por lo tanto",
        "start": 768.64,
        "end": 775.52
    },
    {
        "text": " tiene complemento ortobonal, se entendió algo, el producto interno de esto con cada uno de los",
        "start": 775.52,
        "end": 782.9
    },
    {
        "text": " elementos de la base de S y veo que eso me da Cero, por lo tanto esto efectivamente está en el complemento",
        "start": 782.9,
        "end": 788.02
    },
    {
        "text": " ortobonal.",
        "start": 788.02,
        "end": 788.48
    },
    {
        "text": " Entonces, resumiendo, me da un vector cualquiera, yo tengo una base en el hijo, ya vamos a ver que es su",
        "start": 788.48,
        "end": 807.2
    },
    {
        "text": " independiente la base que uno le hija, usted me da un vector, yo calculo esto que está en S y",
        "start": 807.2,
        "end": 813.88
    },
    {
        "text": " pruebo que la diferencia entre B y acá el vector está en el complemento ortobonal. Entonces ahora fíjense.",
        "start": 813.88,
        "end": 821.32
    },
    {
        "text": " Ahora fíjense lo siguiente.",
        "start": 830.68,
        "end": 832.28
    },
    {
        "text": " Al vector B lo puedas escribir de la siguiente manera, le sumo y le resto este vector,",
        "start": 832.28,
        "end": 850.28
    },
    {
        "text": " estamos, veis lo mismo que B sub S, más o menos B sub S, le sumé y le resté el mismo vector y",
        "start": 850.28,
        "end": 856.6
    },
    {
        "text": " ahora así visto esto acá está en S, el sub espació S, así lo construimos y esto acá está en S",
        "start": 856.6,
        "end": 866.28
    },
    {
        "text": " ortobonal. Entonces lo que estamos probando es que efectivamente todo vector B se escribe como",
        "start": 866.28,
        "end": 875.0
    },
    {
        "text": " sumo y algo que está en S, más la suma que está en ese complemento, estamos y eso que termine",
        "start": 875.0,
        "end": 879.9200000000001
    },
    {
        "text": " a probar que B es S y más ese complemento, se entendió esto, es muy ingeniosa la demostración,",
        "start": 880.88,
        "end": 891.0
    },
    {
        "text": " para cada vez me construyendo el vector que está en S, veo que la diferencia entre B y esto está en",
        "start": 891.0,
        "end": 896.3199999999999
    },
    {
        "text": " S ortobonal, entonces escribiendo las cosas así, veo que B se puede escribir como algo que está en S y más",
        "start": 896.3199999999999,
        "end": 901.4799999999999
    },
    {
        "text": " a U está en el complemento ortobonal. Entonces estamos probando que cualquier vector se escriba como sumo",
        "start": 901.4799999999999,
        "end": 906.5999999999999
    },
    {
        "text": " y algo acá más, algo acá. Lo que hay que ver es que esa composición es única para eso que",
        "start": 906.6,
        "end": 912.28
    },
    {
        "text": " probar esta otra condición, ya probamos esta, hay que probar esa otra, hasta ahí me siguen.",
        "start": 912.28,
        "end": 918.88
    },
    {
        "text": " Entonces fíjense esa otra condición sale de manera muy muy sencilla, muy ingeniosa además,",
        "start": 918.88,
        "end": 930.24
    },
    {
        "text": " esta demostración es realmente muy, a mí me gusta mucho, es ingeniosa, fíjense ahora lo que pasa,",
        "start": 930.24,
        "end": 936.48
    },
    {
        "text": " ya sabemos que ese y ese ortobonazo son espacios vectoriales, o sea que el cero está acá y está acá,",
        "start": 936.48,
        "end": 947.6
    },
    {
        "text": " veamos que el cero es el único elemento que está ahí adentro, entonces tomemos un vector en la",
        "start": 947.6,
        "end": 953.36
    },
    {
        "text": " intersección de ese y ese ortobonal y veamos que necesariamente ese vector es el número.",
        "start": 953.36,
        "end": 957.76
    },
    {
        "text": " Entonces, consideramos un vector en la intersección de estos dos,",
        "start": 957.76,
        "end": 970.72
    },
    {
        "text": " eso significa por un lado que el vector está en S y por el otro lado que el vector está en",
        "start": 974.3199999999999,
        "end": 982.84
    },
    {
        "text": " S ortobonal, significa las dos cosas y ahora leamos bien esto, que ve este en el comprometo",
        "start": 982.84,
        "end": 992.76
    },
    {
        "text": " ortobonal de S significa que ve es ortobonal a todos los elementos de S, en particular es",
        "start": 992.76,
        "end": 998.8000000000001
    },
    {
        "text": " ortobonal a él mismo que es un elemento de S, ve es ortobonal a todos los elementos de S y como",
        "start": 998.8000000000001,
        "end": 1004.5600000000001
    },
    {
        "text": " está en S es ortobonal a sí mismo, entonces eso implica que el producto interno de V consigo",
        "start": 1004.68,
        "end": 1013.0
    },
    {
        "text": " mismo es cero, se entendió eso, repito, ve está en el comprometo ortobonal por lo tanto es",
        "start": 1013.0,
        "end": 1021.14
    },
    {
        "text": " ortobonal a todos los elementos de S y como ve es un elemento de S en particular tiene que ser",
        "start": 1021.14,
        "end": 1028.1399999999999
    },
    {
        "text": " ortobonal a él mismo, entonces el producto interno de V consigo mismo me da cero y ya sabemos que",
        "start": 1028.24,
        "end": 1035.18
    },
    {
        "text": " por las propiedades del producto que definen el producto interno esto implica necesariamente que",
        "start": 1035.18,
        "end": 1040.74
    },
    {
        "text": " V es el cero, el único V que cumple el producto interno de V consigo mismo igual a cero es el número",
        "start": 1040.74,
        "end": 1046.94
    },
    {
        "text": " y esto me termine a probar entonces que el único elemento que está acá necesariamente es el número",
        "start": 1048.3400000000001,
        "end": 1055.0200000000002
    },
    {
        "text": " por lo tanto es interacción ese complemento es el vector nulo y por lo tanto la suma es",
        "start": 1055.58,
        "end": 1065.86
    },
    {
        "text": " suma directa, cualquiera que es su espacio de pongan ahí uno consigue el complemento y la y",
        "start": 1065.86,
        "end": 1079.62
    },
    {
        "text": " veces creo como suma de ese más ese más el comprometo de S y esto va a ser lo que me va a",
        "start": 1079.62,
        "end": 1087.2199999999998
    },
    {
        "text": " permitir definir la idea de proyección ortobonal, ¿qué significa proyectar un vector de manera",
        "start": 1087.2199999999998,
        "end": 1094.26
    },
    {
        "text": " ortobonal ya vamos a especificar eso sobre un sub espacio? Preguntas a atacar?",
        "start": 1094.26,
        "end": 1100.4199999999998
    },
    {
        "text": " Vamos a ver antes un par de observaciones, después vamos a definir la proyección ortobonal,",
        "start": 1100.42,
        "end": 1109.8600000000001
    },
    {
        "text": " vamos a hacer unos ejemplos y vamos a terminar con un resultado.",
        "start": 1109.8600000000001,
        "end": 1113.7
    },
    {
        "text": " Resumiendo, viendo esto de otra manera, sacando algunas conclusiones.",
        "start": 1113.7,
        "end": 1133.22
    },
    {
        "text": " Lo que tenemos es que dado un vector cualquiera existe en únicos elementos,",
        "start": 1133.22,
        "end": 1149.98
    },
    {
        "text": " uno le vamos a llamar v sub s que es lo que está en s y otro le va a dar v sub s",
        "start": 1155.54,
        "end": 1160.82
    },
    {
        "text": " ortobonal, les notación eso que está en s ortobonal, tal que v se escribe como ese vector",
        "start": 1160.82,
        "end": 1167.62
    },
    {
        "text": " más esto, a esto le llamamos ahora v sub s ortobonal, o sea dado un vector cualquiera existe un",
        "start": 1167.62,
        "end": 1173.58
    },
    {
        "text": " único elemento vector acá en s y un único vector acá en s ortobonal, tal es que",
        "start": 1173.58,
        "end": 1177.9399999999998
    },
    {
        "text": " la unicidad sale por justamente porque suma directa y además fíjense que para calcular",
        "start": 1177.94,
        "end": 1195.3
    },
    {
        "text": " v s y el consecuencia del otro porque en fin quedas v menos v s para calcular v s",
        "start": 1195.3,
        "end": 1207.8600000000001
    },
    {
        "text": " usamos una base ortonormal, base ortonormal de s, ahora la pregunta es, ¿qué pasa si usamos",
        "start": 1207.86,
        "end": 1223.1
    },
    {
        "text": " otra base ortonormal? O sea para calcular v se usamos una base ortonormal y definimos v sub s",
        "start": 1223.1,
        "end": 1228.58
    },
    {
        "text": " justamente como esto que teníamos escrito hay que borrer, la pregunta es ¿qué pasa si usó otra base",
        "start": 1228.58,
        "end": 1239.58
    },
    {
        "text": " ortonormal y hago la cuenta equivalente? Fíjense ¿qué pasa si usamos otra base ortonormal?",
        "start": 1239.58,
        "end": 1247.6999999999998
    },
    {
        "text": " Pongamos de nombre a esto si quieren si usamos otra base ortonormal es un hotil de s",
        "start": 1258.4199999999998,
        "end": 1263.58
    },
    {
        "text": " 2 tilde, ese hotil de que sea una base ortonormal, ustedes ya saben que la base ortonormal no es",
        "start": 1263.58,
        "end": 1274.3799999999999
    },
    {
        "text": " única, ¿no? Pueble aquí en general infinidad de base ortonormal, no sé que sea un espacio de",
        "start": 1274.3799999999999,
        "end": 1280.6599999999999
    },
    {
        "text": " dimensión 1, entonces si usamos otra base ortonormal e hiciera la muy más cuenta tendría",
        "start": 1280.6599999999999,
        "end": 1288.58
    },
    {
        "text": " un vector que le llamaríamos v sub s tilde que también está en s que lo calculo así,",
        "start": 1288.58,
        "end": 1301.1
    },
    {
        "text": " hago el producto interno de v con cada elemento de esa base y multiplico por cada elemento",
        "start": 1301.1,
        "end": 1307.82
    },
    {
        "text": " de esa base y sumo desde 1 hasta acá o sea si usaba otra base s tilde en principio tendría",
        "start": 1307.82,
        "end": 1314.4199999999998
    },
    {
        "text": " otro vector de este v s tilde que lo calculo porque este cálculo depende de la base que",
        "start": 1315.42,
        "end": 1321.14
    },
    {
        "text": " estoy usando en principio, se entiende? Ahora, ¿y haría la cuenta de esta base?",
        "start": 1321.14,
        "end": 1329.38
    },
    {
        "text": " tendría este nuevo vector v s tilde y tendríamos que el vector v se podría escribir como v s tilde",
        "start": 1329.38,
        "end": 1338.18
    },
    {
        "text": " más v menos v s tilde que le llamamos para simplificar v s tilde en el complemento ortonormal,",
        "start": 1338.18,
        "end": 1344.94
    },
    {
        "text": " o sea esto acá está en s y esto acá está en el complemento ortonormal, si yo podría repetir",
        "start": 1344.94,
        "end": 1354.8600000000001
    },
    {
        "text": " la misma argumento que hice la sient usando otra base, eso me daría en principio un vector que",
        "start": 1354.8600000000001,
        "end": 1359.9
    },
    {
        "text": " le llamó v s tilde y tendría la misma descomposición, v lo escribo como v s tilde más v menos v s tilde",
        "start": 1359.9,
        "end": 1366.5
    },
    {
        "text": " que lo que está puesto acá, pero ahora ¿qué pasa? como una descomposición es única necesariamente",
        "start": 1366.5,
        "end": 1374.06
    },
    {
        "text": " esto acá tiene que ser igual a esto acá y esto otro acá tiene que ser igual a esto otro acá",
        "start": 1374.06,
        "end": 1384.74
    },
    {
        "text": " es decir fíjense que cosa rara es decir que esta componente que está en s no depende de la base",
        "start": 1384.74,
        "end": 1392.82
    },
    {
        "text": " que estoy eligiendo si usted me dan una base ortonormal y yo la cuenta y me construy este vector y",
        "start": 1392.82,
        "end": 1399.1399999999999
    },
    {
        "text": " me dan otra base ortonormal y yo la misma cuenta el resultado final es el mismo aunque cambia la base",
        "start": 1399.1399999999999,
        "end": 1404.3799999999999
    },
    {
        "text": " ortonormal se entendió no depende de la base ortonormal y de la x, entonces vamos a escribir acá",
        "start": 1404.38,
        "end": 1412.5
    },
    {
        "text": " como la descomposición es única tenemos necesariamente que la cuenta usando la base original y la",
        "start": 1412.5,
        "end": 1439.9
    },
    {
        "text": " cuenta usando la base nueva me da lo mismo y lo mismo para lo que corresponde al complemento ortobonal",
        "start": 1439.9,
        "end": 1445.7800000000002
    },
    {
        "text": " en definitiva v su v no depende de la base elegida de la base ortonormal elegida",
        "start": 1449.6200000000001,
        "end": 1463.3400000000001
    },
    {
        "text": " para calcularlo siempre y cuando sea una base ortonormal no agarre una base cualquiera tiene que ser",
        "start": 1463.34,
        "end": 1474.1799999999998
    },
    {
        "text": " bases ortonormales se entendió eso bien y entonces eso me permite en primer lugar calcular esto",
        "start": 1474.1799999999998,
        "end": 1486.9399999999998
    },
    {
        "text": " independientemente de la base e interpretar esto le vamos a interpretar geometricamente pues ya",
        "start": 1486.9399999999998,
        "end": 1492.5
    },
    {
        "text": " uno depende de la base que uso para calcularlo como la proyección ortonormal de un vector sobre un sub espacio",
        "start": 1492.5,
        "end": 1499.5
    },
    {
        "text": " ok no esto es una observación que se desprende del resultado que vimos de hecho que la",
        "start": 1499.5,
        "end": 1511.98
    },
    {
        "text": " descomposición sea única si yo uso otra base acá tendría un vector tilde y acá tendría un vector tilde pero",
        "start": 1511.98,
        "end": 1518.3
    },
    {
        "text": " como las composiciones únicas esos objectores tienen ese lo mismo esto no depende de la base que",
        "start": 1518.3,
        "end": 1522.86
    },
    {
        "text": " yo uso para calcular si por ejemplo si si si pues pensas que por ejemplo en dimensión 3 con el",
        "start": 1522.86,
        "end": 1532.46
    },
    {
        "text": " producto interno usual la base canónica una base ortonormal y cualquier rotación rígida de eso",
        "start": 1532.46,
        "end": 1538.1399999999999
    },
    {
        "text": " también es una base ortonormal entonces también se intercambio los elementos también una base",
        "start": 1538.1399999999999,
        "end": 1545.3799999999999
    },
    {
        "text": " ortonormal entonces en definitiva es multiplicado por menos ura hay un montón de base ortonormal",
        "start": 1545.38,
        "end": 1549.7800000000002
    },
    {
        "text": " hay infinitas base ortonormales entonces cualquier base ortonormal que yo uso me da el mismo resultado",
        "start": 1549.7800000000002,
        "end": 1555.94
    },
    {
        "text": " entonces esto me permite definir independientemente de la base que uno usa para calcularlo me permite",
        "start": 1558.5800000000002,
        "end": 1566.38
    },
    {
        "text": " definir a este vector que tiene un significado geometrico bien claro como la proyección ortogonal",
        "start": 1566.38,
        "end": 1572.14
    },
    {
        "text": " del vector B sobre su espacio S entonces de finición",
        "start": 1572.14,
        "end": 1577.6200000000001
    },
    {
        "text": " ok",
        "start": 1632.14,
        "end": 1656.98
    },
    {
        "text": " Entonces, esto nos permite definir la definición ortogonal, dado un vector cualquiera, el vector",
        "start": 1656.98,
        "end": 1666.22
    },
    {
        "text": " b su bs que yo construyo calculándolo usando una base ortonomal cualquiera, eso se llama",
        "start": 1666.22,
        "end": 1672.46
    },
    {
        "text": " la proyección ortogonal db sobre su espacio s y se denota así, es una p gran de la",
        "start": 1672.46,
        "end": 1684.14
    },
    {
        "text": " proyección sobre ese del vector b que justamente el b su bs que calculamos usando una base",
        "start": 1684.14,
        "end": 1690.22
    },
    {
        "text": " ortonomal y esto no depende de la base ortonomal usada para que acumule. Es algo geométrico,",
        "start": 1690.22,
        "end": 1695.6200000000001
    },
    {
        "text": " no depende de la base que yo use. Y ahora vamos a ver un par de observaciones. Entonces,",
        "start": 1695.6200000000001,
        "end": 1709.94
    },
    {
        "text": " si lo hacía en un dibujito, supongamos que yo estoy trabajando para hacer un dibujo,",
        "start": 1709.94,
        "end": 1713.18
    },
    {
        "text": " imagínen un plano, estoy en R3 y tengo un plano, eso es ese, el plano que pasa por el",
        "start": 1713.18,
        "end": 1719.18
    },
    {
        "text": " origen, el complemento ortogonal será una recta, puede decir que será algo que sumado",
        "start": 1719.18,
        "end": 1725.1000000000001
    },
    {
        "text": " a s me complete R3, estoy haciendo un dibujito para visualizar esto. Y yo tengo un vector",
        "start": 1725.1000000000001,
        "end": 1731.5800000000002
    },
    {
        "text": " b por acá y lo estoy descomponiendo en dos partes, una parte que está acá abajo, que es",
        "start": 1731.58,
        "end": 1741.74
    },
    {
        "text": " lo que llamamos b su bs y una parte que está arriba, o sea algo que está en este espacio",
        "start": 1741.74,
        "end": 1747.1399999999999
    },
    {
        "text": " b y algo que está en el complemento ortogonal db. A esto es lo que le llamamos b su bs que",
        "start": 1747.1399999999999,
        "end": 1755.6599999999999
    },
    {
        "text": " justamente el cánculo no depende de la base que estoy usando acá y esto es justamente",
        "start": 1755.6599999999999,
        "end": 1760.22
    },
    {
        "text": " la proyección ortogonal db sobre ese. Estamos, ya vamos a interpretar más precisamente",
        "start": 1760.22,
        "end": 1771.54
    },
    {
        "text": " todavía eso. Y esto es el que queda acá arriba, ¿qué será? Esto es que queda acá arriba.",
        "start": 1771.54,
        "end": 1779.38
    },
    {
        "text": " Ya vamos a terminar de hacer raza idea, pero esto sería la proyección sobre el complemento",
        "start": 1779.38,
        "end": 1782.3
    },
    {
        "text": " ortogonal. Esto sería la proyección db sobre el complemento ortogonal. O sea, que",
        "start": 1782.3,
        "end": 1788.6000000000001
    },
    {
        "text": " bien lo estoy descomponiendo como suma de dos cosas, uno que es la proyección sobre ese",
        "start": 1788.6,
        "end": 1793.12
    },
    {
        "text": " y otra que es la proyección ortogonal sobre el complemento ortogonal. Todas estas construcciones",
        "start": 1793.12,
        "end": 1798.76
    },
    {
        "text": " dependen del producto interno, eso sí. Usted me camin el producto interno y la noción",
        "start": 1798.76,
        "end": 1803.1
    },
    {
        "text": " ortogonal y acá en día. Entonces, observaciones que ya hemos visto y otras más. Primera",
        "start": 1803.1,
        "end": 1820.9399999999998
    },
    {
        "text": " observación que le acabo de contar, la definición de proyección ortogonal no depende de la",
        "start": 1820.9399999999998,
        "end": 1824.84
    },
    {
        "text": " base elegida. Eso graven se lo confuego. No depende de la base elegida para calcularla,",
        "start": 1824.84,
        "end": 1847.04
    },
    {
        "text": " la base elegida para calcularla. Siempre y cuando obviamente sea una base ortonomal,",
        "start": 1847.04,
        "end": 1856.44
    },
    {
        "text": " ¿no? Si usan una base que no sea ortonomal, le va a dar cualquier cosa. Segunda observación,",
        "start": 1856.44,
        "end": 1865.44
    },
    {
        "text": " esto ya lo vimos recién. Si yo ahora hiciera la proyección sobre el complemento ortogonal",
        "start": 1865.44,
        "end": 1871.24
    },
    {
        "text": " para terminar de hacer la idea que les comenté acá. Si yo hiciera, quisiera calcular la proyección",
        "start": 1871.24,
        "end": 1885.24
    },
    {
        "text": " ortogonal sobre el complemento ortogonal que tendría que hacer. Tendría que agarrarme una base",
        "start": 1885.24,
        "end": 1890.06
    },
    {
        "text": " ortonomal en ese ortogonal y hacer la cuenta ahí con esa base, la cuenta equivalente",
        "start": 1890.06,
        "end": 1895.84
    },
    {
        "text": " al que hicimos recién. Bien y ahí tendríamos que el vector B se puede escribir como la suma",
        "start": 1895.84,
        "end": 1904.3999999999999
    },
    {
        "text": " de algo que está en el complemento ortogonal más la suma, esto queda horrible de escribirlo,",
        "start": 1904.3999999999999,
        "end": 1919.6
    },
    {
        "text": " de algo que está en el complemento ortogonal de el complemento ortogonal. Ahora vamos",
        "start": 1919.6,
        "end": 1924.9599999999998
    },
    {
        "text": " a ver cómo su espacio es ortogonal. Entonces hago la misma construcción. Me construy una base",
        "start": 1924.96,
        "end": 1930.52
    },
    {
        "text": " ortogonal en ese ortogonal, calculo esto que está en ese conjunto y ahora le sumo algo que",
        "start": 1930.52,
        "end": 1937.32
    },
    {
        "text": " está en el complemento de ese conjunto, el complemento ortogonal de el complemento ortogonal.",
        "start": 1937.32,
        "end": 1941.96
    },
    {
        "text": " Bueno, no es muy difícil convencerse y esto es más, está en el práctico, el complemento",
        "start": 1941.96,
        "end": 1948.8
    },
    {
        "text": " ortogonal de un complemento ortogonal cuando es en un subespacio es el propio S, porque",
        "start": 1948.8,
        "end": 1954.0
    },
    {
        "text": " todos los vectores, ese ortogonal son todos los vectores que son ortogonales a este,",
        "start": 1954.0,
        "end": 1964.28
    },
    {
        "text": " por lo tanto todos los vectores que son ortogonales a este son estos. Ojo cuando es su espacio,",
        "start": 1964.28,
        "end": 1970.12
    },
    {
        "text": " si no su espacio, no porque esto es un conjunto cualquiera, esto es un subespacio, si consigue",
        "start": 1970.12,
        "end": 1975.04
    },
    {
        "text": " el complemento de esto es un subespacio. Ojo con esto, estamos hablando del caso de",
        "start": 1975.04,
        "end": 1981.84
    },
    {
        "text": " que este espacio partía sea un subespacio tutorial. Entonces esto acá, el complemento",
        "start": 1981.84,
        "end": 1990.04
    },
    {
        "text": " ortogonal de el complemento ortogonal es S, este no nos ejercido los prácticos y los",
        "start": 1990.04,
        "end": 1994.2
    },
    {
        "text": " dejo como dije, para que se convenzan es bien intuitivo y entonces fíjense que estamos",
        "start": 1994.2,
        "end": 1999.24
    },
    {
        "text": " escribiendo la suma, como es lo que está en S y algo que está en el complemento",
        "start": 1999.24,
        "end": 2011.6
    },
    {
        "text": " ortogonal, pero como la descomposición es única lo que está en S es V sub S, estamos, no",
        "start": 2011.6,
        "end": 2022.96
    },
    {
        "text": " sé si la estoy embarrando con esto, pero esto sería entonces, esto sería igual, A, B, S,",
        "start": 2022.96,
        "end": 2028.48
    },
    {
        "text": " más, más V sub S y esto justamente es la proyección ortogonal sobre S más, más la proyección",
        "start": 2028.48,
        "end": 2037.04
    },
    {
        "text": " ortogonal sobre S, D, o sea que en definitiva lo que tiene a lo que viene acá es efectivamente",
        "start": 2037.04,
        "end": 2045.88
    },
    {
        "text": " el complemento es V menos lo que viene acá, la embarre me parece acá, algo que está",
        "start": 2045.88,
        "end": 2056.2400000000002
    },
    {
        "text": " en intuitivo, insisto a Garros y proyectar a sobre S y ortogonal, área de misma cuenta,",
        "start": 2056.2400000000002,
        "end": 2061.7200000000003
    },
    {
        "text": " solo que estaría usando una base de sortogonal, A, B lo puedo escribir como la suma de eso,",
        "start": 2061.7200000000003,
        "end": 2066.6400000000003
    },
    {
        "text": " más la suma es todo otro que está en el complemento ortogonal de complemento ortogonal,",
        "start": 2066.6400000000003,
        "end": 2069.7200000000003
    },
    {
        "text": " que es S y como ya tengo una descomposición de B como algo que está en S más algo que",
        "start": 2069.7200000000003,
        "end": 2074.08
    },
    {
        "text": " está en S y ortogonal, que es la que veíamos al principio, entonces necesariamente esto",
        "start": 2074.08,
        "end": 2079.24
    },
    {
        "text": " que viene acá es justamente la proyección ortogonal sobre S, entonces esto sería la proyección",
        "start": 2079.24,
        "end": 2085.16
    },
    {
        "text": " ortogonal sobre el comprometo ortogonal y esto sería la proyección ortogonal sobre S,",
        "start": 2085.16,
        "end": 2090.0
    },
    {
        "text": " en definitiva si yo tengo una calcula a otra haciendo B, no es la que tengo calculada,",
        "start": 2090.0,
        "end": 2098.08
    },
    {
        "text": " y la última cosa, la última observación, y vamos a un par de ejemplos,",
        "start": 2098.08,
        "end": 2110.84
    },
    {
        "text": " y la última observación es que la vamos a escribir acá, esto creo que está en uno de los",
        "start": 2128.08,
        "end": 2145.56
    },
    {
        "text": " prácticos por el trivial de probar, si ahora esto lo veo como una función que me agarró",
        "start": 2145.56,
        "end": 2150.56
    },
    {
        "text": " un vector y me da otro vector, esto es una función del espacio vectorial en sí mismo,",
        "start": 2150.56,
        "end": 2155.48
    },
    {
        "text": " entonces S p es que va a de B en B, es un operador lineal, se comporta de manera",
        "start": 2156.2,
        "end": 2164.2400000000002
    },
    {
        "text": " lineal con respecto a B y eso sale la propiedad del Producto Interno, si acá yo pongo la suma",
        "start": 2164.2400000000002,
        "end": 2169.96
    },
    {
        "text": " de B más un doble B se descompone en la suma de la dos partes, lo mismo si multiplico por un",
        "start": 2169.96,
        "end": 2173.96
    },
    {
        "text": " escalado, así o sea que efectivamente esto acá es un operador lineal,",
        "start": 2173.96,
        "end": 2178.56
    },
    {
        "text": " quiero estudiaremos bastante en la segunda parte del curso, en la segunda parte del curso vamos a",
        "start": 2186.36,
        "end": 2190.64
    },
    {
        "text": " trabajar un montón con estas cosas, con estos operadores proyección, pero eso no",
        "start": 2190.64,
        "end": 2196.0
    },
    {
        "text": " opera un lineal, usted me dan un vector y esto me da otro vector y actual niñalmente en el",
        "start": 2196.0,
        "end": 2202.72
    },
    {
        "text": " B justamente porque el Producto Interno es la primera componente de la línea, bueno entonces vamos",
        "start": 2202.72,
        "end": 2208.44
    },
    {
        "text": " a hacer una cosa, vamos a hacer un par de ejemplos, que esto tiene que dar bien claro para el",
        "start": 2208.44,
        "end": 2214.2400000000002
    },
    {
        "text": " parcial y un teorema final que termina a serrala interpretación geométrica de la proyección,",
        "start": 2214.24,
        "end": 2220.7599999999998
    },
    {
        "text": " me voy adelantando, hay preguntas, ¿cómo estamos con la obra?",
        "start": 2222.7599999999998,
        "end": 2228.68
    },
    {
        "text": " Media clase adaptamos no sobre el tiempo, excelente.",
        "start": 2230.4399999999996,
        "end": 2233.16
    },
    {
        "text": " Una cosa, me voy adelantando algo que les voy a comentar un ratito, ¿qué particularidad",
        "start": 2233.16,
        "end": 2248.24
    },
    {
        "text": " tiene este vector que se llama la proyección ortogonal de un vector B? Tiene la siguiente particularidad,",
        "start": 2248.24,
        "end": 2254.3999999999996
    },
    {
        "text": " ¿qué es el vector en el espacio S que más se parece? digo esto entre comillas al vector B,",
        "start": 2254.3999999999996,
        "end": 2261.56
    },
    {
        "text": " más se parece en el sentido que está lo más cerca posible de este vector B, porque fíjense",
        "start": 2261.56,
        "end": 2266.92
    },
    {
        "text": " interpretando como nación de distancia la diferencia que hay entre un vector y el otro, fíjense",
        "start": 2266.92,
        "end": 2272.92
    },
    {
        "text": " que si yo agarrara otro vector acá en S, este acá la distancia que habría entre este y el B",
        "start": 2272.92,
        "end": 2279.48
    },
    {
        "text": " sería mayor que le cae en este yeste, eso lo vamos a probar al final, la idea es que la idea",
        "start": 2279.48,
        "end": 2286.2799999999997
    },
    {
        "text": " intuitiva de todo esto es que la proyección ortogonal son un subespacio S, es el vector del espacio S",
        "start": 2286.28,
        "end": 2293.52
    },
    {
        "text": " que más se parece al vector B para cada vector B, ¿qué es la idea? Esa idea se usa muchísimo,",
        "start": 2293.52,
        "end": 2301.36
    },
    {
        "text": " estoy viendo dentro de un subespacio, ¿qué cuál es el elemento que más se parece a un",
        "start": 2301.36,
        "end": 2309.7200000000003
    },
    {
        "text": " elemento del espacio general? Obviamente digo si yo estoy, si el B en el caso particular de que",
        "start": 2309.72,
        "end": 2318.04
    },
    {
        "text": " B estén en conjunto S, ¿qué me da la proyección ortogonal? Me da el propio B, estamos porque en ese",
        "start": 2318.04,
        "end": 2325.7599999999998
    },
    {
        "text": " caso si B está en S entonces a B lo puedo escribir como B más 0, esto tiene S y esto tiene",
        "start": 2325.7599999999998,
        "end": 2334.08
    },
    {
        "text": " S ortogonal, o sea que la proyección ortogonal de B sobre el S, si B está en S coincide con el propio B,",
        "start": 2334.08,
        "end": 2340.12
    },
    {
        "text": " pero si no es TNS, el que está en S es la próxima ortogonal de Máneres, el elemento acá en este subespacio",
        "start": 2341.46,
        "end": 2347.08
    },
    {
        "text": " que está lo más cerca posible del B, bien eso lo vamos a terminar de establecer de manera",
        "start": 2347.08,
        "end": 2353.4
    },
    {
        "text": " presícil un rato, entonces vemos un par de ejemplos, uno con polinomios y otro con E o",
        "start": 2353.4,
        "end": 2361.84
    },
    {
        "text": " N R3, uno, vamos a considerar como B el conjunto de los polinomios de grado es menor igual que 2,",
        "start": 2361.84,
        "end": 2373.84
    },
    {
        "text": " que lo denotamos así, polinomios reales, eso es un espacio vectorial,",
        "start": 2373.84,
        "end": 2390.4
    },
    {
        "text": " la dimensión de ese espacio vectorial es 3, ustedes ya saben eso y vamos a considerar el producto",
        "start": 2392.84,
        "end": 2397.52
    },
    {
        "text": " interno siguiente, el producto interno, a infinidad de manera define un producto interno en este",
        "start": 2397.52,
        "end": 2407.56
    },
    {
        "text": " conjunto pero vamos a considerar el siguiente producto interno que me agarrará 2 polinomios,",
        "start": 2407.56,
        "end": 2411.84
    },
    {
        "text": " PQ y me calcula la interna entre menos 1 y 1 del producto, esto es un producto interno, si",
        "start": 2411.84,
        "end": 2423.1200000000003
    },
    {
        "text": " yo interna entre 0 y 1 también es un producto interno, nosotros es un producto interno diferente y",
        "start": 2423.1200000000003,
        "end": 2427.32
    },
    {
        "text": " a infinidad de manera define un producto interno ahí, pero no vamos a quedar con este, tengo un",
        "start": 2427.32,
        "end": 2431.4
    },
    {
        "text": " espacio vectorial de dimensión 3 con un producto interno y como su espacio es, vamos a calcular,",
        "start": 2431.4,
        "end": 2439.8
    },
    {
        "text": " vamos a concentrarmos en los polinomios que son de la forma t cuadrado, es decir el espacio",
        "start": 2439.8,
        "end": 2446.32
    },
    {
        "text": " generado por ese monómic, ahí t al cuadrado, los polinomios de grado manera del K2, que son exactamente",
        "start": 2446.32,
        "end": 2455.84
    },
    {
        "text": " son monómios cuadraticos digamos, los múltiples de esto, esto acá es un espacio dimension 1 y yo",
        "start": 2457.84,
        "end": 2466.1200000000003
    },
    {
        "text": " lo que quiero calcular es para cualquier polinomio o para un polinomio particular cuya es la protección",
        "start": 2466.12,
        "end": 2472.24
    },
    {
        "text": " sobre este su espacio, entonces la pregunta es el asunto de siguiente, yo les voy a decir el siguiente",
        "start": 2472.24,
        "end": 2484.2799999999997
    },
    {
        "text": " polinomio, esta este ejemplo lo hice anoche y si salta una error me dicen",
        "start": 2484.2799999999997,
        "end": 2495.72
    },
    {
        "text": " consideremos el polinomio 1mt, ese es el polinomio, un polinomio cualquiera fijo y yo lo que quiero",
        "start": 2496.64,
        "end": 2504.3199999999997
    },
    {
        "text": " calcular es la protección P maju, uscula le vamos a llamar para no confundir con esta P",
        "start": 2504.3199999999997,
        "end": 2513.8399999999997
    },
    {
        "text": " del polinomio sobre su espacio S de ese polinomio, esto, perdón en vez, eso es lo que quiero hacer",
        "start": 2513.84,
        "end": 2529.08
    },
    {
        "text": " repito tengo espacio vectorial los polinomios mebrados menor igual que 2, polinomios reales,",
        "start": 2533.2000000000003,
        "end": 2537.7200000000003
    },
    {
        "text": " producto interno este, su espacio este que tiene dimension 1 los múltiples de T cuadrado, ahora",
        "start": 2537.72,
        "end": 2546.16
    },
    {
        "text": " conciera un polinomio que está en este su espacio este por ejemplo 1mt y quiero calcular la",
        "start": 2546.16,
        "end": 2550.8399999999997
    },
    {
        "text": " protección ortogonal de ese polinomio sobre este su espacio, dicho en otras palabras quiero",
        "start": 2550.8399999999997,
        "end": 2560.3199999999997
    },
    {
        "text": " calcular lo que les comentaba recién, cuáles el polinomio de esta forma que se parece lo más",
        "start": 2560.3199999999997,
        "end": 2566.9599999999996
    },
    {
        "text": " posible a este, donde se parezca, quiere decir que entre menos 1 y 1 son los más cercanos",
        "start": 2566.96,
        "end": 2573.28
    },
    {
        "text": " posible por la norma y por la distancia inducida por la protección interno, eso ya va a quedar",
        "start": 2573.28,
        "end": 2584.48
    },
    {
        "text": " claro un ratito, entonces, ¿qué tengo que hacer para calcular eso?",
        "start": 2584.48,
        "end": 2591.48
    },
    {
        "text": " primero tengo que considerar una base ortogonal de ese, justamente lo elegí dimension 1 por",
        "start": 2598.04,
        "end": 2603.96
    },
    {
        "text": " no ser muchas cuentas, pero puede ser que nos parezcan dimensiones más grandes, entonces",
        "start": 2603.96,
        "end": 2609.48
    },
    {
        "text": " hay que usar grames mil para construir la base ortogonal a partir de una base cualquier,",
        "start": 2609.48,
        "end": 2613.92
    },
    {
        "text": " bien entonces una base ortogonal de ese es todos los elementos de ese son un múltiplo",
        "start": 2613.92,
        "end": 2620.92
    },
    {
        "text": " de este, ahora tengo que elegir el múltiplo el escalar que estoy poniendo ahí de tal manera",
        "start": 2620.92,
        "end": 2633.72
    },
    {
        "text": " es que la norma se iguala 1, la norma calcula así, bueno entonces lo que sale cuando uno",
        "start": 2633.72,
        "end": 2639.04
    },
    {
        "text": " se sacuenta es que un polinomio ortogonal es la base que tiene un único elemento porque",
        "start": 2639.04,
        "end": 2652.3799999999997
    },
    {
        "text": " estamos trabajando en dimension 1 y ese elemento es justamente el, quiero ver la manera más",
        "start": 2652.3799999999997,
        "end": 2659.66
    },
    {
        "text": " fácil de escribir esto. Estamos, este polinomio, ¿por qué sale ese raí de 5 sobre 2 ahí?",
        "start": 2659.66,
        "end": 2678.66
    },
    {
        "text": " porque de todos los polinomios que son un múltiplo de este, este es una espacio de",
        "start": 2678.66,
        "end": 2683.2599999999998
    },
    {
        "text": " dimension 1, es el que tiene norma 1, si uno se la cuenta, hagan la a usted, si uno calcula",
        "start": 2683.26,
        "end": 2689.82
    },
    {
        "text": " el propio interno de P1 consigo mismo justamente que es la norma de P1 al cuadrado, usando esta,",
        "start": 2689.82,
        "end": 2702.98
    },
    {
        "text": " este propio interno a la gara empongan P1, P1 multiplique en la gana integral y vean que",
        "start": 2702.98,
        "end": 2708.78
    },
    {
        "text": " efectivamente me da 1 si pongo esa constante. Eso es un abaseo ortogonal mal del espacio",
        "start": 2708.78,
        "end": 2718.0600000000004
    },
    {
        "text": " que estamos trabajando, está claro eso, miren, como haría uno en la práctica, uno dice",
        "start": 2718.0600000000004,
        "end": 2723.7000000000003
    },
    {
        "text": " bueno a garros, esto es un espacio de dimension 1, o sea que una base será la forma una constante",
        "start": 2723.7000000000003,
        "end": 2729.38
    },
    {
        "text": " alpha por T cuadrado, como elijo de la constante alpha, le alijo de tal manera que este integral",
        "start": 2729.38,
        "end": 2734.82
    },
    {
        "text": " me de 1, la integral de eso consigo mismo, la integral de eso consigo mismo es menos",
        "start": 2734.82,
        "end": 2741.54
    },
    {
        "text": " 1 o 1, alpha cuadrado, T cuadrado por T cuadrado, o que esté a la cuarta de T, que es integral,",
        "start": 2741.54,
        "end": 2749.86
    },
    {
        "text": " sea la quinta sobre 5, evalué en 1, menos evalué en menos 1, daí me sale un 2 y esto tiene",
        "start": 2749.86,
        "end": 2756.94
    },
    {
        "text": " que ser igual a 1, de ahí me sale la constante igual a 5, se lo ha habido. Bueno eso es",
        "start": 2756.94,
        "end": 2765.7000000000003
    },
    {
        "text": " una base ortogonal, entonces lo que ahora tengo que hacer lo siguiente, yo tengo el polinomio,",
        "start": 2765.7000000000003,
        "end": 2770.82
    },
    {
        "text": " aquel, el polinomio del cual le quiero calcular la base la proyección ortogonal y lo que",
        "start": 2770.82,
        "end": 2780.14
    },
    {
        "text": " tengo que hacer lo siguiente, la proyección ortogonal sobre ese, de ese polinomio como tengo",
        "start": 2780.14,
        "end": 2792.02
    },
    {
        "text": " un espacio de dimension 1 será el producto interno, de P con el elemento de la base ortogonal",
        "start": 2792.02,
        "end": 2797.8799999999997
    },
    {
        "text": " ortogonal por P 1 y esto es una función de, esto es una constante y esto es una función",
        "start": 2797.88,
        "end": 2807.36
    },
    {
        "text": " de T, ese es el polinomio. Si, quién tiene ganas esa porquería de cuenta ahí, qué pocas",
        "start": 2807.36,
        "end": 2817.76
    },
    {
        "text": " ganas de cuenta que tengo, yo ya se me quemos la cabeza haciendo las cuentas, mira.",
        "start": 2817.76,
        "end": 2827.48
    },
    {
        "text": " A ver cuánto me da, esto lo van a tener que hacer en el parcial cosas por el estilo, así",
        "start": 2827.48,
        "end": 2835.08
    },
    {
        "text": " que más vale que estén asojados con eso. ¿Qué lo que me da el producto interno de P con",
        "start": 2835.08,
        "end": 2842.64
    },
    {
        "text": " P 1? Me da, por la definición del producto interno me da la integral entre menos 1 y 1, del",
        "start": 2842.64,
        "end": 2854.44
    },
    {
        "text": " polinomio P que estoy considerando que es el 1 más T, por el P 1 la base ortogonal normal,",
        "start": 2854.44,
        "end": 2866.84
    },
    {
        "text": " el primer y único elemento tiene la base ortogonal que es Ray de 5 medios, T adcuadrado,",
        "start": 2866.84,
        "end": 2874.04
    },
    {
        "text": " todo esto interrado con respecto a T. ¿Qué me da eso? Eso me da, esto me da, cuando multiplico",
        "start": 2875.04,
        "end": 2889.52
    },
    {
        "text": " por 1 y a lo interal me queda Ray de 5 medios y la integral de T adcuadrado que está al cubo",
        "start": 2889.52,
        "end": 2897.12
    },
    {
        "text": " sobre 3, he valo en 1 y en menos en menos 1, o sea que me va a quedar 2 sobre 3 y la otra",
        "start": 2897.12,
        "end": 2906.8399999999997
    },
    {
        "text": " parte me va a quedar interal de T adcuadro que como está entre menos 1 y 1 me da 0.",
        "start": 2906.8399999999997,
        "end": 2910.52
    },
    {
        "text": " Si entres en dios, bueno se cuenta, la grande a ustedes, cuando desarrolla acá la T adcuadrado me da",
        "start": 2917.24,
        "end": 2923.16
    },
    {
        "text": " un T adcuo sobre 3, he valo en 1 y en menos 1 y me salió un 2 y esta es la constante que sale y cuando hago",
        "start": 2923.16,
        "end": 2929.7999999999997
    },
    {
        "text": " la integral de T adcuo como entre menos 1 y 1 me da 0, por eso ojo con los límites que pongo en",
        "start": 2929.7999999999997,
        "end": 2934.3199999999997
    },
    {
        "text": " el producto interno, si fuera en 3 y 1 me da otra cosa, estas cosas dependen del producto interno.",
        "start": 2934.3199999999997,
        "end": 2939.6
    },
    {
        "text": " Entonces tengo ahí que producto interno me da ese numerito, lo voy a dejar así escrito a lo",
        "start": 2939.6,
        "end": 2949.0
    },
    {
        "text": " de esta. Y eso es multiplicado por el elemento P1 de T de la base. No es capricho que acá",
        "start": 2949.0,
        "end": 2971.24
    },
    {
        "text": " parezca la misma constante de esa aparece acá, no? Pues está en P1 y está ahí, por lo",
        "start": 2971.24,
        "end": 2976.36
    },
    {
        "text": " que está así en esas raíces cuadradas se terminan transformando en cosas que no están al",
        "start": 2976.36,
        "end": 2981.6400000000003
    },
    {
        "text": " cuadrado, así que me queda esa cantidad y esto es exactamente 5 divididos, el 12 va con este,",
        "start": 2981.6400000000003,
        "end": 2990.88
    },
    {
        "text": " me queda 5 tercios T cuadrados. O sea como les decía recién, este polinomio, este polinomio que",
        "start": 2990.88,
        "end": 3001.6
    },
    {
        "text": " está acá dentro, pues es un múltiplo T cuadrado, es en una manera que precisaremos en un",
        "start": 3001.6,
        "end": 3007.36
    },
    {
        "text": " rato el polinomio que más se parece a este otro en el intervalo menos 1 y 1.",
        "start": 3007.36,
        "end": 3012.96
    },
    {
        "text": " Sentan, digo eso, esto es cuenta fuerza bruta, ¿no? Que estén aquí decir esto, como el producto",
        "start": 3012.96,
        "end": 3036.12
    },
    {
        "text": " interno involucra solamente lo que pasa entre menos 1 y 1 y no depende del resto, me concentro",
        "start": 3036.12,
        "end": 3041.12
    },
    {
        "text": " menos 1 y 1. Ahora está muy bien la pregunta porque yo estoy entre menos 1 y 1, entre menos",
        "start": 3041.12,
        "end": 3051.4
    },
    {
        "text": " 1 y 1, tratemos de hacer acá esta teno, entre menos 1 y 1 el polinomio que estoy considerando",
        "start": 3051.4,
        "end": 3061.7599999999998
    },
    {
        "text": " es 1 más T, que esa es una recta que menos 1 vale 0 y ente vale 2, o sea esto es algo que va",
        "start": 3061.7599999999998,
        "end": 3068.44
    },
    {
        "text": " desde 0, así es, pongamos acá esta el 2, sí, ese es el polinomio P, me concentro solamente",
        "start": 3068.44,
        "end": 3078.04
    },
    {
        "text": " menos 1 y 1, porque ahí estoy haciendo las cuentas. Y el otro es un múltiplo de una",
        "start": 3078.04,
        "end": 3083.28
    },
    {
        "text": " de una parábola T cuadrado, o sea es una parábola que tiene el mínimo en el origen que es 0 y",
        "start": 3083.28,
        "end": 3089.8
    },
    {
        "text": " después será una constante que me regula esto, ¿no? Me regula que es yo diferente, es constante,",
        "start": 3089.8,
        "end": 3097.2400000000002
    },
    {
        "text": " me van a dar si se abre un poco más o poco menos. Entonces el producto interno está",
        "start": 3097.24,
        "end": 3103.2
    },
    {
        "text": " considerado, estamos poniendo el producto interno está saldo a dos cosas, ahora ¿qué quiere",
        "start": 3103.2,
        "end": 3111.9199999999996
    },
    {
        "text": " decir distancia? Y este producto interno me define una norma y la norma me define una distancia,",
        "start": 3111.9199999999996,
        "end": 3118.3199999999997
    },
    {
        "text": " la distancia está definido como la distancia entre los puntos digamos, entre P y Q podría",
        "start": 3118.3199999999997,
        "end": 3125.14
    },
    {
        "text": " pensar yo que es la norma de P menos Q, por ejemplo. Entonces decir que la distancia sea",
        "start": 3125.14,
        "end": 3132.62
    },
    {
        "text": " lo más chico posible, quiere decir que la norma sea lo más chico posible y la norma",
        "start": 3132.62,
        "end": 3138.02
    },
    {
        "text": " ahí tiene que ver con la norma la diferencia, la norma no tiene que ver alguna manera,",
        "start": 3138.02,
        "end": 3143.54
    },
    {
        "text": " no es exactamente la área, pero tiene que ver con la distancia con esto, con lo que queda",
        "start": 3143.54,
        "end": 3148.7
    },
    {
        "text": " entre las dos cosas, porque lo que estamos haciendo es elevando la diferencia el cuadrado,",
        "start": 3148.7,
        "end": 3156.7799999999997
    },
    {
        "text": " integrando y tomando la raíz cuadrada. ¿Arientre comilla? Porque le vas al cuadrado la diferencia",
        "start": 3156.7799999999997,
        "end": 3164.2999999999997
    },
    {
        "text": " y pues tomo la raíz cuadrada, pero sí algo que estoy viendo, ¿cuál de todas las parábulas",
        "start": 3164.2999999999997,
        "end": 3170.3799999999997
    },
    {
        "text": " acá me deja la menor área ahí adentro? Pero para eso que justamente, con el producto",
        "start": 3170.3799999999997,
        "end": 3177.7
    },
    {
        "text": " interno yo define una norma y con la norma de fina distancia, ¿cuál es la distancia en",
        "start": 3177.7,
        "end": 3182.46
    },
    {
        "text": " este contexto? Me dan dos polinomis, la distancia en dos dos polinomis, la norma de P menos Q y",
        "start": 3182.46,
        "end": 3187.02
    },
    {
        "text": " como es la norma de P menos Q, bueno es la del producto interno, es la integral de P menos,",
        "start": 3187.02,
        "end": 3192.98
    },
    {
        "text": " es el producto interno de P menos Q con P menos Q, o sea que lo que tengo que integrar acá",
        "start": 3192.98,
        "end": 3200.02
    },
    {
        "text": " es P menos Q al cuadrado, bueno y tomar la raíz cuadrada esto, ¿no? Y después tomo la",
        "start": 3200.02,
        "end": 3207.42
    },
    {
        "text": " raíz cuadrada. Yo define una distancia entre dos polinomis, como la norma de P menos Q y la",
        "start": 3207.42,
        "end": 3214.16
    },
    {
        "text": " norma de P menos Q es la raíz cuadrada de P menos Q con P menos Q, la norma de",
        "start": 3214.16,
        "end": 3220.18
    },
    {
        "text": " inducirla por el producto interno. Producinterno me inducen norma, normal me inducen distancia,",
        "start": 3220.18,
        "end": 3226.58
    },
    {
        "text": " me da la definición de distancia. Entonces la distancia que estamos considerando acá entre",
        "start": 3226.58,
        "end": 3231.38
    },
    {
        "text": " comillas y agarrar la diferencia, tomar el producto interno, esa diferencia tomo la",
        "start": 3231.38,
        "end": 3235.7799999999997
    },
    {
        "text": " raíz cuadrada, o sea estamos integrando la diferencia del cuadrado y estamos tomando",
        "start": 3235.7799999999997,
        "end": 3240.22
    },
    {
        "text": " la raíz cuadrada. Esa es la idea de proximidad que existe entre funciones, con ese producto",
        "start": 3240.22,
        "end": 3245.8199999999997
    },
    {
        "text": " interno. Bueno y una segunda cosa, eso va a quedar más claro cuando después que retomemos",
        "start": 3245.8199999999997,
        "end": 3255.02
    },
    {
        "text": " las clases cuando veamos mínimos cuadrados. Tengo una función y quiero ver cuál es la",
        "start": 3255.1,
        "end": 3259.64
    },
    {
        "text": " recta que mejor se le aproxima, ese tipo de cosa. Segundo ejemplo, este capaz que se lo",
        "start": 3259.64,
        "end": 3271.94
    },
    {
        "text": " dejo como ejercicio porque quiero terminar la clase dando un resultado en un, que le voy",
        "start": 3271.94,
        "end": 3276.98
    },
    {
        "text": " a hacer un rapito. Segundo ejemplo, B, R3, producto interno usual, prodenterno habitual.",
        "start": 3276.98,
        "end": 3289.82
    },
    {
        "text": " Sí, como ese vamos a considerar un plano, el plano definió por la condición X,",
        "start": 3289.82,
        "end": 3309.46
    },
    {
        "text": " y en más y más 7 igual a 0. De ese plano, obviamente eso tiene un subesparcio y mención",
        "start": 3309.46,
        "end": 3320.98
    },
    {
        "text": " dos, pasa por el origen y yo me quiero construir una base orto normal de eso para hacer las cuentas.",
        "start": 3320.98,
        "end": 3326.38
    },
    {
        "text": " Pero lo que quiero hacer es, consideremos el vector B con entradas 1, 0, 0 que no está en el plano.",
        "start": 3326.38,
        "end": 3342.1800000000003
    },
    {
        "text": " Y calculemos lo que quiero calcular, es la prodección ortoonal sobre el plano de ese vector",
        "start": 3342.1800000000003,
        "end": 3353.2200000000003
    },
    {
        "text": " B. Eso es la pregunta. Se le tendría que acá la idea es la misma, yo no estoy en R3, tengo un",
        "start": 3353.22,
        "end": 3371.1
    },
    {
        "text": " plano que pasa por el origen, no sé cómo el sepa dibujar esto, y tengo un vector ahí que",
        "start": 3371.1,
        "end": 3377.4199999999996
    },
    {
        "text": " es el 1, 0, 0 que será una cosa que... ¿Por qué haría que es esto? Bueno, será un vector que está por ahí.",
        "start": 3377.42,
        "end": 3385.42
    },
    {
        "text": " Voy de búsama nada. Y quiero que la prodección se ve el todo sobre el plano. ¿Qué preciso",
        "start": 3385.42,
        "end": 3391.86
    },
    {
        "text": " hacer para que acular la prodección ortoonal? Estén asaitados con esto. ¿Qué preciso? Una base",
        "start": 3391.86,
        "end": 3400.66
    },
    {
        "text": " orto normal de ese. Pero una base orto normal, no sé qué sean mandrá, qué a simple vista, y no las",
        "start": 3400.66,
        "end": 3407.7799999999997
    },
    {
        "text": " acanadí. Entonces lo que hay que agarrar, una base cualquiera y con no es Grammys Mid construye",
        "start": 3407.7799999999997,
        "end": 3413.58
    },
    {
        "text": " una base orto normal. Entonces, una base de ese es... Bueno, por ejemplo, 1, 0, 0 y 1, 0,",
        "start": 3413.58,
        "end": 3426.8999999999996
    },
    {
        "text": " 1. Esto es una base de ese. Y con eso yo uso Grammys y me construye una base orto normal.",
        "start": 3427.1,
        "end": 3434.94
    },
    {
        "text": " Una base orto normal. Esto se lo voy a dejar como ejercicio, las heas de las cuentas, pero",
        "start": 3450.54,
        "end": 3455.78
    },
    {
        "text": " quiero avanzar rápido en esto. O sea, como el primer vector de la base ortonomal es este normalizado",
        "start": 3456.9,
        "end": 3463.02
    },
    {
        "text": " y el segundo es una combinación de estos dos apropiadas, lo que sale es lo siguiente.",
        "start": 3463.02,
        "end": 3471.14
    },
    {
        "text": " Una base ortonomal es...",
        "start": 3471.14,
        "end": 3475.14
    },
    {
        "text": " Esta es la base que me da Grashmit para que os junto ese. Si como le decía recién,",
        "start": 3486.9,
        "end": 3498.9
    },
    {
        "text": " la primera es este vector normalizado para que tenga norma 1 y la segunda es una combinación",
        "start": 3498.9,
        "end": 3503.94
    },
    {
        "text": " de estos dos que me da un vector que es ortobonal a este y con norma 1. Eso se lo es como",
        "start": 3503.94,
        "end": 3509.7000000000003
    },
    {
        "text": " ejercicio, este y este están en el plano verifiquen esto. Que la parte más tediosa de cálculo,",
        "start": 3509.7,
        "end": 3518.3399999999997
    },
    {
        "text": " ¿no? O tener una base ortonomal. Entonces una vez que yo tengo la base ortonomal, que",
        "start": 3518.3399999999997,
        "end": 3526.4199999999996
    },
    {
        "text": " es la parte tediosa, como digo, la proyección ortobonal del vector que estoy considerando",
        "start": 3526.4199999999996,
        "end": 3531.62
    },
    {
        "text": " el 1 0 0 sobre el subespacio E S será el productor interno de esto, con esto, por esto,",
        "start": 3531.62,
        "end": 3540.7799999999997
    },
    {
        "text": " más el productor interno de esto con esto por esto. Si yo se será...",
        "start": 3540.7799999999997,
        "end": 3544.42
    },
    {
        "text": " productor interno de esto con el...",
        "start": 3548.66,
        "end": 3550.18
    },
    {
        "text": " más el productor interno de 1 0 0 con el segundo vector de la base ortonomal que es",
        "start": 3562.62,
        "end": 3568.7799999999997
    },
    {
        "text": " 2 tercios, queda números espantosos por culpa de trabajar con base ortonomal, ¿no?",
        "start": 3568.7799999999997,
        "end": 3579.3399999999997
    },
    {
        "text": " 2 tercios...",
        "start": 3584.46,
        "end": 3586.06
    },
    {
        "text": " esto es lo que queda, ¿no? Proye interno de...",
        "start": 3591.8599999999997,
        "end": 3593.94
    },
    {
        "text": " este con el primero de la base por este, más este con el segundo de la base por este.",
        "start": 3595.54,
        "end": 3599.5
    },
    {
        "text": " Y ahí...",
        "start": 3608.02,
        "end": 3609.02
    },
    {
        "text": " y ahí...",
        "start": 3609.02,
        "end": 3610.02
    },
    {
        "text": " Ah, sí, este es un...",
        "start": 3613.7,
        "end": 3616.02
    },
    {
        "text": " Yo estoy mareado.",
        "start": 3617.02,
        "end": 3619.02
    },
    {
        "text": " Bueno, y ahí hay que hacer las cuentas que son fáciles, porque acá me quedé este",
        "start": 3620.02,
        "end": 3623.74
    },
    {
        "text": " por el primero de la base y eso también es fácil, esto me saco un raíz de 2, que con este",
        "start": 3623.74,
        "end": 3627.18
    },
    {
        "text": " raíz de 2 me da 1 medio, este con este me saco un raíz de 2 tercios, con este me da 1 2 tercios",
        "start": 3627.18,
        "end": 3632.58
    },
    {
        "text": " etcétera, bueno, y un medio ahí, en definitiva queda lo siguiente, queda un medio 1 menos 1 0,",
        "start": 3632.58,
        "end": 3642.22
    },
    {
        "text": " más 1 3 de 1 medio, 1 medio menos 1, que yo no sé por qué lo deje así, no lo su medio,",
        "start": 3643.22,
        "end": 3650.94
    },
    {
        "text": " debo estar... me lo he estado mental, la mental, la noche no sume eso.",
        "start": 3650.94,
        "end": 3654.2999999999997
    },
    {
        "text": " Sumen de ustedes, ¿no?",
        "start": 3656.1,
        "end": 3657.62
    },
    {
        "text": " Este, lo deje así para que quede explícito que este vector este ns, este tns y la combinación",
        "start": 3658.2999999999997,
        "end": 3663.66
    },
    {
        "text": " niñal esa, esta ns y ese vector ns que más se parece este otro vector, esa es la interpretación",
        "start": 3663.66,
        "end": 3669.54
    },
    {
        "text": " de proyección autobana.",
        "start": 3669.54,
        "end": 3671.1
    },
    {
        "text": " Tamos, le digo como estaría esto, construyen la base autónoma normal, hagan estas cosas porque van",
        "start": 3673.3399999999997,
        "end": 3678.2999999999997
    },
    {
        "text": " a ir en el parcial.",
        "start": 3678.2999999999997,
        "end": 3679.2999999999997
    },
    {
        "text": " Me apure justamente porque les quiero dar este resultado final que termina de cerrar la",
        "start": 3679.3,
        "end": 3688.7000000000003
    },
    {
        "text": " idea geometrica, que tenía que ver con eso, la proyección autobana es el vector ns que",
        "start": 3688.7000000000003,
        "end": 3695.82
    },
    {
        "text": " más se parece el vector que estoy considerando, el más cercano al vector v de los que están",
        "start": 3695.82,
        "end": 3704.94
    },
    {
        "text": " en el conjunto s. ¿Cuánto da esto? Me dice alguno.",
        "start": 3704.94,
        "end": 3713.06
    },
    {
        "text": " Bueno, se los dejo.",
        "start": 3715.34,
        "end": 3716.38
    },
    {
        "text": " Bueno, veamos el último resultado.",
        "start": 3717.86,
        "end": 3720.86
    },
    {
        "text": " Bien, este resultado va a terminar de cerrar la idea geometrica que les comentaba",
        "start": 3734.94,
        "end": 3761.02
    },
    {
        "text": " y las que están haciendo es una propiedad que les voy a explicar lo que significa y lo vamos",
        "start": 3761.02,
        "end": 3789.82
    },
    {
        "text": " a demostrar. Me dice, yo tengo un espacio de Victoria con producto interno como siempre,",
        "start": 3789.82,
        "end": 3796.82
    },
    {
        "text": " es un subespacio para que tenga sentido hablar el proyección autobana. Entonces, se cumple",
        "start": 3796.82,
        "end": 3801.3
    },
    {
        "text": " esta desigualdad que ve menos la proyección autobana de vez sobre su espacio v. Es enorme",
        "start": 3801.3,
        "end": 3806.98
    },
    {
        "text": " en la manera que ve menos s para que quiera ese en el espacio que estoy considerando.",
        "start": 3806.98,
        "end": 3812.1800000000003
    },
    {
        "text": " Esa desigualdad pues está ahí no dice nada, pero veamos geométricamente lo que significa.",
        "start": 3812.1800000000003,
        "end": 3815.94
    },
    {
        "text": " Craficamente lo que significa. Yo tengo su espacio de ese por acá, en consecuencia el complemento",
        "start": 3816.94,
        "end": 3823.94
    },
    {
        "text": " autobonal será una cosa que está por acá y yo tengo acá un vector v, fijo, lo dibujamos así como",
        "start": 3823.94,
        "end": 3832.7000000000003
    },
    {
        "text": " una flechita para que es más fácil de visualizar. Entonces, lo que estamos diciendo es que yo considero",
        "start": 3832.7000000000003,
        "end": 3838.62
    },
    {
        "text": " la proyección autobonal, como les decía, la construcción que hicimos la ciencia me da un vector",
        "start": 3838.62,
        "end": 3843.2200000000003
    },
    {
        "text": " acá abajo que es la proyección autobonal de ese sobre v. Lo que tengo en la primera",
        "start": 3843.22,
        "end": 3848.7
    },
    {
        "text": " de la primera lado es la norma de v menos pcb, o sea lo que tengo en primer lado en primer",
        "start": 3848.7,
        "end": 3854.06
    },
    {
        "text": " lugar es una idea de la distancia que existe entre v y pcb, es la norma de esa diferencia.",
        "start": 3854.06,
        "end": 3861.2599999999998
    },
    {
        "text": " Esto es v, esto es pcb, estoy considerando de diferencia y tomando la norma. Eso es una",
        "start": 3861.2599999999998,
        "end": 3867.8199999999997
    },
    {
        "text": " idea de la distancia que existe entre v y pcb, como les decía una norma de me da una idea de distancia.",
        "start": 3867.82,
        "end": 3874.26
    },
    {
        "text": " Y lo otro que tengo del otro lado, pcb está fijo y v está fijo y lo otro que tengo",
        "start": 3881.7400000000002,
        "end": 3887.1000000000004
    },
    {
        "text": " del otro lado es, me dice, agarre en ustedes un vector cualquiera en ese, acá abajo",
        "start": 3887.1000000000004,
        "end": 3892.1800000000003
    },
    {
        "text": " y agan v menos s, v menos s va a ser esta diferencia, va a ser esta diferencia acá y me",
        "start": 3892.18,
        "end": 3905.02
    },
    {
        "text": " dice, consideren la norma de esa diferencia, eso me da una idea de la distancia que hay entre v y s,",
        "start": 3905.02,
        "end": 3912.94
    },
    {
        "text": " se tengo la distancia que hay entre v y su proyección y la distancia que hay entre v y s para",
        "start": 3912.94,
        "end": 3918.54
    },
    {
        "text": " una de ese cualquiera. Esta es la distancia y eso es lo que decía recién, distancia tiene que",
        "start": 3918.54,
        "end": 3931.82
    },
    {
        "text": " ver con similitud, que tan cercano están un vector y otro. Fíjense, esto acá es la",
        "start": 3931.82,
        "end": 3937.62
    },
    {
        "text": " distancia primera y esto acá es la distancia segunda. Lo que me dice ese teorema es que esta",
        "start": 3937.62,
        "end": 3942.42
    },
    {
        "text": " distancia es la más chica posible, o sea si yo agarro acá la proyección o todo una alia",
        "start": 3942.42,
        "end": 3947.1
    },
    {
        "text": " luego la diferencia, eso me da el número más chiquito entre las posibles distancias que hay",
        "start": 3947.1,
        "end": 3951.46
    },
    {
        "text": " entre algo que está en ese y algo tan v, no me salió así en el dibujo, esto parece que",
        "start": 3951.46,
        "end": 3956.14
    },
    {
        "text": " fuera más claro que hay esta por una cuestión de perspectiva, también que veros lo que estoy",
        "start": 3956.14,
        "end": 3961.58
    },
    {
        "text": " diciendo que esta longitud, esta distancia es más grande que esta, esta es la más chica",
        "start": 3961.58,
        "end": 3967.2999999999997
    },
    {
        "text": " de todos los vectores que están en ese, el que tiene la distancia más cercana a ver es la",
        "start": 3967.2999999999997,
        "end": 3971.2599999999998
    },
    {
        "text": " proyección ortogonal, eso es lo que estamos diciendo, estamos, eso termina entonces de",
        "start": 3971.2599999999998,
        "end": 3975.86
    },
    {
        "text": " hacer la idea de que la proyección ortogonal es, de todos los vectores en un subespacio",
        "start": 3975.86,
        "end": 3981.02
    },
    {
        "text": " y que más se parece al vector que estoy considerando, donde que más se parezca quiere decir",
        "start": 3981.02,
        "end": 3985.46
    },
    {
        "text": " que la distancia, inducida por la norma es lo más chica posible. Esiguala la distancia",
        "start": 3985.46,
        "end": 3993.78
    },
    {
        "text": " mínima, exactamente. Claro, exactamente, si voy a esto lo ve como función de ese, está",
        "start": 3993.78,
        "end": 4000.38
    },
    {
        "text": " diciendo que el mínimo valor de esto se obtiene cuando ese es igual a la proyección",
        "start": 4000.38,
        "end": 4005.42
    },
    {
        "text": " ortogonal, exactamente eso que estamos diciendo, es lo que vamos a probar ahora, excelente.",
        "start": 4005.42,
        "end": 4012.42
    },
    {
        "text": " Así que, ven la perspectiva y no cierto, quedó clara, bueno vamos a probar eso y con eso",
        "start": 4012.42,
        "end": 4030.34
    },
    {
        "text": " terminamos el teórico y todo lo que va para el primer parcial.",
        "start": 4030.34,
        "end": 4044.34
    },
    {
        "text": " Demostración, vamos a agarrar un S cualquiera y vamos a calcular esto, más vamos a calcular",
        "start": 4044.34,
        "end": 4048.9
    },
    {
        "text": " esto el cuadrado porque es más fácil de trabajarlo. Entonces, dado cualquiera,",
        "start": 4048.9,
        "end": 4055.34
    },
    {
        "text": " para cualquier vector ese en el espacio que estamos considerando, vamos a calcular esto,",
        "start": 4055.34,
        "end": 4067.1000000000004
    },
    {
        "text": " la norma de B menos S al cuadrado. Esto es el producto interno, de B menos S con",
        "start": 4067.1000000000004,
        "end": 4084.34
    },
    {
        "text": " consigo mismo, justamente por eso trabajo con el cuadrado para no poner ahí la raíz",
        "start": 4084.34,
        "end": 4088.1800000000003
    },
    {
        "text": " cuadrada. Y ahora vamos a usar esplicitamente la descomposición de B, B se descompone como",
        "start": 4088.1800000000003,
        "end": 4100.14
    },
    {
        "text": " la proyección ortogonal sobre S, más la proyección ortogonal sobre S ortogonal. Esto es",
        "start": 4100.14,
        "end": 4108.74
    },
    {
        "text": " que lo que probamos al principio. Y a esto lo estamos restando S y tengo que poner acá",
        "start": 4108.74,
        "end": 4116.0599999999995
    },
    {
        "text": " de este otro lado lo mismo y restarle S. Y ahora tengo que desarrollar todo eso usando",
        "start": 4116.0599999999995,
        "end": 4127.3
    },
    {
        "text": " la desitividad del producto interno, pero voy a agrupar dos cosas, lo que está en S y lo",
        "start": 4127.3,
        "end": 4133.139999999999
    },
    {
        "text": " que está en S ortogonal. Quiero decir a este y a este que están en S los voy a agrupar",
        "start": 4133.14,
        "end": 4139.1
    },
    {
        "text": " juntos y de mi manera bueno, a este y a este que están en S lo vamos a agrupar juntos.",
        "start": 4139.1,
        "end": 4144.14
    },
    {
        "text": " Se vamos a dejar por un lado lo que está en S y por otro lado lo que está en S ortogonal.",
        "start": 4144.14,
        "end": 4149.54
    },
    {
        "text": " Entonces, cuando hago ese producto interno me va a quedar por un lado producto interno",
        "start": 4149.54,
        "end": 4155.860000000001
    },
    {
        "text": " de lo que está en S consigo mismo. ¿Qué es esto? Esto que está marcado en rojo con lo",
        "start": 4155.86,
        "end": 4171.179999999999
    },
    {
        "text": " que está marcado en rojo ahí después lo que está en rojo acá con lo que está en",
        "start": 4171.179999999999,
        "end": 4175.62
    },
    {
        "text": " el compadimiento en torto con alaí. Lo que está en rojo acá con lo que está en el compadimiento",
        "start": 4175.62,
        "end": 4190.0199999999995
    },
    {
        "text": " en torto con alaí. Después lo que está en el compadimiento en torto con alaí con lo que está en rojo",
        "start": 4190.02,
        "end": 4193.26
    },
    {
        "text": " acá y finalmente lo que está en el compadimiento en torto con alaí con lo que está en el compadimiento",
        "start": 4193.26,
        "end": 4211.46
    },
    {
        "text": " en torto con alaí acá. Ve esta fijo y esto lo estamos haciendo para cualquier es, para cualquier vector",
        "start": 4211.46,
        "end": 4223.86
    },
    {
        "text": " bueno acá como ustedes se han dado cuenta allá hay partes que se van.",
        "start": 4241.46,
        "end": 4249.46
    },
    {
        "text": " Sí, esto acá está en S, esta en S y esto acá está en S ortogonal. El producto interno",
        "start": 4252.46,
        "end": 4261.14
    },
    {
        "text": " de dos cosas me da cero y lo mismo acá esto está en S ortogonal y esto acá está en S por lo tanto",
        "start": 4261.14,
        "end": 4267.62
    },
    {
        "text": " el producto interno de este y de este me da cero y esto me da cero y esto me da cero y las otras",
        "start": 4267.62,
        "end": 4284.42
    },
    {
        "text": " cosas que quieran son el producto interno de algo consigo mismo que eso es la normal cuadrado, esto acá",
        "start": 4284.42,
        "end": 4289.82
    },
    {
        "text": " es la normal cuadrado de p, cnb menos S al cuadrado y esto otro es la normal cuadrado",
        "start": 4289.82,
        "end": 4301.38
    },
    {
        "text": " de p, cnb",
        "start": 4314.42,
        "end": 4315.38
    },
    {
        "text": " también acá en definitiva tenemos que para cualquier S la diferencia de b menos S al cuadrado",
        "start": 4320.82,
        "end": 4333.0599999999995
    },
    {
        "text": " que era lo que teníamos acá de este lado le voy al cuadrado, se escribe como pcb menos S al cuadrado",
        "start": 4333.0599999999995,
        "end": 4338.94
    },
    {
        "text": " que es lo que tenemos escrito acá, perdón sí, no, perdón no es lo que tenemos escrito acá. Eso es",
        "start": 4338.94,
        "end": 4345.0599999999995
    },
    {
        "text": " lo que tenemos escrito acá al cuadrado, se escribe como pcb menos S al cuadrado más pcb al cuadrado",
        "start": 4345.06,
        "end": 4349.780000000001
    },
    {
        "text": " sí, ahora fíjense una cosa, b está fijo y la cuenta que estamos haciendo variando S ahora",
        "start": 4349.780000000001,
        "end": 4358.06
    },
    {
        "text": " como b está fijo esto acá es este numarito, este vector acá está fijo, la normal esto es un vector fijo,",
        "start": 4358.06,
        "end": 4365.02
    },
    {
        "text": " la normal es un número fijo, es la proyección ortogonal de b sobre el complemento ortogonal de S,",
        "start": 4365.02,
        "end": 4369.38
    },
    {
        "text": " esto no depende del elemento que estamos usando acá, entonces esto acá es un número fijo que no",
        "start": 4369.38,
        "end": 4376.78
    },
    {
        "text": " depende del vector S en el espacio que estamos considerando y esto acá sí es algo que depende",
        "start": 4376.78,
        "end": 4385.62
    },
    {
        "text": " de S, esto es una función de S, ¿qué cuáles es el mínimo valor que alcanza a eso?",
        "start": 4385.62,
        "end": 4396.66
    },
    {
        "text": " Estamos diciendo que esta función b menos S al cuadrado se escribe de esta forma, algo que no depende",
        "start": 4396.66,
        "end": 4404.18
    },
    {
        "text": " de S y algo que depende de una manera muy sencilla de S, el mínimo se alcanza justamente cuando esto",
        "start": 4404.18,
        "end": 4411.14
    },
    {
        "text": " es 0, esto siempre es mayor igual que 0, cuando se alcanza al mínimo cuando S coincide con pcb,",
        "start": 4411.14,
        "end": 4418.06
    },
    {
        "text": " esta es la proyección ortogonal de b sobre S que está en S y este es un vector cualquiera en S,",
        "start": 4419.06,
        "end": 4423.780000000001
    },
    {
        "text": " cuando se alcanza al mínimo cuando esto me da 0 justamente cuando le lisco S igual esta cantidad acá,",
        "start": 4423.780000000001,
        "end": 4429.42
    },
    {
        "text": " entonces el mínimo se alcanza",
        "start": 4430.02,
        "end": 4434.06
    },
    {
        "text": " como función del vector S, el mínimo de la función que estamos considerando inicialmente, ¿qué era esto?",
        "start": 4445.38,
        "end": 4458.18
    },
    {
        "text": " Se alcanza cuando esto es 0,",
        "start": 4460.42,
        "end": 4466.26
    },
    {
        "text": " cuando pcb menos S me da 0, esto es cuando S coincide con la proyección ortogonal,",
        "start": 4466.26,
        "end": 4495.46
    },
    {
        "text": " cuando el vector S coincide con la proyección ortogonal de b sobre S, esto me da 0,",
        "start": 4496.26,
        "end": 4506.5
    },
    {
        "text": " esto me da 0 y esto es un constante, el mínimo valor de esta función se obtiene cuando yo pongo acá",
        "start": 4506.5,
        "end": 4513.62
    },
    {
        "text": " S igual a la proyección ortogonal de b, o sea que en definitiva tenemos,",
        "start": 4514.34,
        "end": 4519.42
    },
    {
        "text": " en definitiva tenemos que la función b menos S al cuadrado alcanza a su mínimo,",
        "start": 4531.5,
        "end": 4538.0199999999995
    },
    {
        "text": " cuando S es la proyección ortogonal de S sobre b, o sea este es el valor mínimo de la función y",
        "start": 4539.02,
        "end": 4551.22
    },
    {
        "text": " esta es la función, este es el valor mínimo que alcanza, se entendió eso, repito esta es la función",
        "start": 4551.22,
        "end": 4559.5
    },
    {
        "text": " que estamos considerando en la demostración y esta función como función de S,",
        "start": 4559.5,
        "end": 4564.02
    },
    {
        "text": " alcanza el valor mínimo cuando S coincide con esto, cuando esto me da 0, o sea que y esto es",
        "start": 4564.02,
        "end": 4569.9400000000005
    },
    {
        "text": " una constante no importa, o sea que esto acá es mayor igual que lo mismo pero apoyendo S su valor",
        "start": 4569.9400000000005,
        "end": 4576.1
    },
    {
        "text": " minimizador, entonces de A y Saco cancelando los cuadrados que efectivamente lo que teníamos,",
        "start": 4576.1,
        "end": 4589.3
    },
    {
        "text": " no, la distancia entre entre B y Pcmb es normal es menor igual que B menos S,",
        "start": 4589.3,
        "end": 4602.900000000001
    },
    {
        "text": " o sea que efectivamente la proyección ortogonal es el valor de S que me minimiza la distancia a B,",
        "start": 4606.1,
        "end": 4612.7
    },
    {
        "text": " bueno terminamos la clase acá,",
        "start": 4612.7,
        "end": 4615.94
    }
]