[
    {
        "text": " ¡Más bien!",
        "start": 0.0,
        "end": 2.0
    },
    {
        "text": " ¡Más bien!",
        "start": 2.0,
        "end": 4.0
    },
    {
        "text": " ¡Más bien!",
        "start": 4.0,
        "end": 6.0
    },
    {
        "text": " ¡Más bien!",
        "start": 6.0,
        "end": 8.0
    },
    {
        "text": " ¡Más bien!",
        "start": 8.0,
        "end": 10.0
    },
    {
        "text": " ¡Más bien!",
        "start": 10.0,
        "end": 12.0
    },
    {
        "text": " ¡Más bien!",
        "start": 12.0,
        "end": 14.0
    },
    {
        "text": " ¡Más bien!",
        "start": 14.0,
        "end": 16.0
    },
    {
        "text": " ¡Más bien!",
        "start": 16.0,
        "end": 18.0
    },
    {
        "text": " Mi nombre es Gustavo Dutra.",
        "start": 18.0,
        "end": 20.0
    },
    {
        "text": " Comigo van a tener la parte de esta final del curso de Economía.",
        "start": 20.0,
        "end": 24.0
    },
    {
        "text": " Básicamente lo que vamos a ver es el enfoque microeconomico.",
        "start": 24.0,
        "end": 28.0
    },
    {
        "text": " Hoy vamos a empezar con algunos conceptos referidos a brevemente a la definición de Economía.",
        "start": 29.0,
        "end": 40.0
    },
    {
        "text": " Ostedes ya tuvieron bien los otros cursos y posiblemente tenés que también.",
        "start": 40.0,
        "end": 43.0
    },
    {
        "text": " Simplemente para encuadrarnos y después vamos a pasarle a algunos conceptos importantes,",
        "start": 43.0,
        "end": 50.0
    },
    {
        "text": " como el tema de las casas, la elección,",
        "start": 50.0,
        "end": 54.0
    },
    {
        "text": " los costos que tiene elegir, en particular, que costos tenemos que identificar en la toma de decisiones,",
        "start": 55.0,
        "end": 62.0
    },
    {
        "text": " una distinción entre el que es el costo a contáble y el costo económico,",
        "start": 62.0,
        "end": 66.0
    },
    {
        "text": " y centrarnos un poco en el costo de oportunidad que es el infinitivo,",
        "start": 66.0,
        "end": 71.0
    },
    {
        "text": " lo importante para la conservación de los costos que tiene la toma de decisiones.",
        "start": 71.0,
        "end": 77.0
    },
    {
        "text": " Me preguntaba recién si esto está colgado ya está en la página,",
        "start": 77.0,
        "end": 82.0
    },
    {
        "text": " o sea que si tienen acceso, pueden obtener por ahí.",
        "start": 82.0,
        "end": 87.0
    },
    {
        "text": " Cualquier duda que tenga muchas chicas por favor me interrumpen,",
        "start": 91.0,
        "end": 94.0
    },
    {
        "text": " no hay ningún problema, paran cualquier momento la exposición,",
        "start": 94.0,
        "end": 97.0
    },
    {
        "text": " no hay ningún problema, por supuesto cualquier comentario o intervención,",
        "start": 97.0,
        "end": 100.0
    },
    {
        "text": " desde que ya que me he venido, así que no se vayan con dudas por favor.",
        "start": 100.0,
        "end": 105.0
    },
    {
        "text": " Entonces previamente para encuadrarnos,",
        "start": 106.0,
        "end": 110.0
    },
    {
        "text": " que se entiende por economía y se ha ido,",
        "start": 111.0,
        "end": 113.0
    },
    {
        "text": " bueno, en realidad no hay una definición única,",
        "start": 113.0,
        "end": 116.0
    },
    {
        "text": " pero nosotros vamos a tomar simplemente esta,",
        "start": 116.0,
        "end": 119.0
    },
    {
        "text": " decir una cinta social, que es lo que está estudiando,",
        "start": 119.0,
        "end": 124.0
    },
    {
        "text": " es cómo se asina de la mejor manera posible los recursos,",
        "start": 124.0,
        "end": 129.0
    },
    {
        "text": " que esos recursos son limitados, tiene la retricción, son escasos,",
        "start": 131.0,
        "end": 137.0
    },
    {
        "text": " y que pueden destinarse a diferentes alternativas,",
        "start": 138.0,
        "end": 140.0
    },
    {
        "text": " ya que definitiva lo que estamos tratando de plantear como objetivo,",
        "start": 140.0,
        "end": 149.0
    },
    {
        "text": " digamos, es justamente cómo se estudia la asignación última de los recursos,",
        "start": 149.0,
        "end": 153.0
    },
    {
        "text": " que son escasos entre diferentes alternativas posibles.",
        "start": 153.0,
        "end": 156.0
    },
    {
        "text": " Y eso es referido al ser humano,",
        "start": 158.0,
        "end": 160.0
    },
    {
        "text": " ya hay el tema de la ascencia social,",
        "start": 160.0,
        "end": 162.0
    },
    {
        "text": " no, a profundizar en esto, pero simplemente para,",
        "start": 162.0,
        "end": 166.0
    },
    {
        "text": " como ya le dije, para un marco de referencia.",
        "start": 166.0,
        "end": 169.0
    },
    {
        "text": " Vamos a ver entonces el concepto de escasos y referido a la elección.",
        "start": 172.0,
        "end": 177.0
    },
    {
        "text": " Nosotros tenemos, por ejemplo, una actividad que es la producción,",
        "start": 178.0,
        "end": 184.0
    },
    {
        "text": " la producción de bienes y servicios,",
        "start": 184.0,
        "end": 187.0
    },
    {
        "text": " no es ni menos que la acción humana o la actividad económica,",
        "start": 187.0,
        "end": 191.0
    },
    {
        "text": " en el cual lo que se hace es crear bienes y servicios,",
        "start": 192.0,
        "end": 195.0
    },
    {
        "text": " se transforman insumos, se transforman bienes en otros bienes,",
        "start": 195.0,
        "end": 200.0
    },
    {
        "text": " insumos, materias primas, bienes y servicios,",
        "start": 200.0,
        "end": 203.0
    },
    {
        "text": " con un objetivo que es tratar de satisfacer necesidades,",
        "start": 203.0,
        "end": 206.0
    },
    {
        "text": " necesidades que tenemos todos nosotros, seris humanos,",
        "start": 206.0,
        "end": 209.0
    },
    {
        "text": " que saben que hay necesidades biológicas, que son las básicas,",
        "start": 209.0,
        "end": 213.0
    },
    {
        "text": " y después de lo tipo de necesidades,",
        "start": 213.0,
        "end": 215.0
    },
    {
        "text": " bueno, definitiva, este es un poco lo que apunta a esta actividad de producción,",
        "start": 215.0,
        "end": 220.0
    },
    {
        "text": " es decir, producir aquellos bienes que van a satisfacer la necesidad de sus humanas,",
        "start": 220.0,
        "end": 225.0
    },
    {
        "text": " que son ilimitadas, la necesidad de que tiene el ser humano no tiene un techo,",
        "start": 225.0,
        "end": 231.0
    },
    {
        "text": " son ilimitadas, lo que sí tiene la restricción son justamente los recursos.",
        "start": 231.0,
        "end": 235.0
    },
    {
        "text": " Los recursos sí, estos recursos que utiliza justamente para producir los bienes y servicios",
        "start": 235.0,
        "end": 242.0
    },
    {
        "text": " para satisfacer necesidades tienen una restricción,",
        "start": 242.0,
        "end": 247.0
    },
    {
        "text": " surge ahí el concepto de escasez.",
        "start": 247.0,
        "end": 251.0
    },
    {
        "text": " Entonces ahí surge un problema, ¿no?",
        "start": 251.0,
        "end": 254.0
    },
    {
        "text": " Un problema económico como dice ahí, ¿cuál es?",
        "start": 254.0,
        "end": 259.0
    },
    {
        "text": " Trata de satisfacer multifínes, sujeto a que sujeto a las restricciones",
        "start": 259.0,
        "end": 265.0
    },
    {
        "text": " que le impone esta escasez de recursos, ¿no?",
        "start": 265.0,
        "end": 270.0
    },
    {
        "text": " En buen romance, como dice ahí también,",
        "start": 272.0,
        "end": 274.0
    },
    {
        "text": " no se puede producir todos los bienes y servicios que realmente la sociedad quiere entener.",
        "start": 274.0,
        "end": 282.0
    },
    {
        "text": " En definitiva, hay que ver cómo se optimiza ese uso de recursos,",
        "start": 282.0,
        "end": 288.0
    },
    {
        "text": " que son escasos, que son ilimitados para tratar de tener la mejor forma posible",
        "start": 288.0,
        "end": 294.0
    },
    {
        "text": " en esa utilización.",
        "start": 294.0,
        "end": 297.0
    },
    {
        "text": " Este concepto de escasez, este concepto de escasez es un concepto relativo,",
        "start": 298.0,
        "end": 304.0
    },
    {
        "text": " ¿por qué es un concepto relativo?",
        "start": 304.0,
        "end": 306.0
    },
    {
        "text": " Bueno, porque lo que es escaso en un momento no tiene por qué ser escaso en otro momento.",
        "start": 306.0,
        "end": 313.0
    },
    {
        "text": " ¿Qué quiere decir esto?",
        "start": 313.0,
        "end": 315.0
    },
    {
        "text": " Definitiva. Bueno, el uso que podemos hacer de un bien está muy referido a un contexto",
        "start": 315.0,
        "end": 322.0
    },
    {
        "text": " de circunstancias y la necesidad que impone ese bien también.",
        "start": 323.0,
        "end": 329.0
    },
    {
        "text": " Lo que hoy, ese escaso mañana, puede no hacerlo,",
        "start": 329.0,
        "end": 334.0
    },
    {
        "text": " y efectivamente, si está llobiendo, por ejemplo, un recurso escaso puede ser un paragua",
        "start": 334.0,
        "end": 340.0
    },
    {
        "text": " si yo no tengo a mano, mientras que hoy por hoy un paragua no sería totalmente algo necesario,",
        "start": 340.0,
        "end": 346.0
    },
    {
        "text": " aunque nunca sabemos acá, pues llegamos a ver, pero en definitiva,",
        "start": 346.0,
        "end": 350.0
    },
    {
        "text": " la idea es que algo que es escaso no necesariamente es escaso en sí mismo,",
        "start": 350.0,
        "end": 354.0
    },
    {
        "text": " sino que depende de un montón de elementos.",
        "start": 354.0,
        "end": 356.0
    },
    {
        "text": " Estoy poniendo un ejemplo muy, muy trivial, pero de todas formas,",
        "start": 356.0,
        "end": 359.0
    },
    {
        "text": " el contexto es lo que hace que en definitiva el recurso o ese bien puede hacer",
        "start": 359.0,
        "end": 364.0
    },
    {
        "text": " hasta no hacer escaso, yo, y obviamente, depende de las circunstancias.",
        "start": 364.0,
        "end": 367.0
    },
    {
        "text": " También hay otros elementos, ¿no?, que juegan, que inciden elementos ofertas,",
        "start": 367.0,
        "end": 372.0
    },
    {
        "text": " demandas, elementos tecnológicos, elementos culturales, políticos, naturales, etc., etc.,",
        "start": 372.0,
        "end": 378.0
    },
    {
        "text": " obviamente ya sabemos no vamos a andar en esto, que en la necesidad de son dinámicas,",
        "start": 379.0,
        "end": 383.0
    },
    {
        "text": " cambian, mutan, crecen continuamente, y en definitiva los individuos como seris humanos",
        "start": 383.0,
        "end": 392.0
    },
    {
        "text": " y como sociedad también y su conjunto se enfrentan a un problema,",
        "start": 392.0,
        "end": 397.0
    },
    {
        "text": " tratar de adquirir los bienes y servicios que son mayores en volumen a las posibilidades",
        "start": 397.0,
        "end": 406.0
    },
    {
        "text": " que tienen, o dicho de otra forma, tratan de disponer o adquirir una mayor cantidad",
        "start": 407.0,
        "end": 414.0
    },
    {
        "text": " de bienes a las disponibles. Eso nos lleva directamente a tener que tomar opciones,",
        "start": 414.0,
        "end": 419.0
    },
    {
        "text": " tener que elegir.",
        "start": 419.0,
        "end": 421.0
    },
    {
        "text": " ¿Qué es elegir de punto de vista económico? Es dejar del lado ciertas cosas,",
        "start": 424.0,
        "end": 430.0
    },
    {
        "text": " dejar del lado justamente esos alternativas que no se eligieron.",
        "start": 431.0,
        "end": 436.0
    },
    {
        "text": " ¿Por qué hay que elegir? Porque los recursos siempre son escasos,",
        "start": 438.0,
        "end": 441.0
    },
    {
        "text": " por más que esté en el estadio de mayor riqueza o de mucha disponibilidad de recursos,",
        "start": 441.0,
        "end": 445.0
    },
    {
        "text": " siempre tengo una restricción, siempre hay infinitiva las escases que se impone",
        "start": 445.0,
        "end": 450.0
    },
    {
        "text": " por más riqueza que tenga un individuo o una nación.",
        "start": 450.0,
        "end": 454.0
    },
    {
        "text": " Y si lo referimos a la producción, por ejemplo como recién aludíamos,",
        "start": 455.0,
        "end": 463.0
    },
    {
        "text": " es importante tener que elegir porque si pensamos un poquito lo que implica",
        "start": 463.0,
        "end": 471.0
    },
    {
        "text": " la toma de decisiones de producir un bienes albicero cualquiera,",
        "start": 471.0,
        "end": 475.0
    },
    {
        "text": " hay que elegir que viene es promar a producir",
        "start": 475.0,
        "end": 481.0
    },
    {
        "text": " ¿cuánto se va a producir? ¿De qué forma se va a producir esto alude a la",
        "start": 482.0,
        "end": 487.0
    },
    {
        "text": " tecnología que se va a incorporar a los procesos productivos que se va a incorporar?",
        "start": 487.0,
        "end": 490.0
    },
    {
        "text": " ¿A quién está dirigido ese producto? ¿Cuál es el mercado objetivo que se quiere captar?",
        "start": 490.0,
        "end": 496.0
    },
    {
        "text": " ¿Cuál es el costo de beneficio económico que tiene esa actividad y también a nivel social?",
        "start": 496.0,
        "end": 503.0
    },
    {
        "text": " O sea que en definitiva esa elección está totalmente ligada a dar respuesta a este tipo",
        "start": 504.0,
        "end": 512.0
    },
    {
        "text": " de elementos a este tipo de componentes que está intrícicamente vinculados al proceso de",
        "start": 512.0,
        "end": 519.0
    },
    {
        "text": " producción. Entonces como dice este esquema, ¿qué es lo que estuvimos viendo?",
        "start": 519.0,
        "end": 524.0
    },
    {
        "text": " Tenemos por un lado que el ser humano o la sociedad en su conjunto presentan necesidades",
        "start": 524.0,
        "end": 531.0
    },
    {
        "text": " que son ilimitadas pero su vez recurso que sí son limitados. Esta conjunción de elementos",
        "start": 531.0,
        "end": 539.0
    },
    {
        "text": " genera las cases y las cases lo que genera es la necesidad de elegir y a su vez elegir",
        "start": 539.0,
        "end": 548.0
    },
    {
        "text": " implica renunciar a las opciones por las cuales no tancito, no defino ir.",
        "start": 548.0,
        "end": 560.0
    },
    {
        "text": " Eza renunciada a otras opciones es lo que genera un costo y es lo que llamamos costo oportunidad.",
        "start": 561.0,
        "end": 567.0
    },
    {
        "text": " Ya vamos a intentar definir un poquito con mayor profundidad.",
        "start": 567.0,
        "end": 574.0
    },
    {
        "text": " Este costo oportunidad que se genera por renunciar diferentes opciones, ¿qué componentes",
        "start": 574.0,
        "end": 591.0
    },
    {
        "text": " tiene? Cuando yo hablo de costo, ¿qué lo asocian? ¿Qué es un costo?",
        "start": 591.0,
        "end": 602.0
    },
    {
        "text": " ¿Qué es un costo? Sí, sí. ¿Qué caso por el costo oportunidad que ha cambiado de",
        "start": 602.0,
        "end": 609.0
    },
    {
        "text": " un costo? Ahí está. Los costos de una elección no sólo se componen de elementos monetarios,",
        "start": 609.0,
        "end": 619.0
    },
    {
        "text": " hay una lado de una oportunidad, o sea que no estaba hablando necesariamente de algo cuantificado",
        "start": 619.0,
        "end": 626.0
    },
    {
        "text": " en dinero, no sólo son aspectos monetarios, sí, puede haber seguramente hay elementos monetarios,",
        "start": 626.0,
        "end": 635.0
    },
    {
        "text": " pero no sólo de punto de vista monetario. Por ejemplo, si consideramos un recurso que es totalmente",
        "start": 635.0,
        "end": 643.0
    },
    {
        "text": " escaso como el tiempo, el usarlo hasta el fin implica en usarlo en otro.",
        "start": 643.0,
        "end": 649.0
    },
    {
        "text": " Si ustedes tienen aquí sentados en este momento en clase, implica obviamente que nos",
        "start": 650.0,
        "end": 656.0
    },
    {
        "text": " ten utilizando ese tiempo en otros tipos actividades. Vamos a ver lo que se conoce como costo",
        "start": 656.0,
        "end": 666.0
    },
    {
        "text": " implícito y costo explícito y costo un día. El costo implícito son costos observables,",
        "start": 666.0,
        "end": 676.0
    },
    {
        "text": " son costos indirectos, no tienen un deseruvón son monetario, surgen a arruizar un recurso",
        "start": 676.0,
        "end": 682.0
    },
    {
        "text": " según la elección y no otro objetivo. Los costos explícitos ahí sí, son costos que son los",
        "start": 682.0,
        "end": 695.0
    },
    {
        "text": " monetarios, las evaluaciones monetarias. Son visibles, tanto dinero que se utilizó en tal cosa y que generó",
        "start": 695.0,
        "end": 704.0
    },
    {
        "text": " un costo por la elección que hice. Esa asocia totalmente el costo contable, el costo de la",
        "start": 704.0,
        "end": 709.0
    },
    {
        "text": " contabilidad es justamente el que tiene un deseruvón son monetarios.",
        "start": 709.0,
        "end": 713.0
    },
    {
        "text": " El otro concepto que yo le mencioné y lo que se conoce como el costo hundido, el costo hundido",
        "start": 718.0,
        "end": 723.0
    },
    {
        "text": " lo que alude es a un costo que independientemente que elija lo que elija, opte por la alternativa",
        "start": 723.0,
        "end": 730.0
    },
    {
        "text": " que opte es un costo que lo tengo igual, es decir no me va a incidir o mejor dicho no lo tengo",
        "start": 730.0,
        "end": 737.0
    },
    {
        "text": " de considerar en la toma de decisión. Por ejemplo como está ahí, si estoy evaluando el",
        "start": 737.0,
        "end": 742.0
    },
    {
        "text": " dime de vacaciones, ¿qué tal? Y yo estoy viendo en un inmueble en el cual pago un alquiler,",
        "start": 742.0,
        "end": 750.0
    },
    {
        "text": " el alquiler que estoy pagando no lo voy a considerar como un costo de dime de vacaciones, ¿por qué?",
        "start": 750.0,
        "end": 755.0
    },
    {
        "text": " Claro, pues lo tengo para pagar igual, me vaya a vacaciones lo pago y no me voy a ir",
        "start": 755.0,
        "end": 762.0
    },
    {
        "text": " a vacaciones también lo pago, por lo tanto no es un costo de dime de vacaciones.",
        "start": 762.0,
        "end": 769.0
    },
    {
        "text": " No, tengo un gasto obviamente lo tengo pero no es un costo de dime de vacaciones para ir",
        "start": 769.0,
        "end": 777.0
    },
    {
        "text": " a vacaciones no tengo que sumar el costo del alquiler, por supuesto te me dirá bueno pero tengo",
        "start": 777.0,
        "end": 782.0
    },
    {
        "text": " igual la nivel de plata y su plata que se me va. Sí, claro, no es un costo de vacaciones porque",
        "start": 782.0,
        "end": 787.0
    },
    {
        "text": " ya lo tengo, ¿se ve esto?",
        "start": 787.0,
        "end": 791.0
    },
    {
        "text": " En este caso no tiene por qué ser muertal, ¿no tiene por qué ser muertal?",
        "start": 791.0,
        "end": 798.0
    },
    {
        "text": " ¿Qué es que no?",
        "start": 798.0,
        "end": 799.0
    },
    {
        "text": " ¿Es que no tiene por qué ser muertal? Sí, puede haber algún caso, es difícil visualizar un costo",
        "start": 799.0,
        "end": 808.0
    },
    {
        "text": " de dime de vacaciones, pero puede haber, puede haber, pero generalmente acá lo que vemos es",
        "start": 808.0,
        "end": 813.0
    },
    {
        "text": " monetario, ¿no? Pero sí, conceptualmente es difícil pero puede haber.",
        "start": 813.0,
        "end": 820.0
    },
    {
        "text": " ¿Algúden, entonces a costos que están ya que no inciden, ¿sí?",
        "start": 820.0,
        "end": 825.0
    },
    {
        "text": " Hay va, por ejemplo, tiene la diversidad del tiempo, tiene que ser exacto el mismo tiempo,",
        "start": 825.0,
        "end": 831.0
    },
    {
        "text": " entonces ahí no lo conseguirás, ¿no?",
        "start": 831.0,
        "end": 834.0
    },
    {
        "text": " El tiempo y todo lo demás traslado, lo que se espera, pero sí, estoy a conseguir y puede",
        "start": 835.0,
        "end": 841.0
    },
    {
        "text": " conseguir. ¿Qué es el ejemplo? Bueno, el ejemplo otro ejemplo típico que se usó le pone",
        "start": 841.0,
        "end": 848.0
    },
    {
        "text": " estos casos, tengo una entrada que saqué con una anticipación para ver un bespetáculo,",
        "start": 848.0,
        "end": 852.0
    },
    {
        "text": " que es un concierto y justo yo he acántado, ese día de concierto, entonces bueno,",
        "start": 852.0,
        "end": 859.0
    },
    {
        "text": " yo no voy, ¿no? ¿Considero el entrada que se...? Ya le compré ante el típico, ya soy",
        "start": 860.0,
        "end": 864.0
    },
    {
        "text": " no, ya... Claro, vaya, no vaya, ¿eh ese costo de la entrada que no lo digo de considerar?",
        "start": 864.0,
        "end": 869.0
    },
    {
        "text": " Quiero considerar todo lo demás costos, pero no el costo de la entrada, ¿no?",
        "start": 869.0,
        "end": 874.0
    },
    {
        "text": " Está a algunos pa' decir, bueno, yo ya pa' que la entrada voy a ir igual, bueno, perfecto,",
        "start": 874.0,
        "end": 878.0
    },
    {
        "text": " eso es otro tema, pero no es un costo de ir, ¿no?",
        "start": 878.0,
        "end": 882.0
    },
    {
        "text": " Si entiende muchas cosas, ¿cómo me voy a tragar? Está ahora.",
        "start": 882.0,
        "end": 886.0
    },
    {
        "text": " El costo de... Cuando estamos comparando opciones, ¿no? Alternativas, lo que tenemos",
        "start": 890.0,
        "end": 895.0
    },
    {
        "text": " considerar es lo que se conoce los costos relevantes, los costos que realmente importan",
        "start": 895.0,
        "end": 899.0
    },
    {
        "text": " cuando estoy comparando, ¿no? ¿Cuáles son los costos relevantes de la opción? Bueno,",
        "start": 899.0,
        "end": 906.0
    },
    {
        "text": " monetariamente hablando, tengo que considerar las diferencias según los diferentes rúbres, ¿no?",
        "start": 906.0,
        "end": 913.0
    },
    {
        "text": " Por cada rúbro, digamos, como dice ahí, los costos relevantes de esa opción,",
        "start": 914.0,
        "end": 918.0
    },
    {
        "text": " el punto de esta monetario sería la diferencia entre los gastos monetarios de una opción",
        "start": 918.0,
        "end": 923.0
    },
    {
        "text": " con respecto a la otra, o sea, los gastos incrementales de la opción y no incluir",
        "start": 923.0,
        "end": 929.0
    },
    {
        "text": " los costos unidos. Por ejemplo, si estoy comparando, considerando,",
        "start": 929.0,
        "end": 935.0
    },
    {
        "text": " este ejemplo, yo decía ahí, me de vacaciones, bueno, el costo de alimentación, ¿cuál sería?",
        "start": 935.0,
        "end": 940.0
    },
    {
        "text": " Bueno, estrictamente sería la diferencia entre lo que gasto acá y lo que gasto",
        "start": 941.0,
        "end": 945.0
    },
    {
        "text": " y lléndome de vacaciones, porque acá me alimento también.",
        "start": 945.0,
        "end": 948.0
    },
    {
        "text": " También hay costos no monetarios, los costos no monetarios,",
        "start": 950.0,
        "end": 955.0
    },
    {
        "text": " acá sí entramos en este campo que yo le mencionaba hoy, los costos insplicidos,",
        "start": 955.0,
        "end": 960.0
    },
    {
        "text": " que son los beneficios que se renuncia de la opción, la vamos a ver un poquito más.",
        "start": 960.0,
        "end": 965.0
    },
    {
        "text": " No tiene por qué ser necesariamente gasto ya realizado.",
        "start": 966.0,
        "end": 969.0
    },
    {
        "text": " Entonces, veamos este ejemplo, un agresado secundaria, se plantea qué hace si estudió trabajo.",
        "start": 971.0,
        "end": 978.0
    },
    {
        "text": " ¿Quién plica estudiar para esta persona?",
        "start": 980.0,
        "end": 983.0
    },
    {
        "text": " Bueno, por un lado vas a sacrificar un recurso tiempo,",
        "start": 983.0,
        "end": 987.0
    },
    {
        "text": " ese recurso tiempo que puedes dinar los otros tipos de actividades,",
        "start": 987.0,
        "end": 992.0
    },
    {
        "text": " por ejemplo, ir al cine.",
        "start": 992.0,
        "end": 995.0
    },
    {
        "text": " Si va a estudiar y no va al cine, está renunciando, o sea, cuesta la satisfacción que le da a ir al cine.",
        "start": 997.0,
        "end": 1004.0
    },
    {
        "text": " Lo mismo si, bueno, pero en vez de estudiar, lo hermoso.",
        "start": 1005.0,
        "end": 1009.0
    },
    {
        "text": " Entonces, la persona está considerando que el hecho de estudiar,",
        "start": 1010.0,
        "end": 1014.0
    },
    {
        "text": " renunciador, miér, está obviamente sacrificando la satisfacción que le genera descansar.",
        "start": 1014.0,
        "end": 1019.0
    },
    {
        "text": " Acá podemos decir, pero ¿cuánto vale esto?",
        "start": 1022.0,
        "end": 1027.0
    },
    {
        "text": " Entonces, entramos a la evaluación de subjetivas personales,",
        "start": 1028.0,
        "end": 1031.0
    },
    {
        "text": " es decir, ¿cuánto vale para algunos de ustedes o cualquier de ustedes no ir al cine?",
        "start": 1031.0,
        "end": 1036.0
    },
    {
        "text": " Y alguno puede decir, para mí vale muchísimo, porque me encanta ver 10 películas seguidas al cine.",
        "start": 1036.0,
        "end": 1042.0
    },
    {
        "text": " Y otro me dice, mira, mira, mira, mira, mira nada, yo el cine no voy a interés, no voy a interés.",
        "start": 1043.0,
        "end": 1047.0
    },
    {
        "text": " Y así como aqueliten.",
        "start": 1048.0,
        "end": 1050.0
    },
    {
        "text": " Entonces, por eso es importante no perder de vista que las evaluaciones que hagamos,",
        "start": 1051.0,
        "end": 1056.0
    },
    {
        "text": " cada uno nosotros, es totalmente válido, pero son elementos que tienen una carga subjetiva, válida, pero subjetiva.",
        "start": 1056.0,
        "end": 1063.0
    },
    {
        "text": " Me refiero a que es diferente la evaluación que hagamos cada uno nosotros.",
        "start": 1065.0,
        "end": 1068.0
    },
    {
        "text": " O puede coincidir, pero no, ni se llame.",
        "start": 1068.0,
        "end": 1070.0
    },
    {
        "text": " También si se dedica a estudiar, renunciar a trabajar,",
        "start": 1072.0,
        "end": 1075.0
    },
    {
        "text": " por lo tanto acá está renunciando a percibir un ingreso, acá está renunciando a obviamente",
        "start": 1075.0,
        "end": 1081.0
    },
    {
        "text": " el salario que puede obtener si trabaja.",
        "start": 1083.0,
        "end": 1086.0
    },
    {
        "text": " Todos estos costos son costos implícitos, no implica a una regallón monetaria para esta persona que está dirigiendo estudiar.",
        "start": 1087.0,
        "end": 1094.0
    },
    {
        "text": " ¿Se ve?",
        "start": 1097.0,
        "end": 1098.0
    },
    {
        "text": " Veamos que ¿qué podemos analizar sobre el recurso dinero?",
        "start": 1099.0,
        "end": 1104.0
    },
    {
        "text": " El otro recurso que está evaluando a esta persona que está diciendo, bueno, estudio o trabajo.",
        "start": 1105.0,
        "end": 1111.0
    },
    {
        "text": " Obviamente va a tener erogaciones en materiales de estudio, libros, etcétera, ¿no?",
        "start": 1112.0,
        "end": 1118.0
    },
    {
        "text": " Costos de transporte, a los jaminos si tiene que alojarse donde está estudiando, ¿no?",
        "start": 1119.0,
        "end": 1125.0
    },
    {
        "text": " Es decir, en definitiva lo que está sacrificando acá, ¿qué es?",
        "start": 1126.0,
        "end": 1130.0
    },
    {
        "text": " Es sacrificando un volumen de dinero que podría brindar esa satisfacción, ¿no?",
        "start": 1131.0,
        "end": 1136.0
    },
    {
        "text": " Una utilidad si lo consumiera es la compra de diferentes bienes y servicios.",
        "start": 1137.0,
        "end": 1141.0
    },
    {
        "text": " Esa es el costo espícito que tiene en este caso optar por esta actividad.",
        "start": 1144.0,
        "end": 1149.0
    },
    {
        "text": " Lo ven?",
        "start": 1152.0,
        "end": 1153.0
    },
    {
        "text": " ¿Sí?",
        "start": 1154.0,
        "end": 1155.0
    },
    {
        "text": " Compran los elementos o los gastos que tienen que realizar para estudiar y bueno eso podía usarlo en otra cosa.",
        "start": 1156.0,
        "end": 1162.0
    },
    {
        "text": " Entonces, acá sí ya estamos en mejores condiciones como para definir el costo de oportunidad.",
        "start": 1168.0,
        "end": 1173.0
    },
    {
        "text": " El costo de oportunidad, como dice ahí, de la opción que finalmente se elige para asinar nuestros recursos de escasos,",
        "start": 1174.0,
        "end": 1182.0
    },
    {
        "text": " es justamente la mejor opción que sacrificamos, o sea la alternativa que más logramos se va a que renunciamos.",
        "start": 1183.0,
        "end": 1189.0
    },
    {
        "text": " Como individuos, vamos a asignar nuestros recursos, tiempos, dinero, etcétera, a acciones que le damos un valor, que tiene un valor para nosotros.",
        "start": 1194.0,
        "end": 1201.0
    },
    {
        "text": " El costo de oportunidad no es ni manimero que dice conjunto de cosas que se sacrifican, que renuncia,",
        "start": 1203.0,
        "end": 1211.0
    },
    {
        "text": " por asignar un recurso que sabemos que son escasos, ha determinado fin y no otro.",
        "start": 1213.0,
        "end": 1219.0
    },
    {
        "text": " Este costo de oportunidad es que vamos a considerar el punto de vista económico para la toma de decisiones, con estos componentes, explícitos,",
        "start": 1223.0,
        "end": 1232.0
    },
    {
        "text": " el implícito y no considerar los costos unidos.",
        "start": 1233.0,
        "end": 1235.0
    },
    {
        "text": " ¿Preguntas de acá?",
        "start": 1235.0,
        "end": 1237.0
    },
    {
        "text": " Sí, están colgadas esto, ¿no?",
        "start": 1248.0,
        "end": 1250.0
    },
    {
        "text": " ¿Preguntas de acá?",
        "start": 1250.0,
        "end": 1252.0
    },
    {
        "text": " Bueno, el costo que hay que considerar en la toma de decisiones, con estos componentes que yo les mencionaba.",
        "start": 1264.0,
        "end": 1270.0
    },
    {
        "text": " Entre dos opciones IB, obviamente 8x1 es exclusible, dado el marco este que estamos analizando de limitación de recursos,",
        "start": 1270.0,
        "end": 1285.0
    },
    {
        "text": " elegir una opción tiene un costo, cuál es el costo, obviamente, haber renunciado a la otra, haber renunciado a la opción B.",
        "start": 1286.0,
        "end": 1293.0
    },
    {
        "text": " Lo mismo en el caso de ver, implica un costo renunciar a...",
        "start": 1294.0,
        "end": 1300.0
    },
    {
        "text": " El costo de oportunidad es el costo económico, como yo les decía en la suma de los costos explícitos, esto que tiene relaciones monetarias,",
        "start": 1309.0,
        "end": 1317.0
    },
    {
        "text": " los implícitos son las evaluaciones o elementos que no son visibles y que tenemos que considerar en la toma de decisiones y en especial cuidado de no incluir los costos unidos.",
        "start": 1318.0,
        "end": 1332.0
    },
    {
        "text": " Este costo de oportunidad es el costo económico, mientras que el costo contable sólo se limita a considerar a que las elevaciones monetarias,",
        "start": 1333.0,
        "end": 1341.0
    },
    {
        "text": " es decir, el costo explícito y esta es la diferencia sustancial del costo económico con el contable,",
        "start": 1342.0,
        "end": 1350.0
    },
    {
        "text": " solo vamos a utilizar, obviamente, el económico.",
        "start": 1350.0,
        "end": 1353.0
    },
    {
        "text": " Bueno, en este ejemplo que decíamos hoy, trabajar y estudiar, si estudia esta persona pierre salarios,",
        "start": 1358.0,
        "end": 1366.0
    },
    {
        "text": " pierre salarios porque están anunciando trabajar, son salarios no presividos, digamos.",
        "start": 1367.0,
        "end": 1374.0
    },
    {
        "text": " También pierde no solo elementos de dinero, sino que pierde, bueno, canal experiencia, en comparabilidades, como dice ahí,",
        "start": 1375.0,
        "end": 1383.0
    },
    {
        "text": " es decir, en definitiva lo que está sacrificando son todos los beneficios que genera trabajar.",
        "start": 1383.0,
        "end": 1388.0
    },
    {
        "text": " Si trabaja, bueno, si trabaja, ¿cuál es el costo que tiene esto? Bueno, el costo que tiene es que va a demorar más en la acumular conocimientos para estudiar,",
        "start": 1389.0,
        "end": 1408.0
    },
    {
        "text": " lo tanto va a demorar más en recibirse, se entiende que una persona más calificada o recibida va a tener mejores ingresos,",
        "start": 1408.0,
        "end": 1414.0
    },
    {
        "text": " por lo tanto va a diferir aquí, el hecho de obtener mejores ingresos por recibirse, o sea que en definitiva están sacrificando lo beneficio que obtiene al estudiar.",
        "start": 1414.0,
        "end": 1425.0
    },
    {
        "text": " Los otros ejemplos son similares, es decir, si tengo una casa de veraneo, un apartamento de veraneo,",
        "start": 1429.0,
        "end": 1437.0
    },
    {
        "text": " ¿qué hago? Voy a veranear yo, ahora el verano o el alquilo. Lo mismo, acá las dos opciones tienen una renuncia a beneficios.",
        "start": 1437.0,
        "end": 1448.0
    },
    {
        "text": " Si el alquilo obviamente estoy renunciando al beneficio que me reporta a mí y yo de vacaciones.",
        "start": 1449.0,
        "end": 1454.0
    },
    {
        "text": " Y si voy yo, obviamente renuncio el ingreso que puedo obtener silbio alquilo.",
        "start": 1456.0,
        "end": 1460.0
    },
    {
        "text": " Los mismos con los otros casos que está ahí, ¿no? Si voy a pescar o justo ahí un cardúme que se da esta época de la ni se casan amigos,",
        "start": 1461.0,
        "end": 1472.0
    },
    {
        "text": " voy a la casamiento o voy a pescar. Si voy a pescar obviamente pide la satisfacción que me da ver el casamiento del amigo y si voy a casamiento del amigo,",
        "start": 1472.0,
        "end": 1483.0
    },
    {
        "text": " pierdo la satisfacción que me da pescar. Voy a la casan y pareja. Bueno lo mismo, ¿no?",
        "start": 1483.0,
        "end": 1493.0
    },
    {
        "text": " Acá hay hay cuánto valor o el beneficio que me da, ir al cine por respecto a ir a la casan y pareja.",
        "start": 1493.0,
        "end": 1500.0
    },
    {
        "text": " Si voy al cine, pierdo el beneficio de estar con mi pareja y si voy a, con mi pareja pierdo el beneficio del al cine.",
        "start": 1501.0,
        "end": 1508.0
    },
    {
        "text": " ¿Te desven si te dicen voy al cine? Se entiende la idea, o sea, en definitiva cualquier ejemplo que podemos poner esta,",
        "start": 1513.0,
        "end": 1522.0
    },
    {
        "text": " esto es elemento a considerar, ¿no? La idea acá a internalizar en corporales que cada opción que tiene tiene un costo,",
        "start": 1522.0,
        "end": 1529.0
    },
    {
        "text": " el costo es justamente el beneficio que pierdo, subir a dirigido a la otra opción. ¿Se entiende en muy cachos? Bien.",
        "start": 1529.0,
        "end": 1539.0
    },
    {
        "text": " Veamos el caso de un productor, si un productor tiene una pierra y está considerando producir o alquilarla.",
        "start": 1539.0,
        "end": 1550.0
    },
    {
        "text": " Bueno, el costo de producir, costo oportunidad de producir, costo económico, costo económico,",
        "start": 1555.0,
        "end": 1564.0
    },
    {
        "text": " el costo oportunidad de producir, tiene los componentes que me implica a mí, poner el andamilaje un proceso productivo,",
        "start": 1565.0,
        "end": 1573.0
    },
    {
        "text": " insu, materias primas, salarios, decir todos los costos explícitos que haya ahí.",
        "start": 1573.0,
        "end": 1579.0
    },
    {
        "text": " Pero además tengo que considerar a lo que renuncio, en este caso hay un costo implícito,",
        "start": 1582.0,
        "end": 1588.0
    },
    {
        "text": " que es lo que no recibe por no alquilarlo, o sea que el depuesto oportunidad, en este caso, sería la suma del proceso productivo,",
        "start": 1588.0,
        "end": 1599.0
    },
    {
        "text": " mas este alquiler al que está renunciando.",
        "start": 1599.0,
        "end": 1602.0
    },
    {
        "text": " ¿En el que no es tener el costo monetario? ¿En cuál?",
        "start": 1607.0,
        "end": 1614.0
    },
    {
        "text": " ¿En el que la de abandonamiento? ¿Aca?",
        "start": 1615.0,
        "end": 1617.0
    },
    {
        "text": " Sí, no tenía cuenta el tiempo derecho, el costo tiene que trabajar contra arandando y suelor andando,",
        "start": 1617.0,
        "end": 1624.0
    },
    {
        "text": " no tiene que trabajar, y es un costo más.",
        "start": 1624.0,
        "end": 1627.0
    },
    {
        "text": " A ver si te lo digo, acá vos tenés un costo de sumos, salarios, yo que si es mil pesos, poner,",
        "start": 1628.0,
        "end": 1633.0
    },
    {
        "text": " bien, pero...",
        "start": 1633.0,
        "end": 1634.0
    },
    {
        "text": " Sí, pero es todo costo monetario.",
        "start": 1634.0,
        "end": 1637.0
    },
    {
        "text": " Esto sí.",
        "start": 1637.0,
        "end": 1638.0
    },
    {
        "text": " Y ahí también falta para el costo oportunidad tener en cuenta los costos indisicos que no están ahí.",
        "start": 1638.0,
        "end": 1643.0
    },
    {
        "text": " En este caso estoy conserando el costo implícito de no alquilarlo.",
        "start": 1643.0,
        "end": 1646.0
    },
    {
        "text": " Y no lo bajo.",
        "start": 1646.0,
        "end": 1649.0
    },
    {
        "text": " Lo que voy a decir a no sé si tendría ni bien, yo podría incorporar acá también, si yo lo trabajo,",
        "start": 1649.0,
        "end": 1656.0
    },
    {
        "text": " a ver, acá no sabemos si lo trabaja, no.",
        "start": 1656.0,
        "end": 1659.0
    },
    {
        "text": " Si lo trabaja, ahí sí también podría como costo implícito el salario que podría obtener otro lado.",
        "start": 1659.0,
        "end": 1664.0
    },
    {
        "text": " ¿No?",
        "start": 1665.0,
        "end": 1667.0
    },
    {
        "text": " Y era como preguntaba.",
        "start": 1667.0,
        "end": 1670.0
    },
    {
        "text": " Yo pongo un salón, por ejemplo en mi casa, que es un salón guayalado de fotocopias.",
        "start": 1670.0,
        "end": 1675.0
    },
    {
        "text": " Tengo todos los costos que tengo luz, papelería, etcétera, etcétera, pero también tendría que incorporar el salario que obtener otro lado.",
        "start": 1675.0,
        "end": 1683.0
    },
    {
        "text": " ¿Cómo costo?",
        "start": 1683.0,
        "end": 1685.0
    },
    {
        "text": " ¿Cómo costo de sumo, del tiempo que ahí nos lo hicieron?",
        "start": 1685.0,
        "end": 1689.0
    },
    {
        "text": " Sí, el tiempo...",
        "start": 1689.0,
        "end": 1691.0
    },
    {
        "text": " Bueno, sí, el tiempo.",
        "start": 1692.0,
        "end": 1694.0
    },
    {
        "text": " Si querés, el tiempo, pero comparado con lo que puedo obtener en ese tiempo.",
        "start": 1694.0,
        "end": 1697.0
    },
    {
        "text": " ¿Por qué? Píjate por qué, perdón en la digresión.",
        "start": 1697.0,
        "end": 1701.0
    },
    {
        "text": " Si yo estoy trabajando en este salón y digo, ven lo mil pesos, si gasto luz, gasto, no sé qué, y quedan 100 pesos.",
        "start": 1701.0,
        "end": 1709.0
    },
    {
        "text": " Yo hagan 100 pesos.",
        "start": 1709.0,
        "end": 1711.0
    },
    {
        "text": " Pero en realidad lo que tengo que decir es si yo, en vez de estar trabajando ahí, me cancio en peso. ¿Cuánto puedo obtener otro lado?",
        "start": 1711.0,
        "end": 1717.0
    },
    {
        "text": " Si gano más de 100, ¿qué hago?",
        "start": 1718.0,
        "end": 1720.0
    },
    {
        "text": " ¿Sí?",
        "start": 1723.0,
        "end": 1724.0
    },
    {
        "text": " Sí, es roclado.",
        "start": 1724.0,
        "end": 1726.0
    },
    {
        "text": " Sí, es lo negocio, pero es lo que tengo.",
        "start": 1726.0,
        "end": 1728.0
    },
    {
        "text": " Por eso hay que incorporarlo. Si gano menos de 100, me quedo.",
        "start": 1728.0,
        "end": 1731.0
    },
    {
        "text": " ¿De puta vista racional?",
        "start": 1731.0,
        "end": 1733.0
    },
    {
        "text": " Tengo que decir, bueno, capaz que me encanta trabajar en el fotocopias. Yo dos de maño. ¿De puta vista racional?",
        "start": 1733.0,
        "end": 1738.0
    },
    {
        "text": " Pero acá, más simple, acá no estamos considerando, pero podemos ponerse en caso que si el propietario está trabajando en el campo,",
        "start": 1738.0,
        "end": 1746.0
    },
    {
        "text": " habría incorporado el salario como un costo impícito. Es algo que presiviría él.",
        "start": 1746.0,
        "end": 1751.0
    },
    {
        "text": " Lo vieron esto de lo que dice la compañera.",
        "start": 1751.0,
        "end": 1755.0
    },
    {
        "text": " Bueno, en este caso él no dice que va a trabajar, está simplemente considerando si la alquila o produce,",
        "start": 1759.0,
        "end": 1767.0
    },
    {
        "text": " estoy diciendo, bueno, insumo salarios costos de espícitos, más lo que no recibe por arrendar que es el único costo impícito que estaría acá.",
        "start": 1767.0,
        "end": 1774.0
    },
    {
        "text": " Si él trabajaba, o que él me decía a ella, había que meterlo como un costo impícito de salario no ha presivido, que lo tendría a todo lado.",
        "start": 1775.0,
        "end": 1783.0
    },
    {
        "text": " Bueno, el ejemplo que está ahí, miren, este prédio está pasando, puede aquilar en 500 pesos, y a su bestia uno es costo de producción, dado por insumos,",
        "start": 1792.0,
        "end": 1803.0
    },
    {
        "text": " 250 y salarios 400, por lo tanto el costo oportunidad va a ser los costos espícitos, dado por lo sin sumo, más los salarios 650, más que el costo impícito que tiene de no arrendar de 500, por lo tanto el costo oportunidad es 1.150.",
        "start": 1803.0,
        "end": 1822.0
    },
    {
        "text": " Aquí tenemos otro ejemplo de el costo oportunidad de una elección, de estudiar y trabajar, un joven de elegir entre trabajar y estudiar en la Universidad Amba de Teodias tiene la misma cantidad de horas de trabajo, horas de tiempo,",
        "start": 1823.0,
        "end": 1846.0
    },
    {
        "text": " y dice si estudia tiene gasto de transporte por 400 y trabaja 350, alimentación 100 en ambos lados, gasto de estimenta 200 estudias y trabaja 150, materiales solo si estudia y salarios que presiviría si trabaja.",
        "start": 1847.0,
        "end": 1870.0
    },
    {
        "text": " ¿Cuál es el costo oportunidad acá de la acción de estudiar?",
        "start": 1871.0,
        "end": 1877.0
    },
    {
        "text": " ¿Sumar todo lo que estudia? ¿Cuánto queda?",
        "start": 1877.0,
        "end": 1899.0
    },
    {
        "text": " ¿200 dices abajo? 750, más 800, por lo que no recibe por trabajar señores. ¿Están la acuerdo?",
        "start": 1900.0,
        "end": 1914.0
    },
    {
        "text": " ¿Sumo todo acá? 750, que lo que gasta por estudiar más 800 que renunciado y trabaja. ¿Cómo?",
        "start": 1915.0,
        "end": 1936.0
    },
    {
        "text": " Primero hay botenés que tomar en cuenta comparado con el resto, ¿no? ¿Por qué pasa? Si bien botenés un gasto ahí, si estudia tienes que ver si trabajaba si no tuviera algún gasto igual de esos rubros.",
        "start": 1937.0,
        "end": 1956.0
    },
    {
        "text": " Entonces lo que vamos a ver primero hoy es esto, ¿qué es costo un dido acá? Fíjate, en transporte haga lo que haga, obviamente va a tener el mínimo 350 pesos.",
        "start": 1956.0,
        "end": 1973.0
    },
    {
        "text": " En alimento haga lo que haga va a tener si en peso porque se va a alimentar y en ambos gastos igual.",
        "start": 1974.0,
        "end": 1980.0
    },
    {
        "text": " En vestimenta va a tener un piso ahí que es 150. Entonces estos son costos unidos.",
        "start": 1980.0,
        "end": 1990.0
    },
    {
        "text": " Estos costos unidos que da 600 es un costo que independientemente haga lo que haga lo va a tener igual.",
        "start": 1991.0,
        "end": 2000.0
    },
    {
        "text": " Por lo tanto estos costos no debo considerarlos.",
        "start": 2000.0,
        "end": 2005.0
    },
    {
        "text": " Entonces como decía y compañero acá veamos la diferencia, la diferencia es justamente los costos monetarios relevantes que va a tener esta acción.",
        "start": 2006.0,
        "end": 2021.0
    },
    {
        "text": " Los costos monetarios relevantes, la diferencia de estos conceptos, ¿no? Y salario no. Tenemos, obviamente, 50 en gastos de transporte, que es el gasto incremental, 4151 en el otro.",
        "start": 2022.0,
        "end": 2039.0
    },
    {
        "text": " En alimento nada, en vestimenta 50 y materiales 50. Estos son los costos relevantes que sí tengo de considerar en la toma de decisiones, los gastos de incrementales que me implica estudiar.",
        "start": 2039.0,
        "end": 2054.0
    },
    {
        "text": " Por lo tanto 9, 750 como en la suma total, sino que es 150.",
        "start": 2054.0,
        "end": 2062.0
    },
    {
        "text": " ¿Qué o? A su vez hay un costo impícito acá, ¿cuál es el costo impícito? Es el salario que no persibe por estudiar. Estos 800 pesos que podría presivir en forma manual si tuviera trabajando.",
        "start": 2063.0,
        "end": 2084.0
    },
    {
        "text": " El joven al definir que va a estudiar está renunciando a casa trabajar, por tanto estar renunciando a presivir el salario.",
        "start": 2085.0,
        "end": 2096.0
    },
    {
        "text": " Por tanto un costo también para él esta decisión de estudiar. Por lo tanto este costo impíciotamente o que considerarlo.",
        "start": 2096.0,
        "end": 2106.0
    },
    {
        "text": " En resumen cuenta, el resumen cuenta, perdón, el costo oportunidad de esta decisión de estudiar va a ser 9,50, es decir, 150 que es el costo monetario de 800 impícitos.",
        "start": 2107.0,
        "end": 2117.0
    },
    {
        "text": " ¿Dudas? ¿Qué o bien? Bueno, muy bien.",
        "start": 2120.0,
        "end": 2129.0
    },
    {
        "text": " ¿Dudas? ¿Dudas? ¿Dudas? ¿Dudas? ¿Dudas? ¿Dudas? ¿Dudas? ¿Dudas? ¿Dudas? ¿Dudas? ¿Dudas? ¿Dudas? ¿Dudas? ¿Dudas? ¿Dudas? ¿Dudas? ¿Dudas? ¿Dudas? ¿Dudas? ¿Dudas? ¿Dudas? ¿Dudas? ¿Dudas? ¿Dudas? ¿Dudas? ¿Dudas? ¿Dudas? ¿Dudas? ¿Dudas? ¿Dudas? ¿Dudas? ¿Dudas? ¿Dudas? ¿Dudas? ¿Dudas? ¿Dudas? ¿Dudas? ¿Dudas? ¿Dudas? ¿Dudas? ¿Dudas? ¿Dudas? ¿Dudas? ¿Dudas? ¿",
        "start": 2136.0,
        "end": 2137.0
    },
    {
        "text": " Bueno, estoy moviendo la edificación de los costos relevantes, la toma de decisiones, el costo de oportunidad,",
        "start": 2166.0,
        "end": 2180.0
    },
    {
        "text": " estaba todo asociado al tema de la escasez y la ansesidad de elegir, vamos a ir ahora a ver algo",
        "start": 2180.0,
        "end": 2190.2
    },
    {
        "text": " vinculado a esto que es el enfoque racional. Vamos a ver el análisis costo beneficio, la",
        "start": 2190.2,
        "end": 2200.16
    },
    {
        "text": " edificación de los costos y beneficios, cómo se miden ese tipo de costos y beneficios,",
        "start": 2200.16,
        "end": 2205.12
    },
    {
        "text": " que el evento nos sirio para cuantificarlos y para medirlos y el análisis imaginar",
        "start": 2205.12,
        "end": 2210.7599999999998
    },
    {
        "text": " en la decisión. Entonces, vamos a sumir que el ser humano tiene un enfoque racional en",
        "start": 2210.7599999999998,
        "end": 2218.6
    },
    {
        "text": " la toma de decisiones. ¿Qué quiere decir esto? El enfoque racional en la toma de decisiones",
        "start": 2218.6,
        "end": 2225.6
    },
    {
        "text": " está diciendo que los seres humanos va a comparar cuando toma una decisión para definir",
        "start": 2225.6,
        "end": 2237.72
    },
    {
        "text": " una acción, ¿qué beneficio reporta esa acción, qué costos tiene y la va a ser siempre",
        "start": 2237.72,
        "end": 2243.92
    },
    {
        "text": " cuando lo beneficio que tenga para realizar esa acción supene a los costos. Si es así,",
        "start": 2243.92,
        "end": 2250.6800000000003
    },
    {
        "text": " entonces podemos decir que ese agente económico tiene un comportamiento racional y esto se",
        "start": 2250.6800000000003,
        "end": 2255.88
    },
    {
        "text": " sustenta en el análisis costo beneficio. Entonces, las casas, como mencionamos a su ratito,",
        "start": 2255.88,
        "end": 2268.0
    },
    {
        "text": " obliga a elegir entre diferentes alternativas que son excluyentes entre sí. Esta lección",
        "start": 2268.0,
        "end": 2274.24
    },
    {
        "text": " implica renunciar a otras opciones. Ahora, ¿con qué criterio se hace esa elección por",
        "start": 2274.24,
        "end": 2280.84
    },
    {
        "text": " la cual es dificultiva de esa agente económico opta? Bueno, lo que estamos diciendo es que",
        "start": 2280.84,
        "end": 2287.08
    },
    {
        "text": " se asume un criterio de racionalidad económica. Esto es que los agentes se eligen la alternativa",
        "start": 2287.08,
        "end": 2297.4
    },
    {
        "text": " en donde los beneficios supenen a los costos. Entonces, aún tengo un conjunto de opciones",
        "start": 2297.4,
        "end": 2305.4
    },
    {
        "text": " de N opciones, X1 a XN. El agente va comparando los beneficios de cada acción, XUI y los costos",
        "start": 2305.4,
        "end": 2315.6800000000003
    },
    {
        "text": " de esa acción de forma de que se cumple que si los beneficios supenen a los costos de",
        "start": 2315.6800000000003,
        "end": 2320.7200000000003
    },
    {
        "text": " esa acción de XUI, la gente va a optar por esa acción de XUI. ¿Qué costos va a considerar",
        "start": 2320.72,
        "end": 2333.08
    },
    {
        "text": " este agente, el costo de oportunidad que usimos viendo anteriormente? Y el otro componente",
        "start": 2333.08,
        "end": 2341.3599999999997
    },
    {
        "text": " que tiene que definir acá para considerar esta acción es justamente los beneficios, tiene",
        "start": 2341.3599999999997,
        "end": 2349.64
    },
    {
        "text": " que identificar y definir los de forma correcta. Entonces, identificar en forma correcta los",
        "start": 2349.64,
        "end": 2362.2
    },
    {
        "text": " costos y los beneficios de las acciones y a su vez tener una medida que permita comparar",
        "start": 2362.2,
        "end": 2368.96
    },
    {
        "text": " los costos y los beneficios. Nosotros vimos hoy así en forma medio intuitiva cómo puede",
        "start": 2368.96,
        "end": 2375.24
    },
    {
        "text": " haber una valoración subjetiva de ciertos costos. También vamos a ver que puede haber una",
        "start": 2375.24,
        "end": 2379.68
    },
    {
        "text": " valoración subjetiva de los beneficios. Entonces, respecto a los costos sabemos que tenemos",
        "start": 2379.68,
        "end": 2394.7999999999997
    },
    {
        "text": " considerado el costo de oportunidad, tal como lo que nos nos desarrollamos, costos explícios",
        "start": 2394.7999999999997,
        "end": 2398.8799999999997
    },
    {
        "text": " de impisto y no consideran los fundidos. Y habíamos dicho que los costos de una alternativa",
        "start": 2398.88,
        "end": 2410.1600000000003
    },
    {
        "text": " será parte de los beneficios de la otra y viceversa, lo beneficio de la alternativa también",
        "start": 2410.1600000000003,
        "end": 2416.48
    },
    {
        "text": " es parte de los costos de la otra. Si por ejemplo, y es la alternativa X es la que realmente",
        "start": 2416.48,
        "end": 2424.76
    },
    {
        "text": " se opta por esta gente económico, dentro de sus beneficios, vas a estar los costos de otra",
        "start": 2424.76,
        "end": 2430.1200000000003
    },
    {
        "text": " alternativa Z, que son los que se incurran por no optar por esa acción Z.",
        "start": 2430.1200000000003,
        "end": 2435.0400000000004
    },
    {
        "text": " Entre sus costos, dice ahí, van a estar los beneficios de Z, los beneficios de la alternativa",
        "start": 2435.0400000000004,
        "end": 2443.36
    },
    {
        "text": " Z, que son los que se renuncia a obtener la, a la legislativa alternativa, y que son",
        "start": 2443.36,
        "end": 2449.5200000000004
    },
    {
        "text": " costos implícitos de esa misma alternativa. Bueno, hoy decimos, por ejemplo, bueno, que",
        "start": 2449.52,
        "end": 2469.72
    },
    {
        "text": " beneficio tiene para un individuo estudiar, ¿no? ¿Cómo podemos cuantificar eso? ¿Qué",
        "start": 2469.72,
        "end": 2476.8
    },
    {
        "text": " componentes integran ese beneficio? Bueno, por un lado, o no puede decir, bueno, hay un",
        "start": 2476.8,
        "end": 2483.6000000000004
    },
    {
        "text": " beneficio monetario, ese ingreso futuro adicional que implica estudiar. En este caso estamos",
        "start": 2483.6000000000004,
        "end": 2492.6000000000004
    },
    {
        "text": " hablando de algo cuantificable, observable, medido en unidades de dinero, pero a su vez",
        "start": 2492.6000000000004,
        "end": 2499.92
    },
    {
        "text": " hay también un componente que no es monetario, que va a la satisfacción que genera a querir",
        "start": 2499.92,
        "end": 2506.04
    },
    {
        "text": " nuevos conocimientos, y esto es una unidad de medida subjetiva, no observable y que hay",
        "start": 2506.04,
        "end": 2516.12
    },
    {
        "text": " que tratar de medir, ¿no? ¿Cómo se es mío de esta satisfacción o placer, en este caso,",
        "start": 2516.12,
        "end": 2521.6
    },
    {
        "text": " que genera esta actividad, ¿no? Y así ocurre con la mayoría de los elementos. Entonces,",
        "start": 2521.6,
        "end": 2530.7599999999998
    },
    {
        "text": " vamos a ver esta necesidad que hay de medir ambos componentes, o sea, me refiero a costumbre",
        "start": 2530.76,
        "end": 2537.2000000000003
    },
    {
        "text": " beneficios en términos de la misma unidad de medida, en términos de satisfacción o en términos",
        "start": 2537.2000000000003,
        "end": 2543.2400000000002
    },
    {
        "text": " de unidades monetarias. Vamos a ver cómo nos da herramienta la ciencia económica para",
        "start": 2543.2400000000002,
        "end": 2548.92
    },
    {
        "text": " medir esto en unidades monetarias, en términos monetarios. Es decir, esta satisfacción,",
        "start": 2548.92,
        "end": 2558.8
    },
    {
        "text": " este placer, esta utilidad, vamos a tratar de expresarla en términos monetarios en zona de",
        "start": 2558.8,
        "end": 2563.2000000000003
    },
    {
        "text": " comparar la diferentes costos y beneficios.",
        "start": 2563.2000000000003,
        "end": 2566.0800000000004
    },
    {
        "text": " Efectivamente, hice valor monetario que el individuo va a dar la cada acción, refleja una",
        "start": 2572.8,
        "end": 2577.5600000000004
    },
    {
        "text": " basión subjetiva que realiza esa gente, que realiza esa gente, ¿no? Es decir, vamos a ver cómo",
        "start": 2577.5600000000004,
        "end": 2584.48
    },
    {
        "text": " en los individuos, bajo este supuesto de comportamiento, de razonaridad económica, hace una valoración",
        "start": 2585.04,
        "end": 2592.32
    },
    {
        "text": " de los beneficios, de los costos que tienes alternativas. Y para eso vamos a ver dos consejos",
        "start": 2592.32,
        "end": 2598.8
    },
    {
        "text": " que nos van a ayudar, la disposición a pagar y el precio de reserva.",
        "start": 2598.8,
        "end": 2602.88
    },
    {
        "text": " Es decir, la idea es que esta tarde, esta vez se nos medida que permita comparar costos y beneficios,",
        "start": 2606.48,
        "end": 2611.36
    },
    {
        "text": " que es el valor monetario que el individuo estaría dispuesto a pagar para obtener la satisfacción",
        "start": 2614.48,
        "end": 2636.8
    },
    {
        "text": " de una alternativa.",
        "start": 2636.8,
        "end": 2638.2400000000002
    },
    {
        "text": " Es el máximo volómo netario que el individuo estaría dispuesto a pagar para obtener la satisfacción",
        "start": 2646.48,
        "end": 2650.88
    },
    {
        "text": " de una alternativa cualquier.",
        "start": 2650.88,
        "end": 2652.1600000000003
    },
    {
        "text": " ¿Cuánto terían dispuestos a pagar por ir a ver el partido de fútbol del club de",
        "start": 2656.0,
        "end": 2662.36
    },
    {
        "text": " cuál está esa niucha? ¿Cuánto terían dispuesto a pagar por ir a Rusia ahora a ver el mundial?",
        "start": 2662.36,
        "end": 2669.2400000000002
    },
    {
        "text": " ¿Cuánto? ¿Cuánto? ¿Cuánto después de pagar?",
        "start": 2673.2000000000003,
        "end": 2681.44
    },
    {
        "text": " ¿Viene un concierto de un conjunto que usted les gusta? ¿Cuánto terían dispuesto a pagar?",
        "start": 2681.44,
        "end": 2693.92
    },
    {
        "text": " ¿Quién te gusta, por ejemplo?",
        "start": 2699.2000000000003,
        "end": 2700.64
    },
    {
        "text": " Nada.",
        "start": 2705.2400000000002,
        "end": 2705.76
    },
    {
        "text": " ¿Polmacárneno fuiste?",
        "start": 2705.76,
        "end": 2709.16
    },
    {
        "text": " Violeta tampoco fuiste.",
        "start": 2710.16,
        "end": 2712.6
    },
    {
        "text": " ¿No te quería mirarlo después? ¿Está creado algo?",
        "start": 2712.6,
        "end": 2718.44
    },
    {
        "text": " Peso, la acontecimiento, se hay que ir.",
        "start": 2718.44,
        "end": 2720.64
    },
    {
        "text": " ¿No?",
        "start": 2720.64,
        "end": 2721.64
    },
    {
        "text": " ¡No!",
        "start": 2721.64,
        "end": 2722.64
    },
    {
        "text": " No, a violeta fue mi mujer y mi hija.",
        "start": 2722.64,
        "end": 2726.64
    },
    {
        "text": " ¿Dos mil y pico peso?",
        "start": 2726.64,
        "end": 2729.44
    },
    {
        "text": " ¡No!",
        "start": 2729.44,
        "end": 2730.44
    },
    {
        "text": " ¡Graci!",
        "start": 2730.44,
        "end": 2731.64
    },
    {
        "text": " Me queríamos ir.",
        "start": 2731.64,
        "end": 2733.44
    },
    {
        "text": " Bueno, yo no, voy ni loco, pero estamos.",
        "start": 2733.44,
        "end": 2737.3199999999997
    },
    {
        "text": " Estamos dispuestos a pagar cero ahí por ello.",
        "start": 2738.32,
        "end": 2740.48
    },
    {
        "text": " Bueno, la idea, volviendo, ¿cuánto te dispuesto a pagar por algo?",
        "start": 2740.48,
        "end": 2746.88
    },
    {
        "text": " Lo que decía que realmente se efectivice la acción, ¿no?",
        "start": 2746.88,
        "end": 2749.88
    },
    {
        "text": " Y si, quizás a ustedes están dispuestos a pagar,",
        "start": 2749.88,
        "end": 2753.6800000000003
    },
    {
        "text": " ¿podrían haber un conjunto de algo o a ver el mundial de fútbol?",
        "start": 2753.6800000000003,
        "end": 2756.88
    },
    {
        "text": " No sé. Eso es lo que decía que realmente vayan,",
        "start": 2756.88,
        "end": 2759.6000000000004
    },
    {
        "text": " ni que realmente paguen lo que te dispuesto a pagar.",
        "start": 2759.6000000000004,
        "end": 2761.48
    },
    {
        "text": " ¿No?",
        "start": 2761.48,
        "end": 2762.48
    },
    {
        "text": " ¿Por qué?",
        "start": 2762.76,
        "end": 2766.08
    },
    {
        "text": " Porque en definitiva lo que estamos acá es tratando de ver cómo valor",
        "start": 2766.08,
        "end": 2771.12
    },
    {
        "text": " o una satisfacción que me da en este caso y la ver un conjunto de música",
        "start": 2771.12,
        "end": 2775.16
    },
    {
        "text": " que me gusta o vieron partido de fútbol o lo que sea.",
        "start": 2775.16,
        "end": 2778.92
    },
    {
        "text": " ¿Cuánto lo valor?",
        "start": 2778.92,
        "end": 2780.6
    },
    {
        "text": " Probablemente no sé si voy a ir.",
        "start": 2780.6,
        "end": 2782.32
    },
    {
        "text": " ¿Y es más?",
        "start": 2782.32,
        "end": 2784.72
    },
    {
        "text": " Si voy, quizás el precio no coincida con lo que estoy dispuesto a pagar.",
        "start": 2784.72,
        "end": 2788.12
    },
    {
        "text": " Lo que estoy dispuesto a pagar figura como un tope,",
        "start": 2788.12,
        "end": 2790.8
    },
    {
        "text": " como un techo, más de esto no pago.",
        "start": 2790.8,
        "end": 2794.0
    },
    {
        "text": " Yo por tal cosa más de esto, más no pago.",
        "start": 2794.0,
        "end": 2796.28
    },
    {
        "text": " O sea, pago menos pago.",
        "start": 2796.28,
        "end": 2797.4
    },
    {
        "text": " Si yo hubiera pagado menos por violeta, no era el 8-8,",
        "start": 2801.92,
        "end": 2805.6800000000003
    },
    {
        "text": " pero no tuve más remedio.",
        "start": 2805.6800000000003,
        "end": 2808.48
    },
    {
        "text": " Va a depender de que elemento subjetivo de contexto,",
        "start": 2811.48,
        "end": 2816.0
    },
    {
        "text": " supongábamos hipotéticamente acá hay gente que quería",
        "start": 2816.0,
        "end": 2818.96
    },
    {
        "text": " mochar el Rusia, me he hecho, paga, yo tuvi,",
        "start": 2818.96,
        "end": 2820.2400000000002
    },
    {
        "text": " pudo pagar 5.000 dólares, 20.000 dólares.",
        "start": 2820.2400000000002,
        "end": 2824.44
    },
    {
        "text": " 1.000 dólares.",
        "start": 2824.44,
        "end": 2827.48
    },
    {
        "text": " Tuvi, pudo pagar 500 pesos.",
        "start": 2827.48,
        "end": 2829.12
    },
    {
        "text": " Bueno, va a no sé, no sé si va a no va,",
        "start": 2829.12,
        "end": 2834.64
    },
    {
        "text": " pero va a depender de eventos de un montón de elementos.",
        "start": 2834.64,
        "end": 2836.92
    },
    {
        "text": " Si pueden, si no pueden, si les gusta cuál es la pasión que tiene.",
        "start": 2836.92,
        "end": 2840.76
    },
    {
        "text": " ¿Cuántos pesas no sé?",
        "start": 2840.76,
        "end": 2844.84
    },
    {
        "text": " Si tienen alguien en Rusia, yo que sé, en definitiva,",
        "start": 2844.84,
        "end": 2847.96
    },
    {
        "text": " hay un montón de componente que puede decidir la decisión.",
        "start": 2847.96,
        "end": 2852.76
    },
    {
        "text": " Ahora si van o no van, eso es todo tema.",
        "start": 2852.76,
        "end": 2854.36
    },
    {
        "text": " Y si van, cuánto van a pagar tampoco, lo que seguramente",
        "start": 2854.36,
        "end": 2857.92
    },
    {
        "text": " no van a pagar mal de lo que están dispuestos a pagar.",
        "start": 2857.92,
        "end": 2860.92
    },
    {
        "text": " En este marco razonal que estamos analizando.",
        "start": 2860.92,
        "end": 2863.36
    },
    {
        "text": " Entonces, volviendo a esto, supongamos que una satisfacción",
        "start": 2863.36,
        "end": 2867.6
    },
    {
        "text": " de aquel ir no es conocimiento para estudiar tiene un palo monetario,",
        "start": 2867.6,
        "end": 2871.48
    },
    {
        "text": " ¿no?",
        "start": 2871.48,
        "end": 2873.48
    },
    {
        "text": " Y que está intentando expresarlo.",
        "start": 2873.48,
        "end": 2875.36
    },
    {
        "text": " Esa disposición a pagar es lo que me ayuda para esta medición.",
        "start": 2875.36,
        "end": 2880.36
    },
    {
        "text": " Vamos a ver cómo cuantificar el componente no hemos",
        "start": 2880.36,
        "end": 2892.7400000000002
    },
    {
        "text": " detallido un costo de una decisión.",
        "start": 2892.7400000000002,
        "end": 2896.36
    },
    {
        "text": " Entonces, los vamos a ayudar con el precio mínimo que la gente",
        "start": 2896.36,
        "end": 2901.8
    },
    {
        "text": " estaría dispuesto a cobrar por asoportar la satisfacción",
        "start": 2901.8,
        "end": 2905.44
    },
    {
        "text": " de esa alternativa.",
        "start": 2905.44,
        "end": 2906.6000000000004
    },
    {
        "text": " Por ejemplo, a mí el precio mínimo, paire a ir al concierto",
        "start": 2906.6000000000004,
        "end": 2912.44
    },
    {
        "text": " violeta, seguramente nadie me lo iba a pagar.",
        "start": 2912.44,
        "end": 2917.6000000000004
    },
    {
        "text": " Pero bueno, en definitiva, en capacias me tentaba,",
        "start": 2917.6000000000004,
        "end": 2922.0800000000004
    },
    {
        "text": " y bueno, me escucho un concierto que no me da graba.",
        "start": 2922.0800000000004,
        "end": 2925.2000000000003
    },
    {
        "text": " Y bueno, mamá arriba, ¿no?",
        "start": 2925.2000000000003,
        "end": 2927.1200000000003
    },
    {
        "text": " El precio mínimo que estoy dispuesto a que estoy sigiendo a cobrar",
        "start": 2927.1200000000003,
        "end": 2931.6000000000004
    },
    {
        "text": " por algo que no me satisfaz.",
        "start": 2931.6,
        "end": 2932.6
    },
    {
        "text": " Me proponen alegremente si puedo cuidar unos nenitos,",
        "start": 2932.6,
        "end": 2940.6
    },
    {
        "text": " no te decinos de casa, el sado porque justo no están ellos.",
        "start": 2940.6,
        "end": 2943.92
    },
    {
        "text": " Y la verdad es que los nenitos se dividimos en soportables.",
        "start": 2943.92,
        "end": 2947.7599999999998
    },
    {
        "text": " Bueno, pero capaz que me pagan una buena suma que digo,",
        "start": 2947.7599999999998,
        "end": 2950.52
    },
    {
        "text": " bueno, por este precio, me va a arribar.",
        "start": 2950.52,
        "end": 2952.7599999999998
    },
    {
        "text": " Me fumo unos nenitos, no pasa nada.",
        "start": 2952.7599999999998,
        "end": 2955.24
    },
    {
        "text": " Se entiende la idea de decir, ¿cuánto tú dispuesto yo a exigir",
        "start": 2955.24,
        "end": 2958.08
    },
    {
        "text": " para algo que me desagrado?",
        "start": 2958.08,
        "end": 2961.64
    },
    {
        "text": " Yo tuviera contento y no me desagrada esa acción,",
        "start": 2961.64,
        "end": 2963.88
    },
    {
        "text": " no existiría ese tipo de cosas.",
        "start": 2963.88,
        "end": 2966.08
    },
    {
        "text": " Entonces, ¿qué es lo que estamos viendo acá?",
        "start": 2966.08,
        "end": 2967.92
    },
    {
        "text": " ¿Cómo se valora monetariamente una insatisfacción",
        "start": 2967.92,
        "end": 2971.04
    },
    {
        "text": " de una acción cualquier?",
        "start": 2971.04,
        "end": 2975.0
    },
    {
        "text": " Es decir, el componente no monetario es el costo.",
        "start": 2975.0,
        "end": 2978.64
    },
    {
        "text": " Es algo sujetivo, ¿no?",
        "start": 2978.64,
        "end": 2980.04
    },
    {
        "text": " Es algo que está esplicitamente manifestado.",
        "start": 2980.04,
        "end": 2985.16
    },
    {
        "text": " Entonces, el elemento que no está ayudando acá",
        "start": 2985.16,
        "end": 2987.7999999999997
    },
    {
        "text": " es el precio mínimo que la gente está requiriendo",
        "start": 2987.8,
        "end": 2992.0
    },
    {
        "text": " dispuesto a cobrar para poder transitar esa insatisfacción",
        "start": 2992.0,
        "end": 2998.2400000000002
    },
    {
        "text": " que de genera esa acción.",
        "start": 2998.2400000000002,
        "end": 2999.96
    },
    {
        "text": " Lo ve muy chao en esto.",
        "start": 2999.96,
        "end": 3003.84
    },
    {
        "text": " Entonces, el precio de reserva sería justamente",
        "start": 3003.84,
        "end": 3009.44
    },
    {
        "text": " el valor monetario al cual una gente se encuentra",
        "start": 3009.44,
        "end": 3012.04
    },
    {
        "text": " en diferente entre acción una actividad o no asarla.",
        "start": 3012.04,
        "end": 3016.7200000000003
    },
    {
        "text": " Por menos de esto no lo hago, pero es un borde ahí,",
        "start": 3016.72,
        "end": 3019.72
    },
    {
        "text": " en límite es un borde.",
        "start": 3019.72,
        "end": 3020.7999999999997
    },
    {
        "text": " Me da justamente ese precio.",
        "start": 3020.7999999999997,
        "end": 3023.68
    },
    {
        "text": " Obviamente, lo que depende también de factores muy variables,",
        "start": 3023.68,
        "end": 3026.4399999999996
    },
    {
        "text": " como puede ser el gusto, la riqueza a la persona, etcétera,",
        "start": 3026.4399999999996,
        "end": 3029.4399999999996
    },
    {
        "text": " la paciencia que te engazo que sea.",
        "start": 3029.4399999999996,
        "end": 3030.8799999999997
    },
    {
        "text": " Cuantificado de los costos, los beneficios.",
        "start": 3035.64,
        "end": 3038.64
    },
    {
        "text": " Obviamente, voy a elegir una gente racional,",
        "start": 3038.64,
        "end": 3041.56
    },
    {
        "text": " va a elegir hacia la acción cualquiera,",
        "start": 3041.56,
        "end": 3043.8399999999997
    },
    {
        "text": " siempre y cuando el beneficio supera a los costos.",
        "start": 3043.84,
        "end": 3048.84
    },
    {
        "text": " Una pequeña observación, si para una gente",
        "start": 3051.84,
        "end": 3055.84
    },
    {
        "text": " ha sido una acción de quizás algo no placentero,",
        "start": 3055.84,
        "end": 3060.2400000000002
    },
    {
        "text": " ese precio de reserva se puede ver con el mismo valor",
        "start": 3060.2400000000002,
        "end": 3062.48
    },
    {
        "text": " monetario que esa gente está dispuesto a recibir,",
        "start": 3062.48,
        "end": 3065.8
    },
    {
        "text": " a requedir para compensar esa insatisfacción que",
        "start": 3065.8,
        "end": 3069.7200000000003
    },
    {
        "text": " le genera hacer esa acción.",
        "start": 3069.7200000000003,
        "end": 3073.2000000000003
    },
    {
        "text": " Un salario, una cooperación, podríamos recitar que no gusta.",
        "start": 3073.2,
        "end": 3076.68
    },
    {
        "text": " La persona.",
        "start": 3076.68,
        "end": 3077.68
    },
    {
        "text": " Ahora, si esa acción es algo placentero, algo que le gusta,",
        "start": 3080.64,
        "end": 3086.16
    },
    {
        "text": " el precio de reserva, lo que se puede ver es como el mínimo valor",
        "start": 3086.16,
        "end": 3090.7599999999998
    },
    {
        "text": " que la gente tendrá dispuesto a recibir para que le compensa",
        "start": 3090.7599999999998,
        "end": 3094.24
    },
    {
        "text": " justamente la insatisfacción de hacer algo",
        "start": 3094.24,
        "end": 3096.2
    },
    {
        "text": " que es placentero para él.",
        "start": 3096.2,
        "end": 3097.52
    },
    {
        "text": " Bueno, me damos este ejemplo para que nos permita",
        "start": 3098.52,
        "end": 3106.52
    },
    {
        "text": " graficar esto que estamos analizando.",
        "start": 3106.52,
        "end": 3110.52
    },
    {
        "text": " Estamos viendo a una persona que está cómodamente instalada",
        "start": 3110.52,
        "end": 3114.52
    },
    {
        "text": " a Nuson, escuchando un CD de un grupo de música",
        "start": 3114.52,
        "end": 3119.52
    },
    {
        "text": " que es de su preferencia en un viejo equipo de música.",
        "start": 3119.52,
        "end": 3125.52
    },
    {
        "text": " Pero ¿qué pasa?",
        "start": 3128.52,
        "end": 3129.52
    },
    {
        "text": " Las próximas canciones que vienen no les gusta.",
        "start": 3129.52,
        "end": 3132.52
    },
    {
        "text": " Las próximas dos canciones no son de su agrado,",
        "start": 3132.52,
        "end": 3135.52
    },
    {
        "text": " por lo tanto, se enfrenta a la disuntiva de abandonar",
        "start": 3135.52,
        "end": 3139.52
    },
    {
        "text": " la comodidad de sillón, levantarse, bajar el volumen",
        "start": 3139.52,
        "end": 3145.52
    },
    {
        "text": " o tener que sufrir y escuchar esas dos canciones",
        "start": 3145.52,
        "end": 3148.52
    },
    {
        "text": " que son bastante molestas para él.",
        "start": 3148.52,
        "end": 3150.52
    },
    {
        "text": " Imaginemos por un instante que estamos en esta actuación.",
        "start": 3153.52,
        "end": 3156.52
    },
    {
        "text": " Obviamente es un viejo equipo de música, no hay con todo el remoto,",
        "start": 3156.52,
        "end": 3159.52
    },
    {
        "text": " hay que pararse.",
        "start": 3159.52,
        "end": 3160.52
    },
    {
        "text": " ¿Cuál es el costo acá de la acción?",
        "start": 3164.52,
        "end": 3166.52
    },
    {
        "text": " La acción es bajar el volumen, ¿no?",
        "start": 3166.52,
        "end": 3168.52
    },
    {
        "text": " El tipo está tiradito ahí sentado,",
        "start": 3169.52,
        "end": 3171.52
    },
    {
        "text": " tiene que bajar el volumen del equipo de música.",
        "start": 3171.52,
        "end": 3174.52
    },
    {
        "text": " El costo es levantarse, abandonarla como diga la disillón.",
        "start": 3174.52,
        "end": 3179.52
    },
    {
        "text": " ¿Cuánto valora eso?",
        "start": 3181.52,
        "end": 3182.52
    },
    {
        "text": " ¿Cuánto valora esta persona es acción?",
        "start": 3182.52,
        "end": 3185.52
    },
    {
        "text": " ¿Cuánto valora el renunciar a estar cómodamente instalado",
        "start": 3185.52,
        "end": 3189.52
    },
    {
        "text": " en un sillón?",
        "start": 3189.52,
        "end": 3190.52
    },
    {
        "text": " ¿Es el costo, no?",
        "start": 3193.52,
        "end": 3195.52
    },
    {
        "text": " El costo es justamente perder la comodidad.",
        "start": 3195.52,
        "end": 3197.52
    },
    {
        "text": " ¿Asú ves, tiene un beneficio, el bajar el volumen?",
        "start": 3197.52,
        "end": 3200.52
    },
    {
        "text": " El beneficio está dado, obviamente, por no escuchar las canciones",
        "start": 3200.52,
        "end": 3202.52
    },
    {
        "text": " que no le gusta.",
        "start": 3202.52,
        "end": 3203.52
    },
    {
        "text": " ¿Cuánto val eso?",
        "start": 3205.52,
        "end": 3206.52
    },
    {
        "text": " ¿Cuánto valora ese placer de no dir esas canciones?",
        "start": 3206.52,
        "end": 3209.52
    },
    {
        "text": " ¿Se entiendele bien?",
        "start": 3210.52,
        "end": 3211.52
    },
    {
        "text": " ¿Cómo te va a formar estos costos y beneficios en términos monetarios?",
        "start": 3212.52,
        "end": 3216.52
    },
    {
        "text": " Este es en definitiva lo que vamos a tratar de ver, ¿no?",
        "start": 3216.52,
        "end": 3219.52
    },
    {
        "text": " Entonces, supongamos que estamos en esa situación,",
        "start": 3220.52,
        "end": 3223.52
    },
    {
        "text": " como a la mente instalado, pero estas canciones no nos gustan.",
        "start": 3223.52,
        "end": 3226.52
    },
    {
        "text": " Si hayan le ofrecido alguno de ustedes un sentecio",
        "start": 3226.52,
        "end": 3230.52
    },
    {
        "text": " para que se levanten sillón,",
        "start": 3230.52,
        "end": 3232.52
    },
    {
        "text": " lo más probable que no, no es relevante, ¿no?",
        "start": 3232.52,
        "end": 3235.52
    },
    {
        "text": " ¿Tá?",
        "start": 3236.52,
        "end": 3237.52
    },
    {
        "text": " ¿Estás ahí como a la mente instalado?",
        "start": 3238.52,
        "end": 3240.52
    },
    {
        "text": " Por un sentecimo no me va a ver su dedo.",
        "start": 3240.52,
        "end": 3242.52
    },
    {
        "text": " ¿Ah, si te ofrecen 10.000 dólares o 10.000 pesos?",
        "start": 3244.52,
        "end": 3247.52
    },
    {
        "text": " Corriendo.",
        "start": 3249.52,
        "end": 3250.52
    },
    {
        "text": " ¿Sí?",
        "start": 3251.52,
        "end": 3252.52
    },
    {
        "text": " ¿Se levantan?",
        "start": 3253.52,
        "end": 3254.52
    },
    {
        "text": " ¿Sí?",
        "start": 3255.52,
        "end": 3256.52
    },
    {
        "text": " ¿Puedes ir mi peso así?",
        "start": 3257.52,
        "end": 3258.52
    },
    {
        "text": " Por menos?",
        "start": 3260.52,
        "end": 3261.52
    },
    {
        "text": " ¿No te he pido?",
        "start": 3261.52,
        "end": 3263.52
    },
    {
        "text": " Muy bien, ¿eh?",
        "start": 3265.52,
        "end": 3266.52
    },
    {
        "text": " O sea que en definitiva por un sentecimo no se levanta nada dios,",
        "start": 3267.52,
        "end": 3271.52
    },
    {
        "text": " seguramente no se levanta, no se levanta nada dios.",
        "start": 3271.52,
        "end": 3274.52
    },
    {
        "text": " Pero por 10.000 pesos sí, y seguramente por menos también,",
        "start": 3275.52,
        "end": 3278.52
    },
    {
        "text": " o sea que en el medio hay unos números de cual se levantan.",
        "start": 3278.52,
        "end": 3282.52
    },
    {
        "text": " Entonces, hay un precio de reserva entre 0,1 y 10.000, ¿verdad?",
        "start": 3285.52,
        "end": 3290.52
    },
    {
        "text": " ¿Dónde el individuo es el diferente entre levantar si no levantar?",
        "start": 3291.52,
        "end": 3294.52
    },
    {
        "text": " ¿Entruiste de mismo?",
        "start": 3294.52,
        "end": 3296.52
    },
    {
        "text": " ¿Cuál es el... ¿Por cuánto se levantarían o por cuánto no?",
        "start": 3297.52,
        "end": 3300.52
    },
    {
        "text": " 5. 5 pesos, acá, por 5 pesos se levanta.",
        "start": 3305.52,
        "end": 3310.52
    },
    {
        "text": " ¿Oye? ¿Está perfecto?",
        "start": 3310.52,
        "end": 3312.52
    },
    {
        "text": " Bueno, acá estamos considerando que este presena...",
        "start": 3315.52,
        "end": 3319.52
    },
    {
        "text": " ...dejo a un poco más exigente, por 10 pesos.",
        "start": 3319.52,
        "end": 3322.52
    },
    {
        "text": " O sea, definitiva, ¿cuál es el precio mínimo que esta persona aceptaría",
        "start": 3325.52,
        "end": 3328.52
    },
    {
        "text": " para levantarse y bajar el volume?",
        "start": 3328.52,
        "end": 3330.52
    },
    {
        "text": " En este caso estamos viendo que el precio mínimo que aceptaría sería 10.",
        "start": 3331.52,
        "end": 3335.52
    },
    {
        "text": " O sea, si le ofrecen menos, no se levanta y se le ofrecen 10,",
        "start": 3337.52,
        "end": 3340.52
    },
    {
        "text": " ahí dudaría un poquito, pero el definitiva es el precio que está fijando.",
        "start": 3341.52,
        "end": 3345.52
    },
    {
        "text": " ¿Tabí? ¿Vos por cuánto?",
        "start": 3345.52,
        "end": 3347.52
    },
    {
        "text": " ¿Dies peso? ¿Dies peso?",
        "start": 3348.52,
        "end": 3350.52
    },
    {
        "text": " Muy bien, el precio moderado, muy bien.",
        "start": 3350.52,
        "end": 3353.52
    },
    {
        "text": " Se entiende le veía muchos años.",
        "start": 3353.52,
        "end": 3356.52
    },
    {
        "text": " Entonces, ¿qué pasa? ¿Cuánto tenía dispuesto a pagar ustedes",
        "start": 3356.52,
        "end": 3359.52
    },
    {
        "text": " para que alguien le baje el volume?",
        "start": 3359.52,
        "end": 3362.52
    },
    {
        "text": " ¿No?",
        "start": 3362.52,
        "end": 3363.52
    },
    {
        "text": " Acá estamos viendo, pero un lado, ¿cuánto está dispuesto de aceptar un pago?",
        "start": 3363.52,
        "end": 3366.52
    },
    {
        "text": " 10 pesos, 5, en un caso.",
        "start": 3366.52,
        "end": 3368.52
    },
    {
        "text": " Bueno, ¿cuánto tenía dispuesto a pagar para que alguien le bajara el volume?",
        "start": 3368.52,
        "end": 3372.52
    },
    {
        "text": " Entonces, supongamos que en este caso es 8.",
        "start": 3372.52,
        "end": 3376.52
    },
    {
        "text": " Lo que está dispuesto a pagar, más de 8 no paga.",
        "start": 3377.52,
        "end": 3380.52
    },
    {
        "text": " En este caso, es vocería menos, por 5 más.",
        "start": 3381.52,
        "end": 3385.52
    },
    {
        "text": " ¿Qué puede pagar 8? ¿Qué quiere decir?",
        "start": 3386.52,
        "end": 3389.52
    },
    {
        "text": " El costo que para esta persona, lo mínimo que acepta sería 10.",
        "start": 3389.52,
        "end": 3393.52
    },
    {
        "text": " Y lo que está dispuesto a pagar es 8.",
        "start": 3393.52,
        "end": 3395.52
    },
    {
        "text": " Por lo tanto, en este caso, esta persona va a escuchar las canciones que son molestas,",
        "start": 3395.52,
        "end": 3400.52
    },
    {
        "text": " pero como el beneficio que le genera es menor que el costo va a aceptar.",
        "start": 3400.52,
        "end": 3404.52
    },
    {
        "text": " Obviamente, este ejemplo hipotético, por supuesto, se puede caminar los números",
        "start": 3405.52,
        "end": 3410.52
    },
    {
        "text": " y hacer el revés que el beneficio sea superior al costo.",
        "start": 3410.52,
        "end": 3414.52
    },
    {
        "text": " Pero este ejemplo trivial, lo que nos permite justamente es esto,",
        "start": 3414.52,
        "end": 3419.52
    },
    {
        "text": " identificar costos y beneficios no observables, cuantificarlos",
        "start": 3419.52,
        "end": 3424.52
    },
    {
        "text": " y ver en finitiva cómo podemos aplicar esta herramienta de la toma de decisiones",
        "start": 3424.52,
        "end": 3429.52
    },
    {
        "text": " siempre y cuando el beneficio superia el costo.",
        "start": 3429.52,
        "end": 3432.52
    },
    {
        "text": " ¿Se entendió esto? No.",
        "start": 3433.52,
        "end": 3435.52
    },
    {
        "text": " O sea, en finitiva, ¿qué fue lo que hizo este caso?",
        "start": 3436.52,
        "end": 3440.52
    },
    {
        "text": " Nos preguntó con la situación, obviamente, muy trivial, muy hipotética,",
        "start": 3440.52,
        "end": 3444.52
    },
    {
        "text": " pero que nos permite justamente cuantificar la valoración subjetiva",
        "start": 3444.52,
        "end": 3450.52
    },
    {
        "text": " que hace esta persona del costo o del beneficio que tiene una acción hipotética",
        "start": 3450.52,
        "end": 3455.52
    },
    {
        "text": " que la baja el volumen del equipo musico.",
        "start": 3455.52,
        "end": 3458.52
    },
    {
        "text": " Si lo que valora, en este caso, es superior el beneficio que el costo lo hace y si no lo lo hace.",
        "start": 3459.52,
        "end": 3466.52
    },
    {
        "text": " ¿Qué elementos influyen acá?",
        "start": 3469.52,
        "end": 3472.52
    },
    {
        "text": " Obviamente, hay elementos subjetivos, por supuesto, todos,",
        "start": 3472.52,
        "end": 3475.52
    },
    {
        "text": " pero influye en este caso hipotético, podemos reflejar si yo estuviera sentado en el sillón",
        "start": 3475.52,
        "end": 3481.52
    },
    {
        "text": " o que se esté cansado o que se esté cansado o que se esté cansado",
        "start": 3481.52,
        "end": 3487.52
    },
    {
        "text": " si tengo más dinero capaz que no me importaría tanto,",
        "start": 3487.52,
        "end": 3490.52
    },
    {
        "text": " pero si estoy mal de plata capaz que el bajo mis insistencias,",
        "start": 3490.52,
        "end": 3495.52
    },
    {
        "text": " si estoy cansado o si no estoy cansado los preferencias, los gustos,",
        "start": 3495.52,
        "end": 3499.52
    },
    {
        "text": " en fin, una serie de secuestancias, si estoy muy alegre, si estoy bajonado,",
        "start": 3499.52,
        "end": 3503.52
    },
    {
        "text": " en fin hay un montón de componentes ahí que inciden en esta valoración subjetiva.",
        "start": 3503.52,
        "end": 3508.52
    },
    {
        "text": " Por eso es importante no perder de vista esto,",
        "start": 3509.52,
        "end": 3511.52
    },
    {
        "text": " que así que en este juego yo hacía todos podemos hacer de valoraciones diferentes y válidas.",
        "start": 3511.52,
        "end": 3516.52
    },
    {
        "text": " Ahora, estoy moviendo que hacía un individuo como elegía entre diferentes alternativas,",
        "start": 3517.52,
        "end": 3531.52
    },
    {
        "text": " como hacinado los recursos de escasos entre diferentes alternativas.",
        "start": 3531.52,
        "end": 3535.52
    },
    {
        "text": " Cuando, cuando lo que estamos comparando no es diferentes alternativas,",
        "start": 3535.52,
        "end": 3543.52
    },
    {
        "text": " sino una misma actividad y destinada de un recurso escaso,",
        "start": 3543.52,
        "end": 3547.52
    },
    {
        "text": " ahí vamos a ver cómo cambia el enfoque.",
        "start": 3547.52,
        "end": 3552.52
    },
    {
        "text": " Es decir, cuando el problema económico en el individuo no es elegir entre estudiar o trabajar,",
        "start": 3552.52,
        "end": 3557.52
    },
    {
        "text": " sino elegir cuántas horas va a estudiar o cuántas horas va a trabajar",
        "start": 3557.52,
        "end": 3561.52
    },
    {
        "text": " para maximizar su nivel de bienestar.",
        "start": 3561.52,
        "end": 3566.52
    },
    {
        "text": " Por ejemplo, cuando un propietario de campo no está realizando si va a producir o va a arrendar el campo,",
        "start": 3567.52,
        "end": 3575.52
    },
    {
        "text": " sino cuanta cantidad de un cultivo a producir,",
        "start": 3575.52,
        "end": 3580.52
    },
    {
        "text": " si un consumidor no está distinguiendo ante cuanta cantidad de carne o de manzanas va a consumir,",
        "start": 3580.52,
        "end": 3586.52
    },
    {
        "text": " sino que cantidad de carne o que cantidad de manzanas va a consumir,",
        "start": 3586.52,
        "end": 3590.52
    },
    {
        "text": " es decir, cuando estamos amelizando eso pasamos a lo que se conoce en economía como la análisis marginal.",
        "start": 3590.52,
        "end": 3596.52
    },
    {
        "text": " Es muy importante en economía en diferentes ámbitos porque es la que nos permite cuantificar los impactos que tiene",
        "start": 3596.52,
        "end": 3608.52
    },
    {
        "text": " el hecho de agregar una unidad más.",
        "start": 3608.52,
        "end": 3611.52
    },
    {
        "text": " Y esto es justamente lo marginal, en economía es el impacto que tiene una unidad más.",
        "start": 3611.52,
        "end": 3619.52
    },
    {
        "text": " Por ejemplo, ¿qué impacto tiene para un empresario contratar un empleado más?",
        "start": 3620.52,
        "end": 3632.52
    },
    {
        "text": " Contrater un empleado más, para un empresario tiene un costo, ¿cuál es el costo de contrater un empleado?",
        "start": 3632.52,
        "end": 3639.52
    },
    {
        "text": " Es salario, ¿no? Es aporta, igual, el costo que tiene todo el empresario y contrater un empleado.",
        "start": 3639.52,
        "end": 3647.52
    },
    {
        "text": " Es el costo marginal, el costador de empleado más es el salario, ¿cuál sería el beneficio marginal o el ingreso marginal que tiene el empresario?",
        "start": 3647.52,
        "end": 3655.52
    },
    {
        "text": " Por el costador de empleado más. ¿El aumento de producción?",
        "start": 3655.52,
        "end": 3659.52
    },
    {
        "text": " El aumento de producción, ¿qué producción me genera adicional es empleado que contratas empresarios?",
        "start": 3659.52,
        "end": 3665.52
    },
    {
        "text": " Un volumen de producción me va a generar adicionalmente eso valorado por el precio que tiene ese bien, me genera un ingreso.",
        "start": 3665.52,
        "end": 3675.52
    },
    {
        "text": " Por lo tanto, del punto de vista racional contratamos un empleado más, implicaría que el ingreso marginal que me genera,",
        "start": 3676.52,
        "end": 3686.52
    },
    {
        "text": " el volumen de producción por el precio supere al costo marginal que es el salario.",
        "start": 3686.52,
        "end": 3691.52
    },
    {
        "text": " Lo vamos a ver más adelante con mejor lucro cidad, pero en definitiva, los costos y beneficios relevantes",
        "start": 3691.52,
        "end": 3700.52
    },
    {
        "text": " la toma de decisiones económicas son los que ocurren en el margen, el margen es una unidad más, un animado de factor,",
        "start": 3700.52,
        "end": 3708.52
    },
    {
        "text": " un animado más de factor productivo en este caso trabajo, por ejemplo.",
        "start": 3708.52,
        "end": 3712.52
    },
    {
        "text": " ¿Cuánto tenía dispuesto a pagar un consumidor por consumir la masana más?",
        "start": 3722.52,
        "end": 3728.52
    },
    {
        "text": " ¿Cuál es el valor monetario que esa asocia a esa satisfacción, esa utilidad que genera consumir una masana más para un consumidor?",
        "start": 3730.52,
        "end": 3742.52
    },
    {
        "text": " Primera cosa que dice ahí, el consumo de una masana, en este caso adicional, o sea, se ve que se ha consumido alguna mas antes.",
        "start": 3746.52,
        "end": 3756.52
    },
    {
        "text": " Genera una utilidad constante, una satisfacción, utilidad cada satisfacción, el consumidor.",
        "start": 3756.52,
        "end": 3762.52
    },
    {
        "text": " No, no genera. Vamos a asumir que la utilidad es decreciente, en el caso de los alimentos es fácil valor,",
        "start": 3764.52,
        "end": 3775.52
    },
    {
        "text": " si yo consumo una masana, tengo una ambrebarro, me da una gran satisfacción, una gran utilidad consumirla,",
        "start": 3775.52,
        "end": 3782.52
    },
    {
        "text": " consumo una segunda, me da también muchas satisfacción, pero ya no tanta como la primera.",
        "start": 3783.52,
        "end": 3789.52
    },
    {
        "text": " Consumo una tercer masana, me está generando satisfacción, pero ya mucho menos, ya estoy más asciado, mucho menos que la segunda.",
        "start": 3789.52,
        "end": 3799.52
    },
    {
        "text": " Acuarta masana, ya, ya estoy comiendo, pero bueno, está, la quinta, ya, veo una masana y ¿por qué? Porque ya estoy asciado, no me da una satisfacción, no me da utilidad.",
        "start": 3800.52,
        "end": 3814.52
    },
    {
        "text": " Se entiende esto, que el tema de salimento obviamente es una retricción biológica, algunos pueden tener más capacidad menos pero definitiva.",
        "start": 3814.52,
        "end": 3822.52
    },
    {
        "text": " Y también te atiende la satisfacción que me da, a ese momento que ya no me da satisfacción, al contrario.",
        "start": 3823.52,
        "end": 3828.52
    },
    {
        "text": " Bueno, con que nos va a quedar acá, que la utilidad marginal esa que me genera una unidad más, en este caso masana, es decreciente.",
        "start": 3829.52,
        "end": 3838.52
    },
    {
        "text": " Vamos a ver esto como yo, por fin de día, cuando vamos consumidor, pero ya en esa adelanto que, para el imensa, mayoría de los bienes, se asume una utilidad marginal decreciente.",
        "start": 3839.52,
        "end": 3849.52
    },
    {
        "text": " Ya cuanto más consumo, sí me genera satisfacción porque la es menos.",
        "start": 3849.52,
        "end": 3854.52
    },
    {
        "text": " En realidad, la imensa mayoría de los bienes se puede verificar esto, quizás las adicciones o las colecciones, no se cumpliría esto, pero un coleccionista, cuanto más acumula de la colección,",
        "start": 3855.52,
        "end": 3871.52
    },
    {
        "text": " si supuestamente le da más satisfacción y las adicciones también.",
        "start": 3871.52,
        "end": 3876.52
    },
    {
        "text": " Pero sacando de estos casos particulares, la imensa mayoría de los bienes, casi la totalidad, responden a este esquema o por lo más asume que responden a este esquema.",
        "start": 3877.52,
        "end": 3887.52
    },
    {
        "text": " Es decir, genera satisfacción porque cada vez menos una unidad más, o sea, se asume que está cumpliendo la ley de la utilidad marginal decreciente, siempre marginal, reitero, alude prón a una unidad más.",
        "start": 3887.52,
        "end": 3905.52
    },
    {
        "text": " En este caso, consumo un bien más, me da satisfacción pero menos que la anterior.",
        "start": 3905.52,
        "end": 3910.52
    },
    {
        "text": " Entonces, si la utilidad marginal es decreciente, podemos asumir que este consumidor cada vez está dispuesto a pagar menos por consumir unidad más.",
        "start": 3910.52,
        "end": 3926.52
    },
    {
        "text": " O sea, la exposición de pagar también, más adicresiente, respeto a la cantidad consumida de mismo.",
        "start": 3926.52,
        "end": 3935.52
    },
    {
        "text": " Y esto es justamente la cantidad demandada, la demanda de ese bien.",
        "start": 3935.52,
        "end": 3941.52
    },
    {
        "text": " A medida que voy consumiendo más de un bien, a medida que ese bien se torno menos escaso, yo estoy dispuesto a pagar cada vez menos.",
        "start": 3941.52,
        "end": 3950.52
    },
    {
        "text": " Si quiero ver el concierto de no ser un conjunto que me gusta, estoy dispuesto a pagar fortunas para ver un conjunto.",
        "start": 3951.52,
        "end": 3961.52
    },
    {
        "text": " Bueno, si voy todos las fines de semana, saber el conjunto, capaz que ya no estoy tan dispuesto a pagar una cifra tan alta como el primero.",
        "start": 3961.52,
        "end": 3970.52
    },
    {
        "text": " General es gente que paga igual de tipo de cosas.",
        "start": 3971.52,
        "end": 3976.52
    },
    {
        "text": " Se entiende por qué, porque yo estoy más atifecho, digamos.",
        "start": 3976.52,
        "end": 3980.52
    },
    {
        "text": " Ya es menos escaso para mí ese bien. Y así con un montón de la inmensa mayoría de los bienes podemos hacer esta análisis.",
        "start": 3980.52,
        "end": 3990.52
    },
    {
        "text": " Entonces, la demanda de un bien está asociada, bincuamente vinculada a la despudición de pagar de distintas cantidades del bien por parte de un consumidor.",
        "start": 3990.52,
        "end": 3999.52
    },
    {
        "text": " Hay una relación inversa negativa entre precio y la cantidad, o sea, se asume a mayor precio, va a demandar menos y a un precio más bajo a bajo, va a demandar más.",
        "start": 4000.52,
        "end": 4012.52
    },
    {
        "text": " Se asume la ley de Autidama Aginal de Cresciente.",
        "start": 4012.52,
        "end": 4016.52
    },
    {
        "text": " Esto de Autidama Aginal es asociar el beneficio que le brinda al consumidor consumidor en una idea más.",
        "start": 4017.52,
        "end": 4027.52
    },
    {
        "text": " Obviamente se va a enfrentar al costo, el costo va estarrado por el precio que paga por ese bien.",
        "start": 4027.52,
        "end": 4032.52
    },
    {
        "text": " Acá, por ejemplo, estamos hablando de manzanas.",
        "start": 4033.52,
        "end": 4039.52
    },
    {
        "text": " Esta línea roja que la línea que está expresando la demanda, expresa también la despudición de pagar como no llenamos recién.",
        "start": 4039.52,
        "end": 4047.52
    },
    {
        "text": " Yo observémos, por las primeras unidades está dispuesto a pagar un valor más alto con respecto a las otras, por el tema de la sacidad que yo les mencionaba y en términos generales,",
        "start": 4047.52,
        "end": 4061.52
    },
    {
        "text": " por el tema de que el bien es menos escaso que al principio.",
        "start": 4061.52,
        "end": 4067.52
    },
    {
        "text": " El tema de alimentos es más fácil de lo que se llama la sacidad de biológica, pero que vemos también con el tema de que el bien es menos escaso, tú te estoy dispuesto a pagar más.",
        "start": 4067.52,
        "end": 4076.52
    },
    {
        "text": " Observen que estoy dispuesto a pagar, pero lo que pago es el precio del bien, en este caso, el precio del bien es 5.",
        "start": 4076.52,
        "end": 4087.52
    },
    {
        "text": " El precio que paga este consumidor por consumidor de unidad es 5, por consumir la tercera es 5 y así.",
        "start": 4087.52,
        "end": 4096.52
    },
    {
        "text": " Pero está dispuesto a pagar por las primeras unidades como pueden ver acá más de este valor.",
        "start": 4096.52,
        "end": 4102.52
    },
    {
        "text": " El precio que paga es el costo marginal, el costo que implica consumir unidad más, en este caso es constante.",
        "start": 4105.52,
        "end": 4112.52
    },
    {
        "text": " Entonces, observen este divido o acá este agrafica, nos estamos dando que hasta tres unidades la de posición de pagar es superior al precio.",
        "start": 4112.52,
        "end": 4124.52
    },
    {
        "text": " En tres unidades coincide y después ¿qué pasa?",
        "start": 4124.52,
        "end": 4130.52
    },
    {
        "text": " Después el costo o el precio supera el beneficio, el beneficio de la utilidad, la de posición de pagar.",
        "start": 4130.52,
        "end": 4139.52
    },
    {
        "text": " O sea que en esta gráfica podemos decir que el punto vista racional la cantidad óptima sería 3.",
        "start": 4139.52,
        "end": 4146.52
    },
    {
        "text": " O sea, antes de 3 esta persona estaría dispuesta a consumir porque obtiene un beneficio mayor o una satisfacción mayor que el costo.",
        "start": 4146.52,
        "end": 4157.52
    },
    {
        "text": " Y ya después de 3 el costo, la insatisfacción que genera es mayor que el beneficio.",
        "start": 4157.52,
        "end": 4163.52
    },
    {
        "text": " Se entiendonos.",
        "start": 4164.52,
        "end": 4166.52
    },
    {
        "text": " Bueno volviendo acá entonces cuál es la elección óptima del consumidor lo adelantamos en la gráfica ¿no?",
        "start": 4172.52,
        "end": 4179.52
    },
    {
        "text": " Es consumir una cantidad tal de manzana, en este caso de forma tal que la exposición marginal del consumidor,",
        "start": 4179.52,
        "end": 4191.52
    },
    {
        "text": " o sea la utilidad marginal del consumidor en términos monetarios se iguala al precio, al costo marginal.",
        "start": 4191.52,
        "end": 4198.52
    },
    {
        "text": " Definitiva la posiciona o te va a consumidor la elección de cantidad de subctiva va a ser en este caso donde la utilidad marginal iguale a el costo.",
        "start": 4198.52,
        "end": 4209.52
    },
    {
        "text": " En general no es porque... ¿Por qué enfatizamos esto del margen? Porque la elección nos se toman de consumir más de 100 kilos o menos 100 kilos,",
        "start": 4210.52,
        "end": 4224.52
    },
    {
        "text": " sino que estamos hablando de un kilo más o de una niña más ¿no?",
        "start": 4224.52,
        "end": 4228.52
    },
    {
        "text": " Lo mismo...",
        "start": 4229.52,
        "end": 4231.52
    },
    {
        "text": " Lo mismo estamos hablando de un empresario ¿no?",
        "start": 4236.52,
        "end": 4240.52
    },
    {
        "text": " No estamos hablando de contratar 100 personas más o menos o sino 1 o 1 menos.",
        "start": 4240.52,
        "end": 4246.52
    },
    {
        "text": " Obviamente en caso de este que estamos hablando de alimentos ¿cuánto está dispuesto a pagar como yo les mencionaba?",
        "start": 4247.52,
        "end": 4256.52
    },
    {
        "text": " Estaba muy asociado a cuál es el, ¿cómo viene esa persona? No si ya había consumido una manzana sprigamente,",
        "start": 4256.52,
        "end": 4263.52
    },
    {
        "text": " sino consumieron ninguna, es decir está asociado a esto, lo que sí, es importante es que cuanto el bien es más escaso está dispuesto a pagar más",
        "start": 4263.52,
        "end": 4273.52
    },
    {
        "text": " y a medida que va consumiendo ese bien se torna menos escaso y está dispuesto a pagar cada vez menos.",
        "start": 4273.52,
        "end": 4280.52
    },
    {
        "text": " Va a seguir consumiendo en la medida que esa disposición a pagar supera al costo marginal que es el precio y va a detenerse en la cantidad que iguale el costo y el beneficio como vimos acá en la gráfica.",
        "start": 4280.52,
        "end": 4294.52
    },
    {
        "text": " Se asume que hay una tuya marginal de creciente y vamos a asumir esto que es en la mayoría de los bienes.",
        "start": 4295.52,
        "end": 4308.52
    },
    {
        "text": " Se entiende esto, esto es asociante a más de las caséis, el bien sea más preciado con todo más escaso y a medida que van consumiendo es menos valorado.",
        "start": 4308.52,
        "end": 4320.52
    },
    {
        "text": " Y esto es importante, esto del criterio marginal, es importante la toma de decisiones como yo les mencionaba, no solo a nivel de consumidor, también a nivel del un productor, si va a contratar un trabajador más o un trabajador menos,",
        "start": 4321.52,
        "end": 4335.52
    },
    {
        "text": " en el ejercicio que decíamos un poco acá improvisadamente, comparando el salario, el costo marginal que tiene con los aportes, con todo para un empresario, con el ingreso que le genera dado por las unidades que produce,",
        "start": 4335.52,
        "end": 4348.52
    },
    {
        "text": " y se trabajador por el precio.",
        "start": 4348.52,
        "end": 4353.52
    },
    {
        "text": " Y esto nos lleva a ver lo que mencionaba compañero, el producto marginal, la productiva marginal, la productiva marginal es un elemento importante, porque justamente la cantidad adicional que me genera un trabajador o dicho otra forma,",
        "start": 4353.52,
        "end": 4371.52
    },
    {
        "text": " cuál es la variación, cuánto me incrementa la producción total y incorporar un factor más de trabajo, un trabajador más.",
        "start": 4371.52,
        "end": 4379.52
    },
    {
        "text": " Eso valorado por el precio del bien es el valor del producto marginal, o sea el ingreso monetario que me genera marginalmente el hecho de incorporar una unidad más de trabajo, o un trabajador más.",
        "start": 4379.52,
        "end": 4394.52
    },
    {
        "text": " Vamos a demostrar más adelante cómo justamente la cantidad de empleados se va a definir, la cantidad de óptima, justamente cuando el valor de la productiva marginal siguala al costo.",
        "start": 4395.52,
        "end": 4407.52
    },
    {
        "text": " Algo similar a que vivíamos con el tema de la manzana, o sea si el hecho de contador, un trabajador más me genera un valor de la productiva marginal mayor al salario contratos,",
        "start": 4407.52,
        "end": 4420.52
    },
    {
        "text": " si es menor despido y si es igual a ahí es cuando se lo óptimo.",
        "start": 4420.52,
        "end": 4425.52
    },
    {
        "text": " Y en Mercado no es ni menos menos que un contexto donde hay un conjunto de agentes que son los que ofrecen un bien,",
        "start": 4427.52,
        "end": 4435.52
    },
    {
        "text": " son los que venden y hay otro conjunto de agentes que son los que demandan, que son los que compran.",
        "start": 4435.52,
        "end": 4442.52
    },
    {
        "text": " En esa interacción llegan a un acuerdo y hay un intercambio del bien a través de un precio.",
        "start": 4442.52,
        "end": 4451.52
    },
    {
        "text": " Esa decisión, lo podemos ver en forma individual, cada uno de nosotros en un mercado cualquiera, vamos, demandamos, somos demandantes y compramos aquellos que ofrecen.",
        "start": 4455.52,
        "end": 4469.52
    },
    {
        "text": " Bueno, la suma de decisiones individuales de cada uno de nosotros, terminado bien, un alimento cualquiera, pan,",
        "start": 4470.52,
        "end": 4479.52
    },
    {
        "text": " bueno, eso es la suma de toda la demanda individual de pan de una sociedad hace el mercado del pan.",
        "start": 4479.52,
        "end": 4490.52
    },
    {
        "text": " La demanda del pan, la demanda agregada del pan.",
        "start": 4492.52,
        "end": 4496.52
    },
    {
        "text": " Enfrentaba que a todos los oferentes del pan, a lo que voy es que la suma individual de cada uno de los agentes,",
        "start": 4497.52,
        "end": 4504.52
    },
    {
        "text": " tanto demandantes, hace la demanda del mercado y la suma individual de los oferentes, hace la falta del mercado.",
        "start": 4504.52,
        "end": 4509.52
    },
    {
        "text": " Que se asume acá, se asume que tanto oferentes como demandantes tienen un enfoque racional, actúan racionalmente y la toma de decisiones,",
        "start": 4511.52,
        "end": 4520.52
    },
    {
        "text": " la toma justamente en forma racional.",
        "start": 4520.52,
        "end": 4523.52
    },
    {
        "text": " Hay mercados competitivos y mercados no competitivos.",
        "start": 4524.52,
        "end": 4528.52
    },
    {
        "text": " Un mercado competitivo puro de competencia perfecta es donde hay muchísimos oferentes, muchísimos demandantes,",
        "start": 4528.52,
        "end": 4537.52
    },
    {
        "text": " de tal forma tal que no tiene peso, no tiene ni incidencia en la determinación del precio en el mercado.",
        "start": 4537.52,
        "end": 4545.52
    },
    {
        "text": " No está regulado, no está controlado y en definitiva hay marge muy pequeño de precios que termina decisiones de comparado y si ven deores.",
        "start": 4546.52,
        "end": 4556.52
    },
    {
        "text": " El mercado de competencia perfecta, el mercado de competencia perfecta y su mercado donde los productos son homogéneos,",
        "start": 4558.52,
        "end": 4566.52
    },
    {
        "text": " esto es no se diferencian tecnológicamente hablando, prácticamente no hay diferencia entre ellos,",
        "start": 4566.52,
        "end": 4573.52
    },
    {
        "text": " y no hay diferencia porque hay una difusión de la tecnología entre los procesos productivos donde en definitiva nadie aventaja nadie.",
        "start": 4573.52,
        "end": 4587.52
    },
    {
        "text": " Hay una idea de átomo, está en la numerosidad de agentes que intervienen en el mercado, tanto oferentes como demandantes que expresa como una idea de atomicidad.",
        "start": 4587.52,
        "end": 4598.52
    },
    {
        "text": " De tal forma como decíamos recién que no hay ninguna gente que pueden insidir en el precio, esta es una idea clave de un mercado de competencia perfecta.",
        "start": 4599.52,
        "end": 4608.52
    },
    {
        "text": " Por eso se dice que los agentes intervenientes en el mercado de competencia perfecta son tomadores de precio, el precio viene dado.",
        "start": 4608.52,
        "end": 4616.52
    },
    {
        "text": " Hay unas transparencias en la información, hay como que todos tienen las mismas posibilidades, nadie aventaja al otro.",
        "start": 4619.52,
        "end": 4625.52
    },
    {
        "text": " En la posibilidades, tenemos los mercados de competencia perfecta como un monopolio, ¿hay en saber lo que su monopolio?",
        "start": 4629.52,
        "end": 4638.52
    },
    {
        "text": " Hay otra idea de que se puede ver en el mercado de competencia perfecta.",
        "start": 4639.52,
        "end": 4647.52
    },
    {
        "text": " Hay una sola empresa que es la que domina todo el mercado, o podemos decir casi todo el mercado.",
        "start": 4647.52,
        "end": 4655.52
    },
    {
        "text": " Pero en definitiva, es una sola empresa donde su peso está el que tiene insidencia en el precio del bien.",
        "start": 4655.52,
        "end": 4667.52
    },
    {
        "text": " Oligopolio es lo mismo, solo que en vez de ser una sola empresa, hay un pequeño grupo de empresas.",
        "start": 4668.52,
        "end": 4679.52
    },
    {
        "text": " Entonces hablamos de un mercado monopolio cuando hay una sola empresa que ofrece ese bien y el consumidor tiene que comprarlo según las condiciones que establece esa empresa.",
        "start": 4684.52,
        "end": 4691.52
    },
    {
        "text": " Y un oligopolio es un mercado donde el producto se suministra por un pequeño grupo de empresas y es lo que abundan la mayoría de los productos.",
        "start": 4692.52,
        "end": 4706.52
    },
    {
        "text": " Hay algunos productos monopólicos, pero el general es más fácil encontrar oligopolicos.",
        "start": 4706.52,
        "end": 4712.52
    },
    {
        "text": " Por ejemplo, ¿hay en conocimiento alguien?",
        "start": 4713.52,
        "end": 4717.52
    },
    {
        "text": " Autos, los autos, un mercado olivo público. Hay un pequeño grupo de empresas que son las que domina el mercado mundial.",
        "start": 4717.52,
        "end": 4726.52
    },
    {
        "text": " Si bien ha surgido algunas, ahora también con fortis nación mundial, sigue siendo un mercado suente concentrado en un pequeño número de empresas.",
        "start": 4726.52,
        "end": 4735.52
    },
    {
        "text": " Medicamentos, de esta famosa ética, metalúrgica, petróleo, y así podemos seguir numerando un montón de rubros donde vemos que hay una gran concentración del mercado en pequeñas, pequeñas rubros de empresas.",
        "start": 4736.52,
        "end": 4757.52
    },
    {
        "text": " Podemos hacer una distisión en un duopolio, duopolio obviamente son dos empresas, que domina el mercado, por ejemplo.",
        "start": 4758.52,
        "end": 4766.52
    },
    {
        "text": " Pepsi coca, ahí está. Coca-Cola y Pepsi son dos marcas mundiales que domina el mercado de gaseosas a nivel mundial.",
        "start": 4774.52,
        "end": 4783.52
    },
    {
        "text": " Por supuesto que no son las únicas que hay, pero el grado de concentración que tienen el mercado es muy fuerte.",
        "start": 4784.52,
        "end": 4792.52
    },
    {
        "text": " También en el caso de los aviones, por ejemplo, de Boeing y la otra Airbus.",
        "start": 4792.52,
        "end": 4800.52
    },
    {
        "text": " ¿La de europea? No son las únicas, pero su concentración es bastante grande.",
        "start": 4800.52,
        "end": 4809.52
    },
    {
        "text": " Bueno, en definitiva, vemos mercados que no son la competencia perfecta que responde a la estructura, el importante es quedarnos con esta idea de que determina el precio del bien, tiene influencia del bien, a diferencia de los mercados competitivos.",
        "start": 4810.52,
        "end": 4825.52
    },
    {
        "text": " Entonces, vamos a ver nosotros en el peor lugar, toda esta parte del curso, los mercados competitivos, el marco teórico, que son difícil de encontrar en la realidad, pero como marco teórico son muy efectivos para, quizás para justamente verificar como realmente no funcionan los mercados, ¿no?",
        "start": 4826.52,
        "end": 4847.52
    },
    {
        "text": " ¿O por qué? No funcionan los mercados en términos competitivos.",
        "start": 4848.52,
        "end": 4851.52
    },
    {
        "text": " Bueno, vamos a ver la demanda. Residen veíamos, ¿no? Como la disponición ha pagado un divido, está muy asociado al tema de las cantidades demandadas, ¿no?",
        "start": 4851.52,
        "end": 4861.52
    },
    {
        "text": " Y como la suma de las demandas individuales llevaba a la demanda del mercado.",
        "start": 4861.52,
        "end": 4866.52
    },
    {
        "text": " Vamos a distinguir lo que es la cantidad demandada, la cantidad demandada de un bien es justamente la cantidad que los comparadores están dispuestos y pueden comprar a cada nivel de precio.",
        "start": 4867.52,
        "end": 4883.52
    },
    {
        "text": " Ya sabemos que hay una relación inversa entre precio y cantidad, que se asume por lo cual la demanda tiene una pendiente negativa.",
        "start": 4884.52,
        "end": 4891.52
    },
    {
        "text": " Estos son los principales determinantes de la función de demanda. Por un lado el precio del bien, ya sabemos que si el precio suba la cantidad va a bajar y viceversa.",
        "start": 4892.52,
        "end": 4901.52
    },
    {
        "text": " Pero subes hay elementos que también hicieron la demanda del bien, como por ejemplo el ingreso, nivel de ingreso de los consumidores.",
        "start": 4901.52,
        "end": 4910.52
    },
    {
        "text": " El precio de los bien es que pueden tener relación con ese bien, hay bien que están vinculados y la variación del precio dice bien impacta en la cantidad demandada del otro.",
        "start": 4911.52,
        "end": 4926.52
    },
    {
        "text": " Vamos a ver, ¿qué pasa y qué implica eso?",
        "start": 4926.52,
        "end": 4932.52
    },
    {
        "text": " Por supuesto de los gustos, la preferencia de los consumidores también es otro elemento importante que juega en la demanda del bien y las expectativas de los agentes y otros factores que influyen.",
        "start": 4933.52,
        "end": 4944.52
    },
    {
        "text": " Veamos por ejemplo este cuadro, este cuadro nos estamos tratando la depudición de apagar de un bien fruta fresca.",
        "start": 4948.52,
        "end": 4954.52
    },
    {
        "text": " Entonces vemos como a medida que aumenta la cantidad de kilos la dispuesta de apagar baja, como recién me llamó diciendo.",
        "start": 4955.52,
        "end": 4965.52
    },
    {
        "text": " O sea que en definitiva podemos ver a este precio de mercado la cantidad de frutas que el consumidor está dispuesto a demandar.",
        "start": 4965.52,
        "end": 4978.52
    },
    {
        "text": " Bueno, y puedo establecer esta función de demanda, definitiva la si está indicando a este precio cuántos kilos está dispuesto el consumidor a demandar.",
        "start": 4979.52,
        "end": 4991.52
    },
    {
        "text": " Veamos que de creciente como veníamos viendo.",
        "start": 4991.52,
        "end": 4996.52
    },
    {
        "text": " Teniendo negativa, obviamente estamos realizando acá, solo el precio, lo demás factores, lo más costante, gustos, ingresos, todo lo que estamos ahí.",
        "start": 4997.52,
        "end": 5008.52
    },
    {
        "text": " Y sabemos que la relación inversa, precio más bajo se consume más y viceversa.",
        "start": 5008.52,
        "end": 5013.52
    },
    {
        "text": " Como se lo mencionaba hoy, la demanda individual está enfocada a una gente aislado, individualmente hablando.",
        "start": 5014.52,
        "end": 5024.52
    },
    {
        "text": " Si sumamos la demanda individual de ese bien, de todos los agentes, ahí tenemos la demanda del mercado.",
        "start": 5024.52,
        "end": 5031.52
    },
    {
        "text": " En este caso por ejemplo podemos ver este mercado compuesto por tres personas Juan Pedro Luis,",
        "start": 5031.52,
        "end": 5037.52
    },
    {
        "text": " pero tanto a diferentes variaciones de precios tenemos la diferencia que demanda cada uno de estos agentes forman individuales.",
        "start": 5037.52,
        "end": 5046.52
    },
    {
        "text": " La suma de estas cantidades a diferentes precios me da la demanda del mercado, esto que yo les mencionaba hoy.",
        "start": 5046.52,
        "end": 5054.52
    },
    {
        "text": " La demanda del mercado del bien va a estar dado por la suma de las demandas individuales, de diferentes agentes que integren ese mercado.",
        "start": 5054.52,
        "end": 5062.52
    },
    {
        "text": " Concentualmente lo mismo, pero simplemente se lo mencionamos acá.",
        "start": 5062.52,
        "end": 5067.52
    },
    {
        "text": " Entonces es lo que está acá, estas gráficas responde a estas tres personas, las líneas y la lila es la que responde a la demanda del mercado.",
        "start": 5067.52,
        "end": 5078.52
    },
    {
        "text": " La demanda del mercado nos habla de cuántas cantidades están dispuestos a consumir todos los consumidores, ¿no?",
        "start": 5078.52,
        "end": 5089.52
    },
    {
        "text": " Te sé bien a lo diferente de nivel de precios.",
        "start": 5089.52,
        "end": 5092.52
    },
    {
        "text": " También la demanda de mercado tiene pendiente negativa.",
        "start": 5095.52,
        "end": 5099.52
    },
    {
        "text": " Por lo mismo razón, le dejo la parada de señorito para la demanda, me da la cantidad de consumidores de ese bien.",
        "start": 5100.52,
        "end": 5109.52
    },
    {
        "text": " Y por supuesto que eso tiene componentes sujetivos y también elementos de cuanto afectar el poder adquisitivo a la persona, ¿no?",
        "start": 5109.52,
        "end": 5119.52
    },
    {
        "text": " se vien. Nosotros podemos considerar constante todos los demás factores, lo que tenemos",
        "start": 5119.52,
        "end": 5129.900000000001
    },
    {
        "text": " ganando y solo que depende de la función de demanda del precio del bien, por supuesto",
        "start": 5129.900000000001,
        "end": 5137.46
    },
    {
        "text": " función inversa, ¿no? Es decir, cuántas unidades, cuántas unidades de demandadas del",
        "start": 5137.46,
        "end": 5142.96
    },
    {
        "text": " bien ante diferente niveles de precio de ese bien y cualquiera. Ahora bien, ahí ¿qué",
        "start": 5142.96,
        "end": 5154.4800000000005
    },
    {
        "text": " estamos viendo? Estamos viendo si cambia el precio del bien, la cantidad de demandada cambia,",
        "start": 5154.4800000000005,
        "end": 5160.08
    },
    {
        "text": " hay un movimiento que se da sobre la misma curva o la reita en este caso. Ahora, si saltera",
        "start": 5160.08,
        "end": 5166.36
    },
    {
        "text": " a cualquier otro los factores que estuvimos viendo, el ingreso, los gustos, las expectativas,",
        "start": 5166.36,
        "end": 5171.16
    },
    {
        "text": " el precio de la relación aoz, ahí hay un movimiento de la curva y lo que hay que ver es",
        "start": 5171.16,
        "end": 5175.78
    },
    {
        "text": " justamente hacia donde se mueve, si a ser izquierda o a ser la derecha para determinar cuál",
        "start": 5175.78,
        "end": 5180.72
    },
    {
        "text": " es el impacto que tiene tanto en la demanda individual o la demanda del mercado. Entonces,",
        "start": 5180.72,
        "end": 5187.16
    },
    {
        "text": " internalizando esto que si varía el precio del bien, el movimiento es sobre la curva manteniendo",
        "start": 5187.16,
        "end": 5192.2
    },
    {
        "text": " constante siempre los demás factores y si altera a cualquier otro los demás factores, la curva",
        "start": 5192.2,
        "end": 5198.08
    },
    {
        "text": " se corre. Entonces, ahí lo que vamos a ver ahora. Hay un cambio de la cantidad de demandada",
        "start": 5198.08,
        "end": 5205.62
    },
    {
        "text": " cuando solo cambia el precio como decíamos hoy, hay un despreciamiento sobre la curva,",
        "start": 5205.62,
        "end": 5209.92
    },
    {
        "text": " al largo de la curva, no se desplaza la curva. Por ejemplo, el mercado la había salcolicas,",
        "start": 5209.92,
        "end": 5218.5599999999995
    },
    {
        "text": " si estoy en el punto A, hay una variación de precio del formato al que sube de 200 a 400,",
        "start": 5218.5599999999995,
        "end": 5224.48
    },
    {
        "text": " pasa a B, se reduce el consumo, también lo puede ser al revés, partiendo del punto B,",
        "start": 5224.48,
        "end": 5231.4
    },
    {
        "text": " si el precio baja, paso el punto A. En definitiva, hay un despreciamiento sobre la curva.",
        "start": 5231.4,
        "end": 5237.28
    },
    {
        "text": " Ahora bien, veamos qué pasa cuando cambia a algunos otros factores como yo les adelante,",
        "start": 5237.28,
        "end": 5246.839999999999
    },
    {
        "text": " hay un despreciamiento de la curva, hay un cambio de la demanda, no de la cantidad de",
        "start": 5246.839999999999,
        "end": 5251.36
    },
    {
        "text": " demanda, de la demanda, ¿no? Entonces, obviamente el despreciamiento fue hacia la derecha o",
        "start": 5251.36,
        "end": 5257.599999999999
    },
    {
        "text": " hacia la izquierda. hacia la derecha implica un incremento de la demanda. Observen que el",
        "start": 5257.599999999999,
        "end": 5267.36
    },
    {
        "text": " precio no varía, acabaría otro factor, entonces a un mismo precio, si yo estaba acá en la",
        "start": 5267.36,
        "end": 5273.2
    },
    {
        "text": " niña azul, a este mismo precio, ahora voy acá a una cantidad más o. Y si hay una diminución",
        "start": 5273.2,
        "end": 5280.0
    },
    {
        "text": " de la demanda, el despreciamiento e irse a la izquierda, andalagamente si el precio era",
        "start": 5280.0,
        "end": 5284.12
    },
    {
        "text": " acá y obtenía esta cantidad, ahora tengo una cantidad menor. Y es lo que está acá. Hablando",
        "start": 5284.12,
        "end": 5295.2
    },
    {
        "text": " de frutafresca, supongamos que ocurre una variación en los gustos en la preferencia del consumidor,",
        "start": 5295.2,
        "end": 5302.48
    },
    {
        "text": " por salú se asume que el consumo de frutafrescas es preferible, es aconsejable, por lo tanto hay un",
        "start": 5303.04,
        "end": 5313.639999999999
    },
    {
        "text": " incremento de la demanda producto de un cambio de gusto en la preferencia, por lo tanto la niña",
        "start": 5313.639999999999,
        "end": 5320.719999999999
    },
    {
        "text": " puntiada, esta que... como va. La niña puntiada está reflejando este impacto, ¿no? Y lo que yo le",
        "start": 5320.719999999999,
        "end": 5329.639999999999
    },
    {
        "text": " me cenaba recién, a este mismo precio se consumía esta cantidad, ahora por un cambio de gusto y",
        "start": 5329.64,
        "end": 5334.8
    },
    {
        "text": " preferencias se consume más a un mismo precio. Obviamente esto puede hacer el revés también,",
        "start": 5334.8,
        "end": 5340.8
    },
    {
        "text": " si por salú nos dicen que hay que dejarle consumir desde el mismo producto, bueno entonces la demanda",
        "start": 5340.8,
        "end": 5347.68
    },
    {
        "text": " se correr es que el izquierda acá se consume menor. ¿Sí? Esto ocurre habitualmente con productos",
        "start": 5347.68,
        "end": 5356.4400000000005
    },
    {
        "text": " que hemos sido incorporando los últimos años, ¿no? O sea, son muy jóvenes pero el protector",
        "start": 5356.44,
        "end": 5363.16
    },
    {
        "text": " solar, por ejemplo, yo era el chico, no se sabía nunca, por ejemplo, sabía bronceadores,",
        "start": 5363.16,
        "end": 5368.879999999999
    },
    {
        "text": " por todo solar, el alcohol en gel, por ejemplo, yo ni se había que existir, por eso un producto que",
        "start": 5372.879999999999,
        "end": 5378.759999999999
    },
    {
        "text": " ahora se ve ese hubo, se ve otro tipo de productos más.",
        "start": 5378.76,
        "end": 5380.76
    },
    {
        "text": " ¿No?",
        "start": 5380.76,
        "end": 5381.76
    },
    {
        "text": " El repellente, por ejemplo, no digo que lo existía, pero sí no era una cosa muy común,",
        "start": 5384.76,
        "end": 5388.52
    },
    {
        "text": " ahora estamos todos con el repellente, por el tema de la frecuencia de invasión de mosquito",
        "start": 5388.52,
        "end": 5392.6
    },
    {
        "text": " que tenemos. Bueno, eso es definitiva, suponiendo que el mercado funcionara, así, suponiendo",
        "start": 5392.6,
        "end": 5399.6
    },
    {
        "text": " a este mismo precio la demanda aumenta, ¿no? Porque hay una demanda de los consumidores,",
        "start": 5399.6,
        "end": 5405.12
    },
    {
        "text": " eso hace a preferir ese tipo de productos, ¿sí entiende? Suponiendo que se comporta el mercado",
        "start": 5405.12,
        "end": 5414.12
    },
    {
        "text": " esta manera. Bueno, ¿qué pasa si varía el ingreso? Bueno, si varía el ingreso de la persona",
        "start": 5414.12,
        "end": 5419.88
    },
    {
        "text": " suba el ingreso, ¿vara demandar más o más de mandar menos del bien? ¿Qué va a hacer?",
        "start": 5419.88,
        "end": 5423.88
    },
    {
        "text": " ¿Se demanda más? ¿Se demanda más?",
        "start": 5429.88,
        "end": 5430.88
    },
    {
        "text": " ¿Se depende del bien? ¿Se depende del bien, verdad?",
        "start": 5430.88,
        "end": 5433.88
    },
    {
        "text": " ¿Eso es objetivo? ¿Cómo?",
        "start": 5434.88,
        "end": 5436.88
    },
    {
        "text": " Es objetivo.",
        "start": 5436.88,
        "end": 5437.88
    },
    {
        "text": " Sí, también es objetivo, pero sí, en términos generadores podemos decir que hay que ver",
        "start": 5437.88,
        "end": 5443.36
    },
    {
        "text": " con el que tipo de bien estamos analizando. ¿No? Entonces, supongamos que si aumenta el ingreso",
        "start": 5443.36,
        "end": 5449.72
    },
    {
        "text": " aumenta el consumo de ese bien, si se da eso, estamos hablando de lo que se conoce en economía",
        "start": 5449.72,
        "end": 5455.2
    },
    {
        "text": " como un bien normal. Es decir, si tiene el mismo comportamiento, si aumenta el ingreso",
        "start": 5455.2,
        "end": 5461.56
    },
    {
        "text": " aumenta el consumo de ese bien normal, si baja y baja el consumo, también. Pero puede",
        "start": 5461.56,
        "end": 5466.96
    },
    {
        "text": " hacer caso que ante el aumento del ingreso diminucios a cantidad de bien. Por ejemplo, ¿qué",
        "start": 5466.96,
        "end": 5474.76
    },
    {
        "text": " eso se ocurre?",
        "start": 5474.860000000001,
        "end": 5475.84
    },
    {
        "text": " ¿Qué es lo que os he comprado? ¿Qué es lo que os he comprado?",
        "start": 5475.84,
        "end": 5482.84
    },
    {
        "text": " ¿Pero os he comprado un puril de pantaños más barato y después os compras el mejor?",
        "start": 5482.84,
        "end": 5487.84
    },
    {
        "text": " Ahí está. ¿Está?",
        "start": 5487.84,
        "end": 5489.84
    },
    {
        "text": " En el marco estaría un barato ahora y tengo un brazo de romano. ¿Qué es lo que es?",
        "start": 5489.84,
        "end": 5496.84
    },
    {
        "text": " En el nor. ¿Te compras? Ahí está.",
        "start": 5496.84,
        "end": 5499.84
    },
    {
        "text": " Pero no tenía más remedio de comprar un producto que no me gustaba un puril tan daño que era más o menos medio pelo,",
        "start": 5499.84,
        "end": 5505.84
    },
    {
        "text": " más mentó el ingreso, pasó un producto de mejor calidad.",
        "start": 5505.84,
        "end": 5509.84
    },
    {
        "text": " Y ese lo dejo de consumir o diminuyo el consumo.",
        "start": 5509.84,
        "end": 5513.84
    },
    {
        "text": " Y así podemos enumerar un montón de bienes que pueden tener ese comportamiento.",
        "start": 5513.84,
        "end": 5520.84
    },
    {
        "text": " En ese caso se aumenta el ingreso y diminuyo la cantidad de mandada a lo que se conoce en economía como un bien inferior.",
        "start": 5520.84,
        "end": 5528.84
    },
    {
        "text": " Bueno, en este caso aumenta el ingreso y aumenta la cantidad de mandada de frutas frescas en este gráfico.",
        "start": 5528.84,
        "end": 5538.84
    },
    {
        "text": " Por lo tanto, en este caso el bien frutas frescas sería un bien normal.",
        "start": 5538.84,
        "end": 5542.84
    },
    {
        "text": " Observa que al mismo precio se consume más.",
        "start": 5542.84,
        "end": 5548.84
    },
    {
        "text": " En este caso sería un bien inferior porque a un precio consume menos, aumenta el ingreso y consume menos frutas frescas.",
        "start": 5548.84,
        "end": 5558.84
    },
    {
        "text": " Por lo tanto, en este caso el consumidor para él es inferior.",
        "start": 5558.84,
        "end": 5564.84
    },
    {
        "text": " Obviamente esto depende de elementos subjetivos como decía él y también elementos de cómo esté la situación de personal de cada uno, etc.",
        "start": 5564.84,
        "end": 5577.84
    },
    {
        "text": " Es subjetivo en cuanto a los gustos y también esa asocia que a cuanto menos nivel de ingreso no tiene,",
        "start": 5577.84,
        "end": 5583.84
    },
    {
        "text": " generalmente compra alimentos como puede.",
        "start": 5583.84,
        "end": 5587.84
    },
    {
        "text": " Y a medida que aumenta como decía él, bueno, voy a quiriendo alimentos que me gusta más.",
        "start": 5587.84,
        "end": 5593.84
    },
    {
        "text": " Pero a veces los gustos, pues decir, yo sigo comiendo el puré este medio pelo porque me gustó el punto perfecto.",
        "start": 5593.84,
        "end": 5603.84
    },
    {
        "text": " ¿Y quién es él? Bueno, ¿qué es lo que estamos viendo acá?",
        "start": 5603.84,
        "end": 5609.84
    },
    {
        "text": " Lo que estamos viendo es cómo corre la demanda por lo determinante. Vimos ingustos, muy ingreso, ahora vamos a ver qué pasa con los bienes asociados.",
        "start": 5609.84,
        "end": 5619.84
    },
    {
        "text": " Entonces, ¿qué pasa si suba el precio de un bien? Sabemos por el demanda que la demanda de ese bien va a bajar.",
        "start": 5619.84,
        "end": 5629.84
    },
    {
        "text": " Suyo el precio bien cualquiera y baja la demanda de ese bien. Ahora, lo que estamos viendo es ¿qué impacto puede tener en la demanda del bien que yo estoy analizando?",
        "start": 5629.84,
        "end": 5640.84
    },
    {
        "text": " El hecho que subió el precio de otro bien cualquiera. Primero puede tener ningún impacto, entonces ahí nada.",
        "start": 5640.84,
        "end": 5648.84
    },
    {
        "text": " Si no tiene nada, porque ese bien no está vinculado. Ahora, si tiene impacto, ahí podemos ver dos situaciones a destacar.",
        "start": 5648.84,
        "end": 5658.84
    },
    {
        "text": " Si aumenta el precio de un bien o a ver qué se hace acá. Si baja el precio de un bien, ya sé que va a aumentar la demanda de ese bien, pero subes,",
        "start": 5659.84,
        "end": 5672.84
    },
    {
        "text": " me impacta en la demanda del bien que yo estoy analizando, por ejemplo baja, baja el precio de un bien, suba en la demanda de ese bien, yo subes bien impacta en la demanda del otro bien,",
        "start": 5672.84,
        "end": 5684.84
    },
    {
        "text": " bajando, esto suben sustitutos, por ejemplo, bajo el precio del bien, pollo. Entonces lo que hace este consumidor consumimos pollo, pero subes, baja el consumo de carne.",
        "start": 5684.84,
        "end": 5699.84
    },
    {
        "text": " Entonces, esta persona sustituye la carne roja por la carne de pollo. Por lo tanto, si se da este caso de que el impacto de la baja del precio de un bien,",
        "start": 5699.84,
        "end": 5714.84
    },
    {
        "text": " este caso pollo, genera una baja en el consumo de carne roja, es un bien sustituto para el consumidor.",
        "start": 5714.84,
        "end": 5723.84
    },
    {
        "text": " Algunos van a poder decir, yo tengo alergia a la carne roja, por lo tanto, baja el precio del pollo con un sumo de pollo y la carne nada perfecto, en ese caso no hay relación, pero yo ocurre esto, estamos hablando de un bien sustituto y viceversa.",
        "start": 5724.84,
        "end": 5742.84
    },
    {
        "text": " Si ante la baja del precio de un bien, ya sabemos que va a subir la demanda, del bien, y implica demás que suba la demanda del otro bien, o sea, se comportan igual, estamos hablando de un bien complementario.",
        "start": 5743.84,
        "end": 5762.84
    },
    {
        "text": " En caso de bien es que van en conjunto, el consumo de uno va asociado el consumo de otro, por ejemplo aquellos que consumen, cafico en azúcar o repuestos, pues de algo, la más aquí, aún aún.",
        "start": 5763.84,
        "end": 5783.84
    },
    {
        "text": " Lo importante es que si hay un vínculo que se da, si baja el precio de un bien, ya sé que va a subir la demanda del bien, y a su vez me genera un momento de la demanda, y otro bien, entonces son bienes que están complementarios.",
        "start": 5784.84,
        "end": 5797.84
    },
    {
        "text": " Entonces, ¿qué tenemos acá? Estamos analizando el impacto de la demanda, de un bien, jota cualquiera, que pasa si baja o sube el precio de un bien, otro bien.",
        "start": 5797.84,
        "end": 5809.84
    },
    {
        "text": " Si no altera nada, son bienes que no tienen vínculo, pero si altera, o sea cuando digo altera es si baja la demanda, y sube su título y si sube su bien complementario.",
        "start": 5810.84,
        "end": 5822.84
    },
    {
        "text": " Entonces, veamos en el caso de este, ¿no? Su mamá vos quede consumidor, usualmente acompaña el consumo de frutas frescas con elados.",
        "start": 5823.84,
        "end": 5834.84
    },
    {
        "text": " Entonces, ¿qué impacto puede tener en la cantidad de mandadas de frutas el hecho de que varía el precio de el lado?",
        "start": 5834.84,
        "end": 5843.84
    },
    {
        "text": " Entonces, sube el precio del elado, por lo tanto esta persona consume menos elado, y a su vez consume menos frutas porque el consume fruta con el lado.",
        "start": 5844.84,
        "end": 5858.84
    },
    {
        "text": " Si se da eso, entonces estamos hablando bien complementario.",
        "start": 5858.84,
        "end": 5864.84
    },
    {
        "text": " Si, si tiene que dar esa conjunción de efectos.",
        "start": 5865.84,
        "end": 5871.84
    },
    {
        "text": " Supongamos que el precio de la fuulta congelada baja, baja el precio de la fuulta congelada, mientras que el precio de la fruta fresca se mantiene.",
        "start": 5871.84,
        "end": 5884.84
    },
    {
        "text": " Por lo tanto, tenemos que ver si esto tiene un efecto en la demanda de frutas frescas.",
        "start": 5885.84,
        "end": 5896.84
    },
    {
        "text": " Entonces, si baja el precio de las frutas congeladas, esta persona va a consumir más frutas congeladas, aumenta la demanda, la fuulta congelada y a su vez baja la demanda de frutas frescas.",
        "start": 5896.84,
        "end": 5912.84
    },
    {
        "text": " Por lo tanto, acá estamos hablando bien sustituto, acá está inferior para esta mal, y su bien sustituto.",
        "start": 5912.84,
        "end": 5919.84
    },
    {
        "text": " En la realidad de lo mismo, ambos son sustitutos, son sustitutos.",
        "start": 5928.84,
        "end": 5933.84
    },
    {
        "text": " Claro, también si yo lo hago al revés me acabo de usar mi efecto.",
        "start": 5934.84,
        "end": 5939.84
    },
    {
        "text": " O sea, si lo que baja acá es el precio de frutas frescas, dejo con su bien sustituto congeladas. Son bien sustitutos ambos.",
        "start": 5939.84,
        "end": 5948.84
    },
    {
        "text": " Por supuesto, ahí sustituto más perfectos que otros.",
        "start": 5948.84,
        "end": 5952.84
    },
    {
        "text": " Por supuesto, para mí es diferente de comer carne de sardo y carne de vaca.",
        "start": 5953.84,
        "end": 5958.84
    },
    {
        "text": " Es perfecto, me da lo mismo, te dice. ¿Qué crees comer? Me da lo mismo.",
        "start": 5958.84,
        "end": 5962.84
    },
    {
        "text": " Está, me da lo mismo, pero mejor no, el sardo.",
        "start": 5962.84,
        "end": 5968.84
    },
    {
        "text": " Bueno, entonces ahí no es sustituto perfecto, lo como igual, pero si tienes sardo mejor.",
        "start": 5968.84,
        "end": 5973.84
    },
    {
        "text": " O sea, hay diferentes grados.",
        "start": 5973.84,
        "end": 5976.84
    },
    {
        "text": " Bueno.",
        "start": 5977.84,
        "end": 5980.84
    },
    {
        "text": " Entonces, lo que estamos viendo es que si se altera con aquí otro factor que no sea el precio, siempre efectos hay lado, estamos viendo.",
        "start": 5983.84,
        "end": 5990.84
    },
    {
        "text": " Un efecto solo, lo estamos combinando, que pasa con todo lo más efecto.",
        "start": 5990.84,
        "end": 5995.84
    },
    {
        "text": " Lo que aquí también encuentra es que se corre la curva, se corre la demanda hacia el derecho o al izquierda y lo único que es tener en cuenta.",
        "start": 5995.84,
        "end": 6004.84
    },
    {
        "text": " Ustedes tienen un dominio absoluto de matemáticas, menos que estos que es sencillos, o sea que por ese lado, sé que no hay ningún drama.",
        "start": 6005.84,
        "end": 6010.84
    },
    {
        "text": " Lo único que hay que tener conceptualmente cuidado es conceptualmente hablando que quiere decir en movimiento las curvas.",
        "start": 6010.84,
        "end": 6016.84
    },
    {
        "text": " Y con eso van a resolver cualquier tipo de plantamiento.",
        "start": 6016.84,
        "end": 6020.84
    },
    {
        "text": " Vamos a ver qué pasa con las expectativas, por las expectativas también, es otro componente que determina las demandas.",
        "start": 6020.84,
        "end": 6027.84
    },
    {
        "text": " Las expectativas, las agentes, influyen.",
        "start": 6027.84,
        "end": 6031.84
    },
    {
        "text": " Es decir, las expectativas que va a pasar en el futuro, ¿no?",
        "start": 6032.84,
        "end": 6036.84
    },
    {
        "text": " Entonces, por ejemplo, si se espera que va a variar el precio un bien, puede terminar que cambia las acciones hoy.",
        "start": 6036.84,
        "end": 6044.84
    },
    {
        "text": " En el caso de esta ahí, si se espera que el precio de los combustibles suba mañana, es posible que los propietarios que agren,",
        "start": 6044.84,
        "end": 6052.84
    },
    {
        "text": " van a cargar hasta anticipándose a la suba.",
        "start": 6052.84,
        "end": 6057.84
    },
    {
        "text": " Por ejemplo, si yo tengo expectativas de que los pasajes de avión, tengo un viaje programado que voy a hacer en fecha viajo.",
        "start": 6058.84,
        "end": 6071.84
    },
    {
        "text": " Y tengo expectativas de que va a subir los pasajes para esas fechas que hago.",
        "start": 6071.84,
        "end": 6075.84
    },
    {
        "text": " ¿Qué hago?",
        "start": 6075.84,
        "end": 6076.84
    },
    {
        "text": " Lo compro ahora.",
        "start": 6076.84,
        "end": 6077.84
    },
    {
        "text": " O al revés.",
        "start": 6079.84,
        "end": 6080.84
    },
    {
        "text": " No, no, no, voy a esperar porque tengo una expectativa que el precio va a bajar el pasaje.",
        "start": 6081.84,
        "end": 6086.84
    },
    {
        "text": " Se entiende, siempre lo tomo hoy, ¿no? Porque yo entumo hoy.",
        "start": 6088.84,
        "end": 6092.84
    },
    {
        "text": " Cuando digo expectativa es eso, expectativa, en ninguna certeza, esto. Es una expectativa, como cualquier otra.",
        "start": 6092.84,
        "end": 6100.84
    },
    {
        "text": " Tengo una expectativa que suja algo.",
        "start": 6100.84,
        "end": 6102.84
    },
    {
        "text": " Y lo que me voy a decir, por ejemplo, la suba de la bonde de Jubsa, que aquí no tiene expectativa, ahí tenéis que te dicen.",
        "start": 6102.84,
        "end": 6109.84
    },
    {
        "text": " ¿La suba?",
        "start": 6109.84,
        "end": 6110.84
    },
    {
        "text": " Pero de la bonde de Jubsa.",
        "start": 6110.84,
        "end": 6112.84
    },
    {
        "text": " La suba y te dicen, va a subir tal mes.",
        "start": 6112.84,
        "end": 6115.84
    },
    {
        "text": " Los boletos.",
        "start": 6115.84,
        "end": 6116.84
    },
    {
        "text": " Y ahí no tenéis mucha chance.",
        "start": 6116.84,
        "end": 6118.84
    },
    {
        "text": " Ahí no vas a comprar boletos.",
        "start": 6118.84,
        "end": 6120.84
    },
    {
        "text": " Está, pero ahí no tenéis expectativa, ahí ¿qué pasaría lo mismo? ¿Vamos a comprar antes de Jubsa?",
        "start": 6120.84,
        "end": 6125.84
    },
    {
        "text": " Ahí son más reemplos, sí, pero que boletos de Jubsa que vas a comprar primero.",
        "start": 6125.84,
        "end": 6129.84
    },
    {
        "text": " Ah, bueno, no sé.",
        "start": 6129.84,
        "end": 6130.84
    },
    {
        "text": " Ah, voy a decir que me vas a comprar.",
        "start": 6130.84,
        "end": 6132.84
    },
    {
        "text": " ¿Cuponera?",
        "start": 6132.84,
        "end": 6133.84
    },
    {
        "text": " Ah, sí, claro, si puede comprarlo sí. Una cuponera.",
        "start": 6133.84,
        "end": 6135.84
    },
    {
        "text": " Sí, claro.",
        "start": 6135.84,
        "end": 6136.84
    },
    {
        "text": " Si tenéis posibilidad de comprarlo sí, comprarías.",
        "start": 6136.84,
        "end": 6138.84
    },
    {
        "text": " Ahí tenéis más certeza que vas a subir.",
        "start": 6138.84,
        "end": 6141.84
    },
    {
        "text": " Sí, claro.",
        "start": 6141.84,
        "end": 6142.84
    },
    {
        "text": " No, pero el juego que podéis, en el caso de él, es cierto, ¿no?",
        "start": 6142.84,
        "end": 6147.84
    },
    {
        "text": " También yo puedo decir, por ejemplo, está acá también el ingreso, ¿no?",
        "start": 6147.84,
        "end": 6150.84
    },
    {
        "text": " Si yo sé que me vas a subir los ingresos, ahí tengo un dato cierto o bajar.",
        "start": 6150.84,
        "end": 6156.84
    },
    {
        "text": " ¿Qué haces, por ejemplo, si sé que me van a subir los ingresos o me van a bajar? ¿Qué hago yo si me da?",
        "start": 6156.84,
        "end": 6162.84
    },
    {
        "text": " Yo sé que a partir de dos meses me bajan el sueldo.",
        "start": 6162.84,
        "end": 6167.84
    },
    {
        "text": " ¿Qué harían? ¿Castamenos? ¿No? Me ha chico.",
        "start": 6167.84,
        "end": 6172.84
    },
    {
        "text": " Suelo ocurrir a revés también.",
        "start": 6172.84,
        "end": 6176.84
    },
    {
        "text": " Si tengo la expectativa que a partir de dos meses me duplican el sueldo, ¿qué puede ferir que va a pasar?",
        "start": 6176.84,
        "end": 6183.84
    },
    {
        "text": " Conprato, sanohanjitas.",
        "start": 6183.84,
        "end": 6185.84
    },
    {
        "text": " Claro, me endeudo, ¿no? Bueno, conmarriba, ¿eh?",
        "start": 6185.84,
        "end": 6188.84
    },
    {
        "text": " Me compro una tarjetita, compro algo.",
        "start": 6188.84,
        "end": 6191.84
    },
    {
        "text": " ¿No? ¿Se entiende? ¿Humbras entradas fuera avioleta?",
        "start": 6191.84,
        "end": 6199.84
    },
    {
        "text": " Obviamente que los comportamientos no son iguales, ¿no? Por supuesto.",
        "start": 6199.84,
        "end": 6205.84
    },
    {
        "text": " Estamos dando powtas de conducta siempre con expectativas, ¿no?",
        "start": 6205.84,
        "end": 6208.84
    },
    {
        "text": " Después que apare llega el momento y eso no se concreta, porque yo tengo la expectativa de que se concreta.",
        "start": 6208.84,
        "end": 6214.84
    },
    {
        "text": " En este caso, pareciera ser más cierto que me van a subir el sueldo.",
        "start": 6214.84,
        "end": 6217.84
    },
    {
        "text": " Entonces, el tema de acá, lo que estoy realizando es que hoy sube la demanda.",
        "start": 6217.84,
        "end": 6223.84
    },
    {
        "text": " En el caso yo tome la certeza o la expectativa, cuando sube el sueldo, compro más hoy.",
        "start": 6223.84,
        "end": 6227.84
    },
    {
        "text": " Por lo tanto aumenta la demanda de un televisor o lo que sea.",
        "start": 6227.84,
        "end": 6231.84
    },
    {
        "text": " ¿O lo volete todo lo que sea? ¿Se entiende?",
        "start": 6231.84,
        "end": 6235.84
    },
    {
        "text": " Y viceversa. Entonces, las expectativas también, es un elemento que juega.",
        "start": 6235.84,
        "end": 6241.84
    },
    {
        "text": " Bueno, por último, el sanucio que vamos a ver, el viernes tenemos práctico, ¿no?",
        "start": 6248.84,
        "end": 6255.84
    },
    {
        "text": " ¿Pratíclo? ¿Pratíclo?",
        "start": 6255.84,
        "end": 6259.84
    },
    {
        "text": " Práticlo teodico. El práctico me lo tiene conmigo también.",
        "start": 6259.84,
        "end": 6262.84
    },
    {
        "text": " Vamos a ver, bueno, lo que está en el práctico 1, que yo tenía que estar colgado en la página,",
        "start": 6262.84,
        "end": 6268.84
    },
    {
        "text": " creo que no está, me dijeron, no hay por lo menos eso.",
        "start": 6268.84,
        "end": 6271.84
    },
    {
        "text": " Y después terminamos con esto, como marcado.",
        "start": 6271.84,
        "end": 6275.84
    },
    {
        "text": " Bueno, no hay por.",
        "start": 6275.84,
        "end": 6278.84
    }
]