[
    {
        "text": " Bien, bueno ahí estamos grabando. Bueno, arranquemos entonces...",
        "start": 0.0,
        "end": 18.0
    },
    {
        "text": " Bueno, un poquito está comentando antes de empezar la grabación. Este curso busca, como",
        "start": 18.0,
        "end": 30.700000000000003
    },
    {
        "text": " se ha introducido los a ustedes, en aspectos y temáticas de que sujen a considerar el software",
        "start": 30.700000000000003,
        "end": 37.34
    },
    {
        "text": " como un negocio y por eso repito lo que yo le voy a comentar es que no vamos a meternos",
        "start": 37.34,
        "end": 42.06
    },
    {
        "text": " en la parte de tecnologías y tampoco vamos a meternos en la parte de gestión de proyectos,",
        "start": 42.06,
        "end": 46.74
    },
    {
        "text": " sino específicamente en la industria del software como tal. Y bueno, también vamos a hablar",
        "start": 46.74,
        "end": 55.940000000000005
    },
    {
        "text": " de Uruguay, de la región, de las diferentes regiones en lo que respecta a tecnología y más o menos",
        "start": 55.940000000000005,
        "end": 63.980000000000004
    },
    {
        "text": " como se me pidan cada una. Incluso vamos a comentar experiencias personales, ejemplos,",
        "start": 63.980000000000004,
        "end": 72.30000000000001
    },
    {
        "text": " anécdotas, nunca diciendo el nombre real de las clientes o de las organizaciones.",
        "start": 72.3,
        "end": 79.3
    },
    {
        "text": " Incluso también vamos a hablar de valores, de valores horas, de valores de software.",
        "start": 79.3,
        "end": 85.3
    },
    {
        "text": " La idea es dar un conjunto de conocimiento que realidad no es solamente práctico y empírico,",
        "start": 85.3,
        "end": 93.02
    },
    {
        "text": " sino que también hay bastante teoría atrás de esto. De hecho, uno de los libros de",
        "start": 93.02,
        "end": 97.66
    },
    {
        "text": " Cabecera, que es el de Michael Kusumano, que se llama The Business of Software, que se",
        "start": 97.66,
        "end": 101.89999999999999
    },
    {
        "text": " recomiendo mucho el tipo trabaja haciendo investigación y además consultoría en estos temas.",
        "start": 101.89999999999999,
        "end": 108.58
    },
    {
        "text": " O sea que si bien por supuesto no es una temática que se debe como para hacer investigación básica",
        "start": 108.58,
        "end": 113.82
    },
    {
        "text": " o mucho de y más de tampoco es algo que es 100% conocimiento de la calle y empírico,",
        "start": 113.82,
        "end": 120.38
    },
    {
        "text": " es una mezcla de los dos. Bueno, con un poquito los temas en general.",
        "start": 120.38,
        "end": 126.38
    },
    {
        "text": " Ahora, el final tengo una listita de los libros y ahí lo van a ver.",
        "start": 126.38,
        "end": 132.38
    },
    {
        "text": " Esta es un conjunto de los más o menos de los temas que van a ver, que también nos encuentran",
        "start": 132.38,
        "end": 136.85999999999999
    },
    {
        "text": " en el programa del curso. Sobre la metodofía de enseñanza, el panotéemosetas clases,",
        "start": 136.85999999999999,
        "end": 143.57999999999998
    },
    {
        "text": " obviamente, los lunes de sítima media 9.5 y los viernes de 6 a 8.",
        "start": 143.57999999999998,
        "end": 148.38
    },
    {
        "text": " Y también van a ver algunas charlas de invitados que conocen de la temática y que son del medio.",
        "start": 148.38,
        "end": 158.38
    },
    {
        "text": " Como ya comenté un poquito brevemente, cada tema y eso lo van a ver bien claro en el Eva.",
        "start": 158.38,
        "end": 163.1
    },
    {
        "text": " Cada tema tiene su lectura previa o su artículo previo.",
        "start": 163.1,
        "end": 168.14
    },
    {
        "text": " Después vamos a hablar también, cada tanto de algunos casos reales.",
        "start": 168.14,
        "end": 172.9
    },
    {
        "text": " Van a ver por lo menos todas presentaciones de experiencias reales, de empresa, de tecnología,",
        "start": 172.9,
        "end": 178.62
    },
    {
        "text": " de Uruguay, de empresas Uruguayas, en particular, van a ver, van a tener una charla de los fundadores",
        "start": 178.62,
        "end": 184.9
    },
    {
        "text": " de una empresa de producto Uruguayas y van a tener una charla de los fundadores de una empresa de servicios",
        "start": 184.9,
        "end": 189.38
    },
    {
        "text": " Uruguayas y también de gente joven, o sea que lo sientan ustedes relacionables,",
        "start": 189.38,
        "end": 194.9
    },
    {
        "text": " si a ustedes mismos. Y bueno, después él trabajó final en grupo,",
        "start": 194.9,
        "end": 198.9
    },
    {
        "text": " que la idea obviamente es que la idea negocio que ustedes planteen termina siendo una excusa para pasar",
        "start": 198.9,
        "end": 205.9
    },
    {
        "text": " por los diferentes temas que vemos en el curso y para que ustedes usen las herramientas del curso",
        "start": 205.9,
        "end": 211.9
    },
    {
        "text": " a una idea que los motiva a ustedes, que los motiva a buscar material, a buscar,",
        "start": 211.9,
        "end": 216.9
    },
    {
        "text": " a investigar, no sé, cuántas, para ver la parte de mercado objetivo, por ejemplo,",
        "start": 216.9,
        "end": 222.9
    },
    {
        "text": " cuánta gente tiene tanta edad y tiene tal problema y además usa aplicaciones móviles para dar cual cosa.",
        "start": 222.9,
        "end": 231.9
    },
    {
        "text": " Entonces, investigan o buscan casos parecidos en literatura de Uruguay o del mundo,",
        "start": 231.9,
        "end": 236.9
    },
    {
        "text": " pero bueno, el proyecto no deja de ser eso, no una excusa para aplicar ustedes y discutiendo entre ustedes,",
        "start": 236.9,
        "end": 243.9
    },
    {
        "text": " una idea que también ustedes mismos haran a presentar.",
        "start": 243.9,
        "end": 246.9
    },
    {
        "text": " Si bien, ya colocamos, subimos en el EBA a un PDF como de 8, 9 o 10 páginas que habla bastante del trabajo final,",
        "start": 246.9,
        "end": 256.9
    },
    {
        "text": " una idea sobre el trabajo final, sobre el trabajo práctico, voy a dedicar un rato",
        "start": 256.9,
        "end": 263.9
    },
    {
        "text": " dentro de un par de clases para hablar específicamente del proyecto,",
        "start": 263.9,
        "end": 267.9
    },
    {
        "text": " igual capaz que más sobre el final del caso si tiene alguna duda del proyecto, la pueden ir asciento.",
        "start": 267.9,
        "end": 272.9
    },
    {
        "text": " El importante sí, como comentábamos antes de grabar es que vayan armando los grupos entre 4 y 6 personas,",
        "start": 272.9,
        "end": 279.9
    },
    {
        "text": " porque la idea es que el lunes que viene, ya estén todos formados y como vieron dentro de el EBA mismo,",
        "start": 279.9,
        "end": 284.9
    },
    {
        "text": " cada uno puede autasignarse los grupos.",
        "start": 284.9,
        "end": 289.9
    },
    {
        "text": " Bueno, esta es la formada de la acción que también está en el programa del curso.",
        "start": 289.9,
        "end": 298.9
    },
    {
        "text": " Bueno, fechas importantes, un poco de logística y housekeeping, como decía,",
        "start": 298.9,
        "end": 305.9
    },
    {
        "text": " el lunes que viene de la entrega más que la entrega,",
        "start": 305.9,
        "end": 309.9
    },
    {
        "text": " cada uno de ustedes aseguré de aparecer en la conformación de grupos,",
        "start": 309.9,
        "end": 315.9
    },
    {
        "text": " después esto lo vamos a ir viendo también cada vez más,",
        "start": 315.9,
        "end": 318.9
    },
    {
        "text": " pero la idea es que vayan pensando dos ideas de negocio que le gustaría desarrollar para el proyecto final,",
        "start": 318.9,
        "end": 325.9
    },
    {
        "text": " dos ideas por grupo, cada grupo vaya pensando dos ideas.",
        "start": 325.9,
        "end": 330.9
    },
    {
        "text": " Una idea puede ser una aplicación que blablabla la típica,",
        "start": 330.9,
        "end": 336.9
    },
    {
        "text": " aunque me gustaría que no lo pese a pensar así y ya no va a ver por qué,",
        "start": 336.9,
        "end": 340.9
    },
    {
        "text": " la idea es que empiece a pensar en términos del problema, no de la solución.",
        "start": 340.9,
        "end": 344.9
    },
    {
        "text": " idealmente es a veo tal problema y quisiera ser una solución tecnológica para resolver tal problema,",
        "start": 344.9,
        "end": 351.9
    },
    {
        "text": " ya mejor empecé a lo así que pensaba que empezar voy a hacer una app que blablabla puede ser también la conformación de empresa de servicio,",
        "start": 351.9,
        "end": 361.9
    },
    {
        "text": " de un área de servicio, puede ser un área dentro de otra empresa de tecnología,",
        "start": 361.9,
        "end": 365.9
    },
    {
        "text": " una sucusal nuevo de una empresa de tecnología, o sea,",
        "start": 365.9,
        "end": 368.9
    },
    {
        "text": " las formas de las ideas pueden ser varias, pero lo importante es que vayan pensando de a poco y bueno,",
        "start": 368.9,
        "end": 374.9
    },
    {
        "text": " en la clase lo veremos viendo, vayan pensando dos ideas,",
        "start": 374.9,
        "end": 378.9
    },
    {
        "text": " para presentar el 30 de agosto y después vamos a tener unos 15 o 20 minutos mano a mano con cada grupo,",
        "start": 378.9,
        "end": 387.9
    },
    {
        "text": " en donde me van a explicar las dos ideas y entre los dos, entre el grupo y yo,",
        "start": 387.9,
        "end": 391.9
    },
    {
        "text": " vamos a elegir una de las dos ideas, la que nos pareja que tiene más carne o más jugo para irles sacando a lo largo de todo el curso.",
        "start": 391.9,
        "end": 400.9
    },
    {
        "text": " Esto de BMC quiere decir, pínemos el canvas, que por supuesto lo vamos a ver,",
        "start": 400.9,
        "end": 405.9
    },
    {
        "text": " o sea que para el 30 de agosto le pedimos que traen una pequeña descripción de la idea número uno y el canvas de esa idea,",
        "start": 405.9,
        "end": 414.9
    },
    {
        "text": " que ya nos da lo que es, y una pequeña descripción de la segunda idea y el canvas de la segunda idea.",
        "start": 414.9,
        "end": 420.9
    },
    {
        "text": " Bueno, después vamos a tener por lo menos tres instancias,",
        "start": 420.9,
        "end": 425.9
    },
    {
        "text": " porque según los números seguramente 20 grupos van a ver,",
        "start": 425.9,
        "end": 429.9
    },
    {
        "text": " entonces en esas tres instancias, la que le decía de mano a mano, entre el grupo y yo,",
        "start": 429.9,
        "end": 435.9
    },
    {
        "text": " y ahí después le vamos a decir exactamente, tipo, el grupo 7 le toca el 10 de septiembre entre las 7,50 y las 8 y 10,",
        "start": 435.9,
        "end": 444.9
    },
    {
        "text": " y bueno, la pedimos que está tendrán de subirse al lobby de la columna unos minutos antes,",
        "start": 444.9,
        "end": 450.9
    },
    {
        "text": " porque bueno, eso realmente tienen que salir bastante preciso una tras de la otra,",
        "start": 450.9,
        "end": 455.9
    },
    {
        "text": " así no nos atrasamos, y bueno, y en esas tres clases, o sea, no hay clase en el sentido convencional,",
        "start": 455.9,
        "end": 462.9
    },
    {
        "text": " pero obviamente al grupo que le toque ese día y hace ahora, obviamente tiene que asistir,",
        "start": 462.9,
        "end": 467.9
    },
    {
        "text": " capaz que no todo lo sinterante de grupo, pero de los 5, por lo menos 3 tendrían que estar,",
        "start": 467.9,
        "end": 473.9
    },
    {
        "text": " si hay algún problema de logística, me lo indica.",
        "start": 473.9,
        "end": 477.9
    },
    {
        "text": " Después de 24 de septiembre, ese día funcionan en el recitario, así que no hay clase,",
        "start": 477.9,
        "end": 481.9
    },
    {
        "text": " y bueno, después está la primera parciales que tampoco hay clase, después pusimos también la 2 clase consulta,",
        "start": 481.9,
        "end": 488.9
    },
    {
        "text": " estas son a priori, están subventas a cambio, pero bueno, por ahora, le dejas dejar por lo menos esa 2 clase consulta,",
        "start": 488.9,
        "end": 494.9
    },
    {
        "text": " y después también, a ver, esas clases consultas son, sobre todo, pensando en consultas del proyecto final,",
        "start": 494.9,
        "end": 500.9
    },
    {
        "text": " que cada vez seguramente se le van a ir generando más dudas a medida que lo van avanzando,",
        "start": 500.9,
        "end": 506.9
    },
    {
        "text": " y después van a tener, van a ver que va a tener, no le van a tener 13 entregas del proyecto final,",
        "start": 506.9,
        "end": 513.9
    },
    {
        "text": " la del 22 de noviembre es la entrega final del proyecto de trabajo práctico, sí, el trabajo en grupo,",
        "start": 513.9,
        "end": 519.9
    },
    {
        "text": " pero el 18 de octubre va a ser una entrega intermedia de esos dos temas,",
        "start": 519.9,
        "end": 524.9
    },
    {
        "text": " análisis de marcado y un experimento que ni lo digo ahora, porque falta muchísimo y ya lo vamos a ir hablando,",
        "start": 524.9,
        "end": 530.9
    },
    {
        "text": " y bueno, en realidad la primera entrega empieza como les comentaba recién este 30 de agosto con esas dos ideas",
        "start": 530.9,
        "end": 536.9
    },
    {
        "text": " y el canvas para cada una, que también vamos a profundizar más sobre eso, después,",
        "start": 536.9,
        "end": 541.9
    },
    {
        "text": " igual también pueden ir tirando preguntas en los foros, por ejemplo, si ya han leído, por ejemplo,",
        "start": 541.9,
        "end": 548.9
    },
    {
        "text": " la guía está del trabajo práctico final y quieren tirar de una pregunta en el foro,",
        "start": 548.9,
        "end": 553.9
    },
    {
        "text": " ahí un foro específico para el trabajo final abajo en la sección del proyecto.",
        "start": 553.9,
        "end": 561.9
    },
    {
        "text": " Y bueno, después el 2226, el 19 de esta vez el 19 de la prueba final,",
        "start": 561.9,
        "end": 571.9
    },
    {
        "text": " que esto es lo que comentamos un poco antes de empezar la grabación,",
        "start": 571.9,
        "end": 575.9
    },
    {
        "text": " la verdad que de aquí ya no tengo claridad si esa prueba hoy va a ser presencial o virtual,",
        "start": 575.9,
        "end": 581.9
    },
    {
        "text": " el año pasado se hizo virtual porque obviamente no había otra nativa,",
        "start": 581.9,
        "end": 585.9
    },
    {
        "text": " ahí veremos lo que le hago de la resuelve, y después el 22 de noviembre empiezan las presentaciones,",
        "start": 585.9,
        "end": 593.9
    },
    {
        "text": " entonces la idea es que nadie tenga un changuí de más días, simplemente porque le tengo que presentar más tarde,",
        "start": 593.9,
        "end": 599.9
    },
    {
        "text": " entonces todos se entregan el informe esas 20 páginas a lo sumo, lo entregan todos,",
        "start": 599.9,
        "end": 604.9
    },
    {
        "text": " todos el 22 y todos mandan las presentaciones de todos el 22 y ese 22 ya presenta la primera tanda,",
        "start": 604.9,
        "end": 611.9
    },
    {
        "text": " el 26 presenta la segunda tanda y el 29 presenta la taza,",
        "start": 611.9,
        "end": 615.9
    },
    {
        "text": " eso es como el pitch que van a hacer ustedes y la defensa, la mini defensa de esa idea de negocio",
        "start": 615.9,
        "end": 622.9
    },
    {
        "text": " que elijamos entre las dos que propongan.",
        "start": 622.9,
        "end": 625.9
    },
    {
        "text": " Si hay alguna otra duda de la que viene poniendo en el chat, pueden hacerlo.",
        "start": 625.9,
        "end": 636.9
    },
    {
        "text": " Y bueno, acá hay unos links, el taller en Carare, que se lo recomendamos mucho,",
        "start": 636.9,
        "end": 640.9
    },
    {
        "text": " que habla muy fuerte de la parte de generación de modelo de negocio,",
        "start": 640.9,
        "end": 645.9
    },
    {
        "text": " de Lean Startup, de Design Thinking, el tema con el Carare,",
        "start": 645.9,
        "end": 652.9
    },
    {
        "text": " y nosotros también vamos a dar unas cuantas de esas cosas, Design Thinking,",
        "start": 652.9,
        "end": 656.9
    },
    {
        "text": " no vamos a ver, pensamiento diseño, no lo vamos a ver, Lean vamos a ver un poco,",
        "start": 656.9,
        "end": 659.9
    },
    {
        "text": " modelo de negocio, sí, vamos a ver bastante, la diferencia es que hasta lo que te has entendido en el Carare",
        "start": 659.9,
        "end": 666.9
    },
    {
        "text": " pueden plantear un proyecto de negocio bastante genérico,",
        "start": 666.9,
        "end": 670.9
    },
    {
        "text": " nosotros en el curso le vamos a pedir que las ideas de negocio sean de tecnologías exclusivamente,",
        "start": 670.9,
        "end": 676.9
    },
    {
        "text": " un fogo tecnológico.",
        "start": 676.9,
        "end": 679.9
    },
    {
        "text": " Y bueno, después también la Fundación Recaldónica,",
        "start": 679.9,
        "end": 681.9
    },
    {
        "text": " de hecho vamos a tener a un representante de la Fundación,",
        "start": 681.9,
        "end": 684.9
    },
    {
        "text": " también dándoles una charla sobre el ecosistema prendedor,",
        "start": 684.9,
        "end": 688.9
    },
    {
        "text": " más sobre el final del curso, tiene talleres de comunicación,",
        "start": 688.9,
        "end": 692.9
    },
    {
        "text": " pasiones efectivas, o de negocio, tienen quitar herramientas,",
        "start": 692.9,
        "end": 696.9
    },
    {
        "text": " después seguramente ellos le van a contar más, y bueno, la red emprendedor,",
        "start": 696.9,
        "end": 699.9
    },
    {
        "text": " que también es de la udelar sobre apoyo al ecosistema prendedor.",
        "start": 699.9,
        "end": 705.9
    },
    {
        "text": " Y bueno, me pregüera emprendedor también, que de hecho sacamos, sacamos de ahí,",
        "start": 706.9,
        "end": 710.9
    },
    {
        "text": " no, venen algunos de los videos que pusimos como lectura previa.",
        "start": 710.9,
        "end": 714.9
    },
    {
        "text": " No, que no.",
        "start": 714.9,
        "end": 716.9
    },
    {
        "text": " Sí, tienen, también es un link esto, ¿sí?",
        "start": 716.9,
        "end": 719.9
    },
    {
        "text": " Es ahí, y un uro emprendedor.bubi o barracurso, pueden dar material interesante.",
        "start": 719.9,
        "end": 724.9
    },
    {
        "text": " A ver, nada de esto es obligatorio de mirar, es como otras puntas,",
        "start": 724.9,
        "end": 730.9
    },
    {
        "text": " temas relacionados, que después a quien le cuelgue estos temas,",
        "start": 731.9,
        "end": 735.9
    },
    {
        "text": " puede ir chumiendo.",
        "start": 735.9,
        "end": 736.9
    },
    {
        "text": " Y acá estaba la biografía, y este es el primer libro que les comentaba",
        "start": 736.9,
        "end": 743.9
    },
    {
        "text": " de Business of Software, de Microcluso Mano.",
        "start": 743.9,
        "end": 746.9
    },
    {
        "text": " Y ahora que acá, o sea, estos libros, estos cinco, seis,",
        "start": 746.9,
        "end": 754.9
    },
    {
        "text": " estos seis, pero sobre todo, estos cinco, realmente son muy conocidos",
        "start": 754.9,
        "end": 759.9
    },
    {
        "text": " y son como, si se quiere como cultura general de la temática esta que vamos a ver el negocio del software.",
        "start": 759.9,
        "end": 766.9
    },
    {
        "text": " Entonces, o a ver, obviamente que no es necesario ni conseguirlo, ni adquirirlos,",
        "start": 766.9,
        "end": 773.9
    },
    {
        "text": " no es obligación leerlo, ni mucho menos.",
        "start": 773.9,
        "end": 775.9
    },
    {
        "text": " De hecho, en la parte de materiales, en algunos casos tenemos algunas resúmenes",
        "start": 775.9,
        "end": 780.9
    },
    {
        "text": " que son por supuesto públicos, sino que no tienen derecho a autor, que se pueden poner.",
        "start": 780.9,
        "end": 784.9
    },
    {
        "text": " Pero realmente, a quien le interese, de verdad, esta temática,",
        "start": 785.9,
        "end": 789.9
    },
    {
        "text": " cualquiera de esos cinco libros, es una inversión tremenda para hacer.",
        "start": 789.9,
        "end": 794.9
    },
    {
        "text": " Para tanto sea para conseguir, para comprarlo, como para leer.",
        "start": 794.9,
        "end": 798.9
    },
    {
        "text": " Y bueno, después en la media que vamos viendo cada uno de los temas,",
        "start": 799.9,
        "end": 802.9
    },
    {
        "text": " les podemos ir diciendo más de qué trata cada uno de los libros,",
        "start": 802.9,
        "end": 805.9
    },
    {
        "text": " no quiero ahora como perder tiempo en eso.",
        "start": 805.9,
        "end": 808.9
    },
    {
        "text": " Y también, no sé, se animen si ven que algunos parecen medio viejos,",
        "start": 808.9,
        "end": 812.9
    },
    {
        "text": " y ahí también les recuerdo que tal vez viene la con masa acostumbrados,",
        "start": 813.9,
        "end": 816.9
    },
    {
        "text": " a decir, no sé, quiero estudiar sobre la nueva versión de Ruby o de React o de El Estadmin o lo que sea.",
        "start": 816.9,
        "end": 825.9
    },
    {
        "text": " Entonces, bueno, en ese contexto de estudiar tecnología moderna,",
        "start": 825.9,
        "end": 828.9
    },
    {
        "text": " o sea, del último arquitectura de Machine Learning.",
        "start": 828.9,
        "end": 831.9
    },
    {
        "text": " Bueno, si le des algo del 2010, seguramente esté deshielo en el horno, no es nuestro caso.",
        "start": 831.9,
        "end": 835.9
    },
    {
        "text": " Y menos para este tipo de curso, en realidad es un curso de lo que se llama One or One.",
        "start": 835.9,
        "end": 839.9
    },
    {
        "text": " No sé, un curso introductorio a la temática del negocio de software.",
        "start": 840.9,
        "end": 844.9
    },
    {
        "text": " Entonces, esos libros, por más que algunos, puede aparecer un poquito viejo.",
        "start": 844.9,
        "end": 848.9
    },
    {
        "text": " En realidad, son como de fundamento sobre la industria del software,",
        "start": 848.9,
        "end": 852.9
    },
    {
        "text": " la industria de la tecnología y sobre la estrategia de negocios.",
        "start": 852.9,
        "end": 855.9
    },
    {
        "text": " Entonces, crean que, por más que para algunos parezca viejito, aporta mucho.",
        "start": 855.9,
        "end": 862.9
    },
    {
        "text": " Y bueno, acá un par de links también, bueno, sobre todo, este link,",
        "start": 863.9,
        "end": 868.9
    },
    {
        "text": " que también más adelante vamos a hablar un poquito, que también es este tampoco viejo,",
        "start": 868.9,
        "end": 872.9
    },
    {
        "text": " pero es una informa para Google 21 que ya les, les hablaré un poco más.",
        "start": 872.9,
        "end": 877.9
    },
    {
        "text": " Bueno, de esta slide, ya está, hay una pregunta mientras pasó.",
        "start": 880.9,
        "end": 886.9
    },
    {
        "text": " Ahí se ve bien.",
        "start": 893.9,
        "end": 895.9
    },
    {
        "text": " Sí.",
        "start": 898.9,
        "end": 899.9
    },
    {
        "text": " Sí.",
        "start": 899.9,
        "end": 900.9
    },
    {
        "text": " Ahí.",
        "start": 900.9,
        "end": 901.9
    },
    {
        "text": " Ahí.",
        "start": 901.9,
        "end": 902.9
    },
    {
        "text": " Ahí.",
        "start": 902.9,
        "end": 903.9
    },
    {
        "text": " Bien.",
        "start": 903.9,
        "end": 904.9
    },
    {
        "text": " Bueno.",
        "start": 904.9,
        "end": 905.9
    },
    {
        "text": " Si tienen preguntas con la pregunta.",
        "start": 905.9,
        "end": 907.9
    },
    {
        "text": " Yo tengo una pregunta así.",
        "start": 907.9,
        "end": 908.9
    },
    {
        "text": " Es de sobre las ideas para los para los negocios.",
        "start": 908.9,
        "end": 911.9
    },
    {
        "text": " Sí.",
        "start": 911.9,
        "end": 912.9
    },
    {
        "text": " Por lo que digiste que nos vas a pedir que se atendrá lógico,",
        "start": 912.9,
        "end": 917.9
    },
    {
        "text": " la idea, y quería saber si cuenta, porque por ejemplo,",
        "start": 917.9,
        "end": 920.9
    },
    {
        "text": " no sé, Amazon que tiene obviamente un gran componente tecnológico,",
        "start": 920.9,
        "end": 926.9
    },
    {
        "text": " al fin de cuentas es una empresa de vender cosas.",
        "start": 926.9,
        "end": 929.9
    },
    {
        "text": " Eso igual cuenta como una empresa de tecnología, así.",
        "start": 929.9,
        "end": 931.9
    },
    {
        "text": " Sí, bueno.",
        "start": 931.9,
        "end": 932.9
    },
    {
        "text": " Sí.",
        "start": 932.9,
        "end": 933.9
    },
    {
        "text": " Sí, bien.",
        "start": 933.9,
        "end": 934.9
    },
    {
        "text": " Sí, porque sí, sí, o sea, que sean lo que se llama de base tecnológica.",
        "start": 934.9,
        "end": 940.9
    },
    {
        "text": " O sea, que tal vez se mete en la gente,",
        "start": 940.9,
        "end": 943.9
    },
    {
        "text": " o toca de costada de alguna otra industria,",
        "start": 943.9,
        "end": 946.9
    },
    {
        "text": " pero la base de ese negocio es tecnológica.",
        "start": 946.9,
        "end": 949.9
    },
    {
        "text": " O sea, Amazon sin su sitio no existe.",
        "start": 949.9,
        "end": 951.9
    },
    {
        "text": " Uber, sin la aplicación no existe.",
        "start": 951.9,
        "end": 953.9
    },
    {
        "text": " El bien vi tampoco y etcétera.",
        "start": 953.9,
        "end": 955.9
    },
    {
        "text": " Está bien.",
        "start": 955.9,
        "end": 957.9
    },
    {
        "text": " Bueno, gracias.",
        "start": 957.9,
        "end": 958.9
    },
    {
        "text": " Aquí.",
        "start": 958.9,
        "end": 959.9
    },
    {
        "text": " Bueno, seguimos y pueden ir tirando también preguntas en él,",
        "start": 961.9,
        "end": 966.9
    },
    {
        "text": " en el chat si quieren.",
        "start": 966.9,
        "end": 967.9
    },
    {
        "text": " Bueno, vamos a ver si hay un nuevo tema.",
        "start": 967.9,
        "end": 970.9
    },
    {
        "text": " Bueno, esta es la primera bolilla,",
        "start": 971.9,
        "end": 974.9
    },
    {
        "text": " la primera tema del curso.",
        "start": 974.9,
        "end": 976.9
    },
    {
        "text": " Bueno, obviamente para hoy no había lectura previa,",
        "start": 976.9,
        "end": 981.9
    },
    {
        "text": " más que repasable el programa del curso,",
        "start": 981.9,
        "end": 983.9
    },
    {
        "text": " pero para la próxima clase, sí,",
        "start": 983.9,
        "end": 986.9
    },
    {
        "text": " en la lectura previa, que ya está colgada.",
        "start": 986.9,
        "end": 988.9
    },
    {
        "text": " Y tiene un poquito que va a haber también con estrategias",
        "start": 988.9,
        "end": 991.9
    },
    {
        "text": " y con visión de alto nivel de la industria de las tecnologías.",
        "start": 991.9,
        "end": 995.9
    },
    {
        "text": " En este módulo, como dice ahí,",
        "start": 995.9,
        "end": 997.9
    },
    {
        "text": " vamos a mostrar diferentes estrategias.",
        "start": 997.9,
        "end": 999.9
    },
    {
        "text": " Que las empresas de software, ese WL lo acotamos,",
        "start": 999.9,
        "end": 1003.9
    },
    {
        "text": " pueden adoptar estrategias en términos de productos y servicios.",
        "start": 1003.9,
        "end": 1007.9
    },
    {
        "text": " Estategias en términos de los mercados,",
        "start": 1007.9,
        "end": 1009.9
    },
    {
        "text": " a las cuales apuntan y de el posicionamiento",
        "start": 1009.9,
        "end": 1013.9
    },
    {
        "text": " que pueden lograr en esos mercados.",
        "start": 1013.9,
        "end": 1015.9
    },
    {
        "text": " Y en realidad, la estrategia que la empresa de software,",
        "start": 1017.9,
        "end": 1020.9
    },
    {
        "text": " la empresa de tecnología, el hija,",
        "start": 1020.9,
        "end": 1022.9
    },
    {
        "text": " en cuanto así es una empresa de producto en tal mercado",
        "start": 1022.9,
        "end": 1025.9
    },
    {
        "text": " o de servicio que busca tal posicionamiento",
        "start": 1025.9,
        "end": 1028.9
    },
    {
        "text": " o combinaciones de esas.",
        "start": 1028.9,
        "end": 1030.9
    },
    {
        "text": " Lo que lija esa combinación de estrategias,",
        "start": 1032.9,
        "end": 1034.9
    },
    {
        "text": " va a impactar mucho en qué es lo que termina siendo esa empresa,",
        "start": 1034.9,
        "end": 1039.9
    },
    {
        "text": " cómo lo hace y para quién lo hace.",
        "start": 1039.9,
        "end": 1042.9
    },
    {
        "text": " Lo que vamos a hablar acá es bien de la parte de estrategias.",
        "start": 1042.9,
        "end": 1046.9
    },
    {
        "text": " Una cosa que no comenté al principio,",
        "start": 1046.9,
        "end": 1049.9
    },
    {
        "text": " me acordé con alberes de paréntesis,",
        "start": 1049.9,
        "end": 1051.9
    },
    {
        "text": " es probable que use por un lado",
        "start": 1051.9,
        "end": 1056.9
    },
    {
        "text": " acrónimos o abreviaciones o siglas",
        "start": 1056.9,
        "end": 1061.9
    },
    {
        "text": " que capaz que no tienen por qué conocerlas.",
        "start": 1061.9,
        "end": 1064.9
    },
    {
        "text": " O sea que levanta la mano y pregunta o los escriben el chat.",
        "start": 1064.9,
        "end": 1068.9
    },
    {
        "text": " De hecho, IT, que es tecnología de la información IT o TI,",
        "start": 1070.9,
        "end": 1074.9
    },
    {
        "text": " si es en español o en inglés,",
        "start": 1074.9,
        "end": 1076.9
    },
    {
        "text": " capaz que a varios ustedes es la primera vez que lo escuchan como tal",
        "start": 1076.9,
        "end": 1080.9
    },
    {
        "text": " y lo van a haber acá repetido 20 millones de veces.",
        "start": 1080.9,
        "end": 1084.9
    },
    {
        "text": " Lo mismo que los términos en inglés.",
        "start": 1084.9,
        "end": 1087.9
    },
    {
        "text": " A propósito tomamos la decisión en el aceto en el error",
        "start": 1087.9,
        "end": 1091.9
    },
    {
        "text": " de no traducir los términos en inglés.",
        "start": 1091.9,
        "end": 1094.9
    },
    {
        "text": " Por el simple hecho de que cuando ustedes laburan",
        "start": 1094.9,
        "end": 1098.9
    },
    {
        "text": " y empiezan a moverse en este tipo de industria a nuestro criterio",
        "start": 1098.9,
        "end": 1102.9
    },
    {
        "text": " van a haber los términos en inglés,",
        "start": 1102.9,
        "end": 1104.9
    },
    {
        "text": " 99,99% de las veces.",
        "start": 1104.9,
        "end": 1107.9
    },
    {
        "text": " Entonces traducirlo nos parecía",
        "start": 1107.9,
        "end": 1111.9
    },
    {
        "text": " que no no hacía o no ahora lo que ustedes van a ver en la calle.",
        "start": 1112.9,
        "end": 1116.9
    },
    {
        "text": " Allá fuera.",
        "start": 1116.9,
        "end": 1118.9
    },
    {
        "text": " Pero también capaz que diga un término,",
        "start": 1118.9,
        "end": 1121.9
    },
    {
        "text": " lo digo rápido o lo que sea y no se entendió o no le expliqué o no lo definí antes.",
        "start": 1121.9,
        "end": 1127.9
    },
    {
        "text": " Entonces no tienen por qué saberlo.",
        "start": 1127.9,
        "end": 1129.9
    },
    {
        "text": " Así que simplemente pregúnten.",
        "start": 1129.9,
        "end": 1131.9
    },
    {
        "text": " Así como a veces tal vez cuando diga un ejemplo o hay una anedo o alguna bajada tierra de un tema,",
        "start": 1131.9,
        "end": 1138.9
    },
    {
        "text": " tal vez digo algo como al pasar y me olvidé que capaz que ese tema está más adelante",
        "start": 1138.9,
        "end": 1144.9
    },
    {
        "text": " o no fue definido y bueno, como no sumimos que ustedes saben de esto,",
        "start": 1144.9,
        "end": 1149.9
    },
    {
        "text": " de vuelta, levanta la mano y preguntan.",
        "start": 1149.9,
        "end": 1153.9
    },
    {
        "text": " No hay preguntas tontas literalmente.",
        "start": 1156.9,
        "end": 1159.9
    },
    {
        "text": " Bueno,",
        "start": 1161.9,
        "end": 1162.9
    },
    {
        "text": " el impacto de la tecnología de la información,",
        "start": 1163.9,
        "end": 1166.9
    },
    {
        "text": " o sea, de la siquiera de las tics,",
        "start": 1166.9,
        "end": 1169.9
    },
    {
        "text": " cuando se agrega la C,",
        "start": 1169.9,
        "end": 1171.9
    },
    {
        "text": " porque se agrega las comunicaciones también,",
        "start": 1171.9,
        "end": 1174.9
    },
    {
        "text": " tecnología de la información y las comunicaciones.",
        "start": 1174.9,
        "end": 1176.9
    },
    {
        "text": " El impacto de las tics es muy penetrante,",
        "start": 1176.9,
        "end": 1183.9
    },
    {
        "text": " no me sale pervasive en inglés,",
        "start": 1183.9,
        "end": 1185.9
    },
    {
        "text": " o sea, están en todo el lado,",
        "start": 1185.9,
        "end": 1187.9
    },
    {
        "text": " las tics o las tecnologías están en todo el lado.",
        "start": 1187.9,
        "end": 1189.9
    },
    {
        "text": " Y como todo, también hay varios libros de esto,",
        "start": 1190.9,
        "end": 1195.9
    },
    {
        "text": " y varias corrientes,",
        "start": 1195.9,
        "end": 1197.9
    },
    {
        "text": " quienes dicen que son el futuro,",
        "start": 1197.9,
        "end": 1201.9
    },
    {
        "text": " y es lo mejor que le haya recudido para pasar a la humanidad,",
        "start": 1201.9,
        "end": 1205.9
    },
    {
        "text": " mientras más detractores que dicen que bueno que en realidad no es un fin por sí mismo,",
        "start": 1205.9,
        "end": 1210.9
    },
    {
        "text": " que hay que usarla con cuidado,",
        "start": 1210.9,
        "end": 1212.9
    },
    {
        "text": " este que pueden ser no sigbas negativas, etcétera.",
        "start": 1212.9,
        "end": 1215.9
    },
    {
        "text": " Pero como sea, creo que es a esta altura casi acciónmático,",
        "start": 1216.9,
        "end": 1221.9
    },
    {
        "text": " decir que la tecnología de la información tiene una influencia enorme",
        "start": 1221.9,
        "end": 1227.9
    },
    {
        "text": " en todas nuestras vidas,",
        "start": 1227.9,
        "end": 1229.9
    },
    {
        "text": " incluyendo por supuesto en los negocios.",
        "start": 1229.9,
        "end": 1232.9
    },
    {
        "text": " O sea que la motivación de por qué hablar de la industria,",
        "start": 1233.9,
        "end": 1237.9
    },
    {
        "text": " de software y del negocio que hay por detrás del software,",
        "start": 1237.9,
        "end": 1241.9
    },
    {
        "text": " considerando ubicuo,",
        "start": 1241.9,
        "end": 1246.9
    },
    {
        "text": " que es el tema de la tecnología,",
        "start": 1246.9,
        "end": 1248.9
    },
    {
        "text": " o sea que están absolutamente en todos los ámbitos y estrasversal a todo.",
        "start": 1248.9,
        "end": 1252.9
    },
    {
        "text": " Es casi autobesplicativo.",
        "start": 1252.9,
        "end": 1255.9
    },
    {
        "text": " Acá pusimos también,",
        "start": 1256.9,
        "end": 1258.9
    },
    {
        "text": " y después lo pueden ver con más detenimiento,",
        "start": 1258.9,
        "end": 1261.9
    },
    {
        "text": " hay algunas citas,",
        "start": 1261.9,
        "end": 1263.9
    },
    {
        "text": " y también está bueno para que se vayan foviando con algunos conceptos.",
        "start": 1263.9,
        "end": 1268.9
    },
    {
        "text": " Y DC es una consultora,",
        "start": 1268.9,
        "end": 1270.9
    },
    {
        "text": " garner, o sea, en realidad las tres consultoras más grandes y conocidas",
        "start": 1270.9,
        "end": 1273.9
    },
    {
        "text": " que hablan de tecnología,",
        "start": 1273.9,
        "end": 1275.9
    },
    {
        "text": " son garner y DC y Forester,",
        "start": 1275.9,
        "end": 1278.9
    },
    {
        "text": " garner, con T, Y DC y Forester.",
        "start": 1278.9,
        "end": 1282.9
    },
    {
        "text": " Y este tipo de consultoras son consultoras globales,",
        "start": 1282.9,
        "end": 1285.9
    },
    {
        "text": " son empresas de consultorías,",
        "start": 1285.9,
        "end": 1287.9
    },
    {
        "text": " no es que se han empezado de tecnología,",
        "start": 1287.9,
        "end": 1289.9
    },
    {
        "text": " no producen producto de software ni venden servicios ni desarrollo a medida.",
        "start": 1289.9,
        "end": 1295.9
    },
    {
        "text": " Lo que hacen es tienen decenas o cientos, o en el caso de garner,",
        "start": 1295.9,
        "end": 1298.9
    },
    {
        "text": " son miles de consultores especialistas de diferentes áreas",
        "start": 1298.9,
        "end": 1302.9
    },
    {
        "text": " y hacen estudios, hacen research,",
        "start": 1302.9,
        "end": 1305.9
    },
    {
        "text": " investigación sobre montones de áreas y sacan artículos y tapers",
        "start": 1305.9,
        "end": 1309.9
    },
    {
        "text": " que en general se cobran con información súper rica sobre ese sector o esa tecnología",
        "start": 1309.9,
        "end": 1316.9
    },
    {
        "text": " que están realizando.",
        "start": 1316.9,
        "end": 1318.9
    },
    {
        "text": " Y bueno, y también muchas veces hacen esa futurología,",
        "start": 1318.9,
        "end": 1321.9
    },
    {
        "text": " en el estilo no se encuestan a 500 gerentes generales,",
        "start": 1321.9,
        "end": 1326.9
    },
    {
        "text": " 500 CEOs de empresas de tecnología de todo el mundo y muestran cuáles son los 10 temas más relevantes",
        "start": 1326.9,
        "end": 1332.9
    },
    {
        "text": " para los próximos tres años,",
        "start": 1332.9,
        "end": 1335.9
    },
    {
        "text": " por decirla.",
        "start": 1335.9,
        "end": 1337.9
    },
    {
        "text": " Y ya que empezamos a dar un poquito de negocios y de modelo de negocio,",
        "start": 1337.9,
        "end": 1342.9
    },
    {
        "text": " el modelo de negocio esas empresas consultoras globales,",
        "start": 1342.9,
        "end": 1346.9
    },
    {
        "text": " es que genera un material súper rico,",
        "start": 1346.9,
        "end": 1350.9
    },
    {
        "text": " obviamente que es imposible que nadie más haga,",
        "start": 1350.9,
        "end": 1353.9
    },
    {
        "text": " porque quien va a lograr la llegada,",
        "start": 1353.9,
        "end": 1356.9
    },
    {
        "text": " por ejemplo, a cientos de gerentes generales y que te respondan,",
        "start": 1356.9,
        "end": 1360.9
    },
    {
        "text": " una encuesta de 10, 15 o 20 minutos, solamente esta gente.",
        "start": 1360.9,
        "end": 1364.9
    },
    {
        "text": " Y lo que hacen es publicar y vender los artículos que hacen,",
        "start": 1364.9,
        "end": 1369.9
    },
    {
        "text": " o sea, como siempre te dan el abstract gratis y querés bajar el artículo,",
        "start": 1369.9,
        "end": 1374.9
    },
    {
        "text": " bueno, insert coin para eso.",
        "start": 1374.9,
        "end": 1376.9
    },
    {
        "text": " Y en algunos casos, por ejemplo, en los cuadrantes mágicos de garner,",
        "start": 1376.9,
        "end": 1381.9
    },
    {
        "text": " que después vamos a ver algunos y son súper conocidos,",
        "start": 1381.9,
        "end": 1384.9
    },
    {
        "text": " lo que hace garner con los cuadrantes mágicos es ubicar cada uno de los productores de cierta tecnología,",
        "start": 1384.9,
        "end": 1391.9
    },
    {
        "text": " no sé, por ejemplo, mobile,",
        "start": 1391.9,
        "end": 1393.9
    },
    {
        "text": " lo ponen un cuadrante y te ponen los líderes, los challengers,",
        "start": 1393.9,
        "end": 1398.9
    },
    {
        "text": " la capacidad de ejecución, la visión que tiene cada uno,",
        "start": 1398.9,
        "end": 1402.9
    },
    {
        "text": " los pros y contras de cada una de las plataformas,",
        "start": 1402.9,
        "end": 1405.9
    },
    {
        "text": " entonces dice, bueno, no sé, hola, con respecto a mobile,",
        "start": 1405.9,
        "end": 1408.9
    },
    {
        "text": " tiene esta ventaja, la ventaja, Microsoft, esta ventaja, Apple,",
        "start": 1408.9,
        "end": 1412.9
    },
    {
        "text": " esta ventaja y todo así.",
        "start": 1412.9,
        "end": 1414.9
    },
    {
        "text": " Y a veces lo que hacen también, esa empresa tecnología,",
        "start": 1414.9,
        "end": 1418.9
    },
    {
        "text": " es cuando aparecen dentro de los primeros top 3,",
        "start": 1418.9,
        "end": 1422.9
    },
    {
        "text": " le pagan a garner para que deje público,",
        "start": 1422.9,
        "end": 1424.9
    },
    {
        "text": " así todos pueden ver cuán crá son esa empresa de tecnología que queda ranteada,",
        "start": 1424.9,
        "end": 1430.9
    },
    {
        "text": " pero bueno, pero el modelo de negocio es eso, esta gente tiene cientos de consultores,",
        "start": 1430.9,
        "end": 1434.9
    },
    {
        "text": " para generar esta información valiosa y valiosa para tomar decisiones,",
        "start": 1434.9,
        "end": 1439.9
    },
    {
        "text": " que después alguien la paga de alguna forma.",
        "start": 1439.9,
        "end": 1442.9
    },
    {
        "text": " Y esto también me daré un poquito con esto,",
        "start": 1442.9,
        "end": 1445.9
    },
    {
        "text": " porque para el trabajo final de ustedes,",
        "start": 1445.9,
        "end": 1447.9
    },
    {
        "text": " probablemente les convengan algún punto,",
        "start": 1447.9,
        "end": 1450.9
    },
    {
        "text": " investigar a ver qué dice y desee sobre el problema que estén tratando ustedes,",
        "start": 1450.9,
        "end": 1456.9
    },
    {
        "text": " qué dice garner o qué dice fuera esto.",
        "start": 1456.9,
        "end": 1458.9
    },
    {
        "text": " Entonces, no sé, imagínense,",
        "start": 1458.9,
        "end": 1460.9
    },
    {
        "text": " van a solucionar un problema de seguridad de la última mayor por decir algo,",
        "start": 1461.9,
        "end": 1467.9
    },
    {
        "text": " como en parte de eso tiene una aplicación móvil y capaz que un smartwatch o algo del estilo.",
        "start": 1467.9,
        "end": 1473.9
    },
    {
        "text": " Y entonces, ustedes creen que los smartwatches y los dispositivos en general los wearables,",
        "start": 1473.9,
        "end": 1480.9
    },
    {
        "text": " van a explotar o están explotando cada vez más.",
        "start": 1480.9,
        "end": 1484.9
    },
    {
        "text": " Ok, pero si ustedes escriben a los dispositivos,",
        "start": 1484.9,
        "end": 1487.9
    },
    {
        "text": " este wearables,",
        "start": 1487.9,
        "end": 1489.9
    },
    {
        "text": " que no me significa que me dice como se dice,",
        "start": 1489.9,
        "end": 1491.9
    },
    {
        "text": " ¿cuál es el wearables?",
        "start": 1491.9,
        "end": 1492.9
    },
    {
        "text": " Esa que te lo pones, ¿no?",
        "start": 1492.9,
        "end": 1494.9
    },
    {
        "text": " ¿Qué te lo vestís?",
        "start": 1494.9,
        "end": 1495.9
    },
    {
        "text": " Los wearables están creciendo mucho y yo le digo eso y digo, ¿qué dice esto?",
        "start": 1495.9,
        "end": 1500.9
    },
    {
        "text": " Lo dice el grupo de estudiantes de favoridad, que está todo bien,",
        "start": 1500.9,
        "end": 1504.9
    },
    {
        "text": " pero en base a que a la cantidad de Apple Watches que se venden en el guay año a año,",
        "start": 1504.9,
        "end": 1509.9
    },
    {
        "text": " o sea, no existe.",
        "start": 1509.9,
        "end": 1510.9
    },
    {
        "text": " Entonces, me dicen, según Garner, en este informe,",
        "start": 1510.9,
        "end": 1513.9
    },
    {
        "text": " entonces, pegan el link del informe de Garner,",
        "start": 1513.9,
        "end": 1515.9
    },
    {
        "text": " Garner dice que el mercado de los smartwatches está creciendo en un factor por 5 años.",
        "start": 1515.9,
        "end": 1522.9
    },
    {
        "text": " Listo, no puedo ni abrir la boca.",
        "start": 1522.9,
        "end": 1525.9
    },
    {
        "text": " Entonces, le va a venir muy bien después investigar estas a estas consultores.",
        "start": 1525.9,
        "end": 1530.9
    },
    {
        "text": " Y bueno, acá también, incluso hablo un poquito más de América Latina,",
        "start": 1530.9,
        "end": 1534.9
    },
    {
        "text": " hablando también de la importancia,",
        "start": 1534.9,
        "end": 1536.9
    },
    {
        "text": " todavía mayor en el en contexto de pandemia y bueno,",
        "start": 1537.9,
        "end": 1541.9
    },
    {
        "text": " hay algunos datos de crecimiento.",
        "start": 1541.9,
        "end": 1544.9
    },
    {
        "text": " Ahora, acá aparece esta otra que le decía Garner,",
        "start": 1545.9,
        "end": 1548.9
    },
    {
        "text": " esta otra consultora que en realidad creo que es la más grande y la más conocida de las 3.",
        "start": 1548.9,
        "end": 1553.9
    },
    {
        "text": " La transición digital no está a la sujeta a la misma justificación de retorno",
        "start": 1553.9,
        "end": 1557.9
    },
    {
        "text": " de la inversión que había antes de la pandemia.",
        "start": 1557.9,
        "end": 1559.9
    },
    {
        "text": " En la idea de retorno de Roy, que es Twitter and the investment,",
        "start": 1559.9,
        "end": 1562.9
    },
    {
        "text": " esto de retorno de la inversión,",
        "start": 1562.9,
        "end": 1564.9
    },
    {
        "text": " lo vamos a ver también un poquito más adelante.",
        "start": 1564.9,
        "end": 1566.9
    },
    {
        "text": " El retorno de la inversión es yo gasto en tecnología,",
        "start": 1566.9,
        "end": 1569.9
    },
    {
        "text": " bueno, gasto invierto como quieran valor,",
        "start": 1569.9,
        "end": 1571.9
    },
    {
        "text": " pero en algún momento tengo que tener un retorno sobre ese gasto, sobre esa inversión.",
        "start": 1571.9,
        "end": 1576.9
    },
    {
        "text": " Que eso lo que llama el Roy, R o I return on investment.",
        "start": 1576.9,
        "end": 1580.9
    },
    {
        "text": " Entonces, no se imagine, si hay una empresa compra un soframevidad.",
        "start": 1580.9,
        "end": 1584.9
    },
    {
        "text": " Se va a gastar tranquilamente 50 mil dólares, 80 mil dólares, 100 mil dólares o más.",
        "start": 1584.9,
        "end": 1590.9
    },
    {
        "text": " Ninguna empresa va a gastar eso porque le cope estar en el último grito tecnológico imposible,",
        "start": 1591.9,
        "end": 1597.9
    },
    {
        "text": " mentira, va a pagar eso porque lo va a recuperar de alguna forma en una ex cantidad de años,",
        "start": 1597.9,
        "end": 1603.9
    },
    {
        "text": " mejorando a algunos ciertos indicadores de ese negocio o de esa organización.",
        "start": 1603.9,
        "end": 1608.9
    },
    {
        "text": " Capas que esas 80 mil dólares de desarrollo medida,",
        "start": 1608.9,
        "end": 1613.9
    },
    {
        "text": " le permitió gestionar mucho mejor los costos de su fábrica y de su cadena logística y de su mostrador de venta,",
        "start": 1613.9,
        "end": 1623.9
    },
    {
        "text": " lo que sea, pero si siempre hay algún tipo de retorno en la inversión,",
        "start": 1623.9,
        "end": 1628.9
    },
    {
        "text": " aunque sea un poco más subjetivo o de posicionamiento de marca,",
        "start": 1628.9,
        "end": 1632.9
    },
    {
        "text": " o sea, las empresas no gastan decenas de mil dólares en software por el software en sí.",
        "start": 1632.9,
        "end": 1639.9
    },
    {
        "text": " Lo mismo que ustedes como consumidores, si te muestras un jueguito,",
        "start": 1640.9,
        "end": 1644.9
    },
    {
        "text": " tu retorno del dólar o los dos dólares o si fuiste generoso de los 10 dólares que pagaste por ese jueguito,",
        "start": 1644.9,
        "end": 1651.9
    },
    {
        "text": " tu retorno por lo menos es divertirte.",
        "start": 1651.9,
        "end": 1653.9
    },
    {
        "text": " No es que no es que vas a hacer plata con eso o vas a ahorrarte nada,",
        "start": 1653.9,
        "end": 1657.9
    },
    {
        "text": " pero por lo menos me quiere divertir y ahí está tu retorno en esa inversión.",
        "start": 1657.9,
        "end": 1661.9
    },
    {
        "text": " Y ahora la tix se consideran como la herramienta para que el negocio sobreviviosa.",
        "start": 1661.9,
        "end": 1668.9
    },
    {
        "text": " Según lo que dice Garner, a tal vez hace algunos años,",
        "start": 1669.9,
        "end": 1672.9
    },
    {
        "text": " se pensaba, bueno, mi negocio puede ser independiente de la tecnología,",
        "start": 1672.9,
        "end": 1677.9
    },
    {
        "text": " no los negocios de base tecnológica, no puede ser independiente de la tecnología.",
        "start": 1677.9,
        "end": 1681.9
    },
    {
        "text": " Pero un negocio más tradicional, tal vez, bueno, uso tecnología como un plus,",
        "start": 1681.9,
        "end": 1685.9
    },
    {
        "text": " una ventaja y veo con que como retornas en inversión, etcétera.",
        "start": 1685.9,
        "end": 1690.9
    },
    {
        "text": " Bueno, lo que dice Garner es que cada vez más el uso y la inversión en tecnología",
        "start": 1690.9,
        "end": 1695.9
    },
    {
        "text": " en cualquier tipo de negocio es casi para la sobrevivencia de ese negocio.",
        "start": 1695.9,
        "end": 1700.9
    },
    {
        "text": " Y ahí también vemos más evidencia de que es transversal a todo la tecnología.",
        "start": 1700.9,
        "end": 1705.9
    },
    {
        "text": " Si, está bien, me dicen que un juego de verdad vale 60 dólares, es cierto.",
        "start": 1710.9,
        "end": 1715.9
    },
    {
        "text": " Yo creo que más hablaba del de los que viste esos de un par de dólares en la SAPS.",
        "start": 1715.9,
        "end": 1719.9
    },
    {
        "text": " Bueno, acá también tienen algunas otras tendencias según Garner.",
        "start": 1720.9,
        "end": 1727.9
    },
    {
        "text": " Y que es el software más para lo que respecta a este curso, ¿no?",
        "start": 1728.9,
        "end": 1734.9
    },
    {
        "text": " Nosotros. Bueno, vamos a ir tirando como keywords.",
        "start": 1734.9,
        "end": 1739.9
    },
    {
        "text": " Primero, el software es un intangible.",
        "start": 1739.9,
        "end": 1742.9
    },
    {
        "text": " O sea, el software obviamente, por definición, o sea, no es algo palpable.",
        "start": 1742.9,
        "end": 1747.9
    },
    {
        "text": " Usted no lo puede en este percibir tal cual no no pueden tocar.",
        "start": 1748.9,
        "end": 1752.9
    },
    {
        "text": " O sea, que es un intangible y de hecho, como dice ahí también, según la economía tradicional,",
        "start": 1752.9,
        "end": 1758.9
    },
    {
        "text": " o sea, según las ciencias económicas, digamos, la industria de software,",
        "start": 1758.9,
        "end": 1762.9
    },
    {
        "text": " pertenece a la rama de servicios, a la industria de servicios.",
        "start": 1762.9,
        "end": 1767.9
    },
    {
        "text": " Y ahí también, y lo he hablado con algún economista de esto,",
        "start": 1767.9,
        "end": 1771.9
    },
    {
        "text": " nosotros desde la tecnología, cuando decimos servicios, y lo van a haber mucho a esto,",
        "start": 1772.9,
        "end": 1778.9
    },
    {
        "text": " yo voy a hablar de esto de servicio de ITG hasta en la SAP, o no, hay tres clases dedicadas a servicio de ITG,",
        "start": 1778.9,
        "end": 1784.9
    },
    {
        "text": " a venta servicio, pero cuando en tecnología hablamos de servicio,",
        "start": 1784.9,
        "end": 1787.9
    },
    {
        "text": " a realidad, nos referimos a vender un servicio, ¿no?",
        "start": 1787.9,
        "end": 1790.9
    },
    {
        "text": " Por ejemplo, el desarrollo de software a medida es un servicio.",
        "start": 1790.9,
        "end": 1793.9
    },
    {
        "text": " La consultoria es un servicio, un soporte, es un servicio, un mantenimiento,",
        "start": 1793.9,
        "end": 1798.9
    },
    {
        "text": " es un servicio, una capacitación, es un servicio.",
        "start": 1798.9,
        "end": 1801.9
    },
    {
        "text": " Y después hablamos de producto de software, el producto de software,",
        "start": 1801.9,
        "end": 1806.9
    },
    {
        "text": " que también la vamos a ver bastante, un producto software,",
        "start": 1806.9,
        "end": 1809.9
    },
    {
        "text": " es algo que ya está desarrollado, me lo bajo, lo pruebo, si tiene trae al premium o lo que sea,",
        "start": 1809.9,
        "end": 1815.9
    },
    {
        "text": " y después lo compro, no lo compro.",
        "start": 1815.9,
        "end": 1817.9
    },
    {
        "text": " Aprese algo ya está desarrollado, y eso lo decimos un producto de software.",
        "start": 1817.9,
        "end": 1820.9
    },
    {
        "text": " Bueno, realidad, para la economía tradicional y general,",
        "start": 1820.9,
        "end": 1824.9
    },
    {
        "text": " todo eso son servicios, ¿no?",
        "start": 1824.9,
        "end": 1827.9
    },
    {
        "text": " Y es parte de los intangibles, y bueno, y obviamente,",
        "start": 1827.9,
        "end": 1831.9
    },
    {
        "text": " es algo que cada vez más complejo valioso por la introducción que dábamos recién.",
        "start": 1831.9,
        "end": 1836.9
    },
    {
        "text": " Y también me interesa ir metiendo este concepto, ¿no?",
        "start": 1837.9,
        "end": 1842.9
    },
    {
        "text": " Que el software termina siendo una promesa,",
        "start": 1842.9,
        "end": 1846.9
    },
    {
        "text": " y particularmente en los servicios, ¿no?",
        "start": 1846.9,
        "end": 1850.9
    },
    {
        "text": " O sea, cuando vendemos servicios, imagínense esto,",
        "start": 1850.9,
        "end": 1854.9
    },
    {
        "text": " cuando ustedes venden un servicio de desarrollo a medida, por ejemplo,",
        "start": 1854.9,
        "end": 1857.9
    },
    {
        "text": " están empezando a cobrar la cliente mes a mes o sprint o intoporito,",
        "start": 1857.9,
        "end": 1863.9
    },
    {
        "text": " lo que sea, pero le están diciendo básicamente,",
        "start": 1863.9,
        "end": 1866.9
    },
    {
        "text": " empezar a pagarme, que te juro que dentro de seis meses,",
        "start": 1866.9,
        "end": 1870.9
    },
    {
        "text": " voy a tener el software que vos te imaginás,",
        "start": 1870.9,
        "end": 1873.9
    },
    {
        "text": " que a más no va a ser así, ¿no?",
        "start": 1873.9,
        "end": 1875.9
    },
    {
        "text": " Porque nunca sabamos exactamente qué se imagina, nunca están los requerimientos bien hechos,",
        "start": 1875.9,
        "end": 1878.9
    },
    {
        "text": " y ahí seguramente de la mitad de los que trabajan en esto,",
        "start": 1878.9,
        "end": 1881.9
    },
    {
        "text": " ya pueden irse, son reyendo, porque saben qué es así,",
        "start": 1881.9,
        "end": 1884.9
    },
    {
        "text": " pero se basa muchísimo en la capacidad que tengamos de capturar esa promesa,",
        "start": 1884.9,
        "end": 1891.9
    },
    {
        "text": " que es lo que hace la venta, y después, obviamente, de entregar esa promesa,",
        "start": 1891.9,
        "end": 1895.9
    },
    {
        "text": " que es lo que hace el área de operaciones, el delivery,",
        "start": 1895.9,
        "end": 1898.9
    },
    {
        "text": " y en definitiva, de desarrolladores, con muchos de ustedes.",
        "start": 1898.9,
        "end": 1901.9
    },
    {
        "text": " Pero en definitiva, mucho del software también ha sido una promesa.",
        "start": 1901.9,
        "end": 1904.9
    },
    {
        "text": " Por eso también va a importar mucho la credibilidad de la empresa de tecnología,",
        "start": 1905.9,
        "end": 1910.9
    },
    {
        "text": " para ver si va a cumplir con esa promesa o no va a cumplir con esa promesa.",
        "start": 1910.9,
        "end": 1914.9
    },
    {
        "text": " Y bueno, ¿qué es lo que hace el software?",
        "start": 1916.9,
        "end": 1918.9
    },
    {
        "text": " Y bueno, el software solamente gestiona información.",
        "start": 1918.9,
        "end": 1922.9
    },
    {
        "text": " Sí, bueno, obviamente ha aplicado con algo más de IoT,",
        "start": 1922.9,
        "end": 1925.9
    },
    {
        "text": " no? Internet de las cosas, o algo de robótica,",
        "start": 1925.9,
        "end": 1928.9
    },
    {
        "text": " bueno, hay capaz que acciona o actúa y mueve algo,",
        "start": 1928.9,
        "end": 1932.9
    },
    {
        "text": " pero en general, lo que hace el software puramente es gestionar información,",
        "start": 1932.9,
        "end": 1937.9
    },
    {
        "text": " o sea, son bits, yendo un lado para el otro.",
        "start": 1937.9,
        "end": 1939.9
    },
    {
        "text": " Ahora, eso es simplemente gestionar información,",
        "start": 1941.9,
        "end": 1944.9
    },
    {
        "text": " y no, no es simplemente eso, y por eso pagan $50, $80, $100,000 o más,",
        "start": 1944.9,
        "end": 1949.9
    },
    {
        "text": " porque estamos en la era de la información, o sea que la información",
        "start": 1949.9,
        "end": 1953.9
    },
    {
        "text": " y cómo se gestiona, cómo se accede, cómo se muestra el tiempo en la cual se procesa,",
        "start": 1953.9,
        "end": 1958.9
    },
    {
        "text": " cómo se minan esos datos, etcétera, cómo se aprovecha,",
        "start": 1959.9,
        "end": 1963.9
    },
    {
        "text": " cómo se aceléberas de todo eso, es súper importante.",
        "start": 1963.9,
        "end": 1966.9
    },
    {
        "text": " Entonces, sí, el software solo gestiona información,",
        "start": 1966.9,
        "end": 1970.9
    },
    {
        "text": " pero nada menos tampoco.",
        "start": 1970.9,
        "end": 1972.9
    },
    {
        "text": " Y bueno, esto también un poco lo poníamos diciendo,",
        "start": 1974.9,
        "end": 1976.9
    },
    {
        "text": " o sea, la medida que la tecnología es transversal y ubicua que está en todo el lado,",
        "start": 1976.9,
        "end": 1981.9
    },
    {
        "text": " bueno, se va integrando a los procesos de la empresa.",
        "start": 1981.9,
        "end": 1984.9
    },
    {
        "text": " O sea, ¿qué significa que una empresa se vaya digitalizando o informatizando?",
        "start": 1985.9,
        "end": 1990.9
    },
    {
        "text": " Quiere decir que los procesos pasan de ser del mundo físico, real o analógico,",
        "start": 1990.9,
        "end": 1997.9
    },
    {
        "text": " al mundo digital.",
        "start": 1997.9,
        "end": 1998.9
    },
    {
        "text": " O sea, que vamos metiendo tecnología en los diferentes procesos de la empresa,",
        "start": 1999.9,
        "end": 2004.9
    },
    {
        "text": " aún cuando la empresa no sea una empresa tecnología.",
        "start": 2004.9,
        "end": 2007.9
    },
    {
        "text": " Y bueno, y acá también, dentro de muy poquito, vamos a empezar a hablar de los clientes,",
        "start": 2008.9,
        "end": 2013.9
    },
    {
        "text": " de la necesidad de los clientes, de los problemas, de los clientes,",
        "start": 2013.9,
        "end": 2017.9
    },
    {
        "text": " o de los pains, o sea, de los dolores, de los clientes.",
        "start": 2017.9,
        "end": 2022.9
    },
    {
        "text": " Vamos a hablar también bastante de eso.",
        "start": 2022.9,
        "end": 2024.9
    },
    {
        "text": " Y de qué valor la aporta nuestro software a ese cliente.",
        "start": 2024.9,
        "end": 2027.9
    },
    {
        "text": " Bueno, hay una pregunta hasta acá.",
        "start": 2032.9,
        "end": 2035.9
    },
    {
        "text": " En chat, tú ha hablado, comentario.",
        "start": 2035.9,
        "end": 2037.9
    },
    {
        "text": " Yo tengo una pregunta.",
        "start": 2037.9,
        "end": 2043.9
    },
    {
        "text": " Lo que hablaba sobre todo de los software a medida,",
        "start": 2043.9,
        "end": 2049.9
    },
    {
        "text": " porque cada vez hay más soluciones genéricas que se pueden configurar cada vez más,",
        "start": 2049.9,
        "end": 2056.9
    },
    {
        "text": " cada vez quieren más opciones de configuración.",
        "start": 2056.9,
        "end": 2060.9
    },
    {
        "text": " No sé si sabía si se proyecta que eso va a impactar,",
        "start": 2060.9,
        "end": 2065.9
    },
    {
        "text": " porque como deciste, software a medida, después hay una empresa como 50.000 a 80.000 dólares.",
        "start": 2066.9,
        "end": 2071.9
    },
    {
        "text": " En cambio, que las soluciones configurables, a veces pueden solucionar el tema por,",
        "start": 2071.9,
        "end": 2075.9
    },
    {
        "text": " no sé, cientos de dólares o a veces miles de dólares, pero muchos menos.",
        "start": 2075.9,
        "end": 2079.9
    },
    {
        "text": " Y sobre todo con lo de que todos los negocios ahora tienen que tener un componente tecnológico de software,",
        "start": 2079.9,
        "end": 2086.9
    },
    {
        "text": " si eso no podría impactar,",
        "start": 2086.9,
        "end": 2089.9
    },
    {
        "text": " a veces esas cosas cambian en un futuro sacano.",
        "start": 2089.9,
        "end": 2092.9
    },
    {
        "text": " Están muy buenas preguntas.",
        "start": 2092.9,
        "end": 2094.9
    },
    {
        "text": " ¿Quién le hizo?",
        "start": 2094.9,
        "end": 2096.9
    },
    {
        "text": " Que no hubi...",
        "start": 2096.9,
        "end": 2097.9
    },
    {
        "text": " Hola, mi nombre es Joaquín Salles.",
        "start": 2097.9,
        "end": 2099.9
    },
    {
        "text": " No es un hombre muy junto.",
        "start": 2099.9,
        "end": 2101.9
    },
    {
        "text": " Ahí va, Joaquín Salles.",
        "start": 2101.9,
        "end": 2103.9
    },
    {
        "text": " No, pero estamos muy buenas, Joaquín, la pregunta.",
        "start": 2103.9,
        "end": 2106.9
    },
    {
        "text": " A ver, la primera respuesta es que la verdad que desconozco que haya algún estudio",
        "start": 2106.9,
        "end": 2113.9
    },
    {
        "text": " y de hecho viene bien también a hablar de estas tres consultoras,",
        "start": 2113.9,
        "end": 2116.9
    },
    {
        "text": " porque seguramente si hay alguien escribió algo de ese futuro, si hay una de esas tres,",
        "start": 2116.9,
        "end": 2120.9
    },
    {
        "text": " la verdad que desconozco,",
        "start": 2120.9,
        "end": 2122.9
    },
    {
        "text": " lo cual seguramente quiere decir que tampoco no hay ninguna analiz,",
        "start": 2122.9,
        "end": 2127.9
    },
    {
        "text": " no hay ninguna futurología muy negativa, porque si no seguramente ya le hubiera leído,",
        "start": 2127.9,
        "end": 2131.9
    },
    {
        "text": " lo que sabe, ¿cómo si les que por un lado lo que decís es cierto,",
        "start": 2131.9,
        "end": 2135.9
    },
    {
        "text": " o sea, hay cabez más productos que...",
        "start": 2135.9,
        "end": 2138.9
    },
    {
        "text": " Y lo vamos a ver ahora, casi en mediatos,",
        "start": 2138.9,
        "end": 2141.9
    },
    {
        "text": " o sea, la idea del producto es que lo desarrollas una vez y lo vendés miles de veces.",
        "start": 2141.9,
        "end": 2145.9
    },
    {
        "text": " Esa economía de escala, lo que te permite,",
        "start": 2145.9,
        "end": 2149.9
    },
    {
        "text": " haberla invertido, $100.000 dólares al producto, pero cobrarlo $200 dólares por mes.",
        "start": 2149.9,
        "end": 2155.9
    },
    {
        "text": " Por ejemplo, lo que sea, porque lo vas a vender o lo deberías de poder vender",
        "start": 2155.9,
        "end": 2159.9
    },
    {
        "text": " muchísimas veces, así como está.",
        "start": 2159.9,
        "end": 2162.9
    },
    {
        "text": " O sea, esa cajita, el concepto de caja del que antes venía el casete, no, el casete.",
        "start": 2162.9,
        "end": 2168.9
    },
    {
        "text": " El disquete, el disquete del CD, o sea, son cajitas,",
        "start": 2168.9,
        "end": 2173.9
    },
    {
        "text": " que te la descargas de alguna nube.",
        "start": 2173.9,
        "end": 2176.9
    },
    {
        "text": " Entonces, en ese sentido, sí, y hay cada vez más productos,",
        "start": 2176.9,
        "end": 2181.9
    },
    {
        "text": " y sobre todo, ahora productos en la nube, que hacen más cosas.",
        "start": 2181.9,
        "end": 2185.9
    },
    {
        "text": " Y es cierto, o sea, en la medida que un cliente pueda comprar un producto",
        "start": 2185.9,
        "end": 2191.9
    },
    {
        "text": " y que eso, en ese asuficiente, seguro, esa es la mejor solución.",
        "start": 2191.9,
        "end": 2196.9
    },
    {
        "text": " O sea, no justifica gastarse decenas o $100.000 dólares",
        "start": 2196.9,
        "end": 2202.9
    },
    {
        "text": " en algo que te beneficia, no sé, un 2% más de lo que me beneficia",
        "start": 2202.9,
        "end": 2208.9
    },
    {
        "text": " pagar $50 dólares por mes, una inscripción de un producto SaaS en una nube.",
        "start": 2208.9,
        "end": 2213.9
    },
    {
        "text": " Salvo que, salvo que ese 2% sea de una torta de plata.",
        "start": 2213.9,
        "end": 2218.9
    },
    {
        "text": " Ahí sí, capa que te cusifica.",
        "start": 2218.9,
        "end": 2221.9
    },
    {
        "text": " Pero aún así, hay cada vez más, me sale decir, hay cada vez más creatividad",
        "start": 2221.9,
        "end": 2228.9
    },
    {
        "text": " en los negocios generales, la volvía de tecnología.",
        "start": 2229.9,
        "end": 2232.9
    },
    {
        "text": " O sea, hay cada vez más negocios de cualquier tipo.",
        "start": 2232.9,
        "end": 2235.9
    },
    {
        "text": " Y, bueno, y eso también genera como más espacios o más agujeros",
        "start": 2235.9,
        "end": 2240.9
    },
    {
        "text": " de oportunidad, de sobentanas de oportunidad,",
        "start": 2240.9,
        "end": 2243.9
    },
    {
        "text": " en donde capaz que vas a buscar algo que no existe.",
        "start": 2243.9,
        "end": 2247.9
    },
    {
        "text": " Y si vas a buscar algo que no existe o los productos que hay",
        "start": 2247.9,
        "end": 2251.9
    },
    {
        "text": " no te satisfacen por decir algo más de la mitad de tus requerimientos,",
        "start": 2251.9,
        "end": 2256.9
    },
    {
        "text": " en realidad no tiene sentido que vos le pidas a alguien que haga un producto,",
        "start": 2256.9,
        "end": 2260.9
    },
    {
        "text": " que invierta a decenas de miles de horas y te lo venda a $50 dólares por mes.",
        "start": 2260.9,
        "end": 2265.9
    },
    {
        "text": " O sea, lo que vas a tener que hacer es ir una empresa de desarrollo a medida",
        "start": 2265.9,
        "end": 2269.9
    },
    {
        "text": " y pagar desarrollo a medida.",
        "start": 2269.9,
        "end": 2271.9
    },
    {
        "text": " Entonces, está muy buena la pregunta.",
        "start": 2271.9,
        "end": 2275.9
    },
    {
        "text": " La verdad que no se ve, yo por lo menos no he visto en ningún lado,",
        "start": 2275.9,
        "end": 2280.9
    },
    {
        "text": " que hace una tendencia a ver menos de desarrollo a medida",
        "start": 2280.9,
        "end": 2284.9
    },
    {
        "text": " por el hecho que haya más productos empaquetados.",
        "start": 2284.9,
        "end": 2288.9
    },
    {
        "text": " Está.",
        "start": 2288.9,
        "end": 2289.9
    },
    {
        "text": " Me queda un poco más tranquila entonces.",
        "start": 2289.9,
        "end": 2291.9
    },
    {
        "text": " Sí, sí, sí.",
        "start": 2291.9,
        "end": 2292.9
    },
    {
        "text": " Y no, por eso. Por ahora, todos podemos comer tranquila de todo esto,",
        "start": 2292.9,
        "end": 2297.9
    },
    {
        "text": " incluso lo que no trabajamos con empresas de producto.",
        "start": 2297.9,
        "end": 2302.9
    },
    {
        "text": " Igual me interesa, porque capaz que lo menos intuitivo para ustedes, ¿no?",
        "start": 2302.9,
        "end": 2306.9
    },
    {
        "text": " Cuando digo eso, de que imagínense que yo soy una empresa X,",
        "start": 2306.9,
        "end": 2310.9
    },
    {
        "text": " y digo, bueno, pero no sé, necesito un software para manejar mi comunicación con el cliente,",
        "start": 2310.9,
        "end": 2315.9
    },
    {
        "text": " con los posibles clientes.",
        "start": 2315.9,
        "end": 2317.9
    },
    {
        "text": " Que lo que hace un CRM, ¿no? Un CRM, un customer relationship management,",
        "start": 2317.9,
        "end": 2321.9
    },
    {
        "text": " un manejador de la relación con el cliente.",
        "start": 2321.9,
        "end": 2324.9
    },
    {
        "text": " Entonces, no sé, cada vez que le mando un mail, pongo en el CRM,",
        "start": 2324.9,
        "end": 2328.9
    },
    {
        "text": " le mandé un mail preguntándole, blah, blah, blah.",
        "start": 2328.9,
        "end": 2331.9
    },
    {
        "text": " Ah, Jaspot, exacto. Jaspot es el CRM lidera de la taltura,",
        "start": 2331.9,
        "end": 2336.9
    },
    {
        "text": " pero hay montón, hay Microsoft, hay Salesforce, hay un montón de productos CRM.",
        "start": 2336.9,
        "end": 2341.9
    },
    {
        "text": " Entonces, si yo soy una empresa, capaz que digo,",
        "start": 2341.9,
        "end": 2344.9
    },
    {
        "text": " bueno, pero para que me agastar 100 mil dólares en cualquier las empresas que ustedes la duran",
        "start": 2344.9,
        "end": 2349.9
    },
    {
        "text": " para hacer un CRM a medida, cuando en realidad compro Jaspot,",
        "start": 2349.9,
        "end": 2353.9
    },
    {
        "text": " que la versión gratis está bastante imitada, pero no está mal.",
        "start": 2353.9,
        "end": 2357.9
    },
    {
        "text": " Y después empieza a que lo compartí de 50 dólares por mes.",
        "start": 2357.9,
        "end": 2360.9
    },
    {
        "text": " Si Jaspot me resuelve buena parte de mi problema de negocio,",
        "start": 2361.9,
        "end": 2367.9
    },
    {
        "text": " entonces lo voy a hacer.",
        "start": 2367.9,
        "end": 2369.9
    },
    {
        "text": " Ahora, ya sea que Jaspot no me resuelve 2, 3, 4 cosas que para amigos eso son importantes.",
        "start": 2369.9,
        "end": 2375.9
    },
    {
        "text": " Ahí voy a tener que morir con algo custom, con la comedía.",
        "start": 2375.9,
        "end": 2378.9
    },
    {
        "text": " O cuando que tal vez Jaspot me resuelve al 99%,",
        "start": 2378.9,
        "end": 2382.9
    },
    {
        "text": " pero ese 1% restante es tan importante para mí y manejo tanta plata",
        "start": 2382.9,
        "end": 2387.9
    },
    {
        "text": " que aún así me conviene ir con algo medida.",
        "start": 2387.9,
        "end": 2390.9
    },
    {
        "text": " Aunque bueno, en esa dichotomía que decía,",
        "start": 2392.9,
        "end": 2396.9
    },
    {
        "text": " seguramente en ese caso te convenga llamar a Jaspot y decirle, ¿cuánto me sale?",
        "start": 2396.9,
        "end": 2400.9
    },
    {
        "text": " Que me desarroches un ficho un poco diferente suelo para mí.",
        "start": 2400.9,
        "end": 2403.9
    },
    {
        "text": " ¿Qué eso también se hace?",
        "start": 2403.9,
        "end": 2405.9
    },
    {
        "text": " Tal vez Jaspot no es un ejemplo más feliz, porque es una empresa bastante grande este momento,",
        "start": 2405.9,
        "end": 2411.9
    },
    {
        "text": " pero aún así casi todas las empresas del producto y también lo vamos a ver ahora dentro un poco.",
        "start": 2411.9,
        "end": 2416.9
    },
    {
        "text": " Casi todas las empresas del producto no es que venden el producto.",
        "start": 2416.9,
        "end": 2419.9
    },
    {
        "text": " Ah, ya está, sí, tata, si quieres algo más, no sé, no escucho, no te hago.",
        "start": 2419.9,
        "end": 2423.9
    },
    {
        "text": " No, no, casi todas las empresas del producto tienen un área también de servicios",
        "start": 2423.9,
        "end": 2427.9
    },
    {
        "text": " que te customizan su propio producto.",
        "start": 2427.9,
        "end": 2430.9
    },
    {
        "text": " Y aún así capa que te sale menos que hacer un desarrollo a medida",
        "start": 2430.9,
        "end": 2434.9
    },
    {
        "text": " y con menos riesgo también, pero está, no me quiero adelantar a temas más adelante.",
        "start": 2434.9,
        "end": 2439.9
    },
    {
        "text": " Bueno, sigo si tiene una pregunta más de esto, lo pueden ir tipiando en el chat.",
        "start": 2440.9,
        "end": 2447.9
    },
    {
        "text": " Empecemos a hablar un poco de productos, ver sus servicios.",
        "start": 2447.9,
        "end": 2451.9
    },
    {
        "text": " Ya, ya adelante un poquito, ¿no?",
        "start": 2451.9,
        "end": 2454.9
    },
    {
        "text": " Y ahora la vamos a ver un poco más, pero en la empresa de servicios.",
        "start": 2454.9,
        "end": 2457.9
    },
    {
        "text": " Ah, perdón, había una mano levantada.",
        "start": 2457.9,
        "end": 2460.9
    },
    {
        "text": " No te veo el nombre, no sé por qué.",
        "start": 2460.9,
        "end": 2463.9
    },
    {
        "text": " Alil, ¿qué hizo yo?",
        "start": 2463.9,
        "end": 2465.9
    },
    {
        "text": " Vos, ah, alil.",
        "start": 2465.9,
        "end": 2468.9
    },
    {
        "text": " No, la pregunta es si todas las empresas pueden ver bien en esos productos o servicios,",
        "start": 2469.9,
        "end": 2475.9
    },
    {
        "text": " sobre todo porque la empresa que está trabajando ahora en realidad que siguen,",
        "start": 2475.9,
        "end": 2479.9
    },
    {
        "text": " no es una empresa de, o sea, es una empresa inmobiliaria, pero que utiliza el software",
        "start": 2479.9,
        "end": 2484.9
    },
    {
        "text": " en la ciudad transversalmente a todo lo que hace, y tiene la emalición de la ingeniería",
        "start": 2484.9,
        "end": 2489.9
    },
    {
        "text": " que desarrolla software para potenciar ese negocio.",
        "start": 2489.9,
        "end": 2494.9
    },
    {
        "text": " Y eso entra en algunas a dos áreas, básicamente,",
        "start": 2495.9,
        "end": 2497.9
    },
    {
        "text": " o sea, por ejemplo, utiliza un software desde hacer machine learning para ver si las propiedades",
        "start": 2497.9,
        "end": 2502.9
    },
    {
        "text": " que tienen tancaras o baratas o un poin hasta la encarca para interactuar con los clientes",
        "start": 2502.9,
        "end": 2509.9
    },
    {
        "text": " que pueden satiar con gente que es medio en las casas, por ejemplo,",
        "start": 2509.9,
        "end": 2512.9
    },
    {
        "text": " pobles alescados, obresoles, virtuales, pero todo software propietario de desinobiliaria",
        "start": 2512.9,
        "end": 2518.9
    },
    {
        "text": " para ofrecer tus servicios en realidad, de tecnología, pero es una empresa inmobiliaria.",
        "start": 2518.9,
        "end": 2523.9
    },
    {
        "text": " Está bueno, está lo que está en el caso.",
        "start": 2524.9,
        "end": 2527.9
    },
    {
        "text": " Sí, está bueno, en el caso.",
        "start": 2527.9,
        "end": 2529.9
    },
    {
        "text": " Cuando en desarrollo, es hecho logramos in-house, o sea, dentro de la propia empresa",
        "start": 2529.9,
        "end": 2538.9
    },
    {
        "text": " y como es decir, es parte de lo que hace la empresa y seguramente sea parte de tu ventaja competitiva,",
        "start": 2538.9,
        "end": 2545.9
    },
    {
        "text": " porque algo de bien invierten en las personas y en el desarrollo de esas soluciones.",
        "start": 2545.9,
        "end": 2552.9
    },
    {
        "text": " En ese caso, yo casi quidiría que lo consideraría más servicio,",
        "start": 2552.9,
        "end": 2557.9
    },
    {
        "text": " porque son cosas a medida que están haciendo ellos y no lo están revendiendo aparentemente,",
        "start": 2557.9,
        "end": 2562.9
    },
    {
        "text": " porque sí no lo está revendiendo en ningún otro contexto.",
        "start": 2562.9,
        "end": 2565.9
    },
    {
        "text": " Aunque también, como hago el diablo, podríamos decir, bueno,",
        "start": 2565.9,
        "end": 2570.9
    },
    {
        "text": " pero alguno de los componentes o de las soluciones que ellos hacen,",
        "start": 2570.9,
        "end": 2573.9
    },
    {
        "text": " tal vez si el día mañana abre en un boliche de tecnología, podrían venderlo como un producto SaaS,",
        "start": 2573.9,
        "end": 2578.9
    },
    {
        "text": " por ejemplo, y podría ser.",
        "start": 2579.9,
        "end": 2581.9
    },
    {
        "text": " También es cierto que por lo menos numericamente son las menos empresas que hacen eso",
        "start": 2581.9,
        "end": 2588.9
    },
    {
        "text": " que vos están mencionando en general para decirlo mal y pronto.",
        "start": 2588.9,
        "end": 2592.9
    },
    {
        "text": " No se calientan la cabeza con contratar los desarrolladores, armarles en la área.",
        "start": 2592.9,
        "end": 2597.9
    },
    {
        "text": " No sé qué sean buenos de en front, en back, en un PM que los gestione.",
        "start": 2597.9,
        "end": 2603.9
    },
    {
        "text": " En la realidad seguramente van a decir, bueno, a ver, ¿qué es su afuera de gestión de inmobiliaria",
        "start": 2604.9,
        "end": 2609.9
    },
    {
        "text": " o lo que sea? Bueno, y van comprando cosas y hacen más o menos que se hablen uno con otro.",
        "start": 2609.9,
        "end": 2614.9
    },
    {
        "text": " Eso es lo más típico, pero está bueno el caso que es, porque justamente al ser menos típico",
        "start": 2614.9,
        "end": 2621.9
    },
    {
        "text": " es un poquito más un gris, pero vuelta, yo creo que en ese caso es un caso bastante distinto",
        "start": 2621.9,
        "end": 2627.9
    },
    {
        "text": " porque es un desarrollo in-house y no es para venderlo a nadie.",
        "start": 2627.9,
        "end": 2631.9
    },
    {
        "text": " O sea, casi que lo vería un poquito más como un desarrollo a medida.",
        "start": 2632.9,
        "end": 2636.9
    },
    {
        "text": " Ah, está bien.",
        "start": 2638.9,
        "end": 2639.9
    },
    {
        "text": " Sí, porque sin la pado de ideología o sea, la empresa no existe, realmente no es que no...",
        "start": 2639.9,
        "end": 2644.9
    },
    {
        "text": " Bueno, claro, me imagino.",
        "start": 2644.9,
        "end": 2646.9
    },
    {
        "text": " Sí, me imagino porque sí, es como decir, no sé, infocazas.",
        "start": 2646.9,
        "end": 2650.9
    },
    {
        "text": " Infocazas, sin la tecnología, no existe.",
        "start": 2650.9,
        "end": 2652.9
    },
    {
        "text": " Pero, infocazas de último, por ejemplo, en infocazas no es una inmobiliaria,",
        "start": 2653.9,
        "end": 2657.9
    },
    {
        "text": " es esa que vive de publicar listings, de cosas.",
        "start": 2657.9,
        "end": 2660.9
    },
    {
        "text": " O sea, esos, sin la parte inmobiliaria sí existe, y son una empresa de esa risión.",
        "start": 2662.9,
        "end": 2667.9
    },
    {
        "text": " Es mucho más fácil ver eso, que es una empresa que realmente tiene propiedades,",
        "start": 2667.9,
        "end": 2672.9
    },
    {
        "text": " que la gestiona, que...",
        "start": 2672.9,
        "end": 2674.9
    },
    {
        "text": " Pero que la tecnología central al negocio a parte de la punta que tiene una adicción ingeniería de ella mismo.",
        "start": 2674.9,
        "end": 2680.9
    },
    {
        "text": " Sí, es que también podríamos hacer una analogía y es que si ustedes,",
        "start": 2680.9,
        "end": 2685.9
    },
    {
        "text": " que el tieto que vos sos parte de ese equipo de desarrollo,",
        "start": 2685.9,
        "end": 2687.9
    },
    {
        "text": " si ustedes como el equipo de desarrollo estuvieran en una software factory,",
        "start": 2687.9,
        "end": 2690.9
    },
    {
        "text": " sería literal el ejemplo típico de un servicio de desarrollo media.",
        "start": 2690.9,
        "end": 2694.9
    },
    {
        "text": " Yo pase que acá es un poquito distinto,",
        "start": 2694.9,
        "end": 2696.9
    },
    {
        "text": " porque ustedes están in-house dentro de propiedades.",
        "start": 2696.9,
        "end": 2699.9
    },
    {
        "text": " Sí, perdón, se preguntaban por acá, SaaS y es con 2 SaaS,",
        "start": 2701.9,
        "end": 2706.9
    },
    {
        "text": " es software de service.",
        "start": 2706.9,
        "end": 2708.9
    },
    {
        "text": " Gracias, Martín, que no te to.",
        "start": 2708.9,
        "end": 2710.9
    },
    {
        "text": " Bueno, y hablando un poquito más de productos servicios.",
        "start": 2711.9,
        "end": 2714.9
    },
    {
        "text": " A ver, acá la invitación es a pensar, ¿no?",
        "start": 2714.9,
        "end": 2717.9
    },
    {
        "text": " Imagínense y, bueno, ellas, simplemente para facilitar el entendimiento del tema.",
        "start": 2717.9,
        "end": 2723.9
    },
    {
        "text": " Imagínense que ustedes quieren empezar una empresa de tecnología.",
        "start": 2723.9,
        "end": 2727.9
    },
    {
        "text": " De las primeras preguntas que tendrían que hacerse es si entienden que vas a ser una empresa de productos o de servicios.",
        "start": 2727.9,
        "end": 2734.9
    },
    {
        "text": " Porque la decisión va a implicar, como hicíamos antes,",
        "start": 2734.9,
        "end": 2738.9
    },
    {
        "text": " va a impactar en un montón de otras cosas.",
        "start": 2738.9,
        "end": 2740.9
    },
    {
        "text": " Va a impactar muchísimo en el negocio, en la comercialización de eso.",
        "start": 2740.9,
        "end": 2743.9
    },
    {
        "text": " Y también porque hasta desarrollar producto,",
        "start": 2743.9,
        "end": 2747.9
    },
    {
        "text": " versus desarrollar servicios, es bastante distinto.",
        "start": 2747.9,
        "end": 2752.9
    },
    {
        "text": " Y ahora vamos a ver un poco algunas, algunos ejemplos.",
        "start": 2752.9,
        "end": 2755.9
    },
    {
        "text": " Y es bastante distinto al punto que muchas veces se ponen como puesto.",
        "start": 2755.9,
        "end": 2762.9
    },
    {
        "text": " Bueno, o sos una empresa de producto, o sos una empresa de servicio.",
        "start": 2762.9,
        "end": 2765.9
    },
    {
        "text": " Y en realidad, hay lo que se llama la empresa Cybridas,",
        "start": 2766.9,
        "end": 2769.9
    },
    {
        "text": " que incluyen las dos patas dentro del motelcho.",
        "start": 2769.9,
        "end": 2773.9
    },
    {
        "text": " Son las menos, y bueno, ahí tienen varias particularidades que la vamos a ver.",
        "start": 2773.9,
        "end": 2778.9
    },
    {
        "text": " Bueno, primero, una empresa de producto.",
        "start": 2781.9,
        "end": 2783.9
    },
    {
        "text": " Como decía, esto para decirlo mal, pero que se entienda,",
        "start": 2783.9,
        "end": 2788.9
    },
    {
        "text": " es desarrollar el producto, así como está, lo vendés muchísimas veces,",
        "start": 2788.9,
        "end": 2793.9
    },
    {
        "text": " vendés las descargas de ese producto.",
        "start": 2794.9,
        "end": 2796.9
    },
    {
        "text": " Y el cliente que quiera tu producto,",
        "start": 2796.9,
        "end": 2801.9
    },
    {
        "text": " va a saber que ya está desarrollado de antemano,",
        "start": 2801.9,
        "end": 2804.9
    },
    {
        "text": " y elegirá comprarlo o no comprarlo, o probarlo o no probarlo.",
        "start": 2804.9,
        "end": 2808.9
    },
    {
        "text": " Después, por otro lado, la empresa de servicio,",
        "start": 2808.9,
        "end": 2811.9
    },
    {
        "text": " no le puede mostrar nada, porque tiene que entender los requerimientos",
        "start": 2811.9,
        "end": 2815.9
    },
    {
        "text": " para empezarlo a desarrollar, como se llama,",
        "start": 2815.9,
        "end": 2818.9
    },
    {
        "text": " seguirle cobrando y prometerle jurarle que de aquí a seis meses",
        "start": 2818.9,
        "end": 2821.9
    },
    {
        "text": " vamos a hacer el software que gente quiere.",
        "start": 2821.9,
        "end": 2824.9
    },
    {
        "text": " Entonces, la empresa de producto, entonces, generalmente,",
        "start": 2824.9,
        "end": 2829.9
    },
    {
        "text": " lo que hacen es un MVP para venderse como que se dice,",
        "start": 2829.9,
        "end": 2833.9
    },
    {
        "text": " y después arrancar a desarrollar.",
        "start": 2833.9,
        "end": 2837.9
    },
    {
        "text": " Correcto.",
        "start": 2837.9,
        "end": 2839.9
    },
    {
        "text": " El MVP está muy asociado a valiar negocio,",
        "start": 2839.9,
        "end": 2842.9
    },
    {
        "text": " y lo vamos a ver de antemano.",
        "start": 2842.9,
        "end": 2844.9
    },
    {
        "text": " En BIP quiere decir, mi nivel de producto,",
        "start": 2844.9,
        "end": 2847.9
    },
    {
        "text": " o sea, producto, míoamente viable para los que no conozcan las cargas.",
        "start": 2847.9,
        "end": 2852.9
    },
    {
        "text": " Entonces, justamente como la empresa de producto,",
        "start": 2852.9,
        "end": 2856.9
    },
    {
        "text": " y en la invitación de que les hacía recién,",
        "start": 2856.9,
        "end": 2861.9
    },
    {
        "text": " bueno, para gente, vamos, entre ustedes cinco,",
        "start": 2861.9,
        "end": 2864.9
    },
    {
        "text": " desde el grupo, vamos a una empresa de producto.",
        "start": 2864.9,
        "end": 2866.9
    },
    {
        "text": " Genial, bueno, qué producto.",
        "start": 2866.9,
        "end": 2868.9
    },
    {
        "text": " O sea, van a ser ustedes cinco que van a decidir qué producto.",
        "start": 2868.9,
        "end": 2871.9
    },
    {
        "text": " O sea, que esa idea, déficamente surge de los propios fundadores.",
        "start": 2871.9,
        "end": 2875.9
    },
    {
        "text": " Y después, te he hecho también con Sebastián,",
        "start": 2875.9,
        "end": 2878.9
    },
    {
        "text": " Sebastián Macías, que van a estar viendo el módulo en Prendeurismo,",
        "start": 2878.9,
        "end": 2881.9
    },
    {
        "text": " van a ver también un cuadro que está súper bueno de ver los cuatro",
        "start": 2881.9,
        "end": 2885.9
    },
    {
        "text": " origen estípicos de las empresas de tecnología que van a volver sobre esto.",
        "start": 2885.9,
        "end": 2890.9
    },
    {
        "text": " Entonces, bueno, nos juntamos y decimos, bueno, vamos a hacer un buen empresa de producto,",
        "start": 2890.9,
        "end": 2893.9
    },
    {
        "text": " porque no sé, porque yo ya programo y me cansé, me pollé,",
        "start": 2893.9,
        "end": 2898.9
    },
    {
        "text": " de estar suichando de un proyecto a otro, de un cliente a otro,",
        "start": 2898.9,
        "end": 2902.9
    },
    {
        "text": " y el modelo de negocio, el servicio es que siempre tienes que vender",
        "start": 2902.9,
        "end": 2905.9
    },
    {
        "text": " y siempre inventar todo de cero, que hay un poco de eso,",
        "start": 2905.9,
        "end": 2908.9
    },
    {
        "text": " ya lo vamos a ver.",
        "start": 2908.9,
        "end": 2910.9
    },
    {
        "text": " Entonces, producto es facilísimo.",
        "start": 2910.9,
        "end": 2912.9
    },
    {
        "text": " Por lo haces, una vez, le metés mucho, pero una vez que las es,",
        "start": 2912.9,
        "end": 2916.9
    },
    {
        "text": " lo vendés miles de veces.",
        "start": 2916.9,
        "end": 2918.9
    },
    {
        "text": " Bueno, sí, lo vendés miles de veces.",
        "start": 2918.9,
        "end": 2921.9
    },
    {
        "text": " Si no, no lo vendés ni una vez.",
        "start": 2921.9,
        "end": 2924.9
    },
    {
        "text": " O una, dos, tres, todos tus familiares amigos,",
        "start": 2924.9,
        "end": 2928.9
    },
    {
        "text": " como dicen, Friends Family and Fools, te lo compran",
        "start": 2928.9,
        "end": 2931.9
    },
    {
        "text": " y después no se lo vendés a manadí.",
        "start": 2931.9,
        "end": 2934.9
    },
    {
        "text": " Entonces, la empresa de producto puede ser una fuente mucho más interesante",
        "start": 2934.9,
        "end": 2940.9
    },
    {
        "text": " de redito económico y de copar mercado si la pegás realmente en la idea de negocio",
        "start": 2940.9,
        "end": 2947.9
    },
    {
        "text": " y en cómo llevar, en cómo ejecutar esa idea de negocio.",
        "start": 2947.9,
        "end": 2951.9
    },
    {
        "text": " Pero bueno, en definitiva, lo que tiene la empresa de producto es,",
        "start": 2951.9,
        "end": 2954.9
    },
    {
        "text": " así como está, por eso se dice, Asis, o sea, así como está ese producto,",
        "start": 2954.9,
        "end": 2959.9
    },
    {
        "text": " vendé a volo a infinidad de clientes.",
        "start": 2959.9,
        "end": 2961.9
    },
    {
        "text": " Y ahí donde generamos la economía de escala y colamos antes.",
        "start": 2961.9,
        "end": 2965.9
    },
    {
        "text": " Capa que desarrollar el producto, nos llegó a nosotros cinco, un año,",
        "start": 2965.9,
        "end": 2970.9
    },
    {
        "text": " que se hago la cuenta en nuestros sueldos durante un año por cinco,",
        "start": 2970.9,
        "end": 2974.9
    },
    {
        "text": " seguramente de escena de mil dólares.",
        "start": 2974.9,
        "end": 2977.9
    },
    {
        "text": " Pero como yo sé, que le voy a vender, o sea, y ahí haré asestimaciones.",
        "start": 2977.9,
        "end": 2982.9
    },
    {
        "text": " Y de hecho, es parte de lo que le vamos a pedir,",
        "start": 2982.9,
        "end": 2986.9
    },
    {
        "text": " es que le van a tener, si lo pretenden vender 500 veces, el precio es uno.",
        "start": 2986.9,
        "end": 2992.9
    },
    {
        "text": " Si lo pretenden vender 100 mil, el precio es otro.",
        "start": 2992.9,
        "end": 2995.9
    },
    {
        "text": " Y la cantidad de recursos que pueden asociar a signar a ese producto,",
        "start": 2995.9,
        "end": 2999.9
    },
    {
        "text": " en un caso buen otro, es distinto.",
        "start": 2999.9,
        "end": 3001.9
    },
    {
        "text": " Y capas que en un caso tiene negocio y capas que no hay baso, te vas a fundir",
        "start": 3001.9,
        "end": 3004.9
    },
    {
        "text": " o sea que en misichera empiezas.",
        "start": 3004.9,
        "end": 3006.9
    },
    {
        "text": " Entonces, lo ideal, pero no prese producto, es, lo desarrollamos una vez,",
        "start": 3006.9,
        "end": 3010.9
    },
    {
        "text": " y así como está la empresa de producto,",
        "start": 3010.9,
        "end": 3014.9
    },
    {
        "text": " lo desarrollamos una vez, y así como está, igualito, se lo vendo a todo el mundo.",
        "start": 3014.9,
        "end": 3019.9
    },
    {
        "text": " Pues hablamos de paquete de software, ya desarrollados.",
        "start": 3019.9,
        "end": 3022.9
    },
    {
        "text": " Ahora, también no estoy lejos, luego le chapa.",
        "start": 3022.9,
        "end": 3026.9
    },
    {
        "text": " Hay unos riesgos de dificultades, bueno, obviamente, inversión inicial.",
        "start": 3026.9,
        "end": 3031.9
    },
    {
        "text": " O sea, tenemos que tener la plata o el sustento.",
        "start": 3031.9,
        "end": 3035.9
    },
    {
        "text": " Pues cuando te dicen, no, no solo nos cobramos.",
        "start": 3035.9,
        "end": 3038.9
    },
    {
        "text": " Bueno, perfecto, pero quiente de altecho, la electricidad, la helagua,",
        "start": 3038.9,
        "end": 3042.9
    },
    {
        "text": " la comida, la transporte, no, la ropa.",
        "start": 3042.9,
        "end": 3045.9
    },
    {
        "text": " O sea, costo siempre hay.",
        "start": 3045.9,
        "end": 3048.9
    },
    {
        "text": " Y por eso, y acá me corretó también de algo que no lo dije en la introducción.",
        "start": 3048.9,
        "end": 3054.9
    },
    {
        "text": " Este curso se llama el negocio del software, pero no crean que es solamente aplicable",
        "start": 3054.9,
        "end": 3059.9
    },
    {
        "text": " a temas como de negocio, cuando una habla como de negocio típico que es hacer plata,",
        "start": 3059.9,
        "end": 3065.9
    },
    {
        "text": " en realidad, en la absoluto.",
        "start": 3065.9,
        "end": 3067.9
    },
    {
        "text": " O sea, el 99% de los temas que van a ver acá, aplica lo mismo.",
        "start": 3067.9,
        "end": 3071.9
    },
    {
        "text": " Si ustedes van a hacer una ONG de tecnología, o van a ser algo para la comunidad,",
        "start": 3071.9,
        "end": 3076.9
    },
    {
        "text": " o van a ser algo para que se los compre un solo cliente como el del Estado.",
        "start": 3076.9,
        "end": 3080.9
    },
    {
        "text": " O sea, como sea, costo siempre hay y vender o de alguna forma obtener algún redito de lo que se hace,",
        "start": 3080.9,
        "end": 3088.9
    },
    {
        "text": " va a haber que hacer porque alguien lo tiene que bancar.",
        "start": 3088.9,
        "end": 3092.9
    },
    {
        "text": " Entonces, lo que vamos a hablar, o sea, si bien hablamos de la palabra negocio",
        "start": 3092.9,
        "end": 3096.9
    },
    {
        "text": " y hasta acá casi tenida como esa idea de hacer plata, en realidad, no tiene por qué ser el caso.",
        "start": 3096.9,
        "end": 3105.9
    },
    {
        "text": " Y cuando hablamos de cliente, en realidad generalicen lo para hablar de organización.",
        "start": 3105.9,
        "end": 3111.9
    },
    {
        "text": " O sea, por un cliente, puede ser el Estado, puede ser alguien aquí en celos regalo",
        "start": 3111.9,
        "end": 3115.9
    },
    {
        "text": " porque yo estoy obteniendo el ingreso de otro lado, ¿no?",
        "start": 3115.9,
        "end": 3118.9
    },
    {
        "text": " O sea, el Estado me subsidia y yo le regalo el software.",
        "start": 3118.9,
        "end": 3121.9
    },
    {
        "text": " Bueno, ahí te hay capaces más usuarios que cliente, pero el concepto de cliente también es muy amplio.",
        "start": 3121.9,
        "end": 3125.9
    },
    {
        "text": " Termina siendo quien termina beneficiándose de mi software.",
        "start": 3125.9,
        "end": 3129.9
    },
    {
        "text": " ¿Haya pagado o no? Capaces un ciudadano y no lo pago directamente,",
        "start": 3129.9,
        "end": 3134.9
    },
    {
        "text": " bueno, indirectamente así por impuesto, ¿no?",
        "start": 3134.9,
        "end": 3137.9
    },
    {
        "text": " Entonces, primero está la inversión inicial.",
        "start": 3137.9,
        "end": 3140.9
    },
    {
        "text": " Después, bueno, en particular, el producto,",
        "start": 3140.9,
        "end": 3144.9
    },
    {
        "text": " el producto se juega mucho marketing porque justamente lo que queremos hacer,",
        "start": 3144.9,
        "end": 3148.9
    },
    {
        "text": " como decíamos hoy es desarrollarlo una vez y vendarlo cientos o miles de veces.",
        "start": 3148.9,
        "end": 3153.9
    },
    {
        "text": " Yo no puedo tener una fuerza comercial de vendedores que estén llamando a cada posible cliente de 10 dólares y convenciéndolo uno a uno.",
        "start": 3154.9,
        "end": 3163.9
    },
    {
        "text": " O sea, se dan cuenta enseídas con lo que me van a costar,",
        "start": 3163.9,
        "end": 3166.9
    },
    {
        "text": " tener, no sé, 20 a 30, un con el centro de vendedores de especializados en esto,",
        "start": 3166.9,
        "end": 3172.9
    },
    {
        "text": " no me van a cerrar los números cobrándoles de 10, 20, ni siquiera 50 dólares por mes.",
        "start": 3172.9,
        "end": 3177.9
    },
    {
        "text": " O sea, Housebot, que es el ejemplo que ponía en usted en el chat, Housebot,",
        "start": 3177.9,
        "end": 3181.9
    },
    {
        "text": " incluso para la suscripción más básica que creo que es 50 dólares por mes.",
        "start": 3181.9,
        "end": 3185.9
    },
    {
        "text": " O sea, no va a haber nadie que te llame, te quiera convencer de que le quete su mes a Housebot por 50 dólares por mes,",
        "start": 3185.9,
        "end": 3191.9
    },
    {
        "text": " porque no le da los números. Lo que hace Housebot, como producto, como plataforma SaaS,",
        "start": 3191.9,
        "end": 3196.9
    },
    {
        "text": " es poner publicidad en todo el lado, en todo el lado que crea que vos como perspectivo cliente puede estar mirando,",
        "start": 3196.9,
        "end": 3205.9
    },
    {
        "text": " te pone publicidad y eso es marketing. Entonces, captura, el click y la conversión de ese click.",
        "start": 3205.9,
        "end": 3212.9
    },
    {
        "text": " Ahora, si yo después, como sea más adelante, si yo vendo, soluciones a medida de 100,000 dólares,",
        "start": 3212.9,
        "end": 3218.9
    },
    {
        "text": " ahí es tipo, lo opuesto. O sea, no se me ocurre que nadie, porque vea una publicidad,",
        "start": 3218.9,
        "end": 3224.9
    },
    {
        "text": " va a cliquiar y va a decir, así, te compro este proyecto a medida de 100,000 dólares.",
        "start": 3224.9,
        "end": 3228.9
    },
    {
        "text": " Me voy a pasar de paso a través de el PDF con el argumento, pasamos el dato de la cuenta.",
        "start": 3228.9,
        "end": 3232.9
    },
    {
        "text": " O sea, es absurdo. Voy a querer llamar y decir, va, pasame con un vendedor que me llame a alguien y voy a tener 10 reuniones,",
        "start": 3232.9,
        "end": 3240.9
    },
    {
        "text": " un café, un almuerzo, un golf, lo que sea para gastar esos 100,000 dólares.",
        "start": 3240.9,
        "end": 3246.9
    },
    {
        "text": " Entonces, en ese otro contexto de servicios, en general, se juega mucho más lo comercial.",
        "start": 3246.9,
        "end": 3252.9
    },
    {
        "text": " Mientras que en el contexto del producto, el partido se juega mucho, en el partido de la venta,",
        "start": 3252.9,
        "end": 3258.9
    },
    {
        "text": " se juega mucho en el marketing, en la promoción, en la publicidad.",
        "start": 3258.9,
        "end": 3263.9
    },
    {
        "text": " Y después, en lo canal de distribución, ¿cómo le hago llegar ese producto a mi cliente?",
        "start": 3263.9,
        "end": 3270.9
    },
    {
        "text": " Hoy, en el caso de las SAS, simplemente una estrategia de Nubes, yo hago publicidad y después cliquiás en un lado y,",
        "start": 3270.9,
        "end": 3278.9
    },
    {
        "text": " bueno, eso está ajustado en alguna Nubes. Y en el caso de las SAS, ya hay un monopolio,",
        "start": 3278.9,
        "end": 3284.9
    },
    {
        "text": " prácticamente, de los dos stores, el Google del de Apple, que cobran su buena tajada para hacer un canal de distribución de tu producto.",
        "start": 3284.9,
        "end": 3292.9
    },
    {
        "text": " Y una buena tajada.",
        "start": 3292.9,
        "end": 3294.9
    },
    {
        "text": " La recurrencia de agresos van a ver que es importante tanto en producto como servicio,",
        "start": 3294.9,
        "end": 3299.9
    },
    {
        "text": " vamos a ver un poquito más adelante, porque es importante tener flujos recurrentes,",
        "start": 3299.9,
        "end": 3304.9
    },
    {
        "text": " o sea, tener predesibilidad, o sea, poder predecir el ingreso de dinero que va a tener mi empresa,",
        "start": 3304.9,
        "end": 3311.9
    },
    {
        "text": " porque con eso puedo gestionar mucho mejoras futuro en la empresa.",
        "start": 3311.9,
        "end": 3315.9
    },
    {
        "text": " Y, bueno, y obviamente, investigación, desarrollo y innovación, y más de más y,",
        "start": 3315.9,
        "end": 3321.9
    },
    {
        "text": " investigación, desarrollo y innovación, ¿por qué? Porque la empresa de producto tiene que estar constantemente innovando,",
        "start": 3321.9,
        "end": 3328.9
    },
    {
        "text": " estando en la cresta de la ola, porque donde se duerman, se da vuelta y un competidor que hace un par de meses,",
        "start": 3328.9,
        "end": 3334.9
    },
    {
        "text": " era chico, era chiquito, y ahora sacó todas las features que vos no tenías y te empieza a generar más tracción",
        "start": 3334.9,
        "end": 3340.9
    },
    {
        "text": " y a pasar por arriba a tuyo. De hecho, en la empresa de producto suele pasar que,",
        "start": 3340.9,
        "end": 3347.9
    },
    {
        "text": " sobre todo en los primeros épocas, cuando todavía no tenés un liderazgo de mercado,",
        "start": 3347.9,
        "end": 3352.9
    },
    {
        "text": " que se ayudamos a ver más adelante, lo que es lo que es pasar es que estás capaz que 3, 4, 5, 6 meses",
        "start": 3352.9,
        "end": 3359.9
    },
    {
        "text": " adelante de tu primer competidor, entonces donde te duermas, literalmente en un par de meses,",
        "start": 3359.9,
        "end": 3363.9
    },
    {
        "text": " te pasaron por arriba. Ya cuando llegaste, al 30% de todo el mercado,",
        "start": 3363.9,
        "end": 3368.9
    },
    {
        "text": " bueno, ahí ya es más difícil que te corran con el codo, ¿no?",
        "start": 3368.9,
        "end": 3371.9
    },
    {
        "text": " Leo, hay unos chaps acá, Federico, ¿puedes ser que las empresas con enfoca servicios?",
        "start": 3371.9,
        "end": 3379.9
    },
    {
        "text": " Tiengan enfocas más a largo plazo, ya que servicios te haría cambia más a lo largo del tiempo",
        "start": 3379.9,
        "end": 3384.9
    },
    {
        "text": " y se piensa más a la tener la cliente. Yo creo que es más un prejuicio,",
        "start": 3384.9,
        "end": 3391.9
    },
    {
        "text": " porque la empresa de producto, justamente y seguramente lo verán notado.",
        "start": 3392.9,
        "end": 3398.9
    },
    {
        "text": " O sea, antes cuando vos comprabas un producto, no sé, comprabas la cajita de Loughys,",
        "start": 3398.9,
        "end": 3403.9
    },
    {
        "text": " bueno, era comprémiles, yo me bajaba en Loughys, me lo corría en mi computadora,",
        "start": 3403.9,
        "end": 3409.9
    },
    {
        "text": " lo pagaba, no sé, pagaba 150 dólares una vez y lo usaba de por vida.",
        "start": 3409.9,
        "end": 3414.9
    },
    {
        "text": " Que de hecho, sigue estando como una posibilidad. Ahora, cada vez más se va a un modelo por su inscripción",
        "start": 3414.9,
        "end": 3419.9
    },
    {
        "text": " y sobre todo los modelos Sass son sean ideales para eso.",
        "start": 3419.9,
        "end": 3423.9
    },
    {
        "text": " Entonces, en vez de pagar lo que se llama Up Front al principio de todo y tipo Tass Tullo,",
        "start": 3423.9,
        "end": 3429.9
    },
    {
        "text": " lo usas compré mises en tu máquina, de conectarte de internet y ya está.",
        "start": 3429.9,
        "end": 3433.9
    },
    {
        "text": " Cada vez más se pasa a vender productos en un modelo de sucripción.",
        "start": 3433.9,
        "end": 3437.9
    },
    {
        "text": " Entonces, en el modelo de sucripción, en vez de pagar 150 dólares por Loughys,",
        "start": 3437.9,
        "end": 3443.9
    },
    {
        "text": " yo creo que te pagas 1700 pesos por año, por ejemplo, de Loughys.",
        "start": 3443.9,
        "end": 3451.9
    },
    {
        "text": " Entonces, en ese contexto, la empresa de producto también quiere asegurarse que año a año,",
        "start": 3451.9,
        "end": 3455.9
    },
    {
        "text": " año a año, me va a seguir teniendo con un suscriptor.",
        "start": 3455.9,
        "end": 3459.9
    },
    {
        "text": " Entonces, yo creo que en ese caso aplica para las dos.",
        "start": 3459.9,
        "end": 3463.9
    },
    {
        "text": " Bueno, pues ahí una respuesta.",
        "start": 3463.9,
        "end": 3467.9
    },
    {
        "text": " Entonces, cuando procies un producto para la venta, pero después a tu cliente,",
        "start": 3467.9,
        "end": 3471.9
    },
    {
        "text": " les voy a presentar un mantenimiento de su corte, mil acesión de empresa de servicio.",
        "start": 3471.9,
        "end": 3475.9
    },
    {
        "text": " Bueno, ahí Martin es una buena pregunta y capaz que lo vamos a andar un poquito más después de realidad.",
        "start": 3475.9,
        "end": 3481.9
    },
    {
        "text": " La empresa de producto típicamente tiene como dos corrientes.",
        "start": 3481.9,
        "end": 3485.9
    },
    {
        "text": " O sea, te ven el producto total, ¿cuál?",
        "start": 3485.9,
        "end": 3487.9
    },
    {
        "text": " Pero después te lo van actualizando y bueno, de alguna forma, vos tenés que pagar las actualizaciones,",
        "start": 3487.9,
        "end": 3493.9
    },
    {
        "text": " típicamente, como decía hoy, bajo modelo de suscripción.",
        "start": 3493.9,
        "end": 3495.9
    },
    {
        "text": " O sea, mientras esté suscrito, te doy la última versión.",
        "start": 3495.9,
        "end": 3498.9
    },
    {
        "text": " Te dejaste de suscribir y tal vez no te bajo, pero te congero la versión, por ejemplo.",
        "start": 3498.9,
        "end": 3503.9
    },
    {
        "text": " Entonces, cada vez más te da menos valor ni producto.",
        "start": 3503.9,
        "end": 3506.9
    },
    {
        "text": " Pero a veces también, a veces, a veces el producto ofrecen algún tipo de servicio,",
        "start": 3506.9,
        "end": 3511.9
    },
    {
        "text": " o a incluso de ser de customización, de desarrollo a medida, o de mantenimiento de su aporte, de su producto.",
        "start": 3511.9,
        "end": 3517.9
    },
    {
        "text": " Y ahí donde empezás a tener un poco de producto y un poco de servicio la vez.",
        "start": 3517.9,
        "end": 3521.9
    },
    {
        "text": " Bueno, para pasar a servicios, como estamos.",
        "start": 3524.9,
        "end": 3527.9
    },
    {
        "text": " En los servicios típicamente, la idea surge al revés, surte de clientes.",
        "start": 3528.9,
        "end": 3534.9
    },
    {
        "text": " Y acá, imagínense mentalmente una típica software factor y una empresa de desarrollo de software a medida.",
        "start": 3534.9,
        "end": 3541.9
    },
    {
        "text": " O sea, nos lo estamos ahí.",
        "start": 3541.9,
        "end": 3544.9
    },
    {
        "text": " Bueno, no es que estemos esperando.",
        "start": 3544.9,
        "end": 3546.9
    },
    {
        "text": " Es decir, estamos esperando a que a que lleguen clientes si nos hagan pedido.",
        "start": 3546.9,
        "end": 3549.9
    },
    {
        "text": " Los comerciales salimos a buscar clientes, pero la idea de la solución de tecnología que vamos a hacer viene de clientes.",
        "start": 3550.9,
        "end": 3561.9
    },
    {
        "text": " Y bueno, y se ve en un proyecto único a muchos menos y acá empezamos a usar caras más comillas.",
        "start": 3562.9,
        "end": 3569.9
    },
    {
        "text": " También un desarrollo a medida, por supuesto, dependiendo de la propia intelectual y de qué se ha afirmado con el cliente,",
        "start": 3570.9,
        "end": 3579.9
    },
    {
        "text": " en teoría no tiene por qué ser una vez que lo vende, o capaz que lo pongo a vender otra vez.",
        "start": 3579.9,
        "end": 3583.9
    },
    {
        "text": " Y eso es una cantidad reducida.",
        "start": 3583.9,
        "end": 3585.9
    },
    {
        "text": " Bueno, esta realidad es una cantidad reducida comparada con producto.",
        "start": 3585.9,
        "end": 3589.9
    },
    {
        "text": " O sea, una empresa de producto, literalmente, tenés que vender, gitípicamente, miles de instancia de tu producto, miles de escarragas de tu producto.",
        "start": 3589.9,
        "end": 3597.9
    },
    {
        "text": " Si no decenas de miles, en el de vuelta, típicamente, ¿no?",
        "start": 3598.9,
        "end": 3602.9
    },
    {
        "text": " Pues ser un producto súper caro, capaz de cientos, que está bien.",
        "start": 3602.9,
        "end": 3606.9
    },
    {
        "text": " En el caso de servicio, no tenés miles de clientes.",
        "start": 3606.9,
        "end": 3609.9
    },
    {
        "text": " O sea, tenés algunos clientes por mes o no sea algunas decenas de clientes por mes y es que ya sos una soporto grande.",
        "start": 3609.9,
        "end": 3615.9
    },
    {
        "text": " Entonces, eso de cantidad reducida es, sobre todo, comparado con producto.",
        "start": 3615.9,
        "end": 3620.9
    },
    {
        "text": " Y bueno, y la realidad es que termina siendo que se hace desarrollo a medida, consultoría, soporto mantenimiento, para alguien especial,",
        "start": 3621.9,
        "end": 3629.9
    },
    {
        "text": " para ese cliente que viene con esos 20, 50 o 100 mil dólares y con una necesidad de negocio por detrás.",
        "start": 3629.9,
        "end": 3638.9
    },
    {
        "text": " Y de vuelta, como decía hoy, vamos a hablar bastante sobre qué es vender servicios.",
        "start": 3638.9,
        "end": 3647.9
    },
    {
        "text": " No sé, me quedo de todo claro, porque la idea sale del cliente y como es eso entonces si no te quedas esperando que caiga los clientes,",
        "start": 3648.9,
        "end": 3661.9
    },
    {
        "text": " que hace esa no es el todo claro, que lo que hace es vos, como iniciativa.",
        "start": 3661.9,
        "end": 3666.9
    },
    {
        "text": " A ver, son como dos temas distintos. O sea, cuando vende servicio de desarrollo a medida, la idea siempre va a ser de clientes.",
        "start": 3667.9,
        "end": 3675.9
    },
    {
        "text": " Lo que vos tenés que hacer es salir los a buscar. O sea, clientes con problemas con problemas que tienen una solución tecnológica, sobran.",
        "start": 3675.9,
        "end": 3683.9
    },
    {
        "text": " O sea, sobran clientes que tienen un problema y que quisieran resolverla con tecnología.",
        "start": 3683.9,
        "end": 3688.9
    },
    {
        "text": " El tema es que cuando le deciste, va a costar 50 lucas, tipo, muchas gracias.",
        "start": 3688.9,
        "end": 3693.9
    },
    {
        "text": " Voy y comprojados.",
        "start": 3694.9,
        "end": 3696.9
    },
    {
        "text": " Eso le pasa con muchos, pero aún así también, o sea, hay millones de empresas en todo el mundo, literalmente, con millones de necesidades de desarrollo a medida.",
        "start": 3696.9,
        "end": 3707.9
    },
    {
        "text": " Y bueno, y lo que tienen que hacer los vendedores de una empresa de servicios es salir a buscar los clientes dependiendo del segmento de cliente que se define.",
        "start": 3707.9,
        "end": 3717.9
    },
    {
        "text": " Y eso lo vamos a ver bastante más cuando veamos cuenta de servicio y tenemos tres clases para eso.",
        "start": 3718.9,
        "end": 3722.9
    },
    {
        "text": " Pero para redondear, o sea, la empresa de servicio tiene un área comercial con un vendedor, dos vendedores, bueno, dependiendo del tamaño de la empresa de servicio, que salimos, y digo, salimos porque yo soy uno de eso, salimos a buscar clientes que nos compren servicios.",
        "start": 3722.9,
        "end": 3741.9
    },
    {
        "text": " En el caso de la empresa de producto, en general, tiene un área de marketing súper fuerte, que lo que hace es posicionar la marca en todas las redes, en todo lado, hasta en tu sopa para que volve de la línea y pruebes esos 10 dólares por mes.",
        "start": 3742.9,
        "end": 3755.9
    },
    {
        "text": " Y bueno, que es lo que lo que busca como el santo grial, no, por así decirlo de la empresa de servicio curdo, de la software factory.",
        "start": 3759.9,
        "end": 3769.9
    },
    {
        "text": " Bueno, es uno de los santo griales de la software factory es productivizar una solución que has desarrollado antes, ¿qué significa?",
        "start": 3770.9,
        "end": 3777.9
    },
    {
        "text": " Agarrar una solución que le hiciera una medida para un cliente y decir, pero esto se lo podría vender a muchos más.",
        "start": 3777.9,
        "end": 3784.9
    },
    {
        "text": " Vamos a hacer un producto con esto. Y como en general, no no nos damos cuenta que es muy distintos a desarrollar una solución para una vez que desarrollar un producto para cientos o para mis clientes,",
        "start": 3784.9,
        "end": 3796.9
    },
    {
        "text": " se subestima la dificultad que tiene primero desarrollarlo técnicamente al producto, que no es tipo, bueno, ya le hicimos para uno.",
        "start": 3796.9,
        "end": 3804.9
    },
    {
        "text": " Bueno, de última, lo publicamos y que se lo bajen, no, no tiene nada que ver, los problemas que se genera al usarlo en escala, no tiene nada que ver a los problemas cuando lo usa un solo cliente.",
        "start": 3804.9,
        "end": 3815.9
    },
    {
        "text": " Y además, la forma de salirlo a vender tampoco no tiene nada que ver como dijimos antes, si te pasas a producto, seguramente tendrás que hacer un esfuerzo mucho más grande en la parte de marketing y de posicionamiento, que no estás acostumbrado a hacer eso, si eso es una empresa de servicio de vuelta, hablando de los casos típicos del producto o de servicio.",
        "start": 3816.9,
        "end": 3836.9
    },
    {
        "text": " O si no también, otra quimera, o sea, una cosa ilusoria, una mentira, defrasada de verdad, bueno, pero cuando tenemos gente en bench, en bench, o sea, cuando no estás asignado todavía, ningún proyecto, cuando estás entre proyectos, bueno, soy una persona, son para factor y pero cuando tengo gente en bench, como si le deseará un producto,",
        "start": 3837.9,
        "end": 3856.9
    },
    {
        "text": " bueno, todavía estoy esperando a ver un ejemplo en donde eso haya funcionado de verdad, y una vez, porque lo doy placo que estaba no y en bench, a las tres semanas, el comercial dice bueno, conseguí un proyecto, bueno, te vas a teban a meter ese proyecto y después las otras tres compañeras que estaba libre, ahora agarraron esta base de código, no entienden nada, desastre el total.",
        "start": 3857.9,
        "end": 3879.9
    },
    {
        "text": " Entonces, vamos a entender bien qué es desarrollar un producto, qué es desarrollar un servicio.",
        "start": 3879.9,
        "end": 3884.9
    },
    {
        "text": " Bueno, si, ¿qué recomendarjear a la gente en bench?",
        "start": 3887.9,
        "end": 3891.9
    },
    {
        "text": " Aparte, esto le pasa casi todas las empresas en la que tan ustedes me pueden comprometer tanto mi respuesta, no para que...",
        "start": 3897.9,
        "end": 3905.9
    },
    {
        "text": " Cuando también la grabación puede ser, puede ser, no, pero la respuesta que no dice mucho, pero también es políticamente correcta, pero además es cierta, es que la verdad que depende muchísimo de qué hace la empresa de servicios y en qué tapa está.",
        "start": 3906.9,
        "end": 3922.9
    },
    {
        "text": " O sea, a veces tiene sentido hacer una investigación de algo, a veces tiene sentido hacer un blog post, a veces tiene sentido hacer una apóc, una prueba de concepto o una integración entre dos cosas que en general no te al tiempo si estás a full con clientes, a veces tiene sentido que se certifica y la persona, hay mil opciones, mil opciones.",
        "start": 3923.9,
        "end": 3943.9
    },
    {
        "text": " Entonces, sobre el tema que dijiste cómo venderlo, también depende del tamaño al mercado, ¿no? Porque eso sería trabajar en una empresa que tenía su propio producto, pero el tamaño al mercado, potenciales clientes no eran tantos.",
        "start": 3944.9,
        "end": 3957.9
    },
    {
        "text": " Entonces tenía en una área de devolves que salían a vender llamando como vos decías, literalmente, hablando comunicando este con las empresas.",
        "start": 3957.9,
        "end": 3965.9
    },
    {
        "text": " O sea, sí sí sí pero o sea sí, puede tener sentido que si hagas una empresa del producto y como tenés pocos clientes, no, no sé, por lo menos entre comillas, capaz que tener que llamarlos ahora de vuelta, seguramente ese producto no valía 10 dólares o 50 dólares, seguramente valía 100 o 1000, porque si no es imposible no te dan los números, no, o sea, simplemente ver la gente llamando aparte cuando yo dije con el center es casi una broma.",
        "start": 3965.9,
        "end": 3993.9
    },
    {
        "text": " O sea, no puedes tener un consente de gente que no tenga ni idea para vender algo, para vender un producto de software, o sea, tienen que tener idea. Entonces, todo ese setup, ese, el diseño de ese equipo, entrenar a su renderador, que es realmente llamando, o sea, todo eso te hace que no puedas, literalmente vender por unos mangoes un producto que te se ha redito a abrir.",
        "start": 3993.9,
        "end": 4014.9
    },
    {
        "text": " Y si, en realidad nosotros como consumidores, por suerte eso pasa, porque si no, no te hagas nada de todo el lado.",
        "start": 4014.9,
        "end": 4022.9
    },
    {
        "text": " Por acá preguntan qué significa posicionamiento en una empresa del producto.",
        "start": 4026.9,
        "end": 4032.9
    },
    {
        "text": " Cuando digo posicionamiento, me refiero en general la posicionamiento de mercado, lograr que tu producto empiece a tener tracción, nos empieza a lograr ventas en cierto mercado o en cierto nicho o en cierto segmento.",
        "start": 4032.9,
        "end": 4044.9
    },
    {
        "text": " No sé si tenés un producto, o sea, hoy para seguridad el adulto mayor, obviamente me interesa que empiece en venderlo y o sea, comprarlo a adulto mayores o los hijos de los adultos mayores.",
        "start": 4044.9,
        "end": 4056.9
    },
    {
        "text": " Entonces, ahí mi posicionamiento sería sobre el área de salud para adultos mayores.",
        "start": 4056.9,
        "end": 4063.9
    },
    {
        "text": " Bueno, después para también a conocer servicios, los riesgos y dificultades en los empresas de servicios típicas, bueno, obviamente la ejecución de los proyectos.",
        "start": 4067.9,
        "end": 4075.9
    },
    {
        "text": " Muchas de ustedes sabrán que gestionarlo, respecto a gestionar la cliente, los requerimientos, el que está en el caso de la BCDP, M, o de escranmáster, o de PO, o de Proximo, o la Mare Cocho.",
        "start": 4076.9,
        "end": 4091.9
    },
    {
        "text": " Hay toda una capa que se llamará, que le gustará más o menos que se le diga gestión, pero hay toda un tema de gestión en la ejecución de los proyectos que no es nada menor, nada menor, no, no puede estar siendo siempre que sí, tampoco puede decirle siempre que no hay cliente.",
        "start": 4092.9,
        "end": 4106.9
    },
    {
        "text": " Entonces, la gestión en la ejecución mismo del proyecto es un temón.",
        "start": 4107.9,
        "end": 4112.9
    },
    {
        "text": " No digo que ejecutar productos sea trivial, pero bueno, pero de última, si te demoras es sólo tu problema por así decirlo y tú está en tu marca.",
        "start": 4112.9,
        "end": 4123.9
    },
    {
        "text": " Ahora, en la ejecución de los proyectos de una empresa de servicios, una software factory, si te demoras, no solamente clientes está esperando por su serucción, sino que vos la estimación inicial que existe, ya te estás comiendo esa estimación, que después hablaremos más de eso.",
        "start": 4123.9,
        "end": 4139.9
    },
    {
        "text": " Bueno, después salí de cobrar, ¿no?",
        "start": 4140.9,
        "end": 4142.9
    },
    {
        "text": " Que a veces no es un problema, pero a veces sí.",
        "start": 4143.9,
        "end": 4147.9
    },
    {
        "text": " Salí de cobrar esos proyectos. En general, el producto es lo para que te acredito con Stripe, con PayPal, etcétera, y ya está, con los proyectos a medida no están así.",
        "start": 4148.9,
        "end": 4158.9
    },
    {
        "text": " Bueno, gestión de gran cantidad de personas y también no quiero implicar que las empresas de productos son todas chiquititas, pero podrán entremenso producto y ser un equipo de 10, 15, 20, 30 personas, no puede ser tremenda empresa servicios, 120, imposible.",
        "start": 4159.9,
        "end": 4174.9
    },
    {
        "text": " Porque el modelo de servicio literalmente escala con las horas de capacity que vos tenés mes a mes, porque en esencia lo que hace es vender las horas de los desarrolladores.",
        "start": 4174.9,
        "end": 4184.9
    },
    {
        "text": " Entonces, la empresa de servicio es como una mivencia, es como un hamster enorme, que en la mirada que engorda y crece ese hamster cada vez tiene que salir a buscar más proyectos, más proyectos y mover esa rodita cada vez más.",
        "start": 4184.9,
        "end": 4200.9
    },
    {
        "text": " Recorrencia de ingresos también es un tema que quieren tener tanto las empresas de producto como servicio, porque ya dijimos y después lo repasamos un poquito más, pero tiene que ver con esa previsión a futuro.",
        "start": 4201.9,
        "end": 4213.9
    },
    {
        "text": " Si pueden invertir en una área nueva, porque ya sé que en la próxima seis meses estamos bien, nos podemos mudar por eso, puedo contratar a alguien de recursos humanos, porque tengo un buen ingreso en la próxima seis meses, porque no voy a contratar ahí ni echarlo a tres meses.",
        "start": 4214.9,
        "end": 4229.9
    },
    {
        "text": " La recurrencia de ingresos es importante para los dos tipos de empresas.",
        "start": 4230.9,
        "end": 4234.9
    },
    {
        "text": " Y bueno, le manejo el cash flow, que lo vamos a ver más adelante, pero básicamente el cash flow es la plata que tenés constante y sonante en el banco en este momento.",
        "start": 4234.9,
        "end": 4243.9
    },
    {
        "text": " La empresa de servicios tienen un budget, un presupuesto que es básicamente lo sueldo de todos ustedes, es el 90% del costo de una empresa de servicio y eso obviamente eso no baja, o sea, tiende a subir, porque ustedes insisten en cada vez recibir aumentos, promociones y cobrar cada vez más.",
        "start": 4244.9,
        "end": 4263.9
    },
    {
        "text": " Entonces, los ingresos de la empresa en una pesa de servicio no no compás antípicamente a los salarios, sino que en un mes ganan pila y el mes siguiente capaz que pierden plata, porque el mes pasado cobraron las últimas entregas, los últimos sitos del desarrollo medida y en este otro mes, no sé, recién empiezan proyectos nuevos y tuvieron los pudieron cobrar la mitad de los clientes.",
        "start": 4264.9,
        "end": 4291.9
    },
    {
        "text": " Entonces, es un zigzag, la cantidad de guita que entra y sale de las empresas de servicios, mientras que los costos de las empresas servicios, estaba bastante planchado y bueno, va subiendo o de último con algún escaloncito si hago varios ingresos a la vez.",
        "start": 4291.9,
        "end": 4306.9
    },
    {
        "text": " Pero eso vamos ahora más adelante y el foco que creo que me lo saltí en el anterior el foco de producto es eficacia, o sea, el producto tiene ser eficaz, o sea, si estamos una semana testiando el mejor lugar en donde poner un botón y el esquema de colores lo vamos a hacer porque tiene ser la mejor forma de poner ese botóncito en ese diabolico lugar.",
        "start": 4307.9,
        "end": 4331.9
    },
    {
        "text": " Ahora eso no lo podemos hacer en servicios, porque hicimos una estimación, ese es el último sprint y hay que salir, hay que salir sí o sí y hay bueno, esa es esa línea.",
        "start": 4332.9,
        "end": 4343.9
    },
    {
        "text": " Entonces, el foco es eficiencia, o sea, la empresa de servicio es un Tetris y de hecho, si le preguntan a la gente de operaciones, seguramente todos tengan por ahí un excel maquia bélico, donde cada columna sean las semanas, cada fila sean cada una de ustedes y los bloque del tetrabo.",
        "start": 4344.9,
        "end": 4360.9
    },
    {
        "text": " Y el Tetris se han los proyectos, porque es un juego de eficiencia, es bien distinto la cabeza de ser eficaz en el producto, a la cabeza de ser eficiente en el servicio y acá porque estamos hablando casi sólo de producir un producto producir un servicio como ya dijimos a esto se agrega la grande diferencia entre vender productos y vender servicio.",
        "start": 4361.9,
        "end": 4383.9
    },
    {
        "text": " Las cosas son productos y servicios son cosas bien distintas.",
        "start": 4383.9,
        "end": 4388.9
    },
    {
        "text": " Algunos otra pregunta de esto que es bien importante y esto es como medular.",
        "start": 4389.9,
        "end": 4393.9
    },
    {
        "text": " No, nada, seguimos.",
        "start": 4403.9,
        "end": 4406.9
    },
    {
        "text": " Bueno, si no acríban por el chat.",
        "start": 4407.9,
        "end": 4409.9
    },
    {
        "text": " Bueno, empresas híbridas, y bueno, acá estamos de romper un poco de eslevarir miento de las slides.",
        "start": 4410.9,
        "end": 4420.9
    },
    {
        "text": " Las empresas híbridas sería como juntar esos dos polos, o sea, hacemos producto y servicio.",
        "start": 4421.9,
        "end": 4429.9
    },
    {
        "text": " Entonces, comoéis ahí, bueno, obviamente qué es lo que hay por detrás de una empresa híbrida, juntar los mejor de los dos mundos, pero qué tenés también y bueno, tienes lo peor de los dos mundos, como es todo, tenés las ventajas y las ventaja, las cosas.",
        "start": 4430.9,
        "end": 4443.9
    },
    {
        "text": " Por ahí, preguntas los Rp, en general los Rp como tal son empresas de producto, un Rp es un enterprise resource planning, o sea, un software para planificar los recursos o los procesos en general de la empresa, lo primero es lo proceso de producción, lo proceso de planificación de una fabrica, de una planta, etcétera, etcétera, se hace con sistemas Rp.",
        "start": 4444.9,
        "end": 4468.9
    },
    {
        "text": " Y en general los Rp son productos tipo, tipo, hay, y me salga, ¿no? Y por Zap, que tiene Rp para un montón de verticales, pero también podría ver un Rp que te lo customizan.",
        "start": 4469.9,
        "end": 4483.9
    },
    {
        "text": " Y ahora vamos a dar un poquito más de eso y ya te doy la palabra, aquí la mano.",
        "start": 4484.9,
        "end": 4488.9
    },
    {
        "text": " Las empresas híbridas puede ser que tengan un área de producto y después unos productos puro y después un área de servicio puro, puede ser y capaz que el ser del área de servicio te curto misa el producto y obviamente te levanta en la pata, o sea te van a escolar muchísimo mascaro su producto personalizado,",
        "start": 4489.9,
        "end": 4510.9
    },
    {
        "text": " porque además te van a tener que gestionar en un lugar solamente para vos, con las features que vos que solo vos pediste, la palabra, de hecho muchas empresas de producto, lo que hacen es estar siempre con el oído parado por nuevos features y funcionalidades y características y de última las incorporan al producto posta,",
        "start": 4511.9,
        "end": 4529.9
    },
    {
        "text": " en producción para que todos los clientes tengan esa nueva features, prefieren hacer eso y no estar generando veranches, ramas específicas para clientes puro, pero podría ser que una empresa tenga producto puro y después algún tipo de soluciones relacionadas con ese producto.",
        "start": 4530.9,
        "end": 4545.9
    },
    {
        "text": " Y de hecho más adelante vamos a ver la idea de whole product solution, o sea la idea de una solución entera que tener el producto pero también tengo consultoría de lo que te capacito, te ayudas mantenerlo, te doy soporto, o sea, hay servicio que se da muy bien para complementar un producto.",
        "start": 4546.9,
        "end": 4562.9
    },
    {
        "text": " Y también muchas veces la empresa de producto suele ser y muchas veces hasta en este orden, te vengo algo consultoría, por eso vamos a ver, dejame entender un poco tu problema, después te vengo una solución y qué queremos decir solución porque es una palabra de protituida también, no, hay varias palabras de protituida en nuestro vocabulario de tecnología,",
        "start": 4563.9,
        "end": 4586.9
    },
    {
        "text": " solución en nuestro curso quiere decir que es algo que está entre medio de un producto o un servicio, una solución es como una base de código que voy a reutilizar, pero igual me tengo que remangar y customizarla mucho o terminar de programar o terminado de ajustar algo, eso para mí es una solución, o sea, es algo que está como como dicen o gringos, half baked, o sea, está cocinado por la mitad,",
        "start": 4586.9,
        "end": 4610.9
    },
    {
        "text": " está, es algo que está bien en el continuo entre producto de servicio o una solución es algo que está en medio, entonces otra forma de una empresa de libría es te vende un poquito de consultoría, o a veces te la regalo si lo que viene después es muy caro, o sea, invierto en esa preventa, después te vengo una solución que ya está prearmada, pero después te la customizo y además te vengo un soporte sobre eso,",
        "start": 4610.9,
        "end": 4632.9
    },
    {
        "text": " entonces más allá de qué forma, pero ese mix entre tener un producto o una solución, una base de código que ya está y de pueden vender a servicios asociados, también se puede hacer y se llaman empresas y bridas.",
        "start": 4632.9,
        "end": 4649.9
    },
    {
        "text": " Ahora sí había una pregunta para ahí.",
        "start": 4649.9,
        "end": 4653.9
    },
    {
        "text": " Sí, profeder, yo, pero quedo claro con lo último que dijiste yo lo que había interpretado era que cuando una empresa así brida, el soporte es sobre el producto que ofrece y no, por lo que voy a decir, no,",
        "start": 4654.9,
        "end": 4667.9
    },
    {
        "text": " puede ser sí, pero pero es como decir, puede ser puramente orientado en servicio, que no tiene por qué estar relacionado con el producto, puede hacer tipo un software a medida, pero también tiene este producto que lo ofrece y está, era esa lado a que me quedaba, pero creo que claro,",
        "start": 4667.9,
        "end": 4683.9
    },
    {
        "text": " pueden haber empresas que tengan un producto ravioso, o sea un producto supermasivo, pero aún así tener un área de servicios que como decía hoy, bueno para que diente,",
        "start": 4683.9,
        "end": 4694.9
    },
    {
        "text": " y te lo metan en tu server, te lo customizan como vos quieras y bueno, si era ahí ellos te mantienen esa versión, como es distinta, la versión me está en producción, o también puede ser que tenga, de hecho, ahí algunos rp's que son más tipos de soluciones, o sea, el rp no es tipo, me lo descargo, le doy de blé clic y ya lo uso lo instalo, no, no, no, o sea, ya hay una base de código ya hecha para manejar los procesos típicos de una empresa, ahora con la consulta,",
        "start": 4694.9,
        "end": 4723.9
    },
    {
        "text": " con la consultoría ya veon que tipo de empresas sos y qué procesos necesitas y te lo termino? De culturizar tu medida y después te ven un soporte sobre eso,",
        "start": 4724.9,
        "end": 4734.139999999999
    },
    {
        "text": " en general las empresas y vidas tienen un equipo de producto que se se encarga de mantener vivo y actualizar el producto y un equipo de servicio como cuyo complementa a ese producto,",
        "start": 4734.139999999999,
        "end": 4747.74
    },
    {
        "text": " mucho gracias por que a ti.",
        "start": 4747.74,
        "end": 4750.74
    },
    {
        "text": " Mabra a casas tendencia a la sección de foco y eficacia en el sentido de hacer la cosa bien",
        "start": 4750.74,
        "end": 4756.74
    },
    {
        "text": " y eficiencia con el sentido de hacer las cosas con el mejor uso de el ruso.",
        "start": 4756.74,
        "end": 4760.74
    },
    {
        "text": " Tal cual, sin querer decir que las empresas de servicio hacen las cosas bien,",
        "start": 4760.74,
        "end": 4765.74
    },
    {
        "text": " pero la realidad es que una empresa de servicio no puede estar discutiendo una semana",
        "start": 4765.74,
        "end": 4770.74
    },
    {
        "text": " de lugar ideal, no? Seguro el hitmap de no sé qué y lo que dice el experto de UX UI,",
        "start": 4770.74,
        "end": 4777.74
    },
    {
        "text": " a ver, ¿dónde queda mejor? Acá listo, paso a la próxima feature porque en 3 días se termina el sprint y de casal ademos.",
        "start": 4777.74,
        "end": 4786.74
    },
    {
        "text": " Por eso es la analogía de ese hamster que constantemente está buscando vender proyectos,",
        "start": 4786.74,
        "end": 4793.74
    },
    {
        "text": " trasiendo esos proyectos que esté para la empresa y escutándonos lo más suficientemente posible.",
        "start": 4793.74,
        "end": 4798.74
    },
    {
        "text": " Bueno, después también lo que dice la bibliografía y no es que le diga solamente la bibliografía,",
        "start": 4802.74,
        "end": 4807.74
    },
    {
        "text": " sino que además es cierto que las empresas cibrías, claro, una vez que logras ese mix que no es nada fácil de lograr,",
        "start": 4807.74,
        "end": 4814.74
    },
    {
        "text": " en realidad, bueno, podéis lograr lo mejor de los dos mundos y que es lo mejor de los dos mundos.",
        "start": 4814.74,
        "end": 4820.74
    },
    {
        "text": " Porque pareciera ser y acá seguramente apelo al prejuicio que ustedes tengan,",
        "start": 4820.74,
        "end": 4824.74
    },
    {
        "text": " pareciera ser que a producto, producto es lo mejor, lo más grande, la pego,",
        "start": 4824.74,
        "end": 4829.74
    },
    {
        "text": " como dice en la gráfica es un hockey stick, como el palito de cejoke,",
        "start": 4829.74,
        "end": 4834.74
    },
    {
        "text": " que empieza a pilotar así la cantidad de venta, buenísimo, si lo logras, es muy exacto, es muy jugado.",
        "start": 4834.74,
        "end": 4841.74
    },
    {
        "text": " O sea, si le invocas, y digamos, si le invocas, porque no hiciste ningún curso de esto,",
        "start": 4841.74,
        "end": 4847.74
    },
    {
        "text": " si no no es invocarla, es analizar el problema, negocio, la solución, esa es una número, etcétera.",
        "start": 4847.74,
        "end": 4852.74
    },
    {
        "text": " Pero bueno, para decirlo mal, si le invocas con esa idea y con ese negocio del producto,",
        "start": 4852.74,
        "end": 4858.74
    },
    {
        "text": " genial, si te aplaudo, me da ya y beso, te felicito,",
        "start": 4858.74,
        "end": 4862.74
    },
    {
        "text": " ahora pegarla es difícilísimo.",
        "start": 4862.74,
        "end": 4865.74
    },
    {
        "text": " Y de hecho, hay por ahí algunas métricas, de todo, Siricom Valley,",
        "start": 4865.74,
        "end": 4870.74
    },
    {
        "text": " que es la cantidad, el porcentaje de start-ups de producto que es para casa,",
        "start": 4870.74,
        "end": 4874.74
    },
    {
        "text": " está entre el 70 y el 90% entre el 70 y el 90% de la start-ups de productos para casa.",
        "start": 4874.74,
        "end": 4881.74
    },
    {
        "text": " Entonces, realmente pegarla no es para nada sencillo,",
        "start": 4881.74,
        "end": 4886.74
    },
    {
        "text": " pero si la pegada de alguna forma, ya sea como empresa de producto, como empresa de híbrida,",
        "start": 4886.74,
        "end": 4891.74
    },
    {
        "text": " si tu parte de producto o de solución me da prearmada la pegadas,",
        "start": 4891.74,
        "end": 4896.74
    },
    {
        "text": " quiere decir que vas a tener economía escala, o sea que esa base de código,",
        "start": 4896.74,
        "end": 4900.74
    },
    {
        "text": " ya sea producto de solución, la vas a vender n veces cuando le existe una sola vez,",
        "start": 4900.74,
        "end": 4905.74
    },
    {
        "text": " o sea que ahí tienes economía escala, o sea, excede la venta de las horas de tu gente,",
        "start": 4905.74,
        "end": 4910.74
    },
    {
        "text": " que es lo que hace la software factor inmesa mes.",
        "start": 4910.74,
        "end": 4913.74
    },
    {
        "text": " Ahora, ¿qué pasa?",
        "start": 4913.74,
        "end": 4915.74
    },
    {
        "text": " En los ciclos económicos, sobre todo en las crisis económicas,",
        "start": 4915.74,
        "end": 4919.74
    },
    {
        "text": " las primeras cosas que se ven recortadas,",
        "start": 4919.74,
        "end": 4922.74
    },
    {
        "text": " es las cosas nuevas que podría ser de otra forma.",
        "start": 4922.74,
        "end": 4927.74
    },
    {
        "text": " Y muchas veces lo que se ha visto es que en las crisis económicas,",
        "start": 4927.74,
        "end": 4930.74
    },
    {
        "text": " las empresas de producto son las más golpeadas.",
        "start": 4930.74,
        "end": 4934.74
    },
    {
        "text": " Entonces, vender servicio te puede ser acomodada de otra forma,",
        "start": 4934.74,
        "end": 4939.74
    },
    {
        "text": " y de hecho, casi que por definición,",
        "start": 4939.74,
        "end": 4941.74
    },
    {
        "text": " son una empresa más flexible, o sea, tenés más para ofrecer si ofrecer dos cosas,",
        "start": 4941.74,
        "end": 4946.74
    },
    {
        "text": " a que se ofrecer una de las dos.",
        "start": 4946.74,
        "end": 4949.74
    },
    {
        "text": " Entonces, de vuelta, la parte de tener un mix o un offering,",
        "start": 4949.74,
        "end": 4954.74
    },
    {
        "text": " una oferta de producto de servicio de las dos, o sea, yurida, suena ideal,",
        "start": 4954.74,
        "end": 4960.74
    },
    {
        "text": " pero bueno, en algunos casos no aplica, o en algunos casos,",
        "start": 4960.74,
        "end": 4963.74
    },
    {
        "text": " simplemente, tal vez, tiene más sentido jugarsela por algunos de los dos caminos",
        "start": 4963.74,
        "end": 4967.74
    },
    {
        "text": " y después pivo a tiar para la un lado.",
        "start": 4967.74,
        "end": 4970.74
    },
    {
        "text": " Bueno, pero también la contragada por las dos, sino que lo bien claro, ¿no?",
        "start": 4970.74,
        "end": 4979.74
    },
    {
        "text": " Las empresas de servicios solo crecen, las servicios puros, ¿no?",
        "start": 4979.74,
        "end": 4983.74
    },
    {
        "text": " Es una medida puro.",
        "start": 4983.74,
        "end": 4984.74
    },
    {
        "text": " Solo crecen si tienen más personas ejecutando más horas,",
        "start": 4984.74,
        "end": 4989.74
    },
    {
        "text": " vendiendo más esa capacidad y nueva, mesa a mesa, no?",
        "start": 4989.74,
        "end": 4992.74
    },
    {
        "text": " Estimando bien, haciendo buenas que estén en el proyecto,",
        "start": 4992.74,
        "end": 4996.74
    },
    {
        "text": " o sea, siendo eficiente, pero, en realidad, una empresa de servicio pura,",
        "start": 4996.74,
        "end": 4999.74
    },
    {
        "text": " solo crece por dos motivos, ¿no?",
        "start": 4999.74,
        "end": 5002.74
    },
    {
        "text": " Una empresa de servicio, una software de pura,",
        "start": 5002.74,
        "end": 5004.74
    },
    {
        "text": " solo crece por dos motivos, ¿cuál es?",
        "start": 5004.74,
        "end": 5007.74
    },
    {
        "text": " ¿Cómo crecen otros?",
        "start": 5011.74,
        "end": 5012.74
    },
    {
        "text": " Contrando más gente o subiendo el precio al que corran.",
        "start": 5012.74,
        "end": 5016.74
    },
    {
        "text": " Exactamente, exactamente.",
        "start": 5016.74,
        "end": 5018.74
    },
    {
        "text": " Exactamente.",
        "start": 5018.74,
        "end": 5019.74
    },
    {
        "text": " El precio no lo pueden subir realmente, o sea.",
        "start": 5019.74,
        "end": 5021.74
    },
    {
        "text": " Exactamente, ya, contratando más gente,",
        "start": 5021.74,
        "end": 5023.74
    },
    {
        "text": " lo va a querer decir, vendiendo más proyectos a más clientes,",
        "start": 5023.74,
        "end": 5026.74
    },
    {
        "text": " o sea, vendiendo más proyectos y vendiendo mejor al rate hora.",
        "start": 5026.74,
        "end": 5031.74
    },
    {
        "text": " El rate es el valor hora, ahí cual vendemos.",
        "start": 5031.74,
        "end": 5034.74
    },
    {
        "text": " Ahora, vender a más clientes más proyectos,",
        "start": 5034.74,
        "end": 5039.74
    },
    {
        "text": " bueno, tener bendedores que salgan, que formaron una pequeña de comercial",
        "start": 5039.74,
        "end": 5043.74
    },
    {
        "text": " y salida vender y quedaron laburo, barbaro, ya lo van a ver.",
        "start": 5043.74,
        "end": 5047.74
    },
    {
        "text": " Por eso, vender 50 lucas, 100 lucas,",
        "start": 5047.74,
        "end": 5049.74
    },
    {
        "text": " bueno, imaginantes laburo que da eso.",
        "start": 5049.74,
        "end": 5051.74
    },
    {
        "text": " Entonces, podemos decir, ¡ah, buenísimo!",
        "start": 5051.74,
        "end": 5054.74
    },
    {
        "text": " Entonces, suvolvalora.",
        "start": 5054.74,
        "end": 5056.74
    },
    {
        "text": " Sí, sí, pues sí, que le cobra 100 la hora.",
        "start": 5056.74,
        "end": 5058.74
    },
    {
        "text": " No tengo nada, porque son, o sea, estás arrancando,",
        "start": 5058.74,
        "end": 5061.74
    },
    {
        "text": " este hiciste dos proyectos, chico.",
        "start": 5061.74,
        "end": 5063.74
    },
    {
        "text": " ¿Y cuál es tu rate 100 la hora?",
        "start": 5063.74,
        "end": 5065.74
    },
    {
        "text": " ¡Ah, buenísimo! Gracias.",
        "start": 5065.74,
        "end": 5067.74
    },
    {
        "text": " ¡Tú! O sea, no vas a andar nada.",
        "start": 5067.74,
        "end": 5069.74
    },
    {
        "text": " Entonces, podéis jugar dentro un rango de rates,",
        "start": 5069.74,
        "end": 5072.74
    },
    {
        "text": " pero en realidad, las empresas de servicio,",
        "start": 5072.74,
        "end": 5074.74
    },
    {
        "text": " en general, son tomadoras de rates.",
        "start": 5074.74,
        "end": 5076.74
    },
    {
        "text": " Obvio, cuando arrancás cobraba 25,",
        "start": 5076.74,
        "end": 5079.74
    },
    {
        "text": " después de 10 años, estás cobrando 70,",
        "start": 5079.74,
        "end": 5082.74
    },
    {
        "text": " obviamente, tenés mucho más estructura,",
        "start": 5083.74,
        "end": 5085.74
    },
    {
        "text": " mucho más grasa, mucho más cotofijo.",
        "start": 5085.74,
        "end": 5088.74
    },
    {
        "text": " Grasa eso, lo pende todo en el ejemplo,",
        "start": 5088.74,
        "end": 5090.74
    },
    {
        "text": " porque no producimos, pero no tengo que pagar igual.",
        "start": 5090.74,
        "end": 5092.74
    },
    {
        "text": " Y cobrabamos bien, por suerte.",
        "start": 5092.74,
        "end": 5094.74
    },
    {
        "text": " Pero bueno, que te puc cobrar 75, 80 la hora,",
        "start": 5094.74,
        "end": 5097.74
    },
    {
        "text": " porque soscreíble, porque tienes una reputación,",
        "start": 5097.74,
        "end": 5100.74
    },
    {
        "text": " tienes experiencia, tienes un porfolio,",
        "start": 5100.74,
        "end": 5102.74
    },
    {
        "text": " tienes caso de existo, bueno, un millón de cosas.",
        "start": 5102.74,
        "end": 5105.74
    },
    {
        "text": " O sea, cobras, lo que tu nivel de madudreste permite cobrar.",
        "start": 5105.74,
        "end": 5109.74
    },
    {
        "text": " Entonces, en general, bueno, el rate no tiene tanto margin,",
        "start": 5109.74,
        "end": 5114.74
    },
    {
        "text": " y sí lo que estás a hacer es salir y vender más proyectos.",
        "start": 5114.74,
        "end": 5117.74
    },
    {
        "text": " Bueno, estamos llegando a la hora, no no la recuerdo.",
        "start": 5120.74,
        "end": 5124.74
    },
    {
        "text": " Bueno, vemos solamente esta y dejamos para después los ejemplos esos.",
        "start": 5124.74,
        "end": 5129.74
    },
    {
        "text": " El ingreso recurrente, ya lo he dicho un poquito, no?",
        "start": 5129.74,
        "end": 5132.74
    },
    {
        "text": " O sea, el ingreso recurrente es tener cierta predicción,",
        "start": 5132.74,
        "end": 5136.74
    },
    {
        "text": " no parece que algo me gusta.",
        "start": 5137.74,
        "end": 5139.74
    },
    {
        "text": " Es cierta predisibilidad, como se diga, en el ingreso.",
        "start": 5139.74,
        "end": 5144.74
    },
    {
        "text": " O sea, que yo sepa más o menos cuánto dinero va a entrar",
        "start": 5144.74,
        "end": 5148.74
    },
    {
        "text": " en el próximo Q, un Q es un cuartero,",
        "start": 5148.74,
        "end": 5151.74
    },
    {
        "text": " o sea, son tres meses, que es una unidad que se usa bastante tecnología,",
        "start": 5151.74,
        "end": 5154.74
    },
    {
        "text": " o en el próximo semestre o en el próximo año.",
        "start": 5154.74,
        "end": 5157.74
    },
    {
        "text": " Y bueno, eso me permite ir viendo los proyectos de inversión que puedo hacer.",
        "start": 5157.74,
        "end": 5162.74
    },
    {
        "text": " Estamos como loco, ya somos 15, no tenemos nadie de recursos humanos.",
        "start": 5163.74,
        "end": 5167.74
    },
    {
        "text": " Vamos a tratar a alguien, bueno, pero no sé si le puedo pagar lo próximo 6 meses.",
        "start": 5167.74,
        "end": 5170.74
    },
    {
        "text": " Y porque no tenés ninguna recurrencia de ingresos.",
        "start": 5170.74,
        "end": 5175.74
    },
    {
        "text": " O sea, sobre el pucho te van actualizando los proyectos o no.",
        "start": 5175.74,
        "end": 5180.74
    },
    {
        "text": " En ese contexto, ¿cómo te las jugas a contratar alguien de talento",
        "start": 5180.74,
        "end": 5184.74
    },
    {
        "text": " o de recursos humanos que sabes que obviamente no va a producir",
        "start": 5184.74,
        "end": 5186.74
    },
    {
        "text": " o un comercial, ¿no?",
        "start": 5186.74,
        "end": 5188.74
    },
    {
        "text": " Que sabes que no va a producir y que va a ser un costumnido hasta que empiece a generar",
        "start": 5188.74,
        "end": 5191.74
    },
    {
        "text": " de una venta, si no tenés una mínima predicción en la futura de esos ingresos.",
        "start": 5191.74,
        "end": 5197.74
    },
    {
        "text": " Por eso es súper importante, tanto para productos como para servicios.",
        "start": 5197.74,
        "end": 5201.74
    },
    {
        "text": " Bueno, voy a parar la grabación.",
        "start": 5203.74,
        "end": 5211.74
    }
]