[
    {
        "text": " Bueno, vamos entonces a introducernos en una área,",
        "start": 0.0,
        "end": 4.4
    },
    {
        "text": " que es de analisis al gorismo, es una área bastante amplia,",
        "start": 4.4,
        "end": 7.8
    },
    {
        "text": " y por eso vamos a hacer sólo una introducción en este curso en este momento,",
        "start": 7.8,
        "end": 11.0
    },
    {
        "text": " una profundización después que veamos un poquito de recurción,",
        "start": 11.0,
        "end": 14.0
    },
    {
        "text": " vamos a ver cómo es el análisis al gorismo recurso,",
        "start": 14.0,
        "end": 17.2
    },
    {
        "text": " hoy vamos a ver la parte más iterativa,",
        "start": 17.2,
        "end": 19.6
    },
    {
        "text": " y profundizar esto para problemas incluso más complejos,",
        "start": 19.6,
        "end": 22.6
    },
    {
        "text": " se ve un poquito en programación 3,",
        "start": 22.6,
        "end": 25.0
    },
    {
        "text": " ahí van a ver un complemento de esto,",
        "start": 25.0,
        "end": 26.6
    },
    {
        "text": " y ahí el activa de analisis al gorismo,",
        "start": 26.6,
        "end": 28.2
    },
    {
        "text": " hay libros enteros escrito este tema,",
        "start": 28.2,
        "end": 30.2
    },
    {
        "text": " o sea que da para cursos sólo este tema,",
        "start": 30.2,
        "end": 32.2
    },
    {
        "text": " no les voy a negar, la parte analisis al gorismo tiene que ver con matemática,",
        "start": 32.2,
        "end": 37.2
    },
    {
        "text": " entonces de alguna manera es una área justamente permitida a gente matemática,",
        "start": 37.2,
        "end": 42.2
    },
    {
        "text": " sumarse al área de la informática, por ejemplo optimizando códigos,",
        "start": 42.2,
        "end": 46.2
    },
    {
        "text": " hoy voy a ver las mínimas nociones de matemática necesarias,",
        "start": 46.2,
        "end": 51.2
    },
    {
        "text": " porque ustedes pueden trabajar en el práctico,",
        "start": 51.2,
        "end": 54.2
    },
    {
        "text": " y después en el laboratorio entiendan cuando le ponen una restricción de eficiencia,",
        "start": 54.2,
        "end": 57.2
    },
    {
        "text": " que se está refiriendo, ese eso, ¿no?",
        "start": 57.2,
        "end": 60.2
    },
    {
        "text": " Bien, entonces para motivar un poquito el tema,",
        "start": 60.2,
        "end": 63.2
    },
    {
        "text": " y los quiero un poquito ágil acá, ¿no?",
        "start": 63.2,
        "end": 66.2
    },
    {
        "text": " Una y aquí el gorismo es una ligiría para resolver un problema,",
        "start": 66.2,
        "end": 69.2
    },
    {
        "text": " o sea no sólo que sea correcto, si tengo opciones,",
        "start": 69.2,
        "end": 71.2
    },
    {
        "text": " varios al gorismo de sorting, de ordenación, ¿cuál el hijo?",
        "start": 71.2,
        "end": 74.2
    },
    {
        "text": " ¿Y por qué?",
        "start": 74.2,
        "end": 75.2
    },
    {
        "text": " El más eficiente.",
        "start": 75.2,
        "end": 78.2
    },
    {
        "text": " El más eficiente.",
        "start": 78.2,
        "end": 80.2
    },
    {
        "text": " ¿Cuántos vas a cargar, si vas a cargar,",
        "start": 81.2,
        "end": 85.2
    },
    {
        "text": " si hay algo que hay más que ir, ¿no?",
        "start": 85.2,
        "end": 89.2
    },
    {
        "text": " Según la cantidad de que?",
        "start": 89.2,
        "end": 91.2
    },
    {
        "text": " El dato de fisícalo.",
        "start": 91.2,
        "end": 92.2
    },
    {
        "text": " Bueno, los datos de entrada al gorismo también pueden influir.",
        "start": 92.2,
        "end": 97.2
    },
    {
        "text": " ¿A qué dije una eficiencia? ¿Prentemente, ¿en eficiencia que es una computadora?",
        "start": 97.2,
        "end": 101.2
    },
    {
        "text": " El tiempo de ejecución y el espacio al más tenamiento,",
        "start": 101.2,
        "end": 106.2
    },
    {
        "text": " dos recursos críticos.",
        "start": 106.2,
        "end": 107.2
    },
    {
        "text": " Ahora, créanme que mucha gente no elige los algoritmos por eso.",
        "start": 108.2,
        "end": 111.2
    },
    {
        "text": " En la empresa todo.",
        "start": 111.2,
        "end": 113.2
    },
    {
        "text": " A veces eligen algoritmos porque son más fáciles de entender.",
        "start": 113.2,
        "end": 116.2
    },
    {
        "text": " ¿Está más prácticos?",
        "start": 116.2,
        "end": 118.2
    },
    {
        "text": " Más prácticos, si lo tengo que hacer un pequeño cambio,",
        "start": 118.2,
        "end": 120.2
    },
    {
        "text": " mejor que lo entiendas, si lo tengo que depurar o algo.",
        "start": 120.2,
        "end": 122.2
    },
    {
        "text": " Entonces, hay como distintos factores, ¿no?",
        "start": 122.2,
        "end": 124.2
    },
    {
        "text": " Fáctores que tienen que ver con el entendimiento",
        "start": 124.2,
        "end": 126.2
    },
    {
        "text": " de la claridad, la estabilidad del código,",
        "start": 126.2,
        "end": 129.2
    },
    {
        "text": " no son menores, cuando en un empresa lo que sea,",
        "start": 129.2,
        "end": 131.2
    },
    {
        "text": " hay gente que no está en esperta y después tiene que hacerle pequeñas modificaciones",
        "start": 131.2,
        "end": 134.2
    },
    {
        "text": " y es un código complejo, es difícil entrarle, no diría, ¿no?",
        "start": 134.2,
        "end": 139.2
    },
    {
        "text": " Y el segundo familia de criterios sí tiene que ver con la eficiencia.",
        "start": 139.2,
        "end": 143.2
    },
    {
        "text": " Eficiencia de los recursos informáticos,",
        "start": 143.2,
        "end": 145.2
    },
    {
        "text": " sobre todo cuando dijimos en este curso, nos interesa empezar a escalar",
        "start": 145.2,
        "end": 148.2
    },
    {
        "text": " en la complejidad de los problemas que vamos a resolver.",
        "start": 148.2,
        "end": 151.2
    },
    {
        "text": " O sea, problemas más grandes requieren más memoria y más tiempo de ejecución.",
        "start": 151.2,
        "end": 154.2
    },
    {
        "text": " Y vamos a ver hoy que salvo que uno hagan algoritmos con ciertos criterios",
        "start": 154.2,
        "end": 159.2
    },
    {
        "text": " si escaló explota.",
        "start": 159.2,
        "end": 161.2
    },
    {
        "text": " Un ejemplo, él expuse el gas de pasada con la torre de jano,",
        "start": 161.2,
        "end": 164.2
    },
    {
        "text": " y que decía, ¿qué pasa con ese ní cuando crece?",
        "start": 164.2,
        "end": 167.2
    },
    {
        "text": " Bueno, ambas clases de factores, en general, se contraponen.",
        "start": 167.2,
        "end": 171.2
    },
    {
        "text": " Los agorimos más eficientes, no son los más claros.",
        "start": 171.2,
        "end": 174.2
    },
    {
        "text": " Entonces, ¿qué hago?",
        "start": 174.2,
        "end": 176.2
    },
    {
        "text": " Bueno, hay una de las dos que las puedo paliar de alguna manera",
        "start": 176.2,
        "end": 179.2
    },
    {
        "text": " o a bordar, ¿qué es, por ejemplo, la claridad del código?",
        "start": 179.2,
        "end": 182.2
    },
    {
        "text": " ¿Cómo con comentarios?",
        "start": 182.2,
        "end": 184.2
    },
    {
        "text": " Entonces, puedo decir, este bloque, ¿no?",
        "start": 184.2,
        "end": 187.2
    },
    {
        "text": " Esta de esta función, este procedimiento, este módulo,",
        "start": 187.2,
        "end": 190.2
    },
    {
        "text": " también, ponerlo que se suele llamar pre-ipos condiciones.",
        "start": 190.2,
        "end": 193.2
    },
    {
        "text": " O sea, ¿qué es lo que hace?",
        "start": 193.2,
        "end": 195.2
    },
    {
        "text": " Quizás es complicada la cajita, pero yo al decir, con un comentario, ¿qué toma? ¿qué devuelve?",
        "start": 195.2,
        "end": 200.2
    },
    {
        "text": " Les doy una forma de interpretar a alguien ese código.",
        "start": 200.2,
        "end": 203.2
    },
    {
        "text": " ¿Sentiendo?",
        "start": 203.2,
        "end": 204.2
    },
    {
        "text": " O sea, lo puedo de alguna manera paliar de alguna forma el tema de la elegibilidad.",
        "start": 204.2,
        "end": 208.2
    },
    {
        "text": " Ahora, la eficiencia no es tan fácil, no es que le pongo un comentario a un racón más rápido.",
        "start": 208.2,
        "end": 213.2
    },
    {
        "text": " Entonces, ojo con los comentarios, tampoco hay que abusar.",
        "start": 213.2,
        "end": 217.2
    },
    {
        "text": " ¿Por qué les parece que si uno pone tipo una línea de código, un comentario,",
        "start": 217.2,
        "end": 221.2
    },
    {
        "text": " una línea de código, un comentario? Eso no es una buena práctica.",
        "start": 221.2,
        "end": 224.2
    },
    {
        "text": " ¿En torpesa de lectura?",
        "start": 224.2,
        "end": 227.2
    },
    {
        "text": " En torpesa de lectura, hace al código más elegible, ¿tabía, ¿m?",
        "start": 227.2,
        "end": 232.2
    },
    {
        "text": " Pues se mezcla el lenguaje natural con él.",
        "start": 232.2,
        "end": 234.2
    },
    {
        "text": " Y después otra cosa que a veces uno no la ve es que si una avusa de los comentarios",
        "start": 234.2,
        "end": 238.2
    },
    {
        "text": " puede pasar que después, normalmente uno va a modificar el código,",
        "start": 238.2,
        "end": 242.2
    },
    {
        "text": " un caso ordeno funciona, hace pequeñas modificaciones del código",
        "start": 242.2,
        "end": 245.2
    },
    {
        "text": " y no cambia de los comentarios.",
        "start": 245.2,
        "end": 246.2
    },
    {
        "text": " Entonces, empiezan a quedar desactualizados, inconsistentes.",
        "start": 246.2,
        "end": 250.2
    },
    {
        "text": " Entonces, es bueno comentar si funciones, procedimientos y en módulos.",
        "start": 250.2,
        "end": 254.2
    },
    {
        "text": " También como estamos, luego vamos a empezar a hacer las tareas sobre todo.",
        "start": 254.2,
        "end": 257.2
    },
    {
        "text": " Pero no tampoco ir al extremo de cada línea de código, le pongo un comentario.",
        "start": 257.2,
        "end": 261.2
    },
    {
        "text": " Eso es demasiado.",
        "start": 261.2,
        "end": 262.2
    },
    {
        "text": " Ahora, tiempo de espacio, perdón, tiempo de ejecución y espacio de almacenamiento",
        "start": 262.2,
        "end": 267.2
    },
    {
        "text": " en general también se contraponen.",
        "start": 267.2,
        "end": 269.2
    },
    {
        "text": " Lo vamos a ver en la prairie, hay que muchos algoritmos son más rápidos",
        "start": 269.2,
        "end": 273.2
    },
    {
        "text": " porque usan memoria extra.",
        "start": 273.2,
        "end": 275.2
    },
    {
        "text": " Por ejemplo, tablas para guardar cosas pre-computadas.",
        "start": 275.2,
        "end": 278.2
    },
    {
        "text": " Un ejemplo, los buscadores de internet.",
        "start": 278.2,
        "end": 281.2
    },
    {
        "text": " Cuando uno usa Google parece que todo la información del mundo",
        "start": 281.2,
        "end": 285.2
    },
    {
        "text": " estuviera en el laptop de usted o en el PC de ustedes.",
        "start": 285.2,
        "end": 288.2
    },
    {
        "text": " También es porque está indexada, porque mucha información está duplicada.",
        "start": 288.2,
        "end": 292.2
    },
    {
        "text": " La misma información también varios servidores.",
        "start": 292.2,
        "end": 294.2
    },
    {
        "text": " Se mantiene la consistencia, pero está prefirio duplicar,",
        "start": 294.2,
        "end": 297.2
    },
    {
        "text": " gastar más memoria para acceder más rápido a los datos.",
        "start": 297.2,
        "end": 300.2
    },
    {
        "text": " La memoria callés, ¿sabes lo que es una memoria callés?",
        "start": 301.2,
        "end": 303.2
    },
    {
        "text": " La memoria computadora, la memoria callés como una memoria más chiquita",
        "start": 303.2,
        "end": 307.2
    },
    {
        "text": " que la memoria principal, que si usa para guardar los datos reciente o frecuentemente usados.",
        "start": 307.2,
        "end": 313.2
    },
    {
        "text": " Porque está la tendencia que uno sigue haciendo cuentas sobre lo último que trajo.",
        "start": 313.2,
        "end": 317.2
    },
    {
        "text": " Entonces, de alguna manera prioriza duplicar esa información que está en la memoria",
        "start": 317.2,
        "end": 323.2
    },
    {
        "text": " en una memoria más rápido para acelerar el tiempo de ejecución.",
        "start": 323.2,
        "end": 327.2
    },
    {
        "text": " De ejemplo, eso vamos a ver.",
        "start": 328.2,
        "end": 330.2
    },
    {
        "text": " Entonces, ¿qué lijo?",
        "start": 330.2,
        "end": 332.2
    },
    {
        "text": " Depende el problema, uno va a querer a veces optimizar tiempo y a veces optimizar espacio.",
        "start": 332.2,
        "end": 337.2
    },
    {
        "text": " A veces logra un poquito a los dos.",
        "start": 337.2,
        "end": 340.2
    },
    {
        "text": " Muy difícil que logre los dos.",
        "start": 340.2,
        "end": 342.2
    },
    {
        "text": " Depende que voy a hacer una aplicación para un móvil, para un celular.",
        "start": 343.2,
        "end": 347.2
    },
    {
        "text": " La memoria no es tan despreciable, porque no tengo tanta memoria como un servidor.",
        "start": 347.2,
        "end": 351.2
    },
    {
        "text": " Entonces, depende un poco el contexto que es lo que vi usar.",
        "start": 351.2,
        "end": 354.2
    },
    {
        "text": " Dicho esto, dejamos los factores como el estabilidad todo, dijimos con comentarios.",
        "start": 355.2,
        "end": 358.2
    },
    {
        "text": " Tiempo espacio, dejó el espacio y me voy al tiempo.",
        "start": 358.2,
        "end": 361.2
    },
    {
        "text": " Y van a ver que también las nociones para tiempo de ejecución sirven un poquito para espacio de almacenamiento.",
        "start": 361.2,
        "end": 367.2
    },
    {
        "text": " Entonces, gano las dos en una. ¿Qué factores intervien el tiempo de ejecución en programa?",
        "start": 367.2,
        "end": 372.2
    },
    {
        "text": " Las cantidades de cosas que pido hacer el programa dice acá, como la lógica algoritmica,",
        "start": 375.2,
        "end": 378.2
    },
    {
        "text": " y teiras, igual los pasos que yo diseñé, influyen el tiempo que tardas.",
        "start": 379.2,
        "end": 384.2
    },
    {
        "text": " La cantidad de función que tiene que ver como de nuevo, la lógica de algoritmo, digamos así los pasos, ¿qué más?",
        "start": 385.2,
        "end": 390.2
    },
    {
        "text": " También, yo lo llamaría de nuevo.",
        "start": 392.2,
        "end": 395.2
    },
    {
        "text": " Pero tiene que ver con la lógica algoritmo también.",
        "start": 398.2,
        "end": 400.2
    },
    {
        "text": " Los datos de entrada, no lo mismo, el mismo algoritmo, corrolo con entrada de tamaños 10 y un etamaño 100.",
        "start": 401.2,
        "end": 407.2
    },
    {
        "text": " Va a tardar más con el tamaño más grande.",
        "start": 407.2,
        "end": 409.2
    },
    {
        "text": " Y también influyen todos los aspectos tecnológicos, donde vas a correr ese programa.",
        "start": 410.2,
        "end": 415.2
    },
    {
        "text": " Una computadora que es un core 7, un core 3, cuantas memorias tiene, ¿cómo es el compilador que traduce a instrucciones de bajos niveles optimizantes?",
        "start": 416.2,
        "end": 423.2
    },
    {
        "text": " Entonces, influye.",
        "start": 424.2,
        "end": 425.2
    },
    {
        "text": " Se parece en factores de varias clases. Pero yo la grupo acá como negrita y no negrita, ejemplos, ¿no?",
        "start": 426.2,
        "end": 431.2
    },
    {
        "text": " Que no son negrita, por ejemplo, los dos primero, antes que me digan, usan el puntero, estos dos primero, tienen que ver con factores más tecnológicos.",
        "start": 432.2,
        "end": 441.2
    },
    {
        "text": " Acá le da el calidad del código generado por el compilador, la naturaleza de rapidez, lo sé en demás.",
        "start": 442.2,
        "end": 446.2
    },
    {
        "text": " Todos los aspectos físicos del PC, ¿la bien?",
        "start": 447.2,
        "end": 449.2
    },
    {
        "text": " Y yo me voy a querer independizar de los factores tecnológicos.",
        "start": 450.2,
        "end": 452.2
    },
    {
        "text": " Quiero tener una noción, diciendo, este algoritmo es mejor que este, no importa en qué tecnología lo corras.",
        "start": 453.2,
        "end": 458.2
    },
    {
        "text": " Y una medida de magnitud, capaz que no cuantos nanosegundos, milisegundos tardas, pero si una medida magnitud, diciendo, ¿cuánto mejor es?",
        "start": 459.2,
        "end": 466.2
    },
    {
        "text": " Pero sin depender de una tecnología, ¿por qué? Porque la tecnología va cambiando y si no sería solito todo lo que veamos en una tecnología particular dentro de poco tiempo.",
        "start": 467.2,
        "end": 475.2
    },
    {
        "text": " Entonces, ¿qué no depende tanto de la tecnología? Lo que está negrita.",
        "start": 476.2,
        "end": 479.2
    },
    {
        "text": " Los datos de entrada de ese programa, el tamaño de la estructura, sobre todo, el tamaño del input, y la lógica que todo lo que me gusta,",
        "start": 480.2,
        "end": 487.2
    },
    {
        "text": " es que me dijeron a puntaba esa, ¿no? La lógica de el algoritmo, ¿cuántos pasos pusiste I, pusiste Y, o sea, ¿cómo pensaste el algoritmo? Eso es influir.",
        "start": 488.2,
        "end": 494.2
    },
    {
        "text": " Y sabemos que, por ejemplo, para ordenar, por el mismo sortida, hay muchos algoritmos que ordenan.",
        "start": 495.2,
        "end": 499.2
    },
    {
        "text": " Y siguen lógicas distintas, vamos a ver que algunos son más eficientes que otros. ¿Sabía?",
        "start": 500.2,
        "end": 505.2
    },
    {
        "text": " Entonces, algunas definiciones vamos a tratar de dar. Y voy a tratar de, primero informalmente y de a poquito, lo voy informalizando, por ejemplo, la noción de TDN.",
        "start": 506.2,
        "end": 516.2
    },
    {
        "text": " ¿Qué va a ser TDN para nosotros, dejando los aspectos tecnológicos del lado?",
        "start": 517.2,
        "end": 521.2
    },
    {
        "text": " El tiempo de ejecución de un programa con una entrada de tamaño N, ¿qué es el tamaño de entrada N?",
        "start": 522.2,
        "end": 527.2
    },
    {
        "text": " Si es un vector, será la cantidad de elementos del vector, el largo de una lista, la cantidad de nodos de un árbol, si es una matriz, pueden ser dos variables,",
        "start": 528.2,
        "end": 535.2
    },
    {
        "text": " cantidad de filas por cantidad de columnas, hay algo que tenga que ver con el tamaño del input, sobre el cual quiero hacer el procesamiento.",
        "start": 536.2,
        "end": 542.2
    },
    {
        "text": " Ticho de otra manera, a fíjense que dice igual número de instrucciones ejecutadas en un computador idealizado, o sea, ninguna tecnología particular, como diciendo si fue un contador de instrucciones. ¿Sabía?",
        "start": 543.2,
        "end": 554.2
    },
    {
        "text": " ¿Por qué? Porque vamos a ver que los algoritmos se van a expresar más o menos como funciones matemáticas, como esta, ¿no? TDN igual a C por N cuadrado, por ejemplo.",
        "start": 555.2,
        "end": 565.2
    },
    {
        "text": " ¿Qué está diciendo en palabras que el tiempo de ejecución depende del cuadrado de la entrada? Si uno lo grafica, ¿no?",
        "start": 565.2,
        "end": 572.2
    },
    {
        "text": " Los algoritmos más comunes, más simple de ordenación, conocen algunos, algún nombre de algoritmos de ordenación, seleccion sort, que busca el mínimo, lo lleva adelante y después sigue haciendo lo mismo con el resto.",
        "start": 573.2,
        "end": 584.2
    },
    {
        "text": " El BabelSort también, esos dos que dijeron tienen un tiempo de ejecución y lo vamos a ver, incluso en el proyecto y uno de estos, ese tiempo.",
        "start": 585.2,
        "end": 595.2
    },
    {
        "text": " C por N cuadrado, pero hay otros algoritmos más eficiente que también vamos a ver después, por ejemplo, hay una de más quicksort, el nombre está diciendo que es más rápido, ¿no?",
        "start": 596.2,
        "end": 606.2
    },
    {
        "text": " El quicksort, aunque no sepa como calcula lo es, el tiempo es C por N por logarimbo en base de N, te va a que tengo C por N por N, eso es N cuadrado, ¿no?",
        "start": 607.2,
        "end": 617.2
    },
    {
        "text": " Y lo te es C por N por logarimbo en base de N, ¿si? Saco lo común, me queda N versus logarimbo, pero si N fue 1,000,000, el logarimbo de 1,000,000 más o menos 20, quiere decir que el quicksort haría 20 cuando un algoritmo como un área 1,000,000 de comparaciones, por ejemplo.",
        "start": 617.2,
        "end": 633.2
    },
    {
        "text": " Yo digo, ¿no? Me quedo con el quicksort, es más rápido. Comparando esas funciones, o sea, si yo llego a determinar que un algoritmo tiene una función, digo, bueno, tenés varios algoritmos cada uno con su función, elegí la función machiquita, la que cuando el N crece, tarda menos, ¿sabes?",
        "start": 633.2,
        "end": 650.2
    },
    {
        "text": " Tiende, es por eso que digo es una área de trabajo para mucha gente de la matemática, acercarse a la algoritmica, porque justamente va a tener que ver con eso.",
        "start": 650.2,
        "end": 659.2
    },
    {
        "text": " Ahora bien, esa noción, si bien es informal, todavía es ambigua, yo les doy el vavel sort, le doy 2 input del mismo tamaño, 1,000 y 1,000, va a tardar lo mismo necesariamente para los 2 input y ese mismo algoritmo, ¿por qué puede ser que no?",
        "start": 659.2,
        "end": 678.2
    },
    {
        "text": " Depende del nivel de desorden, depende del nivel de desorden, por ejemplo, si uno ya se lo doy ordenado y el algoritmo chequea que cuando está ordenado avanza rápido y si artiteración interna no la hace, basa más rápido que si lo doy completamente desordenado.",
        "start": 678.2,
        "end": 692.2
    },
    {
        "text": " Bueno, ya vamos a ver qué es el orden y ni ahí ya va a aparecer.",
        "start": 692.2,
        "end": 697.2
    },
    {
        "text": " Entonces, una idea, ahí se empieza a complicar esto, bueno, solo depende del tamaño de la entrada, sino que datos están dentro de ese tamaño, si está todo desordenado o no están desordenado, entonces aparecen nociones para darle un poquito más precisión a eso.",
        "start": 698.2,
        "end": 712.2
    },
    {
        "text": " Una y la más usual y la que más vamos a trabajar ahora y la que más se ven los libros, es lo que se llama el peor caso.",
        "start": 712.2,
        "end": 719.2
    },
    {
        "text": " Cuando digo TDN pienso el peor caso o el tiempo de ejecución para el peor caso con el traje de tamaño en, pesimista, no diría, ¿no?",
        "start": 719.2,
        "end": 727.2
    },
    {
        "text": " Es decir, todo lo de ese diario me quedo con el peor, perdóis artesas porque puede tardar eso o menos, pero no más.",
        "start": 727.2,
        "end": 734.2
    },
    {
        "text": " Y esa es la idea, ¿sí? Cuando uno piensa en tiempos suele hacer gráficos como estos, ¿no? Dice mira, acá dibujo el TDN a medida que el N crece.",
        "start": 735.2,
        "end": 746.2
    },
    {
        "text": " Y en general estas funciones son crecientes, ¿no? Me giran mantan las más grandes N, más grandes TDN, por ejemplo sí, por N cuadrado como la dibujo.",
        "start": 746.2,
        "end": 754.2
    },
    {
        "text": " Como una parábola, ¿no? Supongamos que me salí bien, a medida que el N crece va creciendo el TDN, o sea tengo esta noción.",
        "start": 755.2,
        "end": 766.2
    },
    {
        "text": " Entonces cuando digo el peor caso, supongan que yo tengo cuatro tiempos acá, ¿vale? ¿Y o cuál es el peor caso de esto? Y bueno, si piensa en los cuatro dice este, entonces dice el peor caso es este de ahí para abajo.",
        "start": 766.2,
        "end": 780.2
    },
    {
        "text": " ¿Tabía? Van a ver porque esa va a ser una medida usual, pero a priori uno diría parece muy pesimista tomar el peor escenario, porque no tomás un promedio.",
        "start": 781.2,
        "end": 792.2
    },
    {
        "text": " Y ahí viene la noción de promedio, que en dos o tres casos en el curso lo voy a mencionar, uno se llama Haching, se usa mucho en aplicaciones de seguridad de base de datos, lo vamos a ver más adelante.",
        "start": 792.2,
        "end": 801.2
    },
    {
        "text": " Y en un tipo de árboles, pero no mucho más, unice por qué no sucede tanto el promedio. Porque el promedio no es por más que uno lo vea como justo, no es tan justo.",
        "start": 802.2,
        "end": 811.2
    },
    {
        "text": " ¿Tabía? Primero, supongan que tengo estos cuatro puntitos, ¿dónde está el promedio? Y uno diría el promedio de esta más o menos por acá, ¿también acuerdo?",
        "start": 811.2,
        "end": 820.2
    },
    {
        "text": " ¿Más arquita de los tres de esto? Pero en realidad hay tiempos por arriba, tiempo por abajo, y no tengo ninguna certeza de nada, y si hay mucha dispersión de los datos,",
        "start": 820.2,
        "end": 830.2
    },
    {
        "text": " bueno, puedo que alguna variante se preside, la dispersión estándar, es muy grande, el promedio pasa no ser tan representativo, cuando el promedio es representativo, cuando los datos están próximos entre sí.",
        "start": 830.2,
        "end": 841.2
    },
    {
        "text": " ¿Qué pasa cuando calcula el promedio normal? ¿Qué no supone su madividuos cantidad? Eso es un promedio, ¿no? ¿Pero qué pases? No son todos los datos igualmente probables.",
        "start": 842.2,
        "end": 852.2
    },
    {
        "text": " Supongo que hace un algoritmo que recibe con un input, un string que representa el nombre de una persona, para hacer algo. ¿Son todos los string igualmente probables?",
        "start": 852.2,
        "end": 864.2
    },
    {
        "text": " No, si ahora no es su lista de contactos de celular, verán que hay más apellidos que empiezan con una letra que con otra, apague con zeta, tienen con suerte uno. ¿Vean?",
        "start": 865.2,
        "end": 876.2
    },
    {
        "text": " Entonces, ¿o probabilidad que una apellido se llame zeta zeta, uniría cero, o sea esa combinación?",
        "start": 876.2,
        "end": 882.2
    },
    {
        "text": " Entonces empieza para hacer la probabilidad de ocurrencia de cosa, y ya se complica, porque no es lo mismo, y no es lo mismo, incluso en un idioma que en el otro.",
        "start": 882.2,
        "end": 890.2
    },
    {
        "text": " La HN en inglés usa mucho más que español.",
        "start": 890.2,
        "end": 893.2
    },
    {
        "text": " Exacto, pero depende de los idiomas, depende del lugar, ¿es cuáles son las combinaciones del letra? No es lo mismo, la probabilidad de ocurrencia de una letra, al comienzo, una palabra que en el medio de una palabra está estudiado.",
        "start": 896.2,
        "end": 906.2
    },
    {
        "text": " Entonces, se complica mucho, calcular promedios representativos realistas.",
        "start": 906.2,
        "end": 911.2
    },
    {
        "text": " Y no me da certeza, porque algunos tiempos están por arriba y otros por abajo. Entonces, ¿cuándo vamos a usar promedio cuando tengas zartezas?",
        "start": 912.2,
        "end": 917.2
    },
    {
        "text": " Y vamos a ver en este curso, ¿cuándo tengo zartezas? Mientras tanto, no vamos a quedar con el piercaso, que me da zarteza, vamos a ver que es mucho más fácil destimar de calcular, y eso está bueno.",
        "start": 917.2,
        "end": 928.2
    },
    {
        "text": " Rápidamente voy a saber en un algoritmo grande, ¿dónde está el problema si lo quiero optimizar, dónde te oncira, poner el foco para bajar el tiempo de gegusión?",
        "start": 928.2,
        "end": 936.2
    },
    {
        "text": " Y eso es importante, sobre todo cuando tengo programas grandes.",
        "start": 936.2,
        "end": 941.2
    },
    {
        "text": " Entonces, de acá en más, cuando le damos TDN, vamos a leer piercaso.",
        "start": 941.2,
        "end": 947.2
    },
    {
        "text": " También existe el mejor caso. Es un ejemplo, acá me decían orden, todavía no dio la definición, pero una algoritmo que recorre un poco más,",
        "start": 947.2,
        "end": 957.2
    },
    {
        "text": " es una reglo buscando un elemento, un y un for, cuando la encuentra retornatru y si llega al final no la encuentra retornatruz. ¿Cuál es el mejo?",
        "start": 957.2,
        "end": 967.2
    },
    {
        "text": " El piercaso. El piercaso que esté al final o que no esté, entonces, pase por todo el elemento, se habla también del mejor caso, que no tiene mucha aplicación para que, ¿cuál sería el mejor caso?",
        "start": 967.2,
        "end": 978.2
    },
    {
        "text": " Que es el primer. Y el pro medio uno diría en el medio. Si son todos los elementos igualmente probables, ahí tendré un ejemplo simple de esos tres escenarios.",
        "start": 979.2,
        "end": 989.2
    },
    {
        "text": " Para poder hablar de ese piercaso, esta definición la van a usar mucho. No hay muchas definiciones, pero si hay algunas que las van a usar mucho.",
        "start": 989.2,
        "end": 997.2
    },
    {
        "text": " Esta la voy a dar con tres de tres formas, para ver si empezamos a digerir. La forma cruga que la voy a leer ahora, una interpretación gráfica y una interpretación numérica.",
        "start": 998.2,
        "end": 1008.2
    },
    {
        "text": " La forma cruga leo la definición. Dice TDN, o sea el tiempo de ejecución el piercaso, ¿no? Para imputener es orden una función FDN, está cotada de alguna manera, vamos al porquí digo a cotada, con una función FDN.",
        "start": 1008.2,
        "end": 1023.2
    },
    {
        "text": " Si pasa esto, que existen dos constantes, ya vemos la C y N0, ahí está, tal es que se cumple esto. TDN es menor igual que C por FDN.",
        "start": 1023.2,
        "end": 1038.2
    },
    {
        "text": " ¿Qué está diciendo que FDN es mayor igual que TDN? Es una cota superior. También sal un factor constante. Cuando, bueno, a partir de...",
        "start": 1039.2,
        "end": 1050.2
    },
    {
        "text": " Ah, y no es tan fácil este monterón, a partir de N0 en adelante.",
        "start": 1050.2,
        "end": 1055.2
    },
    {
        "text": " ¿Tabien? Graficamente que está diciendo esto, miren ahora este dibujito de acá. Supongo que el TDN es esta curva media negra, acá no muy prolija.",
        "start": 1056.2,
        "end": 1067.2
    },
    {
        "text": " Y yo digo, mira, con ese gráfico de la función azul, que acabo de hacer que las llamo FDN, yo puedo decir en base a este dibujo que el orden de tiempo de ejecución en el piercaso de TDN es FDN.",
        "start": 1067.2,
        "end": 1081.2
    },
    {
        "text": " ¿Por qué? Porque hay un punto que lo llamo N0 a partir del cual FDN siempre está por arriba del negro, está arriba, hace una cota superior.",
        "start": 1081.2,
        "end": 1091.2
    },
    {
        "text": " Quizás no pasa en algunos valores pequeños, como acá. Pero a partir de un punto en adelante sí. Cuando digo a partir de un punto en adelante es lo que matemática se suele decir cuando vene tiendo infinito.",
        "start": 1091.2,
        "end": 1103.2
    },
    {
        "text": " Y porque el tiempo de ejecución se hace crítico cuando los enes son grandes, cuando los enes son chiquitos.",
        "start": 1103.2,
        "end": 1108.2
    },
    {
        "text": " Entonces, la noción de orden va a despreciar todo lo que sean constante valores pequeños. No, ahí no es importante el eficiencia, eso dice.",
        "start": 1108.2,
        "end": 1115.2
    },
    {
        "text": " Quiere eficiencia ahí, usa el reloj del sistema operativo para ver cuánto sale una corriga de 5 vale hora, no, no la importa nadie.",
        "start": 1116.2,
        "end": 1122.2
    },
    {
        "text": " Pero sí decime cuando yo empiece a crecer mi input con enes muy grande, como se va a comportar. Entonces, esta no se una apunta a eso, a cosas de peso.",
        "start": 1122.2,
        "end": 1131.2
    },
    {
        "text": " ¿OK?",
        "start": 1131.2,
        "end": 1132.2
    },
    {
        "text": " Una ejemplo ahora numérico de esa definición. Supóganse, no sabemos cómo, todavía hay encalculo y tiene este tdn, 13 enecuvo más 12 enecuadrado.",
        "start": 1133.2,
        "end": 1143.2
    },
    {
        "text": " Yo puedo decir a ver si se cumple que es orden y el hijo como fdn enecuvo. Para comprobarlo tengo que aplicar la definición.",
        "start": 1143.2,
        "end": 1152.2
    },
    {
        "text": " Entonces, encontrar dos constantes, acá lasamos 0 y 5 y veo que se cumple que el tdn es menor igual que la constante por la función, o sea, 5 enecuvo a partir de 0.",
        "start": 1153.2,
        "end": 1164.2
    },
    {
        "text": " Créame que con este 5 ya alcanzan para ver que esto es menor igual. O sea, ¿qué estoy diciendo? Que enecuvo es una cosa superior para toda esa expresión, 3 enecuadrado.",
        "start": 1164.2,
        "end": 1176.2
    },
    {
        "text": " También lo cumple enecuarta o enecuarta, siempre elegir fdn enecuvo, el hijo fdn como enecuarta o enecuarta.",
        "start": 1176.2,
        "end": 1184.2
    },
    {
        "text": " ¿Se cumple para este tdn que es enecuarta o enecuinta? ¿Sí? ¿Por qué?",
        "start": 1184.2,
        "end": 1190.2
    },
    {
        "text": " Sí, acá me paro. ¿Cierto o enecuarta o enecuarta?",
        "start": 1190.2,
        "end": 1203.2
    },
    {
        "text": " Más concreto, porque si ya es menor que 5 enecuvo, va a ser menor igual que 5 enecuarta o enecuarta o enecuarta o enecuinta.",
        "start": 1203.2,
        "end": 1210.2
    },
    {
        "text": " Una vez que encontrar una cota superior, todas las más grandes también sirven.",
        "start": 1210.2,
        "end": 1214.2
    },
    {
        "text": " Eso, yo me voy a querer encontrar el supremo, la cota superior mínima, pero esta definición no habla de eso, habla de ser cota superior.",
        "start": 1216.2,
        "end": 1224.2
    },
    {
        "text": " Me gustaría eso, una cota superior, voy a hacer pesimista bien, pero no tan pesimista.",
        "start": 1224.2,
        "end": 1230.2
    },
    {
        "text": " Porque si no, la estimación va a ser muy mala. ¿Se entiende? ¿Me van siguiendo hasta acá?",
        "start": 1230.2,
        "end": 1237.2
    },
    {
        "text": " Para allá, tiene que ir en el tiro, en el lado del mismo punto de la cota superior.",
        "start": 1237.2,
        "end": 1241.2
    },
    {
        "text": " Y en general, a ver si esto no vale siempre, entonces, a ver si a partir de 5, por decir algo, entonces esto más como era constante, en vez de 0, 5.",
        "start": 1241.2,
        "end": 1249.2
    },
    {
        "text": " Si esto vale siempre, a partir de 0.",
        "start": 1249.2,
        "end": 1252.2
    },
    {
        "text": " Esto si no se cumple para algún valor pequeño, en general siempre 0, se cumple siempre.",
        "start": 1253.2,
        "end": 1259.2
    },
    {
        "text": " ¿Me siguen hasta acá? ¿Sí?",
        "start": 1259.2,
        "end": 1262.2
    },
    {
        "text": " Yo lo has pedido a respetar a que si no se cumple, podríamos utilizar una derivada.",
        "start": 1262.2,
        "end": 1268.2
    },
    {
        "text": " Una derivada para que para...",
        "start": 1268.2,
        "end": 1271.2
    },
    {
        "text": " Para la verdad, la velocidad de este centro mismo es el que te den.",
        "start": 1271.2,
        "end": 1274.2
    },
    {
        "text": " Y podrías, pero te vas a complicar la vida cuando los programas son grandes.",
        "start": 1274.2,
        "end": 1279.2
    },
    {
        "text": " Estamos buscando forma de calcular simple.",
        "start": 1279.2,
        "end": 1281.2
    },
    {
        "text": " Y vas a ver que en un ratito ya te vas a dar cuenta que puedes mirar un código y saber a acá si yo bajo esto, este código mejora.",
        "start": 1281.2,
        "end": 1288.2
    },
    {
        "text": " Con cuentitas, casi de sumas, y poca cosa más.",
        "start": 1288.2,
        "end": 1292.2
    },
    {
        "text": " Justamente para que sea aplicable en modelos crecientes de código.",
        "start": 1292.2,
        "end": 1297.2
    },
    {
        "text": " ¿OK? Bien.",
        "start": 1297.2,
        "end": 1300.2
    },
    {
        "text": " Le de ahí el complemento, vamos a hacer el complemento de la idea ahí.",
        "start": 1301.2,
        "end": 1305.2
    },
    {
        "text": " Porque queríamos una cosa superior no tan grande.",
        "start": 1305.2,
        "end": 1307.2
    },
    {
        "text": " Ah, perdón, vuelo para esta, porque quería comentar algo.",
        "start": 1307.2,
        "end": 1310.2
    },
    {
        "text": " ¿Cómo se te ocurrió poner FNNNQ?",
        "start": 1310.2,
        "end": 1315.2
    },
    {
        "text": " Vamos a ver que esta forma de calcular funciona.",
        "start": 1315.2,
        "end": 1317.2
    },
    {
        "text": " Cuando sumiro el TDN, miro 13NQ y 12NQ, entonces digo, ¿Ah?",
        "start": 1317.2,
        "end": 1322.2
    },
    {
        "text": " Cuando en el 2NQ no corta ni pincha, tirarlo, porque el NQ lo va a pasar.",
        "start": 1322.2,
        "end": 1327.2
    },
    {
        "text": " Exactamente. Es como el límite. Entonces, ¿Vos de alguna más?",
        "start": 1328.2,
        "end": 1332.2
    },
    {
        "text": " Exacto.",
        "start": 1337.2,
        "end": 1339.2
    },
    {
        "text": " Exacto. Despreciéndole el factor es constante y lo que es menor te vas a quedar con la mujer ande.",
        "start": 1339.2,
        "end": 1343.2
    },
    {
        "text": " Exactamente.",
        "start": 1343.2,
        "end": 1345.2
    },
    {
        "text": " ¿Vieron que tiene alguna aplicación esas cosas?",
        "start": 1345.2,
        "end": 1348.2
    },
    {
        "text": " Un ideal dual es lo mismo pero es revés.",
        "start": 1350.2,
        "end": 1353.2
    },
    {
        "text": " En vez de llamarse orden o la vamos a usar menos, pero para entender un poco la idea,",
        "start": 1353.2,
        "end": 1357.2
    },
    {
        "text": " creo que es como complemento sirve.",
        "start": 1357.2,
        "end": 1359.2
    },
    {
        "text": " TDN es o mega una función, la vemos la GDN lo mismo que antes.",
        "start": 1359.2,
        "end": 1363.2
    },
    {
        "text": " Existen dos constantes pero ahora fíjense.",
        "start": 1363.2,
        "end": 1366.2
    },
    {
        "text": " El TDN, en vez de ser menor igual, es mayor igual.",
        "start": 1366.2,
        "end": 1369.2
    },
    {
        "text": " Que sé por GDN.",
        "start": 1369.2,
        "end": 1371.2
    },
    {
        "text": " A partir de una encerna adelante.",
        "start": 1371.2,
        "end": 1373.2
    },
    {
        "text": " Que estoy diciendo que ahora GDN, en vez de ser cotas superior, es cotas inferior.",
        "start": 1373.2,
        "end": 1378.2
    },
    {
        "text": " Graficamente o bueno ahora lo habíamos hecho en gráfico pero numericamente supongan que tengo esta.",
        "start": 1379.2,
        "end": 1385.2
    },
    {
        "text": " Yo digo que esta expresión claramente es omega en EQ.",
        "start": 1385.2,
        "end": 1389.2
    },
    {
        "text": " ¿Por qué? Porque tomo a las dos constantes mínimas, posible, 0 y 1 y veo que esto ya se cumple.",
        "start": 1389.2,
        "end": 1395.2
    },
    {
        "text": " Que 13 en EQ o madrosa en EQ es mayor igual que en EQ.",
        "start": 1395.2,
        "end": 1398.2
    },
    {
        "text": " Este es más fácil de ver todavía que esto se cumple para cualquier valor de N.",
        "start": 1398.2,
        "end": 1403.2
    },
    {
        "text": " O sea si este es una cot inferior, que otra cot inferior se les ocurriría.",
        "start": 1404.2,
        "end": 1408.2
    },
    {
        "text": " Si esta ya está demostrada que sirve en EQ o en E2, en el cuadrado, N.",
        "start": 1408.2,
        "end": 1414.2
    },
    {
        "text": " O sea una vez que encontré una cot inferior, todas las que son menores que ellas también sirven.",
        "start": 1414.2,
        "end": 1419.2
    },
    {
        "text": " Entonces apliquemos el sanguuchito.",
        "start": 1422.2,
        "end": 1424.2
    },
    {
        "text": " No se llama así pero bueno, a mí me gustaba lo como un sanguuchito diciendo,",
        "start": 1424.2,
        "end": 1428.2
    },
    {
        "text": " mira si estoy estimando un TDN como este, ¿no? Negro.",
        "start": 1429.2,
        "end": 1433.2
    },
    {
        "text": " Y yo encuentro una cotas superior y una cot inferior, pero sí más entre sí, mientras más apretadas mejor,",
        "start": 1433.2,
        "end": 1441.2
    },
    {
        "text": " mi estimación es bastante buena.",
        "start": 1441.2,
        "end": 1443.2
    },
    {
        "text": " Porque yo podría decir sin ver esta que en EQ el H en E5 es como que está muy por allá.",
        "start": 1443.2,
        "end": 1448.2
    },
    {
        "text": " Y esta vez si el H en E está muy por acá entonces digo si la tengo atrapada al TDN pero en un rango muy grande.",
        "start": 1448.2,
        "end": 1454.2
    },
    {
        "text": " Si lo tengo un rango más chiquito, mi precisión es mejor.",
        "start": 1455.2,
        "end": 1458.2
    },
    {
        "text": " Entonces si existen puntos a partir del cual no diría bueno este es tu rango de estimación.",
        "start": 1458.2,
        "end": 1464.2
    },
    {
        "text": " Mientras más chiquito mejor la estimación.",
        "start": 1464.2,
        "end": 1468.2
    },
    {
        "text": " Por ejemplo en la expresión que vimos recién esta, fíjense que teníamos omega en EQ,",
        "start": 1468.2,
        "end": 1477.2
    },
    {
        "text": " pero también teníamos una cotas superior en EQ. ¿Qué quiere decir?",
        "start": 1477.2,
        "end": 1482.2
    },
    {
        "text": " Que por arriba y por abajo está cotado por el NQ.",
        "start": 1482.2,
        "end": 1486.2
    },
    {
        "text": " Quiere decir que sal un factor constante cuando N es grande, tiene infinito, se comporta como en EQ.",
        "start": 1486.2,
        "end": 1492.2
    },
    {
        "text": " Y supongan que el NQ viene este peso de código y el N² viene este peso de código.",
        "start": 1492.2,
        "end": 1497.2
    },
    {
        "text": " Voy a optimizar uno de los dos, ¿cuál optimizo?",
        "start": 1497.2,
        "end": 1500.2
    },
    {
        "text": " El NQ, porque el N² por más que lo optimice, el que va a pesar más el NQ.",
        "start": 1501.2,
        "end": 1505.2
    },
    {
        "text": " Entonces que tengo que bajar es que está mal, que me está atrasando todo.",
        "start": 1505.2,
        "end": 1509.2
    },
    {
        "text": " Ya me va a dar pautas de cómo calcular o dónde priorizar.",
        "start": 1510.2,
        "end": 1512.2
    },
    {
        "text": " Yo lo van a ver cuando empecemos a llegar a código, todavía no.",
        "start": 1512.2,
        "end": 1515.2
    },
    {
        "text": " Bien, cuando la misma cotas supongan su función H, sirve como cotas superior y como cotas inferior,",
        "start": 1517.2,
        "end": 1527.2
    },
    {
        "text": " se dice que estita esa función, como que la estimación es exacta por arriba y por abajo de las mismas funciones.",
        "start": 1527.2,
        "end": 1535.2
    },
    {
        "text": " Es una definición muy simple. ¿Cuál de las tres o de las cuatro vamos a usar más?",
        "start": 1535.2,
        "end": 1538.2
    },
    {
        "text": " El orón del percaso.",
        "start": 1538.2,
        "end": 1540.2
    },
    {
        "text": " Y lo me gano tanto y el tita tampoco.",
        "start": 1540.2,
        "end": 1543.2
    },
    {
        "text": " Pero en el prétito como aparecen para que usted aplique la definición, se las pongo.",
        "start": 1543.2,
        "end": 1547.2
    },
    {
        "text": " El mejor caso lo puse simplemente como complemento, pero no tiene mucha aplicación práctica.",
        "start": 1549.2,
        "end": 1555.2
    },
    {
        "text": " ¿Sabía?",
        "start": 1555.2,
        "end": 1556.2
    },
    {
        "text": " El ejemplo de la regla lo dimas un ratito que es, bueno, considerar que es el primero.",
        "start": 1556.2,
        "end": 1561.2
    },
    {
        "text": " Pero el que más tiene aplicación es lo decir es el percaso.",
        "start": 1562.2,
        "end": 1566.2
    },
    {
        "text": " Para ver si vamos entendiendo y no nos perdemos.",
        "start": 1566.2,
        "end": 1570.2
    },
    {
        "text": " Solta la infisión porque después voy a pasar a calcular cosas.",
        "start": 1570.2,
        "end": 1574.2
    },
    {
        "text": " Supongan si que alguien dice o tiene un programa uno que nos sabemos cómo,",
        "start": 1574.2,
        "end": 1581.2
    },
    {
        "text": " calculó un 100 enecuadrado y un programa dos que tiene un tdn que es 5 en Eq.",
        "start": 1581.2,
        "end": 1587.2
    },
    {
        "text": " ¿Cuál elegís de los dos?",
        "start": 1588.2,
        "end": 1590.2
    },
    {
        "text": " Una respuesta natural es el depende.",
        "start": 1593.2,
        "end": 1596.2
    },
    {
        "text": " Pero si yo digo la noción de cuando en es grande van a ver que ya no depende.",
        "start": 1596.2,
        "end": 1601.2
    },
    {
        "text": " ¿Tú hay que tener cuidado? ¿Por qué digo el depende? ¿Por qué si en es más chiquito que 20?",
        "start": 1601.2,
        "end": 1606.2
    },
    {
        "text": " Como esta constante 5 es mucho más chiquita que 100.",
        "start": 1606.2,
        "end": 1610.2
    },
    {
        "text": " El programa 2 que es en Eq es más rápido.",
        "start": 1610.2,
        "end": 1614.2
    },
    {
        "text": " Pero a partir de 20 en adelante ya la diferencia de la constante se diluye",
        "start": 1614.2,
        "end": 1618.2
    },
    {
        "text": " y siempre el programa 1 es más rápido que el programa 2.",
        "start": 1618.2,
        "end": 1621.2
    },
    {
        "text": " Es decir, cuando yo pienso en el orden ya no digo depende.",
        "start": 1621.2,
        "end": 1624.2
    },
    {
        "text": " Porque los impuchiquitos no me importan.",
        "start": 1624.2,
        "end": 1626.2
    },
    {
        "text": " Digo, voy a elegir el que tiene en Eq.",
        "start": 1626.2,
        "end": 1629.2
    },
    {
        "text": " El 100 es como que se borra y el 5 que se borra.",
        "start": 1629.2,
        "end": 1632.2
    },
    {
        "text": " Entonces me queda comparar en Eq con en Eq.",
        "start": 1632.2,
        "end": 1634.2
    },
    {
        "text": " Bueno, cuando en es grande en Eq es más grande que en Eq, me quedo con en Eq.",
        "start": 1634.2,
        "end": 1639.2
    },
    {
        "text": " Ok? Otra cuestión para analizar.",
        "start": 1639.2,
        "end": 1642.2
    },
    {
        "text": " Porque en algún momento ustedes van a trabajar en una empresa",
        "start": 1642.2,
        "end": 1646.2
    },
    {
        "text": " y crean que muchas empresas no hacen lo que vamos a hacer nosotros acá",
        "start": 1646.2,
        "end": 1649.2
    },
    {
        "text": " que ya lo van a saber y van a poder aplicarlo.",
        "start": 1649.2,
        "end": 1651.2
    },
    {
        "text": " No? O super bien empresa. ¿Qué es?",
        "start": 1651.2,
        "end": 1653.2
    },
    {
        "text": " Cuando funciona lenta a las cosas, bueno, funciona bien, dice,",
        "start": 1653.2,
        "end": 1657.2
    },
    {
        "text": " vamos a comprar tecnología.",
        "start": 1657.2,
        "end": 1659.2
    },
    {
        "text": " Vamos a traer procedimientos más rápidos, vamos a comprar memoria,",
        "start": 1659.2,
        "end": 1662.2
    },
    {
        "text": " vamos a comprar, vamos a comprar discos.",
        "start": 1662.2,
        "end": 1664.2
    },
    {
        "text": " Vamos a ver ahora si es cierto que si uno programa de cualquier forma",
        "start": 1664.2,
        "end": 1668.2
    },
    {
        "text": " se despreocupa de la eficiencia, pero apuesta la tecnología,",
        "start": 1668.2,
        "end": 1671.2
    },
    {
        "text": " si eso le va a permitir resolver problemas interesante.",
        "start": 1671.2,
        "end": 1674.2
    },
    {
        "text": " ¿Entiende? ¿La respuesta va a ser? No.",
        "start": 1674.2,
        "end": 1677.2
    },
    {
        "text": " ¿La respuesta va a ser un momento de la transferencia",
        "start": 1677.2,
        "end": 1680.2
    },
    {
        "text": " sobre la comunidad de las empresas más rápidas?",
        "start": 1680.2,
        "end": 1682.2
    },
    {
        "text": " Sí, pero el mayor problema va a ser que por más que hubo apuesta de tecnología",
        "start": 1682.2,
        "end": 1688.2
    },
    {
        "text": " va a ver que no vamos a poder resolver en algunos contextos problemas interesantes.",
        "start": 1688.2,
        "end": 1692.2
    },
    {
        "text": " La tecnología no resuelve, en cambio si yo hago una mejor ineficiencia de la algoritmo,",
        "start": 1693.2,
        "end": 1697.2
    },
    {
        "text": " quizás sin comprar tecnología, ahora sí logro que sea más rápido.",
        "start": 1697.2,
        "end": 1700.2
    },
    {
        "text": " Entonces siempre va a ser primero, mirémosle eficiencia y con la eficiencia estudiada",
        "start": 1700.2,
        "end": 1704.2
    },
    {
        "text": " capaz que ahí veo si es necesario mejorar el procesamiento.",
        "start": 1704.2,
        "end": 1708.2
    },
    {
        "text": " El día por un ejemplo está tomo el libro, al final van a ver que dice capítulo",
        "start": 1708.2,
        "end": 1711.2
    },
    {
        "text": " tal de tal libro si alguien quiere leer donde están estos ejemplos,",
        "start": 1711.2,
        "end": 1714.2
    },
    {
        "text": " están disponibles, pero cómo leer esto?",
        "start": 1714.2,
        "end": 1717.2
    },
    {
        "text": " Son cuatro programas, estas cuatro gráficas,",
        "start": 1718.2,
        "end": 1721.2
    },
    {
        "text": " estas 100N5N2N2 sobre 2 y 2AN, dibujadas ahí, ¿no?",
        "start": 1721.2,
        "end": 1726.2
    },
    {
        "text": " Para cuatro programas que resuelven el mismo problema, no importa cuál es ese problema,",
        "start": 1726.2,
        "end": 1731.2
    },
    {
        "text": " pero hice la gráfica. Y ahora sí coinciden conmigo,",
        "start": 1731.2,
        "end": 1735.2
    },
    {
        "text": " siempre hay un tiempo máximo, razonable que tiene cualquier algoritmo para resolver un problema.",
        "start": 1735.2,
        "end": 1741.2
    },
    {
        "text": " Si estoy ordenando un vector y hace tres días que está corriendo el algoritmo",
        "start": 1741.2,
        "end": 1745.2
    },
    {
        "text": " para ordenar el vector uno dice no sirve, tirarlo y busca otro.",
        "start": 1745.2,
        "end": 1749.2
    },
    {
        "text": " Siempre un tiempo máximo de respuesta razonable para cualquier problema.",
        "start": 1749.2,
        "end": 1753.2
    },
    {
        "text": " ¿Tamos de acuerdo con eso?",
        "start": 1753.2,
        "end": 1755.2
    },
    {
        "text": " Bueno, supongo que sé que para este problema el tiempo máximo razonable es mil.",
        "start": 1755.2,
        "end": 1759.2
    },
    {
        "text": " No importa, son mil y seguno, no en lo segundo, mil.",
        "start": 1759.2,
        "end": 1763.2
    },
    {
        "text": " Esta línea amarilla.",
        "start": 1763.2,
        "end": 1765.2
    },
    {
        "text": " Se le pregunta ¿qué pasa cuando esta línea amarilla corta a cada una de las cuatro gráficas? ¿Qué determina acá abajo?",
        "start": 1765.2,
        "end": 1771.2
    },
    {
        "text": " ¿No? ¿Qué determina? ¿Qué? ¿Qué del input?",
        "start": 1771.2,
        "end": 1780.2
    },
    {
        "text": " El tamaño máximo del problema que pueda resolver.",
        "start": 1780.2,
        "end": 1785.2
    },
    {
        "text": " Es decir, si yo miro, por ejemplo, acá a la verde, ¿no? ¿Qué corto acá?",
        "start": 1785.2,
        "end": 1790.2
    },
    {
        "text": " Y digo, miro acá supongo que se quede 14, este valor.",
        "start": 1790.2,
        "end": 1794.2
    },
    {
        "text": " Quiere decir que yo corriendo el algoritmo, puedo correr input hasta tamaño 14.",
        "start": 1794.2,
        "end": 1798.2
    },
    {
        "text": " Si corro más grande, ya sobrepasa el límite amarillo.",
        "start": 1798.2,
        "end": 1802.2
    },
    {
        "text": " O sea que el tiempo máximo determina el máximo tamaño del problema que podrá resolver.",
        "start": 1802.2,
        "end": 1807.2
    },
    {
        "text": " ¿Dónde? ¿De acuerdo?",
        "start": 1807.2,
        "end": 1808.2
    },
    {
        "text": " Entonces, no podía decir bueno, tomemos esos cuatro algoritmos,",
        "start": 1808.2,
        "end": 1813.2
    },
    {
        "text": " el tiempo máximo que es 10 al cubo, que es mil,",
        "start": 1813.2,
        "end": 1816.2
    },
    {
        "text": " y calculemos cuál es el in, máximo que puede resolver cada uno de los cuatro.",
        "start": 1816.2,
        "end": 1820.2
    },
    {
        "text": " Y no es fácil porque uno se pregunta ¿cuándo 100 por n es igual a mil?",
        "start": 1820.2,
        "end": 1824.2
    },
    {
        "text": " ¿De especie n es 10?",
        "start": 1824.2,
        "end": 1826.2
    },
    {
        "text": " Cuando 5 en el cuadrado es igual a mil,",
        "start": 1826.2,
        "end": 1829.2
    },
    {
        "text": " raíz cuadrada de espeja más o menos 14.",
        "start": 1829.2,
        "end": 1832.2
    },
    {
        "text": " Lo mismo con n cubo sobre 2, cuando es igual a mil, de especie n, no?",
        "start": 1832.2,
        "end": 1836.2
    },
    {
        "text": " Raíz, más o menos 12, cuando 12 la n es igual a mil redondiendo 10.",
        "start": 1836.2,
        "end": 1841.2
    },
    {
        "text": " 2 a la 10 es 1.204, o sea que estoy ahí.",
        "start": 1841.2,
        "end": 1843.2
    },
    {
        "text": " ¿Ok?",
        "start": 1843.2,
        "end": 1844.2
    },
    {
        "text": " Y supone que ahora dice, no me convence esto, voy a comprar tecnología.",
        "start": 1845.2,
        "end": 1850.2
    },
    {
        "text": " Ya tengo plata, voy a gastar, me compro a todos los discos, toda la memoria.",
        "start": 1850.2,
        "end": 1854.2
    },
    {
        "text": " ¿Ah?",
        "start": 1854.2,
        "end": 1855.2
    },
    {
        "text": " Y aumento 1.000 por ciento de la velocidad de computador.",
        "start": 1855.2,
        "end": 1857.2
    },
    {
        "text": " No pasa todos los días.",
        "start": 1857.2,
        "end": 1858.2
    },
    {
        "text": " 1.000 por ciento es multiplicar por 10.",
        "start": 1858.2,
        "end": 1861.2
    },
    {
        "text": " Es como si subiera la línea amarilla 10 veces para arriba.",
        "start": 1861.2,
        "end": 1864.2
    },
    {
        "text": " Pensando que 10 veces más rapido todo va a ser que",
        "start": 1864.2,
        "end": 1869.2
    },
    {
        "text": " cualquiera de los cuatro algoritmos funcione bien ahora.",
        "start": 1869.2,
        "end": 1872.2
    },
    {
        "text": " Y volvamos a las cuentas entonces.",
        "start": 1872.2,
        "end": 1875.2
    },
    {
        "text": " Si ahora corros 10 veces, 10 al cubo para arriba, me queda 10 a la cuarta.",
        "start": 1875.2,
        "end": 1879.2
    },
    {
        "text": " Y vuelvo a hacer la cuantita ahora.",
        "start": 1880.2,
        "end": 1881.2
    },
    {
        "text": " A ver qué n puedo resolver con 100 por n cuando es igual a 10.000 n 100.",
        "start": 1881.2,
        "end": 1885.2
    },
    {
        "text": " Ah bueno, crecí, anterior a 10 ahora 100, linealmente la ganancia no diría.",
        "start": 1885.2,
        "end": 1889.2
    },
    {
        "text": " Obvio porque las funciones ni n.",
        "start": 1889.2,
        "end": 1891.2
    },
    {
        "text": " Con 5 en ecuadrado la ganancia no es tanta pero igual.",
        "start": 1891.2,
        "end": 1895.2
    },
    {
        "text": " Pasé de 14 a 45 con 320 por ciento.",
        "start": 1895.2,
        "end": 1898.2
    },
    {
        "text": " Me gananse a no tan significativa pero algo al fin.",
        "start": 1898.2,
        "end": 1903.2
    },
    {
        "text": " N cubo sobre 2 pasa de 12 a 27 y fíjense en 2 a la n.",
        "start": 1903.2,
        "end": 1906.2
    },
    {
        "text": " Pasa de 10 a 13.",
        "start": 1906.2,
        "end": 1908.2
    },
    {
        "text": " ¿Cómo dibujan un 2 a la n?",
        "start": 1908.2,
        "end": 1911.2
    },
    {
        "text": " Si parece la parabola, aquí se recién pero...",
        "start": 1911.2,
        "end": 1914.2
    },
    {
        "text": " Pero aquí se hace como la pendiente como se hace la parabola esa.",
        "start": 1917.2,
        "end": 1921.2
    },
    {
        "text": " ¿Eh?",
        "start": 1923.2,
        "end": 1924.2
    },
    {
        "text": " Más fuerte.",
        "start": 1924.2,
        "end": 1925.2
    },
    {
        "text": " Vale equivocarse.",
        "start": 1925.2,
        "end": 1926.2
    },
    {
        "text": " Sí, pero más o menos, digamos, no importa dónde empieza.",
        "start": 1930.2,
        "end": 1932.2
    },
    {
        "text": " ¿Cómo se dibuja?",
        "start": 1932.2,
        "end": 1933.2
    },
    {
        "text": " Como una cosa así, ¿no?",
        "start": 1934.2,
        "end": 1936.2
    },
    {
        "text": " Como se hace muy casi paralela este eje.",
        "start": 1936.2,
        "end": 1939.2
    },
    {
        "text": " Entonces suponense que esta es la franja amarilla, ¿no?",
        "start": 1940.2,
        "end": 1943.2
    },
    {
        "text": " Bueno, yo la dibujé ahí pero se hace más así, ¿no?",
        "start": 1943.2,
        "end": 1945.2
    },
    {
        "text": " Una cosa así.",
        "start": 1945.2,
        "end": 1947.2
    },
    {
        "text": " Y ahora digo, me paro acá y tras lado, ¿no?",
        "start": 1948.2,
        "end": 1951.2
    },
    {
        "text": " Esta ganancia no diría invertible a hasta tiempo y la tras lado a abajo.",
        "start": 1951.2,
        "end": 1956.2
    },
    {
        "text": " Lo que gane en el tamaño del problema de poder resolver es insignificante.",
        "start": 1958.2,
        "end": 1962.2
    },
    {
        "text": " Abanso mucho para arriba y abanso casi nada abajo.",
        "start": 1962.2,
        "end": 1965.2
    },
    {
        "text": " Cuando la pendiente de crecimiento es muy grande, salvo y 2 a la n es, por ejemplo, a toda reja.",
        "start": 1966.2,
        "end": 1972.2
    },
    {
        "text": " Y que hicimos el ejemplo de la clase pasada, ¿no?",
        "start": 1972.2,
        "end": 1975.2
    },
    {
        "text": " Salvo que yo cambia el algoritmo, esto no va a resolver ningún enegrande.",
        "start": 1975.2,
        "end": 1980.2
    },
    {
        "text": " Entonces, para cierto problema la tecnología no me va a ayudar.",
        "start": 1982.2,
        "end": 1985.2
    },
    {
        "text": " Había, tengo que ver cómo transforma ese programa, como luego más eficiente,",
        "start": 1986.2,
        "end": 1990.2
    },
    {
        "text": " decir de otra forma, hacer lo que no se exponencial,",
        "start": 1990.2,
        "end": 1993.2
    },
    {
        "text": " por eso que existe la área de análisis del gorismo, ¿no?",
        "start": 1993.2,
        "end": 1996.2
    },
    {
        "text": " Y si no, vamos a comprar memoria.",
        "start": 1996.2,
        "end": 1999.2
    },
    {
        "text": " Entonces, usted ya, la empresa, primero voy a hacer un análisis del gorismo,",
        "start": 1999.2,
        "end": 2002.2
    },
    {
        "text": " después te digo si hace falta comprar cosas, ¿no?",
        "start": 2002.2,
        "end": 2005.2
    },
    {
        "text": " Porque capaz que pueden hacer ajustes básicos ya está.",
        "start": 2005.2,
        "end": 2008.2
    },
    {
        "text": " Estas son algunas de las funciones o tiempos típicos que nos pueden aparecer en el curso.",
        "start": 2008.2,
        "end": 2014.2
    },
    {
        "text": " Y algunos más que otros.",
        "start": 2015.2,
        "end": 2017.2
    },
    {
        "text": " Lo mejor de la algoritmo que está en un tiempo constante, ejemplo,",
        "start": 2017.2,
        "end": 2020.2
    },
    {
        "text": " en el gorismo que está en un tiempo constante, ¿cómo se diga tiempo constante acá?",
        "start": 2020.2,
        "end": 2024.2
    },
    {
        "text": " Es así, ¿no? ¿cómo que se murió?",
        "start": 2026.2,
        "end": 2028.2
    },
    {
        "text": " Una constante, no importa el enetada, siempre lo mismo.",
        "start": 2029.2,
        "end": 2032.2
    },
    {
        "text": " ¿Qué algoritmos está en un tiempo constante?",
        "start": 2032.2,
        "end": 2034.2
    },
    {
        "text": " Unif, una asignación, un intercambio entre los valores,",
        "start": 2037.2,
        "end": 2041.2
    },
    {
        "text": " buscar el máximo entre dos, porque es unif, si es menor, retono este, si no, este otro.",
        "start": 2041.2,
        "end": 2046.2
    },
    {
        "text": " Los algoritmos básicos, todos instrucciones básicas son un tiempo constante,",
        "start": 2046.2,
        "end": 2050.2
    },
    {
        "text": " pero solo más sencillos.",
        "start": 2050.2,
        "end": 2052.2
    },
    {
        "text": " No diría nada muy sofisticado.",
        "start": 2052.2,
        "end": 2054.2
    },
    {
        "text": " Bueno, todos los algoritmos incluso una base de datos,",
        "start": 2054.2,
        "end": 2057.2
    },
    {
        "text": " que donde guarda gran información se tratan después de aproximar al tiempo constante.",
        "start": 2057.2,
        "end": 2062.2
    },
    {
        "text": " A medida que eres el ene, yo no quiero aumentar mucho el tiempo.",
        "start": 2062.2,
        "end": 2064.2
    },
    {
        "text": " Por ejemplo, ahí va a venir Haching y vamos a ver cómo se aproxima al tiempo constante,",
        "start": 2064.2,
        "end": 2068.2
    },
    {
        "text": " pero no es el peor caso, sino el promedio.",
        "start": 2068.2,
        "end": 2070.2
    },
    {
        "text": " Lo dejo pendiente y lo mover mitad de curso.",
        "start": 2070.2,
        "end": 2072.2
    },
    {
        "text": " ¿Qué es lo que viene después, mejor cosa?",
        "start": 2073.2,
        "end": 2076.2
    },
    {
        "text": " Los logarismos, sí.",
        "start": 2076.2,
        "end": 2077.2
    },
    {
        "text": " Exactamente.",
        "start": 2083.2,
        "end": 2084.2
    },
    {
        "text": " ¿Vo qué eres eso?",
        "start": 2085.2,
        "end": 2086.2
    },
    {
        "text": " A medida que eres que el ene, el TDN no crezca tanto.",
        "start": 2086.2,
        "end": 2089.2
    },
    {
        "text": " Mientras más vertical es peor, mientras más acostada es mejor.",
        "start": 2089.2,
        "end": 2093.2
    },
    {
        "text": " Mientras más constante, digamos.",
        "start": 2094.2,
        "end": 2095.2
    },
    {
        "text": " Después que le sigue como bueno,",
        "start": 2099.2,
        "end": 2101.2
    },
    {
        "text": " a ver, una búsqueda lineal,",
        "start": 2101.2,
        "end": 2104.2
    },
    {
        "text": " le buscar un elemento en un arreglo,",
        "start": 2104.2,
        "end": 2106.2
    },
    {
        "text": " dijimos que el peor caso cual era que lo encontrará al final o que no esté.",
        "start": 2106.2,
        "end": 2110.2
    },
    {
        "text": " Entonces, va a ser N comparaciones que orden va a ser.",
        "start": 2110.2,
        "end": 2113.2
    },
    {
        "text": " No importa la constante, va a decir es sorden N por las constantes de siluye,",
        "start": 2115.2,
        "end": 2118.2
    },
    {
        "text": " pero hace N comparaciones va a ser orden N.",
        "start": 2118.2,
        "end": 2121.2
    },
    {
        "text": " Hay un algoritmo más rápido de buscar.",
        "start": 2122.2,
        "end": 2124.2
    },
    {
        "text": " No, no sé si lo comentamos o el bien en un curso anterior.",
        "start": 2125.2,
        "end": 2128.2
    },
    {
        "text": " Búsqueda binaria.",
        "start": 2128.2,
        "end": 2129.2
    },
    {
        "text": " Búsqueda por hipartición,",
        "start": 2129.2,
        "end": 2131.2
    },
    {
        "text": " búsqueda di cotómica. ¿Alguna de los nombres le suena?",
        "start": 2131.2,
        "end": 2134.2
    },
    {
        "text": " Bien.",
        "start": 2136.2,
        "end": 2137.2
    },
    {
        "text": " Exacto.",
        "start": 2138.2,
        "end": 2139.2
    },
    {
        "text": " A ver, veamos intuitivamente,",
        "start": 2139.2,
        "end": 2141.2
    },
    {
        "text": " después lo vamos a ver cuando veamos recursión,",
        "start": 2141.2,
        "end": 2143.2
    },
    {
        "text": " por qué esto parece ser más eficiente.",
        "start": 2143.2,
        "end": 2145.2
    },
    {
        "text": " Si a mí me dié en un arreglo.",
        "start": 2146.2,
        "end": 2148.2
    },
    {
        "text": " Ordenado.",
        "start": 2148.2,
        "end": 2149.2
    },
    {
        "text": " Ordenado.",
        "start": 2150.2,
        "end": 2152.2
    },
    {
        "text": " Ordenado.",
        "start": 2152.2,
        "end": 2153.2
    },
    {
        "text": " Yo podría hacer la búsqueda igual que antes,",
        "start": 2153.2,
        "end": 2155.2
    },
    {
        "text": " hago mi y que recorre todos.",
        "start": 2155.2,
        "end": 2157.2
    },
    {
        "text": " Y si llevo al final y no le encontré false, si le encontré true.",
        "start": 2158.2,
        "end": 2161.2
    },
    {
        "text": " Pero va a ser N comparaciones en el peor caso, orden N.",
        "start": 2162.2,
        "end": 2165.2
    },
    {
        "text": " La búsqueda binaria dice estás buscando x.",
        "start": 2166.2,
        "end": 2168.2
    },
    {
        "text": " Bueno, anda al medio.",
        "start": 2168.2,
        "end": 2169.2
    },
    {
        "text": " No, compara ese elemento con este.",
        "start": 2170.2,
        "end": 2172.2
    },
    {
        "text": " El mejor caso sería excel.",
        "start": 2173.2,
        "end": 2174.2
    },
    {
        "text": " Bueno, supongo que no es el.",
        "start": 2175.2,
        "end": 2176.2
    },
    {
        "text": " ¿Cuántas posibilidades ahí si no x no es el?",
        "start": 2176.2,
        "end": 2178.2
    },
    {
        "text": " O es menor o es mayor.",
        "start": 2180.2,
        "end": 2182.2
    },
    {
        "text": " Pero si es menor,",
        "start": 2182.2,
        "end": 2183.2
    },
    {
        "text": " solo puede estar acá y no, ¿no?",
        "start": 2185.2,
        "end": 2188.2
    },
    {
        "text": " Si x es menor que, no tiene sentido buscar acá.",
        "start": 2188.2,
        "end": 2191.2
    },
    {
        "text": " Ahora lo tiempo si no busco ahí, porque si sé que no va a estar,",
        "start": 2193.2,
        "end": 2196.2
    },
    {
        "text": " para que vea buscar ahí.",
        "start": 2196.2,
        "end": 2197.2
    },
    {
        "text": " Y si fuera mayor al revés,",
        "start": 2197.2,
        "end": 2199.2
    },
    {
        "text": " busco de este lado, pero no de aquel.",
        "start": 2200.2,
        "end": 2202.2
    },
    {
        "text": " Supongo que en ese que dije es menor, ¿qué hago ahora?",
        "start": 2202.2,
        "end": 2204.2
    },
    {
        "text": " Vuelvo a partir en el medio.",
        "start": 2204.2,
        "end": 2206.2
    },
    {
        "text": " Y vuelvo a preguntar este elemento, ¿es él?",
        "start": 2207.2,
        "end": 2209.2
    },
    {
        "text": " Si de vuelta es no, digo, ¿Ah?",
        "start": 2210.2,
        "end": 2212.2
    },
    {
        "text": " Si es menor busca en esta primera mitad y si no, en esta segunda mitad.",
        "start": 2212.2,
        "end": 2216.2
    },
    {
        "text": " Y voy a chicando el rasgungo de búsqueda, siempre descartando mitades.",
        "start": 2217.2,
        "end": 2220.2
    },
    {
        "text": " Más o menos un elemento, mitades.",
        "start": 2220.2,
        "end": 2222.2
    },
    {
        "text": " No sé el año.",
        "start": 2224.2,
        "end": 2225.2
    },
    {
        "text": " Sí.",
        "start": 2228.2,
        "end": 2229.2
    },
    {
        "text": " Y de hecho, de ahí van a surgir después árboles,",
        "start": 2230.2,
        "end": 2231.2
    },
    {
        "text": " y se man árboles binarios de búsqueda,",
        "start": 2232.2,
        "end": 2233.2
    },
    {
        "text": " que viene a colación de lo que es la búsqueda binarios.",
        "start": 2233.2,
        "end": 2236.2
    },
    {
        "text": " Bueno, pregunta que ahora entiene.",
        "start": 2237.2,
        "end": 2239.2
    },
    {
        "text": " Es un arreglo.",
        "start": 2244.2,
        "end": 2245.2
    },
    {
        "text": " Y yo voy a la posición del medio del arreglo y pregunte, ¿sí el arreglo?",
        "start": 2246.2,
        "end": 2249.2
    },
    {
        "text": " Si el arreglo tiene sin elemento, voy a la posición 50, pregunte a che.",
        "start": 2249.2,
        "end": 2252.2
    },
    {
        "text": " El eje que estoy buscando es igual es menor o mayor a lo que tiene la arregla,",
        "start": 2252.2,
        "end": 2257.2
    },
    {
        "text": " la posición 50. Si me dice que es menor, ahora digo, mi rango de búsqueda,",
        "start": 2257.2,
        "end": 2260.2
    },
    {
        "text": " la de cero cero cero cero cincuenta.",
        "start": 2260.2,
        "end": 2262.2
    },
    {
        "text": " Si no es de cincuenta cien y vuelvo a correr la misma idea, ¿no?",
        "start": 2262.2,
        "end": 2266.2
    },
    {
        "text": " Por eso lo puedo programar muy fácil, recursivo esto.",
        "start": 2266.2,
        "end": 2269.2
    },
    {
        "text": " Ya vamos a ver que es recursivo, pero también lo puedo hacer iterativo.",
        "start": 2269.2,
        "end": 2272.2
    },
    {
        "text": " No me quiero detener ahora porque no voy a ver recursion ahora,",
        "start": 2272.2,
        "end": 2275.2
    },
    {
        "text": " pero si quiero que no te en que esto parece ser más rápido que buscar por todos.",
        "start": 2275.2,
        "end": 2279.2
    },
    {
        "text": " Pues cada vez dice esto no me interesa, ¿no?",
        "start": 2279.2,
        "end": 2282.2
    },
    {
        "text": " Si voy descartando, preguntar por mucho elemento, ¿sí me lo voy haciendo más rápido?",
        "start": 2282.2,
        "end": 2285.2
    },
    {
        "text": " Bueno, el algoritmo es después vamos a demostrar que tiene orden logarismo.",
        "start": 2286.2,
        "end": 2289.2
    },
    {
        "text": " Ir dividiendo por dos el espacio de búsqueda me lleva logarismo en baso de N,",
        "start": 2291.2,
        "end": 2295.2
    },
    {
        "text": " y multiplicando por dos me lleva dos a la N, exponencial.",
        "start": 2295.2,
        "end": 2299.2
    },
    {
        "text": " Son inversas.",
        "start": 2299.2,
        "end": 2301.2
    },
    {
        "text": " Una muy deseada, el logarismo, una muy odiada el exponencial. ¿Sabía?",
        "start": 2301.2,
        "end": 2307.2
    },
    {
        "text": " Para que tenga una idea magnitud, supongo que si usted no tiene una base de datos,",
        "start": 2307.2,
        "end": 2311.2
    },
    {
        "text": " por más que esté ordenada, un millón de registros.",
        "start": 2311.2,
        "end": 2314.2
    },
    {
        "text": " Ya podían decir, tengo dos algoritmos de búsqueda,",
        "start": 2314.2,
        "end": 2317.2
    },
    {
        "text": " uno me dijeron que es orden logarismo, y el otro es ordenin,",
        "start": 2317.2,
        "end": 2320.2
    },
    {
        "text": " porque es secuencial, es el más fácil de entender.",
        "start": 2320.2,
        "end": 2323.2
    },
    {
        "text": " Recorre todo el elemento secuencia, te lo encuentro o dice al final, ¿no?",
        "start": 2323.2,
        "end": 2327.2
    },
    {
        "text": " Es más fácil, ahora decir la claridad parece que este es más fácil,",
        "start": 2327.2,
        "end": 2331.2
    },
    {
        "text": " pero hace un millón de comparaciones, y el otro hace el logarismo en base de los 20,",
        "start": 2331.2,
        "end": 2335.2
    },
    {
        "text": " a los sumos 20, comparación en un millón de datos, me ha decisión de datos, ¿está o no está?",
        "start": 2335.2,
        "end": 2339.2
    },
    {
        "text": " Obviamente no están claro de entender como quizás el otro.",
        "start": 2339.2,
        "end": 2343.2
    },
    {
        "text": " Se van bajando a tierra algunas cosas que voy diciendo antes, ¿no?",
        "start": 2344.2,
        "end": 2348.2
    },
    {
        "text": " ¿Qué viene después?",
        "start": 2348.2,
        "end": 2349.2
    },
    {
        "text": " Los tiempos que sabemos llamar polinomiales,",
        "start": 2349.2,
        "end": 2352.2
    },
    {
        "text": " cuando digo N, N, N, el cuadrado, N, el cubo, o sea,",
        "start": 2352.2,
        "end": 2356.2
    },
    {
        "text": " lo que está arriba es una constante, no es un exponencial.",
        "start": 2356.2,
        "end": 2360.2
    },
    {
        "text": " Y lo mayor y los algoritmos que van a ver,",
        "start": 2360.2,
        "end": 2362.2
    },
    {
        "text": " en este curso pasan por ahí, por funciones polinómicas, N, N, cuadrado,",
        "start": 2362.2,
        "end": 2367.2
    },
    {
        "text": " en el medio entre N, N, cuadrado puse N, lo que N,",
        "start": 2368.2,
        "end": 2371.2
    },
    {
        "text": " porque los algoritmos de ordenación más rápido conocidos tienen este valor.",
        "start": 2371.2,
        "end": 2375.2
    },
    {
        "text": " Entonces, como vamos a ver, alguno de estos algoritmos como el Marsort,",
        "start": 2375.2,
        "end": 2378.2
    },
    {
        "text": " lo puse para distinguirlo nada.",
        "start": 2378.2,
        "end": 2380.2
    },
    {
        "text": " N, cuadrado, el selector también.",
        "start": 2380.2,
        "end": 2385.2
    },
    {
        "text": " Y al fondo de la tabla, como para el descenso tenemos las exponenciales,",
        "start": 2385.2,
        "end": 2389.2
    },
    {
        "text": " las que son intratables cuando el N crece no hay forma.",
        "start": 2389.2,
        "end": 2392.2
    },
    {
        "text": " Bien, cuando el tiempo es constante, que es el mejor tiempo posible,",
        "start": 2397.2,
        "end": 2403.2
    },
    {
        "text": " y el dibujo es esa constante que está apuesta a la roja,",
        "start": 2403.2,
        "end": 2407.2
    },
    {
        "text": " el orden se dice que es orden 1, o sea, si el tiempo es constante,",
        "start": 2407.2,
        "end": 2411.2
    },
    {
        "text": " el orden más chiquito posible es 1, o sea, la función que el hijo es el número 1,",
        "start": 2411.2,
        "end": 2416.2
    },
    {
        "text": " no fue un constante 1.",
        "start": 2416.2,
        "end": 2418.2
    },
    {
        "text": " ¿Cómo lo compreo con la definición?",
        "start": 2418.2,
        "end": 2420.2
    },
    {
        "text": " La definición dice, si vos querés ver que esto es orden 1,",
        "start": 2420.2,
        "end": 2423.2
    },
    {
        "text": " y fíjense que la definición la copia carriba, ¿no?",
        "start": 2423.2,
        "end": 2425.2
    },
    {
        "text": " Tiene que existir una C, tomo C igual a constante, y un N0,",
        "start": 2426.2,
        "end": 2430.2
    },
    {
        "text": " tomo N0 igual 0, y veo que trivialmente se cumple la desigualdad",
        "start": 2430.2,
        "end": 2434.2
    },
    {
        "text": " que tendría que ver azul, porque me queda constante,",
        "start": 2434.2,
        "end": 2436.2
    },
    {
        "text": " menor igual que constante por 1, obvio, a partir de 0.",
        "start": 2436.2,
        "end": 2440.2
    },
    {
        "text": " O sea, que si mi tiempo es constante, el orden es 1,",
        "start": 2440.2,
        "end": 2445.2
    },
    {
        "text": " y van a ver que se habla mucho de orden 1,",
        "start": 2445.2,
        "end": 2447.2
    },
    {
        "text": " y siempre todo el gorismo uno lo quiere llevar si se puede cercano el orden 1.",
        "start": 2447.2,
        "end": 2452.2
    },
    {
        "text": " Como decía ella, porque hace que el tiempo, a medida que le necrice,",
        "start": 2452.2,
        "end": 2456.2
    },
    {
        "text": " no crece tanto el TDN, ¿ok? Me sigas hasta acá.",
        "start": 2456.2,
        "end": 2462.2
    },
    {
        "text": " Bien, un poquito de paciencia llegamos a unos códigos,",
        "start": 2463.2,
        "end": 2466.2
    },
    {
        "text": " para ver cómo esto lo veo en acción, ¿no?",
        "start": 2466.2,
        "end": 2469.2
    },
    {
        "text": " Hay muchas propiedades o reglas que se usan en todo el tiempo,",
        "start": 2470.2,
        "end": 2474.2
    },
    {
        "text": " entonces vamos a ver una, les voy a manejar las trampáneas de 2 o 3,",
        "start": 2474.2,
        "end": 2478.2
    },
    {
        "text": " que son parecidas, pero no las voy a usar tanto,",
        "start": 2478.2,
        "end": 2481.2
    },
    {
        "text": " se las pueden leer.",
        "start": 2481.2,
        "end": 2482.2
    },
    {
        "text": " La ráileras sumas y susabastantes, y es cuando yo tengo dos programas,",
        "start": 2483.2,
        "end": 2486.2
    },
    {
        "text": " T1DN, y el otro tiene un tiempo, T2DN, y uno tiene un orden,",
        "start": 2487.2,
        "end": 2490.2
    },
    {
        "text": " ya me voy a ver lo F1 y el otro un orden F2.",
        "start": 2490.2,
        "end": 2493.2
    },
    {
        "text": " Entonces la pregunta es ¿qué pasa cuando sumo los tiempos?",
        "start": 2493.2,
        "end": 2495.2
    },
    {
        "text": " Sumo el tiempo el primer programa, más el tiempo del segundo programa.",
        "start": 2496.2,
        "end": 2499.2
    },
    {
        "text": " En qué contexto hay varios, contexto en el cual yo podría querer sumar",
        "start": 2499.2,
        "end": 2502.2
    },
    {
        "text": " tiempos dos programas, cuando, ¿ok?",
        "start": 2502.2,
        "end": 2503.2
    },
    {
        "text": " Por ejemplo, ¿eh?",
        "start": 2503.2,
        "end": 2505.2
    },
    {
        "text": " Cuando uno es un subprograma del otro, pues ejecuta,",
        "start": 2506.2,
        "end": 2508.2
    },
    {
        "text": " pero más que su programa cuando, ¿por otro?",
        "start": 2508.2,
        "end": 2511.2
    },
    {
        "text": " De ejecutas en el tiempo caso, 1 o el otro.",
        "start": 2511.2,
        "end": 2514.2
    },
    {
        "text": " 1 o el otro, o 1 continuación del otro, cuando uno dice esto,",
        "start": 2514.2,
        "end": 2517.2
    },
    {
        "text": " punto y coma esto, es el tiempo de uno, más el tiempo del otro.",
        "start": 2517.2,
        "end": 2520.2
    },
    {
        "text": " Exacto, que llama a 1 vuelve y llama exacto.",
        "start": 2523.2,
        "end": 2527.2
    },
    {
        "text": " La pregunta es ¿cómo se comporta el orden cuando sumo los tiempos?",
        "start": 2528.2,
        "end": 2531.2
    },
    {
        "text": " Lo que dice este regla que en realidad es un teorema,",
        "start": 2531.2,
        "end": 2534.2
    },
    {
        "text": " que cuando sumo los tiempos, el orden es la peor de las dos funciones,",
        "start": 2535.2,
        "end": 2538.2
    },
    {
        "text": " el máximo, en 3 y 1 y F2.",
        "start": 2538.2,
        "end": 2541.2
    },
    {
        "text": " Por ejemplo, si tuviera tres códigos, estos tres,",
        "start": 2541.2,
        "end": 2544.2
    },
    {
        "text": " uno que es N cuadrado, otro N cuadrado y otro N lo viene",
        "start": 2544.2,
        "end": 2547.2
    },
    {
        "text": " y los pongo los tres en secuencia, con punto y coma, punto y coma,",
        "start": 2547.2,
        "end": 2551.2
    },
    {
        "text": " el orden del pieur caso, ¿cuál es?",
        "start": 2551.2,
        "end": 2553.2
    },
    {
        "text": " N cuadrado. Y eso fingen seguir, si no se freno un ratito acá,",
        "start": 2555.2,
        "end": 2558.2
    },
    {
        "text": " me das muchas herramientas.",
        "start": 2558.2,
        "end": 2560.2
    },
    {
        "text": " Un bloque grande del código N cuadrado, el otro N cubo,",
        "start": 2561.2,
        "end": 2565.2
    },
    {
        "text": " el otro N lo viene.",
        "start": 2565.2,
        "end": 2567.2
    },
    {
        "text": " Si yo, primero que me da herramienta para decir,",
        "start": 2567.2,
        "end": 2569.2
    },
    {
        "text": " entonces puedo calcular por pedazos, ve que hay que ir a todos juntos,",
        "start": 2569.2,
        "end": 2572.2
    },
    {
        "text": " entonces es más fácil calcular pedacitos.",
        "start": 2572.2,
        "end": 2574.2
    },
    {
        "text": " Bien, eso es una herramienta, puedo descomponer la forma de cálculo,",
        "start": 2574.2,
        "end": 2577.2
    },
    {
        "text": " en pedazos.",
        "start": 2577.2,
        "end": 2579.2
    },
    {
        "text": " Pero además, si yo sé que tengo estos tres bloque y el orden es N cubo",
        "start": 2579.2,
        "end": 2584.2
    },
    {
        "text": " y ahora quiero optimizar esto, a ver, ¿dónde pongo el foco?",
        "start": 2584.2,
        "end": 2587.2
    },
    {
        "text": " ¿Dónde pondría el énfasis para mejorar la ejecución de los tres códigos?",
        "start": 2587.2,
        "end": 2592.2
    },
    {
        "text": " Y el N cubo, porque si yo digo, ¿dónde voy a mejorar este N lo viene?",
        "start": 2592.2,
        "end": 2596.2
    },
    {
        "text": " Mejorarlo todo lo que quiera, pero si lo va a ejecutar en secuencia con N cubo,",
        "start": 2596.2,
        "end": 2600.2
    },
    {
        "text": " se lo come.",
        "start": 2600.2,
        "end": 2601.2
    },
    {
        "text": " Se puede mejorar el que es peor, en este caso, el N cubo,",
        "start": 2601.2,
        "end": 2604.2
    },
    {
        "text": " porque ahí sí, cuando los pongo en secuencia,",
        "start": 2604.2,
        "end": 2606.2
    },
    {
        "text": " si el N cubo baja, va a bajar todo.",
        "start": 2606.2,
        "end": 2609.2
    },
    {
        "text": " Entonces, me dice dónde mirar, ¿tabien?",
        "start": 2609.2,
        "end": 2612.2
    },
    {
        "text": " Cuando yo quiero optimizar.",
        "start": 2612.2,
        "end": 2613.2
    },
    {
        "text": " Y eso va a anabar que ya en breve lo voy a poner en práctica.",
        "start": 2613.2,
        "end": 2616.2
    },
    {
        "text": " Bien, esta se la dejo para que le hable, no la voy a demorar.",
        "start": 2616.2,
        "end": 2623.2
    },
    {
        "text": " Como le digo, estos son definiciones, si no tiene propiedades que lo que son teoremas,",
        "start": 2623.2,
        "end": 2630.2
    },
    {
        "text": " teoremas que tiene hipótesis y tesis, esto lo que está diciendo la regla 1 y diciendo",
        "start": 2630.2,
        "end": 2635.2
    },
    {
        "text": " mira, hipótesis 1, que T1 es órdenes 1 de N, por definición esto,",
        "start": 2635.2,
        "end": 2639.2
    },
    {
        "text": " existen constantes y bladrelas.",
        "start": 2639.2,
        "end": 2641.2
    },
    {
        "text": " Que este 2 se ordene ferodene de nuevo por las definiciones esto.",
        "start": 2641.2,
        "end": 2646.2
    },
    {
        "text": " Existen constantes bladrelas.",
        "start": 2646.2,
        "end": 2648.2
    },
    {
        "text": " La tesis cual es que la suma de los TDN de T1 y T2 es orden la máxima.",
        "start": 2648.2,
        "end": 2655.2
    },
    {
        "text": " Por definición, tengo que ver que se cumple que existen constantes y hacer la desigualdad.",
        "start": 2655.2,
        "end": 2660.2
    },
    {
        "text": " Mírenlo, ¿vale?",
        "start": 2660.2,
        "end": 2663.2
    },
    {
        "text": " Hay un bosquejo de la prueba hecha, no me quiero detener acá,",
        "start": 2663.2,
        "end": 2665.2
    },
    {
        "text": " porque quiero ir a código, ¿vale?",
        "start": 2665.2,
        "end": 2667.2
    },
    {
        "text": " Si alguien tiene duda, me pregunta por el foro.",
        "start": 2667.2,
        "end": 2670.2
    },
    {
        "text": " El teórico de este tema, creo que lo van a entender igual,",
        "start": 2670.2,
        "end": 2673.2
    },
    {
        "text": " y van a ver que es muy simple a veces demostrar, porque son máximos y sumas y no hay más que eso.",
        "start": 2673.2,
        "end": 2679.2
    },
    {
        "text": " ¿Vas? ¿Por qué lo pongo? Porque quiero que entiendan que esta no son reglas impuestas,",
        "start": 2679.2,
        "end": 2684.2
    },
    {
        "text": " son teoremas de demuestras, si yo no lo puedo demostrar, no vale.",
        "start": 2684.2,
        "end": 2688.2
    },
    {
        "text": " No son recetas de cocina, también son cosas que yo tengo que poder justificar con las definiciones que tenemos.",
        "start": 2688.2,
        "end": 2693.2
    },
    {
        "text": " Esta se justifica con lo cual la puedo aplicar y la voy a aplicar mucho.",
        "start": 2693.2,
        "end": 2697.2
    },
    {
        "text": " Bien, hay otras, por ejemplo, cuando sumo, pero ya no los TDN,",
        "start": 2698.2,
        "end": 2705.2
    },
    {
        "text": " sino sumo funciones dentro de un orden, esto es lo mismo que en este caso N cuadrado,",
        "start": 2705.2,
        "end": 2711.2
    },
    {
        "text": " o sea, si un es más grande que la otra, la más grande se come la machiquita cuando N tiene finito.",
        "start": 2711.2,
        "end": 2716.2
    },
    {
        "text": " O sea, de nuevo, prioriza. Esto es como la noción de peor caso prioriza de todo lo que tenés y eso está bueno,",
        "start": 2716.2,
        "end": 2722.2
    },
    {
        "text": " un código por tener montón de cosas y simple, el foco está donde, ¿qué es lo peor?",
        "start": 2722.2,
        "end": 2727.2
    },
    {
        "text": " Y además, cuando quiero optimizar, voy ahí a donde es lo peor.",
        "start": 2727.2,
        "end": 2731.2
    },
    {
        "text": " ¿Vas bien? La regla del producto no la voy a leer, porque la pueden leer solo y además no la voy a aplicar.",
        "start": 2731.2,
        "end": 2737.2
    },
    {
        "text": " ¿Vas bien? Pero cuando en el espacio tiene sentido multiplicar,",
        "start": 2737.2,
        "end": 2740.2
    },
    {
        "text": " en vez de sumar los TDN.",
        "start": 2740.2,
        "end": 2743.2
    },
    {
        "text": " Al mismo tiempo, no, si ejecuto dos programas al mismo tiempo como paralelismo, ¿cuál es el tiempo total?",
        "start": 2745.2,
        "end": 2751.2
    },
    {
        "text": " No es un producto. ¿Se ejecutan en paralelo?",
        "start": 2751.2,
        "end": 2756.2
    },
    {
        "text": " El que tarda más, es el máximo también.",
        "start": 2756.2,
        "end": 2760.2
    },
    {
        "text": " Pero sí, puede ser, por ejemplo, un for de un otro for.",
        "start": 2760.2,
        "end": 2768.2
    },
    {
        "text": " Porque ahí sí, un is el for interno se hace tantas veces como el for externo se multiplican.",
        "start": 2768.2,
        "end": 2773.2
    },
    {
        "text": " Vamos a ver cómo calcular esos casos pero no aplicando la regla del producto sino haciendo un wild,",
        "start": 2773.2,
        "end": 2780.2
    },
    {
        "text": " una sumatoria, ¿qué es más fácil que trabajar con productos?",
        "start": 2780.2,
        "end": 2785.2
    },
    {
        "text": " Bueno, llegamos a la parte donde vamos a ver, entonces, algunas asignaciones básicas,",
        "start": 2785.2,
        "end": 2790.2
    },
    {
        "text": " una instrucción básica para poder calcular el tiempo del peor caso.",
        "start": 2790.2,
        "end": 2794.2
    },
    {
        "text": " Ejemplos, lo mejor es tiempo constante. ¿Qué me da un tiempo constante?",
        "start": 2794.2,
        "end": 2797.2
    },
    {
        "text": " Una asignación, una lectura, una escritura, la acceso de la posición de la regla.",
        "start": 2797.2,
        "end": 2801.2
    },
    {
        "text": " Todo lo básico es tiempo constante y dijimos que el tiempo constante era orden 1.",
        "start": 2801.2,
        "end": 2806.2
    },
    {
        "text": " Es el mejor. ¿Vas bien?",
        "start": 2806.2,
        "end": 2809.2
    },
    {
        "text": " Se hago el swap de dos variables, como es el código del swap de dos variables X y y de los valores que tienen X y.",
        "start": 2809.2,
        "end": 2816.2
    },
    {
        "text": " Son típicamente tres asignaciones usando una variable extra. ¿También, ¿de acuerdo?",
        "start": 2816.2,
        "end": 2822.2
    },
    {
        "text": " ¿Qué tiempo tardar a eso?",
        "start": 2822.2,
        "end": 2825.2
    },
    {
        "text": " Una constante, más una constante, más una constante. ¿Qué son las sumas de tres constante?",
        "start": 2825.2,
        "end": 2829.2
    },
    {
        "text": " Constante. ¿Tres? Cuando yo sume constante, pienso que todo es constante.",
        "start": 2829.2,
        "end": 2832.2
    },
    {
        "text": " Por más que si no aparece algo que depende del tamaño de la entrada, por más que sean 25 constante, es constante.",
        "start": 2833.2,
        "end": 2838.2
    },
    {
        "text": " Y cuando en el infinito se va. ¿También? ¿Qué pasa con una secuencia?",
        "start": 2838.2,
        "end": 2845.2
    },
    {
        "text": " Código, punticoma, código. El tiempo total dijimos que es la sumar y el orden lo acabamos de ver.",
        "start": 2845.2,
        "end": 2853.2
    },
    {
        "text": " La regla es la suma, se crea con la peor de las dos. Si tengo dos codios punticoma y este tiene un orden y este tiene teoría.",
        "start": 2853.2,
        "end": 2861.2
    },
    {
        "text": " El peor de los dos. ¿Qué pasa con denunif? O sea un código condicional.",
        "start": 2861.2,
        "end": 2866.2
    },
    {
        "text": " Ponga en el peor caso. ¿Qué es el peor escenario para que se ejecute este if?",
        "start": 2866.2,
        "end": 2872.2
    },
    {
        "text": " ¿Lif condición sentencia? ¿Qué es lo peor que puede pasar, salo?",
        "start": 2872.2,
        "end": 2876.2
    },
    {
        "text": " ¿Pero el peor caso?",
        "start": 2876.2,
        "end": 2879.2
    },
    {
        "text": " ¿Pero caso?",
        "start": 2879.2,
        "end": 2882.2
    },
    {
        "text": " Per caso que se cumpla. Porque entonces si se cumple la condición, tengo que ejecutar la sentencia.",
        "start": 2882.2,
        "end": 2886.2
    },
    {
        "text": " El mejor caso sería que no se cumple la condición, entonces me salo de ejecutar la sentencia.",
        "start": 2886.2,
        "end": 2891.2
    },
    {
        "text": " El peor caso que va a decir es el tiempo de valor a la condición más el tiempo ejecutar la sentencia como si fueran de nuevo dos cosas en secuencia.",
        "start": 2891.2,
        "end": 2899.2
    },
    {
        "text": " Evalor a la condición y ejecutar la sentencia. ¿Qué voy a aplicar como orden? La suma.",
        "start": 2899.2,
        "end": 2904.2
    },
    {
        "text": " El máximo. Me quedo con la peor de las dos. ¿Y si tengo un L?",
        "start": 2904.2,
        "end": 2909.2
    },
    {
        "text": " Ahí sí. El tiempo cual es el tiempo de la condición más que las dos no se van a ejecutar sentencia unos sentencia dos.",
        "start": 2910.2,
        "end": 2920.2
    },
    {
        "text": " ¿No voy a empezar a recoger la sentencia?",
        "start": 2920.2,
        "end": 2923.2
    },
    {
        "text": " De nuevo. Peor caso es la peor de las dos, la que tarde más. Ahora les me mostro un ejemplo de eso.",
        "start": 2923.2,
        "end": 2927.2
    },
    {
        "text": " Entonces como es la suma de tres básicamente voy a estar la regla de la suma pero ahora en vez de entre dos entre tres.",
        "start": 2927.2,
        "end": 2932.2
    },
    {
        "text": " O sea que la regla de la suma no solo le aplico en secuencia sino también en condiciones.",
        "start": 2932.2,
        "end": 2936.2
    },
    {
        "text": " Porque el peor caso me lleva a decir se va a ejecutar igual. ¿Qué pasa cuando tengo un ciclo, un repeat, un for, un wa, el dependiendo del lenguaje?",
        "start": 2936.2,
        "end": 2947.2
    },
    {
        "text": " ¿No? ¿Cuánto tarde a ejecutar su un iteración? Y no iría el tiempo de la primera iteración más el tiempo de la suma de la primera iteración más el tiempo hasta que termine.",
        "start": 2947.2,
        "end": 2957.2
    },
    {
        "text": " Entonces es la suma de la suma de la forma de ejecutar el cuerpo más el tiempo que lleve valor a la condición.",
        "start": 2957.2,
        "end": 2964.2
    },
    {
        "text": " La suma sobre todas las iteraciones del ciclo y ese cual son todas las iteraciones del ciclo y bueno si el for va de 0 a n, ese es el rango.",
        "start": 2964.2,
        "end": 2974.2
    },
    {
        "text": " ¿Ve bien? Del tiempo que lleve valor a la condición naturalmente o normalmente el tiempo de valor a una condición de salión wild suele 0 en 1.",
        "start": 2974.2,
        "end": 2982.2
    },
    {
        "text": " Es una combinación si x es menor que n. Pero si para salir o no, eso ya es una función que tiene un orden n, entonces ya de valor a la condición es hora de n.",
        "start": 2982.2,
        "end": 2992.2
    },
    {
        "text": " ¿Ve bien? A menudo puedo despreciar dos factores constantes, puedo decir que en vez de hacer la sumatoria podría decir que es el tiempo del mayor parte del cuerpo por la cantidad de iteraciones, es como me pongo más pesimista todavía.",
        "start": 2993.2,
        "end": 3006.2
    },
    {
        "text": " He dicho el peor escenario para el cuerpo de esa iteración y lo multiplico por la cantidad de iteraciones.",
        "start": 3006.2,
        "end": 3012.2
    },
    {
        "text": " Si te lo entero, lo que está dentro. ¿Ve bien?",
        "start": 3013.2,
        "end": 3017.2
    },
    {
        "text": " Y porque yo, si estaras siempre lo mismo adentro es correcto eso, es decir lo que está dentro por la candidación.",
        "start": 3017.2,
        "end": 3023.2
    },
    {
        "text": " Ahora si lo que está dentro depende de cosas, tomar el peor es un poco pesimista, demás.",
        "start": 3023.2,
        "end": 3029.2
    },
    {
        "text": " Entonces vamos a ver cuando puedo no ser tan pesimista por demás.",
        "start": 3029.2,
        "end": 3034.2
    },
    {
        "text": " Última introducción básica, así pasamos a ver códigos. Cuando tengo llamadas invocaciones que por acá dijeron hace un ratito a funciones, procedimiento, módulos auxiliares, ¿Ve bien?",
        "start": 3035.2,
        "end": 3047.2
    },
    {
        "text": " Eso es lo que está tratando de simbolizar este dibujito, ¿no? Ejecuto el código P1 en un momento ya más un método auxiliar P2, empiece a ejecutar P2, llamo P3, pero supongamos que no es recursión. ¿Ve bien? ¿Ve bien?",
        "start": 3047.2,
        "end": 3061.2
    },
    {
        "text": " Esto tiene importas. No hay una flechita que vuelve para tan, este no llama a sí mismo ni este llama para atrás, eso es que no haya recursión.",
        "start": 3061.2,
        "end": 3068.2
    },
    {
        "text": " O sea, si pienso que los dibujitos son así que este llama, llama, llama, llama hasta que un momento nadie ya no llama más, ¿cómo calcula el tiempo y el orden?",
        "start": 3068.2,
        "end": 3076.2
    },
    {
        "text": " Y parece que lo más simple, yo quiero el principal, ¿no? ¿Qué es el P1 ahí?",
        "start": 3076.2,
        "end": 3081.2
    },
    {
        "text": " ¿Qué es el final de orden? ¿Ese todo?",
        "start": 3081.2,
        "end": 3084.2
    },
    {
        "text": " Es exacto, pero por cuál empezaría a calcular? Por este, ¿no? El que no depende nadie, el calculo este si me dicen esto es orden N, vengo y le inyecto acá.",
        "start": 3084.2,
        "end": 3094.2
    },
    {
        "text": " Ay, qué horribile, ese es también otra más al campeorez. Le inyecto acá, si esto me dio orden N, pienso ahora que esta introducción tardar de orden N, calculo este.",
        "start": 3094.2,
        "end": 3101.2
    },
    {
        "text": " Y lo que me de esto, le inyecto acá. Y ahora calculo esto. O sea, empiezo que no depende nadie y lo voy metiendo dentro de lo que vas amando hasta que calculo el principal.",
        "start": 3101.2,
        "end": 3110.2
    },
    {
        "text": " ¿Ve bien?",
        "start": 3112.2,
        "end": 3113.2
    },
    {
        "text": " Bueno, ¿qué es el principal de orden N? No, directamente reemplazo, porque está bien la pregunta. ¿Cuándo voy?",
        "start": 3114.2,
        "end": 3124.2
    },
    {
        "text": " Supongo que esta es un llamado a este, si este tarda orden N, el llamado en sí es una constante. Por eso digo reemplazo, el orden N, ahí.",
        "start": 3124.2,
        "end": 3132.2
    },
    {
        "text": " ¿Por qué la constante? Sacala, no, no influye.",
        "start": 3132.2,
        "end": 3136.2
    },
    {
        "text": " La bien, o sea, ni siquiera la multiplico, la saco y digo pongo este orden ahí.",
        "start": 3136.2,
        "end": 3140.2
    },
    {
        "text": " Si el pedó fuera constante, todo el pedó fuera constante.",
        "start": 3146.2,
        "end": 3150.2
    },
    {
        "text": " No, para, para. Si el P3 es orden N, el pedócio no puede ser constante, porque una línea del P2 es algo que tardar orden N.",
        "start": 3153.2,
        "end": 3162.2
    },
    {
        "text": " Ah, si todo el resto de P2 es constante, todo esto pasa a ser orden N, porque esa línea P3 llamando tardar orden N.",
        "start": 3163.2,
        "end": 3172.2
    },
    {
        "text": " Bueno, llegamos al primer punto donde quiero que estén parados y llegamos bien, una hora, me queda un rato todavía.",
        "start": 3176.2,
        "end": 3182.2
    },
    {
        "text": " Para ver varios ejemplos y ponernos en práctica esto. Miren estos dos cachos de códigos, suponiendo que están las variables tan declaradas en algún lado.",
        "start": 3182.2,
        "end": 3190.2
    },
    {
        "text": " El primero es un for y tera de 0 a Nm1, ¿no?",
        "start": 3191.2,
        "end": 3195.2
    },
    {
        "text": " Imprime en la pantalla lo que tiene una matriz A, fila y columna A.",
        "start": 3196.2,
        "end": 3201.2
    },
    {
        "text": " Suponiendo que las posiciones son válidas ¿no? ¿Qué está haciendo en palabras?",
        "start": 3202.2,
        "end": 3207.2
    },
    {
        "text": " Imprime la diagonal y la primera posición que imprime la diagonal.",
        "start": 3209.2,
        "end": 3212.2
    },
    {
        "text": " O sea, imprime en qué sentido la diagonal. 0, 0, 1, 2, ¿no?",
        "start": 3214.2,
        "end": 3218.2
    },
    {
        "text": " Exacto. Miren el segundo código. Un for de 0 a Nm1, un for de j de 0 a Nm1, si es igual a j, imprime fila y columna J.",
        "start": 3219.2,
        "end": 3231.2
    },
    {
        "text": " ¿Qué hace este? La misma. O sea, si yo digo un usuario y pongo estos dos códigos con francajitas negra, él no ven ninguna diferencia, porque va a ver que sale impreso exactamente lo mismo.",
        "start": 3233.2,
        "end": 3245.2
    },
    {
        "text": " ¿Tamos de acuerdo? Sí. Pero ahora ya tenemos una hora de Nm1, había nosotros, digo, y puede decir, hacen lo mismo, pero no son igualmente fiscientes.",
        "start": 3246.2,
        "end": 3257.2
    },
    {
        "text": " Esta cajita que está acá, ¿qué tiempo tiene y qué orden tiene para ustedes? ¿Cuánto tarde? ¿Este, print F, etc.?",
        "start": 3259.2,
        "end": 3265.2
    },
    {
        "text": " Todo esto es constante, una constante acceder una posición de la matriz, imprime en la pantalla, o sea, todo esto ordene una entonces.",
        "start": 3266.2,
        "end": 3273.2
    },
    {
        "text": " Pero esto se hace Nm1, por constantes, ¿no?",
        "start": 3273.2,
        "end": 3279.2
    },
    {
        "text": " La constante no me importa, entonces ¿qué ordenes esto? Orden Nm. Y el segundo, miren esta cajita, la cajita de Lif. ¿Qué orden tiene todo esto?",
        "start": 3280.2,
        "end": 3290.2
    },
    {
        "text": " La cajita. Todo esto es orden 1, hay más constante que arriba sí, pero sumar más constante sigue siendo orden 1.",
        "start": 3293.2,
        "end": 3300.2
    },
    {
        "text": " Esto se hace con el forjota Nvc, con lo cual todo este pedazo que ordenes N, pero esto se hace Nvc acá arriba, multiplica N2.",
        "start": 3301.2,
        "end": 3312.2
    },
    {
        "text": " Entonces ahora tengo N y N2, entonces digo cuál elegís, y esa es la decisión que yo quería desde el comienzo de la clase, ¿no?",
        "start": 3312.2,
        "end": 3320.2
    },
    {
        "text": " Tengo 2 algoritmos, 2 tasa de crecimiento, 1 es una recta, la otra es una parábola, ¿no?",
        "start": 3320.2,
        "end": 3325.2
    },
    {
        "text": " Cuando N tiende a grinfinito lo puedes ver, es más, el que sí, incrédulo.",
        "start": 3326.2,
        "end": 3329.2
    },
    {
        "text": " Estaba gestirando normal.",
        "start": 3331.2,
        "end": 3332.2
    },
    {
        "text": " ¿Incédulo? Tome su computadora con la tecnología que sega.",
        "start": 3334.2,
        "end": 3338.2
    },
    {
        "text": " Elija 20 puntitos de N, distinto, ¿no? N5, N10, N15, Nv, ¿no?",
        "start": 3339.2,
        "end": 3344.2
    },
    {
        "text": " Una rey lo de ese tamaño, una matriz de ese tamaño, ¿no?",
        "start": 3345.2,
        "end": 3348.2
    },
    {
        "text": " Y después use la instrucción del sistema operativo para medir el tiempo que usó en una corrida que se frena cuando para,",
        "start": 3349.2,
        "end": 3355.2
    },
    {
        "text": " y para cada corrida del primer programa vean cuál es el TDN, y después grafiquen esos 20 puntitos que les dio, van a ver que les va a quedar una recta.",
        "start": 3356.2,
        "end": 3363.2
    },
    {
        "text": " Se van a unir en una recta.",
        "start": 3364.2,
        "end": 3366.2
    },
    {
        "text": " Si hacen el segundo código, los n están suficientemente separados, están muy pequeños, capas que no se ve tanto a la pancita, van a ver que les va a dar una parábola.",
        "start": 3367.2,
        "end": 3374.2
    },
    {
        "text": " Cuando los unen, los tiempos de los 20 puntos ya no es una recta, o sea que empíricamente se compreva lo que yo le digo, que no importa la tecnología, uno va a ser una recta y lo trouba a una parábola.",
        "start": 3375.2,
        "end": 3385.2
    },
    {
        "text": " ¿Y no se puede hacer el más claro o la...?",
        "start": 3386.2,
        "end": 3388.2
    },
    {
        "text": " Sí, lo podás hacer más claro.",
        "start": 3388.2,
        "end": 3389.2
    },
    {
        "text": " No sé, ahí como para acceder a la... del tiempo de ficución del sistema operativo, pero de tener llamadas a instrucciones del sistema operativo,",
        "start": 3390.2,
        "end": 3398.2
    },
    {
        "text": " porque lo que necesitas es el tiempo de una corrida, eso es lo que brisa.",
        "start": 3398.2,
        "end": 3400.2
    },
    {
        "text": " ¿Con las derivadas...?",
        "start": 3408.2,
        "end": 3409.2
    },
    {
        "text": " No, nunca vamos a derivar acá.",
        "start": 3410.2,
        "end": 3412.2
    },
    {
        "text": " ¿Sabían? Es la idea sí, está basada en eso, como en el límite y buscarlo, la función pegada.",
        "start": 3413.2,
        "end": 3419.2
    },
    {
        "text": " Es como que tampoco, cuando yo voy a calcular iteraciones, nunca había que integrar, pero vos podés pensar que la sumatoria es la base de la integración.",
        "start": 3419.2,
        "end": 3427.2
    },
    {
        "text": " Y ese esto también, la forma discreta es lo que estoy aplicando de es como una derivada.",
        "start": 3428.2,
        "end": 3432.2
    },
    {
        "text": " ¿Sabían? Entonces para calcular la pendiente y la menor tasa de crecimiento.",
        "start": 3433.2,
        "end": 3436.2
    },
    {
        "text": " Pero no vamos a aplicar nideribadas ni integrales, nada eso, no me hace falta.",
        "start": 3437.2,
        "end": 3442.2
    },
    {
        "text": " Mira en este código, a ver, este es un procedimiento, NM2 igual serán palabras que está haciendo, que está diciendo que sea par.",
        "start": 3442.2,
        "end": 3450.2
    },
    {
        "text": " Si N es par hace primera cajita y si N es sin par hace segunda cajita.",
        "start": 3450.2,
        "end": 3454.2
    },
    {
        "text": " Primera cajita, en primer que cosa.",
        "start": 3455.2,
        "end": 3457.2
    },
    {
        "text": " La idea honesta, según la cajita, si es sin par, lo mismo, el usuario de afuera de lo mismo.",
        "start": 3457.2,
        "end": 3469.2
    },
    {
        "text": " ¿Por qué es si es tan seguro? Juega la primera posición que imprime de la matriz este cajita.",
        "start": 3474.2,
        "end": 3480.2
    },
    {
        "text": " No, entonces no es lo mismo, pude ir a lo mismo.",
        "start": 3481.2,
        "end": 3486.2
    },
    {
        "text": " ¿Cuál es la primera posición que imprime? La cajita de abajo tiene.",
        "start": 3488.2,
        "end": 3491.2
    },
    {
        "text": " No.",
        "start": 3493.2,
        "end": 3494.2
    },
    {
        "text": " No.",
        "start": 3496.2,
        "end": 3497.2
    },
    {
        "text": " 0, 0. Solo imprime si es igual a J. Si es igual a 0, J y te dará todo lo que quiera, pero solo va a ser algo cuando J se igual ahí.",
        "start": 3499.2,
        "end": 3507.2
    },
    {
        "text": " Va a ser más o menos.",
        "start": 3508.2,
        "end": 3509.2
    },
    {
        "text": " Va a ser lo mismo que arriba, imprime la diagonal, ser 1, 1, 2, 2, o sea.",
        "start": 3510.2,
        "end": 3514.2
    },
    {
        "text": " ¿Y cuál es el orden?",
        "start": 3515.2,
        "end": 3516.2
    },
    {
        "text": " Este código.",
        "start": 3517.2,
        "end": 3518.2
    },
    {
        "text": " N cuadrado, ¿por qué?",
        "start": 3520.2,
        "end": 3521.2
    },
    {
        "text": " Usted un él, entonces el peor caso ser pessimista en este caso me lleva a decir que el N va a ser impar.",
        "start": 3524.2,
        "end": 3530.2
    },
    {
        "text": " ¿Por qué? Porque estará N cuadrado mientras que si fuera parte arrairía orden N, el peor caso en este caso es N cuadrado.",
        "start": 3531.2,
        "end": 3537.2
    },
    {
        "text": " ¿Entiende?",
        "start": 3538.2,
        "end": 3539.2
    },
    {
        "text": " ¿Me salte a algunas cositas?",
        "start": 3540.2,
        "end": 3541.2
    },
    {
        "text": " A ver, no, no me salte a esto.",
        "start": 3543.2,
        "end": 3544.2
    },
    {
        "text": " No siempre hace falta que yo tenga el código para saber cuál es el orden.",
        "start": 3547.2,
        "end": 3549.2
    },
    {
        "text": " Entonces yo puedo tener una idea de decir, ah, ahí es una idea que orden va a ser, porque entonces yo ya puedo testar la si va a la pena que la programeo, ¿no?",
        "start": 3550.2,
        "end": 3554.2
    },
    {
        "text": " Entonces le pongo un ejemplo simple de eso.",
        "start": 3555.2,
        "end": 3557.2
    },
    {
        "text": " Calcular el máximo entre dos números. ¿Qué orden va a ser eso?",
        "start": 3558.2,
        "end": 3562.2
    },
    {
        "text": " Constante, ¿podéis un N? ¿No?",
        "start": 3563.2,
        "end": 3565.2
    },
    {
        "text": " Ya está. La sumatoria de los elementos de un arreglo de tamaño N, sumar todos los elementos de un arreglo.",
        "start": 3566.2,
        "end": 3571.2
    },
    {
        "text": " Es típicamente un foro acumulando sobre una variable que les por retorno.",
        "start": 3572.2,
        "end": 3576.2
    },
    {
        "text": " Mucha constante, o sea, hay mucho detalle, no, iniciar y estar.",
        "start": 3577.2,
        "end": 3580.2
    },
    {
        "text": " Pero para el tiempo esos detalle no importa qué voy a hacer, recorrer el arreglo haciendo cositas.",
        "start": 3580.2,
        "end": 3585.2
    },
    {
        "text": " ¿Ora el N?",
        "start": 3586.2,
        "end": 3587.2
    },
    {
        "text": " ¿Está bien?",
        "start": 3588.2,
        "end": 3589.2
    },
    {
        "text": " Imprimir los elementos de una matriz cuadrada de tamaño N por N.",
        "start": 3589.2,
        "end": 3592.2
    },
    {
        "text": " N cuadrado, ¿no?",
        "start": 3594.2,
        "end": 3595.2
    },
    {
        "text": " ¿Cómo haría para que este código el de abajo haga eso?",
        "start": 3597.2,
        "end": 3603.2
    },
    {
        "text": " ¿Qué cambiaría acá?",
        "start": 3605.2,
        "end": 3608.2
    },
    {
        "text": " El IF.",
        "start": 3611.2,
        "end": 3614.2
    },
    {
        "text": " Bien. Exacto.",
        "start": 3615.2,
        "end": 3617.2
    },
    {
        "text": " Y quiero calcular la sumatoria de los elementos de una matriz de tamaño N por N.",
        "start": 3618.2,
        "end": 3622.2
    },
    {
        "text": " N por N, no es cuadrada necesariamente. ¿Cómo es el código típico?",
        "start": 3623.2,
        "end": 3627.2
    },
    {
        "text": " La sumatoria de por N.",
        "start": 3628.2,
        "end": 3630.2
    },
    {
        "text": " Pero el código típico que va a tener un foro, un while, ¿eh?",
        "start": 3631.2,
        "end": 3635.2
    },
    {
        "text": " 2, 1 por la fila, 1 columna, 1 basta N, el otro basta N.",
        "start": 3636.2,
        "end": 3641.2
    },
    {
        "text": " N por N. ¿Entonces cuando uno da el orden o el tiempo?",
        "start": 3642.2,
        "end": 3645.2
    },
    {
        "text": " ¿No tiene por qué necesariamente darlo en función de una variable?",
        "start": 3646.2,
        "end": 3648.2
    },
    {
        "text": " Si la estructura es multimensional como una matriz, yo puedo expresar el orden diciendo N por N.",
        "start": 3649.2,
        "end": 3653.2
    },
    {
        "text": " Tengo que decir quién es el N y quién es el N del problema.",
        "start": 3654.2,
        "end": 3656.2
    },
    {
        "text": " No puedo decir N por N, no sé si para qué lo que es.",
        "start": 3657.2,
        "end": 3658.2
    },
    {
        "text": " Pero yo N es la cantidad de fila y N es la cantidad de columnas.",
        "start": 3659.2,
        "end": 3661.2
    },
    {
        "text": " Voy a ver.",
        "start": 3662.2,
        "end": 3663.2
    },
    {
        "text": " Yo puedo ver la eficiencia del gorismo haciendo una idea del código sin ver los detalles del gorismo.",
        "start": 3664.2,
        "end": 3668.2
    },
    {
        "text": " Este algoritmo capaz que se parece uno de los que dijeron.",
        "start": 3672.2,
        "end": 3676.2
    },
    {
        "text": " Y tera de 0 a N minus 2, acá hay otro foro, quitéera al revés, j, rank a N minus 1, pero va hasta el I más 1.",
        "start": 3677.2,
        "end": 3685.2
    },
    {
        "text": " Y este dice mira, perdón, si ha su j, menos 1, es mayor que a su j, hacer su app entre ellos.",
        "start": 3686.2,
        "end": 3697.2
    },
    {
        "text": " ¿Qué está haciendo este algoritmo?",
        "start": 3698.2,
        "end": 3700.2
    },
    {
        "text": " ¿Ordena? ¿Cómo se llama este algoritmo?",
        "start": 3701.2,
        "end": 3703.2
    },
    {
        "text": " Lo dijeron para que hace un ratito, ¿cuál?",
        "start": 3704.2,
        "end": 3705.2
    },
    {
        "text": " El va a ver el software.",
        "start": 3707.2,
        "end": 3708.2
    },
    {
        "text": " Díamos, ¿no? Arranca en la posición I, 0, j, va a ir por toda la posición hasta llegar a la posición I y qué va haciendo cada vez, traciendo desde atrás para adelante el más chiquito.",
        "start": 3709.2,
        "end": 3722.2
    },
    {
        "text": " ¿Por qué se si es menor? ¿Hace su app? ¿No?",
        "start": 3723.2,
        "end": 3724.2
    },
    {
        "text": " Y es como que va a estar dando la burbujita más chiquito y la deja primero. Después corre un L, el siguiente más chiquito lo deja hace segundo.",
        "start": 3725.2,
        "end": 3731.2
    },
    {
        "text": " Por eso además va a ver el software, como las burbujitas de gas, ¿no? Que suben.",
        "start": 3732.2,
        "end": 3734.2
    },
    {
        "text": " ¿Sí?",
        "start": 3735.2,
        "end": 3736.2
    },
    {
        "text": " El primero. El primero está justamente para necesitar los dos.",
        "start": 3738.2,
        "end": 3745.2
    },
    {
        "text": " ¿Vo tenés acá, no?",
        "start": 3747.2,
        "end": 3749.2
    },
    {
        "text": " 0, 1, ¿no? Acá tenés Eli, se mueve así. ¿Sí?",
        "start": 3751.2,
        "end": 3756.2
    },
    {
        "text": " Y el J viene así al revés. Hasta acá.",
        "start": 3757.2,
        "end": 3761.2
    },
    {
        "text": " Entonces, cuando Eli vale 0, la primera iteración del fore externo, lo que dice J anda comparando este con este. ¿Y quién queda acá de estos dos?",
        "start": 3761.2,
        "end": 3773.2
    },
    {
        "text": " El más chico.",
        "start": 3775.2,
        "end": 3776.2
    },
    {
        "text": " Después dice comparar este con este ahora. ¿Quién queda acá entonces?",
        "start": 3777.2,
        "end": 3780.2
    },
    {
        "text": " El más chico. El más chico de los dos, que es el más chico de los tres, en realidad.",
        "start": 3782.2,
        "end": 3785.2
    },
    {
        "text": " Entonces va traciendo el más chiquito hasta que el más chiquito lo dejáis. Ahora, y lo pone acá y empieza desde acá para hacer.",
        "start": 3786.2,
        "end": 3793.2
    },
    {
        "text": " Entonces dice, de nuevo, los dos más grandes, va traiendo el siguiente más chico, lo pone acá.",
        "start": 3794.2,
        "end": 3797.2
    },
    {
        "text": " Entonces, Eli lo hace para ir cada vez avanzando de a 1, marcando dónde va a quedar el siguiente más chico.",
        "start": 3798.2,
        "end": 3803.2
    },
    {
        "text": " Y el J está hacia el trabajo de llevar el que le toca el turno a ese lugar, a esa casilla.",
        "start": 3804.2,
        "end": 3809.2
    },
    {
        "text": " Es como que primero va la burbujita más chiquita, la siguiente burbujita más chiquita y al final va la burbuja más grande.",
        "start": 3810.2,
        "end": 3816.2
    },
    {
        "text": " ¿Se entiende? ¿Cuál es la complejidad de esto? No lo voy a ver en detalle, lo van a ver en el práctico.",
        "start": 3818.2,
        "end": 3823.2
    },
    {
        "text": " Unice, no es tan claro con el eselo orden porque, porque si mira el fore interno, fíjense que el fore de J no se hace siempre la misma cantidad de veces.",
        "start": 3824.2,
        "end": 3834.2
    },
    {
        "text": " Depende de Eli. De hecho, a medida que este I va aumentando, J cada vez corre menos.",
        "start": 3835.2,
        "end": 3840.2
    },
    {
        "text": " ¿Se entiende? Fíjense la cordición ahí, dice, y menor que J, o sea que la última vez quitará es cuando J vale y más 1,",
        "start": 3842.2,
        "end": 3850.2
    },
    {
        "text": " porque ya cuando lo decrementa, después ya J es igual ahí, eso no es más.",
        "start": 3851.2,
        "end": 3854.2
    },
    {
        "text": " Entonces dice, ¿cómo planteo el tiempo en esos casos? Y bueno, el modelo matemático para plantear cuando hay dudas es de las sumas.",
        "start": 3857.2,
        "end": 3863.2
    },
    {
        "text": " ¿Cómo llevo este código a un modelo matemático? ¿Qué es lo que hace en los matemáticos? Por eso que la matemática ha sido una forma de conseguir trabajo,",
        "start": 3865.2,
        "end": 3873.2
    },
    {
        "text": " es metiéndose en la algoritmica representando, viendo el tiempo y optimizando, porque le da todo un área de trabajo,",
        "start": 3874.2,
        "end": 3880.2
    },
    {
        "text": " si yo conozco y se manipula las matemáticas y es encontrar funciones más pequeñas que otra, que es igual, entonces está y me sirve para optimizar el código.",
        "start": 3881.2,
        "end": 3888.2
    },
    {
        "text": " ¿Cómo puedo llevar este modelo computacional a un modelo matemático? Bueno, empecemos el primer foro.",
        "start": 3889.2,
        "end": 3895.2
    },
    {
        "text": " Lo digo que dije antes, es la suma sobre todas las iteraciones de ciclas, entonces digo sumatoria de que de igual 0, incluso la misma variable, hasta N menos 2,",
        "start": 3897.2,
        "end": 3905.2
    },
    {
        "text": " porque tiene ser menor estricto que N menos 1, de lo que esté adentro de ese foro, las constante las voy sacando porque no influye.",
        "start": 3906.2,
        "end": 3914.2
    },
    {
        "text": " ¿Qué es el foro que está adentro? ¿Es la instrucción que está adentro es otro foro, que va desde que desde N menos 1 hasta N menos 1, ¿no?",
        "start": 3915.2,
        "end": 3922.2
    },
    {
        "text": " Y lo que ponga, J igual, N menos 1 hasta N menos 1, de y todo lo que está adentro agrupo todas las constantes, en particular esta comparación que está acá",
        "start": 3924.2,
        "end": 3933.2
    },
    {
        "text": " y el swap de dos variables que son tres asignaciones son todas constantes, entonces digo lo llamamos constante.",
        "start": 3934.2,
        "end": 3938.2
    },
    {
        "text": " Y ahora que tengo que hacer desarmar esa sumatoria, la sumatoria cuando no depende del valor es la cantidad de iteraciones por ese valor y si depende del valor,",
        "start": 3939.2,
        "end": 3950.2
    },
    {
        "text": " aunque vean si el asuma propiedades matemáticas muy básicas, uno se va a calcular y uno dice que te da esto N cuadrado,",
        "start": 3951.2,
        "end": 3958.2
    },
    {
        "text": " y vean que ya sabía que había dado fuera ni dado y las he dicho antes que era N cuadrado.",
        "start": 3959.2,
        "end": 3962.2
    },
    {
        "text": " Trabesis uno no sabe, termina siendo en este caso N cuadrado, pero es peor que había por un ejemplo que tiene tres foranidados,",
        "start": 3963.2,
        "end": 3968.2
    },
    {
        "text": " y se no voy a hacer las cuentitas, ahora digo N Google, no, hago las cuentitas y me quede N cuadrado.",
        "start": 3969.2,
        "end": 3973.2
    },
    {
        "text": " Entonces, si yo lo jito, pudo poner cota superior es muy pesimista, si hago las cuentas o me convenzo que es la cota superior está bien o pueden encontrar cota superior es mejores.",
        "start": 3975.2,
        "end": 3985.2
    },
    {
        "text": " Pero ahí sí tengo que recurrir a la matemática para hacer cuentitas.",
        "start": 3986.2,
        "end": 3989.2
    },
    {
        "text": " Mira en este código, una función F que recibe un arreglo, le dámolo así, un arreglo de enteros A de tamaño N,",
        "start": 3992.2,
        "end": 4001.2
    },
    {
        "text": " inicializa la variable entera N con asub 0 y tera, hace este F y retona N, en palabras que está haciendo.",
        "start": 4002.2,
        "end": 4010.2
    },
    {
        "text": " O sea, retorna el mínimo elemento del arreglo.",
        "start": 4011.2,
        "end": 4017.2
    },
    {
        "text": " Vale, decir no, vale decir no entendí, acá se queda como diciendo, fíjense que va a retornar N, o sea la clave acá está en ¿QNSM?",
        "start": 4020.2,
        "end": 4029.2
    },
    {
        "text": " ¿Qué hace N? N lo guarda con asub 0 para inicializar y después ir a todas las otras posiciones que no son las 0 de el 1 hasta el NM1,",
        "start": 4030.2,
        "end": 4038.2
    },
    {
        "text": " dice por qué tiro al revés, porque te añade y complicar el avido de nada más, podréis iterar al revés y lo mismo.",
        "start": 4039.2,
        "end": 4044.2
    },
    {
        "text": " Y qué va haciendo y comparándose la subida es más chiquito que lo que tengo N, actualizo el M.",
        "start": 4045.2,
        "end": 4050.2
    },
    {
        "text": " Entonces si paso por todas las posiciones y cada vez N, me fui quedando con lo más chiquito que encontré es el mínimo.",
        "start": 4051.2,
        "end": 4056.2
    },
    {
        "text": " ¿Qué ordenes este código?",
        "start": 4057.2,
        "end": 4059.2
    },
    {
        "text": " Rápido así, ¿PAT?",
        "start": 4060.2,
        "end": 4063.2
    },
    {
        "text": " ¿Orden N, ¿Por qué? Uniría, si mire esta introducción de acá es constante, o sea esta línea solo es orden 1, el retanto también es orden 1, pero la cajita del medio,",
        "start": 4064.2,
        "end": 4074.2
    },
    {
        "text": " uniciencia hace N menos un veces con muchas constantes, pero N menos 1 y las constantes lo que importa ahí es el N.",
        "start": 4075.2,
        "end": 4083.2
    },
    {
        "text": " Las condiciones de todo esto son N. Como están las tres en secuencias, orden 1, orden N, orden 1, el peor es orden N.",
        "start": 4084.2,
        "end": 4090.2
    },
    {
        "text": " ¿Sí fuera? ¿Sí sería N cuadrado si tuvieras otro forz, si no, no va a ser N cuadrado? Ahora vamos a ver un ejemplo.",
        "start": 4099.2,
        "end": 4104.2
    },
    {
        "text": " Miren este ejemplo, no hace nada interesante, no es para que si es el mínimo máximo que impime no importa, pero si importa que veamos el orden.",
        "start": 4105.2,
        "end": 4116.2
    },
    {
        "text": " Este recibe un arreglo ade tamaño N y un entero K, usa una variolibuliana, está inicializada en forz y después citera, mientras el N no sea menor que N y not está al comienzo vale esta condición,",
        "start": 4117.2,
        "end": 4133.2
    },
    {
        "text": " porque está de forz, dice si a su B es K, entonces ejecuto esto, está de oponentru, hago estiteración, imprimiendo cosas.",
        "start": 4133.2,
        "end": 4142.2
    },
    {
        "text": " Si es arrociero se acabo el código, así si le dijera ojito rápido, ¿cuál es el orden de este código? N cuadrado, ¿no?",
        "start": 4145.2,
        "end": 4156.2
    },
    {
        "text": " Lojito dice, hay dos foranidados, N cuadrado seguro funciona, ¿capa que había algo mejor pero esa seguro funciona? ¿A ver, es una cosa superior.",
        "start": 4156.2,
        "end": 4166.2
    },
    {
        "text": " La pregunta si no hay una cota superior en el peor caso mejor que N cuadrado, esa es la duda.",
        "start": 4167.2,
        "end": 4170.2
    },
    {
        "text": " Muy bien, entonces la N dice algo.",
        "start": 4176.2,
        "end": 4178.2
    },
    {
        "text": " Bien, pero él está diciendo algo, ¿A lo sumo cuánta veces ejecuta este forz? ¿Pobo dijiste a esta lo oponentru? ¿Qué quiere decir? ¿Cuánta veces ejecuta a lo sumo este forz con J?",
        "start": 4178.2,
        "end": 4196.2
    },
    {
        "text": " Y dije, a lo sumo una vez puede ser ejecutarse 0 veces, sería cuando no está, cada no está en ninguna subi, pero si está una vez, la primera vez ya está lo oponentru y ya acá se va, la cintiteración se va, porque está pasando a lo sumo lo hace una vez.",
        "start": 4197.2,
        "end": 4222.2
    },
    {
        "text": " ¿Cuál es el peor escenario para que se ejecute esa sola vez entonces? Porque lo mejor sería ninguna vez, digo, no, lo peor sería una vez, ¿cuál sería para esa vez el peor escenario?",
        "start": 4223.2,
        "end": 4234.2
    },
    {
        "text": " Que este primero en la regla no es el peor escenario, que este al último, este dibujito que está acá. Supongo que tengo todos los elementos distintos de acá salvo el último, ¿qué es que?",
        "start": 4236.2,
        "end": 4248.2
    },
    {
        "text": " ¿Ese es el peor escenario? El que va a llevar a esto es ejecutarse más veces, bueno, calculemos el tiempo de ese peor escenario.",
        "start": 4249.2,
        "end": 4255.2
    },
    {
        "text": " Estamos de acuerdo que yo lo pudo partir diciendo sumo todos los tiempos de todos los distintos de acá y le sumo el tiempo del último.",
        "start": 4257.2,
        "end": 4263.2
    },
    {
        "text": " ¿Cómo son cosas diferentes? Les voy a separar, voy a sumar lo que me de esto, más lo que me de esto. Esto digo este solito.",
        "start": 4264.2,
        "end": 4271.2
    },
    {
        "text": " Este solito con acá. Ahora sumar todas las iteraciones que son distintos de acá, ¿qué lo que va a hacer el código?",
        "start": 4272.2,
        "end": 4277.2
    },
    {
        "text": " Va a decir, a su y no es acá, bien, vuelve. A su y no es acá, bien, vuelve.",
        "start": 4278.2,
        "end": 4283.2
    },
    {
        "text": " O sea, para toda la que son distintos de acá, ¿cuánto va a tardar? Para cada iteración distinto de acá.",
        "start": 4284.2,
        "end": 4288.2
    },
    {
        "text": " Un tiempo constante, porque pregunta la condición, increíblemente, pregunta la condición, increíblemente, pero lo va a ser n menos un basis esto, ¿no?",
        "start": 4292.2,
        "end": 4299.2
    },
    {
        "text": " ¿De qué orden tiene todo este pedazo hasta ahí?",
        "start": 4300.2,
        "end": 4303.2
    },
    {
        "text": " Orden n, pues son, ¿no? N menos un veces constantes, todo eso se ordene.",
        "start": 4304.2,
        "end": 4308.2
    },
    {
        "text": " Y ahora le pongo más lo del último. En el último a su y es acá.",
        "start": 4310.2,
        "end": 4315.2
    },
    {
        "text": " Entonces, ¿qué hace? ¿Y qué oculta esto? ¿Y qué ordenes esto?",
        "start": 4316.2,
        "end": 4318.2
    },
    {
        "text": " Orden n. Entonces, ¿qué me queda?",
        "start": 4321.2,
        "end": 4323.2
    },
    {
        "text": " Toda las que eran distintas de acá me quedó orden n.",
        "start": 4324.2,
        "end": 4326.2
    },
    {
        "text": " Más la última solita tiene orden n. Y esto es igual a la máxima de las dos, es orden n.",
        "start": 4327.2,
        "end": 4333.2
    },
    {
        "text": " Este código es orden n.",
        "start": 4336.2,
        "end": 4337.2
    },
    {
        "text": " Sí. ¿Por qué es orden n? ¿Y la constante n?",
        "start": 4340.2,
        "end": 4343.2
    },
    {
        "text": " Porque, a guarda, la definición de orden dice, existe una constante. Entonces, la constante no importa.",
        "start": 4344.2,
        "end": 4348.2
    },
    {
        "text": " Cuando el n es grande, la constante se diluye, el n sigue creciendo.",
        "start": 4349.2,
        "end": 4352.2
    },
    {
        "text": " Entonces, n por constante y lo mismo que orden n.",
        "start": 4353.2,
        "end": 4355.2
    },
    {
        "text": " Digate que por acá había una propiedad que decía un poco eso.",
        "start": 4356.2,
        "end": 4360.2
    },
    {
        "text": " Acá, por ejemplo, n cuadrado por un medio sería n cuadrado sobre dos, y lo mismo que n cuadrado.",
        "start": 4362.2,
        "end": 4367.2
    },
    {
        "text": " O sea, las constantes, cuando digo constante, cuando digo n a la dos, dos no es una constante.",
        "start": 4368.2,
        "end": 4372.2
    },
    {
        "text": " La función es n cuadrado, pero cuando es n cuadrado por un medio, por uno, menos uno,",
        "start": 4373.2,
        "end": 4377.2
    },
    {
        "text": " esas son constantes que se diluye en cuando n es grande.",
        "start": 4378.2,
        "end": 4380.2
    },
    {
        "text": " ¿A bien? Entonces, no las pongo directamente.",
        "start": 4381.2,
        "end": 4383.2
    },
    {
        "text": " La noción de orden se las come cuando n tiene infinito.",
        "start": 4384.2,
        "end": 4386.2
    },
    {
        "text": " ¿Estábamos?",
        "start": 4390.2,
        "end": 4391.2
    },
    {
        "text": " ¿Qué pasa ahora si saco la variable buliana de todo el código?",
        "start": 4397.2,
        "end": 4400.2
    },
    {
        "text": " O sea, la tacho acá, la saco de acá y la saco de acá.",
        "start": 4401.2,
        "end": 4407.2
    },
    {
        "text": " ¿Cuál sería el peor caso ahí?",
        "start": 4409.2,
        "end": 4410.2
    },
    {
        "text": " El dibujito que está abajo, ¿cómo que se transformaría? ¿Cuál es el perecenario para ustedes?",
        "start": 4411.2,
        "end": 4415.2
    },
    {
        "text": " ¿Cuál sería el dibujito que pondría en abajo?",
        "start": 4425.2,
        "end": 4427.2
    },
    {
        "text": " ¿Qué es el dibujito?",
        "start": 4428.2,
        "end": 4429.2
    },
    {
        "text": " No, no me está repondiendo lo que estoy programando.",
        "start": 4430.2,
        "end": 4432.2
    },
    {
        "text": " O dije, ¿cuál es el dibujito? ¿El dibujito no es el orden?",
        "start": 4433.2,
        "end": 4435.2
    },
    {
        "text": " ¿Ese dibujito? ¿Cuál es el peor escenario cuando...",
        "start": 4436.2,
        "end": 4438.2
    },
    {
        "text": " Ya no está la varioliguliana.",
        "start": 4439.2,
        "end": 4440.2
    },
    {
        "text": " Un caden cada lugar, que todo sea enca, porque entonces hace que el for de adentro entre todas las veces.",
        "start": 4442.2,
        "end": 4447.2
    },
    {
        "text": " Es decir, este caso, la chile de la varioliguliana de todos los lugares,",
        "start": 4448.2,
        "end": 4452.2
    },
    {
        "text": " el peor caso es cuando son todos iguales acá.",
        "start": 4453.2,
        "end": 4456.2
    },
    {
        "text": " ¿Por qué? Porque ahora sí, digamos, el peor escenario que ha subsero entre acá, ha subido acá,",
        "start": 4458.2,
        "end": 4464.2
    },
    {
        "text": " ejecuta el for. ¿A su uno, ejecuta el for? ¿A su dos, ejecuta el for? ¿A su...",
        "start": 4465.2,
        "end": 4468.2
    },
    {
        "text": " Si son todos iguales acá, ¿qué ordenes me queda esto? Ahora sí.",
        "start": 4469.2,
        "end": 4472.2
    },
    {
        "text": " Ahora sí, en igual a dos, porque es N veces, el for de interno.",
        "start": 4473.2,
        "end": 4476.2
    },
    {
        "text": " Ven que la análisis de gorín, de gorín, pues no es solo mirar ojitos,",
        "start": 4478.2,
        "end": 4482.2
    },
    {
        "text": " pero es para cantar lo foranidad o que ver qué hace esos códigos.",
        "start": 4482.2,
        "end": 4485.2
    },
    {
        "text": " Si tengo una variable, si es ejecuta a los sumos, una vez o no,",
        "start": 4485.2,
        "end": 4488.2
    },
    {
        "text": " hay una parte de entender el código.",
        "start": 4489.2,
        "end": 4491.2
    },
    {
        "text": " Otra cosa, y le voy a poner en práctica ahora, aquí tuyo la palabra.",
        "start": 4492.2,
        "end": 4494.2
    },
    {
        "text": " Para optimizar código, que es lo que voy a ir un poquito ahora en breve en unos ejemplos,",
        "start": 4495.2,
        "end": 4498.2
    },
    {
        "text": " yo tengo... Abar, pudo no entender el código,",
        "start": 4499.2,
        "end": 4502.2
    },
    {
        "text": " pero las optimizaciones que van a hacer van a ser casi asigas, cambiar esto por esto,",
        "start": 4503.2,
        "end": 4505.2
    },
    {
        "text": " pero no voy a poder hacer una lógica distinta.",
        "start": 4506.2,
        "end": 4507.2
    },
    {
        "text": " Ahora si yo entiendo que hace un código, que la primera etapa en N",
        "start": 4508.2,
        "end": 4529.72
    },
    {
        "text": " y que por qué...",
        "start": 4530.72,
        "end": 4531.72
    },
    {
        "text": " Si.",
        "start": 4531.72,
        "end": 4532.72
    },
    {
        "text": " Si.",
        "start": 4536.72,
        "end": 4537.72
    },
    {
        "text": " Para optimizar la cuenta, ¿unos que está donde se puede hacer de basa y me estábamos a tomar suave?",
        "start": 4538.72,
        "end": 4543.72
    },
    {
        "text": " Abar, depende de lo que quiera resolver, porque no dice,",
        "start": 4545.72,
        "end": 4547.72
    },
    {
        "text": " eso sería como la ilusión de la bandera, ¿no?",
        "start": 4548.72,
        "end": 4549.72
    },
    {
        "text": " La bandera si vos querés algo hacer, a lo sumo una vez,",
        "start": 4550.72,
        "end": 4552.72
    },
    {
        "text": " y bueno, cuando yo le hiciste una vez, para que vas a iriterandote, vas.",
        "start": 4553.72,
        "end": 4555.72
    },
    {
        "text": " El mismo que buscar un elemento en arreglo, lo que dije es un ratito de un fort,",
        "start": 4555.72,
        "end": 4559.72
    },
    {
        "text": " yo que podría hacer que cuando el elemento no esté llega al final y si está igual llega al final,",
        "start": 4560.72,
        "end": 4565.72
    },
    {
        "text": " pero en un caso una variable pongo el retorno,",
        "start": 4566.72,
        "end": 4568.72
    },
    {
        "text": " o puede decir que cuando yo encontré lo que estoy buscando, ¿para qué sigo iterando salgo?",
        "start": 4569.72,
        "end": 4572.72
    },
    {
        "text": " Había, entonces, porque lo encontré y no tiene sentido sentido seguir buscando,",
        "start": 4574.72,
        "end": 4577.72
    },
    {
        "text": " entonces todo depende del problema que vos querés resolver,",
        "start": 4578.72,
        "end": 4579.72
    },
    {
        "text": " estos dos codios, sin la variable buliana o con la variable buliana, no hacen lo mismo.",
        "start": 4580.72,
        "end": 4584.72
    },
    {
        "text": " Son dos problemas distintos, pero yo lo que estoy viendo con ustedes ahora es cuál es el orden,",
        "start": 4585.72,
        "end": 4590.72
    },
    {
        "text": " para que ustedes se pongan más ducho en, ¿ah, esto tendría en equidad o esto tiene orden en el?",
        "start": 4591.72,
        "end": 4594.72
    },
    {
        "text": " Pero el otro lo hace la suma a vez y esto lo puede hacer múltiples veces,",
        "start": 4595.72,
        "end": 4597.72
    },
    {
        "text": " o sea, son dos problemas distintos, ¿vale?",
        "start": 4598.72,
        "end": 4599.72
    },
    {
        "text": " Entonces, cuál es mejor depende?",
        "start": 4600.72,
        "end": 4602.72
    },
    {
        "text": " Ahora vamos a ver quién no siempre las variables buliana bandera hace que mejor el peor caso.",
        "start": 4603.72,
        "end": 4607.72
    },
    {
        "text": " Acá parece que sí, pero lo que vamos a ver una ejemplo ahora en breve es que no.",
        "start": 4608.72,
        "end": 4611.72
    },
    {
        "text": " ¿Está?",
        "start": 4612.72,
        "end": 4613.72
    },
    {
        "text": " Este lo puse y lo comento rápido, pero rápidamente me voy de este problema, ¿no?",
        "start": 4614.72,
        "end": 4618.72
    },
    {
        "text": " Y que quiera jugar un poquito, hay tres foranidados, ¿qué lo que hace no importa qué?",
        "start": 4619.72,
        "end": 4624.72
    },
    {
        "text": " La pregunta es cuál es el orden de esto.",
        "start": 4625.72,
        "end": 4626.72
    },
    {
        "text": " Si mire rápido, tres foranidados en el cubo, ¿no? Y una diría, el primero va de i igual 1 hasta n,",
        "start": 4629.72,
        "end": 4637.72
    },
    {
        "text": " n, el otro va desde i hasta n y el otro va desde j hasta i.",
        "start": 4637.72,
        "end": 4642.72
    },
    {
        "text": " Fíjense que están enganchados entre sí, ¿no?",
        "start": 4643.72,
        "end": 4645.72
    },
    {
        "text": " El for del medio depende del i que está en el primero y el formas interno depende del,",
        "start": 4646.72,
        "end": 4651.72
    },
    {
        "text": " el j de del i de los dos foras de afueras, ¿no? Tan bien enganchado. ¿Ve bien?",
        "start": 4652.72,
        "end": 4655.72
    },
    {
        "text": " Entonces, cuando planteo la sumatoria me quedan y esas tres, ¿no?",
        "start": 4656.72,
        "end": 4660.72
    },
    {
        "text": " Poniéndolos de dónde va, ¿dónde va?",
        "start": 4661.72,
        "end": 4662.72
    },
    {
        "text": " Si uno desarrolla la sumatoria, los términos que aparecen ahí,",
        "start": 4663.72,
        "end": 4666.72
    },
    {
        "text": " y ya se viene las cuentas, es n cuadrado.",
        "start": 4668.72,
        "end": 4670.72
    },
    {
        "text": " Desafío para ustedes es llegar ese n cuadrado.",
        "start": 4671.72,
        "end": 4673.72
    },
    {
        "text": " Ojo que si yo tengo n cuadrado menos n cubo, ¿cuál es el orden?",
        "start": 4675.72,
        "end": 4679.72
    },
    {
        "text": " N cuadrado menos n cubo.",
        "start": 4680.72,
        "end": 4682.72
    },
    {
        "text": " No.",
        "start": 4684.72,
        "end": 4685.72
    },
    {
        "text": " El lo más grande positivo, ¿no?",
        "start": 4686.72,
        "end": 4688.72
    },
    {
        "text": " Entonces, cualquier cosa negativa se va, respeto con ahí con esa positiva.",
        "start": 4689.72,
        "end": 4692.72
    },
    {
        "text": " ¿Eh?",
        "start": 4693.72,
        "end": 4694.72
    },
    {
        "text": " Exacto.",
        "start": 4695.72,
        "end": 4696.72
    },
    {
        "text": " Y van a ver que acá puede aparecer un n cubo para negativo.",
        "start": 4696.72,
        "end": 4698.72
    },
    {
        "text": " Entonces, la pregunta va a ser, ¿cómo es esto? ¿para no entiendo nada? ¿cómo puede ser que me quede n cuadrado?",
        "start": 4699.72,
        "end": 4704.72
    },
    {
        "text": " Entonces, hagan después la interpretación algoritmica, ¿eh? ¿y liba para allá, el j, para acá? ¿dónde se mueve el k?",
        "start": 4705.72,
        "end": 4710.72
    },
    {
        "text": " Y van a encontrar el gorraro con ese k, que no se hace muchas veces.",
        "start": 4711.72,
        "end": 4713.72
    },
    {
        "text": " Está actuando más comunif.",
        "start": 4714.72,
        "end": 4715.72
    },
    {
        "text": " Entonces, ¿eh? ¿y se por ahí? ¿se está en realidad? ¿es un fortranpozo? ¿no se hace muchas veces?",
        "start": 4716.72,
        "end": 4719.72
    },
    {
        "text": " Entonces, ahí, ¿campa que encuentra la interpretación de por qué esto queda n cuadrado?",
        "start": 4720.72,
        "end": 4723.72
    },
    {
        "text": " Pero matemáticamente, si uno se las cuadrita, hay que venir cuadrado. Entonces, ¿puedes jugar con la matemátria y con la algoritmica?",
        "start": 4724.72,
        "end": 4728.72
    },
    {
        "text": " No se preocupen, no va a ir eso en un parcial.",
        "start": 4729.72,
        "end": 4732.72
    },
    {
        "text": " Pero para que ustedes vean que uno puede hacer interpretar la matemátria y si no acá hay algo raro y va a el gorismo y encuentre eso raro.",
        "start": 4733.72,
        "end": 4738.72
    },
    {
        "text": " ¿Por qué es el mismo modelo que está analizando?",
        "start": 4739.72,
        "end": 4740.72
    },
    {
        "text": " Este no te lo voy a poner, te prometo.",
        "start": 4742.72,
        "end": 4744.72
    },
    {
        "text": " Este.",
        "start": 4745.72,
        "end": 4746.72
    },
    {
        "text": " Bueno, si quieren hacer las cuentas de nuevo, ¿si?",
        "start": 4747.72,
        "end": 4749.72
    },
    {
        "text": " Pues, hay puse mucho ejemplo, no voy a hacer todo. Entonces, vamos a ver algunos, va a ver varios en el práctil, después hay algunos para que quiera algo más.",
        "start": 4749.72,
        "end": 4758.72
    },
    {
        "text": " Antes de ver algunos ejemplitos más, todavía no falta media ahorita, algunos comentarios.",
        "start": 4759.72,
        "end": 4764.72
    },
    {
        "text": " Si una algoritmos se va a ejecutar sólo algunas veces, no es algo que se use muy a menudo.",
        "start": 4766.72,
        "end": 4771.72
    },
    {
        "text": " Entonces, a veces un encero el costo de escritura de apuración puede ser el dominante más que la eficiencia.",
        "start": 4772.72,
        "end": 4776.72
    },
    {
        "text": " Y eso es razonable, depende de una trabaja, ¿no? Ahora, si lo voy a usar mucho o con input grande, ya lo orden es relevante.",
        "start": 4777.72,
        "end": 4783.72
    },
    {
        "text": " Si un programa sólo se va a ejecutar con entradas pequeñas, la noción de orden no sirve.",
        "start": 4784.72,
        "end": 4788.72
    },
    {
        "text": " La noción de orden desprecia a los factores pequeñas. Entonces, ahí uso el reloj del sistema para ver el tiempo de corrida con input pequeño, que son pocos.",
        "start": 4789.72,
        "end": 4796.72
    },
    {
        "text": " No me gasto con el orden.",
        "start": 4797.72,
        "end": 4798.72
    },
    {
        "text": " Una algoritmo eficiente pero complicado recuerden que puede dificultad el mantenimiento.",
        "start": 4799.72,
        "end": 4804.72
    },
    {
        "text": " Entonces, si no está bien documentado, es difícil que alguien después lo mejore la adaptación.",
        "start": 4805.72,
        "end": 4809.72
    },
    {
        "text": " Y una algoritmo eficiente en tiempo pero que usa demasiado memoria extra puede ser contraproducente.",
        "start": 4810.72,
        "end": 4816.72
    },
    {
        "text": " Y hasta ahora no vi ningún ejemplo de esos. Como uso memoria extra para mejorar el tiempo.",
        "start": 4817.72,
        "end": 4821.72
    },
    {
        "text": " Entonces, ahora vamos a ver algo.",
        "start": 4822.72,
        "end": 4823.72
    },
    {
        "text": " Ahora vamos a ver. Variables, arreglos, matrices, auxiliar, etc.",
        "start": 4824.72,
        "end": 4829.72
    },
    {
        "text": " Bueno, esta es la ilografía. Si yo con los ejemplos, es como una mini pausa.",
        "start": 4830.72,
        "end": 4834.72
    },
    {
        "text": " Miren esta función. Residen dos arreglos, IB de enteros.",
        "start": 4836.72,
        "end": 4841.72
    },
    {
        "text": " IB de entero de tamaño N y el código es este. Una variable Boolean, IB le pone en tru y te da de 0 N-1.",
        "start": 4845.72,
        "end": 4852.72
    },
    {
        "text": " Y te da J de 0 N-1 y esta es la asignación clave. Es una asignación.",
        "start": 4853.72,
        "end": 4858.72
    },
    {
        "text": " A B le asigno lo que ya tenía B and a subir menor que B es J.",
        "start": 4859.72,
        "end": 4865.72
    },
    {
        "text": " Y al final de todo retorno el valor de la variable Boolean A.",
        "start": 4866.72,
        "end": 4869.72
    },
    {
        "text": " La pregunta entonces es ¿qué está haciendo esto? ¿Qué? ¿Cuándo da tru y cuando da falsos?",
        "start": 4871.72,
        "end": 4876.72
    },
    {
        "text": " Depende algo de los arreglos IB, obviamente.",
        "start": 4877.72,
        "end": 4879.72
    },
    {
        "text": " ¿Qué está calculando?",
        "start": 4883.72,
        "end": 4884.72
    },
    {
        "text": " Más fuerte, más fuerte.",
        "start": 4886.72,
        "end": 4888.72
    },
    {
        "text": " Algunos, todos.",
        "start": 4891.72,
        "end": 4892.72
    },
    {
        "text": " O sea, retornatru, si todos los elementos de A son menores que todos los Db es y vos.",
        "start": 4897.72,
        "end": 4902.72
    },
    {
        "text": " Uno a uno dice acá, posición a posición.",
        "start": 4904.72,
        "end": 4907.72
    },
    {
        "text": " ¿Todo es todo? ¿Todo es todo? ¿Todo es todo?",
        "start": 4908.72,
        "end": 4912.72
    },
    {
        "text": " ¿Todo es todo?",
        "start": 4913.72,
        "end": 4915.72
    },
    {
        "text": " Fíjense. ¿Fíjense?",
        "start": 4916.72,
        "end": 4920.72
    },
    {
        "text": " Sí, es falsos, le da el E y ya ya. Es falsos, falsos.",
        "start": 4921.72,
        "end": 4924.72
    },
    {
        "text": " Exacto. Fíjense que... ¿Por qué me cambió la...",
        "start": 4925.72,
        "end": 4928.72
    },
    {
        "text": " A ver, no, ahorita.",
        "start": 4929.72,
        "end": 4930.72
    },
    {
        "text": " Fíjense que acá y J esto es el rango posible, porque va a decir a N-1.",
        "start": 4931.72,
        "end": 4936.72
    },
    {
        "text": " ¿Qué pasaría si encuentra alguna posición en A?",
        "start": 4938.72,
        "end": 4941.72
    },
    {
        "text": " La 3 por decir algo y alguna posición en B, la 8 y esto se le hace falsos.",
        "start": 4942.72,
        "end": 4946.72
    },
    {
        "text": " O sea, esa posición de A es mayor igual que la de B.",
        "start": 4947.72,
        "end": 4950.72
    },
    {
        "text": " Toda esa condición, ¿cómo va a quedar?",
        "start": 4951.72,
        "end": 4952.72
    },
    {
        "text": " Fuals. ¿Y B pasa a ser?",
        "start": 4953.72,
        "end": 4954.72
    },
    {
        "text": " Fuals. Y una vez que B es false, ¿qué pasa a las siguientes iteraciones?",
        "start": 4955.72,
        "end": 4958.72
    },
    {
        "text": " No vuelen nunca más a tru, ¿por qué? Porque en la siguiente iteración,",
        "start": 4959.72,
        "end": 4961.72
    },
    {
        "text": " hace LAN con lo que ya traía B y algo más. Entonces, ¿si la es falsos?",
        "start": 4962.72,
        "end": 4965.72
    },
    {
        "text": " Marcho. O sea, una vez que sea falsos, marcho.",
        "start": 4965.72,
        "end": 4968.72
    },
    {
        "text": " Quedó falsos.",
        "start": 4969.72,
        "end": 4970.72
    },
    {
        "text": " La única condición para que esto termine en tru, cual es que nunca se haga falsos.",
        "start": 4971.72,
        "end": 4974.72
    },
    {
        "text": " Y cuando logro que nunca se haga falsos, cuando cualquier posición de A es más chiquita",
        "start": 4975.72,
        "end": 4980.72
    },
    {
        "text": " que cualquier posición de B, o sea, todos los elementos de A son menores que todos los de B.",
        "start": 4981.72,
        "end": 4984.72
    },
    {
        "text": " ¿Qué fue lo que dijeron por acá, no?",
        "start": 4985.72,
        "end": 4986.72
    },
    {
        "text": " Todos los elementos de A tienen esa menor que todos los de B para que esto detrú.",
        "start": 4987.72,
        "end": 4990.72
    },
    {
        "text": " Si hay uno que ya no cumple eso, falsos.",
        "start": 4991.72,
        "end": 4993.72
    },
    {
        "text": " Si?",
        "start": 4994.72,
        "end": 4995.72
    },
    {
        "text": " Entendimos el algoritmo.",
        "start": 4996.72,
        "end": 4998.72
    },
    {
        "text": " Eso es la primera parte de análisis algoritmo, ¿entender qué hace?",
        "start": 4999.72,
        "end": 5001.72
    },
    {
        "text": " ¿Tiene un indicado o eso?",
        "start": 5002.72,
        "end": 5003.72
    },
    {
        "text": " Bueno, vamos a ver si no ocurre algo mejor.",
        "start": 5004.72,
        "end": 5005.72
    },
    {
        "text": " ¿Qué orden tiene esto? ¿Este es fácil?",
        "start": 5006.72,
        "end": 5008.72
    },
    {
        "text": " N cuadrado. ¿Por qué acá lo gíndice?",
        "start": 5009.72,
        "end": 5011.72
    },
    {
        "text": " No están anidados, acá es hot, el lino aparece, entonces esto es N veces, N veces, Constante.",
        "start": 5012.72,
        "end": 5018.72
    },
    {
        "text": " O sea, todo esto es N cuadrado.",
        "start": 5019.72,
        "end": 5020.72
    },
    {
        "text": " Esto es una constante sola y esto es una constante sola, o sea, me queda orden 1, orden N cuadrado, orden 1.",
        "start": 5020.72,
        "end": 5025.72
    },
    {
        "text": " El pioer caso es orden N cuadrado.",
        "start": 5026.72,
        "end": 5027.72
    },
    {
        "text": " Eso es fácil de ver.",
        "start": 5028.72,
        "end": 5029.72
    },
    {
        "text": " ¿Cómo resuelve este mismo problema en un menor orden en el pioer caso?",
        "start": 5031.72,
        "end": 5035.72
    },
    {
        "text": " ¿Qué pasa así, acá?",
        "start": 5042.72,
        "end": 5044.72
    },
    {
        "text": " Miren acá, pues no lo voy a escribir, ¿no?",
        "start": 5045.72,
        "end": 5046.72
    },
    {
        "text": " ¿Dónde dice hot a menor que N y donde dice I menor que N?",
        "start": 5047.72,
        "end": 5050.72
    },
    {
        "text": " En ambos le agrego AND B.",
        "start": 5051.72,
        "end": 5052.72
    },
    {
        "text": " O sea, si huiterando, pero mientras ves a trupe para que cuando vea sea false, se va a dar enseguida.",
        "start": 5054.72,
        "end": 5058.72
    },
    {
        "text": " Para, para, vamos, paso a paso.",
        "start": 5061.72,
        "end": 5063.72
    },
    {
        "text": " Si agrego esos dos AND B.",
        "start": 5064.72,
        "end": 5065.72
    },
    {
        "text": " ¿Mejor el tiempo es que usen el pioer caso?",
        "start": 5067.72,
        "end": 5069.72
    },
    {
        "text": " No. ¿Por qué?",
        "start": 5070.72,
        "end": 5071.72
    },
    {
        "text": " ¿Por qué?",
        "start": 5072.72,
        "end": 5073.72
    },
    {
        "text": " ¿Por qué el pioer caso se mantiene?",
        "start": 5074.72,
        "end": 5076.72
    },
    {
        "text": " O sea, el pioer caso después de eso son todos menores.",
        "start": 5077.72,
        "end": 5078.72
    },
    {
        "text": " Nunca va a entrar por ahí.",
        "start": 5079.72,
        "end": 5080.72
    },
    {
        "text": " El pioer caso sigue siendo el mismo.",
        "start": 5081.72,
        "end": 5082.72
    },
    {
        "text": " O sea, ¿Ella agregar esa bandera?",
        "start": 5083.72,
        "end": 5084.72
    },
    {
        "text": " Está bien, cuando la encuentre y se hace foto, va a salir.",
        "start": 5085.72,
        "end": 5087.72
    },
    {
        "text": " Pero el pioer caso es que no la encuentre nunca.",
        "start": 5088.72,
        "end": 5089.72
    },
    {
        "text": " O sea, si todo lo de metodial ya era menores que todo lo debe, nunca va a salir antes.",
        "start": 5090.72,
        "end": 5093.72
    },
    {
        "text": " Y va a ser N cuadrado.",
        "start": 5094.72,
        "end": 5095.72
    },
    {
        "text": " Voy a decirte, puedo ser un solo fort, ¿cómo?",
        "start": 5097.72,
        "end": 5098.72
    },
    {
        "text": " Y para ahí checaría posiciona posición y eso es otro problema.",
        "start": 5102.72,
        "end": 5105.72
    },
    {
        "text": " Puede ser que la posición uno sea menor que la posición uno, pero capaz que la dos,",
        "start": 5106.72,
        "end": 5110.72
    },
    {
        "text": " esto está chequeando de todos los elementos de azo menores que todos los debe.",
        "start": 5111.72,
        "end": 5114.72
    },
    {
        "text": " ¿Es otro problema?",
        "start": 5115.72,
        "end": 5116.72
    },
    {
        "text": " No te coté de que caras el pioer o ver.",
        "start": 5117.72,
        "end": 5118.72
    },
    {
        "text": " Bien.",
        "start": 5119.72,
        "end": 5120.72
    },
    {
        "text": " Si él toma el mínimo, el más chiquito de B.",
        "start": 5121.72,
        "end": 5123.72
    },
    {
        "text": " Pues yo quiero ver que todos los de a sea menores que todos los de B.",
        "start": 5124.72,
        "end": 5126.72
    },
    {
        "text": " Si toma el más chiquito de B.",
        "start": 5127.72,
        "end": 5128.72
    },
    {
        "text": " Supongo que este es el mínimo de B.",
        "start": 5129.72,
        "end": 5131.72
    },
    {
        "text": " Y lo puedo comparar con todos los de Mtodial o con quien de A.",
        "start": 5134.72,
        "end": 5137.72
    },
    {
        "text": " ¿Qué pasa si tomo este? Supongo que es el máximo de A.",
        "start": 5138.72,
        "end": 5141.72
    },
    {
        "text": " Si el más grande de A es más chiquito que el mínimo de B.",
        "start": 5143.72,
        "end": 5145.72
    },
    {
        "text": " Ya está.",
        "start": 5146.72,
        "end": 5147.72
    },
    {
        "text": " Son todos menores.",
        "start": 5148.72,
        "end": 5149.72
    },
    {
        "text": " ¿Qué pasa?",
        "start": 5149.72,
        "end": 5150.72
    },
    {
        "text": " Repo decir, calculo mina punticoma, calculo min, minb punticoma, calculo maxa,",
        "start": 5154.72,
        "end": 5161.72
    },
    {
        "text": " punticoma retorno a la comparación de ellos.",
        "start": 5162.72,
        "end": 5164.72
    },
    {
        "text": " Más o menos este código.",
        "start": 5166.72,
        "end": 5167.72
    },
    {
        "text": " Calcular el mínimo de B, calcular el máximo de A y retornar esta comparación.",
        "start": 5170.72,
        "end": 5174.72
    },
    {
        "text": " Resimbimos un código que decía que calcula eso te diger el mínimo de alimento de la regla.",
        "start": 5175.72,
        "end": 5179.72
    },
    {
        "text": " Y la orden dijimos en el máximo de lo mismo, pero en vez de poner menor, pongo mayor.",
        "start": 5180.72,
        "end": 5185.72
    },
    {
        "text": " O sea que me queda esto.",
        "start": 5186.72,
        "end": 5187.72
    },
    {
        "text": " Orden N, más orden N, más orden 1.",
        "start": 5188.72,
        "end": 5191.72
    },
    {
        "text": " Tan en secuencia, el máximo.",
        "start": 5192.72,
        "end": 5194.72
    },
    {
        "text": " O sea que tiene una regla práctica para optimizar.",
        "start": 5195.72,
        "end": 5196.72
    },
    {
        "text": " No siempre lo puedo explicar, pero mucha veces sí.",
        "start": 5197.72,
        "end": 5198.72
    },
    {
        "text": " Que es cuando tengo procesos anidados, fuera anidados, ver si los puedo secuencializar.",
        "start": 5199.72,
        "end": 5203.72
    },
    {
        "text": " Porque la secuencia se queda con el peor.",
        "start": 5205.72,
        "end": 5207.72
    },
    {
        "text": " Cuando están anidados se multiplica.",
        "start": 5208.72,
        "end": 5209.72
    },
    {
        "text": " Tantas veces éste, como tantas veces éste.",
        "start": 5211.72,
        "end": 5213.72
    },
    {
        "text": " Si yo puedo, quede un código a veces más largo sí.",
        "start": 5214.72,
        "end": 5216.72
    },
    {
        "text": " Más largo no quiere ser más ineficiente.",
        "start": 5218.72,
        "end": 5219.72
    },
    {
        "text": " A veces puedo poner algo muy compacto, pero tiene tres fornidados y eso es mucho más lento",
        "start": 5221.72,
        "end": 5225.72
    },
    {
        "text": " que poner muchas sentencias a lo largo.",
        "start": 5226.72,
        "end": 5227.72
    },
    {
        "text": " No se lleven con que, ah, hay un código largo y seguro que es ineficiente.",
        "start": 5229.72,
        "end": 5231.72
    },
    {
        "text": " Depende el or.",
        "start": 5231.72,
        "end": 5232.72
    },
    {
        "text": " Bueno, miren este, a ver rápido, se parece el otro.",
        "start": 5239.72,
        "end": 5241.72
    },
    {
        "text": " Acá solo tengo una regla, a, de tamaño N.",
        "start": 5242.72,
        "end": 5245.72
    },
    {
        "text": " ¿Qué está haciendo?",
        "start": 5246.72,
        "end": 5247.72
    },
    {
        "text": " Retona trus y solo sí que.",
        "start": 5250.72,
        "end": 5252.72
    },
    {
        "text": " Todos los elementos de la regla son iguales entre sí.",
        "start": 5256.72,
        "end": 5258.72
    },
    {
        "text": " De nuevo, la misma lógica de recién, si hay alguna posición y distinta la posición j,",
        "start": 5259.72,
        "end": 5265.72
    },
    {
        "text": " ya esto se hace false, una vez que se haga false, quedó false.",
        "start": 5266.72,
        "end": 5268.72
    },
    {
        "text": " Para que nunca se haga false cualquier posición y j que tome de la regla,",
        "start": 5270.72,
        "end": 5273.72
    },
    {
        "text": " tiene que ser igual entre sí, la única forma que se en todos los mismos elementos.",
        "start": 5274.72,
        "end": 5276.72
    },
    {
        "text": " ¿Cómo lo esto lo puedo hacer en orden N mucho más fácil?",
        "start": 5279.72,
        "end": 5281.72
    },
    {
        "text": " Toma el primero y le comparo todo con el primero, por ejemplo.",
        "start": 5283.72,
        "end": 5286.72
    },
    {
        "text": " Acá creo que dice eso, ese, y se unfor un solo que compara todos con el asubcero.",
        "start": 5288.72,
        "end": 5295.72
    },
    {
        "text": " Entonces si todos iguales a la asubcero, fíjense que retona acá y igual igual a N.",
        "start": 5296.72,
        "end": 5301.72
    },
    {
        "text": " Está bien esto, o sea, yo quería dar true false y quería dar true.",
        "start": 5302.72,
        "end": 5305.72
    },
    {
        "text": " Está bien.",
        "start": 5306.72,
        "end": 5307.72
    },
    {
        "text": " Cuando sigas hasta el final y es igual a N, o sea, dejó de ser menor que N pasó a ser igual a N. ¿Qué quiere decir?",
        "start": 5311.72,
        "end": 5317.72
    },
    {
        "text": " Nunca encontró la violación de la condición, todos eran iguales.",
        "start": 5318.72,
        "end": 5321.72
    },
    {
        "text": " Si sale ante tiempo, por ejemplo el asubón es igual el asubcero,",
        "start": 5322.72,
        "end": 5325.72
    },
    {
        "text": " se repetió, ya y no es igual a N, entonces retona false.",
        "start": 5327.72,
        "end": 5330.72
    },
    {
        "text": " Entonces muchas veces, van a ser que yo lo uso, no quiere decir que usted lo tenga que hacer así.",
        "start": 5331.72,
        "end": 5333.72
    },
    {
        "text": " Uno dice, voy a chequear algo, si llegué al final, la condición se llegó, si salí antes,",
        "start": 5335.72,
        "end": 5339.72
    },
    {
        "text": " la condición se llegó. O sea, llegar al final o no es la respuesta a veces.",
        "start": 5340.72,
        "end": 5342.72
    },
    {
        "text": " Si salí antes, quiere decir una cosa, llegué hasta el final, quiere decir lo contrario.",
        "start": 5343.72,
        "end": 5346.72
    },
    {
        "text": " Entonces me queda mucho más con pacto de los codios cuando uno a veces los piensas así.",
        "start": 5346.72,
        "end": 5349.72
    },
    {
        "text": " Van a ver un par de ejemplos más con esa idea.",
        "start": 5350.72,
        "end": 5352.72
    },
    {
        "text": " ¿Se puede poner una pregunta?",
        "start": 5353.72,
        "end": 5354.72
    },
    {
        "text": " No.",
        "start": 5355.72,
        "end": 5356.72
    },
    {
        "text": " Y mira, yo no soy muy purista entre el Fóri de Guayl, entonces que en P1,",
        "start": 5366.72,
        "end": 5368.72
    },
    {
        "text": " ustedes le pegaban con la reglita así.",
        "start": 5369.72,
        "end": 5370.72
    },
    {
        "text": " En C y en C más más, un Fóri es un Guay, porque fíjate la condición,",
        "start": 5372.72,
        "end": 5375.72
    },
    {
        "text": " inicializa mientras sea menor, o sea, la distinción entre un Fóri, un Guayl en C,",
        "start": 5376.72,
        "end": 5380.72
    },
    {
        "text": " en C más más, casi nula.",
        "start": 5381.72,
        "end": 5383.72
    },
    {
        "text": " Entonces acá usen el que le guste más.",
        "start": 5384.72,
        "end": 5387.72
    },
    {
        "text": " Es una cuestión de gusto, digamos, no es que está.",
        "start": 5389.72,
        "end": 5392.72
    },
    {
        "text": " Pazcal es más estructurado, con el forba de un valor hasta un valor,",
        "start": 5393.72,
        "end": 5396.72
    },
    {
        "text": " pero no es mientras sea menor que una condición general, ¿no?",
        "start": 5397.72,
        "end": 5399.72
    },
    {
        "text": " Acá el Fóri es que hace un Guayl, entonces es como muy híbrido, entonces,",
        "start": 5400.72,
        "end": 5403.72
    },
    {
        "text": " ya no hacen tanta distinción.",
        "start": 5403.72,
        "end": 5405.72
    },
    {
        "text": " Mira en este otro, sí, parece el anterior, pero marque en rojo las diferencias.",
        "start": 5407.72,
        "end": 5411.72
    },
    {
        "text": " Tengo dos arreglos, hay B, linteros, B y la inicial y son Fóri, ahora.",
        "start": 5412.72,
        "end": 5417.72
    },
    {
        "text": " Y en vez de hacer un anth a un or, con a su B menor que ve su jota.",
        "start": 5418.72,
        "end": 5424.72
    },
    {
        "text": " ¿Qué está haciendo esto? ¿Cuándo da true?",
        "start": 5425.72,
        "end": 5427.72
    },
    {
        "text": " ¿Cuándo da true?",
        "start": 5434.72,
        "end": 5436.72
    },
    {
        "text": " ¿Cuándo da true?",
        "start": 5437.72,
        "end": 5438.72
    },
    {
        "text": " Simple, lo mismo, ¿eh?",
        "start": 5439.72,
        "end": 5441.72
    },
    {
        "text": " Hay más que en levanta. ¿Tale?",
        "start": 5442.72,
        "end": 5444.72
    },
    {
        "text": " ¿Susos circuito corto, general?",
        "start": 5445.72,
        "end": 5447.72
    },
    {
        "text": " Y en el tema más, si usas circuito corto.",
        "start": 5448.72,
        "end": 5450.72
    },
    {
        "text": " O sea, cuando se cumple, sólo valúa el segundo cuando, en el caso un an, el primero fue true.",
        "start": 5450.72,
        "end": 5455.72
    },
    {
        "text": " Si, ya de false, no valúa el segundo.",
        "start": 5456.72,
        "end": 5459.72
    },
    {
        "text": " Mira, ¿qué tiene que pasar de los elementos de IB, para que se cumple?",
        "start": 5462.72,
        "end": 5465.72
    },
    {
        "text": " Es que sea el primer error, ¿sí?",
        "start": 5466.72,
        "end": 5468.72
    },
    {
        "text": " Es que sea el primer error, ¿sí?",
        "start": 5468.72,
        "end": 5470.72
    },
    {
        "text": " Es que sea el primer error.",
        "start": 5471.72,
        "end": 5473.72
    },
    {
        "text": " ¿Qué tiene que pasar de los elementos de IB, para que se cumple?",
        "start": 5474.72,
        "end": 5479.72
    },
    {
        "text": " ¿Entre los elementos?",
        "start": 5480.72,
        "end": 5482.72
    },
    {
        "text": " El mismo índice, el elemento de hasta, ¿no?",
        "start": 5482.72,
        "end": 5484.72
    },
    {
        "text": " No, mismo índice, ¿no?",
        "start": 5484.72,
        "end": 5486.72
    },
    {
        "text": " ¿Cuá ni quiera me suena medio raro?",
        "start": 5488.72,
        "end": 5490.72
    },
    {
        "text": " No, todos, ¿no?",
        "start": 5491.72,
        "end": 5494.72
    },
    {
        "text": " Es un existe.",
        "start": 5495.72,
        "end": 5498.72
    },
    {
        "text": " Antes de ser todos, todos, todos, porque tení un an, an, an, an.",
        "start": 5500.72,
        "end": 5503.72
    },
    {
        "text": " Ahora tengo un or. El or con uno ya la hay ganse.",
        "start": 5504.72,
        "end": 5507.72
    },
    {
        "text": " Si hay una posición en A.",
        "start": 5507.72,
        "end": 5509.72
    },
    {
        "text": " ¿Ve bien?",
        "start": 5511.72,
        "end": 5512.72
    },
    {
        "text": " No sé, porque a veces la flechita, a veces la pelotina.",
        "start": 5512.72,
        "end": 5514.72
    },
    {
        "text": " Si hay una, y a mí me hace un sumido acá, esto.",
        "start": 5515.72,
        "end": 5517.72
    },
    {
        "text": " Está mandando una corriente, ¿vale?",
        "start": 5519.72,
        "end": 5521.72
    },
    {
        "text": " Me da ahora, parece la pelotina.",
        "start": 5522.72,
        "end": 5523.72
    },
    {
        "text": " Si hay una posición en A, menor que alguna posición en B, o sea, sí, esto se se true.",
        "start": 5524.72,
        "end": 5529.72
    },
    {
        "text": " Ya el or, ¿cómo quedó?",
        "start": 5529.72,
        "end": 5531.72
    },
    {
        "text": " True.",
        "start": 5532.72,
        "end": 5533.72
    },
    {
        "text": " Y la siguiente iteración, aunque todas sean false, como veis ya es true,",
        "start": 5533.72,
        "end": 5537.72
    },
    {
        "text": " va a ser true o algo. ¿No importa qué es algo? Es true.",
        "start": 5537.72,
        "end": 5540.72
    },
    {
        "text": " Una vez que cae un true, quedó true.",
        "start": 5540.72,
        "end": 5542.72
    },
    {
        "text": " La única chance para que quede false es que no saca de la asignación inicial, o sea que nunca se esto se va true.",
        "start": 5542.72,
        "end": 5550.72
    },
    {
        "text": " Pero si hay una posición en A, menor que una posición en B, ya está.",
        "start": 5552.72,
        "end": 5556.72
    },
    {
        "text": " Entonces, está mirando, ¿se existe un elemento en A, menor de un elemento en B?",
        "start": 5556.72,
        "end": 5559.72
    },
    {
        "text": " ¿No importa qué posición? Si existe.",
        "start": 5559.72,
        "end": 5562.72
    },
    {
        "text": " ¿Cómo la toma el software de True?",
        "start": 5562.72,
        "end": 5564.72
    },
    {
        "text": " ¿Será que es un otro true? ¿Es un otro?",
        "start": 5564.72,
        "end": 5566.72
    },
    {
        "text": " ¿El circuito corto, si va?",
        "start": 5566.72,
        "end": 5568.72
    },
    {
        "text": " A ver.",
        "start": 5568.72,
        "end": 5569.72
    },
    {
        "text": " El circuito corto es, lo vamos a usar bastante, es la evaluación leicio peresosa, ¿no?",
        "start": 5572.72,
        "end": 5576.72
    },
    {
        "text": " Cuando tengo un AND, yo valú el lado izquierdo del AND.",
        "start": 5576.72,
        "end": 5580.72
    },
    {
        "text": " Si me da true, también, resina y digo, soy peresoso, entonces, wow,",
        "start": 5580.72,
        "end": 5584.72
    },
    {
        "text": " tú voy a tener que ir evaluar el lado derecho del AND.",
        "start": 5584.72,
        "end": 5587.72
    },
    {
        "text": " Pero si me da false, soy peresoso, digo, ¿pa qué voy evaluar el lado derecho del AND?",
        "start": 5587.72,
        "end": 5590.72
    },
    {
        "text": " Si ya se hace que esto no se va a arreglar, false.",
        "start": 5590.72,
        "end": 5593.72
    },
    {
        "text": " ¿Está bien? Y el OR es al revés.",
        "start": 5593.72,
        "end": 5595.72
    },
    {
        "text": " El OR si el primero es true, no valúa el segundo, pues ya sabe que es true.",
        "start": 5595.72,
        "end": 5599.72
    },
    {
        "text": " La hay cansa con uno. ¿Está bien?",
        "start": 5599.72,
        "end": 5602.72
    },
    {
        "text": " ¿No se te pone, como está el segundo?",
        "start": 5602.72,
        "end": 5604.72
    },
    {
        "text": " Y si es false, ahí dice, bueno, tengo que ir a buscar el segundo.",
        "start": 5604.72,
        "end": 5606.72
    },
    {
        "text": " Eso quiere decir peresoso, ¿no? O la hice.",
        "start": 5606.72,
        "end": 5609.72
    },
    {
        "text": " ¿Tamos de acuerdo?",
        "start": 5609.72,
        "end": 5611.72
    },
    {
        "text": " Bueno, ¿cómo se optimiza esto que claramente que ordenes este código?",
        "start": 5611.72,
        "end": 5615.72
    },
    {
        "text": " ¿En Ecuador?",
        "start": 5615.72,
        "end": 5616.72
    },
    {
        "text": " En Ecuador, pues, cambió un AND por un OR, pero eso no influye en el tiempo.",
        "start": 5616.72,
        "end": 5620.72
    },
    {
        "text": " Son dos fueranidades en Ecuador.",
        "start": 5620.72,
        "end": 5622.72
    },
    {
        "text": " Ya eso, rápido, lo miramos y nos vamos a cuenta, ¿no?",
        "start": 5622.72,
        "end": 5625.72
    },
    {
        "text": " Viene, que ya están, una hora y media el gorismo, y ya están mirando el código, y no, esto es en Ecuador.",
        "start": 5625.72,
        "end": 5629.72
    },
    {
        "text": " Bien.",
        "start": 5629.72,
        "end": 5631.72
    },
    {
        "text": " Con los mínimos y máximos, lo puedo, o sí.",
        "start": 5631.72,
        "end": 5634.72
    },
    {
        "text": " No, no es, lo pinta la tecón y lo pude, o no, para ver, busca un contrario.",
        "start": 5634.72,
        "end": 5639.72
    },
    {
        "text": " El mínimo le da, ya, más o, al máximo de vez, y la vuelta.",
        "start": 5639.72,
        "end": 5646.72
    },
    {
        "text": " Exacto. Exacto.",
        "start": 5646.72,
        "end": 5648.72
    },
    {
        "text": " Mínimo y máximo, lo resuelves.",
        "start": 5648.72,
        "end": 5650.72
    },
    {
        "text": " Lo dejo como usted, este sí, no le puse la solución, pero la respuesta la dio él.",
        "start": 5650.72,
        "end": 5653.72
    },
    {
        "text": " Muy parecido a que vi antes, buscar el mínimo y máximo, pero que, mínimo de que,",
        "start": 5653.72,
        "end": 5657.72
    },
    {
        "text": " la pregunta de qué arreglo y máximo de cuál.",
        "start": 5657.72,
        "end": 5660.72
    },
    {
        "text": " Pero bueno, piensenlo y es fácil.",
        "start": 5660.72,
        "end": 5663.72
    },
    {
        "text": " ¿Pues me hicimos que sea el máximo de más o más?",
        "start": 5663.72,
        "end": 5666.72
    },
    {
        "text": " O lo puedo llegar contra todos, pero si queréis checar dos elementos,",
        "start": 5666.72,
        "end": 5669.72
    },
    {
        "text": " solo de unos, el mínimo y de otros, el máximo.",
        "start": 5669.72,
        "end": 5672.72
    },
    {
        "text": " Piéselo, ese es muy parecido de lo que vimos.",
        "start": 5675.72,
        "end": 5678.72
    },
    {
        "text": " Vamos a cosas un poquito diferente, para ver un par de ejemplos más,",
        "start": 5678.72,
        "end": 5683.72
    },
    {
        "text": " porque hay dos que van a aparecer parecidos en el práidio y les quiero dar la base",
        "start": 5683.72,
        "end": 5686.72
    },
    {
        "text": " para que después el práidio les suelte conocido.",
        "start": 5686.72,
        "end": 5689.72
    },
    {
        "text": " Este todavía no, pero después vienen dos.",
        "start": 5689.72,
        "end": 5691.72
    },
    {
        "text": " Miren este, se parece mucho a que vimos antes, pero yo diría que es un poco más difícil.",
        "start": 5691.72,
        "end": 5696.72
    },
    {
        "text": " Tengo el Baywall Folls, no sé si lo notaron, pero vieron que cuando yo ponía el ant,",
        "start": 5699.72,
        "end": 5704.72
    },
    {
        "text": " en muchas condiciones, ponía Tru, y cuando puse el or puse Folls,",
        "start": 5704.72,
        "end": 5709.72
    },
    {
        "text": " me dice, ¿cómo chequeo que todos los elementos de estructura cumple en algo,",
        "start": 5710.72,
        "end": 5713.72
    },
    {
        "text": " y la cumple este y la cumple este y la cumple este, no?",
        "start": 5713.72,
        "end": 5716.72
    },
    {
        "text": " O sea, el para todo es un ant, arrancando de Tru, que es el neutro del ant.",
        "start": 5716.72,
        "end": 5720.72
    },
    {
        "text": " Cuando yo quiero ver en una estructura que al menos uno cumple una condición,",
        "start": 5721.72,
        "end": 5725.72
    },
    {
        "text": " un existe, puse un or, o este, o este, o este, pero arranco de Folls,",
        "start": 5725.72,
        "end": 5730.72
    },
    {
        "text": " porque por ahora nadie no encontré nadie.",
        "start": 5730.72,
        "end": 5732.72
    },
    {
        "text": " Eso es todo modelo del ant-contrú y el or con Folls,",
        "start": 5732.72,
        "end": 5736.72
    },
    {
        "text": " los pueden generalizar para buscar cosas que sean del forma para todo o existen",
        "start": 5736.72,
        "end": 5740.72
    },
    {
        "text": " cualquier estructura. Dan patrones, ¿eh?",
        "start": 5740.72,
        "end": 5743.72
    },
    {
        "text": " Cuando yo quiero buscar, ¿qué hago secundas?",
        "start": 5743.72,
        "end": 5745.72
    },
    {
        "text": " Acá uso el patrón del existe, porque tengo V-Wall Folls,",
        "start": 5745.72,
        "end": 5749.72
    },
    {
        "text": " y acá que dice, dentro los dos foranidados, a V y le asino,",
        "start": 5749.72,
        "end": 5753.72
    },
    {
        "text": " lo que ya tenía V, or, pero el or tiene una condición grande,",
        "start": 5753.72,
        "end": 5758.72
    },
    {
        "text": " que ha subido igual a su jota, y además que hice a distinto de jota.",
        "start": 5758.72,
        "end": 5763.72
    },
    {
        "text": " El or tiene más de 3 de la etapa.",
        "start": 5763.72,
        "end": 5765.72
    },
    {
        "text": " Amas tiene paréntesis para que no te confundas, así que...",
        "start": 5765.72,
        "end": 5768.72
    },
    {
        "text": " Entonces, todos los circunstos de a todos,",
        "start": 5768.72,
        "end": 5772.72
    },
    {
        "text": " y ahora sí igual, y ahora hay...",
        "start": 5772.72,
        "end": 5776.72
    },
    {
        "text": " ¿Cuánto hace el tipo de ajo de la diagradación?",
        "start": 5776.72,
        "end": 5780.72
    },
    {
        "text": " O sea, en pocas palabras, la trucia, ¿eh?",
        "start": 5780.72,
        "end": 5784.72
    },
    {
        "text": " O sea, está chequeando si algún elemento se repite,",
        "start": 5784.72,
        "end": 5789.72
    },
    {
        "text": " y para que se repita, ¿es importante esta condición?",
        "start": 5789.72,
        "end": 5794.72
    },
    {
        "text": " No. ¿Qué pasa si la ha hecho?",
        "start": 5794.72,
        "end": 5797.72
    },
    {
        "text": " ¿Qué pasa si tacho esta y distinto de jota?",
        "start": 5797.72,
        "end": 5800.72
    },
    {
        "text": " ¿Qué me va a dar siempre?",
        "start": 5800.72,
        "end": 5803.72
    },
    {
        "text": " ¿Por qué me da siempre trúel código?",
        "start": 5803.72,
        "end": 5805.72
    },
    {
        "text": " Y como esto son todas las posiciones, y jota,",
        "start": 5805.72,
        "end": 5807.72
    },
    {
        "text": " en algún momento, va a chequear que la misma posición para ahí para jote,",
        "start": 5807.72,
        "end": 5810.72
    },
    {
        "text": " y obviamente la rey lo mismo, lo mismo, lo mismo.",
        "start": 5810.72,
        "end": 5812.72
    },
    {
        "text": " Entonces, para que un elemento se repita, uno dice,",
        "start": 5812.72,
        "end": 5815.72
    },
    {
        "text": " bueno, buscápelo en el lugar distinto,",
        "start": 5815.72,
        "end": 5817.72
    },
    {
        "text": " que no sea el mismo lugar, porque si no, obviamente,",
        "start": 5817.72,
        "end": 5819.72
    },
    {
        "text": " el mismo lugar está lo mismo.",
        "start": 5819.72,
        "end": 5821.72
    },
    {
        "text": " Está chequeando si algún elemento está repetido.",
        "start": 5821.72,
        "end": 5825.72
    },
    {
        "text": " Y cómo lo puedo hacer en orden?",
        "start": 5825.72,
        "end": 5828.72
    },
    {
        "text": " Claramente, ¿sordan esto N?",
        "start": 5828.72,
        "end": 5830.72
    },
    {
        "text": " Cuadrado.",
        "start": 5830.72,
        "end": 5831.72
    },
    {
        "text": " Lo do anterior vimos forma fácil de llevarlo orden N. ¿Y este?",
        "start": 5831.72,
        "end": 5837.72
    },
    {
        "text": " Saber si un elemento está repetido en orden N.",
        "start": 5837.72,
        "end": 5841.72
    },
    {
        "text": " ¿Es que si hagas de jota, ¿sí si te lo contará?",
        "start": 5847.72,
        "end": 5851.72
    },
    {
        "text": " No, capaz que el primero no se repite, pero el segundo sí.",
        "start": 5852.72,
        "end": 5855.72
    },
    {
        "text": " Si pongo la buliara tampoco side, porque...",
        "start": 5860.72,
        "end": 5863.72
    },
    {
        "text": " ¿Cómo?",
        "start": 5866.72,
        "end": 5867.72
    },
    {
        "text": " ¿Por qué está bien eso?",
        "start": 5868.72,
        "end": 5869.72
    },
    {
        "text": " Bueno, repite, ¿por qué está bien esto?",
        "start": 5869.72,
        "end": 5871.72
    },
    {
        "text": " ¿Esto qué está chequeando si hay algún elemento repetido?",
        "start": 5871.72,
        "end": 5875.72
    },
    {
        "text": " ¿Datru?",
        "start": 5875.72,
        "end": 5876.72
    },
    {
        "text": " ¿Por qué?",
        "start": 5878.72,
        "end": 5879.72
    },
    {
        "text": " Si tiene que ver que alguna posición y de la rilo a,",
        "start": 5879.72,
        "end": 5883.72
    },
    {
        "text": " si igual, alguna posición j, pero no la misma posición.",
        "start": 5883.72,
        "end": 5887.72
    },
    {
        "text": " La o a su 2 con el a su 5. ¿Son iguales?",
        "start": 5888.72,
        "end": 5890.72
    },
    {
        "text": " Sí, entonces ese elemento está repetido.",
        "start": 5890.72,
        "end": 5892.72
    },
    {
        "text": " ¿Eso es la rilo?",
        "start": 5896.72,
        "end": 5897.72
    },
    {
        "text": " Estoy viendo, sin un rilo, hay algún elemento repetido.",
        "start": 5897.72,
        "end": 5902.72
    },
    {
        "text": " Sí o no?",
        "start": 5903.72,
        "end": 5904.72
    },
    {
        "text": " Primera cosa, si no entendemos eso, nos sigamos con la otra.",
        "start": 5905.72,
        "end": 5908.72
    },
    {
        "text": " ¿Entendí que el resto retorna? Entonces, ¿trú? ¿Sí solo sí?",
        "start": 5908.72,
        "end": 5912.72
    },
    {
        "text": " ¿Podrías hacer un solo por la...",
        "start": 5914.72,
        "end": 5917.72
    },
    {
        "text": " ¿Por cada aparición de una variable sumada de la encontador?",
        "start": 5917.72,
        "end": 5921.72
    },
    {
        "text": " La puse a propósito, soy malo.",
        "start": 5924.72,
        "end": 5926.72
    },
    {
        "text": " ¿Y bien? ¿Me quedaron curos, tenemos?",
        "start": 5929.72,
        "end": 5931.72
    },
    {
        "text": " Pero esto es que hay que empezar a propósito, ¿por qué?",
        "start": 5939.72,
        "end": 5942.72
    },
    {
        "text": " Porque no siempre es fácil saber si lo puedo optimizar.",
        "start": 5942.72,
        "end": 5947.72
    },
    {
        "text": " Uno dice, ¿tomo cualquier código?",
        "start": 5947.72,
        "end": 5949.72
    },
    {
        "text": " Ah, se me ocurrió esta mejora y hasta cuánto lo puedo mejorar.",
        "start": 5949.72,
        "end": 5952.72
    },
    {
        "text": " Así que el punto que uno dice, ¿ya está, es inmejorable?",
        "start": 5952.72,
        "end": 5955.72
    },
    {
        "text": " Entonces, ¿cuánto es eso?",
        "start": 5955.72,
        "end": 5957.72
    },
    {
        "text": " Bueno, muchos problemas tienen estudiadores, le llamar la Cota Inferior, digamos.",
        "start": 5957.72,
        "end": 5961.72
    },
    {
        "text": " Ya no se puede optimizar.",
        "start": 5961.72,
        "end": 5963.72
    },
    {
        "text": " El primer es Sorting, que un problema muy conocido,",
        "start": 5963.72,
        "end": 5965.72
    },
    {
        "text": " está demostrado que es imposible ordenar elementos genericos",
        "start": 5965.72,
        "end": 5969.72
    },
    {
        "text": " si uno no sabe nada de los elementos, son enteros arbitrarios, reales, arbitrarios.",
        "start": 5969.72,
        "end": 5973.72
    },
    {
        "text": " No, no conoce nada de los datos, es imposible ordenar en menos de n por logarimba en base de n.",
        "start": 5973.72,
        "end": 5979.72
    },
    {
        "text": " Imposible, quicksore, en marchón son óptimos, ¿por qué logran eso?",
        "start": 5979.72,
        "end": 5982.72
    },
    {
        "text": " No te digas, te buscando más eficientes que lo he demostrado que no se puede.",
        "start": 5982.72,
        "end": 5985.72
    },
    {
        "text": " Pero hay problemas, cada vez uno puede inventar un problema nuevo,",
        "start": 5985.72,
        "end": 5989.72
    },
    {
        "text": " que no está tan claro cuál es la mínima Cota, o sea, ¿qué tan eficiente lo puedo hacer?",
        "start": 5989.72,
        "end": 5994.72
    },
    {
        "text": " Esto lo puse a propósito para que uno diga, y se puede no se puede,",
        "start": 5994.72,
        "end": 5998.72
    },
    {
        "text": " se parece bastante a nosotros, pero hay algo que es distinto que no,",
        "start": 5998.72,
        "end": 6001.72
    },
    {
        "text": " no estoy pudiendo ver cómo hago para chequear eso.",
        "start": 6001.72,
        "end": 6004.72
    },
    {
        "text": " Y entonces, ¿qué voy a hacer ahora?",
        "start": 6006.72,
        "end": 6008.72
    },
    {
        "text": " ¿Se los dejo a pensar?",
        "start": 6008.72,
        "end": 6010.72
    },
    {
        "text": " Sí, ¿que no pensaré un punto para...",
        "start": 6010.72,
        "end": 6012.72
    },
    {
        "text": " A ver, le pongo algún hipote, si hay por ahí, ¿no?",
        "start": 6012.72,
        "end": 6016.72
    },
    {
        "text": " No, no.",
        "start": 6016.72,
        "end": 6017.72
    },
    {
        "text": " ¿No?",
        "start": 6017.72,
        "end": 6020.72
    },
    {
        "text": " Bueno, mientras lo pienso, lo sigo.",
        "start": 6020.72,
        "end": 6023.72
    },
    {
        "text": " No, la idea es que lo piensen.",
        "start": 6023.72,
        "end": 6025.72
    },
    {
        "text": " Si le doy hipote, si se extraas, por ejemplo, si le diga que la regla está ordenado.",
        "start": 6025.72,
        "end": 6030.72
    },
    {
        "text": " Precondición, el arril lo va a estar ordenado.",
        "start": 6030.72,
        "end": 6033.72
    },
    {
        "text": " ¿Cómo chequearía si algún elemento está repetido?",
        "start": 6033.72,
        "end": 6036.72
    },
    {
        "text": " Si está repetido está consecutivo, así chequearía los azubis con los azubis más uno.",
        "start": 6036.72,
        "end": 6042.72
    },
    {
        "text": " ¿Sí?",
        "start": 6042.72,
        "end": 6043.72
    },
    {
        "text": " Si está algunos repetidos, te está pegados.",
        "start": 6043.72,
        "end": 6046.72
    },
    {
        "text": " Pero ahí precondiciones, chequear consecutivos a una sola recorrida la regla lo pose en orden M.",
        "start": 6046.72,
        "end": 6052.72
    },
    {
        "text": " Pero con ese hipote, si se entiende.",
        "start": 6052.72,
        "end": 6055.72
    },
    {
        "text": " ¿Sí?",
        "start": 6055.72,
        "end": 6056.72
    },
    {
        "text": " ¿Posa si le da esa manera de ordeno o de...",
        "start": 6056.72,
        "end": 6058.72
    },
    {
        "text": " Pero ya, como muy rápidos, en el oye.",
        "start": 6058.72,
        "end": 6061.72
    },
    {
        "text": " Menor que en equadrado sí.",
        "start": 6061.72,
        "end": 6063.72
    },
    {
        "text": " Ahora, lo puedo hacer en orden N como hicimos nosotros, esa es la pregunta.",
        "start": 6063.72,
        "end": 6066.72
    },
    {
        "text": " ¿No hay uno de los últimos buscados?",
        "start": 6066.72,
        "end": 6068.72
    },
    {
        "text": " Sí, de busque así.",
        "start": 6068.72,
        "end": 6070.72
    },
    {
        "text": " ¿Pero qué? ¿Se va a tener en N?",
        "start": 6070.72,
        "end": 6072.72
    },
    {
        "text": " Sí, pero acá no estoy buscando.",
        "start": 6072.72,
        "end": 6074.72
    },
    {
        "text": " ¿A qué lo quiere decir?",
        "start": 6074.72,
        "end": 6075.72
    },
    {
        "text": " Si algún elemento está repetido.",
        "start": 6075.72,
        "end": 6077.72
    },
    {
        "text": " ¿No es lo mismo que decir, busca metal elemento de si está uno está?",
        "start": 6077.72,
        "end": 6080.72
    },
    {
        "text": " Si no te va a hacer N buscas.",
        "start": 6081.72,
        "end": 6083.72
    },
    {
        "text": " Cada una es orden N, pero N buscas de orden N es en equadrado.",
        "start": 6083.72,
        "end": 6086.72
    },
    {
        "text": " Entonces, piensenlo.",
        "start": 6086.72,
        "end": 6089.72
    },
    {
        "text": " ¿Diría un segundo? ¿Eh?",
        "start": 6089.72,
        "end": 6091.72
    },
    {
        "text": " El primero ordena como dijo él, y abajo comparando N con N con N.",
        "start": 6091.72,
        "end": 6094.72
    },
    {
        "text": " ¿Podría ordenar punticoma después chequear consecutivo repetido?",
        "start": 6094.72,
        "end": 6098.72
    },
    {
        "text": " ¿No?",
        "start": 6098.72,
        "end": 6099.72
    },
    {
        "text": " De macar N en el o N si uso el quicksor, aunque no sepan, como es, le dice el invoco, ya está.",
        "start": 6099.72,
        "end": 6103.72
    },
    {
        "text": " Punticoma consecutivo repetido, chequeando los azubis con hace vi más uno, me queda orden N.",
        "start": 6103.72,
        "end": 6108.72
    },
    {
        "text": " El peor de los dos me queda en el o N.",
        "start": 6108.72,
        "end": 6110.72
    },
    {
        "text": " ¿Mejor qué en equadrado? Sí, le gane.",
        "start": 6110.72,
        "end": 6112.72
    },
    {
        "text": " Ahora, llegar a orden N, es la espinita que le dejo clavada.",
        "start": 6112.72,
        "end": 6117.72
    },
    {
        "text": " Si puedo hacer algo todavía más rápido que es.",
        "start": 6117.72,
        "end": 6120.72
    },
    {
        "text": " Capa que veo un ejemplo ahora que me está faltando dos, ejemplo y toma.",
        "start": 6120.72,
        "end": 6123.72
    },
    {
        "text": " Y algo se le ocurre, pero bajo ciertas hipótesis, si no pongo hipótesis.",
        "start": 6123.72,
        "end": 6127.72
    },
    {
        "text": " Entonces, les presento 13 carcillos y con 3 soluciones, hacen clic y en el ebalot tienen.",
        "start": 6130.72,
        "end": 6137.72
    },
    {
        "text": " Son 3 carcillos más a lo que hay en el práetio.",
        "start": 6138.72,
        "end": 6140.72
    },
    {
        "text": " Para que no se vean tentado y en mirar rápido la solución son relativamente fáciles parecidos los que vimos.",
        "start": 6140.72,
        "end": 6145.72
    },
    {
        "text": " Pero de alguna manera hay uno que usa memoria extra para resolver un problema más rápido.",
        "start": 6145.72,
        "end": 6149.72
    },
    {
        "text": " Entonces, después que hayan el cosa, si quieren mirar, vayan ahí.",
        "start": 6149.72,
        "end": 6152.72
    },
    {
        "text": " ¿Estás?",
        "start": 6152.72,
        "end": 6153.72
    },
    {
        "text": " Hacen clic y van, les abre ese archivo.",
        "start": 6153.72,
        "end": 6155.72
    },
    {
        "text": " Dos problemitas más y con esto nos vamos.",
        "start": 6156.72,
        "end": 6159.72
    },
    {
        "text": " Los dos problemitas que voy a ver están en el práetio de cierta forma.",
        "start": 6159.72,
        "end": 6163.72
    },
    {
        "text": " El primero como una generalización de este.",
        "start": 6164.72,
        "end": 6167.72
    },
    {
        "text": " Supóganse ahora y van a ver si suy contradictorio con lo que dije recién.",
        "start": 6167.72,
        "end": 6171.72
    },
    {
        "text": " Sort 0 1 2, lo que hace es ordena, quiero que ordene, un arreglo, pero que tiene valores 0 1 2.",
        "start": 6172.72,
        "end": 6180.72
    },
    {
        "text": " Que lo ordenes? Por ejemplo, si me dijeron este arreglo, que tiene el 0 2 1 0 0,",
        "start": 6182.72,
        "end": 6187.72
    },
    {
        "text": " me voy a dar el arreglo 0 0 0 1 2 2.",
        "start": 6187.72,
        "end": 6190.72
    },
    {
        "text": " Pero quiero que lo ordenen en orden en N.",
        "start": 6191.72,
        "end": 6194.72
    },
    {
        "text": " Estoy siendo contradictorio no con lo que dije recién.",
        "start": 6197.72,
        "end": 6200.72
    },
    {
        "text": " ¿Por qué?",
        "start": 6200.72,
        "end": 6201.72
    },
    {
        "text": " ¿Qué es cuál es la precondición?",
        "start": 6201.72,
        "end": 6204.72
    },
    {
        "text": " Es alto. Cuando uno sabe alguna información de los datos, de las claves,",
        "start": 6204.72,
        "end": 6209.72
    },
    {
        "text": " ya no está en la misma hipótesia del teorema general, que no sabía nada y podían ser infinitos valores distintos.",
        "start": 6209.72,
        "end": 6215.72
    },
    {
        "text": " Acá sé que los valores son tres posibles, 0 1 2.",
        "start": 6215.72,
        "end": 6218.72
    },
    {
        "text": " ¿Tú capaz que pueda ser algo conociendo esa información mucho más rápido?",
        "start": 6219.72,
        "end": 6223.72
    },
    {
        "text": " Pues lo más como sería, ya no, a cualquier algoritmo de ordenación que lo procese la regle, me lo de.",
        "start": 6223.72,
        "end": 6229.72
    },
    {
        "text": " Pero ninguno me lo va a dar en orden en N.",
        "start": 6229.72,
        "end": 6231.72
    },
    {
        "text": " Los todos los genéricos son como más es deficiente en el ON y los más intuitivos en equadrado.",
        "start": 6231.72,
        "end": 6238.72
    },
    {
        "text": " Son peores.",
        "start": 6238.72,
        "end": 6239.72
    },
    {
        "text": " ¿Se le ocurre como ordenar una reglo que solo tiene 0 1 y 2?",
        "start": 6239.72,
        "end": 6244.72
    },
    {
        "text": " Bien, se llama algoritmo de ordenación por conteo.",
        "start": 6248.72,
        "end": 6251.72
    },
    {
        "text": " Lo vieron en pronunciación, no?",
        "start": 6251.72,
        "end": 6254.72
    },
    {
        "text": " No, no.",
        "start": 6254.72,
        "end": 6255.72
    },
    {
        "text": " Bien.",
        "start": 6255.72,
        "end": 6256.72
    },
    {
        "text": " ¿Te quiero una situación que no digo nada?",
        "start": 6256.72,
        "end": 6257.72
    },
    {
        "text": " No, a ver se lo ven como ejemplos.",
        "start": 6257.72,
        "end": 6259.72
    },
    {
        "text": " Sí, lo vimos por el último tema pero no, pero no.",
        "start": 6259.72,
        "end": 6262.72
    },
    {
        "text": " ¿No se hizo el enocato de la idea?",
        "start": 6262.72,
        "end": 6264.72
    },
    {
        "text": " Bien.",
        "start": 6264.72,
        "end": 6265.72
    },
    {
        "text": " Miren este procedimiento que recién a reglo ADT a maño N.",
        "start": 6265.72,
        "end": 6270.72
    },
    {
        "text": " Como voy a contar, me llevo dos contadores, gini contadores 0 y 1 por descarte, el resto son los dos.",
        "start": 6270.72,
        "end": 6276.72
    },
    {
        "text": " Esta, por esta primera iteración lo que hace es lo que decía él.",
        "start": 6276.72,
        "end": 6282.72
    },
    {
        "text": " Primero voy a contar cuántos 0, 0, 0, 1, 0 y cuántos 2, 0.",
        "start": 6282.72,
        "end": 6286.72
    },
    {
        "text": " Entonces, dice, hace un for y va preguntando si la subí 0, cuenta en la variol de contador 0 si es 1, contador de 1 y 6, 2 por descarte 2.",
        "start": 6286.72,
        "end": 6296.72
    },
    {
        "text": " Después de procesar esto me dice, hay 3, 1 y 5, 0.",
        "start": 6296.72,
        "end": 6300.72
    },
    {
        "text": " Y el resto sé que son dos.",
        "start": 6300.72,
        "end": 6303.72
    },
    {
        "text": " Entonces, ¿qué hago ahora?",
        "start": 6303.72,
        "end": 6305.72
    },
    {
        "text": " Otro recorrido, poniendo tanto 0 como cantidad de 0, después tanto 1 como cantidad de 1 y después los dos.",
        "start": 6305.72,
        "end": 6311.72
    },
    {
        "text": " Y ya me quedo adenado.",
        "start": 6311.72,
        "end": 6312.72
    },
    {
        "text": " ¿Estás más acuerdo?",
        "start": 6312.72,
        "end": 6314.72
    },
    {
        "text": " Si lo conté que había 3, 0, 5 o 1 y el resto son dos, recorro por 3, meto todos los 0 y ahí, recorro por 5, meto todos los 1 y después todo lo que me quedan, meto 2.",
        "start": 6314.72,
        "end": 6326.72
    },
    {
        "text": " Si yo no, podría hacer un solo for o 3 for para los 3 segmentos, meter 0, meter 1, meter 2.",
        "start": 6326.72,
        "end": 6336.72
    },
    {
        "text": " ¿Qué hace este? Bueno, los 3 for, que dice, mira, si había 3, 0, entonces vas desde 0 hasta 2, poniendo a su bien 0.",
        "start": 6336.72,
        "end": 6345.72
    },
    {
        "text": " Después vas desde esa posición, hasta contador de 0 más contador de 1, poniendo en ese lugar los 1.",
        "start": 6345.72,
        "end": 6352.72
    },
    {
        "text": " Y el resto desde esa posición, hasta el final son todos dos. ¿Cuál es el orden de todo este código?",
        "start": 6353.72,
        "end": 6360.72
    },
    {
        "text": " No.",
        "start": 6360.72,
        "end": 6362.72
    },
    {
        "text": " Pensamos para acá arriba, constante, constante, constante, orden esto, N.",
        "start": 6362.72,
        "end": 6368.72
    },
    {
        "text": " Y los 3 for, si los agrupo, porque ahora vas a fácil agrupar los 3, porque me combina agrupar estos 3.",
        "start": 6368.72,
        "end": 6373.72
    },
    {
        "text": " Para verlo, ¿cuánto se hizo?",
        "start": 6373.72,
        "end": 6376.72
    },
    {
        "text": " Ya, pues no sé dónde, cuánto 0, cuánto 1 y cuánto 2, pero sé que se distribuyen este segmento entre N.",
        "start": 6376.72,
        "end": 6381.72
    },
    {
        "text": " ¿Todo eso es orden N?",
        "start": 6381.72,
        "end": 6384.72
    },
    {
        "text": " Entonces, esto me queda orden N y todo esto me queda orden N. ¿El código total que orden es?",
        "start": 6384.72,
        "end": 6390.72
    },
    {
        "text": " N, porque están en secuencia, no están anidados, no se multiplican.",
        "start": 6390.72,
        "end": 6395.72
    },
    {
        "text": " Y acá viene la pregunta que desencadera el ejercicio del Prifio que tiene que resolver.",
        "start": 6395.72,
        "end": 6400.72
    },
    {
        "text": " ¿Puedo generalizar esto?",
        "start": 6400.72,
        "end": 6404.72
    },
    {
        "text": " Y no, está demostrado que no. ¿Pero qué pasaría si yo sé que ahora los valores no son ser unidos, pero si son en un rango 0K y cae su constante, no una variable conocida?",
        "start": 6405.72,
        "end": 6417.72
    },
    {
        "text": " Pues ser 10. ¿Puedes ser el mismo todo?",
        "start": 6417.72,
        "end": 6420.72
    },
    {
        "text": " Pero en vez de tener, ¿cómo para poner punto de suspensión contador y 0 contador de 1? ¿Punto de suspensión contador de K? ¿No?",
        "start": 6420.72,
        "end": 6426.72
    },
    {
        "text": " ¿O qué puedo tener en vez de tener variables sueltas?",
        "start": 6426.72,
        "end": 6429.72
    },
    {
        "text": " ¿No? ¿No? ¿No te cuento lo que pasa en el réldo?",
        "start": 6430.72,
        "end": 6432.72
    },
    {
        "text": " Una reglo de contadores. ¿Tengo K claves?",
        "start": 6432.72,
        "end": 6435.72
    },
    {
        "text": " ¿Ve a tener muchas contadores sueltas? ¿Tengo una regla?",
        "start": 6435.72,
        "end": 6438.72
    },
    {
        "text": " Y cada posición guarda cuantos elementos ahí igual a él. ¿Qué dolor?",
        "start": 6438.72,
        "end": 6443.72
    },
    {
        "text": " ¿Este es el truco? ¿Este es el truco? ¿Qué dolor?",
        "start": 6443.72,
        "end": 6447.72
    },
    {
        "text": " ¿Qué dolor? No. ¿Y si me estás cuesta en el réldo de 1?",
        "start": 6447.72,
        "end": 6453.72
    },
    {
        "text": " Bueno, y último. Último y con éste nos vamos.",
        "start": 6453.72,
        "end": 6457.72
    },
    {
        "text": " Que también está un poquito en el práctico, de cierta forma y tiene que ver con algo que dije todavía no le aplica.",
        "start": 6457.72,
        "end": 6464.72
    },
    {
        "text": " Y a ver, capaz que se le prenda un poquito de la amparita con ese que vimos un rato que dije, ese pudo no se puede.",
        "start": 6464.72,
        "end": 6470.72
    },
    {
        "text": " Supongan que quiero chequear si dos arreglos son permutaciones.",
        "start": 6470.72,
        "end": 6476.72
    },
    {
        "text": " Dos arreglos tamaño N, valores en el rango 0K, retornetrus y solsilos arreglos son permutaciones.",
        "start": 6476.72,
        "end": 6484.72
    },
    {
        "text": " ¿Qué es un valor constante? ¿Entonces supone que N5 y K3?",
        "start": 6484.72,
        "end": 6491.72
    },
    {
        "text": " ¿Entonces fíjense en los dos arreglos esto?",
        "start": 6491.72,
        "end": 6494.72
    },
    {
        "text": " Ah, este no es el quiso que lleva.",
        "start": 6494.72,
        "end": 6498.72
    },
    {
        "text": " Bueno, este.",
        "start": 6498.72,
        "end": 6503.72
    },
    {
        "text": " Es permutación. Era un sol arreglo.",
        "start": 6504.72,
        "end": 6506.72
    },
    {
        "text": " El otro es una variante de este, pero primero va el básico, digamos.",
        "start": 6506.72,
        "end": 6509.72
    },
    {
        "text": " Una arreglo y quiero ver que si arreglo de tamaño N tiene permutaciones de los valores entre 0 y N-1.",
        "start": 6509.72,
        "end": 6516.72
    },
    {
        "text": " ¿Qué quiere decir permutaciones por la duda que no se acuerdan o no sepa?",
        "start": 6516.72,
        "end": 6520.72
    },
    {
        "text": " ¿Esto es el que ha estado en los valores?",
        "start": 6520.72,
        "end": 6523.72
    },
    {
        "text": " No, pero esos son permutaciones de combinatoria.",
        "start": 6523.72,
        "end": 6526.72
    },
    {
        "text": " Permutaciones que decir, tiene una permutación de los valores 0 o 5, que quiere decir, que están todos esos valores en algún orden.",
        "start": 6526.72,
        "end": 6532.72
    },
    {
        "text": " El 0, 1 y 4, están todos, pero en alguna combinación.",
        "start": 6533.72,
        "end": 6538.72
    },
    {
        "text": " Eso es una permutación. ¿También? Por ejemplo, ¿100 es 5?",
        "start": 6538.72,
        "end": 6543.72
    },
    {
        "text": " Fíjense que este arreglo, 1, 3, 0, 4, 2, es una permutación de los valores de 0 al 5, de 0 al 4.",
        "start": 6543.72,
        "end": 6550.72
    },
    {
        "text": " Porque están todos los valores de 0 al 4 en algún orden.",
        "start": 6550.72,
        "end": 6553.72
    },
    {
        "text": " Está 1 hasta el 3, está el 0 y 4 y el 2.",
        "start": 6553.72,
        "end": 6556.72
    },
    {
        "text": " Este no. ¿Por qué este no?",
        "start": 6556.72,
        "end": 6559.72
    },
    {
        "text": " ¿Por qué este no? Porque hay uno que está repetido y además falta el 3.",
        "start": 6559.72,
        "end": 6565.72
    },
    {
        "text": " Debe haber una única parición de cada vez.",
        "start": 6565.72,
        "end": 6567.72
    },
    {
        "text": " Un detalle importante, dice, no tiene que estar repetido el elemento.",
        "start": 6567.72,
        "end": 6571.72
    },
    {
        "text": " ¿Y tiene una paración?",
        "start": 6571.72,
        "end": 6572.72
    },
    {
        "text": " Y tiene una versión a vez. ¿Por qué este tampoco es permutación?",
        "start": 6572.72,
        "end": 6574.72
    },
    {
        "text": " Acá no he repetido. 1, 3, 0, 8, 2.",
        "start": 6574.72,
        "end": 6577.72
    },
    {
        "text": " ¿Y no falta el 4? ¿Por qué el 8 se sale de rango?",
        "start": 6577.72,
        "end": 6581.72
    },
    {
        "text": " Yo dije permutación de 0 a 4, porque en el 5, este está salido a rango y si sale a rango, uno falta.",
        "start": 6581.72,
        "end": 6587.72
    },
    {
        "text": " ¿Quiś ir a resolver esto en orden en Nini?",
        "start": 6588.72,
        "end": 6592.72
    },
    {
        "text": " Chequear si me da una regla y yo digo truces y se cumple el primer caso, por ejemplo, y false en los otros 2 casos, porque no son permutaciones.",
        "start": 6592.72,
        "end": 6600.72
    },
    {
        "text": " ¿Cómo chequeó eso?",
        "start": 6600.72,
        "end": 6605.72
    },
    {
        "text": " Acá le dije chequear repetido, ya me he dado el oroso, ¿no?",
        "start": 6605.72,
        "end": 6609.72
    },
    {
        "text": " Pero ¿qué sabemos acá?",
        "start": 6609.72,
        "end": 6611.72
    },
    {
        "text": " ¿Y si ya no se enviaron el 1 o el 2 o el 2 o el 3?",
        "start": 6611.72,
        "end": 6615.72
    },
    {
        "text": " Sí, ahora.",
        "start": 6615.72,
        "end": 6617.72
    },
    {
        "text": " La sumatoria, si tuviera N igual 3, ¿qué es la sumatoria?",
        "start": 6622.72,
        "end": 6628.72
    },
    {
        "text": " Tendría que estar a raro el 0, 1 y 2 ¿no? ¿Qué pasa?",
        "start": 6628.72,
        "end": 6631.72
    },
    {
        "text": " Tengo 0, 0, 3. La sumatoria me da. 1 más 2 más 0 es 3.",
        "start": 6631.72,
        "end": 6636.72
    },
    {
        "text": " El tema que ve que no esté repetido.",
        "start": 6637.72,
        "end": 6641.72
    },
    {
        "text": " Lo podría ordenar y bajarlo a N y lo gene.",
        "start": 6648.72,
        "end": 6652.72
    },
    {
        "text": " Si uso el quicksor, pero no ordené.",
        "start": 6652.72,
        "end": 6657.72
    },
    {
        "text": " Por acá dijieron chequear, ¿pero qué sabemos de chequear su elemento está?",
        "start": 6660.72,
        "end": 6663.72
    },
    {
        "text": " Acá tengo información que en el problema aquel no la tenía.",
        "start": 6664.72,
        "end": 6668.72
    },
    {
        "text": " ¿Entrecer bien en E-1? ¿Tú qué puedo tener?",
        "start": 6671.72,
        "end": 6674.72
    },
    {
        "text": " Una reglo me llevo una tablita de buleanos, por ejemplo, entrecer bien en E-1",
        "start": 6676.72,
        "end": 6682.72
    },
    {
        "text": " y cada vez que viene un elemento, digo a B no es el 4, lo pongo ahí.",
        "start": 6682.72,
        "end": 6686.72
    },
    {
        "text": " Si viene de nuevo el 4, ya está false, porque sé cuál es el rango.",
        "start": 6686.72,
        "end": 6690.72
    },
    {
        "text": " Pues ya me como si fuera un arreglo de buleanos para poner una marquita, este ya vino.",
        "start": 6691.72,
        "end": 6695.72
    },
    {
        "text": " Si uno es el vino y viene de nuevo, repetido, fuera.",
        "start": 6695.72,
        "end": 6698.72
    },
    {
        "text": " Ahora si cada vez que viene la primera vez y llevo hasta el final, está bien.",
        "start": 6698.72,
        "end": 6701.72
    },
    {
        "text": " ¿Tamos acuerdo? ¿Este sería un ejemplo donde podría usar memoria extra,",
        "start": 6701.72,
        "end": 6705.72
    },
    {
        "text": " que sería un arreglo extra para ver si algo vino o no vino?",
        "start": 6705.72,
        "end": 6710.72
    },
    {
        "text": " ¿Sí? ¿Es parece que puede funcionar eso?",
        "start": 6710.72,
        "end": 6713.72
    },
    {
        "text": " Sí.",
        "start": 6713.72,
        "end": 6714.72
    },
    {
        "text": " Le voy a mostrar un código que seguramente usted no lo hubiera descrito,",
        "start": 6715.72,
        "end": 6719.72
    },
    {
        "text": " para que vean otra forma de escribir el código.",
        "start": 6719.72,
        "end": 6721.72
    },
    {
        "text": " ¿Ve bien?",
        "start": 6721.72,
        "end": 6722.72
    },
    {
        "text": " ¿A ver? ¿Qué tengo acá entonces?",
        "start": 6725.72,
        "end": 6727.72
    },
    {
        "text": " Dado un arreglo ade, tamaño N, va a devolver un buleano.",
        "start": 6727.72,
        "end": 6731.72
    },
    {
        "text": " ¿Cuándo da un buleano true?",
        "start": 6731.72,
        "end": 6733.72
    },
    {
        "text": " ¿Cuándo es permutación de Cero en E-1 y de Folcino?",
        "start": 6733.72,
        "end": 6736.72
    },
    {
        "text": " ¿Te fino?",
        "start": 6736.72,
        "end": 6738.72
    },
    {
        "text": " Y esto lo está viendo en el prátil, sé qué, ¿no?",
        "start": 6738.72,
        "end": 6741.72
    },
    {
        "text": " ¿Cómo resorrar memoria para un arreglo?",
        "start": 6741.72,
        "end": 6744.72
    },
    {
        "text": " La variable está, es un arreglo de buleanos.",
        "start": 6744.72,
        "end": 6746.72
    },
    {
        "text": " Acá la inicial hizo toda la arreglo de buleanos en Folc.",
        "start": 6746.72,
        "end": 6749.72
    },
    {
        "text": " O sea, el principio nadie está.",
        "start": 6749.72,
        "end": 6751.72
    },
    {
        "text": " Ni el Cero ni el E-1 ni el E-1.",
        "start": 6751.72,
        "end": 6754.72
    },
    {
        "text": " Y fíjense que va a ir así.",
        "start": 6754.72,
        "end": 6756.72
    },
    {
        "text": " ¿Entendía una idea de chequear si está o no está o no se entendía mucho?",
        "start": 6756.72,
        "end": 6759.72
    },
    {
        "text": " Sí.",
        "start": 6759.72,
        "end": 6760.72
    },
    {
        "text": " Ahí no les entendía o no levantía la mano.",
        "start": 6760.72,
        "end": 6762.72
    },
    {
        "text": " Ahí, esto entendía.",
        "start": 6762.72,
        "end": 6764.72
    },
    {
        "text": " Bien.",
        "start": 6764.72,
        "end": 6765.72
    },
    {
        "text": " ¿Qué haces esto?",
        "start": 6768.72,
        "end": 6769.72
    },
    {
        "text": " El gran Ford iría yo.",
        "start": 6769.72,
        "end": 6771.72
    },
    {
        "text": " Metí toda la condición.",
        "start": 6771.72,
        "end": 6772.72
    },
    {
        "text": " Típicamente ustedes no lo hacen.",
        "start": 6772.72,
        "end": 6773.72
    },
    {
        "text": " Pone muchos IF adentro y reotaron en el medio.",
        "start": 6773.72,
        "end": 6775.72
    },
    {
        "text": " Viste a ver, a ranco de la posición Cero.",
        "start": 6775.72,
        "end": 6779.72
    },
    {
        "text": " Obviamente, mientras nos llega al final y acá había",
        "start": 6779.72,
        "end": 6783.72
    },
    {
        "text": " usar evaluación leycio-peresosa.",
        "start": 6783.72,
        "end": 6785.72
    },
    {
        "text": " Si nos llega al final, ¿qué tiene que pasar para que sea un valor valido?",
        "start": 6785.72,
        "end": 6790.72
    },
    {
        "text": " Primero que estén en el rango.",
        "start": 6790.72,
        "end": 6792.72
    },
    {
        "text": " Porque el 8 no estaba en rango.",
        "start": 6792.72,
        "end": 6794.72
    },
    {
        "text": " Entonces digo, él ha subido, tiene que ser mayor igual que Cero",
        "start": 6794.72,
        "end": 6797.72
    },
    {
        "text": " y menor que el N. Y ya el 8 hubiera salido por acá.",
        "start": 6797.72,
        "end": 6800.72
    },
    {
        "text": " Sí.",
        "start": 6800.72,
        "end": 6801.72
    },
    {
        "text": " Sí está.",
        "start": 6801.72,
        "end": 6802.72
    },
    {
        "text": " Y además de estar en rango, ¿qué tengo que ver?",
        "start": 6802.72,
        "end": 6804.72
    },
    {
        "text": " ¿Quién no haya venido previamente?",
        "start": 6804.72,
        "end": 6806.72
    },
    {
        "text": " Entonces, que la regla está para ese elemento a su V, no esté.",
        "start": 6806.72,
        "end": 6813.72
    },
    {
        "text": " No está.",
        "start": 6813.72,
        "end": 6814.72
    },
    {
        "text": " O sea que sea FOLS.",
        "start": 6814.72,
        "end": 6815.72
    },
    {
        "text": " ¿Vean?",
        "start": 6815.72,
        "end": 6816.72
    },
    {
        "text": " Pues si ya era TRUE y vino de nuevo, repetido.",
        "start": 6816.72,
        "end": 6819.72
    },
    {
        "text": " Ahora sí se da eso, que estoy en el rango.",
        "start": 6819.72,
        "end": 6823.72
    },
    {
        "text": " ¿Y no había venido que hago?",
        "start": 6823.72,
        "end": 6826.72
    },
    {
        "text": " Digo, bueno, entonces lo marco diciendo vino.",
        "start": 6826.72,
        "end": 6829.72
    },
    {
        "text": " Este ya vino.",
        "start": 6829.72,
        "end": 6830.72
    },
    {
        "text": " ¿Y si literando?",
        "start": 6830.72,
        "end": 6832.72
    },
    {
        "text": " Si se le estrefor, hay como tres grandes condiciones para salir el forz.",
        "start": 6832.72,
        "end": 6837.72
    },
    {
        "text": " ¿Qué querías decir?",
        "start": 6837.72,
        "end": 6838.72
    },
    {
        "text": " No, mira, acá sí, es exactamente.",
        "start": 6838.72,
        "end": 6844.72
    },
    {
        "text": " Sólo el value o estas dos condiciones acá, esta.",
        "start": 6844.72,
        "end": 6850.72
    },
    {
        "text": " Y esta, sí, esta condiciones es TRUE.",
        "start": 6850.72,
        "end": 6855.72
    },
    {
        "text": " O sea, requiero que hice a menor que N, porque si no estas posiciones pueden ser falsas,",
        "start": 6855.72,
        "end": 6859.72
    },
    {
        "text": " inválidas, no existentes.",
        "start": 6859.72,
        "end": 6861.72
    },
    {
        "text": " Entonces, cuando es falso, que ya llegó I, si igual a N, se llegó al final, no iba a alugar esto,",
        "start": 6861.72,
        "end": 6865.72
    },
    {
        "text": " porque si no, se sale rango.",
        "start": 6865.72,
        "end": 6867.72
    },
    {
        "text": " O sea, es importante que L y menor que N esté primero.",
        "start": 6867.72,
        "end": 6870.72
    },
    {
        "text": " Bueno, sí, bueno, si estoy en el rango, hago las preguntas válidas en esa posición.",
        "start": 6870.72,
        "end": 6875.72
    },
    {
        "text": " Válida es, no me salía rango y no estaba.",
        "start": 6875.72,
        "end": 6878.72
    },
    {
        "text": " ¿De acuerdo?",
        "start": 6878.72,
        "end": 6879.72
    },
    {
        "text": " Está de a subir lo PONENTRU.",
        "start": 6882.72,
        "end": 6884.72
    },
    {
        "text": " Cuando salgo de este forz, conceptualmente hay tres condiciones, por más que una vea cuatro ahí.",
        "start": 6884.72,
        "end": 6890.72
    },
    {
        "text": " Una vez que llegue al final, ¿cuál es la segunda?",
        "start": 6890.72,
        "end": 6893.72
    },
    {
        "text": " ¿Esto es el nudo?",
        "start": 6893.72,
        "end": 6894.72
    },
    {
        "text": " ¿Eh?",
        "start": 6894.72,
        "end": 6895.72
    },
    {
        "text": " ¿El lo celebrado?",
        "start": 6895.72,
        "end": 6896.72
    },
    {
        "text": " Claro, que salió porque un elemento no estaba en el rango.",
        "start": 6896.72,
        "end": 6900.72
    },
    {
        "text": " Era o menor que Cero o mayor igual que N, el 8, por ejemplo, ¿no?",
        "start": 6900.72,
        "end": 6908.72
    },
    {
        "text": " Y la tercera condición, ¿cuál es para que ha salido antes?",
        "start": 6908.72,
        "end": 6911.72
    },
    {
        "text": " ¿Qué ya estaba? Entonces, cuando lo fui a marcar dos veces, ya tenía trus salió.",
        "start": 6912.72,
        "end": 6916.72
    },
    {
        "text": " ¿Qué retorno ahí abajo y igual igual a N? ¿Qué está bien?",
        "start": 6916.72,
        "end": 6920.72
    },
    {
        "text": " ¿De las tres condiciones que yo dije, estoy chequeando, ¿cuál?",
        "start": 6920.72,
        "end": 6924.72
    },
    {
        "text": " ¿De qué se vuelve final?",
        "start": 6924.72,
        "end": 6926.72
    },
    {
        "text": " Si pudo llegar al final, ¿por qué fue?",
        "start": 6926.72,
        "end": 6928.72
    },
    {
        "text": " ¿Por qué se salió de rango?",
        "start": 6928.72,
        "end": 6930.72
    },
    {
        "text": " Ninguno se salió de rango y ninguno de los que yo vi estaba repetido.",
        "start": 6930.72,
        "end": 6934.72
    },
    {
        "text": " Entonces, son todos los valores de Sena en el Minasum.",
        "start": 6934.72,
        "end": 6936.72
    },
    {
        "text": " ¿Estás bajando un problema?",
        "start": 6936.72,
        "end": 6937.72
    },
    {
        "text": " ¿Estás bajando un problema? ¿No tuviste problemas? ¿Estás porque está todo bien?",
        "start": 6937.72,
        "end": 6940.72
    },
    {
        "text": " Sí. ¿Qué orden tienes este código?",
        "start": 6940.72,
        "end": 6942.72
    },
    {
        "text": " ¿En el peor caso? ¿Y cuál es el peor caso?",
        "start": 6942.72,
        "end": 6944.72
    },
    {
        "text": " ¿En el que todo tiene cuadrado?",
        "start": 6944.72,
        "end": 6947.72
    },
    {
        "text": " No. ¿Ordene? ¿Por qué?",
        "start": 6947.72,
        "end": 6950.72
    },
    {
        "text": " ¿Acaí dos for, pero está en en secuencia? ¿Estás en en secuencia?",
        "start": 6950.72,
        "end": 6953.72
    },
    {
        "text": " ¿Estás en secuencia? ¿Estás en secuencia? ¿Estás en secuencia?",
        "start": 6953.72,
        "end": 6954.72
    },
    {
        "text": " ¿Y cuál es el peor caso de este formas largo? ¿Cuál es lo peor que le puede pasar?",
        "start": 6954.72,
        "end": 6958.72
    },
    {
        "text": " ¿Por qué salga? ¿Por qué condición?",
        "start": 6958.72,
        "end": 6960.72
    },
    {
        "text": " ¿Por qué? ¿Por qué? ¿Por qué? ¿Por qué? ¿Por qué?",
        "start": 6960.72,
        "end": 6962.72
    },
    {
        "text": " ¿Cuándo hiciera más veces? ¿Cuándo siga?",
        "start": 6962.72,
        "end": 6966.72
    },
    {
        "text": " ¿Al final? ¿Al final? ¿Cuándo diga igual a n?",
        "start": 6966.72,
        "end": 6968.72
    },
    {
        "text": " ¿El mejor caso es que el primero se ha salido el rank, entonces se va?",
        "start": 6968.72,
        "end": 6971.72
    },
    {
        "text": " El peor caso chequeó todos, llegó al final y retornó a igual a n.",
        "start": 6971.72,
        "end": 6975.72
    },
    {
        "text": " Pero en cualquier caso eso reené.",
        "start": 6975.72,
        "end": 6977.72
    },
    {
        "text": " ¿Este es un ejemplo donde usa un arreglo auxiliar?",
        "start": 6977.72,
        "end": 6980.72
    },
    {
        "text": " ¿Me moría extra para computar? ¿Fíjense si esta idea nos sirve para aquel?",
        "start": 6980.72,
        "end": 6985.72
    },
    {
        "text": " ¿El que chequeaba si un elemento estaba repetido en un arreglo genérico?",
        "start": 6985.72,
        "end": 6989.72
    },
    {
        "text": " Yo diría que no siempre. A ver si lo ocurre condiciones para que sí funcione.",
        "start": 6989.72,
        "end": 6993.72
    },
    {
        "text": " Piense lo. Y déjeme ver si. Nos vemos el miércoles que viene.",
        "start": 6993.72,
        "end": 7002.72
    }
]