[
    {
        "text": " Bueno, buenas tardes. Mi nombre es Federico Aralla. La profesora de María no",
        "start": 0.0,
        "end": 24.560000000000002
    },
    {
        "text": " podía venir hoy. Supongo que les habrá avisado. Así que en realidad yo podría llegar, o sea,",
        "start": 24.56,
        "end": 36.239999999999995
    },
    {
        "text": " no llegaba a las cuatro. Así que la idea es, digamos, meterle pata hora en estas dos horas para",
        "start": 36.239999999999995,
        "end": 45.04
    },
    {
        "text": " liquidar lo que sería el módulo de economía del Uruguay y ya la semana que viene arrancarían",
        "start": 45.04,
        "end": 53.32
    },
    {
        "text": " con microeconomía. Se ve allá en el fondo. Se ve. Entonces, según me contó María, llegaron a dar",
        "start": 53.32,
        "end": 68.68
    },
    {
        "text": " hasta la crisis del 2002 y la salida de la crisis del 2002. Y entonces la idea de la clase de hoy es",
        "start": 68.68,
        "end": 78.68
    },
    {
        "text": " ver los últimos 10, 12 años, digamos, desde 2005 hasta 2015 y luego hacer un poquito más de foco, digamos,",
        "start": 78.68,
        "end": 95.44000000000001
    },
    {
        "text": " o de análisis, lo que ha ocurrido en el 2016 y lo que está ocurriendo en lo que va el 2017.",
        "start": 95.44000000000001,
        "end": 102.84
    },
    {
        "text": " Entonces, si ustedes se acuerdan, si, el Uruguay logra, digamos, repuntar, luego de la crisis,",
        "start": 103.68,
        "end": 116.72
    },
    {
        "text": " Uruguay vuelve a crecer a partir del 2003, 2004, pero sin embargo ese crecimiento luego de la",
        "start": 120.24000000000001,
        "end": 128.28
    },
    {
        "text": " crisis, o sea luego de la caída en el 2002, ese crecimiento en el 2003, 2004, que fue relativamente",
        "start": 128.28,
        "end": 137.04
    },
    {
        "text": " madro, pero crecimiento al fin, no se expresaba, digamos, en los indicadores sociales.",
        "start": 137.04,
        "end": 145.96
    },
    {
        "text": " Tanto es así, digamos, que el desempleo seía estando por arriba del 10% y sobre todo que, bueno,",
        "start": 145.96,
        "end": 154.92000000000002
    },
    {
        "text": " la desigualdad se iba creciendo y la pobreza en el 2004 había llegado a 40% de la población.",
        "start": 154.92,
        "end": 160.95999999999998
    },
    {
        "text": " Aguardo, o sea, la pobreza, a pesar de que el país empezaba a recuperarse económicamente en el",
        "start": 160.95999999999998,
        "end": 168.72
    },
    {
        "text": " sentido de que aumentaba el PIB, la pobreza se iba creciendo, ¿sí? Entonces, todo esto, digamos,",
        "start": 168.72,
        "end": 175.6
    },
    {
        "text": " posibilita la llegada de un cambio político, ¿sí? Se imagínense una situación del Uruguay bastante",
        "start": 175.6,
        "end": 184.56
    },
    {
        "text": " cruda en aquellos momentos y a partir del 2005, llega un cambio político institucional que",
        "start": 184.56,
        "end": 196.79999999999998
    },
    {
        "text": " toma ese crecimiento que venía del 2003, 2004 y lo que hace es tratar de revertir o de aplicar ese",
        "start": 196.8,
        "end": 207.84
    },
    {
        "text": " crecimiento, de trasladar ese crecimiento a los indicadores sociales. ¿De acuerdo? Es decir,",
        "start": 207.84,
        "end": 215.4
    },
    {
        "text": " esta llegada de un nuevo gobierno de corte de progresista, Uruguay, se consolida, digamos, o sea,",
        "start": 215.4,
        "end": 226.24
    },
    {
        "text": " parece a lo que ocurre en el resto de los países América Latina, ¿sí? O sea, la crisis que afectó",
        "start": 226.24,
        "end": 233.28
    },
    {
        "text": " a Brasil, que afectó a Argentina, que afectó a grandes a varios países de Latinoamérica permite",
        "start": 233.28,
        "end": 241.36
    },
    {
        "text": " la llegada de varios gobiernos de corte de progresista a Latinoamérica, ¿sí? O sea, por ejemplo,",
        "start": 241.68,
        "end": 249.4
    },
    {
        "text": " el Kirnérismo en el 2003, el partido de los trabajadores en Brasil, Evo Morales en Bolivia,",
        "start": 249.4,
        "end": 256.52000000000004
    },
    {
        "text": " Rafael Correa en Ecuador, luego luego en Paraguay, o sea, varios países de Latinoamérica,",
        "start": 256.52000000000004,
        "end": 263.8
    },
    {
        "text": " sumergidos en crisis, digamos, en esos años, adoptan digamos, su modelo, o sea, la población",
        "start": 263.8,
        "end": 270.12
    },
    {
        "text": " embota por un modelo de corte de progresista, porque sobre todo los indicadores sociales,",
        "start": 270.12,
        "end": 275.56
    },
    {
        "text": " sí, estaban, digamos, bastante, bastante, bastante destruidos, ¿sí? Por lo tanto, en Uruguay,",
        "start": 275.56,
        "end": 284.4
    },
    {
        "text": " sí, la llegada de la administración de Básquez, en los primeros dos años, o sea, en el 2005-2007,",
        "start": 284.4,
        "end": 291.28000000000003
    },
    {
        "text": " se concentra en reconstruir o, digamos, atacar a los indicadores sociales, ¿de acuerdo?",
        "start": 291.28,
        "end": 300.15999999999997
    },
    {
        "text": " ¿Qué se hace para eso se hacen? Sí, reformas. La primera, sí, el primer aspecto",
        "start": 300.15999999999997,
        "end": 311.64
    },
    {
        "text": " a destacar en los sociales, sí, o la primer política de destacar en los sociales es el plan",
        "start": 311.64,
        "end": 315.35999999999996
    },
    {
        "text": " de emergencia, el plan de asistencia nacional de emergencia social, sí, el PANES, lo que",
        "start": 315.36,
        "end": 322.2
    },
    {
        "text": " buscaba básicamente ir a el apoyo a aquellas personas de hogares más vulnerables, ¿sí?",
        "start": 322.2,
        "end": 329.68
    },
    {
        "text": " O sea, tratar de bajar ese 40% de pobreza a través de la apoyo de transferencias hacia personas",
        "start": 329.68,
        "end": 336.68
    },
    {
        "text": " de hogares pobres, hacia personas en condiciones de vulnerabilidad. Eso, por un lado, sí, como",
        "start": 336.68,
        "end": 343.84000000000003
    },
    {
        "text": " política fuerte para tratar de reducir la pobreza. En lo laboral, sí, en lo laboral, la gran",
        "start": 343.84,
        "end": 352.88
    },
    {
        "text": " política que llevó adelante esa primera administración y que todavía se mantiene hoy es la vuelta",
        "start": 352.88,
        "end": 359.96
    },
    {
        "text": " a los consejos de salario, ¿sí? Esos consejos de salario que habían nacido en el 43 con Luis",
        "start": 359.96,
        "end": 365.84
    },
    {
        "text": " Valle Verre que se habían dejado de convocar, sí, en el PANCHECAT que, nuevo, en la itadura,",
        "start": 365.84,
        "end": 373.84
    },
    {
        "text": " obviamente no se convocan, que se volvieron a convocar en el 85 con la administración",
        "start": 373.84,
        "end": 379.15999999999997
    },
    {
        "text": " San Guinetti y que dejan de convocarse en el 92 con la administración La Calla y pasan",
        "start": 379.15999999999997,
        "end": 384.84
    },
    {
        "text": " digamos del 92 al 2005, 5 convocarse, ¿sí? ¿Cuál era la idea de esto? Básicamente, la",
        "start": 384.84,
        "end": 393.55999999999995
    },
    {
        "text": " recuperación del poder de compra de los trabajadores. O sea, el salario real se había",
        "start": 393.56,
        "end": 398.16
    },
    {
        "text": " desplomado en la crisis del 2002, sí, el producto comenzaba a crecer, pero el salario real,",
        "start": 398.16,
        "end": 405.68
    },
    {
        "text": " o sea, el poder de compra de los trabajadores se mantenía, digamos, bastante chato entre 2013",
        "start": 405.68,
        "end": 410.84000000000003
    },
    {
        "text": " y 2004. Y por lo tanto, la convocatoria a los consejos de salario busca, sí, busca, digamos,",
        "start": 410.84000000000003,
        "end": 419.92
    },
    {
        "text": " aumentar el poder de compra de los trabajadores. Obviamente todo esto, sí, en un escenario, digamos,",
        "start": 419.92,
        "end": 431.04
    },
    {
        "text": " de reivindicación de derechos laborales, sí, en un juego, digamos, o en un ámbito económico",
        "start": 431.04,
        "end": 443.92
    },
    {
        "text": " y político que iban de la mano, sí, o sea, el partido de gobierno llega al gobierno,",
        "start": 443.92,
        "end": 449.36
    },
    {
        "text": " mayoritariamente votado por los trabajadores y por lo tanto, sí, adopta esta política",
        "start": 449.36,
        "end": 455.92
    },
    {
        "text": " que, digamos, lo que busca es aumentar el poder de compra de los trabajadores, ¿sí?",
        "start": 455.92,
        "end": 465.16
    },
    {
        "text": " En lo económico, sí, o más bien, digamos, en lo comercial, la estrategia de Uruguay,",
        "start": 465.16,
        "end": 471.64
    },
    {
        "text": " la estrategia de Uruguay se guió, digamos, por la búsqueda de los nuevos mercados, sí, si ustedes",
        "start": 471.64,
        "end": 478.64
    },
    {
        "text": " se acuerdan, Uruguay, al principio de la década de 90 con la consolidación del Mercosur,",
        "start": 478.64,
        "end": 485.68
    },
    {
        "text": " sí, una de cada dos exportaciones iban a parar del Mercosur, ¿sí? Al 50% de los productos",
        "start": 485.68,
        "end": 493.76
    },
    {
        "text": " que vendíamos iban a parar o Argentina o a Brasil, ¿qué implicó eso? implicó una alta dependencia",
        "start": 493.76,
        "end": 499.8
    },
    {
        "text": " de los países vecinos y obviamente, cuando los países vecinos se cayeron, Brasil en el",
        "start": 499.8,
        "end": 505.08
    },
    {
        "text": " 99, veía, Argentina en el 2001, eso sí, repercutió en Uruguay y todo el mundo sabía que",
        "start": 505.08,
        "end": 511.12
    },
    {
        "text": " nosotros no íbamos a poder, íbamos a sobrevivir a esa caída. Por lo tanto, sí, en lo comercial,",
        "start": 511.12,
        "end": 519.5600000000001
    },
    {
        "text": " lo que se buscó fue no depender tanto de los países vecinos, o sea, la búsqueda de",
        "start": 519.5600000000001,
        "end": 524.0
    },
    {
        "text": " nuevos mercados principalmente, sí, principalmente los países asiáticos. ¿Qué pasó en esos dos",
        "start": 524.0,
        "end": 535.08
    },
    {
        "text": " años? Bueno, el crecimiento se consolida básicamente por un aumento en el precio de los bienes",
        "start": 535.08,
        "end": 543.08
    },
    {
        "text": " primarios, básicamente debido a un aumento de la demanda de China por la compra de soja,",
        "start": 543.08,
        "end": 549.12
    },
    {
        "text": " y por lo tanto, sí, en esos dos años se disminuye la pobreza y se recompone el salario real.",
        "start": 549.12,
        "end": 560.48
    },
    {
        "text": " Sin embargo, si bien se disminuía la pobreza y se incrementaba el salario real levemente,",
        "start": 567.16,
        "end": 574.2
    },
    {
        "text": " la desigualdad, la desigualdad seguía aumentando en esos primeros dos años, y por lo tanto,",
        "start": 575.2,
        "end": 583.5200000000001
    },
    {
        "text": " en gobierno, a partir del 2007, a partir del 2007, implementa nuevas reformas,",
        "start": 583.5200000000001,
        "end": 590.5200000000001
    },
    {
        "text": " o sea, los primeros dos años de la administración, dos mil cinco dos mil seis, para sacar a la gente",
        "start": 590.5200000000001,
        "end": 595.84
    },
    {
        "text": " de la pobreza y a partir del 2007, nuevas reformas llegamos para, sobre todo,",
        "start": 595.84,
        "end": 601.32
    },
    {
        "text": " disminuir la desigualdad y pasar a enfocarse en ese punto, ¿sí?",
        "start": 601.32,
        "end": 607.6
    },
    {
        "text": " Primero, digamos, primer política para disminuir la desigualdad, el plan de queda, o sea,",
        "start": 609.6,
        "end": 615.32
    },
    {
        "text": " el plan de emergencia social, o sea, alpanes, finaliza, la gente, digamos, sí, o sea, las que",
        "start": 615.32,
        "end": 623.48
    },
    {
        "text": " estaban en peores condiciones, logran de salir de esas peores condiciones, pero sin embargo,",
        "start": 623.48,
        "end": 630.7600000000001
    },
    {
        "text": " sí sigue habiendo, digamos, desigualdad bastante alta en aquellos años, ¿sí?",
        "start": 630.76,
        "end": 637.4
    },
    {
        "text": " Por lo tanto, el plan de emergencia se constituye en un plan de queda,",
        "start": 637.4,
        "end": 641.36
    },
    {
        "text": " y luego, tras dos reformas, sí, luego, tras dos reformas, ¿sí? ¿Qué van a hacer?",
        "start": 645.56,
        "end": 650.64
    },
    {
        "text": " Muy importantes, no solo en ese periodo de gobierno, sino que son reformas que vinieron a cambiar",
        "start": 650.64,
        "end": 661.64
    },
    {
        "text": " la estructura tanto tributaria como de salud, ¿sí? ¿Y qué? Digamos que llegaron para quedarse,",
        "start": 661.64,
        "end": 668.0
    },
    {
        "text": " ¿sí? O sea, reformas que hoy, digamos, ya no se discuten y que si se discuten, digamos,",
        "start": 668.0,
        "end": 677.12
    },
    {
        "text": " es simplemente por el juego político, pero, digamos, son reformas bastante fuertes,",
        "start": 677.12,
        "end": 683.88
    },
    {
        "text": " bastante que sacúdenla base, ¿sí? Y que una vez que se implementan, es muy difícil de",
        "start": 683.88,
        "end": 692.28
    },
    {
        "text": " tirar las tetrasas, ¿sí? De que estoy hablando de, estoy hablando de el Fonasa y de la",
        "start": 692.28,
        "end": 698.52
    },
    {
        "text": " reforma tributaria, o sea, la reforma del Sistema Nacional integrado de salud, que cambia la",
        "start": 698.52,
        "end": 704.6800000000001
    },
    {
        "text": " lógica, ¿sí? del Sistema de Salud, y la reforma tributaria que cambia la lógica tributaria",
        "start": 704.68,
        "end": 712.52
    },
    {
        "text": " del país, ¿sí? ¿En qué se basaba esta reforma? Bueno, básicamente, ¿sí? En la eficiencia,",
        "start": 712.52,
        "end": 721.5999999999999
    },
    {
        "text": " que era la eficiencia, o sea, lo que se buscaba era facilitar la recaudación del Estado,",
        "start": 722.5999999999999,
        "end": 727.5999999999999
    },
    {
        "text": " eliminar impuestos chiquitos que sólo distorsionaban y que no recaudaban demasiado, como por ejemplo el",
        "start": 727.6,
        "end": 735.6800000000001
    },
    {
        "text": " Cofis, y sobre todo, además de la eficiencia, lo que buscaba la reforma tributaria era un aspecto",
        "start": 735.6800000000001,
        "end": 746.32
    },
    {
        "text": " de equidad, o sea, favorecer la equidad. ¿Cómo se hacía eso? Bueno, se pasó a una base de impuestos",
        "start": 746.32,
        "end": 760.7800000000001
    },
    {
        "text": " a los sueldos mucho más progressiva, ¿sí? Y se pasó un esquema de impuestos directos, perdón,",
        "start": 760.7800000000001,
        "end": 769.8000000000001
    },
    {
        "text": " de impuestos indirectos a impuestos directos, que es lo que hacen, digamos, la mayoría de los países",
        "start": 769.8000000000001,
        "end": 774.6
    },
    {
        "text": " desarrollados. ¿Qué significaba esto? O sea, ¿a qué me refiero con impuestos directos o",
        "start": 774.6,
        "end": 782.52
    },
    {
        "text": " impuestos indirectos? Impuestos indirectos me refiero a impuestos a el consumo. Impuestos indirectos",
        "start": 782.52,
        "end": 792.5600000000001
    },
    {
        "text": " son los impuestos al consumo. E impuestos directos son impuestos a los ingresos. La mayoría, digamos,",
        "start": 792.5600000000001,
        "end": 799.76
    },
    {
        "text": " los países desarrollados, lo que hacen es aplicar más bien impuestos directos al ingreso y menos",
        "start": 799.76,
        "end": 806.84
    },
    {
        "text": " impuestos indirectos al consumo. ¿Por qué los impuestos indirectos o sea, los impuestos al consumo,",
        "start": 806.84,
        "end": 814.52
    },
    {
        "text": " por ejemplo, de liba, son regresivos en materia de equidad. ¿Qué les parece? ¿Por qué un impuesto al",
        "start": 814.52,
        "end": 828.16
    },
    {
        "text": " consumo, como, por ejemplo, liba, es regresivo en materia de equidad?",
        "start": 828.16,
        "end": 832.64
    },
    {
        "text": " Regresivo es, digamos, que aumenta la desigualdad. ¿Por qué el iba no favorece a la igualdad, digamos?",
        "start": 832.64,
        "end": 854.72
    },
    {
        "text": " Bien, bien. Entonces, lo que dice el compañero, básicamente es, el iba, si, al iba, no le importa si un",
        "start": 858.16,
        "end": 885.88
    },
    {
        "text": " impuesto al consumo, cuando yo lo cobro, no me importa quién está consumiendo. Me explicó, o sea,",
        "start": 885.88,
        "end": 891.68
    },
    {
        "text": " le cobro lo mismo, le cobro el 22% y no me importa si esa persona gana 10 mil pesos al mes o si gana 100",
        "start": 891.68,
        "end": 901.0
    },
    {
        "text": " mil pesos al mes. Sí, me explicó, le cobro es al consumo y por lo tanto, si compra un producto,",
        "start": 901.0,
        "end": 908.16
    },
    {
        "text": " si compra de mismo producto, le estoy cobrando lo mismo a que el que gana 100 mil pesos por mes",
        "start": 908.16,
        "end": 912.76
    },
    {
        "text": " que aquel que gana 10 mil pesos por mes. Me explicó y por lo tanto, eso nos favorece obviamente",
        "start": 912.76,
        "end": 918.72
    },
    {
        "text": " a la equidad, ¿sí? En cambio, los impuestos a los ingresos, sí, toman en cuenta, sí, si la",
        "start": 918.72,
        "end": 927.04
    },
    {
        "text": " persona gana 100 mil pesos por mes o si la persona gana 10 mil pesos por mes. ¿De acuerdo? Y entonces,",
        "start": 927.04,
        "end": 932.84
    },
    {
        "text": " en la implementación de la reforma tributaria, lo que se llevó adelante fue una baja de los impuestos",
        "start": 932.84,
        "end": 938.88
    },
    {
        "text": " al consumo, o sea, el IVA paso a 23, a 22 y un aumento, sí, de los impuestos a los ingresos,",
        "start": 938.88,
        "end": 948.04
    },
    {
        "text": " sí, grabando, sobre todo, a los ingresos más altos y a los ingresos medios y dejando, digamos,",
        "start": 948.04,
        "end": 954.68
    },
    {
        "text": " una base en donde los ingresos pequeños o menores no llegan a pagar ese impuesto. ¿De acuerdo?",
        "start": 954.68,
        "end": 963.36
    },
    {
        "text": " Por lo tanto, lo que se buscaba ahí era una reforma tributaria que apuntara de la equidad, ¿de acuerdo?",
        "start": 963.36,
        "end": 971.8000000000001
    },
    {
        "text": " Por otra parte, se dan una reforma muy importante, sí, que es la de la matriz energética,",
        "start": 974.6800000000001,
        "end": 981.92
    },
    {
        "text": " sí, se comienza a apuntar el cambio de la matriz energética, bajo la consigna de no ser tan",
        "start": 981.92,
        "end": 990.24
    },
    {
        "text": " dependientes del petróleo, o sea, no ser tan dependientes de fuentes de energía no renovables,",
        "start": 990.24,
        "end": 995.28
    },
    {
        "text": " porque petróleo no tenemos, sí, y por lo tanto, quedamos muy sujetos a lo que pase en el mercado",
        "start": 995.28,
        "end": 1003.4
    },
    {
        "text": " internacional. ¿De acuerdo? ¿Qué es lo que hizo el país? Simplemente, una reforma, sí,",
        "start": 1003.4,
        "end": 1009.12
    },
    {
        "text": " basado en crecer las energías renovables y disminuir el peso de las energías no renovables. ¿De acuerdo?",
        "start": 1009.12,
        "end": 1018.08
    },
    {
        "text": " Esa reforma que comienza en el 2007-2008, sí, se sigue, digamos, o sea, hoy digamos, está dando su",
        "start": 1019.0400000000001,
        "end": 1027.32
    },
    {
        "text": " resultado muy positivo. Se reforma la seguridad social, se flexibiliza el acceso, digamos, a la",
        "start": 1027.32,
        "end": 1036.64
    },
    {
        "text": " seguridad social, es decir, antes del 2007 se exigía en 35 años de aporte a la seguridad social para",
        "start": 1036.64,
        "end": 1045.52
    },
    {
        "text": " poder jubilarse, esa exigencia de 35, baja a 30, sí, y además, en busca de la equidad de género,",
        "start": 1045.52,
        "end": 1055.48
    },
    {
        "text": " se cuenta a la mujer, digamos, por cada hijo, hasta 5, con un año más de trabajo, o sea, por cada",
        "start": 1055.48,
        "end": 1064.48
    },
    {
        "text": " hijo que tuviera la mujer se le cuenta, digamos, como si tuviese un año más de trabajo, ¿sabes? Y eso,",
        "start": 1064.48,
        "end": 1070.16
    },
    {
        "text": " digamos, permite el acceso a la seguridad social de varias personas que en las condiciones anteriores",
        "start": 1070.16,
        "end": 1079.24
    },
    {
        "text": " no podrían haber excedido. Y por último, sí, fíjense que esto también, digamos, se hace apuntando",
        "start": 1079.24,
        "end": 1087.2
    },
    {
        "text": " a la equidad, sobre todo, disminuyendo los recursos, disminuyendo, perdón, los requisitos que se exigían y",
        "start": 1087.2,
        "end": 1094.1200000000001
    },
    {
        "text": " permitiendo, sobre todo a las personas con menores años de trabajo y sobre todas las mujeres, con mayor cantidad",
        "start": 1094.12,
        "end": 1105.4799999999998
    },
    {
        "text": " de hijos, computadilizarle años de trabajo. Y por último, sí, otro movimiento importante que",
        "start": 1105.4799999999998,
        "end": 1118.84
    },
    {
        "text": " está hoy siendo muy importante, o sea, otra política económica implementada fue la ley de inversiones,",
        "start": 1118.84,
        "end": 1124.08
    },
    {
        "text": " que la ley de inversiones, lo que permitía era básicamente el descuento de impuestos si ese",
        "start": 1124.08,
        "end": 1132.9599999999998
    },
    {
        "text": " plan de inversión favorecía el empleo. Y, ¿acuerdo? O sea, si yo llevaba adelante un plan de inversión",
        "start": 1132.9599999999998,
        "end": 1138.32
    },
    {
        "text": " en un negocio, ¿sí? Cuanto más puestos de trabajo creara ese plan de inversión mayor era el",
        "start": 1138.32,
        "end": 1145.8799999999999
    },
    {
        "text": " descuento que yo iba a poder hacer de los impuestos. ¿De acuerdo? Me explico si o no. ¿sí? Y por lo tanto,",
        "start": 1145.88,
        "end": 1153.88
    },
    {
        "text": " esto es lo que buscaba básicamente era de lentar a la inversión privada, o sea, de lentar a la",
        "start": 1153.88,
        "end": 1158.8400000000001
    },
    {
        "text": " inversión de los empresarios para que básicamente crearan proyectos de inversión con puestos de trabajo,",
        "start": 1158.8400000000001,
        "end": 1166.5200000000002
    },
    {
        "text": " justamente para lograr el crecimiento del empleo. ¿Qué implicó todo esto? O sea, qué implican",
        "start": 1167.08,
        "end": 1178.0
    },
    {
        "text": " este vieron estas políticas en el primer gobierno? Que bueno, que el precio de los Comos y Ticillos",
        "start": 1178.0,
        "end": 1185.24
    },
    {
        "text": " bastante alto, o sea, la demanda de Soja por parte de China siguió fuerte, el crecimiento económico",
        "start": 1185.24,
        "end": 1192.0
    },
    {
        "text": " seguía dándose con dinamismo y los indicadores sociales, los indicadores sociales se entregan a mejorar.",
        "start": 1192.0,
        "end": 1200.52
    },
    {
        "text": " Eso hace que, por ejemplo, la crisis financiera internacional del 2008-2009 Uruguay le apase relativamente",
        "start": 1204.76,
        "end": 1212.84
    },
    {
        "text": " con tranquilidad, o sea, en el 2008-2009 Uruguay es uno de los pocos países América Latina que logra",
        "start": 1212.84,
        "end": 1222.4399999999998
    },
    {
        "text": " incluso con la crisis internacional tener una tasa de crecimiento del 4% del 2,9%, que muy",
        "start": 1222.4399999999998,
        "end": 1231.98
    },
    {
        "text": " pocos, digamos, muy pocos países, logran una tasa de crecimiento positiva en el 2009.",
        "start": 1231.98,
        "end": 1237.14
    },
    {
        "text": " Bien, ¿qué pasa en el 2010? O sea, luego de la primera administración, o sea, se mantiene el",
        "start": 1241.5,
        "end": 1252.14
    },
    {
        "text": " gobierno, se mantiene el gobierno y básicamente los objetivos de política económica,",
        "start": 1252.14,
        "end": 1258.82
    },
    {
        "text": " son muy parecidos a los del primero, en busca de una profundización de las políticas.",
        "start": 1259.3799999999999,
        "end": 1264.82
    },
    {
        "text": " O sea, los objetivos siguen siendo básicamente los mismos, y lo que se busca es seguir, digamos,",
        "start": 1264.82,
        "end": 1274.54
    },
    {
        "text": " favoreciendo la equidad, diminuyendo la pobreza, creciendo y tratando de incrementar el comercio",
        "start": 1274.54,
        "end": 1283.62
    },
    {
        "text": " con otros mercados y no de depender de argentina y Brasil.",
        "start": 1283.62,
        "end": 1287.9399999999998
    },
    {
        "text": " ¿Qué es lo que, o sea, cuál es la idea, digamos, de este periodo? Es que se extienden las",
        "start": 1292.1799999999998,
        "end": 1299.34
    },
    {
        "text": " reformas, o sea, la reforma de la salud y los consejos de salario se profundizan en el sentido",
        "start": 1299.34,
        "end": 1311.4599999999998
    },
    {
        "text": " de que se pasa en los consejos de salario a una óptica de reparto de la productividad entre",
        "start": 1311.46,
        "end": 1318.8600000000001
    },
    {
        "text": " ganancias y salarios. Es decir, bueno, si se incrementa la productividad, ese aumento de",
        "start": 1318.8600000000001,
        "end": 1326.98
    },
    {
        "text": " productividad tiene que ir en parte para los salarios y en parte para la ganancia, o sea,",
        "start": 1326.98,
        "end": 1331.26
    },
    {
        "text": " tratar de que los salarios acompañen el incremento de la productividad. Y por otro lado,",
        "start": 1331.26,
        "end": 1338.3400000000001
    },
    {
        "text": " si se estiende, digamos, esta lógica de universalización e inclusión de las políticas,",
        "start": 1338.34,
        "end": 1344.1399999999999
    },
    {
        "text": " ¿sí? Universalización en el sentido de que todo el mundo aporta para las políticas,",
        "start": 1344.1399999999999,
        "end": 1349.74
    },
    {
        "text": " o sea, las personas contribuyen al financiamiento de las políticas según el ingreso que tengan,",
        "start": 1349.74,
        "end": 1357.1
    },
    {
        "text": " como, por ejemplo, la reforma tributaria, pero esas políticas le llegan a las personas según",
        "start": 1357.1,
        "end": 1364.26
    },
    {
        "text": " las necesidades. Esta lógica de, o sea, aporto a la política pública, según los ingresos",
        "start": 1364.26,
        "end": 1371.02
    },
    {
        "text": " que yo tenga, ¿sí? Y el beneficio que me da a la política pública es según las necesidades",
        "start": 1371.02,
        "end": 1377.3799999999999
    },
    {
        "text": " que yo tenga. ¿De acuerdo? Eso es lo que significa la universalización e inclusión, o sea,",
        "start": 1377.3799999999999,
        "end": 1384.06
    },
    {
        "text": " eso, digamos, apuntaba o ese objetivo apuntaba el período de 2010-2015. ¿Qué pasaba o",
        "start": 1384.06,
        "end": 1400.1799999999998
    },
    {
        "text": " sea en materia comercial? Bueno, esta idea de profundizar, sí, de profundizar. La búsqueda",
        "start": 1400.1799999999998,
        "end": 1408.74
    },
    {
        "text": " de nuevos mercados, sí, la búsqueda de nuevos mercados, pero sobre todo, sí, profundizar",
        "start": 1408.74,
        "end": 1415.02
    },
    {
        "text": " la cooperación sur sur. ¿Qué era la cooperación sur sur? Era decir, bueno, sí, era no depender,",
        "start": 1415.02,
        "end": 1422.38
    },
    {
        "text": " digamos, de Argentina y Brasil solamente, sino buscar nuevos mercados, como, por ejemplo,",
        "start": 1422.38,
        "end": 1427.9
    },
    {
        "text": " Sudáfrica, Australia, Nueva Zelanda y los países de su estaciático. Es decir, tratar de",
        "start": 1427.9,
        "end": 1435.94
    },
    {
        "text": " aumentar la cooperación con los países de la Mifereo Sur y especialmente con aquellos",
        "start": 1435.94,
        "end": 1442.66
    },
    {
        "text": " más dinámicos, con aquellos, digamos, que son intensivos en capital, Australia, Nueva",
        "start": 1442.66,
        "end": 1450.02
    },
    {
        "text": " Zelanda, sí, y algunos países del Sudáfrica. ¿De acuerdo? Sí, sin perder de cara, sin perder",
        "start": 1450.02,
        "end": 1458.94
    },
    {
        "text": " de cara, sí, al gran monstruaciático que es China. ¿Qué pasaba en la estructura productiva,",
        "start": 1458.94,
        "end": 1472.9
    },
    {
        "text": " digamos? O sea, ¿cuál fue el objetivo de este período de la estructura productiva?",
        "start": 1472.9,
        "end": 1478.5
    },
    {
        "text": " Bueno, se dio una profundización, sí, de las políticas industriales por sectores. O sea,",
        "start": 1478.5,
        "end": 1486.42
    },
    {
        "text": " se dio una profundización de la política industrial, sí. O sea, a diferencia del periodo de",
        "start": 1486.42,
        "end": 1492.54
    },
    {
        "text": " industrialización por sustitución de importaciones, que fue algo que, de hecho, sea, Argentina",
        "start": 1492.54,
        "end": 1497.46
    },
    {
        "text": " aplica en este período, o sea, Uruguay no lo hace, sí, Uruguay lo hizo en el 43 y en",
        "start": 1497.46,
        "end": 1503.66
    },
    {
        "text": " el 43 y el 57 y no le funcionó, Argentina lo hace entre el 2010 y el 2015 y tampoco le funcionó.",
        "start": 1503.66,
        "end": 1511.74
    },
    {
        "text": " Uruguay lo que hace es no buscar la industrialización, sino que lo que busca es hacer política",
        "start": 1511.74,
        "end": 1519.46
    },
    {
        "text": " industrial en los sectores que el gobierno entiende como prioritarios. ¿Cuáles son esos sectores?",
        "start": 1519.46,
        "end": 1527.7
    },
    {
        "text": " Bueno, la automotriz, sí, la biotecnología, sí, la farmacéutica, la naval y, sobre todo,",
        "start": 1527.7,
        "end": 1537.14
    },
    {
        "text": " el forestal madero, sobre todo el forestal madero. O sea, acá hay un gran desarrollo, si hay una",
        "start": 1537.14,
        "end": 1543.9
    },
    {
        "text": " gran política industrial, y busca favorecer el desarrollo de la industria básicamente de la",
        "start": 1543.9,
        "end": 1554.6200000000001
    },
    {
        "text": " forestación y la madera. ¿Por qué se priorizan estos sectores? Sí, bueno, porque son sectores",
        "start": 1554.6200000000001,
        "end": 1562.7
    },
    {
        "text": " de alto valor agregado. O sea, son sectores que tienen mucho encadenamiento, sí, son sectores",
        "start": 1562.7,
        "end": 1570.22
    },
    {
        "text": " que tienen mucho encadenamiento, son sectores que generan alto valor. Y por lo tanto, el gobierno",
        "start": 1570.22,
        "end": 1577.18
    },
    {
        "text": " define como prioritarios a esos sectores y empieza a aplicar, digamos, ciertas políticas",
        "start": 1577.18,
        "end": 1582.96
    },
    {
        "text": " se busca de favorecer el desarrollo de los mismos. ¿De acuerdo? Sin embargo, sí, sin embargo,",
        "start": 1582.96,
        "end": 1594.92
    },
    {
        "text": " el grueso de la estructura productiva de Uruguay, o sea, aquello que veíamos en el modelo Centro",
        "start": 1594.92,
        "end": 1604.24
    },
    {
        "text": " Periferia de América Latina, o sea, la estructura productiva del país sigue siendo básicamente",
        "start": 1604.24,
        "end": 1610.44
    },
    {
        "text": " de corte primario, sí, o sea, básicamente, seguimos siendo un país agroesportador, sí, un país",
        "start": 1610.44,
        "end": 1618.52
    },
    {
        "text": " que depende, sí, de la ganadería, sí, y que esa estructura productiva no logró cambiar, sí,",
        "start": 1618.52,
        "end": 1629.28
    },
    {
        "text": " en estos, en este período, digamos, de gobierno. ¿De acuerdo? Y lo que sí hay en este período",
        "start": 1629.28,
        "end": 1642.48
    },
    {
        "text": " es un gran esfuerzo, digamos, y que sigue estando en este período también, es un gran esfuerzo",
        "start": 1642.48,
        "end": 1648.6399999999999
    },
    {
        "text": " de el gobierno por favorecer el turismo y, sobre todo, sí, por en la búsqueda de no depender",
        "start": 1648.64,
        "end": 1659.6000000000001
    },
    {
        "text": " tanto de Argentina y Brasil, hay un gran esfuerzo de atraer turistas de otros lados, es decir,",
        "start": 1659.6000000000001,
        "end": 1666.6000000000001
    },
    {
        "text": " que el país se ha de conocer, sí, no solo, o sea, que no solo vengan argentinos y brasileiros,",
        "start": 1666.6000000000001,
        "end": 1673.3600000000001
    },
    {
        "text": " sino que también vengan países de otras partes del mundo. ¿De acuerdo? Sí, bien, entonces,",
        "start": 1673.36,
        "end": 1685.24
    },
    {
        "text": " ¿cómo se llega al 2014? O sea, hacia el 2014, sí, los resultados de este modelo de crecimiento,",
        "start": 1685.24,
        "end": 1695.08
    },
    {
        "text": " buscando inclusión y universalización de las políticas eran bastante auspiciosos,",
        "start": 1695.08,
        "end": 1701.76
    },
    {
        "text": " sí, eran bastante auspiciosos porque el país se iba creciendo, o sea, se lograba mantener el",
        "start": 1701.76,
        "end": 1708.52
    },
    {
        "text": " crecimiento, el precio de la soja, el trigo, el arroz, o sea, el precio de los comodities de los",
        "start": 1708.52,
        "end": 1717.56
    },
    {
        "text": " bienes primarios, seguía alto, China seguía comprando mucho, esos favorecían nuestro crecimiento,",
        "start": 1717.56,
        "end": 1724.16
    },
    {
        "text": " pero sobre todo, lo positivo de este modelo era que el crecimiento se extendía a los indicadores",
        "start": 1725.1200000000001,
        "end": 1735.1200000000001
    },
    {
        "text": " sociales, ¿de acuerdo? O sea, esa torta que crecía, sí, tenía su desparramos, digamos, en",
        "start": 1735.1200000000001,
        "end": 1743.4
    },
    {
        "text": " indicadores sociales, ¿de acuerdo? En qué lo vemos eso? En qué, por ejemplo, la pobreza que en",
        "start": 1743.4,
        "end": 1752.72
    },
    {
        "text": " el 2004 está en 40% en el 2014 pasa a ser el 10%, menos del 10%, en qué lindice de China y que",
        "start": 1752.72,
        "end": 1763.6000000000001
    },
    {
        "text": " mide la desigualdad, sí, pasaba de 0, 44 a 0, 38, o sea, había una clara mejora la distribución",
        "start": 1763.6000000000001,
        "end": 1772.08
    },
    {
        "text": " de los ingresos, en qué el desempleo pasaba de 12%, sí, alrededor de 7%, pero sobre todo,",
        "start": 1772.08,
        "end": 1782.68
    },
    {
        "text": " esta caída del desempleo, lo positivo que tenía era que se debía al incremento de la tasa de empleo,",
        "start": 1782.68,
        "end": 1788.8
    },
    {
        "text": " sí, o sea, esa caída del desempleo se veía favorecida o se provocaba, digamos, por el incremento",
        "start": 1788.8,
        "end": 1798.44
    },
    {
        "text": " del empleo, favorecido, no solo por el incremento del producto, sino también por la ley de inversiones,",
        "start": 1798.44,
        "end": 1803.8400000000001
    },
    {
        "text": " o sea, favorecido por que los empresarios, digamos, estaban, invirtiendo y además esa inversión",
        "start": 1803.84,
        "end": 1814.6399999999999
    },
    {
        "text": " era o tenía un cejo de favorecer a la mano de obra, porque al empresario le convenía contratar",
        "start": 1814.6399999999999,
        "end": 1822.56
    },
    {
        "text": " trabajadores, porque si contrataba trabajadores les descontaban más impuestos, ¿vale?",
        "start": 1822.56,
        "end": 1827.12
    },
    {
        "text": " ¿Qué implicaba eso que la inversión, o sea, por primera vez en el país la inversión pasa",
        "start": 1827.12,
        "end": 1839.6
    },
    {
        "text": " a hacer más del 20% del producto interno-gruto, ¿sí? ¿Estás se acuerdan como era en macro y la",
        "start": 1839.6,
        "end": 1846.32
    },
    {
        "text": " como era el PI? consumo, inversión, gasto y balance comercial, ¿vale?",
        "start": 1846.32,
        "end": 1863.48
    },
    {
        "text": " Esportaciones menos importaciones, acá sí, o sea, en esta época, en este período este",
        "start": 1863.48,
        "end": 1871.1399999999999
    },
    {
        "text": " numerito, sí, por primera vez pasas hacer más del 20% de esto, sí, siempre, o sea, los peridos",
        "start": 1871.14,
        "end": 1878.48
    },
    {
        "text": " anteriores del Uruguay, este numerito estaba, sí, entre el 15 y el 18, por primera vez salta por",
        "start": 1878.48,
        "end": 1884.9
    },
    {
        "text": " arriba del 20, ¿sí? Y eso es un cambio, digamos, bastante importante que se da en esos años,",
        "start": 1884.9,
        "end": 1892.98
    },
    {
        "text": " siguiendo en el mercado laboral, sí, siguiendo en el mercado laboral, la informalidad cae de 40% a",
        "start": 1892.98,
        "end": 1904.1
    },
    {
        "text": " 25%, es decir, que los puestos de trabajo que se crean, o sea, no solamente se crean nuevos puestos",
        "start": 1904.1,
        "end": 1912.58
    },
    {
        "text": " de trabajo, sino que los que se crean son de mejor calidad que los que existían, sí, porque digamos",
        "start": 1912.58,
        "end": 1918.06
    },
    {
        "text": " de nuevo, al verse favorecida la inversión por la ley de inversiones, el empresario tiene",
        "start": 1918.06,
        "end": 1924.22
    },
    {
        "text": " incentivos a contratar trabajadores y a ponerlos en caja, como se dice, a registrarlos en",
        "start": 1924.22,
        "end": 1932.22
    },
    {
        "text": " BPS, porque eso les cuenta impuestos, ¿vale? El salario real crece 4,4% en el promedio anual del",
        "start": 1932.22,
        "end": 1943.74
    },
    {
        "text": " desperido, gracias sobre todo a la convocatoria de los consejos de salario, y por lo tanto,",
        "start": 1943.74,
        "end": 1950.94
    },
    {
        "text": " bueno, los resultados de ese modelo hacia finales del 2014, sí, eran auspiciosos, ¿vale? Sin embargo,",
        "start": 1950.94,
        "end": 1960.54
    },
    {
        "text": " sí, sin embargo, hacia, ya en los últimos meses del 2014 y los primeros meses del 2015,",
        "start": 1960.54,
        "end": 1969.18
    },
    {
        "text": " comienzan, sí, aprenderse cierta luz de samarillas, ¿sí? Comienzan a, digamos,",
        "start": 1969.9,
        "end": 1977.02
    },
    {
        "text": " a ver, se digamos un cierto estancamiento de los buenos resultados, ¿sí? ¿Por qué? Porque cambia el",
        "start": 1979.9,
        "end": 1990.3400000000001
    },
    {
        "text": " contexto, sí, cambia el contexto internacional y cambia el contexto local, ¿sí? o nacional, ¿vale?",
        "start": 1990.34,
        "end": 1997.22
    },
    {
        "text": " ¿Por qué cambia el contexto internacional? Bueno, porque",
        "start": 1999.02,
        "end": 2001.74
    },
    {
        "text": " cae el precio de los comunidades, ¿sí? O sea, el precio de los bienes primarios,",
        "start": 2005.5,
        "end": 2010.3799999999999
    },
    {
        "text": " sí, y la demanda de China cae, ¿de acuerdo? Y por lo tanto, eso hace caer, sí,",
        "start": 2010.38,
        "end": 2019.3400000000001
    },
    {
        "text": " a las exportaciones, ¿de acuerdo? Sí, o sea, y sobre todo lo que trajo como consecuencia",
        "start": 2021.14,
        "end": 2030.74
    },
    {
        "text": " esto es que de junio evidencia, digamos, sí, de junio evidencia que el país, sí,",
        "start": 2030.74,
        "end": 2041.54
    },
    {
        "text": " el país seguir haciendo básicamente, sí, un país que dependía del precio de los bienes primarios,",
        "start": 2041.54,
        "end": 2049.26
    },
    {
        "text": " ¿sí? O sea, lo que trajo como evidencia, esa caída del precio de los bienes primarios,",
        "start": 2049.26,
        "end": 2055.7
    },
    {
        "text": " sí, digamos, esa repercusión que tuvo en el Producto Internobruto, puso de manifiesto que,",
        "start": 2055.7,
        "end": 2064.02
    },
    {
        "text": " en realidad, seguíamos siendo un país de base primaria y dependiente de el precio internacional",
        "start": 2064.02,
        "end": 2070.3799999999997
    },
    {
        "text": " de los comodities. ¿De acuerdo? O sea, mostró, digamos, sí, la escasa transformación productiva,",
        "start": 2070.3799999999997,
        "end": 2078.66
    },
    {
        "text": " sí, la escasa transformación productiva en los 10 años, ¿de acuerdo?",
        "start": 2079.22,
        "end": 2085.54
    },
    {
        "text": " Sí, ojo, esto no quiere decir que el crecimiento de los 10 años anteriores se deba solamente",
        "start": 2085.54,
        "end": 2092.06
    },
    {
        "text": " al alto precio de los comodities, ¿no? O sea, el crecimiento es parte gracias al alto precio de los",
        "start": 2092.06,
        "end": 2099.54
    },
    {
        "text": " comodities, pero también gracias a las instituciones y a las políticas económicas implementadas,",
        "start": 2099.54,
        "end": 2106.14
    },
    {
        "text": " ¿de acuerdo? O sea, siempre que haya crecimiento, o sea, hay varios factores, pero acá claramente,",
        "start": 2106.66,
        "end": 2111.58
    },
    {
        "text": " o sea, estos dos van de la mano, sí, o sea, el precio internacional alto y también, digamos,",
        "start": 2111.58,
        "end": 2117.66
    },
    {
        "text": " las políticas económicas que se implementaron para, digamos, traducir ese precio internacional",
        "start": 2117.66,
        "end": 2126.1
    },
    {
        "text": " alto en crecimiento. Sin embargo, cuando caí ese precio, sí, cuando caí el precio de los",
        "start": 2126.1,
        "end": 2134.66
    },
    {
        "text": " comodities en el 2015, ese impacto que tiene en el producto lo que básicamente pone de manifiestos",
        "start": 2134.66,
        "end": 2142.14
    },
    {
        "text": " que en realidad, sí, seguimos siendo una economía que depende del precio internacional de los",
        "start": 2142.14,
        "end": 2146.7799999999997
    },
    {
        "text": " comodities, ¿no? Y que cuando el precio de los comodities está bajo, la cosa nosotros se nos",
        "start": 2146.7799999999997,
        "end": 2153.06
    },
    {
        "text": " complica, ¿sí? Por lo tanto, ¿qué ocurre a partir de los 2015? ¿sí? ¿qué ocurre a partir de los",
        "start": 2153.06,
        "end": 2165.2599999999998
    },
    {
        "text": " 2015? El gobierno, sí, el gobierno, aunque el mismo partido político, sí, cambia las prioridades,",
        "start": 2165.2599999999998,
        "end": 2175.94
    },
    {
        "text": " cambia las prioridades, ¿de acuerdo? O sea, por más que se mantiene en el poder, el mismo partido,",
        "start": 2175.94,
        "end": 2187.18
    },
    {
        "text": " las prioridades económicas pasan a ser otras, ¿sí? Y la principal pasó a hacer mantener",
        "start": 2187.18,
        "end": 2194.62
    },
    {
        "text": " crecimiento. O sea, a diferencia de los dos gobiernos anteriores, o sea, el periodo 2005 y el",
        "start": 2194.62,
        "end": 2202.3
    },
    {
        "text": " periodo 2010, en donde más que nada se apuntaba a los indicadores sociales, a combatir la pobreza,",
        "start": 2202.3,
        "end": 2209.46
    },
    {
        "text": " combatir la desigualdad, acá la estrategia pasa a hacer mantener crecimiento, sí, como prioridad,",
        "start": 2209.46,
        "end": 2218.02
    },
    {
        "text": " sí, y en ese sentido los indicadores sociales pasan a un segundo plano, digamos. ¿Por qué pasa a",
        "start": 2218.02,
        "end": 2226.6600000000003
    },
    {
        "text": " hacer si el objetivo principal en materia económica mantener el crecimiento? Bueno, porque se trabaja",
        "start": 2226.66,
        "end": 2236.18
    },
    {
        "text": " con la premisa de que el crecimiento es condición necesaria, pero no suficiente para reducir la pobreza",
        "start": 2236.18,
        "end": 2242.2999999999997
    },
    {
        "text": " y la desigualdad. ¿De acuerdo? O sea, básicamente sin crecimiento no se reduce la pobreza y tampoco se",
        "start": 2242.2999999999997,
        "end": 2249.8199999999997
    },
    {
        "text": " reduce la desigualdad. Entonces, primero, primero, mantenamos el crecimiento. ¿De acuerdo?",
        "start": 2249.82,
        "end": 2255.7000000000003
    },
    {
        "text": " Esta es la lógica con la que se trabaja desde 2015 hasta hoy. Por otra parte, sí, en materia macroeconómica,",
        "start": 2255.7000000000003,
        "end": 2271.06
    },
    {
        "text": " el déficit fiscal pasó, el déficit fiscal y la inflación en el 2015, en el 2016, ahora ya no",
        "start": 2271.06,
        "end": 2277.6200000000003
    },
    {
        "text": " tanto, pero sobre todo el déficit fiscal pasaba a hacer, digamos, un talón de aquíles,",
        "start": 2277.62,
        "end": 2283.5
    },
    {
        "text": " o sea, el déficit fiscal constituía un desafío para el gobierno, ¿sí? ¿Se acuerdan como se escribía el",
        "start": 2283.5,
        "end": 2293.74
    },
    {
        "text": " déficit fiscal? ¿Se acuerdan? ¿Me apórmula? ¿Se acuerdan esto?",
        "start": 2293.74,
        "end": 2305.74
    },
    {
        "text": " Agosto, menos impuesto. Entonces, el déficit fiscal pasó a hacer 4% del PIB, ¿sí?",
        "start": 2305.74,
        "end": 2316.5
    },
    {
        "text": " ¿Está? El déficit fiscal pasa a hacer 4% del PIB, ¿sí? Por lo tanto, el objetivo de el nuevo gobierno",
        "start": 2317.22,
        "end": 2329.42
    },
    {
        "text": " pasa a hacer combatir esto, o sea, tratar de que las cuentas públicas no estén tan desequilibradas.",
        "start": 2329.42,
        "end": 2336.68
    },
    {
        "text": " ¿De acuerdo? O sea, si este número es positivo, digamos, y es muy grande lo que significa que el gobierno gastó más",
        "start": 2336.68,
        "end": 2343.38
    },
    {
        "text": " de lo que recaudó. ¿De acuerdo? Y para tratar de achicar esto, ¿sí? Para tratar de",
        "start": 2343.38,
        "end": 2349.46
    },
    {
        "text": " achicar esto, el gobierno, ¿sí? En los primeros años, ataca por este lado, ¿sí? O sea,",
        "start": 2349.46,
        "end": 2358.44
    },
    {
        "text": " ataca por bajar el gasto, ¿sí? Y a partir de, mediado de 2016, cuando se dio cuenta, digamos,",
        "start": 2358.44,
        "end": 2368.3
    },
    {
        "text": " de que esta estrategia no estaba rendiendo sus frutos, sí, ataca por este lado. ¿sí? ¿De acuerdo?",
        "start": 2368.3,
        "end": 2378.82
    },
    {
        "text": " ¿Por qué esta estrategia, digamos, es difícil de que desfrutos? Bueno, porque en realidad la mayoría",
        "start": 2378.82,
        "end": 2386.02
    },
    {
        "text": " del gasto, la mayoría del gasto en Uruguay es bastante rígido, o sea, ya está asignado,",
        "start": 2386.02,
        "end": 2393.2200000000003
    },
    {
        "text": " sí, ya está asignado, digamos, por constitución o ley, ¿sí? ¿Quién se come la mayoría del gasto",
        "start": 2393.22,
        "end": 2400.8599999999997
    },
    {
        "text": " público en Uruguay? ¿Eh? La seguridad social, ¿sí? El compañero fue políticamente correcta ahí,",
        "start": 2400.8599999999997,
        "end": 2410.66
    },
    {
        "text": " los viejos, ¿sí? Los viejos se comen la mayoría del gasto público en Uruguay, ¿y qué pasa en Uruguay?",
        "start": 2410.66,
        "end": 2417.1
    },
    {
        "text": " Estamos lleno de viejos, ¿sí? Y cada vez más, ¿tabes entonces bajar esto? Sí, es bastante difícil,",
        "start": 2417.1,
        "end": 2425.62
    },
    {
        "text": " ¿sí? Bajar esto es bastante difícil, dale. ¿Es más que lo que es más que lo que no?",
        "start": 2425.62,
        "end": 2431.14
    },
    {
        "text": " A bajar el de physical. No, aumentar el crecimiento. Ah, aumentar el crecimiento.",
        "start": 2431.14,
        "end": 2440.66
    },
    {
        "text": " En la verdad, lo que dos cosas. El objetivo va a hacer mantener el crecimiento, sí, pero como",
        "start": 2440.66,
        "end": 2455.66
    },
    {
        "text": " paso para eso, lo que se busca es reducir el de physical, ¿sí? El objetivo va a hacer por lo menos",
        "start": 2455.66,
        "end": 2465.62
    },
    {
        "text": " mantener una tasa de crecimiento positiva por más que no sea tan alta como la de los años",
        "start": 2465.62,
        "end": 2469.8199999999997
    },
    {
        "text": " anteriores. Y para eso el gobierno implementa ciertas estrategias que ahora vamos a ver bien",
        "start": 2469.82,
        "end": 2475.78
    },
    {
        "text": " cuáles son. Pero una de esas es decir, bueno, hay que tener las cuentas públicas en equilibrio",
        "start": 2475.78,
        "end": 2484.7400000000002
    },
    {
        "text": " porque esto me va a favorecer en el futuro. Entonces, tengo que corregir esto, tengo que corregir",
        "start": 2484.7400000000002,
        "end": 2490.82
    },
    {
        "text": " esto. El gobierno ataca por acá los primeros años, sí, hasta medio 2016, medio 2016,",
        "start": 2490.82,
        "end": 2500.46
    },
    {
        "text": " ataca por este lado, sí, y esto comienza a implementarse a partir del primero de enero",
        "start": 2500.46,
        "end": 2506.6600000000003
    },
    {
        "text": " del 2017. O sea, hace una segunda, o hace una profundización de la reforma tributaria,",
        "start": 2506.6600000000003,
        "end": 2515.1000000000004
    },
    {
        "text": " cambia, digamos, sí, cambia ciertos parámetros del IRPF, ciertos parámetros de otros impuestos,",
        "start": 2515.1,
        "end": 2524.7
    },
    {
        "text": " digamos, de fácil recaudación. Con el objetivo de disminuir esto, ¿me acuerdo? ¿Qué ocurre, digamos?",
        "start": 2524.7,
        "end": 2539.22
    },
    {
        "text": " O sea, ¿qué ocurre con esta situación? Por el lado del gasto, lo que pasa es que ciertos",
        "start": 2539.22,
        "end": 2548.7
    },
    {
        "text": " recursos que se destinaban a políticas sociales, o sea, ciertos recursos que se destinaban a la",
        "start": 2548.7,
        "end": 2555.3799999999997
    },
    {
        "text": " salud, a la educación, etcétera, ahora sí se ven recentidos. ¿De acuerdo? O sea, ciertos",
        "start": 2555.3799999999997,
        "end": 2563.8199999999997
    },
    {
        "text": " recursos que estaban acá en las administraciones anteriores, ahora sí se ven recentido,",
        "start": 2563.82,
        "end": 2569.1800000000003
    },
    {
        "text": " ¿por qué el objetivo pasa a ser contra el de pacífica? ¿De acuerdo? ¿Qué ha implicado",
        "start": 2569.1800000000003,
        "end": 2577.02
    },
    {
        "text": " eso en estos años? Eso ha implicado que si bien el crecimiento se ha mantenido, o sea,",
        "start": 2577.02,
        "end": 2583.06
    },
    {
        "text": " si bien el gobierno ha logrado su objetivo de mantener el crecimiento positivo, en el 2015",
        "start": 2583.06,
        "end": 2590.1400000000003
    },
    {
        "text": " se crece 0,4, eso quiere decir que prácticamente la torta que había en el 2015 es más o menos la",
        "start": 2590.14,
        "end": 2597.2999999999997
    },
    {
        "text": " misma que en el 2014, en el 2016 se crece 1,8, lo cual era un muy buen dato para lo esperado previamente,",
        "start": 2597.2999999999997,
        "end": 2607.8599999999997
    },
    {
        "text": " o sea, la torta del 2016 era 1,8 por ciento mayor a la del 2015 y en el primer semestre el 2017,",
        "start": 2607.8599999999997,
        "end": 2617.02
    },
    {
        "text": " si lo comparamos versus el primer semestre el 2016, el crecimiento de 2,8 y se espera que",
        "start": 2617.02,
        "end": 2624.74
    },
    {
        "text": " hacia diciembre, y vamos, o sea, cuando termine el 2017, el dato recién va a salir publicado en marzo",
        "start": 2624.74,
        "end": 2629.54
    },
    {
        "text": " del 2018, pero se espera que cuando termine el 2017, Uruguay crezca alrededor de 3 por ciento con",
        "start": 2629.54,
        "end": 2635.58
    },
    {
        "text": " respecto a 2016, ¿vale? Entonces, digamos, el gobierno cumple el objetivo de mantener el crecimiento,",
        "start": 2635.58,
        "end": 2644.74
    },
    {
        "text": " seguramente digamos, este crecimiento del 2017, que es un poquito mayor de lo que se esperaba al",
        "start": 2644.74,
        "end": 2656.9399999999996
    },
    {
        "text": " principio del comienzo del gobierno, se estire digamos, o sea, tenga su efecto positivo, digamos,",
        "start": 2656.9399999999996,
        "end": 2663.8199999999997
    },
    {
        "text": " su derrame hacia 2018 y 2019, pero sin embargo, hasta el momento, sí, hasta el momento, o sea, no",
        "start": 2663.8199999999997,
        "end": 2671.2999999999997
    },
    {
        "text": " se sabe qué va a pasar de acá hasta el 2020, pero hasta el momento, este crecimiento no se ha reflejado en",
        "start": 2671.3,
        "end": 2676.82
    },
    {
        "text": " indicadores sociales, ¿vale? ¿Qué ha implicado eso que en el 2014 la pobreza que estaba en el nivel",
        "start": 2676.82,
        "end": 2690.02
    },
    {
        "text": " del 10 por ciento, sigue estando en el nivel del 10 por ciento, que el ínice de Shinik estaba en 038,",
        "start": 2690.02,
        "end": 2696.34
    },
    {
        "text": " sí, sigue estando en 038, ¿sí? Que el desempleo, sí, que está en torno del 7 por ciento, ahora",
        "start": 2696.34,
        "end": 2704.5
    },
    {
        "text": " pasa estar en torno al 8 por ciento, o sea, hay un pequeño crecimiento del desempleo, que la",
        "start": 2704.5,
        "end": 2709.42
    },
    {
        "text": " informalidad se detuvo en el 25 por ciento, sí, y que los salarios reales de tuvieron, digamos, su",
        "start": 2709.42,
        "end": 2715.34
    },
    {
        "text": " crecimiento dinámico, o sea, ahora están creciendo una tasa de más o menos entre un y medio de 2 por",
        "start": 2716.46,
        "end": 2723.42
    },
    {
        "text": " ciento, ¿vale? Por lo tanto, ¿qué parecería o cuál parecería ser el desafío, sí, en los años",
        "start": 2723.42,
        "end": 2734.66
    },
    {
        "text": " que quedan, digamos, para el gobierno, el desafío principal parecería ser transformar, sí, este",
        "start": 2734.66,
        "end": 2743.2200000000003
    },
    {
        "text": " crecimiento que ha, o que se ha mantenido, sí, entre otras cosas, gracias a la recuperación del",
        "start": 2743.2200000000003,
        "end": 2753.02
    },
    {
        "text": " precio de los Comoities, en el 2016 y en el 2017, y la recuperación, digamos, de China, como país",
        "start": 2753.02,
        "end": 2761.34
    },
    {
        "text": " comprador, y el desafío parecería ser, digamos, transformar ese crecimiento del bien mejoras de",
        "start": 2761.34,
        "end": 2770.02
    },
    {
        "text": " el nivel de bienestar de la sociedad, sí, o sea, los indicadores sociales parecen a ver detenido,",
        "start": 2770.02,
        "end": 2776.66
    },
    {
        "text": " digamos, su caída, o parecen estar estancados del 2014, y hasta el momento, sí, parecería",
        "start": 2776.66,
        "end": 2782.9
    },
    {
        "text": " como que, por lo menos hasta el 2017 van a seguir en la misma tónica, o sea, no habría grandes",
        "start": 2782.9,
        "end": 2788.9
    },
    {
        "text": " cambios en esos indicadores sociales. ¿De acuerdo? Esto lo voy a pasar.",
        "start": 2788.9,
        "end": 2801.3
    },
    {
        "text": " Bueno, haciendo un, así como un repaso, digamos, de, siendo como un repaso de la historia",
        "start": 2801.3,
        "end": 2822.1800000000003
    },
    {
        "text": " económica de Uruguay, acá lo que se ve, digamos, es el movimiento del producto interno",
        "start": 2822.1800000000003,
        "end": 2827.82
    },
    {
        "text": " bruto a lo largo de la historia del Uruguay, sí, fíjense que, digamos, acá hay un pequeño crecimiento,",
        "start": 2827.82,
        "end": 2840.2200000000003
    },
    {
        "text": " en el periodo de crecimiento hacia afuera, sí, luego hay un alto crecimiento, digamos, en este",
        "start": 2840.2200000000003,
        "end": 2846.6200000000003
    },
    {
        "text": " periodo, que este periodo es la industrialización por sustitución de importaciones, sí, luego el",
        "start": 2846.6200000000003,
        "end": 2853.28
    },
    {
        "text": " producto se estanca, sí, en el 57 sigue relativamente estancado hasta que vuelve a crecer fuerte",
        "start": 2853.28,
        "end": 2860.7200000000003
    },
    {
        "text": " en el 70 hasta el 82 con la crisis de la tablita, en el 82 se desploma, recién recupera su nivel a partir",
        "start": 2860.7200000000003,
        "end": 2870.6800000000003
    },
    {
        "text": " del 90 y en el 98 otro fuerte crecimiento que se desploma en el 2002, ¿de acuerdo? Y que recién,",
        "start": 2870.6800000000003,
        "end": 2878.92
    },
    {
        "text": " digamos, recupera su nivel, sí, a partir del 2004. Si tomamos los últimos años, o sea, si en",
        "start": 2878.92,
        "end": 2887.96
    },
    {
        "text": " realidad vemos la era democrática, este gráfico creo que sea un poquito mejor, fíjense que en",
        "start": 2887.96,
        "end": 2894.48
    },
    {
        "text": " realidad o sea, a partir de la era democrática, sí, lo que se ve es un crecimiento relativamente",
        "start": 2894.48,
        "end": 2901.36
    },
    {
        "text": " sostenido, sea de tendencia entre el 90 y el 98 y en el 99 ya comienza la recepción, se",
        "start": 2901.36,
        "end": 2910.1200000000003
    },
    {
        "text": " uruguay comienza a caer en el 99 y termina desplomándose en el 2002, ¿de acuerdo? En el 2003 permanece",
        "start": 2910.1200000000003,
        "end": 2918.96
    },
    {
        "text": " estancado, digamos, o sea, casi igual que el 2002 y en el 2004 comienza así a recuperarse. Cuando",
        "start": 2918.96,
        "end": 2927.36
    },
    {
        "text": " recupera, digamos, los niveles previos a la crisis, o sea, cuando recupera los niveles del 98,",
        "start": 2927.36,
        "end": 2932.6
    },
    {
        "text": " sí, recién, digamos, a partir del 2006 y 2007 y luego sí fíjense que en realidad el crecimiento",
        "start": 2932.6,
        "end": 2939.4
    },
    {
        "text": " ha sido bastante dinámico, sobre todo los últimos, o sea, en el periodo 2015-2014, para luego fíjense",
        "start": 2939.4,
        "end": 2948.08
    },
    {
        "text": " como en realidad hacia el final del periodo 2016-2017, la curva, digamos, se vuelve bastante",
        "start": 2948.08,
        "end": 2956.84
    },
    {
        "text": " plana, sí, lo ven, o sea, los últimos dos datos muestran claramente que en realidad, sí,",
        "start": 2956.84,
        "end": 2964.56
    },
    {
        "text": " la velocidad de crecimiento ha diminuido los últimos años. Esto es, sí, la variación",
        "start": 2964.56,
        "end": 2973.48
    },
    {
        "text": " porcentual en tasas de crecimiento, o sea, es básicamente el mismo gráfico que el anterior,",
        "start": 2973.48,
        "end": 2979.12
    },
    {
        "text": " pero haciendo la variación porcentual y acá lo que se ve básicamente es de nuevo, o sea,",
        "start": 2979.12,
        "end": 2985.48
    },
    {
        "text": " crecimiento en los 90, salvo en el año 1995, luego sí, desplome con la crisis del 2002 y luego sí",
        "start": 2986.92,
        "end": 2998.48
    },
    {
        "text": " algo que si usted se escucha el Ministro de Economía va a insistir con esta idea de que, digamos,",
        "start": 2998.48,
        "end": 3008.48
    },
    {
        "text": " este periodo, sí, este periodo es, digamos, el periodo más largo de la historia Uruguay,",
        "start": 3008.48,
        "end": 3015.4
    },
    {
        "text": " sí, de años consecutivos de crecimiento positivo, o sea, si usted lo, o sea, cuando recuerden,",
        "start": 3015.4,
        "end": 3024.6
    },
    {
        "text": " cuando salga el dato del 2017 en que el crecimiento va a ser positivo y va a andar en el 3%, el",
        "start": 3024.6,
        "end": 3031.2799999999997
    },
    {
        "text": " Ministro de Economía va a decir, está, llevamos 14 años de crecimiento consecutivo y está ahí,",
        "start": 3031.2799999999997,
        "end": 3036.92
    },
    {
        "text": " se pasen más unos puntuales, ¿no? Se va a notar unos purotitos, sí, lo ven, se afíguense que,",
        "start": 3036.92,
        "end": 3047.04
    },
    {
        "text": " en realidad, él puede decir eso porque en el 2015, sí, el dato fue 0,4, o sea, si bien fue",
        "start": 3047.04,
        "end": 3056.2799999999997
    },
    {
        "text": " prácticamente 0, este 0,4 es un poquito más que 0 y entonces lo habilitan de decir eso,",
        "start": 3056.2799999999997,
        "end": 3062.44
    },
    {
        "text": " se entiende este gráfico, ¿no? ¿Sí? Bien, bien,",
        "start": 3067.96,
        "end": 3076.4
    },
    {
        "text": " se acuerdan como era el índice de salario real,",
        "start": 3077.2799999999997,
        "end": 3081.16
    },
    {
        "text": " sí, bien, el índice de salarios medio sobre el índice de preciosa y consumo,",
        "start": 3095.16,
        "end": 3103.68
    },
    {
        "text": " ¿qué es lo que mide básicamente el salario real es el poder de compra de los trabajadores?",
        "start": 3107.64,
        "end": 3113.2
    },
    {
        "text": " Sí, el índice de salario medio, lo que mide es, o sea, el promedio de salarios de los trabajadores",
        "start": 3113.2,
        "end": 3121.36
    },
    {
        "text": " en términos nominales y el IPC, lo que mide es un promedio ponderado de la canasta del consumo",
        "start": 3121.36,
        "end": 3129.0
    },
    {
        "text": " de los hogares de Uruguay, entonces haciendo esa división, lo que miro es básicamente cuántos",
        "start": 3129.0,
        "end": 3137.64
    },
    {
        "text": " bienes pueden comprar los trabajadores, fíjense que acá, lo que se ve es que si tomamos,",
        "start": 3137.64,
        "end": 3148.4
    },
    {
        "text": " o sea, la base cien o sea, arrancando en el periodo post dictadura como cien, lo que se ve es,",
        "start": 3148.4,
        "end": 3155.64
    },
    {
        "text": " digamos, un crecimiento bastante leve, entre el 86 y el 91 pasando por una caída acá y luego",
        "start": 3155.64,
        "end": 3166.48
    },
    {
        "text": " un estancamiento, luego un estancamiento del salario real entre el 91 y el 99, ¿Sí? ¿Qué es",
        "start": 3166.48,
        "end": 3176.48
    },
    {
        "text": " algo? Digamos que se veía, o sea, que se corroboraba en el periodo de los 90, o sea, que",
        "start": 3176.48,
        "end": 3185.96
    },
    {
        "text": " este crecimiento del PIB, este crecimiento del PIB, en la década de los 90, no se tradujo,",
        "start": 3185.96,
        "end": 3192.96
    },
    {
        "text": " sí, a un crecimiento de los salarios, sí, y sin embargo fíjense que cosa extraña,",
        "start": 3193.92,
        "end": 3204.12
    },
    {
        "text": " que esta caída, sí, que esa caída del PIB, que es fuerte pero, no tanto, fíjense acá,",
        "start": 3207.6,
        "end": 3218.52
    },
    {
        "text": " sí, por lo tanto, sí, los salarios se desploman, a partir de la crisis del 2002, o sea,",
        "start": 3219.36,
        "end": 3232.8
    },
    {
        "text": " poco antes con la recesión, pero tocan su fondo en el 2002, en el 2003 siguen estancados y recién",
        "start": 3232.8,
        "end": 3239.84
    },
    {
        "text": " comienza la recuperación en 2004 y recién, sí, en el año 2009 recuperan, sí, el poder de",
        "start": 3239.84,
        "end": 3248.08
    },
    {
        "text": " compra que tenían antes de la crisis, ¿Ah? Y luego, digamos, siguen manteniendo una etapa de",
        "start": 3248.08,
        "end": 3259.48
    },
    {
        "text": " crecimiento bastante fuerte, pero si usted ven sobre los últimos dos años, sí, la velocidad",
        "start": 3259.48,
        "end": 3267.16
    },
    {
        "text": " de crecimiento de los salarios comienza a lentecer, sí, lo ven, o sea, esta curva que viene siendo",
        "start": 3267.16,
        "end": 3272.92
    },
    {
        "text": " bastante empinada sobre los últimos dos años se vuelve machata, lo ven si o no, sí,",
        "start": 3272.92,
        "end": 3280.64
    },
    {
        "text": " esto es el gráfico de inflación, sí, entonces el gráfico de inflación de de 1986 hasta",
        "start": 3290.08,
        "end": 3299.32
    },
    {
        "text": " la actualidad y acá lo que se ve es que en realidad sí, fíjense, esto es el 80 y esto es",
        "start": 3300.28,
        "end": 3310.6800000000003
    },
    {
        "text": " el 90, o sea, en el 90 se arranca con 110 por ciento de inflación, sí, o sea, 110 por ciento de",
        "start": 3310.6800000000003,
        "end": 3318.36
    },
    {
        "text": " inflación, ¿Ah? Es algo que digamos, ¿Ah? Uno como que no se imagina, sí, pero en realidad hace",
        "start": 3318.36,
        "end": 3328.4
    },
    {
        "text": " sí, hace 30 años que pasó esto, o sea, no es mucho la historia económica, pero sí es un dato",
        "start": 3331.04,
        "end": 3338.4
    },
    {
        "text": " bastante fuerte, sí, entre un año y otro, sí, o sea, no solo algo sino la canasta de los",
        "start": 3338.4,
        "end": 3354.7200000000003
    },
    {
        "text": " sobares, la canasta de consumo, la no era solo un producto sino que es la canasta de consumo",
        "start": 3354.7200000000003,
        "end": 3360.48
    },
    {
        "text": " y bueno, o sea, es un promedio ponderado de lo que se consume, ¿Ah? ¿Ah? ¿Ah? ¿Ah? ¿Ah?",
        "start": 3360.48,
        "end": 3372.32
    },
    {
        "text": " ¿Ah? Bueno, ¿No? Sí, o sea, el salario real, sí, o sea, acá lo que pasaba es que ahí,",
        "start": 3372.32,
        "end": 3383.76
    },
    {
        "text": " ¿Qué es lo que pasa acá? Realidad, una caída de LPC fuerte en la década de 90, pero si el salario real",
        "start": 3384.32,
        "end": 3393.32
    },
    {
        "text": " se mantuvo, sí, lo que vos puedes concluir es que en realidad también hay una caída de NMS,",
        "start": 3393.32,
        "end": 3399.0
    },
    {
        "text": " sí, y esto ocurre, sí, sobre todo porque se deja de convocar a la negociación colectiva a partir",
        "start": 3399.0,
        "end": 3409.8
    },
    {
        "text": " del 92, sí, y por lo tanto, él digamos, esos aumentos de productividad, sí, tendían a irse a la",
        "start": 3409.8,
        "end": 3420.96
    },
    {
        "text": " ganancia y no a los salarios, ¿Ah? Vuelvo acá, fíjense que la inflación, o sea, el modelo o el",
        "start": 3420.96,
        "end": 3434.2000000000003
    },
    {
        "text": " plan de estabilización de los 90, en bajar la inflación tiene su cumple, o objetivo, tiene su",
        "start": 3434.2,
        "end": 3440.2
    },
    {
        "text": " logro, es exitoso, sí, o sea, logra bajar la inflación, después en el 2012 no iba a ser pelota",
        "start": 3440.2,
        "end": 3446.8799999999997
    },
    {
        "text": " contra todo, pero sí, el objetivo de bajar la inflación se cumple, fíjense que en el 2002",
        "start": 3446.8799999999997,
        "end": 3453.64
    },
    {
        "text": " pedón saltito, sí, esto es unas cosas, sí, son las cosas extrañas que tiene digamos el mundo,",
        "start": 3453.64,
        "end": 3461.16
    },
    {
        "text": " digamos, donde se desmorona todo, pero los precios suben, sí, una cosa media extraña, y sin embargo,",
        "start": 3461.16,
        "end": 3469.3199999999997
    },
    {
        "text": " bueno, después del 2003, 2004, sí, vuelven a pegar la baja, sí, se estabiliza la cuestión,",
        "start": 3469.3199999999997,
        "end": 3475.24
    },
    {
        "text": " y luego la inflación se mantiene, digamos, en este tono, sí, levemente alcista, hasta los",
        "start": 3476.8399999999997,
        "end": 3484.48
    },
    {
        "text": " primeros meses, el 2016, perdón, hasta los primeros meses, el 2017, en donde,",
        "start": 3484.48,
        "end": 3490.08
    },
    {
        "text": " se ayó esto no lo dibujé, pero en donde esto comienza y vamos a descender un poquito,",
        "start": 3490.08,
        "end": 3495.4
    },
    {
        "text": " la importante digamos básicamente es que desde acá hasta acá, sí, la inflación se ha mantenido",
        "start": 3498.2400000000002,
        "end": 3505.76
    },
    {
        "text": " relativamente controlada, sí, y sobre todo que la metodología o las políticas para controlar",
        "start": 3505.76,
        "end": 3521.48
    },
    {
        "text": " la inflación fueron efectivas y no utilizando el tipo de cambio, sí, se acuerdan que decíamos",
        "start": 3521.48,
        "end": 3528.0
    },
    {
        "text": " que, entonces supongo que lo habrán visto con María Noel, ¿cuáles eran una de las similitudes",
        "start": 3528.0,
        "end": 3534.5200000000004
    },
    {
        "text": " entre la crisis del 2002 y la crisis del 82?",
        "start": 3534.52,
        "end": 3537.16
    },
    {
        "text": " Bien, bien, perfecto, o sea, ¿qué había pasado con eso? O sea, lo que decíamos era, bueno,",
        "start": 3547.32,
        "end": 3555.7599999999998
    },
    {
        "text": " en los 90, sí, teníamos 110% de inflación, entonces, que hizo el gobierno aplicó la banda de",
        "start": 3556.76,
        "end": 3567.32
    },
    {
        "text": " explotación, acá yo no lo dibujé, porque el dibujé solo era democrática, pero en los 80,",
        "start": 3567.32,
        "end": 3575.0
    },
    {
        "text": " si, finales de los 70, teníamos también una inflación por arriba del 100, que hace el gobierno",
        "start": 3575.0,
        "end": 3581.5200000000004
    },
    {
        "text": " de dictadura aplica la tablita, ¿sí? En qué consistía eso, o sea, cómo se le llama esa política,",
        "start": 3581.52,
        "end": 3591.24
    },
    {
        "text": " digamos? O sea, el objetivo era controlar o bajar la inflación, ¿sí? Y ahí el compañero dice, bueno,",
        "start": 3591.24,
        "end": 3602.64
    },
    {
        "text": " una de las similitudes de la crisis del 2002, y con el 82 es la utilización del tipo de cambio,",
        "start": 3602.64,
        "end": 3610.72
    },
    {
        "text": " sí, o sea, combate a la inflación, combate a la inflación utilizando el tipo de cambio como",
        "start": 3611.52,
        "end": 3629.84
    },
    {
        "text": " ancla, ¿sí? De acuerdo, o sea, es tirar los precios para abajo utilizando el tipo de cambio,",
        "start": 3629.84,
        "end": 3639.96
    },
    {
        "text": " de acuerdo, en el 82 fue la tablita que consistía de decirle al público, bueno, de acá tres meses",
        "start": 3639.96,
        "end": 3647.96
    },
    {
        "text": " el dólar va a estar a tanto, ¿sí? Y en el 2002 fue la banda de explotación, ¿sí? Con una banda",
        "start": 3647.96,
        "end": 3653.92
    },
    {
        "text": " relativamente corta de tipo de cambio básicamente fijo, ¿sí? ¿Qué problema tenía eso, digamos?",
        "start": 3653.92,
        "end": 3664.36
    },
    {
        "text": " O sea, esos sistemas, digamos, esta utilización ya sea de la tablita o de la banda de explotación,",
        "start": 3667.0,
        "end": 3676.92
    },
    {
        "text": " sí, tendiendo a hacer un tipo de cambio fijo, una banda relativamente corta, ¿qué incentiva, digamos?",
        "start": 3677.48,
        "end": 3684.2000000000003
    },
    {
        "text": " O sea, ¿cuál fueron otras de las similitudes entre la crisis del 2002 y la crisis del 82?",
        "start": 3687.0,
        "end": 3692.52
    },
    {
        "text": " La pérdida de reservas del banco central, sí, la pérdida de reservas del banco central, y eso",
        "start": 3696.36,
        "end": 3702.92
    },
    {
        "text": " es un por qué se da? Tiene que ir?",
        "start": 3702.92,
        "end": 3707.2000000000003
    },
    {
        "text": " Perfecto, entonces ¿qué hace el banco central? ¿Está?",
        "start": 3715.7200000000003,
        "end": 3718.2000000000003
    },
    {
        "text": " Bien, está vendiendo dólares, ¿acuerdo?",
        "start": 3720.6800000000003,
        "end": 3722.76
    },
    {
        "text": " ¿Estamos acuerdos con eso o sí o no? ¿sí? Bien, entonces ¿por qué el banco central lo se está vendiendo?",
        "start": 3723.8,
        "end": 3729.64
    },
    {
        "text": " ¿Por qué hay gente que los está comprando? ¿Está?",
        "start": 3730.6,
        "end": 3733.7999999999997
    },
    {
        "text": " Entonces, ¿estos sistemas incentivan a la demanda?",
        "start": 3734.44,
        "end": 3737.96
    },
    {
        "text": " ¿Incentivan a la demanda?",
        "start": 3739.08,
        "end": 3740.2799999999997
    },
    {
        "text": " Exactamente, exactamente, ¿tá? Y la banda de explotación, sí, lo que implicaba era también, digamos,",
        "start": 3744.2799999999997,
        "end": 3751.8799999999997
    },
    {
        "text": " si yo tengo cierto riesgo y veo que Brasil de Valu, Argentina se viene a Pique, y bueno,",
        "start": 3751.8799999999997,
        "end": 3757.96
    },
    {
        "text": " ¿cuánto podemos tardarnos o troncarnos? Muy poco, sí, entonces esos sistemas incentivan a la demanda, ¿sí?",
        "start": 3757.96,
        "end": 3765.32
    },
    {
        "text": " ¿Cuál es la única forma? ¿sí? ¿Cuál es la única forma de si yo quiero mantener el tipo de cambio?",
        "start": 3765.32,
        "end": 3778.2
    },
    {
        "text": " ¿sí? ¿y sé qué está aumentando la demanda? ¿qué tiene que pasar para que yo pueda mantener el tipo de cambio?",
        "start": 3778.2,
        "end": 3785.64
    },
    {
        "text": " ¿sí perderá el tipo de cambio?",
        "start": 3788.12,
        "end": 3790.12
    },
    {
        "text": " Sí, perderá, o sea, ¿qué es? ¿cómo... Si quieres no pensamos en los dólares,",
        "start": 3792.6,
        "end": 3797.44
    },
    {
        "text": " pensemos en caramelos. Yo saco un caramelo al mercado y sé que el caramelo está buenazo,",
        "start": 3797.44,
        "end": 3802.08
    },
    {
        "text": " sí, sé que a la gente le va a gustar muchísimo, ¿sí? Y entonces, sé que la gente me va a venir a comprar,",
        "start": 3802.08,
        "end": 3810.0
    },
    {
        "text": " ¿sí? Y yo quiero, porque soy bueno y colaboro con la comunidad, mantener el precio de caramelo,",
        "start": 3810.0,
        "end": 3817.2
    },
    {
        "text": " ¿qué tengo que hacer? ¿qué significa eso?",
        "start": 3817.96,
        "end": 3825.2
    },
    {
        "text": " Sí, ¿cómo se hace para eso? Hablemos en término económico, si está aumentando la demanda, ¿a qué estoy jugado?",
        "start": 3825.2,
        "end": 3833.44
    },
    {
        "text": " Hablemos en término económico. Si aumenta la demanda, ¡muchacho!",
        "start": 3833.44,
        "end": 3839.8
    },
    {
        "text": " Aumentar la oferta, ¿sí? Aumentar la oferta, si aumenta la demanda y quiero mantener el precio",
        "start": 3839.8,
        "end": 3845.52
    },
    {
        "text": " para que el precio no suba, lo único que tengo que...",
        "start": 3845.52,
        "end": 3848.6
    },
    {
        "text": " A lo único que estoy apostando es aumentar la oferta ¿sí? ¿cuál es el problema con el dólar?",
        "start": 3848.6,
        "end": 3853.92
    },
    {
        "text": " No, comparemos los con los caramelos. Claro, claro que yo no tengo la máquina,",
        "start": 3863.16,
        "end": 3870.84
    },
    {
        "text": " los caramelos sí, puedo hacerlo, me quedo 20 horas elaborando para sacar más caramelo y vendarlo al mismo precio,",
        "start": 3871.0,
        "end": 3877.1200000000003
    },
    {
        "text": " pero nosotros no somos productores de dólares. Entonces, estoy jugado a que el aumento de esa oferta venga el exterior.",
        "start": 3877.1200000000003,
        "end": 3887.56
    },
    {
        "text": " ¿De acuerdo? O sea, estoy jugado a que ingrese en capitales al Uruguay, estoy jugado en que ingrese monedas",
        "start": 3887.56,
        "end": 3893.8
    },
    {
        "text": " a la extranjera del Uruguay. ¿De acuerdo? Y por lo tanto, si se cae argentinas, si se cae Brasil,",
        "start": 3893.8,
        "end": 3900.6400000000003
    },
    {
        "text": " no van a ingresar dólares. Me explicó, sí o no. Por lo tanto, este sistema es muy lindo cuando",
        "start": 3900.6400000000003,
        "end": 3912.2000000000003
    },
    {
        "text": " al mundo le va bien, pero cuando al mundo le va, ¿qué dopatas para arriba? ¿De acuerdo?",
        "start": 3912.2000000000003,
        "end": 3918.1200000000003
    },
    {
        "text": " Por lo tanto, sí, ¿por qué dopatas para arriba? Porque no me queda otra, sí, que al final del día abandonar",
        "start": 3918.12,
        "end": 3928.4
    },
    {
        "text": " el tipo de cambio fijo, o sea dejar flotar el tipo de cambio, que implicaría subir los precios. ¿De acuerdo?",
        "start": 3928.4,
        "end": 3934.2
    },
    {
        "text": " Una explicación de esto, ¿sí? Una explicación de este movimiento acá de el salto de la inflación, ¿sí? ¿Qué es lo que se ha",
        "start": 3936.2,
        "end": 3946.72
    },
    {
        "text": " implementado acá para controlar la inflación? Bueno, dejar flotar el tipo de cambio, o sea, ahora lo que se",
        "start": 3946.72,
        "end": 3956.3599999999997
    },
    {
        "text": " aplica, sí, es el control de la inflación a través de la cantidad de dinero. O sea, no a través del",
        "start": 3956.3599999999997,
        "end": 3963.2
    },
    {
        "text": " tipo de cambio, sí, si no a través de la cantidad de dinero. ¿De acuerdo? Esto es la tasa actividad,",
        "start": 3963.2,
        "end": 3980.2
    },
    {
        "text": " la tasa de empleo y la tasa de desempleo. La tasa actividad y la empleo se miren sobre el eje",
        "start": 3980.2,
        "end": 3986.2
    },
    {
        "text": " izquierdo y la tasa de desempleo sobre el eje derecho. ¿Se acuerdan la en descripción? ¿A qué",
        "start": 3986.2,
        "end": 3993.64
    },
    {
        "text": " eres igual la tasa de desempleo? Uno menos. Hay, uno menos la tasa de empleo sobre la tasa actividad. ¿Sí? ¿Se acuerdan de esto?",
        "start": 3993.64,
        "end": 4013.72
    },
    {
        "text": " ¿Y la tasa activa como era? Bien, la población económicamente activa sobre la población",
        "start": 4016.6,
        "end": 4026.3199999999997
    },
    {
        "text": " en EDA de trabajar y la tasa de ocupación en la tasa de empleo. ¿O ocupados? ¿O ocupados?",
        "start": 4026.3199999999997,
        "end": 4035.96
    },
    {
        "text": " ¿No? ¿O ocupados sobre la población en EDA de trabajar y la tasa de desempleo?",
        "start": 4035.96,
        "end": 4045.96
    },
    {
        "text": " ¿De esos ocupados sobre pega? ¿Está? Esta relación sale de jugar con estas cositas. La pega a",
        "start": 4045.96,
        "end": 4060.76
    },
    {
        "text": " que eres igual. ¿Se acuerdan? ¿Cómo? ¿Lo que están? Bien, ¿cómo le llamamos a esto?",
        "start": 4060.76,
        "end": 4078.36
    },
    {
        "text": " ¿O ocupados? Más desocupados. ¿Está? La pega son los ocupados más los desocupados. ¿Ya acuerdo?",
        "start": 4078.36,
        "end": 4087.76
    },
    {
        "text": " Por lo tanto fíjense que en realidad, ¿Sí? La tasa, o sea, esta relación, lo que me indica es que",
        "start": 4087.76,
        "end": 4096.24
    },
    {
        "text": " siempre va a haber un desempleo positivo, porque, o sea, cuando haya un desocupado, ya la tasa de",
        "start": 4096.24,
        "end": 4102.76
    },
    {
        "text": " desempleo tiene que ser positivo. Lo ven acá, porque, por ejemplo, otra forma de escribir la tasa",
        "start": 4102.76,
        "end": 4108.76
    },
    {
        "text": " de actividad es ocupados, más desocupados sobre peto. ¿Sí? ¿Ya acuerdo? Este numerito es el mismo,",
        "start": 4108.76,
        "end": 4120.16
    },
    {
        "text": " este numerito es el mismo y la única diferencia está acá. ¿Ya acuerdo? Por lo tanto, la tasa de",
        "start": 4120.16,
        "end": 4128.24
    },
    {
        "text": " actividad siempre va a ser mayor a la tasa de ocupación. ¿Sí? ¿Ya acuerdo? La tasa de actividad es la",
        "start": 4128.24,
        "end": 4140.24
    },
    {
        "text": " azul, la tasa de ocupación es la naranja y la tasa de desempleo es la, ¿Cómo le ven ahí? No sé, gris.",
        "start": 4140.24,
        "end": 4146.4
    },
    {
        "text": " Rosada. Y allí lo que se ve es fíjense de nuevo, una tasa de actividad y de empleo,",
        "start": 4146.4,
        "end": 4157.0
    },
    {
        "text": " sí, una tasa de actividad y de empleo, que es bastante, bastante, bastante similar, o sea, las",
        "start": 4157.0,
        "end": 4165.5199999999995
    },
    {
        "text": " dos parecerían estar bastante estancadas entre el 86 y el 96, ¿Sí? Luego la tasa de empleo en el 98 tiene",
        "start": 4165.52,
        "end": 4182.0
    },
    {
        "text": " un piquito ahí, luego cae, cae, cae, cae, cae. ¿Sí? Y la tasa de actividad se mantiene",
        "start": 4182.0,
        "end": 4188.72
    },
    {
        "text": " relativamente estable, sí, la tasa de actividad se mantiene relativamente estable, sí. Por lo",
        "start": 4188.72,
        "end": 4196.16
    },
    {
        "text": " tanto, esta suba de la tasa de desempleo, esa suba de la tasa de desempleo a partir, sí,",
        "start": 4196.16,
        "end": 4203.280000000001
    },
    {
        "text": " del 99 se explica principalmente por la caída del empleo, ¿Ya acuerdo? Se explica principalmente por",
        "start": 4204.64,
        "end": 4212.4400000000005
    },
    {
        "text": " la caída del empleo. Y luego el desempleo a partir de el 2003, 2004 comienza a bajar, sobre todo,",
        "start": 4212.44,
        "end": 4223.839999999999
    },
    {
        "text": " sí, gracias al aumento del empleo. Y acuerdo, o sea, si ustedes ven, la tasa de actividad se mantiene",
        "start": 4223.839999999999,
        "end": 4232.759999999999
    },
    {
        "text": " relativamente estable en esos años y la tasa de empleo crece, crece, crece. Sí, fíjense que",
        "start": 4232.759999999999,
        "end": 4240.639999999999
    },
    {
        "text": " también crece un poquito la tasa de actividad. ¿De acuerdo? Pero la tasa de, o sea, esta caída más",
        "start": 4240.64,
        "end": 4249.200000000001
    },
    {
        "text": " que nada se explica porque la tasa de empleo crece con mayor fuerza que la tasa de actividad.",
        "start": 4249.200000000001,
        "end": 4254.360000000001
    },
    {
        "text": " Luego se estanca el crecimiento del empleo, fíjense que a partir de 2011 prácticamente están los",
        "start": 4257.4800000000005,
        "end": 4265.38
    },
    {
        "text": " mismos niveles que en el 2014 y en el 2015, 2016 se aprecia una leve caída de la tasa de empleo y una",
        "start": 4265.38,
        "end": 4274.66
    },
    {
        "text": " menor caída de la tasa de actividad. Lo que implica que el desempleo pase prácticamente de 6,5 a",
        "start": 4274.66,
        "end": 4281.58
    },
    {
        "text": " casi 8. Y este es el gráfico de informalidad, sí, que es, digamos, el registro de la seguridad social,",
        "start": 4281.58,
        "end": 4298.7
    },
    {
        "text": " que aquí lo que se ve prácticamente es que la informalidad está bastante estancada entre el 90 y el 2000,",
        "start": 4298.7,
        "end": 4307.0599999999995
    },
    {
        "text": " que luego digamos tiene un descenso pero vuelve a crecer con la crisis del 2002 y a partir",
        "start": 4307.06,
        "end": 4316.780000000001
    },
    {
        "text": " de 2003 comienzo un descenso bastante sostenido que se detiene en el 2014, sí, fíjense que, o sea,",
        "start": 4316.780000000001,
        "end": 4326.780000000001
    },
    {
        "text": " esta caída de la informalidad comienza a entresearse los últimos años.",
        "start": 4326.780000000001,
        "end": 4333.820000000001
    },
    {
        "text": " ¿Qué ha pasado entonces en el último año, digamos, en el 2016 y qué está ocurriendo en los",
        "start": 4337.06,
        "end": 4361.96
    },
    {
        "text": " primeros meses del 2017? Bueno, en el 2016, sí, Uruguay logra mantener el crecimiento del producto,",
        "start": 4361.96,
        "end": 4375.36
    },
    {
        "text": " sí, y seguramente lo va a mantener también en el 2017 y por lo tanto con eso, con la mantención",
        "start": 4375.36,
        "end": 4386.08
    },
    {
        "text": " del 2017, se espera que el producto crezca un 3%, se cumplirían, digamos, 15 años de crecimiento.",
        "start": 4386.08,
        "end": 4392.84
    },
    {
        "text": " Sí. ¿Hay una proyección de la producción del 2012?",
        "start": 4398.84,
        "end": 4403.44
    },
    {
        "text": " ¿Qué yo conozcano?",
        "start": 4403.44,
        "end": 4406.28
    },
    {
        "text": " No, o sea, hay una proyección de largo plazo, digamos, tendencial de acá 50 años que lo que dice es",
        "start": 4406.28,
        "end": 4418.16
    },
    {
        "text": " que la tasa potencial, digamos, lo que sería la tasa promedio de crecimiento de acá,",
        "start": 4418.16,
        "end": 4424.4
    },
    {
        "text": " o sea, 30 años sería de un 3%, ¿sí? Entonces, estos datos, digamos, lo que algunos indican es que",
        "start": 4425.36,
        "end": 4434.24
    },
    {
        "text": " hoy se está creciendo a lo que sería nuestra tasa potencial, o sea que los años anteriores se",
        "start": 4434.24,
        "end": 4441.16
    },
    {
        "text": " creció muchísimo, sí, y que este sería como nuestra tasa potencial, que es como a lo que",
        "start": 4441.16,
        "end": 4448.28
    },
    {
        "text": " deberíamos estar acostumbrados, o sea, básicamente lo que estamos diciendo es, bueno, miren que",
        "start": 4448.28,
        "end": 4457.96
    },
    {
        "text": " no todas las elecciones van a tener a suarición y acaban, los años siguientes probablemente no sean",
        "start": 4461.96,
        "end": 4467.759999999999
    },
    {
        "text": " tal lindos como lo que estamos viendo ahora, ¿sí?",
        "start": 4467.76,
        "end": 4470.24
    },
    {
        "text": " Porque así es la historia, ¿nuestra?",
        "start": 4472.88,
        "end": 4474.64
    },
    {
        "text": " ¿Cómo ha sido el crecimiento en el 2016, digamos?",
        "start": 4477.12,
        "end": 4480.08
    },
    {
        "text": " Bueno, prácticamente sí, todos los sectores, sí, esto no lo puse acá, todos los sectores",
        "start": 4481.52,
        "end": 4494.72
    },
    {
        "text": " de la economía, sí, todos los sectores de la economía han logrado un crecimiento en el año",
        "start": 4494.72,
        "end": 4508.280000000001
    },
    {
        "text": " 2016 con respecto al 2015 y en el primer semestre del 2017 con respecto al 2016, salvo, sí,",
        "start": 4508.280000000001,
        "end": 4515.76
    },
    {
        "text": " la industria manufacturera por el efecto de la refinería, que ahora les explico un poquito,",
        "start": 4517.4400000000005,
        "end": 4522.52
    },
    {
        "text": " y salvo la construcción, la industria manufacturera porque la refinería de ANCAP se cierra",
        "start": 4522.52,
        "end": 4531.72
    },
    {
        "text": " algunos meses para mantenimiento, limpieza, etcétera y eso, digamos, impacta la actividad,",
        "start": 4531.72,
        "end": 4537.160000000001
    },
    {
        "text": " sí, o sea, tira para abajo la actividad y la construcción que también digamos de tuvo su levante,",
        "start": 4537.160000000001,
        "end": 4546.4400000000005
    },
    {
        "text": " sí, se analizamos por el enfoque del gasto, o sea, si no lo analizamos por sectores y lo analizamos",
        "start": 4546.44,
        "end": 4555.44
    },
    {
        "text": " en base a estos componentes, lo que ha sostenido el crecimiento del PIB en estos últimos años,",
        "start": 4555.44,
        "end": 4564.799999999999
    },
    {
        "text": " nuevamente ha sido el consumo, o sea, el consumo sigue siendo, digamos, el consumo sigue siendo",
        "start": 4564.799999999999,
        "end": 4572.599999999999
    },
    {
        "text": " el factor más importante del crecimiento, o sea, siempre era sido, pero en estos años,",
        "start": 4572.6,
        "end": 4577.84
    },
    {
        "text": " digamos, había perdido, sobre todo en el 2015 se había notado un deterioro del consumo,",
        "start": 4577.84,
        "end": 4583.120000000001
    },
    {
        "text": " sí, un enlentecimiento del consumo, que vuelve a recuperarse en el 2016 y en el 2017, ¿cá?",
        "start": 4583.120000000001,
        "end": 4589.76
    },
    {
        "text": " A la vez una cosa mencionar es que las exportaciones también han jugado un papel muy importante,",
        "start": 4603.6,
        "end": 4611.120000000001
    },
    {
        "text": " sobre todo en el 2017 o lo que ha hecho el 2017, sí, con un incremento entre el primer semestre",
        "start": 4611.120000000001,
        "end": 4618.68
    },
    {
        "text": " del 2017 y el primer semestre del 2016 de casi 10 por ciento. ¿Qué ha pasado con el déficit fiscal?",
        "start": 4618.68,
        "end": 4626.92
    },
    {
        "text": " Bueno, el déficit fiscal sigue en niveles altos, o sea, el déficit fiscal sigue en torno,",
        "start": 4627.92,
        "end": 4633.4
    },
    {
        "text": " el 4 por ciento del PIB y el gobierno en este año comienza a implementar la modificación",
        "start": 4633.4,
        "end": 4643.4
    },
    {
        "text": " a la reforma tributaria y se espera que con eso, se espera que con eso,",
        "start": 4643.4,
        "end": 4649.36
    },
    {
        "text": " aumenta la recaudación, sí, se espera que con eso aumenta la recaudación y por lo tanto,",
        "start": 4650.36,
        "end": 4657.599999999999
    },
    {
        "text": " se espera que el déficit fiscal va a 3 por ciento del PIB, ¿cá? Esto había bastante reciente,",
        "start": 4659.2,
        "end": 4667.5599999999995
    },
    {
        "text": " o sea, la modificación a los impuestos recién se comenzó a implementar al principio de este año y",
        "start": 4667.5599999999995,
        "end": 4677.08
    },
    {
        "text": " por lo tanto, el impacto podría llegar incluso a ser menor y a dilatarse bastante, sí.",
        "start": 4677.08,
        "end": 4681.5199999999995
    },
    {
        "text": " Bien, ¿qué ha pasado con los términos intercambios? ¿Se acuerdan lo que eran los términos intercambios?",
        "start": 4696.24,
        "end": 4702.72
    },
    {
        "text": " Termino intercambio, es básicamente el precio de las exportaciones sobre el precio de las",
        "start": 4702.72,
        "end": 4713.92
    },
    {
        "text": " importaciones. ¿Qué ha pasado con eso? Eso ha mejorado, sí, en el 2016 y en lo que ha",
        "start": 4713.92,
        "end": 4723.04
    },
    {
        "text": " el 2017, debido a que en realidad la caída en el precio de las importaciones ha sido mayor a la",
        "start": 4723.04,
        "end": 4732.04
    },
    {
        "text": " caída del precio de las exportaciones, sí, el precio de las exportaciones se reújue un 8 por ciento y",
        "start": 4732.04,
        "end": 4738.92
    },
    {
        "text": " en tanto, que el de las importaciones es un 14 por ciento. Y eso ha mejorado los términos intercambios,",
        "start": 4738.92,
        "end": 4745.0
    },
    {
        "text": " o sea, los precios de los bienes que yo vendo son más baratos, pero los precios de los bienes",
        "start": 4745.0,
        "end": 4753.28
    },
    {
        "text": " que yo compro son incluso más baratos. ¿De acuerdo? Y entonces, me veo favorecido en lo que es el",
        "start": 4753.28,
        "end": 4760.28
    },
    {
        "text": " saldo de la balanza comercial. ¿Qué ha pasado entre 2016 y 2017, así como cambio fuerte y un",
        "start": 4760.28,
        "end": 4773.0
    },
    {
        "text": " poco inesperado, un poco inesperado en la tonica, la variable que más digamos ha sacudido el",
        "start": 4773.0,
        "end": 4782.08
    },
    {
        "text": " ambiente ha sido la inflación, ha sido la inflación. En los primeros años para mal, sí, y en la actualidad",
        "start": 4782.08,
        "end": 4789.84
    },
    {
        "text": " para bien, sí. En los primeros años, o sea, los primeros años del último día, o sea, 2015,",
        "start": 4789.84,
        "end": 4801.4
    },
    {
        "text": " y principio del 2016, la inflación estaba por arriba del 10 por ciento y por lo tanto,",
        "start": 4801.4,
        "end": 4807.879999999999
    },
    {
        "text": " constituía un problema importante que el gobierno, digamos, que miraba atenta la situación,",
        "start": 4807.879999999999,
        "end": 4815.5199999999995
    },
    {
        "text": " sí, hacía medio del 2016, hacía medio del 2016, se da un cambio en el andar de la inflación,",
        "start": 4815.5199999999995,
        "end": 4826.879999999999
    },
    {
        "text": " sí, posibilitado por la política monetaria restrictiva, o sea, digamos, el aumento de la",
        "start": 4826.88,
        "end": 4837.26
    },
    {
        "text": " cantidad de dinero, o sea, la restricción de la cantidad de dinero en el mercado, y posibilitado",
        "start": 4837.26,
        "end": 4841.96
    },
    {
        "text": " también por el mantenimiento de un tipo de cambio relativamente bajo, o sea, no siguió creciendo,",
        "start": 4841.96,
        "end": 4849.64
    },
    {
        "text": " digamos, el tipo de cambio, si estando alrededor de 29 de 30 pesos, y posibilitado también por",
        "start": 4849.64,
        "end": 4861.04
    },
    {
        "text": " un buen aumento de la oferta, digamos, sobre todo de alimentos y ideas que siguió, que continuó en",
        "start": 4861.04,
        "end": 4870.88
    },
    {
        "text": " estos meses del 2017. ¿Qué implicó eso? O sea, hoy en día, el Banco Central aplica lo que se",
        "start": 4870.88,
        "end": 4880.16
    },
    {
        "text": " llama una política de metas de inflación, ¿sí? Una política de metas de inflación, ¿qué es?",
        "start": 4880.16,
        "end": 4888.88
    },
    {
        "text": " digamos, similar a lo de la banda de flotación en el tipo de cambio, pero lo que hace es fijar",
        "start": 4888.88,
        "end": 4896.9400000000005
    },
    {
        "text": " sí, dos bandas de inflación, o sea, lo que busca es que la inflación se meta acá, y aplica",
        "start": 4896.94,
        "end": 4906.259999999999
    },
    {
        "text": " digamos, política para que la inflación entre en este rango, ¿sí? Muchas veces, sí,",
        "start": 4906.259999999999,
        "end": 4915.0199999999995
    },
    {
        "text": " o sea, durante prácticamente todo el periodo del gobierno, o sea, todo el periodo de,",
        "start": 4915.0199999999995,
        "end": 4921.46
    },
    {
        "text": " el gobierno, todo el periodo prácticamente la mayoría del periodo del frente amplio,",
        "start": 4921.46,
        "end": 4925.7
    },
    {
        "text": " o sea, del 2005, en adelante, pero particularmente a partir del 2007, 2008, y en adelante la inflación",
        "start": 4925.7,
        "end": 4936.66
    },
    {
        "text": " se ha mantenido por afuera de ese rango, ¿sí? Y la verdad es que el gobierno, digamos, como no estaba,",
        "start": 4936.66,
        "end": 4945.14
    },
    {
        "text": " digamos, tan, tan, tan preocupado, ¿sí? Porque si bien estaba por fuera de la inflación, bueno,",
        "start": 4945.14,
        "end": 4953.5
    },
    {
        "text": " estaba en un ocho, nueve, en un diez, o sea, no entraba acá, pero tampoco se despegaba, ¿de acuerdo?",
        "start": 4953.5,
        "end": 4961.900000000001
    },
    {
        "text": " ¿Sí? Entonces, en realidad, lo que se comentaba en el mercado es que la banda, ¿sí? La verdad era",
        "start": 4961.900000000001,
        "end": 4969.34
    },
    {
        "text": " la banda de arriba era la del diez, o incluso la del 12, ¿sí? Y no tanto la del siete, que la del siete",
        "start": 4969.34,
        "end": 4976.22
    },
    {
        "text": " era medio ficticia. Eso tenía problemas, ¿sí? Porque cuando pasa esto, ¿sí? Cuando pasa esto,",
        "start": 4976.22,
        "end": 4983.900000000001
    },
    {
        "text": " los agentes comienzan a desconfiar, ¿sí? Y por lo tanto, este sistema pasa a hacer, bueno,",
        "start": 4984.900000000001,
        "end": 4992.02
    },
    {
        "text": " el gobierno no hace esfuerzos por meterlo acá, entonces la banda capaz que va del tres al diez y no",
        "start": 4992.740000000001,
        "end": 4997.9400000000005
    },
    {
        "text": " del tres al siete ¿sí? ¿Qué ha pasado? Lo que ha pasado es que gracias a estos factores externos",
        "start": 4997.9400000000005,
        "end": 5007.1
    },
    {
        "text": " e internos y a la buena condición, digamos, de los alimentos y las bebidas, la inflación se ha",
        "start": 5007.1,
        "end": 5015.740000000001
    },
    {
        "text": " mantenido, ha comenzado su descenso a partir de mediados del 2016 y se meten el rango meta del",
        "start": 5015.74,
        "end": 5024.9
    },
    {
        "text": " siete, se meten el rango meta del siete a partir de marzo de este año y continúa, ¿sí? En 5%",
        "start": 5024.9,
        "end": 5034.3
    },
    {
        "text": " hasta estos días. Acuerdo, o sea, no sólo se mete en febrero toca el techo del siete, febrero",
        "start": 5034.3,
        "end": 5041.78
    },
    {
        "text": " hasta en siete, cero uno, en marzo se mete adentro y luego sí adentro y sigue, digamos, en niveles",
        "start": 5041.78,
        "end": 5050.0599999999995
    },
    {
        "text": " de 5% y medio por ciento. Eso es como el cambio más fuerte que ha habido en los últimos meses.",
        "start": 5050.0599999999995,
        "end": 5061.7
    },
    {
        "text": " ¿No tiene por qué? No, no tiene por qué. O sea, hoy en día, hoy en día el gobierno",
        "start": 5071.78,
        "end": 5083.78
    },
    {
        "text": " aplica un sistema de flotación sucia. Hoy en día el gobierno aplica un sistema de flotación",
        "start": 5083.78,
        "end": 5090.7
    },
    {
        "text": " sucia, que la flotación sucia básicamente consiste en que el dólar puede flotar, se",
        "start": 5090.7,
        "end": 5097.98
    },
    {
        "text": " puede variar, pero no tanto, ¿sí? Pero no tanto. ¿Qué quiere decir? Pero no tanto, quiere",
        "start": 5097.98,
        "end": 5103.9
    },
    {
        "text": " decir que el Banco Central está atento e interviene cuando las variaciones son muy bruscas.",
        "start": 5103.9,
        "end": 5110.74
    },
    {
        "text": " Por ejemplo, hoy el dólar está a 30, si el lunes hay un acontecimiento, no sé, X y hay una",
        "start": 5110.74,
        "end": 5118.139999999999
    },
    {
        "text": " presión a que el dólar sua 40, el Banco Central va a intervenir y salir a vender dólares.",
        "start": 5118.139999999999,
        "end": 5122.9
    },
    {
        "text": " Y si hay una presión y que el dólar bajé a 20, el Banco Central va a intervenir y va a salir",
        "start": 5122.9,
        "end": 5129.7
    },
    {
        "text": " a comprarlos. ¿De acuerdo? Por eso es el llama tipo flotación sucia, o sea, el Banco Central",
        "start": 5129.7,
        "end": 5136.98
    },
    {
        "text": " interviene para evitar esos movimientos bruscas. Ahora, no hay un compromiso, no hay un compromiso",
        "start": 5136.98,
        "end": 5143.339999999999
    },
    {
        "text": " a diferencia de la banda de flotación, no hay un compromiso del VCU de intervenir si el dólar",
        "start": 5143.339999999999,
        "end": 5149.099999999999
    },
    {
        "text": " se va a ir arriba de 31 o abajo de 28. O sea, no hay un compromiso eso. Por lo tanto,",
        "start": 5149.1,
        "end": 5155.820000000001
    },
    {
        "text": " teoricamente vos decís, bueno, en realidad, si el Banco Central no interviene el día mañana,",
        "start": 5155.820000000001,
        "end": 5162.900000000001
    },
    {
        "text": " si el dólar podría estar a 25 o a 35. En realidad, ¿sabes qué eso no va a pasar? Porque el Banco",
        "start": 5162.900000000001,
        "end": 5170.1
    },
    {
        "text": " Central va a intervenir. Pero lo que hay, sí, o mejor dicho, lo que no hay, es un compromiso de",
        "start": 5170.1,
        "end": 5175.9800000000005
    },
    {
        "text": " establecer, bueno, el dólar va a estar entre 31 y 29. Eso no hay. ¿Qué pasa con este",
        "start": 5175.98,
        "end": 5185.299999999999
    },
    {
        "text": " método de flotación? Que en realidad el Banco Central compromete sus reservas sí y solo",
        "start": 5185.299999999999,
        "end": 5192.419999999999
    },
    {
        "text": " sí hay movimientos bruscas. ¿De acuerdo? O sea, si por ejemplo pasa un movimiento X que presiona",
        "start": 5192.419999999999,
        "end": 5199.7
    },
    {
        "text": " al sal tipo de cambio, ahí el Banco Central sale a la banda de reservas. ¿De acuerdo? Pero si",
        "start": 5199.7,
        "end": 5204.459999999999
    },
    {
        "text": " no se produce ese movimiento X y la cosa está tranquila, el Banco Central no compromete",
        "start": 5204.46,
        "end": 5208.9800000000005
    },
    {
        "text": " sus reservas porque permite que el tipo de cambio flot, si no lo va a hacer bruscamente.",
        "start": 5208.9800000000005,
        "end": 5214.46
    },
    {
        "text": " O sea, el Banco Central permite que el dólar mañana, hoy está 30, mañana puede estar a",
        "start": 5214.46,
        "end": 5220.1
    },
    {
        "text": " 30, 50, puede estar a 31, pasado y entonces ahí no compromete digamos sus reservas. ¿Qué",
        "start": 5220.1,
        "end": 5235.320000000001
    },
    {
        "text": " ha pasado en materia de empleos y salarios o sea en el mercado laboral? En realidad un",
        "start": 5235.320000000001,
        "end": 5242.660000000001
    },
    {
        "text": " poco lo que les sale. Vale. ¿Puedes empezar a entrar tranquilamente en el",
        "start": 5242.66,
        "end": 5250.72
    },
    {
        "text": " Banco Central? Sí. ¿De acuerdo? O sea, puede pasar. Siempre y cuando no sea movimientos bruscas.",
        "start": 5250.72,
        "end": 5258.42
    },
    {
        "text": " O sea, si yo lo que te digo es, hoy ponele. No sé cuánto está la cotización de hoy, pero",
        "start": 5258.42,
        "end": 5265.98
    },
    {
        "text": " ponele 30. Si, si si me decís, si el dólar va a crecer todos los días, diecentésimos,",
        "start": 5265.98,
        "end": 5274.62
    },
    {
        "text": " hasta llegar a 34 en, no sé, julio del año que viene, ahí no pasa nada. ¿Por qué? Porque",
        "start": 5274.62,
        "end": 5282.799999999999
    },
    {
        "text": " todos los días se dio un movimiento relativamente lento. ¿Sí? Y entonces el Banco Central no intervino",
        "start": 5282.799999999999,
        "end": 5288.5
    },
    {
        "text": " en el mercado porque ese movimiento no fue brusco. ¿De acuerdo? Entonces es diferente a que todos",
        "start": 5288.5,
        "end": 5294.54
    },
    {
        "text": " los días suba un diecentésimo a que pase de 30 a 34 en un día. Esplico, si pasa de 30 a 34",
        "start": 5294.54,
        "end": 5301.26
    },
    {
        "text": " en un día va a intervenir. Ahora si sube 30, 30 a 0 5, 30 a 1, 30 a 15, 30 a 20 no va a",
        "start": 5301.26,
        "end": 5310.24
    },
    {
        "text": " intervenir. ¿Está? En eso consiste la flotación sucia. O sea, interviene sólo y cuando los",
        "start": 5310.24,
        "end": 5317.74
    },
    {
        "text": " movimientos sean bruscos. Bien, pero eso digamos en principio, o sea, si bien tiene relación",
        "start": 5317.74,
        "end": 5329.86
    },
    {
        "text": " con cómo se maneja el producto y demás, no hay una vinculación de ambos directos entre",
        "start": 5329.86,
        "end": 5340.099999999999
    },
    {
        "text": " eso. ¿Qué ha pasado en empleo y salario? Lo que ha pasado es que si bien el producto mantiene",
        "start": 5340.099999999999,
        "end": 5347.38
    },
    {
        "text": " su tendencia creciente, aunque con menor velocidad que en los años anteriores, el empleo,",
        "start": 5347.38,
        "end": 5352.9400000000005
    },
    {
        "text": " si, el empleo parece estar bastante quietito, más bien, si, diminuyendo y los salarios han",
        "start": 5352.9400000000005,
        "end": 5362.46
    },
    {
        "text": " crecido pero un ritmo menor de lo que lo venían haciendo. ¿Sí? Entonces acá yo no les puse,",
        "start": 5362.46,
        "end": 5370.3
    },
    {
        "text": " pero si comparamos de diciembre del 2016 a versus diciembre del 2015, los salarios crecen",
        "start": 5370.3,
        "end": 5378.14
    },
    {
        "text": " un 3,3 por ciento. ¡Uf! No tengo batería.",
        "start": 5378.14,
        "end": 5387.22
    },
    {
        "text": " Ya, vamos rápido. Los salarios crecen un 3,3 por ciento. ¿Sí?",
        "start": 5387.22,
        "end": 5399.42
    },
    {
        "text": " Comparamos diciembre de versus diciembre. ¿Sí? Comparamos el promedio 2016 y el promedio",
        "start": 5399.42,
        "end": 5403.66
    },
    {
        "text": " 2015, los salarios crecen un 1,5. ¿Sí? ¿Por qué crecen? Sí, 3,3, sí. Comparamos",
        "start": 5403.66,
        "end": 5411.54
    },
    {
        "text": " diciembre a versus diciembre crecen 1,5 y comparamos promedios, que se llegamos lo más",
        "start": 5411.54,
        "end": 5416.46
    },
    {
        "text": " sensato. Bueno, porque justamente la inflación comienza a disminuir, comienza su proceso descendente",
        "start": 5416.46,
        "end": 5423.86
    },
    {
        "text": " a partir de mediados 2016. Y sobre todo es el descenso de la inflación lo que permite",
        "start": 5423.86,
        "end": 5431.18
    },
    {
        "text": " la sua del salario real. O sea, es la caída del IPC lo que permite el crecimiento del",
        "start": 5431.18,
        "end": 5437.22
    },
    {
        "text": " salario real. ¿Ya acuerdo? O sea, el EMS se crece, pero crece menos que la caída del IPC.",
        "start": 5437.22,
        "end": 5444.14
    },
    {
        "text": " ¿Ya acuerdo? O sea, el salario real aumenta por las dos días, pero sobre todo gracias a la",
        "start": 5444.14,
        "end": 5448.7
    },
    {
        "text": " caída del IPC. Pobreza. La pobreza no era el asalté, la pobreza en personas. ¿Qué",
        "start": 5448.7,
        "end": 5460.740000000001
    },
    {
        "text": " ha pasado con los indicadores sociales? También se han estancado a partir de 2014, ¿Sí?",
        "start": 5460.74,
        "end": 5469.98
    },
    {
        "text": " En 2016, las personas pobres eran el 9,4% y en el 2015 eran el 9,7%. ¿Sí? Según",
        "start": 5469.98,
        "end": 5480.66
    },
    {
        "text": " el informe de la institución de la ciudad de estadística, esta diferencia no es estadísticamente",
        "start": 5480.66,
        "end": 5484.98
    },
    {
        "text": " significativa. ¿Qué quiere decir eso? Que 9,7 es igual a 9,4%. ¿Sí? Básicamente, ¿Sí?",
        "start": 5484.98,
        "end": 5492.74
    },
    {
        "text": " Hablando bien, en realidad es que los dos están en el intervalo de confianza y no se puede",
        "start": 5492.74,
        "end": 5498.299999999999
    },
    {
        "text": " decir que sean estadísticamente diferentes. ¿Sí? ¿Qué quiere decir eso? ¿Qué sigue",
        "start": 5498.299999999999,
        "end": 5503.54
    },
    {
        "text": " viendo? Sí, 300 mil personas pobres, más o menos en Uruguay. ¿Cómo son esas personas?",
        "start": 5503.54,
        "end": 5511.099999999999
    },
    {
        "text": " Sí, las mayorías son niños. O sea, la pobreza es un fenómeno infantil. ¿Sí?",
        "start": 5511.1,
        "end": 5517.34
    },
    {
        "text": " Un fenómeno infantilizado. ¿Sí? Uno de casi con niños, menos de seis, sí es pobre.",
        "start": 5517.34,
        "end": 5524.38
    },
    {
        "text": " Uno de casi. ¿Sí? Uno de casi. Y para los mayores de 65, esa apenas es el 2%. ¿Sí?",
        "start": 5524.38,
        "end": 5537.860000000001
    },
    {
        "text": " ¿Quién preguntó? Pobre es, digamos, estamos hablando de pobreza en la línea...",
        "start": 5537.86,
        "end": 5552.42
    },
    {
        "text": " ¿Sí? Es una línea de pobreza fijada a la canasta básica de alimentos. ¿Sí? Es una línea",
        "start": 5552.42,
        "end": 5568.02
    },
    {
        "text": " de ingresos. Estaba fijada en base una canasta básica si estás por acaso pobres, si estás",
        "start": 5568.02,
        "end": 5573.5
    },
    {
        "text": " por acaso pobres, si estás por acallano. Y después hay otro indicador que mide, digamos,",
        "start": 5573.5,
        "end": 5578.06
    },
    {
        "text": " la brecha entre esto. Acá lo que yo digo es que esta línea, o sea, debajo de esta línea",
        "start": 5578.06,
        "end": 5584.42
    },
    {
        "text": " y 300 mil personas. ¿Sí? ¿Cómo es la pobreza? O sea, regionalmente, ¿qué detalle tiene?",
        "start": 5584.42,
        "end": 5599.700000000001
    },
    {
        "text": " Bueno, la pobreza está más fuerte en Montevideo, ¿Sí? Y en los países del norte y",
        "start": 5600.34,
        "end": 5608.38
    },
    {
        "text": " limítrofe con Brasil. ¿Sí? Y esto es Montevideo. Esto también me da un poco de calofrío. ¿Sí?",
        "start": 5608.38,
        "end": 5620.54
    },
    {
        "text": " ¿Cómo es la distribución de los ingresos? La distribución de los ingresos, sí, también se mantiene",
        "start": 5629.3,
        "end": 5637.18
    },
    {
        "text": " estancada en los últimos años. O sea, el índice de Gini el 2016 fue 0383 y el de 2015 era de 0386 y el",
        "start": 5637.18,
        "end": 5647.58
    },
    {
        "text": " de 2002 era de 038. O sea, que hace varios años, digamos, que estamos en el entorno del 038. ¿Sí?",
        "start": 5647.58,
        "end": 5654.06
    },
    {
        "text": " O sea, la desigualdad que había comenzado a caer en el 2007, detuvo, sí, su caída ya hace 5",
        "start": 5654.06,
        "end": 5662.740000000001
    },
    {
        "text": " años y parecería, digamos, que se va a mantener en la misma técnica.",
        "start": 5662.74,
        "end": 5667.0199999999995
    },
    {
        "text": " Digamos, si bien crece la participación de los primeros quintiles en la torta y de crece la del",
        "start": 5670.219999999999,
        "end": 5680.179999999999
    },
    {
        "text": " cuarto y el quinto quintil, Uruguay continúa haciendo un país notoriamente desigual. ¿Sí?",
        "start": 5680.179999999999,
        "end": 5688.0599999999995
    },
    {
        "text": " Uruguay continúa haciendo un país notoriamente desigual. O sea, somos los que reparten mejor la",
        "start": 5688.06,
        "end": 5694.68
    },
    {
        "text": " torta entre América Latina, siendo América Latina el continente que la reparte peor. ¿Sí? Lo cual es un",
        "start": 5694.68,
        "end": 5701.26
    },
    {
        "text": " consuelo bastante, ¿no? Es como, no sé, clasificar al mundial cuando la concaca. ¿Sí?",
        "start": 5701.26,
        "end": 5708.780000000001
    },
    {
        "text": " Fíjense esto, el quinto quintil, o sea, el 20% de la población más rica, sí, el 20% de la",
        "start": 5708.78,
        "end": 5721.179999999999
    },
    {
        "text": " población más rica se lleva el 42% de la torta. ¿Sí? O sea, el 20% de la población más rica se",
        "start": 5721.179999999999,
        "end": 5730.74
    },
    {
        "text": " lleva el 42% de la torta. Y el primero, o sea, el 20% de la población más pobre, se lleva el 7% de la torta.",
        "start": 5730.74,
        "end": 5741.139999999999
    },
    {
        "text": " Complicado, esta es la desigualdad en Uruguay, Montevideo, los países del Sur y los perdón los",
        "start": 5741.14,
        "end": 5757.900000000001
    },
    {
        "text": " departamentos del Sur y hay uno de departamentos del Norte como Artigas y Rivera, son los más desiguales.",
        "start": 5757.900000000001,
        "end": 5766.9400000000005
    },
    {
        "text": " Y fíjense esto, no se va a ver nada, pero acá lo que les muestro básicamente la evolución de la",
        "start": 5766.94,
        "end": 5778.299999999999
    },
    {
        "text": " participación de los quintiles en la torta y lo que le digo es, bueno, por ejemplo, en el 2000,",
        "start": 5778.299999999999,
        "end": 5785.82
    },
    {
        "text": " en el 2001, quintiles se boza a arrasa la población y la dividís en 5, según su nivel de ingreso.",
        "start": 5785.82,
        "end": 5794.9
    },
    {
        "text": " Entonces, el quinto quintile es el 20% de la población más rica, el primero es el 20% de la población más pobre.",
        "start": 5794.9,
        "end": 5801.7
    },
    {
        "text": " Entonces fíjense acá el quinto, o sea, el 20% de la población más rica en el 2000 se lleva el 50% de la torta.",
        "start": 5805.219999999999,
        "end": 5814.42
    },
    {
        "text": " O sea, la mitad de la torta se le lleva el 20% más rica y el resto de la mitad, todo el resto.",
        "start": 5814.42,
        "end": 5821.9
    },
    {
        "text": " O sea, el 80% del resto de la población.",
        "start": 5822.7,
        "end": 5825.94
    },
    {
        "text": " En el 86, en el 86 se llega al 47.",
        "start": 5829.099999999999,
        "end": 5834.46
    },
    {
        "text": " En el 86, el 20% más rico se llega al 47 y en el 2016 se llega al 42.",
        "start": 5836.219999999999,
        "end": 5843.0599999999995
    },
    {
        "text": " O sea, 30 años después, la participación del quinto quintil apenas ha bajado 5 puntos.",
        "start": 5843.0599999999995,
        "end": 5849.259999999999
    },
    {
        "text": " Sí, 30 años después, prácticamente el quinto quintil sigue llevando la mitad de la torta.",
        "start": 5850.22,
        "end": 5856.860000000001
    },
    {
        "text": " Cuatro veces me diga.",
        "start": 5856.860000000001,
        "end": 5858.34
    },
    {
        "text": " En que en millones de...",
        "start": 5858.34,
        "end": 5861.26
    },
    {
        "text": " Para que te lo busco.",
        "start": 5863.26,
        "end": 5864.860000000001
    },
    {
        "text": " Están la otra.",
        "start": 5867.860000000001,
        "end": 5869.26
    },
    {
        "text": " Miles de pesos constantes.",
        "start": 5871.26,
        "end": 5875.26
    },
    {
        "text": " Y acá el compañero hace... a ver, mesas de apuestas.",
        "start": 5880.26,
        "end": 5885.26
    },
    {
        "text": " ¿Qué país del mundo reparte mejor?",
        "start": 5885.26,
        "end": 5888.26
    },
    {
        "text": " Y andan ahí, ¿sí? ¿Quién es eso? ¿Cómo se le llama esos países?",
        "start": 5892.26,
        "end": 5896.26
    },
    {
        "text": " ¿Los?",
        "start": 5898.26,
        "end": 5899.26
    },
    {
        "text": " No.",
        "start": 5899.26,
        "end": 5900.26
    },
    {
        "text": " No.",
        "start": 5900.26,
        "end": 5901.26
    },
    {
        "text": " No, no, no.",
        "start": 5901.26,
        "end": 5902.26
    },
    {
        "text": " No.",
        "start": 5902.26,
        "end": 5903.26
    },
    {
        "text": " ¿Quién es eso? Dira marca que inteira. ¿Cómo se le llama esa comunidad ahí?",
        "start": 5904.26,
        "end": 5908.26
    },
    {
        "text": " No.",
        "start": 5909.26,
        "end": 5910.26
    },
    {
        "text": " Nórdicos.",
        "start": 5913.26,
        "end": 5915.26
    },
    {
        "text": " ¿Tá?",
        "start": 5915.26,
        "end": 5916.26
    },
    {
        "text": " Los nórdicos.",
        "start": 5916.26,
        "end": 5918.26
    },
    {
        "text": " El PIBE está... esto como se llama...",
        "start": 5918.26,
        "end": 5922.26
    },
    {
        "text": " te de cientos millones, ese es.",
        "start": 5922.26,
        "end": 5925.26
    },
    {
        "text": " De pesos constantes del 2005.",
        "start": 5926.26,
        "end": 5929.26
    },
    {
        "text": " Los países nórdicos digamos son los que tienen una mejor distribución del ingreso.",
        "start": 5930.26,
        "end": 5935.26
    },
    {
        "text": " Acá con el tema de los desarrollados pasa algo bastante curioso que es que el índice de Gini de Uruguay, ¿sí?",
        "start": 5938.26,
        "end": 5951.26
    },
    {
        "text": " El índice de Gini Uruguay es más alto, es un poquito más alto que el de Estados Unidos.",
        "start": 5952.26,
        "end": 5962.26
    },
    {
        "text": " ¿sí?",
        "start": 5962.26,
        "end": 5964.26
    },
    {
        "text": " Y el de Estados Unidos es el peor de los desarrollados.",
        "start": 5964.26,
        "end": 5968.26
    },
    {
        "text": " O sea, dentro de los países desarrollados, ¿sí?",
        "start": 5968.26,
        "end": 5973.26
    },
    {
        "text": " El que peor reparte es Estados Unidos.",
        "start": 5973.26,
        "end": 5977.26
    },
    {
        "text": " Y aún así reparte mejor que nosotros. ¿De acuerdo?",
        "start": 5977.26,
        "end": 5982.26
    },
    {
        "text": " ¿Sí?",
        "start": 5982.26,
        "end": 5984.26
    },
    {
        "text": " Eso porque llamó...",
        "start": 5984.26,
        "end": 5987.26
    },
    {
        "text": " ¿Tá? ¿Cómo qué? No sé.",
        "start": 5987.26,
        "end": 5991.26
    },
    {
        "text": " Somos desiguales ¿Tá?",
        "start": 5991.26,
        "end": 5994.26
    },
    {
        "text": " Y fíjense que el primero, el primer quintilo, sea la masa de gente en el 20% más cobre,",
        "start": 5994.26,
        "end": 6001.26
    },
    {
        "text": " se llegaba apenas el 5 en el 86 y hoy se lleva el 7.",
        "start": 6001.26,
        "end": 6005.26
    },
    {
        "text": " O sea, en 30 años apenas aumenta su participación en la torta 2.4%.",
        "start": 6005.26,
        "end": 6011.26
    },
    {
        "text": " ¿Sí? ¿Qué quiere decir eso?",
        "start": 6011.26,
        "end": 6014.26
    },
    {
        "text": " Básicamente que en 30 años, la distribución del ingreso se ha movido relativamente poco.",
        "start": 6014.26,
        "end": 6021.26
    },
    {
        "text": " Y se ha movido principalmente entre el 2007 y el 2012-2013 y se ha estancado,",
        "start": 6021.26,
        "end": 6030.26
    },
    {
        "text": " se ha relativamente estancado en los últimos años.",
        "start": 6030.26,
        "end": 6033.26
    },
    {
        "text": " Sí, o sea, cuando parecía, digamos, que la torta comenzaba a repartirse un poquito mejor",
        "start": 6033.26,
        "end": 6039.26
    },
    {
        "text": " de lo que se había repartido 30 años atrás, la desaceleración económica",
        "start": 6039.26,
        "end": 6044.26
    },
    {
        "text": " en el 2015 detiene, digamos, 2015-2014 detiene ese reparto equitativo.",
        "start": 6044.26,
        "end": 6053.26
    },
    {
        "text": " ¿Sí?",
        "start": 6053.26,
        "end": 6055.26
    },
    {
        "text": " ¿Econ prácticamente la violencia en el de la reformación de coletaria?",
        "start": 6055.26,
        "end": 6059.26
    },
    {
        "text": " Eso es una pregunta más filosófica que económica.",
        "start": 6059.26,
        "end": 6062.26
    },
    {
        "text": " Sí, a ver, en realidad está, digamos, ya hay casi un consenso,",
        "start": 6068.26,
        "end": 6079.26
    },
    {
        "text": " prácticamente hay un consenso de que hace bien repartir para crecer.",
        "start": 6079.26,
        "end": 6086.26
    },
    {
        "text": " O sea, hace mal crecer sin repartir y hace bien si repartipa a crecer.",
        "start": 6086.26,
        "end": 6094.26
    },
    {
        "text": " Llamo, hay como económicamente un consenso en ese sentido.",
        "start": 6094.26,
        "end": 6098.26
    },
    {
        "text": " Sí?",
        "start": 6098.26,
        "end": 6100.26
    },
    {
        "text": " Entonces, digamos, porque niveles altos de desigualdad atentan contra el crecimiento.",
        "start": 6100.26,
        "end": 6107.26
    },
    {
        "text": " Sí?",
        "start": 6107.26,
        "end": 6110.26
    },
    {
        "text": " Sí, niveles muy bajos de desigualdad.",
        "start": 6110.26,
        "end": 6113.26
    },
    {
        "text": " O sea, la pregunta sería, ¿es óptimo un índice de Xíni de Cero?",
        "start": 6113.26,
        "end": 6121.26
    },
    {
        "text": " Y bueno, esa es una cuestión más bien, digamos, filosófica,",
        "start": 6121.26,
        "end": 6127.26
    },
    {
        "text": " porque aparte, acá lo que estamos viendo es reparto ingresos,",
        "start": 6127.26,
        "end": 6133.26
    },
    {
        "text": " o sea, desigualdad ingresos.",
        "start": 6133.26,
        "end": 6136.26
    },
    {
        "text": " Sí?",
        "start": 6136.26,
        "end": 6138.26
    },
    {
        "text": " Y capaz que alguno que dice, bueno, en realidad, la desigualdad",
        "start": 6138.26,
        "end": 6140.26
    },
    {
        "text": " y que me diga las oportunidades, sí, y bueno, si yo me esfuerzo más que el otro,",
        "start": 6140.26,
        "end": 6145.26
    },
    {
        "text": " capaz que justo que yo van más que el otro.",
        "start": 6145.26,
        "end": 6149.26
    },
    {
        "text": " Y bueno, estas son cuestiones más bien filosóficas,",
        "start": 6149.26,
        "end": 6153.26
    },
    {
        "text": " que pueden tener, digamos, su justificación económica,",
        "start": 6153.26,
        "end": 6157.26
    },
    {
        "text": " pero lo que sí parecería es que el hecho de ser un país desigual",
        "start": 6157.26,
        "end": 6164.26
    },
    {
        "text": " atenta contra el crecimiento.",
        "start": 6164.26,
        "end": 6167.26
    },
    {
        "text": " O sea, por eso, digamos, pongo el ejemplo de Estados Unidos.",
        "start": 6167.26,
        "end": 6175.26
    },
    {
        "text": " O sea, Estados Unidos es el país que mayor PIB per capita tiene,",
        "start": 6175.26,
        "end": 6180.26
    },
    {
        "text": " que dentro de los desarrollados está bien es el que reparte peor,",
        "start": 6180.26,
        "end": 6184.26
    },
    {
        "text": " pero incluso reparte mejor que el mejor de América Latina.",
        "start": 6184.26,
        "end": 6189.26
    },
    {
        "text": " Me explicó que somos nosotros.",
        "start": 6189.26,
        "end": 6192.26
    },
    {
        "text": " ¿Cuáles son las principales líneas de política económica?",
        "start": 6193.26,
        "end": 6199.26
    },
    {
        "text": " Si vos me preguntas a mí, sí, la desigualdad es mala.",
        "start": 6199.26,
        "end": 6203.26
    },
    {
        "text": " Si querías esa respuesta.",
        "start": 6203.26,
        "end": 6206.26
    },
    {
        "text": " ¿Cuáles son los principales líneas de política económica",
        "start": 6206.26,
        "end": 6212.26
    },
    {
        "text": " de acá al final del periodo gobierno?",
        "start": 6212.26,
        "end": 6215.26
    },
    {
        "text": " En materia fiscal, el déficit fiscal está comprometido,",
        "start": 6215.26,
        "end": 6219.26
    },
    {
        "text": " o sea, es, digamos, complicado que baje,",
        "start": 6219.26,
        "end": 6223.26
    },
    {
        "text": " aunque se va a esperar, digamos, el resultado de esta política",
        "start": 6223.26,
        "end": 6227.26
    },
    {
        "text": " de sua impuestos para ver cómo impacta y si logra reducir esto.",
        "start": 6227.26,
        "end": 6233.26
    },
    {
        "text": " En materia económica, sí, la política monetaria sigue siendo",
        "start": 6233.26,
        "end": 6238.26
    },
    {
        "text": " de el estilo contractivo, o sea, de no aumentar la cantidad de dinero",
        "start": 6238.26,
        "end": 6242.26
    },
    {
        "text": " que hay en el mercado, justamente para controlar la inflación.",
        "start": 6242.26,
        "end": 6246.26
    },
    {
        "text": " En materia cambiaria, seguramente, o sea,",
        "start": 6250.26,
        "end": 6256.26
    },
    {
        "text": " lo ha aplicado el gobierno desde que asumió hasta ahora",
        "start": 6256.26,
        "end": 6262.26
    },
    {
        "text": " y probablemente no lo vaya a cambiar, sí, manteníéndose",
        "start": 6262.26,
        "end": 6267.26
    },
    {
        "text": " la flotación sucia y la intervención del Banco Central",
        "start": 6267.26,
        "end": 6271.26
    },
    {
        "text": " en el mercado de divisas para evitar, digamos,",
        "start": 6271.26,
        "end": 6275.26
    },
    {
        "text": " los movimientos bruscos del tipo de cambio.",
        "start": 6275.26,
        "end": 6280.26
    },
    {
        "text": " Y después hay, digamos, tres ejes que son,",
        "start": 6281.26,
        "end": 6287.26
    },
    {
        "text": " la ley de inclusión financiera, como fuerte caballito de batalla,",
        "start": 6287.26,
        "end": 6294.26
    },
    {
        "text": " la negociación colectiva, digamos, que va a seguir buscando",
        "start": 6294.26,
        "end": 6300.26
    },
    {
        "text": " el mantenimiento de crecimiento de los salarios reales",
        "start": 6300.26,
        "end": 6303.26
    },
    {
        "text": " y, sobre todo, también la negociación de otras condiciones salariales,",
        "start": 6303.26,
        "end": 6308.26
    },
    {
        "text": " o sea, el hecho de que la negociación colectiva no solamente,",
        "start": 6308.26,
        "end": 6314.26
    },
    {
        "text": " no solamente se negocie el salario, el poder de compra de los trabajadores,",
        "start": 6314.26,
        "end": 6319.26
    },
    {
        "text": " sino que también se negocie otras cuestiones vinculadas al trabajo,",
        "start": 6319.26,
        "end": 6323.26
    },
    {
        "text": " como, por ejemplo, la nocturmiada, la licencia parental,",
        "start": 6323.26,
        "end": 6328.26
    },
    {
        "text": " el reconocimiento de brazo extra, así demás,",
        "start": 6329.26,
        "end": 6332.26
    },
    {
        "text": " y el caballito de sistema de cuidados, ¿sí?",
        "start": 6336.26,
        "end": 6339.26
    },
    {
        "text": " El caballito de sistema de cuidados que,",
        "start": 6339.26,
        "end": 6342.26
    },
    {
        "text": " en realidad, lo que busca es, o sea, tiene un fuerte,",
        "start": 6343.26,
        "end": 6347.26
    },
    {
        "text": " también una política de fuerte componente equitativo, ¿sí?",
        "start": 6347.26,
        "end": 6352.26
    },
    {
        "text": " Por eso, o sea, el gobierno hace énfasis en que no sólo la equidad",
        "start": 6352.26,
        "end": 6357.26
    },
    {
        "text": " se mide acá en materia ingreso, sino también en las posibilidades",
        "start": 6357.26,
        "end": 6361.26
    },
    {
        "text": " de acceso, por ejemplo, al cuidado de las personas. ¿Por qué?",
        "start": 6361.26,
        "end": 6366.26
    },
    {
        "text": " ¿Por qué pasa ahora el tema de cuidados?",
        "start": 6366.26,
        "end": 6372.26
    },
    {
        "text": " ¿Por qué esta política, digamos, tiene un fuerte componente de equidad?",
        "start": 6377.26,
        "end": 6381.26
    },
    {
        "text": " ¿Quién puede mandar a las abuelas a las casas de salud?",
        "start": 6387.26,
        "end": 6391.26
    },
    {
        "text": " ¿Los pobre? No, porque la casa de salud sabe muy caro.",
        "start": 6391.26,
        "end": 6396.26
    },
    {
        "text": " Entonces, lo que pasa es que, en realidad, ¿sí?",
        "start": 6396.26,
        "end": 6401.26
    },
    {
        "text": " ¿A qué entiene acceso al sistema de cuidados privados?",
        "start": 6401.26,
        "end": 6405.26
    },
    {
        "text": " ¿Sí? Son las personas de altos ingresos.",
        "start": 6405.26,
        "end": 6409.26
    },
    {
        "text": " Las personas de altos ingresos son los que tienen acceso a sistemas de cuidados privados.",
        "start": 6409.26,
        "end": 6415.26
    },
    {
        "text": " Por lo tanto, que es lo que busca el Estado con esta política,",
        "start": 6416.26,
        "end": 6419.26
    },
    {
        "text": " un fuerte componente de equidad, digamos, posibilitándole acceso a personas de menores ingresos,",
        "start": 6419.26,
        "end": 6426.26
    },
    {
        "text": " también hay cuidado de, ya sea, de personas a las adultas mayores dependientes,",
        "start": 6426.26,
        "end": 6431.26
    },
    {
        "text": " de niños y de personas con discapacidad. ¿Sí?",
        "start": 6431.26,
        "end": 6438.26
    },
    {
        "text": " ¿Qué es lo que busca esa política aparte de",
        "start": 6438.26,
        "end": 6444.26
    },
    {
        "text": " favorecer la equidad, tiene un componente también de mercado laboral?",
        "start": 6445.26,
        "end": 6451.26
    },
    {
        "text": " ¿Sí? Tiene un componente también de mercado laboral. ¿Qué cuál es?",
        "start": 6451.26,
        "end": 6458.26
    },
    {
        "text": " ¿Muchas?",
        "start": 6461.26,
        "end": 6465.26
    },
    {
        "text": " Sí. ¿Y entonces, en?",
        "start": 6465.26,
        "end": 6472.26
    },
    {
        "text": " ¿A qué ha sido el componente?",
        "start": 6473.26,
        "end": 6475.26
    },
    {
        "text": " Ahí está, ¿sí? Exactamente. Las dos cosas, sí, hay.",
        "start": 6475.26,
        "end": 6480.26
    },
    {
        "text": " No solo hay, sino que cada vez va a haber más.",
        "start": 6482.26,
        "end": 6486.26
    },
    {
        "text": " O sea, no solo estamos llenos de viejo, sino que cada vez va a ser más viejo.",
        "start": 6486.26,
        "end": 6490.26
    },
    {
        "text": " Y por lo tanto, alguien tiene que hacerse cargo de eso.",
        "start": 6492.26,
        "end": 6495.26
    },
    {
        "text": " Y bueno, ¿sí? Y bueno, ¿sí?",
        "start": 6495.26,
        "end": 6497.26
    },
    {
        "text": " Lo tenemos que asumir como Estado, como social lo tenemos que asumir.",
        "start": 6497.26,
        "end": 6501.26
    },
    {
        "text": " Por lo tanto, ¿por qué esta política tiene un fuerte componente de mercado laboral?",
        "start": 6503.26,
        "end": 6507.26
    },
    {
        "text": " ¿Por qué se supone, digamos, que esa política va a generar empleo?",
        "start": 6507.26,
        "end": 6512.26
    },
    {
        "text": " ¿Sí? Porque hay muchas personas para ser cuidadas y también, además,",
        "start": 6512.26,
        "end": 6519.26
    },
    {
        "text": " hay muchas personas dispuestas a cuidar, ¿sí?",
        "start": 6519.26,
        "end": 6523.26
    },
    {
        "text": " Y sobre todo, tiene un fuerte componente de mercado laboral",
        "start": 6523.26,
        "end": 6527.26
    },
    {
        "text": " en el sentido de que propicia el aumento de quién, o la incorporación",
        "start": 6528.26,
        "end": 6535.26
    },
    {
        "text": " al mercado de trabajo de quién, sobre todo de las mujeres y principalmente",
        "start": 6535.26,
        "end": 6543.26
    },
    {
        "text": " de las mujeres con menor nivel educativo, que son las que mayores",
        "start": 6543.26,
        "end": 6548.26
    },
    {
        "text": " dificultades se encuentran para acceder a un trabajo.",
        "start": 6548.26,
        "end": 6551.26
    },
    {
        "text": " Por lo tanto, se espera que con esta política no solo aumente la equidad",
        "start": 6552.26,
        "end": 6557.26
    },
    {
        "text": " en el acceso al sistema de cuidados, sino que además se incremente",
        "start": 6557.26,
        "end": 6563.26
    },
    {
        "text": " el empleo de las mujeres que son generalmente las que se destina a la equidad",
        "start": 6563.26,
        "end": 6570.26
    },
    {
        "text": " y principalmente de las mujeres con mayor dificultades al acceso al mercado laboral.",
        "start": 6570.26,
        "end": 6577.26
    },
    {
        "text": " Por lo tanto, si se logra eso, habría como una doble vía de efectos sobre la equidad.",
        "start": 6578.26,
        "end": 6588.26
    },
    {
        "text": " ¿Sí? ¿Qué es su resultado? Seguramente no se vean, y media-tamente,",
        "start": 6588.26,
        "end": 6594.26
    },
    {
        "text": " sino que son resultados que tardan en procesarse. ¿Acuardo?",
        "start": 6594.26,
        "end": 6600.26
    },
    {
        "text": " Esa apunta del crecimiento de la tasa de actividad de las mujeres,",
        "start": 6600.26,
        "end": 6606.26
    },
    {
        "text": " de las mujeres, de las mujeres, de las mujeres, de las mujeres y de las mujeres.",
        "start": 6606.26,
        "end": 6612.26
    },
    {
        "text": " Si el gobierno logra generar trabajo a través de esa política,",
        "start": 6612.26,
        "end": 6619.26
    },
    {
        "text": " si se incrementa el valor en esa tarea de cuidados,",
        "start": 6619.26,
        "end": 6624.26
    },
    {
        "text": " se puede estar incrementando el producto por medio del aumento del gasto",
        "start": 6624.26,
        "end": 6629.26
    },
    {
        "text": " a través del incremento de la tasa de empleo de las mujeres.",
        "start": 6629.26,
        "end": 6633.26
    },
    {
        "text": " Si llegara a pasar eso, se lograría un incremento del producto",
        "start": 6633.26,
        "end": 6638.26
    },
    {
        "text": " que provocaría un incremento del empleo.",
        "start": 6638.26,
        "end": 6640.26
    }
]