[
    {
        "text": " Bueno, este tercer módulo del curso de América Latina y Uruguay, ¿no?",
        "start": 0.0,
        "end": 29.0
    },
    {
        "text": " Básicamente, nosotros vamos a dar tres grandes temas, uno que tiene que ver con América Latina,",
        "start": 29.0,
        "end": 40.0
    },
    {
        "text": " otro que es globalización e integración y otro que es economía de Uruguay.",
        "start": 41.0,
        "end": 55.0
    },
    {
        "text": " ¿Cuál va a ser el objetivo de esta parte del curso? Básicamente, en tres semanas nosotros les vamos a dedicar aproximadamente dos clases a cada uno de estos.",
        "start": 58.0,
        "end": 69.0
    },
    {
        "text": " Módulos, vamos a intentar entender y comprender cuál ha sido todo el proceso y las características de América Latina, de los procesos de integración y globalización y de Uruguay.",
        "start": 70.0,
        "end": 86.0
    },
    {
        "text": " Y lo que vamos a estar analizando son cuáles son las principales estadísticas y los diferentes procesos y políticas económicas aplicadas.",
        "start": 86.0,
        "end": 94.0
    },
    {
        "text": " Cada una de estas clases va a tener asociada un práctico que en realidad lo vamos a hacer un poco bien articulado el teórico y donde vamos a analizar en profundidad cuáles son los datos de la cuchillatura actual para que ustedes puedan cerrar en un panadammo un análisis más detallado.",
        "start": 95.0,
        "end": 113.0
    },
    {
        "text": " A ver si logró que funciona.",
        "start": 118.0,
        "end": 120.0
    },
    {
        "text": " En esta primera parte sobre economía de América Latina.",
        "start": 125.0,
        "end": 129.0
    },
    {
        "text": " Voy a estar los docentes de este módulo, va a ser Federico Aralla y María Sanchez.",
        "start": 131.0,
        "end": 143.0
    },
    {
        "text": " Vamos a estar trabajando Marte Sijueves y en el práctico del miércoles Federico y yo miércoles y viernes en los grupos de acuerdo.",
        "start": 144.0,
        "end": 155.0
    },
    {
        "text": " Entonces, ¿cuál es el objetivo?",
        "start": 157.0,
        "end": 160.0
    },
    {
        "text": " El objetivo un poco es caracterizar las distintas etapas del crecimiento.",
        "start": 160.0,
        "end": 164.0
    },
    {
        "text": " De los países de América Latina a través de las principales estadísticas descriptivas que hacen a nivel de la región.",
        "start": 165.0,
        "end": 175.0
    },
    {
        "text": " Empezamos en la parte de América Latina.",
        "start": 177.0,
        "end": 179.0
    },
    {
        "text": " En América Latina lo que nos interesa un poco ver es cuál es tan sido los procesos fuertes que han venido la economía de América Latina.",
        "start": 179.0,
        "end": 187.0
    },
    {
        "text": " Entonces, lo que nos nos analizamos son las etapas del crecimiento.",
        "start": 188.0,
        "end": 193.0
    },
    {
        "text": " Nos interesa hacer una caracterización de las principales etapas del crecimiento.",
        "start": 206.0,
        "end": 212.0
    },
    {
        "text": " Y la primera etapa que tenemos es lo que se denominó el crecimiento hacia afuera.",
        "start": 213.0,
        "end": 219.0
    },
    {
        "text": " Nosotros lo que vamos a hacer es caracterizar cada una de las etapas, pero cuáles fueron sus principales características.",
        "start": 219.0,
        "end": 225.0
    },
    {
        "text": " Y analizar cómo se fue pasando de un modelo de crecimiento hacia otra.",
        "start": 225.0,
        "end": 230.0
    },
    {
        "text": " El crecimiento hacia afuera.",
        "start": 230.0,
        "end": 232.0
    },
    {
        "text": " Si ubicó entre 1850 y 1930.",
        "start": 233.0,
        "end": 242.0
    },
    {
        "text": " Un 4ón que nosotros vamos a tener es que muchos de los comportamientos son relativamente comunes dentro de lo que son los países en la región.",
        "start": 242.0,
        "end": 251.0
    },
    {
        "text": " Si bien no son totalmente terojeños, después hay particularidades que responden a diferentes regiones a diferentes países,",
        "start": 251.0,
        "end": 258.0
    },
    {
        "text": " pero sí vamos a hacer una caracterización general para después ir a ver qué fue lo que pasó en Uruguay.",
        "start": 259.0,
        "end": 264.0
    },
    {
        "text": " Después tenemos una segunda etapa donde se da el agotamiento del modelo de crecimiento hacia afuera y surge con fuerza lo que es la cepal.",
        "start": 265.0,
        "end": 278.0
    },
    {
        "text": " Una tercera etapa es el período de crecimiento hacia afuera.",
        "start": 279.0,
        "end": 288.0
    },
    {
        "text": " ¿Qué es el modelo donde se impulsa la industria sustitutiva de importaciones, lo que se llamó el modelo IC,",
        "start": 288.0,
        "end": 313.0
    },
    {
        "text": " y básicamente fue entre 1940 y 1960.",
        "start": 313.0,
        "end": 322.0
    },
    {
        "text": " Una cuarta etapa que es la etapa del estancamiento productivo.",
        "start": 322.0,
        "end": 330.0
    },
    {
        "text": " ¿Qué se da a fines de los años 60?",
        "start": 331.0,
        "end": 343.0
    },
    {
        "text": " Una quinta etapa en los años 70, donde es el fortalecimiento del modelo exportador.",
        "start": 343.0,
        "end": 355.0
    },
    {
        "text": " La integración financiera y la transnationalización del proceso de industrialización.",
        "start": 355.0,
        "end": 381.0
    },
    {
        "text": " ¿Los años 80 con la crisis de la deuda?",
        "start": 386.0,
        "end": 397.0
    },
    {
        "text": " Sí, no me funciona. La famosa década perdida.",
        "start": 397.0,
        "end": 407.0
    },
    {
        "text": " ¿Los años 90, donde fueron las reformas estructurales?",
        "start": 408.0,
        "end": 421.0
    },
    {
        "text": " Vamos a ir pasando por cada una de estas épocas.",
        "start": 421.0,
        "end": 424.0
    },
    {
        "text": " Vasas en el que se llamó el consenso de Washington.",
        "start": 424.0,
        "end": 442.0
    },
    {
        "text": " Y después, en los años 2000, las crisis y el crecimiento con inclusión.",
        "start": 443.0,
        "end": 465.0
    },
    {
        "text": " Podemos identificar unas ocho etapa en todo lo que es el proceso económico de América Latina,",
        "start": 466.0,
        "end": 473.0
    },
    {
        "text": " que van acompañados con determinadas procesos sociales y ciclopolíticos.",
        "start": 473.0,
        "end": 478.0
    },
    {
        "text": " Másicamente desde 1850 a 1930, lo que fue el crecimiento hacia afuera.",
        "start": 478.0,
        "end": 483.0
    },
    {
        "text": " El agotamiento del modelo con un proceso de estancamiento donde surge la Comisión Económica para América Latina,",
        "start": 483.0,
        "end": 490.0
    },
    {
        "text": " que lo que tuvo fue una institución que fue muy importante en la creación del pensamiento y el análisis de América Latina",
        "start": 491.0,
        "end": 499.0
    },
    {
        "text": " y surge en los procesos fuertes de planificación económica.",
        "start": 499.0,
        "end": 502.0
    },
    {
        "text": " Después, viene todo el proceso de crecimiento hacia afuera.",
        "start": 504.0,
        "end": 508.0
    },
    {
        "text": " El crecimiento hacia adentro con la industria sustitutiva de importaciones, con altos modelos proteccionistas,",
        "start": 509.0,
        "end": 516.0
    },
    {
        "text": " básicamente entre el 40 y el 60, el estancamiento productivo de los fines de los 60,",
        "start": 516.0,
        "end": 523.0
    },
    {
        "text": " en los años 70, el portadecimiento del modelo exportador, con más o menos medidas liberalizadoras, integración financiera",
        "start": 523.0,
        "end": 530.0
    },
    {
        "text": " y los procesos de transnacionalización de las industrias.",
        "start": 530.0,
        "end": 533.0
    },
    {
        "text": " Los años 80 fueron las crisis de deudal, los países tuvieron fuertes importantes niveles de deudas externa",
        "start": 534.0,
        "end": 543.0
    },
    {
        "text": " y lo que llamó la de cada perdida y los años 90 con las reformas estructurales que se basaron en los niñamientos del contexto de Washington,",
        "start": 543.0,
        "end": 551.0
    },
    {
        "text": " donde hubo un conjunto de reformas de tipo aperturistas y liberalizadoras que caracterizaron a la región,",
        "start": 551.0,
        "end": 559.0
    },
    {
        "text": " con tipos de modelos de estabilización basados en el tipo de cambio",
        "start": 560.0,
        "end": 566.0
    },
    {
        "text": " y que terminaron con la crisis de los años 2000, la crisis famosa del 2002 en Uruguay, con la devaluación de junio de 2002,",
        "start": 566.0,
        "end": 575.0
    },
    {
        "text": " que tuvo una devalución en Argentinantes y en el 98 en Brasil, y que después se iniciaron a partir de 2003,",
        "start": 575.0,
        "end": 582.0
    },
    {
        "text": " los procesos de crecimiento importante, en nivel de toda la región, hasta hace unos tres años,",
        "start": 582.0,
        "end": 588.0
    },
    {
        "text": " no donde hubo lo que llamó el crecimiento con inclusión.",
        "start": 588.0,
        "end": 592.0
    },
    {
        "text": " Nosotros ahora lo que nos vamos a dedicar es a caracterizar cada una de estas etapas",
        "start": 592.0,
        "end": 597.0
    },
    {
        "text": " y a ver cuál fue los principales características.",
        "start": 599.0,
        "end": 602.0
    },
    {
        "text": " Bueno, la primera etapa, el crecimiento hacia afuera,",
        "start": 605.0,
        "end": 611.0
    },
    {
        "text": " el crecimiento hacia afuera,",
        "start": 611.0,
        "end": 614.0
    },
    {
        "text": " 1850, 1930,",
        "start": 621.0,
        "end": 625.0
    },
    {
        "text": " en qué contexto histórico se da esta etapa, esta etapa se da en la era de expansión del capitalismo en nivel mundial,",
        "start": 633.0,
        "end": 640.0
    },
    {
        "text": " antes de esta etapa, el capitalismo estaba centrado en Europa,",
        "start": 640.0,
        "end": 667.0
    },
    {
        "text": " y los avances en los medios de comunicación, lo que se permite es que el sistema capitalista se expanda",
        "start": 667.0,
        "end": 676.0
    },
    {
        "text": " a través de todo lo que son los procesos colonizadores.",
        "start": 676.0,
        "end": 679.0
    },
    {
        "text": " Concide esto con la segunda revolución industrial,",
        "start": 680.0,
        "end": 690.0
    },
    {
        "text": " donde surge con fuerza el ferrocarril y la electricidad,",
        "start": 697.0,
        "end": 704.0
    },
    {
        "text": " y los países europeos tienen diferentes formas de expandirse,",
        "start": 705.0,
        "end": 716.0
    },
    {
        "text": " hay diferentes procesos de colonización en diferentes sistemas.",
        "start": 716.0,
        "end": 722.0
    },
    {
        "text": " También surge también un debilitamiento de la economía inglesa,",
        "start": 725.0,
        "end": 733.0
    },
    {
        "text": " nivel mundial, y se da una transición hacia lo que es como centro-gemonico,",
        "start": 733.0,
        "end": 750.0
    },
    {
        "text": " Estados Unidos.",
        "start": 750.0,
        "end": 753.0
    },
    {
        "text": " Este es el contexto histórico en el cual se da, ¿cuáles fueron las principales características de este período de crecimiento hacia afuera en América Latina?",
        "start": 764.0,
        "end": 779.0
    },
    {
        "text": " En primer lugar, la primera característica que tenemos que destacar es la integración de América Latina como naciones independientes al comercio mundial.",
        "start": 779.0,
        "end": 798.0
    },
    {
        "text": " Y básicamente, ¿cuál es el rol que tiene América Latina? ¿A esa exportadora de materias primas?",
        "start": 810.0,
        "end": 818.0
    },
    {
        "text": " ¿Eso es la materia primas?",
        "start": 818.0,
        "end": 820.0
    },
    {
        "text": " ¿E importa productos manufacturados?",
        "start": 832.0,
        "end": 837.0
    },
    {
        "text": " De los países más desarrollados.",
        "start": 838.0,
        "end": 847.0
    },
    {
        "text": " Lo que se da es eso, sea una incertidensión internacional donde América Latina empieza a integrarse el comercio mundial como naciones independientes,",
        "start": 847.0,
        "end": 860.0
    },
    {
        "text": " pero con un rol que le es específico. América Latina es porte a materias primas, e importa productos manufacturados.",
        "start": 861.0,
        "end": 868.0
    },
    {
        "text": " Esta es la característica central, ¿no? Entonces, de alguna forma, queda atada a los baívenes de la economía externa.",
        "start": 872.0,
        "end": 880.0
    },
    {
        "text": " Sentiendo eso.",
        "start": 881.0,
        "end": 883.0
    },
    {
        "text": " Y esto genera lo que se llama la división internacional del trabajo.",
        "start": 883.0,
        "end": 892.0
    },
    {
        "text": " ¿Qué características tiene esta división internacional del trabajo que los países que producen y venden materias primas?",
        "start": 902.0,
        "end": 909.0
    },
    {
        "text": " Tienen poco grado de elaboración, ¿no?",
        "start": 910.0,
        "end": 913.0
    },
    {
        "text": " Poco valor agregado mientras importan productos de mucho valor agregado.",
        "start": 913.0,
        "end": 918.0
    },
    {
        "text": " El sector exportador en América Latina produce y vende materias primas, básicamente produce tos agrícolas, productos ganaderos,",
        "start": 921.0,
        "end": 928.0
    },
    {
        "text": " metales preciosos, y es el sector que promueve el mayor crecimiento con mayor productividad y también el de mayor inversión.",
        "start": 928.0,
        "end": 937.0
    },
    {
        "text": " Esas son las características del crecimiento hacia afuera.",
        "start": 940.0,
        "end": 944.0
    },
    {
        "text": " Entonces, ese modelo de crecimiento hacia afuera lo que genera esa división del trabajo porque genera dos tipos de economías.",
        "start": 947.0,
        "end": 955.0
    },
    {
        "text": " Primero, que nada lo que son las economías de enclave",
        "start": 955.0,
        "end": 963.0
    },
    {
        "text": " y por otro lado lo que son las economías más integradas.",
        "start": 964.0,
        "end": 969.0
    },
    {
        "text": " Las economías en clave son aquellas donde la producción se centra en una zona geográfica, básicamente.",
        "start": 976.0,
        "end": 982.0
    },
    {
        "text": " Por ejemplo, las economías de vananeras o las economías vineras.",
        "start": 982.0,
        "end": 988.0
    },
    {
        "text": " Ahora sí, gracias. Mientras que las economías más integradas son aquellas donde la producción se realiza en casi todo el territorio.",
        "start": 989.0,
        "end": 997.0
    },
    {
        "text": " Y esto hace que el crecimiento se expanda en forma más efectiva.",
        "start": 997.0,
        "end": 1002.0
    },
    {
        "text": " Es el típico de producción típico de economías ganaderas.",
        "start": 1006.0,
        "end": 1010.0
    },
    {
        "text": " Bien, entonces.",
        "start": 1011.0,
        "end": 1013.0
    },
    {
        "text": " Se generan dos tipos importantes de economías.",
        "start": 1019.0,
        "end": 1023.0
    },
    {
        "text": " Aquí esas economías donde la producción y la zona de producción está concentrada en un territorio.",
        "start": 1023.0,
        "end": 1030.0
    },
    {
        "text": " Y aquí ellas donde está más expandida.",
        "start": 1032.0,
        "end": 1034.0
    },
    {
        "text": " Entonces, esa es la diferencia bien fuerte entre el concepto de economía de enclave y enclaves más integradas.",
        "start": 1034.0,
        "end": 1039.0
    },
    {
        "text": " Las economías de enclaves asocian básicamente es la producción mananera.",
        "start": 1039.0,
        "end": 1043.0
    },
    {
        "text": " Aquellas que tienen menores posibilidades de desarrollo a las producciones mineras específicas.",
        "start": 1043.0,
        "end": 1048.0
    },
    {
        "text": " Mientras que la producción más asociada de la ganadería es una ganería más extensiva.",
        "start": 1048.0,
        "end": 1053.0
    },
    {
        "text": " Entonces, genera de una manera otros derrames hacia el resto de la economía.",
        "start": 1053.0,
        "end": 1058.0
    },
    {
        "text": " ¿Por qué? Porque la producción se realiza en zonas más extendidas en todo el territorio.",
        "start": 1062.0,
        "end": 1067.0
    },
    {
        "text": " Y esto hace que el crecimiento sea mayor.",
        "start": 1067.0,
        "end": 1070.0
    },
    {
        "text": " Uruguay, Argentina, son economías básicamente asociadas a la ganadería.",
        "start": 1070.0,
        "end": 1076.0
    },
    {
        "text": " Esta división internacional del trabajo lo que hace es se caracteriza por este modelo donde América Latina produce y vende materias prima asociadas a un poco valor agregado",
        "start": 1081.0,
        "end": 1093.0
    },
    {
        "text": " y compra productos industrializados que tienen un mayor valor agregado.",
        "start": 1093.0,
        "end": 1097.0
    },
    {
        "text": " Entonces, se genera una división internacional de trabajo asociado a lo que son las economías más de la preferir las economías más de centro.",
        "start": 1097.0,
        "end": 1106.0
    },
    {
        "text": " Este modelo se llama de crecimiento hacia afuera. ¿Por qué? Porque el crecimiento se da a partir de las exportaciones",
        "start": 1106.0,
        "end": 1116.0
    },
    {
        "text": " y que aprovecha también de lo que son las primeras, la primera y la segunda guerra mundial donde se da el enterritorio europeo.",
        "start": 1116.0,
        "end": 1123.0
    },
    {
        "text": " Entonces, ahí América Latina tiene una buena capacidad de vender y es por car.",
        "start": 1123.0,
        "end": 1130.0
    },
    {
        "text": " Tiene un proceso de estancamiento, se agota. Y ese proceso se da en surgimiento con lo que es la cepal.",
        "start": 1130.0,
        "end": 1140.0
    },
    {
        "text": " La cepal es la Comisión Económica para América Latina y el Cative y lo que es la cepal surge con el fuerte objetivo de analizar las tendencias económicas y sociales que tienen la región.",
        "start": 1140.0,
        "end": 1168.0
    },
    {
        "text": " Es algo de la región regionalista y básicamente el objetivo fundamental es analizar las tendencias económicas y sociales de la región.",
        "start": 1169.0,
        "end": 1195.0
    },
    {
        "text": " Entonces, lo que quieres es analizar cuáles son las causas y las consecuencias de este proceso y lo que sea más es lo que se empieza a construir lo que es el fuerte, lo que llama el pensamiento cepalino y la era de la cepal en América Latina, que tiene una lógica muy de la región.",
        "start": 1195.0,
        "end": 1216.0
    },
    {
        "text": " Parte básicamente de un análisis descriptivo.",
        "start": 1216.0,
        "end": 1223.0
    },
    {
        "text": " Y lo que se basa es en un análisis histórico razonado.",
        "start": 1224.0,
        "end": 1238.0
    },
    {
        "text": " Acá denuncian que nosotros vimos cuando empezamos a dar el curso, dijimos, este curso es un curso de economía integrada y nosotros básicamente podríamos dividir en tres grandes tareas.",
        "start": 1239.0,
        "end": 1252.0
    },
    {
        "text": " Y lo que es la economía descriptiva y la política económica.",
        "start": 1252.0,
        "end": 1266.0
    },
    {
        "text": " La economía descriptiva es aquello que nos dice cómo es el cómo, los modelos de descripción económica.",
        "start": 1266.0,
        "end": 1273.0
    },
    {
        "text": " La economía política nos da las respuestas al por qué nos interesa ver cuáles son las causas y las consecuencias, las relaciones, la interpretación económica.",
        "start": 1274.0,
        "end": 1282.0
    },
    {
        "text": " Y la política económica tiene que ver con la intervención sobre determinada realidad. Esta separación que es teórica, esta en la cabeza, en realidad se juntan porque nosotros para describir siempre tenemos un modelo que está detrás y un análisis de la realidad.",
        "start": 1282.0,
        "end": 1297.0
    },
    {
        "text": " Y lo que busca es la construcción de un pensamiento propio de la región.",
        "start": 1298.0,
        "end": 1304.0
    },
    {
        "text": " Y lo que busca es la construcción de un pensamiento propio de la región.",
        "start": 1304.0,
        "end": 1327.0
    },
    {
        "text": " Y a partir de ahí surge un pensamiento cepalino y un conjunto de políticas que caracterizan a una determinada etapa.",
        "start": 1327.0,
        "end": 1340.0
    },
    {
        "text": " La cepal hoy sigue existiendo.",
        "start": 1340.0,
        "end": 1345.0
    },
    {
        "text": " Este pensamiento cepalino se basa en un conjunto de ideas o de ideas principales, o de ideas centrales.",
        "start": 1346.0,
        "end": 1355.0
    },
    {
        "text": " Oles son las ideas centrales de la cepal.",
        "start": 1356.0,
        "end": 1362.0
    },
    {
        "text": " La primera idea es el esquema Centro Periferia.",
        "start": 1363.0,
        "end": 1369.0
    },
    {
        "text": " Para que se esté esquema, este esquema lo que buscan entender es ese crecimiento mundial desigual.",
        "start": 1369.0,
        "end": 1391.0
    },
    {
        "text": " ¿Y va a diferenciar entre lo que son los países centrales?",
        "start": 1392.0,
        "end": 1403.0
    },
    {
        "text": " De los países perifericos.",
        "start": 1403.0,
        "end": 1412.0
    },
    {
        "text": " Los países centrales son aquellos países que son productores industrializados, con mayor valor agregado y con mayor contenido tecnológico.",
        "start": 1412.0,
        "end": 1424.0
    },
    {
        "text": " Mientras que los países perifericos, o sea, los países de América Latina, son aquellos productores de materias prima.",
        "start": 1424.0,
        "end": 1434.0
    },
    {
        "text": " Son los exportadores de materias prima que tienen un menor o un escaso valor agregado y un contenido tecnológico mucho menor.",
        "start": 1435.0,
        "end": 1446.0
    },
    {
        "text": " La segunda idea que va a estar anterior es la de la relación de términos de intercambio.",
        "start": 1447.0,
        "end": 1472.0
    },
    {
        "text": " La relación entre los precios de los productos de exportación y los precios de los productos de importación.",
        "start": 1473.0,
        "end": 1479.0
    },
    {
        "text": " Lo que dice es que hay una tendencia desfavorable a los países perifericos.",
        "start": 1479.0,
        "end": 1488.0
    },
    {
        "text": " Los precios de sus exportaciones se abarán mientras que los precios de los productos industrializados se encarecen.",
        "start": 1488.0,
        "end": 1496.0
    },
    {
        "text": " Entonces hay una relación de términos de intercambio que tiene de hacer desfavorable para la región.",
        "start": 1497.0,
        "end": 1503.0
    },
    {
        "text": " Las dos ideas están asociadas.",
        "start": 1503.0,
        "end": 1507.0
    },
    {
        "text": " O van de la mano.",
        "start": 1507.0,
        "end": 1508.0
    },
    {
        "text": " A partir de estos dos conceptos, podemos caracterizar estas realidades.",
        "start": 1508.0,
        "end": 1527.0
    },
    {
        "text": " Voy a dejar las etapas y vengo a para acá porque así después vamos a seguir.",
        "start": 1527.0,
        "end": 1533.0
    },
    {
        "text": " Entonces tenemos dentro de esas días centrales el esquema.",
        "start": 1539.0,
        "end": 1545.0
    },
    {
        "text": " La periferia tiene dos características fundamentales, una que es homogénea y especializada.",
        "start": 1545.0,
        "end": 1564.0
    },
    {
        "text": " Perdón, heterofénio.",
        "start": 1565.0,
        "end": 1575.0
    },
    {
        "text": " Me adelante. ¿Qué les parece que significan estos dos conceptos?",
        "start": 1575.0,
        "end": 1586.0
    },
    {
        "text": " Eterofénio y especializado.",
        "start": 1587.0,
        "end": 1595.0
    },
    {
        "text": " A diferencia del centro que es diversificado y homogéneo.",
        "start": 1595.0,
        "end": 1603.0
    },
    {
        "text": " Especializada esta les día en que la producción se centra en productos primarios.",
        "start": 1617.0,
        "end": 1626.0
    },
    {
        "text": " Agrícolas ganaderos y mineros.",
        "start": 1636.0,
        "end": 1639.0
    },
    {
        "text": " ¿Qué heterofénia significa que conviven muchas realidades?",
        "start": 1646.0,
        "end": 1649.0
    },
    {
        "text": " El de el sector exportador conviven.",
        "start": 1649.0,
        "end": 1653.0
    },
    {
        "text": " Los que tienen muy buena productividad con los que tienen muy baja productividad.",
        "start": 1653.0,
        "end": 1660.0
    },
    {
        "text": " Conviven los que tienen grande y na mismo con los que no tienen grande y na mismo.",
        "start": 1665.0,
        "end": 1669.0
    },
    {
        "text": " No existe una única realidad productiva dentro de la región.",
        "start": 1669.0,
        "end": 1674.0
    },
    {
        "text": " Mientras que el centro es lo contrario homogéneo y diversificado.",
        "start": 1676.0,
        "end": 1681.0
    },
    {
        "text": " Es diversificado porque su producción tiene una gama amplia de productos.",
        "start": 1681.0,
        "end": 1691.0
    },
    {
        "text": " Tiene diversos productos.",
        "start": 1693.0,
        "end": 1696.0
    },
    {
        "text": " Y tiene productos manufacturados.",
        "start": 1697.0,
        "end": 1702.0
    },
    {
        "text": " Pero también tiene productos primarios.",
        "start": 1703.0,
        "end": 1708.0
    },
    {
        "text": " Y también tiene avarca el sector terciario o lo que nosotros hoy conocemos con los servicios.",
        "start": 1708.0,
        "end": 1715.0
    },
    {
        "text": " Y eso homogéneo porque la mayoría de los sectores son de alta productividad.",
        "start": 1727.0,
        "end": 1735.0
    },
    {
        "text": " Y acá es distinta la productividad y el dinamismo de los sectores.",
        "start": 1738.0,
        "end": 1745.0
    },
    {
        "text": " Y a esto se les suma la relación en términos de intercambio.",
        "start": 1757.0,
        "end": 1766.0
    },
    {
        "text": " Que es esa relación en depresios, entre productos primarios y materias primas.",
        "start": 1766.0,
        "end": 1775.0
    },
    {
        "text": " Productos primarios y productos manufacturados.",
        "start": 1775.0,
        "end": 1782.0
    },
    {
        "text": " ¿Dónde lo que se da es una tendencia?",
        "start": 1783.0,
        "end": 1787.0
    },
    {
        "text": " ¿De favorable?",
        "start": 1787.0,
        "end": 1790.0
    },
    {
        "text": " En los precios de los productos primarios.",
        "start": 1796.0,
        "end": 1801.0
    },
    {
        "text": " Estos son de los conceptos fundamentales del pensamiento cepalino.",
        "start": 1813.0,
        "end": 1816.0
    },
    {
        "text": " Y en base a estos conceptos es que se desarrolla toda la teoría de la cepal.",
        "start": 1816.0,
        "end": 1821.0
    },
    {
        "text": " ¿Dónde uno de los referentes fue un argentino que se llamó Previch?",
        "start": 1821.0,
        "end": 1825.0
    },
    {
        "text": " ¿Adiós ¿Dónde está la cepa de la cepal hoy?",
        "start": 1828.0,
        "end": 1831.0
    },
    {
        "text": " En Santiago de Chile.",
        "start": 1832.0,
        "end": 1834.0
    },
    {
        "text": " Y la verdad que tiene publicación.",
        "start": 1834.0,
        "end": 1835.0
    },
    {
        "text": " Y todavía sigue siendo importante en la elaboración de análisis,",
        "start": 1835.0,
        "end": 1838.0
    },
    {
        "text": " en la elaboración de estadísticas.",
        "start": 1838.0,
        "end": 1841.0
    },
    {
        "text": " Bien.",
        "start": 1843.0,
        "end": 1844.0
    },
    {
        "text": " Entonces, si este esquema se mantiene y perdura, se genera una bricha.",
        "start": 1846.0,
        "end": 1854.0
    },
    {
        "text": " Y esta bricha tiende a aumentar en el tiempo.",
        "start": 1859.0,
        "end": 1866.0
    },
    {
        "text": " La tendencia es aumentar en San Charcia. Estás más grande.",
        "start": 1867.0,
        "end": 1871.0
    },
    {
        "text": " Y no a chicarse como sostiene la teoría de las ventajas comparativas.",
        "start": 1879.0,
        "end": 1893.0
    },
    {
        "text": " QueBrad no begitu chico.",
        "start": 1897.0,
        "end": 1900.0
    },
    {
        "text": " Elolen хорошо tecnológico.",
        "start": 1914.0,
        "end": 1916.0
    },
    {
        "text": " Kstory es más chao...",
        "start": 1919.0,
        "end": 1921.0
    },
    {
        "text": " Buri ¿Qué pasa nueva?",
        "start": 1922.0,
        "end": 1924.0
    },
    {
        "text": " en las economías centrales.",
        "start": 1924.0,
        "end": 1929.0
    },
    {
        "text": " Entonces, lo que dice esta teoría es que en este esquema,",
        "start": 1934.0,
        "end": 1940.0
    },
    {
        "text": " las diferencias siempre van a terminar aumentándose",
        "start": 1940.0,
        "end": 1943.0
    },
    {
        "text": " y las relaciones en términos de intercambio van a seguir empeorando.",
        "start": 1943.0,
        "end": 1947.0
    },
    {
        "text": " Y va a haber diferenciación creciente en los niveles de productividad del trabajo.",
        "start": 1947.0,
        "end": 1953.0
    },
    {
        "text": " Además, si existimos generidad, la incorporación del progreso tecnológico",
        "start": 1954.0,
        "end": 1966.0
    },
    {
        "text": " se da a nivel de todos los sectores, mientras que si hay economías que son heterogéneas,",
        "start": 1966.0,
        "end": 1972.0
    },
    {
        "text": " cuando hay incorporación se da en forma diferenciada.",
        "start": 1972.0,
        "end": 1976.0
    },
    {
        "text": " Entonces, parece como que de pocas alternativas.",
        "start": 1976.0,
        "end": 1981.0
    },
    {
        "text": " De esta forma, los ingresos reales de las economías perifericas crecen menos que en las economías centrales.",
        "start": 1984.0,
        "end": 2005.0
    },
    {
        "text": " Y de esta forma, lo que se hace es, se reduce el poder de compra de los productos industrializados.",
        "start": 2006.0,
        "end": 2029.0
    },
    {
        "text": " Con los productos primarios, cada vez puedo comprar menos productos industrializados.",
        "start": 2030.0,
        "end": 2035.0
    },
    {
        "text": " Este es el esquema de análisis en un período, porque si ustedes analizan ahora,",
        "start": 2039.0,
        "end": 2044.0
    },
    {
        "text": " uno de los sectores donde más incorporación tecnológica tiene es el propio agro,",
        "start": 2044.0,
        "end": 2049.0
    },
    {
        "text": " a través de todo lo que es el mejoramiento genético.",
        "start": 2049.0,
        "end": 2051.0
    },
    {
        "text": " Eso es un cambio relativamente reciente, hasta nuestro país,",
        "start": 2052.0,
        "end": 2057.0
    },
    {
        "text": " hay una incorporación de sectores que hay trabajos recientes que muestran que en los últimos años",
        "start": 2057.0,
        "end": 2063.0
    },
    {
        "text": " de los sectores que más tecnologían incorporados en el agro.",
        "start": 2063.0,
        "end": 2066.0
    },
    {
        "text": " La mejora genética es uno de los componentes fundamentales y donde hay más innovación.",
        "start": 2066.0,
        "end": 2072.0
    },
    {
        "text": " Por eso nosotros trabajamos en una ciencia social y donde las teorías tienen una localización geográfica,",
        "start": 2073.0,
        "end": 2082.0
    },
    {
        "text": " social, temporal, histórica y temporal.",
        "start": 2082.0,
        "end": 2085.0
    },
    {
        "text": " Otra fecha de la heterogeneidad estructural,",
        "start": 2103.0,
        "end": 2116.0
    },
    {
        "text": " este provoca una fuerte concentración del ingreso.",
        "start": 2120.0,
        "end": 2125.0
    },
    {
        "text": " Y lo que hace es, se conforman élite económicas asociadas al sectores portador,",
        "start": 2132.0,
        "end": 2152.0
    },
    {
        "text": " y otros sectores que están por fuera de eso.",
        "start": 2152.0,
        "end": 2159.0
    },
    {
        "text": " Porque están los restos de los sectores o de la masa fuerte trabajadora que se emplean en los sectores de menos de productiva",
        "start": 2165.0,
        "end": 2172.0
    },
    {
        "text": " y por lo tanto tienen salarios menores, ingresos más altos y condiciones laborales a veces en peores condiciones.",
        "start": 2172.0,
        "end": 2179.0
    },
    {
        "text": " Porque tienen dificultad incorporar el progreso tecnológico por lo tanto beneficiarse de la propiación de ingresos asociadas a esa mayor productividad y a ese progreso tecnológico.",
        "start": 2179.0,
        "end": 2189.0
    },
    {
        "text": " Entonces, de esta forma lo que hace las repales es asociar.",
        "start": 2193.0,
        "end": 2198.0
    },
    {
        "text": " La desigualdad de ingresos.",
        "start": 2201.0,
        "end": 2203.0
    },
    {
        "text": " Aún problema de estructura productiva.",
        "start": 2203.0,
        "end": 2213.0
    },
    {
        "text": " Eterogenea y especializado.",
        "start": 2213.0,
        "end": 2227.0
    },
    {
        "text": " Y entonces, de esta forma nosotros lo que lo tenemos es que el subdesarrollo.",
        "start": 2227.0,
        "end": 2242.0
    },
    {
        "text": " No es una etapa para el desarrollo.",
        "start": 2245.0,
        "end": 2252.0
    },
    {
        "text": " Pero es una consecuencia del mío.",
        "start": 2252.0,
        "end": 2261.0
    },
    {
        "text": " La teoría de las ventajas comparativas no me dice que esa bricha va a ir disminuyendo.",
        "start": 2261.0,
        "end": 2281.0
    },
    {
        "text": " Si no al contrario va a ir aumentando con lo cual la convivencia de los países perifericos y los países técnicos no es que se converja hacia el centro.",
        "start": 2281.0,
        "end": 2292.0
    },
    {
        "text": " Si no que tienden a permanecer y asentuarse.",
        "start": 2292.0,
        "end": 2296.0
    },
    {
        "text": " Por eso decimos que el subdesarrollo no es una etapa del desarrollo sino que es una consecuencia parte del mismo sistema.",
        "start": 2297.0,
        "end": 2304.0
    },
    {
        "text": " De este análisis surge un conjunto de recomendaciones o medidas de política económica.",
        "start": 2304.0,
        "end": 2314.0
    },
    {
        "text": " Lo que van a decir es la única forma de romper con esto es de alguna forma quebrar o romper esta heterogeneidad y especialización.",
        "start": 2315.0,
        "end": 2332.0
    },
    {
        "text": " Y para ello lo que se necesita es la intervención del Estado.",
        "start": 2334.0,
        "end": 2354.0
    },
    {
        "text": " La intervención del Estado, el rol del Estado es fundamental para romper con esta lógica y poder de alguna forma romper con la heterogeneidad y la especialización y fomentar una mayor productividad, un mayor crecimiento y que eso pueda derramarse hacia la sociedad.",
        "start": 2354.0,
        "end": 2381.0
    },
    {
        "text": " En el año en la década del 30 con la crisis del 29 se dan los primeros inicios del agotamiento del modelo de crecimiento.",
        "start": 2384.0,
        "end": 2413.0
    },
    {
        "text": " El modelo de crecimiento hacia fuera.",
        "start": 2413.0,
        "end": 2420.0
    },
    {
        "text": " No es igual de siempre en todos lados, pero sea los primeros inicios.",
        "start": 2420.0,
        "end": 2427.0
    },
    {
        "text": " La crisis central es surge el periodo de la gran depresión.",
        "start": 2427.0,
        "end": 2449.0
    },
    {
        "text": " La gran depresión surge en Estados Unidos y acá lo que se rompe también es con la idea de que el mercado solo puede tener capacidad de poder ajustarse.",
        "start": 2449.0,
        "end": 2465.0
    },
    {
        "text": " Entonces el ajuste de los mercados sin intervención no funciona y empieza a tomar fuerza el rol del Estado.",
        "start": 2465.0,
        "end": 2492.0
    },
    {
        "text": " Hay una fuerte consenso sobre la necesidad de la intervención estatal y es en esta época donde surge con fuerzas las ideas que inestianas.",
        "start": 2493.0,
        "end": 2511.0
    },
    {
        "text": " El Estado tiene un rol importante en la intervención económica.",
        "start": 2511.0,
        "end": 2521.0
    },
    {
        "text": " La gran depresión de las cosas que hace es caer la demanda externa de los países latinoamericanos.",
        "start": 2521.0,
        "end": 2527.0
    },
    {
        "text": " Entonces impacta directamente sobre los países latinoamericanos.",
        "start": 2527.0,
        "end": 2548.0
    },
    {
        "text": " Entonces en la década de los 40 y los 50, ¿cuáles fueron los características de las economías de América Latina?",
        "start": 2548.0,
        "end": 2568.0
    },
    {
        "text": " En primer lugar hay de un agotamiento del modelo de crecimiento hacia afuera.",
        "start": 2568.0,
        "end": 2587.0
    },
    {
        "text": " Los países centrales tienen la etapa de guerra y posguerra.",
        "start": 2599.0,
        "end": 2623.0
    },
    {
        "text": " Y eso de alguna manera lo primero que hace es dificultar el acceso a productos industrializados.",
        "start": 2624.0,
        "end": 2640.0
    },
    {
        "text": " Entonces a nivel de América Latina que se necesita el autobastecimiento.",
        "start": 2640.0,
        "end": 2659.0
    },
    {
        "text": " Y lo que se permite en esta época es como si hay buenas, cuando se puede haber exportaciones, lo que se permite es la acumulación de divistas que pueden fomentar el desarrollo de inversiones.",
        "start": 2659.0,
        "end": 2678.0
    },
    {
        "text": " Y se generan un conjunto de estímulos económicos que lo que buscan es el desarrollo industrial.",
        "start": 2690.0,
        "end": 2701.0
    },
    {
        "text": " Y ahí se da el surgimiento de lo que son las primeras signas del modelo de industria sustitutiva de importaciones.",
        "start": 2702.0,
        "end": 2711.0
    },
    {
        "text": " Y también lo otro que hay es mano de obra disponible o sobrante que está expulsada del sector primario.",
        "start": 2711.0,
        "end": 2740.0
    },
    {
        "text": " Los países latinoamericanos parten de un resago tecnológico.",
        "start": 2741.0,
        "end": 2753.0
    },
    {
        "text": " Tienen que tener una incorporación de tecnología de progreso técnico.",
        "start": 2754.0,
        "end": 2765.0
    },
    {
        "text": " Esa incorporación de tecnología se da detrás de un proceso de los que vienen los países centrales.",
        "start": 2766.0,
        "end": 2784.0
    },
    {
        "text": " Y a su vez no se da igual en todos los sectores.",
        "start": 2785.0,
        "end": 2791.0
    },
    {
        "text": " Entonces también se genera como una retroalimentación de ese proceso de heterogeneidad estructural.",
        "start": 2791.0,
        "end": 2798.0
    },
    {
        "text": " Hay sobre abundancia de mano de obra en algunos sectores.",
        "start": 2798.0,
        "end": 2804.0
    },
    {
        "text": " Hay desigualdad de ingresos según los sectores y la incorporación no se da en forma igual.",
        "start": 2804.0,
        "end": 2810.0
    },
    {
        "text": " Entonces, la estructuración de las ideas del acepal, lo que dice es que la década del 40, 50, existen condiciones en la médica latina para el desarrollo.",
        "start": 2815.0,
        "end": 2842.0
    },
    {
        "text": " De una industria nacional.",
        "start": 2843.0,
        "end": 2849.0
    },
    {
        "text": " Y esta es el medio para cambiar el rol en la insansión internacional.",
        "start": 2849.0,
        "end": 2868.0
    },
    {
        "text": " Dejando de ser países exclusivamente productores y exportadores de productos primarios,",
        "start": 2869.0,
        "end": 2876.0
    },
    {
        "text": " que los de favorece en términos de las relaciones, en términos de intercambio,",
        "start": 2876.0,
        "end": 2881.0
    },
    {
        "text": " hacia una industrialización que les permite gozar de los frutos del progreso tecnológico y superar la heterogeneidad y la especialización.",
        "start": 2881.0,
        "end": 2890.0
    },
    {
        "text": " Y todo esto se logra a través del rol del estado.",
        "start": 2891.0,
        "end": 2897.0
    },
    {
        "text": " El rol del estado con un fuerte rol de planificador central y lo que se llama el modelo de crecimiento hacia adentro,",
        "start": 2897.0,
        "end": 2919.0
    },
    {
        "text": " a través del desarrollo de la industria sustitutiva de importaciones, el famoso modelo Isti.",
        "start": 2919.0,
        "end": 2937.0
    },
    {
        "text": " ¿Dónde el rol tiene una presencia muy fuerte y crecimiento fuerte?",
        "start": 2950.0,
        "end": 2966.0
    },
    {
        "text": " ¿Dónde el rol del estado es muy fuerte?",
        "start": 2967.0,
        "end": 2989.0
    },
    {
        "text": " Bien.",
        "start": 2990.0,
        "end": 2995.0
    },
    {
        "text": " Bueno, es así que en la década de los 40 a la afuera de los 50, la América Latina empieza a transitar por el modelo de industria sustitutiva de importaciones.",
        "start": 2995.0,
        "end": 3008.0
    },
    {
        "text": " Entre la crisis del 30, entre las dos guerras mundiales, que son propicias para la sustitución de importaciones",
        "start": 3009.0,
        "end": 3020.0
    },
    {
        "text": " y que producen importantes cambios políticas y sociales en el mundo entero, se conforman nuevas élites económicas que están en condiciones de promover el desarrollo industrial viacapitales regionales,",
        "start": 3020.0,
        "end": 3035.0
    },
    {
        "text": " y que se hace siempre con una fuerte intervención del estado que promueve y protege el desarrollo de las nuevas industrias.",
        "start": 3035.0,
        "end": 3042.0
    },
    {
        "text": " De hecho, todos los procesos económicos van a acompañados con determinados procesos políticos y determinados procesos sociales,",
        "start": 3042.0,
        "end": 3053.0
    },
    {
        "text": " no es casualidad que en esta época hacen asumido gobiernos de corte progresista e intervenionista, como es el gobierno de Vargas, en Brasil, de cárdenas, en México, de Perón, en Argentina y de Luis Valle, en Uruguay.",
        "start": 3054.0,
        "end": 3070.0
    },
    {
        "text": " Uruguay tuvo un crecimiento del estado y de desarrollo del estado de bienestar además que fue ante el Gior que ya fue con Valle y Ordoño.",
        "start": 3070.0,
        "end": 3079.0
    },
    {
        "text": " Pero en este periodo se da los fuertes gobiernos más de corte progresista y populista que son el Perónismo en Argentina, Vargas en Brasil, cárdenas en México, Luis Valle, Verdes en Uruguay, donde el estado empieza a tener un gran peso y las intervenciones del estado en toda la vida social y pública y económica son importantes.",
        "start": 3080.0,
        "end": 3108.0
    },
    {
        "text": " Este modelo de industria sustituctiva de importaciones, ¿cuál es la idea central?",
        "start": 3109.0,
        "end": 3122.0
    },
    {
        "text": " La idea central es comentar la industria nacional, que permitiras superar la incertión internacional y Latinoamericana donde se exportaban básicamente bien esprimarios.",
        "start": 3122.0,
        "end": 3142.0
    },
    {
        "text": " Superar la etapa de exportaciones de bien esprimarios. ¿Cuál es el problema de los bien esprimarios?",
        "start": 3142.0,
        "end": 3163.0
    },
    {
        "text": " Lo bien esprimarios tienen poco valor agregado, poca incorporación tecnológica, por lo tanto tienen más dificultades de insertarse en los mercados más dinámicos y pierden en términos de la relación en términos de intercambio que les es desfavorable.",
        "start": 3163.0,
        "end": 3190.0
    },
    {
        "text": " Entonces esto va generando una desigualdad ingresos, ingresos reales, se pierde poder adquisitivo.",
        "start": 3191.0,
        "end": 3202.0
    },
    {
        "text": " Entonces, en estas condiciones lo que se busca es generar las condiciones para la producción de bienes secundarios o industrializados.",
        "start": 3202.0,
        "end": 3221.0
    },
    {
        "text": " Existen condiciones porque existen determinadas acumulaciones de capital y existen ante ingresos de visas que permiten ir sustituyendo lo que se importaba en las economías centrales.",
        "start": 3221.0,
        "end": 3242.0
    },
    {
        "text": " ¿Sustituir por producción nacional?",
        "start": 3243.0,
        "end": 3251.0
    },
    {
        "text": " Lo que se importaba de las economías centrales.",
        "start": 3256.0,
        "end": 3265.0
    },
    {
        "text": " ¿Cuáles son las bases del modelo? Aprovechar las divisas que se habían generado en el sector esportador, que se habían generado durante la guerra como consecuencia del aumento de las exportaciones y mejora de las precios de las mismas.",
        "start": 3273.0,
        "end": 3293.0
    },
    {
        "text": " La producción nacional puede sustituir importaciones que entonces se compraban en el resto del mundo.",
        "start": 3294.0,
        "end": 3303.0
    },
    {
        "text": " ¿Tústito ir importaciones con productos nacionales? ¿Cuáles son estos mecanismos?",
        "start": 3304.0,
        "end": 3323.0
    },
    {
        "text": " Los mecanismos tienen que ver con el rol y la intervención del Estado y tienen que ver con un conjunto de subsidios a la industria nacional.",
        "start": 3324.0,
        "end": 3347.0
    },
    {
        "text": " ¿Y cuál es el objetivo ir en etapas? Empezar por las industrias de menor grado dificultad.",
        "start": 3348.0,
        "end": 3370.0
    },
    {
        "text": " Alimento, bebidas, bienes de consumo, no duradero y ir avanzando hacia las más sofisticadas por ejemplo maquinaria.",
        "start": 3370.0,
        "end": 3385.0
    },
    {
        "text": " Me siguen con el arrozonamiento.",
        "start": 3401.0,
        "end": 3407.0
    },
    {
        "text": " En sus inicios también se centrarían el mercado interno y luego exportar.",
        "start": 3407.0,
        "end": 3429.0
    },
    {
        "text": " Para eso lo que es fundamental es un mercado interno, fuerte que demandara que comprar esa producción nacional.",
        "start": 3438.0,
        "end": 3459.0
    },
    {
        "text": " Y para esto lo que es fundamental es un rol fuerte del Estado, interveniendo en la economía, generando subsidios, generando protección para esa industria nacional.",
        "start": 3459.0,
        "end": 3483.0
    },
    {
        "text": " Surge lo que se llama fuertemente la planificación central en América Latina.",
        "start": 3483.0,
        "end": 3494.0
    },
    {
        "text": " Esta lógica de la planificación central no solo sea en América Latina y sea en otros lugares.",
        "start": 3494.0,
        "end": 3506.0
    },
    {
        "text": " Este modelo que pareció funcionar durante algunos años en la realidad duro poco.",
        "start": 3507.0,
        "end": 3512.0
    },
    {
        "text": " Ya a fines de la década del 50 se vio como que el modelo estaba votado.",
        "start": 3512.0,
        "end": 3520.0
    },
    {
        "text": " O sea, el crecimiento de la... ¿Qué significa que el modelo está votado?",
        "start": 3521.0,
        "end": 3526.0
    },
    {
        "text": " Que el crecimiento de las economías latinoamericanas barzados en esta lógica en el desarrollo de la industria nacional y fomentada en el mercado interno no se pudo seguir manteniendo.",
        "start": 3526.0,
        "end": 3542.0
    },
    {
        "text": " Entonces hubo que pasar a otro tipo de modelo.",
        "start": 3543.0,
        "end": 3546.0
    },
    {
        "text": " Lo que pasó aparte es que los Estados crecieron para que hubiera un consumo importante, el industria nacional también se tenía que fomentar este consumo y los mercados de consumo también son reducidos.",
        "start": 3548.0,
        "end": 3565.0
    },
    {
        "text": " Y en los hechos lo que pasó que ese modelo se agotó y surgieron los principios, volví a estancarse.",
        "start": 3566.0,
        "end": 3574.0
    },
    {
        "text": " Entonces hacia la década del 60...",
        "start": 3579.0,
        "end": 3582.0
    },
    {
        "text": " ...",
        "start": 3583.0,
        "end": 3587.0
    },
    {
        "text": " Sámana, lo que se llama la etapa de industrialización difícil.",
        "start": 3592.0,
        "end": 3599.0
    },
    {
        "text": " Sobre todo este proceso sean las economías más fuertes o más grandes, por ejemplo Brasil.",
        "start": 3600.0,
        "end": 3606.0
    },
    {
        "text": " Si bien surge en los modelos de crecimiento hacia adentro, empiezan a darse cambios sustantivos en el funcionamiento.",
        "start": 3609.0,
        "end": 3626.0
    },
    {
        "text": " Esta industrialización más difícil lo que busca es se da fundamentalmente en economías grandes con mayores capacidades, Brasil por ejemplo.",
        "start": 3630.0,
        "end": 3641.0
    },
    {
        "text": " Y lo que busca es pasar no solo a productos de fácil producción, ojero a bienes de alimentos, bienes de consumo de dudadero, sino pasar a bienes de consumo de mayor duración.",
        "start": 3642.0,
        "end": 3656.0
    },
    {
        "text": " Hay industrias más complejas.",
        "start": 3657.0,
        "end": 3660.0
    },
    {
        "text": " Entonces más que sustitución de importaciones lo que se busca es actividades del centro hacia la descentralización de actividades del centro hacia la periferia.",
        "start": 3663.0,
        "end": 3676.0
    },
    {
        "text": " Y surge como nuevo enfoque de industrialización con el surgimiento de las empresas transnacionales.",
        "start": 3677.0,
        "end": 3685.0
    },
    {
        "text": " Y me voy a dejar describir acá para no hacer una desprolegía.",
        "start": 3689.0,
        "end": 3696.0
    },
    {
        "text": " Repasando, se acuerdan que nosotros tuvimos una primera análisis de lo que fue 1850 a 1930, que es la etapa del crecimiento hacia afuera de América Latina.",
        "start": 3706.0,
        "end": 3727.0
    },
    {
        "text": " Básicamente, productora y exportadora de productos primarios.",
        "start": 3728.0,
        "end": 3736.0
    },
    {
        "text": " Proceso de división internacional del trabajo.",
        "start": 3740.0,
        "end": 3743.0
    },
    {
        "text": " Después llega la década del 30 con la crisis y las guerras mundiales.",
        "start": 3747.0,
        "end": 3753.0
    },
    {
        "text": " Hay buena capacidad de exportar en ese periodo, se generan importantes divisas, pero lo que se ve son.",
        "start": 3758.0,
        "end": 3763.0
    },
    {
        "text": " Exporto materias primas, con poco valor agregado, con poca incorporación tecnológica, y tengo que comprar bienes industrializados con mayor valor agregado y eso de alguna forma genera una división internacional del trabajo.",
        "start": 3763.0,
        "end": 3776.0
    },
    {
        "text": " Los países que producen bienes primarios y que compran países industrializados de los países centrales.",
        "start": 3776.0,
        "end": 3783.0
    },
    {
        "text": " Empiezas a surgir una corriente del pensamiento que es Latinoamericana y regionalista, que es la Sepal.",
        "start": 3784.0,
        "end": 3791.0
    },
    {
        "text": " Y las ideas de la Sepal se basan en la descripción de la realidad económica y social y se basan en un conjunto de ideas.",
        "start": 3796.0,
        "end": 3803.0
    },
    {
        "text": " Primero que nada que existe, un centro y una periferia. Y ese característica, ese centro y esa periferia entre una periferia terogénea y especializada donde la terogénea significa que existe diferente productividad y diferente dinamismo entre los sectores y que se especializada porque básicamente se concentra en productos primarios.",
        "start": 3804.0,
        "end": 3823.0
    },
    {
        "text": " Y que a su vez se dan en diferentes características, no es igual en todas las economías.",
        "start": 3823.0,
        "end": 3828.0
    },
    {
        "text": " Hay determinadas economías o determinadas regiones donde están focalizados muy la producción, la industria minera, las famosas economías vananeras y hay otro tipo de actividades primarias que están más desarrolladas a lo largo del territorio, la actividad grícola, la actividad ganadera, más que nada de la ganadera.",
        "start": 3829.0,
        "end": 3850.0
    },
    {
        "text": " Entonces, usas genera una expansión más fuerte del crecimiento en el territorio, mientras que las economías del centro son más homogéneas y diversificadas.",
        "start": 3850.0,
        "end": 3861.0
    },
    {
        "text": " Terogénea es que conviven diferentes niveles de productividad y dinamismo. América Latina tiene grandes diferencias entre sus sectores, a la interna de las propias naciones.",
        "start": 3862.0,
        "end": 3871.0
    },
    {
        "text": " Homogéneas y diversificadas, esos sectores básicamente de alta productividad, el progreso tecnológico está diseminado en el conjunto de sectores de la economía y está diversificado porque propuso en una amplia gama de productos tanto industrializados como primarios como terciarios.",
        "start": 3872.0,
        "end": 3890.0
    },
    {
        "text": " Entonces, eso genera que la relación de precios entre los productos primarios y manufacturados sea desigual y tiendas centuarse, entonces existe una brecha que, en vez de disminuir, no hay una convergencia, hay una divergencia, tiende a aumentar.",
        "start": 3891.0,
        "end": 3909.0
    },
    {
        "text": " Entonces, la sepan lo que dice es lo que hay que hacer romper con esta dinámica, un para eso lo que tengo que hacer es el progreso tecnológico siempre es mayor en los países centrales, los ingresos reales, siempre tienden a de favorecer a la periferia.",
        "start": 3910.0,
        "end": 3927.0
    },
    {
        "text": " Mi ingreso tiene el menor poder de compra, cada vez pudo comprar menos de lo de producen el tercer mundo.",
        "start": 3928.0,
        "end": 3934.0
    },
    {
        "text": " Entonces, tengo que romper con esta heterogenea estructural, no tengo que lograr concentración del ingreso, se genera una desigualdad de ingresos y eso me dicen la realidad, las países subdesarrosados no es que estemos en una etapa para ser desarrollados sino que estamos como en una consecuencia, esto va a tender a acentuar.",
        "start": 3935.0,
        "end": 3956.0
    },
    {
        "text": " Entonces, tengo que romper con esa heterogenea y esa especialización y eso se va a través de una fuerte del rol del estado, cambia el rol del estado.",
        "start": 3956.0,
        "end": 3964.0
    },
    {
        "text": " Entonces, lo que busco en realidad es decir, bueno, voy a aprovechando esas divisas que se genera donde el modelo esportador, lo que voy a tratar es de poder desarrollar una industria sustitutiva de las importaciones y eso se va a tener que dar en etapas.",
        "start": 3964.0,
        "end": 3980.0
    },
    {
        "text": " Se va a dar en etapas en los cuales, primero voy a empezar a producir bienes y dejar de importar esos bienes en la industria menos sofisticada, más sencilla, más fácil de desarrollar para desporir a la industria más compleja.",
        "start": 3981.0,
        "end": 3992.0
    },
    {
        "text": " Primero alimentos, primero bienes que no sean de gran duración y después, puedo ir a pachinares.",
        "start": 3993.0,
        "end": 4000.0
    },
    {
        "text": " El estado empieza a ser importante, un rol fuerte en la intervención, en la generación de subsidios, en la desarrollo industrial, en el incentivo a las inversiones, en las propias inversiones que hace el estado.",
        "start": 4000.0,
        "end": 4016.0
    },
    {
        "text": " Esto se ha junto fuerte con el desarrollo del estado de bienestar. Uruguay tuvo la característica de que empezó un poco antes, pero el forta de cimiento de las empresas públicas.",
        "start": 4016.0,
        "end": 4027.0
    },
    {
        "text": " De la gran cantidad de beneficios sociales, el estado de bienestar como tal es un modelo que se basa en decir, bueno, si yo genero una cantidad de beneficios y tengo un estado fuerte, grande, con gran cantidad empleados públicos, voy a generar ingresos y esos ingresos se van a pulgar en el mercado de consumo.",
        "start": 4028.0,
        "end": 4050.0
    },
    {
        "text": " Si yo la población le doy educación, del punto de vista de la lógica económica, le doy educación, le doy salud, le dio un montón de cosas, la gente ahorra y lo pueden volcar en el mercado.",
        "start": 4051.0,
        "end": 4061.0
    },
    {
        "text": " Eso tiene un agotamiento también, porque el estado empieza a crecer muchísimo, empiezan los grandes épocas del déficit fiscal y de algunas formas, estos modelos tienden agotarse.",
        "start": 4062.0,
        "end": 4073.0
    },
    {
        "text": " En una etapa, algunas de las economías, sobre todo las más grandes, las más importantes, las que tienen más desarrollo, por ejemplo, Brasil, empiezan lo que llama la industrialización difícil y quieren pasar a otro tipo de sectores y empiezan a intentar ir a desarrollo del industria pesado.",
        "start": 4074.0,
        "end": 4093.0
    },
    {
        "text": " Entonces, en realidad, ahí no es solo sustituir importaciones, sino que extraer producción, el modelo del centro, poder traerlo hacia la periferia y eso se da con el impulso de las empresas transnacionales, característica de la época del 60.",
        "start": 4094.0,
        "end": 4108.0
    },
    {
        "text": " Me siguieron el resumen o el es, lo que veníamos hablando, sí.",
        "start": 4112.0,
        "end": 4117.0
    },
    {
        "text": " Bueno.",
        "start": 4124.0,
        "end": 4126.0
    },
    {
        "text": " Entonces.",
        "start": 4148.0,
        "end": 4150.0
    },
    {
        "text": " Muchas gracias.",
        "start": 4154.0,
        "end": 4156.0
    },
    {
        "text": " Entonces, en la décal 60 empiezan cambios.",
        "start": 4171.0,
        "end": 4178.0
    },
    {
        "text": " En ese modelo, da industria sustituativa de importaciones.",
        "start": 4179.0,
        "end": 4185.0
    },
    {
        "text": " Sigue el modelo de crecimiento hacia adentro.",
        "start": 4192.0,
        "end": 4197.0
    },
    {
        "text": " Pero este modelo se da con determinados cambios.",
        "start": 4198.0,
        "end": 4202.0
    },
    {
        "text": " Se pasa a nuevos bienes industriales.",
        "start": 4210.0,
        "end": 4214.0
    },
    {
        "text": " A bienes de consumo duradero.",
        "start": 4221.0,
        "end": 4224.0
    },
    {
        "text": " Por ejemplo, electrobomésticos, automóviles.",
        "start": 4228.0,
        "end": 4233.0
    },
    {
        "text": " Más que en una sustitución de importaciones, lo que se debe es una descentralización de actividades del centro hacia la periferia.",
        "start": 4239.0,
        "end": 4244.0
    },
    {
        "text": " Y es un nuevo esfuerzo de industrialización basado en las inversiones de las empresas transnacionales.",
        "start": 4258.0,
        "end": 4263.0
    },
    {
        "text": " También surge un nuevo actor, es un nuevo fenómeno.",
        "start": 4264.0,
        "end": 4268.0
    },
    {
        "text": " La inversión extranjera directa es importante a nivel de la región.",
        "start": 4269.0,
        "end": 4273.0
    },
    {
        "text": " En una primera etapa, esta inversión tuvo un fuerte impulso de la inversión regional.",
        "start": 4294.0,
        "end": 4300.0
    },
    {
        "text": " Donde hubo un fuerte fomento del estado.",
        "start": 4302.0,
        "end": 4307.0
    },
    {
        "text": " Y en la que se va a hacer un nuevo trabajo, que se va a hacer.",
        "start": 4311.0,
        "end": 4316.0
    },
    {
        "text": " Y en una segunda etapa, esa fuerte inversión pasó a ser más de corte transnacional.",
        "start": 4317.0,
        "end": 4322.0
    },
    {
        "text": " Cambió las características del proceso.",
        "start": 4327.0,
        "end": 4330.0
    },
    {
        "text": " La inserción de las empresas transnacionales en el proceso de industrialización significa un proceso simultáneo,",
        "start": 4333.0,
        "end": 4340.0
    },
    {
        "text": " de integración transnacional y de desintegración regional.",
        "start": 4341.0,
        "end": 4346.0
    },
    {
        "text": " Y de alguna forma lo que significa fue una mayor dependencia económica tecnológica.",
        "start": 4357.0,
        "end": 4363.0
    },
    {
        "text": " Y menores niveles de maniobra por parte de los gobiernos.",
        "start": 4364.0,
        "end": 4368.0
    },
    {
        "text": " De alguna forma, el fenómeno de las empresas transnacionales genera una mayor dependencia de las economías, de la región, de los capitales transnacionales.",
        "start": 4369.0,
        "end": 4379.0
    },
    {
        "text": " Y a su vez una lógica de pérdida de maniobra, de parte del estado, de contraer del estado.",
        "start": 4380.0,
        "end": 4386.0
    },
    {
        "text": " Es un fenómeno relativamente nuevo y que va con una política parturista también.",
        "start": 4386.0,
        "end": 4391.0
    },
    {
        "text": " Entonces, es el fenómeno de la inversión extranjera directa.",
        "start": 4394.0,
        "end": 4399.0
    },
    {
        "text": " ¿Se avanzas la producción de bienes intermedios?",
        "start": 4411.0,
        "end": 4416.0
    },
    {
        "text": " ¿De bienes intermedios?",
        "start": 4417.0,
        "end": 4421.0
    },
    {
        "text": " Y en menor medida, ¿de bienes de capital?",
        "start": 4425.0,
        "end": 4432.0
    },
    {
        "text": " Pero de todas formas, estos avances se los vio como, fueron insuficientes para crear una creación en 2gena de capital.",
        "start": 4433.0,
        "end": 4450.0
    },
    {
        "text": " No tuvieron los derrames, suficientes ni el crecimiento.",
        "start": 4450.0,
        "end": 4454.0
    },
    {
        "text": " No lograron una economía coherente y integrada como se quería lograr, cuando está mayor inversión.",
        "start": 4455.0,
        "end": 4462.0
    },
    {
        "text": " Gracias.",
        "start": 4463.0,
        "end": 4465.0
    },
    {
        "text": " Bueno, ¿a este proceso, cuáles fueron las explicaciones de la Sepal al fenómeno?",
        "start": 4465.0,
        "end": 4494.0
    },
    {
        "text": " Habludi, una existencia de barreras.",
        "start": 4495.0,
        "end": 4499.0
    },
    {
        "text": " Y básicamente se identificaron dos tipos de barreras, en primer lugar, una restricción interna.",
        "start": 4499.0,
        "end": 4506.0
    },
    {
        "text": " La restricción interna fue siempre los bajos niveles de inversión, la escase inversión que se da.",
        "start": 4506.0,
        "end": 4528.0
    },
    {
        "text": " Cuando hay escase inversión, se limita el progreso tecnológico, que así el aumento de la productividad.",
        "start": 4529.0,
        "end": 4535.0
    },
    {
        "text": " Por lo tanto, progreso tecnológico y productividad.",
        "start": 4543.0,
        "end": 4546.0
    },
    {
        "text": " Hay características estructurales de América Latina que impiden el desarrollo.",
        "start": 4550.0,
        "end": 4556.0
    },
    {
        "text": " ¿Por qué se da esto? Esto se da porque la inversión depende del ahorro.",
        "start": 4559.0,
        "end": 4570.0
    },
    {
        "text": " Y en América Latina el ahorro es bajos.",
        "start": 4570.0,
        "end": 4575.0
    },
    {
        "text": " Los niveles de ahorro son muy bajos.",
        "start": 4575.0,
        "end": 4579.0
    },
    {
        "text": " Hay una muy alta propensión al consumo.",
        "start": 4580.0,
        "end": 4586.0
    },
    {
        "text": " Y después hay escasos, o bajos, flujos de capital del exterior, que compensen esa baja inversión interna.",
        "start": 4588.0,
        "end": 4605.0
    },
    {
        "text": " La segunda barrera es una restricción externa.",
        "start": 4610.0,
        "end": 4618.0
    },
    {
        "text": " Y que tiene que ver con los bajos niveles de divisas.",
        "start": 4626.0,
        "end": 4632.0
    },
    {
        "text": " La incorporación del progreso técnico, de tecnología que viene del exterior requiere de disponibilidad de divisas.",
        "start": 4633.0,
        "end": 4642.0
    },
    {
        "text": " Y esto se ve limitado porque hay un nuevo emperamiento de la relación en términos de intercambio.",
        "start": 4642.0,
        "end": 4652.0
    },
    {
        "text": " Y también el cambio de centro egemonico, el pasaje del centro egemonico de Estados Unidos,",
        "start": 4653.0,
        "end": 4666.0
    },
    {
        "text": " hace que hace unos menores niveles de importación porque Estados Unidos, a diferencia del centro egemonico inglés,",
        "start": 4666.0,
        "end": 4673.0
    },
    {
        "text": " funciona fuertemente como una economía cerrada.",
        "start": 4673.0,
        "end": 4676.0
    },
    {
        "text": " Entonces los niveles de importación del centro son menores.",
        "start": 4677.0,
        "end": 4683.0
    },
    {
        "text": " Habiendo guerra en Europa y teniendo menos propensión a la importación por parte de Estados Unidos,",
        "start": 4683.0,
        "end": 4696.0
    },
    {
        "text": " la preocupación acá es por recuperar el mercado europeo.",
        "start": 4696.0,
        "end": 4700.0
    },
    {
        "text": " Se entiende su malo que hay escasa en ingreso de capital para poder financiar inversiones.",
        "start": 4701.0,
        "end": 4710.0
    },
    {
        "text": " Entonces se genera una brecha y una crisis que lleva a un deterioro.",
        "start": 4710.0,
        "end": 4723.0
    },
    {
        "text": " Este ya los déficit de balanza de paos, que caracterizan a la región.",
        "start": 4724.0,
        "end": 4737.0
    },
    {
        "text": " Adicionalmente en los 70, surgen fuerte presiones inflacionarias en la región",
        "start": 4738.0,
        "end": 4759.0
    },
    {
        "text": " y problemas de déficit fiscal y endeudamiento.",
        "start": 4760.0,
        "end": 4767.0
    },
    {
        "text": " A las problemas fuertes de la inflación, cuáles son las explicaciones que se dan.",
        "start": 4768.0,
        "end": 4789.0
    },
    {
        "text": " La expansión monetaria.",
        "start": 4790.0,
        "end": 4796.0
    },
    {
        "text": " El aumento en la cantidad de dinero es una de las fuentes fuertes de inflación.",
        "start": 4796.0,
        "end": 4806.0
    },
    {
        "text": " Para que se da esta expansión monetaria para financiar el déficit fiscal?",
        "start": 4807.0,
        "end": 4814.0
    },
    {
        "text": " Que se da por la brecha estarna?",
        "start": 4820.0,
        "end": 4824.0
    },
    {
        "text": " También hay un problema de oferta de bienes importados, también dados por los desequilibrios de la balanza de paos.",
        "start": 4837.0,
        "end": 4850.0
    },
    {
        "text": " Y problema de oferta de bienes locales.",
        "start": 4850.0,
        "end": 4857.0
    },
    {
        "text": " Que se dan ante una demanda creciente.",
        "start": 4858.0,
        "end": 4863.0
    },
    {
        "text": " Y esto provoca menor ahorro e inversión que van de la mano.",
        "start": 4863.0,
        "end": 4877.0
    },
    {
        "text": " Es como un tom, pues mismo proceso.",
        "start": 4877.0,
        "end": 4880.0
    },
    {
        "text": " Y hay como un aumento o un incentivo al endeudamiento.",
        "start": 4881.0,
        "end": 4887.0
    },
    {
        "text": " Pero igual esto se da en un proceso fuerte del regionalismo.",
        "start": 4888.0,
        "end": 4910.0
    },
    {
        "text": " Y hay una conciencia fuerte en esta época de la región.",
        "start": 4911.0,
        "end": 4917.0
    },
    {
        "text": " Entonces, ¿cuáles son de los procesos que se dan acá?",
        "start": 4929.0,
        "end": 4935.0
    },
    {
        "text": " A nivel de regionalismo, lo que se busca acá.",
        "start": 4935.0,
        "end": 4939.0
    },
    {
        "text": " Como alternativo para salvar o para dar continuidad al modelo Iste.",
        "start": 4939.0,
        "end": 4949.0
    },
    {
        "text": " Los procesos de integración regional.",
        "start": 4949.0,
        "end": 4962.0
    },
    {
        "text": " ¿Cuál es la lógica de los procesos de integración regional?",
        "start": 4962.0,
        "end": 4965.0
    },
    {
        "text": " Los procesos de integración regional como una forma de ampliar los mercados.",
        "start": 4965.0,
        "end": 4974.0
    },
    {
        "text": " Los mercados internos.",
        "start": 4974.0,
        "end": 4981.0
    },
    {
        "text": " Y el otro componente fuerte son los planes de desarrollo nacional.",
        "start": 4981.0,
        "end": 4987.0
    },
    {
        "text": " ¿Qué se basan en fuertes modelos de planificación económica?",
        "start": 4993.0,
        "end": 5001.0
    },
    {
        "text": " Vasados en una racionalización que busca superar los problemas que enfrenta la Iste.",
        "start": 5001.0,
        "end": 5010.0
    },
    {
        "text": " Superar el estancamiento.",
        "start": 5011.0,
        "end": 5017.0
    },
    {
        "text": " Y los problemas del modelo Iste en general.",
        "start": 5017.0,
        "end": 5022.0
    },
    {
        "text": " La inflación, el endeudamiento.",
        "start": 5022.0,
        "end": 5029.0
    },
    {
        "text": " En la década del 60 la capacidad de importar en América Latina se basó en el aumento de la deuda.",
        "start": 5030.0,
        "end": 5053.0
    },
    {
        "text": " Y eso lo que provoca es una fuerte restricción exerna.",
        "start": 5053.0,
        "end": 5060.0
    },
    {
        "text": " Deuda exerna.",
        "start": 5075.0,
        "end": 5081.0
    },
    {
        "text": " El crecimiento fue un portantísimo de la deuda estándar.",
        "start": 5081.0,
        "end": 5086.0
    },
    {
        "text": " Y los grandes problemas de la deuda.",
        "start": 5086.0,
        "end": 5093.0
    },
    {
        "text": " Se produce el estancamiento.",
        "start": 5100.0,
        "end": 5107.0
    },
    {
        "text": " Y fin del modelo de industria sustitutiva de importaciones y las consecuencias cuáles fueran que los objetivos no se lograron cumplir.",
        "start": 5107.0,
        "end": 5117.0
    },
    {
        "text": " No se pudo aumentar la productividad, no se verificó un aumento del empleo, no se pudo aumentar el producto nacional, no se pudo aumentar los ingresos reales.",
        "start": 5117.0,
        "end": 5132.0
    },
    {
        "text": " Y continúa presente esa heterogeneidad estructural, persistiendo una forma fuerte de producción de industrias atrasadas con muy bajo niveles de productividad.",
        "start": 5133.0,
        "end": 5146.0
    },
    {
        "text": " La integración regional no mejoró sustantivamente y tampoco se generaron reformas a fondo, no?",
        "start": 5146.0,
        "end": 5156.0
    },
    {
        "text": " La reforma de lagros, reformas de los sistemas financieros que permitieran de alguna forma generar condiciones para el desarrollo.",
        "start": 5156.0,
        "end": 5164.0
    },
    {
        "text": " La planificación se vio como insuficiente y el Estado se vio como ineficaz para poder resolver los grandes problemas de la cuyentud de la economía.",
        "start": 5167.0,
        "end": 5177.0
    },
    {
        "text": " Entonces, a pesar de la industria no había podido dar ese salto ni desceses a rollo en los mejores de los niveles de productividad, que permitiera insertarse en los mercados internacionales y poder volcarse como al mercado interno,",
        "start": 5178.0,
        "end": 5199.0
    },
    {
        "text": " la industria era ineficiente a los efectos de que existían altos costos y que no podía competir con la industria externa,",
        "start": 5200.0,
        "end": 5209.0
    },
    {
        "text": " y tampoco se podía subsistir eternamente de los subsidios, porque los Estados empezaron a crecer mucho y a quedan deudados.",
        "start": 5210.0,
        "end": 5219.0
    },
    {
        "text": " La mayoría de los países no había superado de la etapa de la industria incipiente, solamente se habían avanzado poco en el desarrollo industrial en bienes de muy escaso incorporación de valor agregado.",
        "start": 5220.0,
        "end": 5232.0
    },
    {
        "text": " América Latina se iba perdiendo participación en el comercio mundial y en realidad había grandes problemas derivados de los déficit de balanza de pagos,",
        "start": 5233.0,
        "end": 5244.0
    },
    {
        "text": " de los fuertes procesos inflacionarios, de las fuertes caídas de los ingresos reales y de la aumento enorme de la deuda a nivel externo.",
        "start": 5245.0,
        "end": 5256.0
    },
    {
        "text": " Entonces, lo que se generaron fueron fuertes críticas al modelo de industria sustitutiva de importaciones que básicamente por no lograr la dependencia externa y los problemas de saldos de balanza comercial.",
        "start": 5258.0,
        "end": 5273.0
    },
    {
        "text": " Había habido un aumento enorme de la pobreza, la aparición de los fenómenos del subempleo y la informalidad que tanto caracteriza en América Latina.",
        "start": 5274.0,
        "end": 5283.0
    },
    {
        "text": " Nosotros recién venimos de ahora, el modelo se ha estancado, pero en los principios de 2000 hubo un fuerte crecimiento de las economías de América Latina,",
        "start": 5284.0,
        "end": 5294.0
    },
    {
        "text": " a pesar de que sigue siendo el continente más desigual del mundo.",
        "start": 5295.0,
        "end": 5298.0
    },
    {
        "text": " Entonces, surge nuevas teorías diferentes a la anterior para explicar la realidad latinoamericana y que básicamente se basan en los modelos monetaristas y que son la base de lo que son los planes nacionales de desarrollo.",
        "start": 5298.0,
        "end": 5317.0
    },
    {
        "text": " Nosotros, el plan nacional de desarrollo de décadas de 1973, explica esto.",
        "start": 5317.0,
        "end": 5324.0
    },
    {
        "text": " Entonces, surge de esta forma a la década de 70.",
        "start": 5325.0,
        "end": 5334.0
    },
    {
        "text": " Que también se ha acompañado con un presó político diferente, donde el contexto internacional sea en una caída.",
        "start": 5334.0,
        "end": 5362.0
    },
    {
        "text": " De el sistema monetario internacional.",
        "start": 5364.0,
        "end": 5374.0
    },
    {
        "text": " Deberé tan gusto del 44.",
        "start": 5374.0,
        "end": 5383.0
    },
    {
        "text": " Se ha nuevo contexto, un nuevo sistema configuración de un nuevo sistema internacional, donde aumentan el flujo de capital mundial.",
        "start": 5384.0,
        "end": 5411.0
    },
    {
        "text": " Con fuerte inestabilidad en el tipo de cambio.",
        "start": 5412.0,
        "end": 5415.0
    },
    {
        "text": " Surge también la crisis del petróleo, en la década de 70, donde el aumento en el precio del petróleo aumenta los costos de producción.",
        "start": 5415.0,
        "end": 5441.0
    },
    {
        "text": " Surge los puertes procesos de inflación y recessión.",
        "start": 5445.0,
        "end": 5460.0
    },
    {
        "text": " El caída del crecimiento, la caída del producto.",
        "start": 5460.0,
        "end": 5474.0
    },
    {
        "text": " Es el contexto internacional.",
        "start": 5474.0,
        "end": 5476.0
    },
    {
        "text": " Los países desarrollados empiezan con fuertes procesos de caída del producto.",
        "start": 5476.0,
        "end": 5483.0
    },
    {
        "text": " Y esto afecta directamente porque afecta nuestras balanças comerciales.",
        "start": 5483.0,
        "end": 5489.0
    },
    {
        "text": " En este contexto.",
        "start": 5489.0,
        "end": 5493.0
    },
    {
        "text": " ¿Cuál es la realidad América Latina?",
        "start": 5496.0,
        "end": 5500.0
    },
    {
        "text": " En América Latina.",
        "start": 5504.0,
        "end": 5511.0
    },
    {
        "text": " El aumento de los precios del petróleo.",
        "start": 5511.0,
        "end": 5522.0
    },
    {
        "text": " Conduco inicialmente a un aumento en las exportaciones.",
        "start": 5522.0,
        "end": 5534.0
    },
    {
        "text": " Pero también un aumento en el precio.",
        "start": 5534.0,
        "end": 5540.0
    },
    {
        "text": " Se produce el proceso de internacionalización financiera.",
        "start": 5541.0,
        "end": 5547.0
    },
    {
        "text": " Hay fuertes ingresos de capitales y de inversión extranjera directa en la región.",
        "start": 5557.0,
        "end": 5565.0
    },
    {
        "text": " Hay un crecimiento entre el 68 y el 74 y un aumento de inversión.",
        "start": 5565.0,
        "end": 5583.0
    },
    {
        "text": " Es el fortalecimiento del modelo exportador y de la integración financiera.",
        "start": 5584.0,
        "end": 5606.0
    },
    {
        "text": " Que a mediados de los 70.",
        "start": 5607.0,
        "end": 5612.0
    },
    {
        "text": " Cambia el contexto internacional.",
        "start": 5612.0,
        "end": 5618.0
    },
    {
        "text": " En 1975.",
        "start": 5618.0,
        "end": 5620.0
    },
    {
        "text": " Aproximadamente.",
        "start": 5620.0,
        "end": 5622.0
    },
    {
        "text": " En peor.",
        "start": 5622.0,
        "end": 5626.0
    },
    {
        "text": " La demanda externa.",
        "start": 5626.0,
        "end": 5632.0
    },
    {
        "text": " Y se produce un shock estando negativo que afecta directamente todas las economías.",
        "start": 5632.0,
        "end": 5639.0
    },
    {
        "text": " Provocando un aumento del déficit en las cuentas externas.",
        "start": 5650.0,
        "end": 5658.0
    },
    {
        "text": " Que produce una fuerte vulnerabilidad externa.",
        "start": 5659.0,
        "end": 5664.0
    },
    {
        "text": " Y se trae lo que se llama la inflación importada.",
        "start": 5664.0,
        "end": 5670.0
    },
    {
        "text": " Que pasa a niveles altísimos del 12% al 60%.",
        "start": 5670.0,
        "end": 5678.0
    },
    {
        "text": " Se produce un fuerte proceso de endeudamiento externo.",
        "start": 5678.0,
        "end": 5687.0
    },
    {
        "text": " Y se llega a la década de los 80.",
        "start": 5687.0,
        "end": 5693.0
    },
    {
        "text": " Como la década de cada perdida.",
        "start": 5693.0,
        "end": 5699.0
    },
    {
        "text": " Y se llama la década de cada perdida.",
        "start": 5699.0,
        "end": 5702.0
    },
    {
        "text": " En esta década no hubo nada.",
        "start": 5702.0,
        "end": 5704.0
    },
    {
        "text": " Hubo crisis de deuda, hubo de evaluación.",
        "start": 5704.0,
        "end": 5707.0
    },
    {
        "text": " Es hubo problemas de crecimiento.",
        "start": 5707.0,
        "end": 5710.0
    },
    {
        "text": " Los planes de desarrollo que se implementaron en los 70.",
        "start": 5710.0,
        "end": 5714.0
    },
    {
        "text": " Para conducir en Uruguay en el 73.",
        "start": 5715.0,
        "end": 5718.0
    },
    {
        "text": " No fueron capaces de revertir la situación.",
        "start": 5718.0,
        "end": 5722.0
    },
    {
        "text": " Se basaron en políticas más de corte aperturista, de integración regional, de liberalización.",
        "start": 5722.0,
        "end": 5729.0
    },
    {
        "text": " Pero a pesar de ello, los procesos inflacionarios continuaron.",
        "start": 5729.0,
        "end": 5733.0
    },
    {
        "text": " El crecimiento no se fue concretar.",
        "start": 5733.0,
        "end": 5735.0
    },
    {
        "text": " Y los sistemas de tipo de cambio terminaron en fuertes de evaluaciones.",
        "start": 5735.0,
        "end": 5740.0
    },
    {
        "text": " Y los protocolan en el 82 de Uruguay que lo vamos a ver en más detalle.",
        "start": 5740.0,
        "end": 5744.0
    },
    {
        "text": " Estos años de los 70 fueron acompañados con todo lo que fueron la crisis de la institucionalidad política",
        "start": 5744.0,
        "end": 5751.0
    },
    {
        "text": " y todo lo que fueron las dictaduras militares que se dieron en toda la región.",
        "start": 5751.0,
        "end": 5755.0
    },
    {
        "text": " Que también llegaron un nuevo también.",
        "start": 5755.0,
        "end": 5758.0
    },
    {
        "text": " Y que parte del proceso económico de los 80.",
        "start": 5758.0,
        "end": 5761.0
    },
    {
        "text": " Cuando se dio un poco la vuelta a los Estados democráticos,",
        "start": 5761.0,
        "end": 5765.0
    },
    {
        "text": " tuvo que ver con asociado también las propios precios económicos.",
        "start": 5765.0,
        "end": 5770.0
    },
    {
        "text": " De esta forma, la economía América Latina pasó por ese etapa de crecimiento hacia afuera",
        "start": 5774.0,
        "end": 5781.0
    },
    {
        "text": " cuando se empiezan a consolidar los estados nacionales y se fuerten modelos portador",
        "start": 5781.0,
        "end": 5786.0
    },
    {
        "text": " hacia lo que fue la corriente separina con el crecimiento hacia adentro,",
        "start": 5786.0,
        "end": 5790.0
    },
    {
        "text": " el debilitamiento del modelo cepalino con estos modelos de planificación central",
        "start": 5790.0,
        "end": 5795.0
    },
    {
        "text": " y más basados en otros modelos portadores y así se llega a la de calochente.",
        "start": 5795.0,
        "end": 5801.0
    },
    {
        "text": " ¿Se entendió?",
        "start": 5801.0,
        "end": 5804.0
    },
    {
        "text": " Queremos para la próxima función la presentación y va a ser mucho más fácil de dar la clase.",
        "start": 5804.0,
        "end": 5809.0
    },
    {
        "text": " Si.",
        "start": 5809.0,
        "end": 5812.0
    }
]