[
    {
        "text": " Entonces, Juli, si vamos a hacer un poquito de matrices hermitianas, soy para no atrasar",
        "start": 0.0,
        "end": 5.64
    },
    {
        "text": " los tantos, el día está horrible, pero bueno, hay que seguir avanzando.",
        "start": 5.64,
        "end": 16.4
    },
    {
        "text": " Entonces, para la gente de OPEFIN hoy es matrices hermitianas, sección 2.6 y",
        "start": 16.4,
        "end": 32.66
    },
    {
        "text": " estos resultados, creo que son todos conocidos para ustedes, es lo que habíamos",
        "start": 32.66,
        "end": 40.16
    },
    {
        "text": " avisado, que muchos de estos resultados en esta parte del curso son más",
        "start": 40.16,
        "end": 45.2
    },
    {
        "text": " recordar que aprender cosas nuevas y por eso lo hacemos más o menos",
        "start": 45.2,
        "end": 50.56
    },
    {
        "text": " ágilmente, se supone que no tenemos problema. Entonces matrices hermitianas,",
        "start": 50.56,
        "end": 58.480000000000004
    },
    {
        "text": " bueno, la definición, a ver quién me hace acordar cuando una matricesa",
        "start": 58.480000000000004,
        "end": 66.24000000000001
    },
    {
        "text": " es hermitiana. ¿Cómo es? A ver. Es ella mi. Cuando son juntas, es ella mi,",
        "start": 66.8,
        "end": 79.56
    },
    {
        "text": " en particular, en vez de poner este coeficiente complejo que puedo poner.",
        "start": 79.56,
        "end": 83.32000000000001
    },
    {
        "text": " Si me quiere pensando, o sea, cada más, yo quiero que quise decir eso,",
        "start": 109.56,
        "end": 136.28
    },
    {
        "text": " otra cosa y me quede pensando esto, en principio no podemos decir que son confiéndose reales.",
        "start": 136.28,
        "end": 140.12
    },
    {
        "text": " ¿Quién es podamos decir que son reales? Por ejemplo, ¿no? Para sacar algunas observaciones.",
        "start": 140.12,
        "end": 147.08
    },
    {
        "text": " Claro, no, bueno, a ver, por ejemplo esta matrices, 1, 2 y y menos y, ¿cuál es su",
        "start": 147.08,
        "end": 163.92000000000002
    },
    {
        "text": " la Junta? 1, 2 y menos y 2 y menos y 2 y menos y 2 y menos y 2 y menos y 3 y menos. Por lo tanto,",
        "start": 163.92,
        "end": 175.76
    },
    {
        "text": " ¿cuál es su? Entonces, claro, los de la diagonal son reales, o sea, este es un ejemplo de hermitiana.",
        "start": 175.76,
        "end": 188.88
    },
    {
        "text": " Lo que queremos, porque lo confundimos es porque le sabice o les conté que íbamos a repasar el",
        "start": 188.88,
        "end": 199.35999999999999
    },
    {
        "text": " concepto hermitiana y simétricas y no lo escribí. Y bueno, que a más fue lo que hicimos en la clase",
        "start": 199.35999999999999,
        "end": 208.35999999999999
    },
    {
        "text": " pasada por eso se va a ganar confundido, entonces si este es hermitiana, si esta definición, pero si esta",
        "start": 208.35999999999999,
        "end": 215.16
    },
    {
        "text": " con los coeficientes reales y vale que ha de Junta y Sá, pero claro, a Junta en este caso no es",
        "start": 215.16,
        "end": 224.68
    },
    {
        "text": " otra cosa que ha transpuesto, en este caso se dice que es simétrica. Me quedé colgado con eso",
        "start": 224.68,
        "end": 235.04
    },
    {
        "text": " sorry, jeje, ¿ nămo le decimos que yo teniamias?",
        "start": 235.4,
        "end": 236.04
    },
    {
        "text": " Sí, es bombe para la unst appeal.",
        "start": 236.95999999999998,
        "end": 241.35999999999999
    },
    {
        "text": " ¿Cómo?, como?",
        "start": 245.39999999999998,
        "end": 250.76
    },
    {
        "text": " AlzheimerToroma.",
        "start": 250.76,
        "end": 252.88
    },
    {
        "text": " Oh, correo con ti.",
        "start": 255.72,
        "end": 259.03999999999996
    },
    {
        "text": "類 he listo los que mío nos he podido hacer.",
        "start": 259.03999999999996,
        "end": 262.44
    },
    {
        "text": " que iba a hacer otra observación más y ahora bueno la que dijo Nico que no he",
        "start": 262.44,
        "end": 269.82
    },
    {
        "text": " acribuido y es que la diagonal real o sea en la diagonal todos los coeficientes son",
        "start": 269.82,
        "end": 279.98
    },
    {
        "text": " reales. Bueno bien entonces esto era nada más para repasar por los salidas y",
        "start": 279.98,
        "end": 286.76
    },
    {
        "text": " se ha acribuyado ya en un poquito y también el teorema que di en el que también lo",
        "start": 286.76,
        "end": 291.94
    },
    {
        "text": " conoce en el esprobálico y lo se se va a confusión este se va a una matriz hermitiana",
        "start": 291.94,
        "end": 298.42
    },
    {
        "text": " entonces este este resultado se acuerdan todos sus valores propios son reales",
        "start": 298.42,
        "end": 317.76
    },
    {
        "text": " por eso es que uno puede llegar a confundirse",
        "start": 320.16,
        "end": 323.94
    },
    {
        "text": " y la parte B es que A es unitariamente diagonalizable",
        "start": 323.94,
        "end": 333.06
    },
    {
        "text": " bueno la definición de unitariamente diagonalizable está en el práctico y la al final de",
        "start": 344.5,
        "end": 353.82
    },
    {
        "text": " la clase pasada dijimos habría que revisar esa definición pero vamos a darlo entonces",
        "start": 353.82,
        "end": 358.74
    },
    {
        "text": " decimos que A es unitariamente diagonalizable incluso esta definición dice muy claramente",
        "start": 358.74,
        "end": 374.06
    },
    {
        "text": " lo que es o sea ya unitariamente diagonalizable no puede tener otra interpretación porque lo",
        "start": 374.06,
        "end": 382.74
    },
    {
        "text": " está diciendo quiere decir que existe si existe una matriz u unitaria y por lo tanto va a",
        "start": 382.74,
        "end": 394.1
    },
    {
        "text": " ser invertible porque su finversa es la junta por ser unitaria existe unitaria tal que",
        "start": 394.1,
        "end": 401.86
    },
    {
        "text": " la se basa una forma diagonal o sea tal que u a u estresa es igual a de de una matriz diagonal",
        "start": 401.86,
        "end": 415.1
    },
    {
        "text": " ojo porque en un momento vamos a usar así y en otro momento lo vamos a usar despejando a",
        "start": 415.1,
        "end": 432.5
    },
    {
        "text": " pero lo despejamos a camismo porque es lo mismo en verdad como u estresa es la inversa yo",
        "start": 432.5,
        "end": 440.18
    },
    {
        "text": " puedo multiplicar por u a la derecha y por u inversa izquierda que es su estrella y entonces",
        "start": 440.18,
        "end": 449.7
    },
    {
        "text": " está lo mismo que sí si solamente si A es u estresa de u",
        "start": 449.7,
        "end": 454.42
    },
    {
        "text": " está aquí también es adativo o sea no bueno en este caso",
        "start": 454.42,
        "end": 474.94
    },
    {
        "text": " y sí tiene que ser la de lo valor de propio ¿no? Sí tiene que ser lo mismo, tiene que ser lo",
        "start": 474.94,
        "end": 490.38
    },
    {
        "text": " mismo valor de propiedad es una buena acultación gracias Santiago les iba a decir algo más",
        "start": 490.38,
        "end": 501.78
    },
    {
        "text": " sí observen esta expresión quería destacar esto esto última expresión o sea supongan probar",
        "start": 501.78,
        "end": 508.85999999999996
    },
    {
        "text": " este teorema que es muy cortito es muy fácil lo vamos a ser rápido esta expresión es muy fuerte",
        "start": 508.85999999999996,
        "end": 514.06
    },
    {
        "text": " ¿no? y está diciendo que toda matriz hermitiana es una diagonal multiplicada por una unitaria",
        "start": 514.06,
        "end": 521.62
    },
    {
        "text": " conjuela por una unitaria es muy fuerte lo que está diciendo porque la diagonales son muy sencillas",
        "start": 521.62,
        "end": 527.9
    },
    {
        "text": " y las unitarias se comportan muy bien entonces este es realmente fuerte que puede que",
        "start": 528.42,
        "end": 536.1
    },
    {
        "text": " pueda expresar una matriz hermitiana de esta manera además todavía es un male lo que dijo",
        "start": 536.1,
        "end": 542.22
    },
    {
        "text": " Santiago donde el AD es un valor de propiedad o sea que en la diagonal de la diagonal de la",
        "start": 542.22,
        "end": 548.34
    },
    {
        "text": " diagonal de esta nueva la realmente esa última expresión es interesante bueno entonces vamos a",
        "start": 548.34,
        "end": 556.6600000000001
    },
    {
        "text": " ser rápido en la demostración todos con cierto que manejamos bueno voy a usar el platico 7 para",
        "start": 556.6600000000001,
        "end": 566.86
    },
    {
        "text": " cortar camino o sea voy al a la parte a si es hermitiana",
        "start": 566.86,
        "end": 575.3000000000001
    },
    {
        "text": " entonces a es normal en particular se acuerdan eso no es un caso particular de normal y si",
        "start": 579.46,
        "end": 587.74
    },
    {
        "text": " es normal creo que lo puse en práctico acá en el note que le había puesto en práctico",
        "start": 587.74,
        "end": 593.98
    },
    {
        "text": " capa que lo vimos en clase al final pero creo que lo voy a decir en práctico entonces",
        "start": 593.98,
        "end": 599.14
    },
    {
        "text": " esa es suitariamente diagonalizable",
        "start": 599.14,
        "end": 600.74
    },
    {
        "text": " práctico 7 entonces",
        "start": 611.82,
        "end": 614.98
    },
    {
        "text": " sí sí entonces vamos a el bella y el a juntos vella juntos por lo tanto si es",
        "start": 615.3000000000001,
        "end": 634.3000000000001
    },
    {
        "text": " unitariamente diagonalizable existe la matriz unitaria tal que vamos a tomar la expresión",
        "start": 634.3000000000001,
        "end": 643.1800000000001
    },
    {
        "text": " huestre ya muy buen de con diría con el claro",
        "start": 643.18,
        "end": 650.18
    },
    {
        "text": " y bueno entonces los elementos de la diagonal de son como dijo Santiago los valores propios de",
        "start": 656.38,
        "end": 662.42
    },
    {
        "text": " idea",
        "start": 662.66,
        "end": 663.66
    },
    {
        "text": " ya",
        "start": 678.0999999999999,
        "end": 678.4399999999999
    },
    {
        "text": " Bueno, entonces tomemos distralla ahora. Vamos a calcular distralla y distralla es",
        "start": 678.44,
        "end": 699.6800000000001
    },
    {
        "text": " distralla a u, distralla. Ya sabemos que la distralla te cambia el orden de la multiplicación,",
        "start": 699.68,
        "end": 712.1999999999999
    },
    {
        "text": " entonces te queda u distralla a distralla, u distralla a distralla, pero a distralla si huela,",
        "start": 712.1999999999999,
        "end": 725.4799999999999
    },
    {
        "text": " porque a ser mitiana, entonces te queda u distralla a, u distralla es distralla a su, en definitiva quedo de,",
        "start": 725.48,
        "end": 733.04
    },
    {
        "text": " entonces distralla es igual a de, pero de es una diagonal,",
        "start": 734.88,
        "end": 740.72
    },
    {
        "text": " entonces donde están, el mismo razonamiento que hizo Nico hoy, ¿cómo son todos estos de suy?",
        "start": 745.16,
        "end": 750.32
    },
    {
        "text": " Claro, entonces suy pertenece r para todo y para todo igual 1 hasta n, pero los de suy dijimos,",
        "start": 750.32,
        "end": 764.0
    },
    {
        "text": " enan los valores propios de n.",
        "start": 766.0,
        "end": 767.6800000000001
    },
    {
        "text": " Bien.",
        "start": 777.1600000000001,
        "end": 777.7600000000001
    },
    {
        "text": " Bueno, entonces eso puse algunos ejemplos acá para matizar un poco,",
        "start": 780.32,
        "end": 791.48
    },
    {
        "text": " hay una duda acá, digamos como dijo Matías, lo primero que probamos era que era suistariamente",
        "start": 800.6,
        "end": 806.36
    },
    {
        "text": " de una disable, pero eso vale para cualquier normal, según le practico 7, pero además en la",
        "start": 806.36,
        "end": 812.0
    },
    {
        "text": " día con el aparece esos valores propios y son reales, tiene que ser reales. Ahí de que son",
        "start": 812.0,
        "end": 819.08
    },
    {
        "text": " reales juega fuertemente de que acá se usa que ha de ser mitiana, o sea acá está el hipótesis,",
        "start": 819.08,
        "end": 824.48
    },
    {
        "text": " acá parece el hipótesis, ¿no? Que ha de ser mitiana. Bien. Bueno,",
        "start": 824.48,
        "end": 833.72
    },
    {
        "text": " pongamos algunos ejemplos, sencillos, ahí habíamos puesto un ejemplo acá antes también,",
        "start": 836.36,
        "end": 852.52
    },
    {
        "text": " con este lo conocen de cálculo 2, empieza por este, pues voy a otro más en si yo todavía,",
        "start": 866.36,
        "end": 871.48
    },
    {
        "text": " si tenemos una función f de rn, r, una función c2,",
        "start": 871.48,
        "end": 879.76
    },
    {
        "text": " este, será que ahora qué es c2?",
        "start": 885.76,
        "end": 887.6800000000001
    },
    {
        "text": " La continuidad de la segunda no la va a usar, pero por lo menos que es 2 veces divable,",
        "start": 887.68,
        "end": 898.68
    },
    {
        "text": " exactamente. Entonces bueno, ¿qué se hace 2? ¿Por qué no me acuerdo si el teorema",
        "start": 898.68,
        "end": 905.56
    },
    {
        "text": " Tomás este excesiano en un punto x y bueno por lo que tiene",
        "start": 906.28,
        "end": 915.9599999999999
    },
    {
        "text": " coeficientes h suijota, ¿no? ¿no? Y el h suijota era la derivada segunda respecto de f",
        "start": 915.9599999999999,
        "end": 925.28
    },
    {
        "text": " en y y en j, ¿no? ¿no? Evaluada en x, porque estamos en el punto x.",
        "start": 925.28,
        "end": 930.4399999999999
    },
    {
        "text": " Ese es el ejesiano de f. Entonces qué pasa? Bueno, lo conocen, trabajaron en cálculo 2,",
        "start": 936.56,
        "end": 944.0799999999999
    },
    {
        "text": " ayuda de terminar máximo, si mínimos, etcétera, no verdad, ese es lo, lo conocen bien de que,",
        "start": 944.0799999999999,
        "end": 948.8
    },
    {
        "text": " se supone de cálculos. ¿Cómo era esta matriz? Claro.",
        "start": 948.8,
        "end": 955.9599999999999
    },
    {
        "text": " Entonces, este para todo x, ¿no? Sí, creo que se prizaba a c2, ¿no? Para que se",
        "start": 955.96,
        "end": 968.5600000000001
    },
    {
        "text": " simétrica, ¿no? No tiene por qué se igual, ¿no me acuerdo? En el cálculo de",
        "start": 968.5600000000001,
        "end": 974.88
    },
    {
        "text": " culpa el sistema tiene la pata, la profeta de la cumplea, no me acuerdo, cuáles le hipote",
        "start": 974.88,
        "end": 979.4000000000001
    },
    {
        "text": " es el exacto para que se dan, para que quede simétrica. Pero creo que es el 2, estoy casi",
        "start": 979.4,
        "end": 985.52
    },
    {
        "text": " seguro que es el 2 alcanza, lo que no me acuerdo si es la hipote es el minimal, eso es.",
        "start": 985.52,
        "end": 989.9599999999999
    },
    {
        "text": " La cuestión es que es simétrica, que es simétrica, como estamos hablando de que esta matriz",
        "start": 989.9599999999999,
        "end": 995.3199999999999
    },
    {
        "text": " en realidad pertenece a msmdr, es exactamente lo que estamos diciendo, es simétrica,",
        "start": 995.3199999999999,
        "end": 1001.36
    },
    {
        "text": " es el caso particular de Hermitiana. O sea que ustedes conocen y entienden incluso por",
        "start": 1001.36,
        "end": 1008.56
    },
    {
        "text": " qué aparecen tan seguidos de la Hermitiana, ¿no? De los jacianos, por ejemplo, este es",
        "start": 1008.56,
        "end": 1015.9599999999999
    },
    {
        "text": " el ejemplo 1, pongamos otros ejemplos tontos, también sencillos, chip pongan en el grupo",
        "start": 1015.9599999999999,
        "end": 1028.08
    },
    {
        "text": " de WhatsApp y tenéis buenos que vengan a clase también. Bueno, el sencillo es esto, ahora",
        "start": 1028.08,
        "end": 1039.48
    },
    {
        "text": " si usted es una matriz cualquiera, esta cualquiera, cualquiera, entonces no estoy pidiendo que",
        "start": 1039.48,
        "end": 1048.0
    },
    {
        "text": " sea Hermitiana, no estoy, además vamos a sacar la nombre de A, porque a venimos usando",
        "start": 1048.0,
        "end": 1053.12
    },
    {
        "text": " para Hermitiana, vamos a ponerle B, entonces ¿qué pasa primero ejemplo su 1 dentro",
        "start": 1053.12,
        "end": 1060.2399999999998
    },
    {
        "text": " de 2 con esta matriz? ¿File tomar la junta? Te queda la misma, por lo tanto cuando esta",
        "start": 1060.2399999999998,
        "end": 1075.08
    },
    {
        "text": " el sermitiana. ¿Tú más una matriz cualquiera? La suma con su asunta y te queda el",
        "start": 1075.08,
        "end": 1089.8
    },
    {
        "text": " que sea Hermitiana, porque... ¿Probés que ha sido el momento de hacer el momento de",
        "start": 1089.8,
        "end": 1098.32
    },
    {
        "text": " la Hermitiana? Sí, probablemente es de haber... ¿No? Lo que pasa es que vos tenés que",
        "start": 1098.32,
        "end": 1112.9199999999998
    },
    {
        "text": " traponear también, además de conjuar, entonces no me di cuenta bien, ¿por qué tendría que ser?",
        "start": 1112.92,
        "end": 1117.3200000000002
    },
    {
        "text": " Es Hermitiana, ¿por qué? Es Hermitiana, ¿por qué?",
        "start": 1117.3200000000002,
        "end": 1121.5600000000002
    },
    {
        "text": " Es Hermitiana, ¿por qué? Claro.",
        "start": 1121.5600000000002,
        "end": 1123.8000000000002
    },
    {
        "text": " ¿Por qué le pones el aterisco?",
        "start": 1123.8000000000002,
        "end": 1125.8000000000002
    },
    {
        "text": " Es Hermitiana, ¿por qué? No, no es Hermitiana, pero ven más vea aterico, sí, porque le",
        "start": 1125.8,
        "end": 1141.1599999999999
    },
    {
        "text": " pones el aterisco. ¿Te queda aterico? ¿Me va a ver aterico aterico? ¿Qué ves?",
        "start": 1141.1599999999999,
        "end": 1144.68
    },
    {
        "text": " Mira, la suma comunitativa, eso sí, ¿no? Lo es esto, la suma de 1 y su conjuada siempre",
        "start": 1144.68,
        "end": 1151.6
    },
    {
        "text": " es Hermitiana. Otro ejemplo es así, ¿tonto? El producto, ve, por vea aterico, también es",
        "start": 1151.6,
        "end": 1163.9199999999998
    },
    {
        "text": " Hermitiana, ¿no? Porque... Bueno, acá lo ven más rápido, ¿no? Se hago el aterico aterico",
        "start": 1163.9199999999998,
        "end": 1169.28
    },
    {
        "text": " de este, te queda vea aterico aterico, que es ve, por vea aterico. Entonces también",
        "start": 1169.28,
        "end": 1176.32
    },
    {
        "text": " es Hermitiana. Es ejemplo, ¿tonto? Pero digamos, ven como aparecen también sumas y por",
        "start": 1176.32,
        "end": 1186.24
    },
    {
        "text": " supuesto vea aterisco vea también es Hermitiana, ¿no? Por supuesto. ¿Sí? ¿Sí? ¿Sí?",
        "start": 1186.24,
        "end": 1199.6
    },
    {
        "text": " Es que hay ando, me he alcanzado. Bueno, entonces, primero te va a dar que todos los",
        "start": 1199.6,
        "end": 1219.6
    },
    {
        "text": " valores conocían, todos los valores de profesión reales y esto de práctico, que es unitariamente",
        "start": 1219.6,
        "end": 1224.52
    },
    {
        "text": " o unalizable con la fuerza que tiene ese resultado y que lo van a usar seguido. Y ahora el",
        "start": 1224.52,
        "end": 1229.2
    },
    {
        "text": " segundo teorema ya en la sección 27, pero seguimos con el tema esto de la matriz de",
        "start": 1229.2,
        "end": 1236.16
    },
    {
        "text": " Hermitianas. También son resultados conocidos para usted. Por eso el espíritu que práctico",
        "start": 1236.16,
        "end": 1250.04
    },
    {
        "text": " es el 6, 7 los va a ganar rápido, porque en general no va a haber mucha tarea así difícil.",
        "start": 1250.04,
        "end": 1259.04
    },
    {
        "text": " Bueno, entonces el teorema de la sección 27, bueno, vamos a ver aquí.",
        "start": 1261.48,
        "end": 1267.12
    },
    {
        "text": " Seguro que no es lo sorprendo si tenemos una matriz de coeficiente complejos, son equivalentes.",
        "start": 1267.12,
        "end": 1287.6799999999998
    },
    {
        "text": " Los tres conceptos siguientes, primero que sea Hermitiana. Segundo, que cuando tomás cualquier",
        "start": 1287.68,
        "end": 1309.1200000000001
    },
    {
        "text": " vector de sea la N, haces x satirisco a x satirisco y esto da real, este producto da real.",
        "start": 1309.12,
        "end": 1317.1599999999999
    },
    {
        "text": " Y tercero, estoy seguro que este sirva. La segunda capa es que no, pero el tercero estoy seguro",
        "start": 1318.9599999999998,
        "end": 1324.36
    },
    {
        "text": " de la conocen, que es normal y sus valores propios son reales. Lo que digo es que a ver, primero",
        "start": 1324.36,
        "end": 1341.4399999999998
    },
    {
        "text": " que nada, esto es un tema de caracterización. Me acuerdo que estaba en la explicación el parcial,",
        "start": 1341.4399999999998,
        "end": 1350.76
    },
    {
        "text": " el prototipo de parcial, el concepto de qué es caracterizando, son condiciones equivalentes.",
        "start": 1350.76,
        "end": 1357.48
    },
    {
        "text": " En esta caracterización lo que digo es que ahí se usted ya lo conoce, de galdoz, muy probablemente.",
        "start": 1362.96,
        "end": 1369.44
    },
    {
        "text": " Que hay implicacés directo pues ya sabemos las dos resultados.",
        "start": 1370.04,
        "end": 1372.88
    },
    {
        "text": " Que implicacé, ya lo sabemos, primero porque toda matriz en mi tienda es normal, lo vimos,",
        "start": 1387.52,
        "end": 1396.0
    },
    {
        "text": " la clase pasada y recién vimos que toda matriz en mi tienda tiene sus valores propios reales",
        "start": 1396.6,
        "end": 1402.12
    },
    {
        "text": " que también lo conociéndote, entonces la implicacé directo. Y que se implica también es bastante directo",
        "start": 1402.12,
        "end": 1408.04
    },
    {
        "text": " porque vamos a usar también el teorema que vimos recién. Como es normal, a ver, vamos a implicar,",
        "start": 1408.04,
        "end": 1419.88
    },
    {
        "text": " pero estoy seguro que esto lo hicieron en práctico de galdo. Si es normal, entonces vamos a usar",
        "start": 1419.88,
        "end": 1429.2800000000002
    },
    {
        "text": " lo que hicimos recién, es unitariamente diagonalizable, ¿tá? Normal, entonces por el práctico 7,",
        "start": 1429.2800000000002,
        "end": 1439.8000000000002
    },
    {
        "text": " el ejercicio del práctico 7, que recién usamos dentro de la demostración, a es unitariamente diagonalizable.",
        "start": 1439.8000000000002,
        "end": 1446.64
    },
    {
        "text": " No digo nada que su valores propios sean, bueno, son los de A, está bien. Bien, pero los valores propiedades",
        "start": 1446.64,
        "end": 1462.8400000000001
    },
    {
        "text": " son reales, ¿no? Entonces como los valores propiedades son reales, las diagonal de 1, de N,",
        "start": 1462.84,
        "end": 1474.52
    },
    {
        "text": " verifica que los de A y parten es en A y R, porque los valores propios de A son los elementos de",
        "start": 1474.52,
        "end": 1486.24
    },
    {
        "text": " la diagonal de D. Bueno, entonces ya está la demostración porque ahora despejamos como",
        "start": 1486.24,
        "end": 1492.04
    },
    {
        "text": " bien hemos dicho acá la, que esta expresión se puede ver así o despejando de la otra manera,",
        "start": 1492.04,
        "end": 1497.68
    },
    {
        "text": " es lo mismo, entonces despejamos, sino queda U a t disco, A U igual D, no me sirve de",
        "start": 1497.68,
        "end": 1506.16
    },
    {
        "text": " despejar, otra vez directamente calculo A a t disco y A a t disco es U a t disco D, U a t disco,",
        "start": 1506.16,
        "end": 1516.4
    },
    {
        "text": " A a t disco, queda U a t disco, D a t disco, U a t disco, D, U a t disco y acá U y en el medio",
        "start": 1516.4,
        "end": 1526.3200000000002
    },
    {
        "text": " de despejado es D, porque todas sus coeficientes son reales, por esto tengo ese igualdad y por lo tanto",
        "start": 1526.32,
        "end": 1540.0
    },
    {
        "text": " esto es A y probamos que sea el mitial, o sea que A si se lo hicieron seguro que lo hicieron,",
        "start": 1540.0,
        "end": 1545.96
    },
    {
        "text": " no sé si de esta manera con lo de unitariamente de con el estable, pero de alguna manera similar en",
        "start": 1545.96,
        "end": 1551.32
    },
    {
        "text": " galdos o en práctico de galdos seguramente, así quiero que queda probar es A y B y B",
        "start": 1551.32,
        "end": 1562.5
    },
    {
        "text": " y B implicar, A implicar B es sencillo y B implicar es el rico de vuestro un poquito más, pero",
        "start": 1562.5,
        "end": 1569.32
    },
    {
        "text": " antes de irnos a implicar B, esto es un número no verdad, porque es maltrist por vector,",
        "start": 1569.32,
        "end": 1577.84
    },
    {
        "text": " te queda un vector parado, sí, columna, multiplicado por un vector, ha costado, te queda un número,",
        "start": 1577.84,
        "end": 1585.04
    },
    {
        "text": " lo que está diciendo que este número es real para todo EX, entonces A implicar B es muy sencillo,",
        "start": 1585.04,
        "end": 1595.52
    },
    {
        "text": " tomo el número EX, estrella AX y le hago el adjunto, hacerle el adjunto un número,",
        "start": 1595.52,
        "end": 1608.8
    },
    {
        "text": " esto es el conjuado, porque el transpuesto es lo mismo, una matriz uno por uno,",
        "start": 1608.8,
        "end": 1614.8
    },
    {
        "text": " entonces si yo pruebo que es el mismo, el conjuado porque es real, es el objetivo,",
        "start": 1614.8,
        "end": 1622.8799999999999
    },
    {
        "text": " pero que es el mismo, es el directo porque te queda EX asterisco, Asterisco, EX asterisco,",
        "start": 1622.88,
        "end": 1632.16
    },
    {
        "text": " pero esto es EX asterisco, Asterisco estoy en el potes y sea a ser mitiano, se me queda,",
        "start": 1632.16,
        "end": 1640.2800000000002
    },
    {
        "text": " y EX, entonces queda el conjuado es el mismo, si el conjuado es el mismo, entonces",
        "start": 1640.28,
        "end": 1649.72
    },
    {
        "text": " pertenece a er, sabemos que es un complejo, si el conjuado es el mismo, hay que decir que este,",
        "start": 1649.72,
        "end": 1657.88
    },
    {
        "text": " es muy cansado EX, vamos ahora al B implicar y seguramente estoy diciendo que cuando",
        "start": 1679.72,
        "end": 1699.24
    },
    {
        "text": " estás tan cansado en el relato de 6 errores, así que debemos estar diciendo un montón",
        "start": 1699.24,
        "end": 1706.44
    },
    {
        "text": " de errores, cuando lo vean o pueden fin, me da el cuenta, bueno este que este dos",
        "start": 1706.44,
        "end": 1716.44
    },
    {
        "text": " un poquito más de laburo pero, acá hay que ser un par de cuentas, nada, quiero probar",
        "start": 1716.44,
        "end": 1726.28
    },
    {
        "text": " que si verificamos que todos los productos esta manera siempre caen en los reales, resulta",
        "start": 1726.28,
        "end": 1733.16
    },
    {
        "text": " que la matriz es mi cane, entonces tomamos dos elementos cualquiera de CLAN, dos vectores",
        "start": 1733.16,
        "end": 1742.76
    },
    {
        "text": " de CLAN y lo tomo como un vector EX más y el vector para hacer cuenta va a servir esto,",
        "start": 1742.76,
        "end": 1750.72
    },
    {
        "text": " el EX más y es un vector cualquiera y lo tomo y yo sé que para cualquier vector esta",
        "start": 1750.72,
        "end": 1756.94
    },
    {
        "text": " ecuación siempre caen en los reales, entonces se hago ese producto, esto tiene que estar",
        "start": 1756.94,
        "end": 1768.18
    },
    {
        "text": " en los reales por hipótesis, pero damos cuentas, bueno por un lado es simplemente",
        "start": 1768.18,
        "end": 1781.46
    },
    {
        "text": " EX más y Asterisco Asterisco EX más y, al tomar el adjunto en este caso el conjugado",
        "start": 1781.46,
        "end": 1800.3
    },
    {
        "text": " porque es un número complejo, sé que caen los reales por lo tanto son iguales, bien",
        "start": 1800.3,
        "end": 1809.26
    },
    {
        "text": " entonces voy a hacer las cuentas, a la izquierda y la, ¿por qué?",
        "start": 1809.26,
        "end": 1816.26
    },
    {
        "text": " Al lado de EX, dado se quise, dos vectores cualquiera, yo tomo el asuma y uso que cualquier",
        "start": 1816.26,
        "end": 1825.74
    },
    {
        "text": " ecuación de estas maneras, si quieren acá en la hipótesis y le pongo Z si quieren, para",
        "start": 1825.74,
        "end": 1833.5
    },
    {
        "text": " que no se confunda, el EX más y es el Z, ¿no? Entonces yo sé que esto da en los reales",
        "start": 1833.5,
        "end": 1841.98
    },
    {
        "text": " por lo tanto el conjugado da en los reales también, no le puse Asterisco, ¿por qué",
        "start": 1841.98,
        "end": 1860.22
    },
    {
        "text": " es el conjugado? ¿Y entonces capaz que tenés que caer por tu...",
        "start": 1860.22,
        "end": 1867.22
    },
    {
        "text": " Ese pasa interme.",
        "start": 1867.22,
        "end": 1870.22
    },
    {
        "text": " Bueno, acá vamos cuentas pero me voy a arrar en un montón de cuentas, ¿vullice?",
        "start": 1870.22,
        "end": 1895.22
    },
    {
        "text": " A ver, por ejemplo, te queda EX estrella AX, bueno le voy a escribir por una vez,",
        "start": 1895.22,
        "end": 1919.22
    },
    {
        "text": " si no, quedó EX estrella AX, sí, la distributiva así.",
        "start": 1919.22,
        "end": 1926.22
    },
    {
        "text": " Y ahora ves a las cuantas de este lado, EX estrella AX, estrellas, lo estoy tratando",
        "start": 1949.22,
        "end": 1978.22
    },
    {
        "text": " de poner en el mismo orden, ahí va. ¿Qué me pueden decir? A ver lo el rojo para",
        "start": 1978.22,
        "end": 1992.22
    },
    {
        "text": " escuchar. ¿Esto será? Esto es un igual. Pero hay algunas cosas por",
        "start": 1992.22,
        "end": 2016.22
    },
    {
        "text": " lo menos que potachas. ¿Quién me empieza a decir? ¿Hay dos cosas por lo menos que potachas?",
        "start": 2016.22,
        "end": 2023.22
    },
    {
        "text": " Y después RV estánנס unautta y quiero showing servimos.",
        "start": 2023.22,
        "end": 2035.22
    },
    {
        "text": " Watch死, para que creíclado.",
        "start": 2035.22,
        "end": 2048.7400000000002
    },
    {
        "text": " para que quede claro, este del lado este y otro del otro. ¿Ve bien? Nosotros sabemos",
        "start": 2048.74,
        "end": 2057.66
    },
    {
        "text": " que son iguales a dos cosas porque ese es hipótesis, pero yo digo que acabo de atachar cosas",
        "start": 2057.66,
        "end": 2063.4399999999996
    },
    {
        "text": " que son iguales sumando a que son iguales. Por ejemplo, este es igual a este. ¿Por qué?",
        "start": 2063.4399999999996,
        "end": 2075.5
    },
    {
        "text": " Porque fuera aquí, fuera, el x, eso es un número real. Entonces, al ser un número real,",
        "start": 2079.1,
        "end": 2085.9799999999996
    },
    {
        "text": " cuando tomas el adjunto, es el mismo. O sea, hay decir que esto es real, en lo mismo que",
        "start": 2085.9799999999996,
        "end": 2096.1
    },
    {
        "text": " es zeta para cualquier zeta. Lo que yo, cuando tomas el adjunto, es una de los dos,",
        "start": 2096.1,
        "end": 2106.1
    },
    {
        "text": " no es una que da a quedar. Es si, no me acuerdo como si la cuenta ahora, pero había otro",
        "start": 2106.1,
        "end": 2115.86
    },
    {
        "text": " que se iba, ¿no? Es el último acá. Lo corto un mérden para que se quede bien claro,",
        "start": 2115.86,
        "end": 2121.02
    },
    {
        "text": " ¿cuál se va con cuál? Bueno, entonces, vamos a ver el resumen de lo que nos quedó",
        "start": 2121.02,
        "end": 2131.7
    },
    {
        "text": " simplemente para, para que quede más prolijo, ahora lo pongo todo un negro y a terisco a x,",
        "start": 2131.7,
        "end": 2139.46
    },
    {
        "text": " más x a terisco a y, es igual a y a terisco a terisco x, más x a terisco a terisco y.",
        "start": 2139.46,
        "end": 2150.54
    },
    {
        "text": " Bueno, y entonces simplemente tomar casos particulares ahora, empieza a ayudar, porque lo que",
        "start": 2157.3,
        "end": 2164.2200000000003
    },
    {
        "text": " quieres ver es que la matriz A y la adjunta es la misma. Me permite borrar acá porque ahora",
        "start": 2164.22,
        "end": 2172.9399999999996
    },
    {
        "text": " ya estamos en la última parte del B implicada, o sea, que ya sabemos a dónde queremos llegar,",
        "start": 2172.9399999999996,
        "end": 2178.98
    },
    {
        "text": " la terisco y tipo, o esto. En los objetivos probar que una matriz A y su adjunta es la misma,",
        "start": 2178.98,
        "end": 2189.7
    },
    {
        "text": " entonces tengo que mirar los coeficiente, si para que aparecan los coeficiente,",
        "start": 2190.22,
        "end": 2193.54
    },
    {
        "text": " se empieza a jugar con el i, con el x, con vector conocidos, entonces por ejemplo, dice.",
        "start": 2193.54,
        "end": 2198.3399999999997
    },
    {
        "text": " Tomamos, x es un k e y es un j.",
        "start": 2201.2999999999997,
        "end": 2209.22
    },
    {
        "text": " No, pero yo no sé si es real eso, porque siempre tiene que ser el mismo,",
        "start": 2219.7,
        "end": 2237.7
    },
    {
        "text": " tiene que ser el mismo de lo lado, por eso pusimos aquí, más x más y para jugar ahora,",
        "start": 2237.7,
        "end": 2243.7799999999997
    },
    {
        "text": " obtuvimos esta ecuación. Bueno, pero si Tomo x es su k, entonces que te queda ver,",
        "start": 2244.3,
        "end": 2251.1400000000003
    },
    {
        "text": " x es 3, a y queda es su k, tra puesto, por a, por su j, más y es 3, a x queda,",
        "start": 2253.94,
        "end": 2268.7400000000002
    },
    {
        "text": " como no le cambia el nombre, tomar casos especiales. Bueno, pero ¿cuánto te da esto?",
        "start": 2268.74,
        "end": 2284.3799999999997
    },
    {
        "text": " Este tiene 0, 0, 0, 0, 0, 0, 0, 1 en la k, 0, 0, 0, 0, 0, 0, 0,",
        "start": 2286.3799999999997,
        "end": 2291.74
    },
    {
        "text": " No es en tojadillo, es el es, pintó por el nombre, bueno, esto cuando te da,",
        "start": 2291.74,
        "end": 2305.9799999999996
    },
    {
        "text": " te lo utilices, la suma de todos, este cuando da, este da y la sumca j, ¿no? Y este da",
        "start": 2305.98,
        "end": 2314.14
    },
    {
        "text": " el a su j, acá. Esto es del lado izquierdo y del lado derecho, quedó x es 3, a 3, y o sea,",
        "start": 2314.14,
        "end": 2334.7400000000002
    },
    {
        "text": " quedó su k, tra puesto, por a, es 3, a, es su j, más y es 3, a, es 3, x es su j, tra puesto,",
        "start": 2334.74,
        "end": 2351.7799999999997
    },
    {
        "text": " trae 3, a, por su k, y esto es a su j, acá, con jugado, más a su k, con jugado.",
        "start": 2351.78,
        "end": 2368.78
    },
    {
        "text": " Revisen, por favor.",
        "start": 2369.78,
        "end": 2371.38
    },
    {
        "text": " Acá, acá j, acá, sí, acá, los con jugados.",
        "start": 2382.78,
        "end": 2386.94
    },
    {
        "text": " Entonces, ¿qué pasa? digo acá se saca con conclusión, pero lo había escribido.",
        "start": 2390.78,
        "end": 2395.3
    },
    {
        "text": " Supone que acá j, estoy a poner el mismo acá, es c, más de y, es un número complejo,",
        "start": 2396.3,
        "end": 2403.0
    },
    {
        "text": " se me ha dicho, ya su j, acá, se prima más, de prima y, ¿qué? Entonces, de este",
        "start": 2403.0,
        "end": 2410.6200000000003
    },
    {
        "text": " lado que te quedó, se más se prima más, de más de prima y, y del otro lado, me quedó,",
        "start": 2410.62,
        "end": 2426.14
    },
    {
        "text": " se más se prima, menos de más de prima y, ¿ok? Bueno, ya casi sacamos que de más",
        "start": 2426.14,
        "end": 2437.66
    },
    {
        "text": " de prima cero, o sea que, sí, los veitores x y son en c, a la n.",
        "start": 2437.66,
        "end": 2454.74
    },
    {
        "text": " Entonces, nos pide acá, acá, la cuenta generica, pero en ese momento ya tomé x igual",
        "start": 2454.74,
        "end": 2470.22
    },
    {
        "text": " es su k, y igual es su j, no, pero es su k, es el, es su k, es el 0, 1, 0, 0, 0, acá",
        "start": 2470.22,
        "end": 2485.02
    },
    {
        "text": " en el lugar k, y el es su j, en lo mismo, pero, 1, 1, en el lugar j, eso es lo especialicé",
        "start": 2485.02,
        "end": 2499.82
    },
    {
        "text": " digamos. Por eso, y la cuenta es, es general, para después empezar a pivotiar en diferentes",
        "start": 2499.82,
        "end": 2506.46
    },
    {
        "text": " elementos y empezar a sacar conclusiones, acá tomamos x igual es su k, y igual es su j,",
        "start": 2506.46,
        "end": 2511.62
    },
    {
        "text": " y sacamos algunas conclusiones, por ejemplo, acá, este, este, este, este, este, le voy",
        "start": 2511.62,
        "end": 2527.22
    },
    {
        "text": " a poner en rojo para que entiendan, digamos, que tomemos, especialicé, así, ahora les",
        "start": 2527.22,
        "end": 2537.22
    },
    {
        "text": " propongo, esto no va a hacer las cuentas, pero ustedes dejen espacio y daran las cuentas",
        "start": 2537.22,
        "end": 2541.4599999999996
    },
    {
        "text": " tranquilos, les propongo tomar ahora x igual y por su k, ves este Santiago, por eso necesito",
        "start": 2541.4599999999996,
        "end": 2550.3799999999997
    },
    {
        "text": " que sean complejos, porque ahora voy a tomar x igual y por su k, o sea, en realidad este",
        "start": 2550.3799999999997,
        "end": 2556.7
    },
    {
        "text": " es 0, acá y y cero en el resto, en verdad, en el y está en el lugar k, y voy a tomar,",
        "start": 2556.7,
        "end": 2568.46
    },
    {
        "text": " ustedes tomen y igual es su j, él iría a hacer el mismo y entonces hacen todas las cuentas",
        "start": 2568.46,
        "end": 2579.74
    },
    {
        "text": " y sacan, van a por sacar que c es igual a c prima, hay que soltar las cuentas y sacan",
        "start": 2579.74,
        "end": 2589.3399999999997
    },
    {
        "text": " que c es igual a c prima, pero si c es igual a c prima y la d es la opuesta, que quiere",
        "start": 2589.3399999999997,
        "end": 2594.8199999999997
    },
    {
        "text": " decir que una es la conjua del otro, a ver, tengo esto, tengo esto, tengo esta conclusión",
        "start": 2594.8199999999997,
        "end": 2606.02
    },
    {
        "text": " que ustedes dejen las líneas pasar la cuenta y tengo esta conclusión, entonces la conclusión",
        "start": 2606.02,
        "end": 2617.7
    },
    {
        "text": " final es que a su k j, esa es su j acá con jugado y así esto es para cualquier k y j, yo",
        "start": 2617.7,
        "end": 2633.86
    },
    {
        "text": " acá tome el k y j es genérico, uris, por lo tanto esto vale para todo k y j, por lo tanto",
        "start": 2633.86,
        "end": 2641.98
    },
    {
        "text": " a es igual a junto, la amostación es muy bonita, un poquito de cuenta, pero es muy bonita",
        "start": 2641.98,
        "end": 2651.38
    },
    {
        "text": " porque después de empezar a pivotear, y nosotros el dijimos esto vale, pero tomando otro",
        "start": 2651.38,
        "end": 2656.9
    },
    {
        "text": " valor también si sigan la misma conclusión. Sí, debe haber otras demostraciones, ¿eh?",
        "start": 2656.9,
        "end": 2676.94
    },
    {
        "text": " Sí, debe haber otras demostraciones, no estaba mirando que en realidad nosotros hicimos,",
        "start": 2676.94,
        "end": 2682.12
    },
    {
        "text": " sí, que nosotros hicimos, así solo sí sé y así solo sí ve, eso es suficiente por",
        "start": 2682.12,
        "end": 2691.2799999999997
    },
    {
        "text": " supuesto para la equivalencia, pero el libro les digo por si quieran leer el libro, el",
        "start": 2691.2799999999997,
        "end": 2697.0
    },
    {
        "text": " libro hace así solo sí ve, a implica C y se implica B, es un poquito distinto, capaz",
        "start": 2697.0,
        "end": 2709.3199999999997
    },
    {
        "text": " de la pena leer, se implica B, nosotros lo hicimos, ¿eh? Ni me acordaba que estaba así,",
        "start": 2709.32,
        "end": 2715.56
    },
    {
        "text": " lo hicimos recién hace un rato, lo hicimos directo de otra manera. La pena es que la",
        "start": 2715.56,
        "end": 2727.56
    },
    {
        "text": " cuenta de se implica B la necesito para el siguiente teorema, pero la haré dentro del teorema",
        "start": 2727.56,
        "end": 2732.04
    },
    {
        "text": " siguiente de la demostración y chao ¿eh? No, la cuenta, la cuenta de la demostración,",
        "start": 2732.04,
        "end": 2738.2000000000003
    },
    {
        "text": " no lo he resultado, la cuenta. Bueno y bueno por último para cerrar, a ver si me da el tiempo,",
        "start": 2738.2,
        "end": 2743.72
    },
    {
        "text": " sí, nos da el tiempo, vamos a hacer el último teoremita y terminamos el capítulo,",
        "start": 2747.3199999999997,
        "end": 2752.3999999999996
    },
    {
        "text": " terminamos matrices sermítilas y terminamos también el capítulo, salvieron, empezamos con",
        "start": 2752.3999999999996,
        "end": 2760.12
    },
    {
        "text": " conos, conos invariantes y apuntando el teorema perrón Frobellons.",
        "start": 2760.12,
        "end": 2767.44
    },
    {
        "text": " Y ahora vamos a hacer un poco de la fecha, vamos a hacer un poco de la fecha, vamos a hacer un poco de la fecha,",
        "start": 2790.12,
        "end": 2799.44
    },
    {
        "text": " vamos a hacer un poco de la fecha, vamos a hacer un poco de la fecha, vamos a hacer un poco de la fecha,",
        "start": 2799.44,
        "end": 2808.44
    },
    {
        "text": " el último teorema dentro de",
        "start": 2808.44,
        "end": 2835.8
    },
    {
        "text": " este tema, probablemente también tengan noticia de años anteriores, así que ya les voy",
        "start": 2839.0,
        "end": 2853.56
    },
    {
        "text": " preguntando, les suena este nombre Ray Lechrich, ¿no? Y de práctico tampoco.",
        "start": 2853.56,
        "end": 2859.92
    },
    {
        "text": " Bueno, estamos dentro del tema matrices sermítianas, entonces tenemos una matriz",
        "start": 2859.92,
        "end": 2871.2000000000003
    },
    {
        "text": " de coeficiente complejos pero ver mi tiana, sí, por lo tanto los valores propios son reales,",
        "start": 2871.2000000000003,
        "end": 2883.8
    },
    {
        "text": " bien, si los valores propios son reales, lo podemos ubicar en la recta de los reales y habrá,",
        "start": 2884.8,
        "end": 2893.92
    },
    {
        "text": " podemos ordenarlos, un lambda 1, un lambda 2, un lambda n, quiere decir, hay un nombre que es el",
        "start": 2893.92,
        "end": 2902.96
    },
    {
        "text": " mínimo y otro que es el máximo, ojo, pueden haber repetidos por supuesto, ¿no? ¿no? pueden haber varios",
        "start": 2902.96,
        "end": 2910.44
    },
    {
        "text": " máximos, pueden repetirse. El teorema de Ray Lechrich, lo que dice,",
        "start": 2910.44,
        "end": 2917.28
    },
    {
        "text": " te dice, ¿dónde subican? Este es el espectro, ¿no? O sea, el conjunto de lambda 1,",
        "start": 2917.28,
        "end": 2929.12
    },
    {
        "text": " lambda 2, lambda n, es el espectro de a, que como es sermítriana, está dentro de los reales.",
        "start": 2929.12,
        "end": 2937.96
    },
    {
        "text": " Y entonces el teorema de Ray Lechrich te lo subica, ¿no? Y te dice, bueno, en esta situación",
        "start": 2940.44,
        "end": 2946.2400000000002
    },
    {
        "text": " no voy a poner toda la hipótesis de vuelta, esta es la hipótesis, yo no matréis en mi tiana,",
        "start": 2946.2400000000002,
        "end": 2950.28
    },
    {
        "text": " estos son sus valores propios, si está en ordenado de esta manera, entonces, sí,",
        "start": 2950.28,
        "end": 2958.56
    },
    {
        "text": " ¿no podrían repetirse? ¿Están ordenados, pero podría repetirse, lo pasa que en el dibujo",
        "start": 2958.56,
        "end": 2970.0
    },
    {
        "text": " tendría que poner si no, podría repetirse. Entonces, lo que dice el teorema es que lambda",
        "start": 2970.0,
        "end": 2977.48
    },
    {
        "text": " 1, el menor valor propio se obtiene como el mínimo, estos son numeritos, y estos numeritos",
        "start": 2977.48,
        "end": 2997.64
    },
    {
        "text": " según lo que vimos recién en el teorema anterior son reales, siempre, en particular",
        "start": 2997.64,
        "end": 3003.8399999999997
    },
    {
        "text": " para lo que, en el caso de la norma sea 1, o sea, acá no juega, que sea un número real,",
        "start": 3003.8399999999997,
        "end": 3009.8399999999997
    },
    {
        "text": " este es un conjunto de numeros reales, al ser un conjunto de numeros reales tiene sentido",
        "start": 3009.8399999999997,
        "end": 3013.0
    },
    {
        "text": " hablar de mínimo, porque yo no puedo hablar de mínimo si estoy moviéndome en los complejos,",
        "start": 3013.0,
        "end": 3018.12
    },
    {
        "text": " a hacer que ponga norma, ¿no? Normal en cada uno de ellos, pero está, ¿es entendió",
        "start": 3018.12,
        "end": 3023.7599999999998
    },
    {
        "text": " que tiene sentido esto? Bueno, esto tiene sentido y a más estoy variando el X solamente",
        "start": 3023.76,
        "end": 3028.8
    },
    {
        "text": " en la espera, o sea, el X pertenece hacia la N, pero tiene norma 1, o sea que estás",
        "start": 3028.8,
        "end": 3039.32
    },
    {
        "text": " en esa la N, en la espera, los factores norma 1 en el espacio de N dimensión, y el lambda",
        "start": 3039.32,
        "end": 3048.7200000000003
    },
    {
        "text": " el N es el mismo, estamos hablando hacia la N, hacia la N, estamos hablando el lambda",
        "start": 3049.72,
        "end": 3054.24
    },
    {
        "text": " N, es el mismo N, el último de los valores propios, el más grande es el máximo justamente",
        "start": 3054.24,
        "end": 3060.7599999999998
    },
    {
        "text": " de la misma, de la misma ecuación, y el resumen del resultado se lea así, que se le",
        "start": 3060.7599999999998,
        "end": 3075.7599999999998
    },
    {
        "text": " está muy bonito, el espectro de A está dentro del intervalo, la lambda 1, la lambda N, y esto",
        "start": 3075.76,
        "end": 3088.48
    },
    {
        "text": " a la vez, quizás una de las partes que no va a dar más trabajo de mostrar este último",
        "start": 3088.48,
        "end": 3106.72
    },
    {
        "text": " igual, este último igual dice un montón de cosas, fíjense lo que está diciendo el último",
        "start": 3106.72,
        "end": 3112.76
    },
    {
        "text": " igual, ponéle que ya probaste que el lambda 1 es más chico, ponéle que ya probaste que",
        "start": 3112.76,
        "end": 3118.16
    },
    {
        "text": " el lambda N es el más grande, entonces lo que sabes es que cuando vos hagas todas estas",
        "start": 3118.16,
        "end": 3123.02
    },
    {
        "text": " cuentas, estos números, estos productos, los más chicos de la N es el más grande de la",
        "start": 3123.02,
        "end": 3128.72
    },
    {
        "text": " N, pero acá está diciendo que es igual, o sea que se enazza todo el intervalo, no solamente",
        "start": 3128.72,
        "end": 3134.72
    },
    {
        "text": " que se gaza el lambda 1 y que se gaza el lambda N, sino que se gaza cualquier número entre",
        "start": 3134.72,
        "end": 3138.48
    },
    {
        "text": " el lambda 1 y el lambda N de esta manera, sí claro, de los dos lados, a infinito, porque",
        "start": 3138.48,
        "end": 3146.08
    },
    {
        "text": " el X se mueve en la espera, no, el espectro es infinito y este está dentro del intervalo",
        "start": 3146.08,
        "end": 3155.56
    },
    {
        "text": " que es infinito, pero este intervalo se llena con estos números, que se calculan de esta",
        "start": 3155.56,
        "end": 3164.48
    },
    {
        "text": " manera, completas todo el intervalo de esta bala, alguno de ellos son los valores propios,",
        "start": 3164.48,
        "end": 3171.84
    },
    {
        "text": " justamente, bueno hagamos en ese pizarro en sito de las cuentas, que son sencillas,",
        "start": 3171.84,
        "end": 3177.1200000000003
    },
    {
        "text": " pero son muy bonitas y con eso se cierra toda esta sección y nos queda dos semanas y",
        "start": 3177.1200000000003,
        "end": 3187.32
    },
    {
        "text": " media para hablar conozco perro en provenios y grafos.",
        "start": 3187.32,
        "end": 3208.36
    },
    {
        "text": " Bueno, demostración, como hay ser mitiana, entonces es unitariamente diagonalizable, por lo",
        "start": 3208.36,
        "end": 3222.04
    },
    {
        "text": " tanto existe U, esto ya le hemos usado, unitaria, tal que U asterisco a U es de, creo que en general",
        "start": 3222.04,
        "end": 3234.2000000000003
    },
    {
        "text": " le hemos usado al revés, no sé de qué manera de la viewsar, voy a ponerlo.",
        "start": 3234.2,
        "end": 3249.08
    },
    {
        "text": " Con dé además, justamente los valores propios, hay algún problema, no sé si lo ven, están",
        "start": 3249.08,
        "end": 3263.3199999999997
    },
    {
        "text": " de acuerdo que popo en el evaluador de propio, primero que nada que, yo no sé todavía,",
        "start": 3263.32,
        "end": 3267.44
    },
    {
        "text": " tal, ni por lo, suponete que teóricamente se sabe que estos son los valores propios,",
        "start": 3267.44,
        "end": 3272.2400000000002
    },
    {
        "text": " teóricamente lambda 1 es más chico, lambda n es más grande y que desprobar todo esto",
        "start": 3272.2400000000002,
        "end": 3275.92
    },
    {
        "text": " el medio, se dan cuenta que acá no es problema en poner esto así, ¿no verdad? Porque si",
        "start": 3275.92,
        "end": 3280.96
    },
    {
        "text": " justo la diagonal no te quedó en lambda 1, que se vea bien, lambda 1, lambda 2, lambda n,",
        "start": 3280.96,
        "end": 3293.36
    },
    {
        "text": " cambia los índices, si te quedó en lambda 2, lambda 7, lambda n, lambda 3, lo reordenas",
        "start": 3293.36,
        "end": 3300.4
    },
    {
        "text": " la matriz y la U también, le cambia la fila de la columna, la permutada de tal manera",
        "start": 3300.4,
        "end": 3304.08
    },
    {
        "text": " que queda en el tamaño, así, o sea eso no va, le cambias la fila, ¿eh? Sí, sí, sí,",
        "start": 3304.08,
        "end": 3311.08
    },
    {
        "text": " sí, sigue siendo unitario, sí, sí, sí porque cambias y cambias también en la junta,",
        "start": 3311.08,
        "end": 3316.68
    },
    {
        "text": " ¿no verdad? De lo de lado, y si no, no sé, complique, si quieren, acá no tienen por",
        "start": 3316.68,
        "end": 3323.08
    },
    {
        "text": " que estar ordenados, no, no, no, no nos va a generar ningún problema, simplemente porque",
        "start": 3323.08,
        "end": 3327.88
    },
    {
        "text": " queda más fácil hacer las cuentas.",
        "start": 3327.88,
        "end": 3329.84
    },
    {
        "text": " Bueno, esto es lo que decía que la última que en la demostración del último teorema",
        "start": 3329.84,
        "end": 3336.1200000000003
    },
    {
        "text": " no hicimos la demostración que estrella el libro y lo primero que hace esta demostración",
        "start": 3336.1200000000003,
        "end": 3339.6800000000003
    },
    {
        "text": " es usar las cuentas de ese otro, pero no hagamos las cuentas en este momento. El",
        "start": 3339.6800000000003,
        "end": 3345.28
    },
    {
        "text": " X asterisco a X lo vamos a escribir a partir del dato que a es UdU, que queda X asterisco,",
        "start": 3345.28,
        "end": 3362.52
    },
    {
        "text": " que es un problema, ¿no?",
        "start": 3362.52,
        "end": 3369.52
    },
    {
        "text": " Vire, acá una trampita de la estípica de cálculo, multiplico y divido por lo mismo,",
        "start": 3369.52,
        "end": 3375.7599999999998
    },
    {
        "text": " ¿sí acuerdan? Simplemente, un porú asterico es 1, entonces multiplico porú y porú a",
        "start": 3375.7599999999998,
        "end": 3388.4
    },
    {
        "text": " 0 por U y sin verza. Y esto, digamos, asocio de esta manera, permítame asociar a",
        "start": 3388.4,
        "end": 3397.04
    },
    {
        "text": " el camismo, así ya, X asterisco U y U asterisco X, está bien. Y a X asterisco U, si",
        "start": 3397.04,
        "end": 3406.52
    },
    {
        "text": " me permite lo voy a llamar a U asterisco X mejor, U asterisco X lo llamó Y para cortar",
        "start": 3406.52,
        "end": 3415.0
    },
    {
        "text": " un poquito, a cortar el nombre. Entonces, esto último me quedó a ver y asterisco el",
        "start": 3415.0,
        "end": 3426.04
    },
    {
        "text": " del medio de y de la derecha Y, ¿sabes? Entonces, ponerle que el I tiene coordenadas",
        "start": 3426.04,
        "end": 3441.28
    },
    {
        "text": " y subo uno y subo con el nombre I suene. Entonces, esto que está acá, este queda I subo",
        "start": 3441.28,
        "end": 3458.0
    },
    {
        "text": " con jugado y subo con jugado y subo con jugado, la matriz diagonal, la voy a escribir simplemente",
        "start": 3458.0,
        "end": 3465.84
    },
    {
        "text": " para que se vea lo que voy a hacer después y acá el I subo y subo.",
        "start": 3465.84,
        "end": 3475.4
    },
    {
        "text": " Está, entonces yo creo que nadie va a dudar que la cuantita esta, esa cuantita final",
        "start": 3475.4,
        "end": 3483.76
    },
    {
        "text": " nos queda así. La suma tooria de igual 1 está N, del Amna Sui, por I subo con U a",
        "start": 3483.76,
        "end": 3492.2000000000003
    },
    {
        "text": " C, que es su número real, que es su número real, porque los módulos acuados a",
        "start": 3492.2,
        "end": 3506.14
    },
    {
        "text": " número real y los lambas de ahí son los valores propiedades que son reales, entonces",
        "start": 3506.14,
        "end": 3510.2
    },
    {
        "text": " eso es su número. Bueno, muy bien. Ahora bien, esto último, lo voy a escribir acá,",
        "start": 3510.2,
        "end": 3522.7999999999997
    },
    {
        "text": " de vuelta para... No estoy escribiendo nada nuevo pero que necesito que después visualizan",
        "start": 3522.7999999999997,
        "end": 3528.7599999999998
    },
    {
        "text": " lo que voy a hacer. Entonces, toda la cuenta de larga, la redujo a el comienzo y al final",
        "start": 3528.7599999999998,
        "end": 3537.7599999999998
    },
    {
        "text": " que ven ahora los pasos que voy a dar, este es el primer término y ese es el último",
        "start": 3537.76,
        "end": 3541.3
    },
    {
        "text": " término que llegamos. Y entonces esto... Y esto es menor igual, voy a hacer la misma cuenta",
        "start": 3541.3,
        "end": 3561.2000000000003
    },
    {
        "text": " pero, o sea el lambda 1 era el más chico, se acuerdan. Entonces, igual 1 está N,",
        "start": 3561.2,
        "end": 3570.56
    },
    {
        "text": " de I subida, el cuadrado, y acá el lambda N es el más grande, lambda N, lambda N, de I subida",
        "start": 3570.56,
        "end": 3582.6
    },
    {
        "text": " en cuadrado. Bien. Esto... Me permite mostrarles algo así, me ahorro una cuenta, una cuenta, me",
        "start": 3582.6,
        "end": 3597.64
    },
    {
        "text": " ahorro. Borro y vuelvo a poner, miren acá, qué vino y frasico. Voy a sacar el lambda 1, después",
        "start": 3597.64,
        "end": 3605.6
    },
    {
        "text": " lo vuelvo a poner, ¿tá? Esto, si yo hago esto solito, es lo mismo que haber hecho",
        "start": 3605.6,
        "end": 3611.96
    },
    {
        "text": " este por este, si la matriz en medio de una verdad, te dan de acuerdo, o sea, le vuelvo",
        "start": 3611.96,
        "end": 3617.18
    },
    {
        "text": " a poner el lambda 1 porque ya lo vieron, el lambda 1 multiplicató, pero esto es el producto",
        "start": 3617.18,
        "end": 3622.72
    },
    {
        "text": " y este quién era? Era el I asterisco, y este era el I, o sea, 1 es X asterisco, U, U asterisco",
        "start": 3622.72,
        "end": 3631.08
    },
    {
        "text": " X, aja, eso es lo que voy a poner, lambda 1 por X asterisco U, U asterisco X. El lambda",
        "start": 3631.08,
        "end": 3642.3199999999997
    },
    {
        "text": " 1 está fuera, como que el lambda 1 ya no nos molestó. ¿Cuánto da U por U asterisco?",
        "start": 3642.3199999999997,
        "end": 3651.52
    },
    {
        "text": " La identidad porque es unitaria, ¿no verdad? O sea que esto me quedó lambda 1 X asterisco",
        "start": 3651.52,
        "end": 3657.7599999999998
    },
    {
        "text": " X, y ¿cuánto da X asterisco X? La norma de X se acuerda, ¿no? O sea que esto es",
        "start": 3657.76,
        "end": 3667.6400000000003
    },
    {
        "text": " la lambda 1 por la norma de X a cuadra. La misma cuenta de la imagina en la derecha,",
        "start": 3667.6400000000003,
        "end": 3673.28
    },
    {
        "text": " es exactamente la misma cuenta con el lambda N, me ahorro varios pasos y esto me quedó",
        "start": 3673.28,
        "end": 3678.6200000000003
    },
    {
        "text": " lambda N por la norma de X a cuadra. Es la misma cuenta que para el trola, lo para esto.",
        "start": 3678.6200000000003,
        "end": 3686.48
    },
    {
        "text": " La N que queda claro que es la lambda N. Bueno, gurise, resumimos toda esta cadena de",
        "start": 3686.48,
        "end": 3694.32
    },
    {
        "text": " sigueldades, la redujo, quiere decir, la pongo cortita para que se vea bien.",
        "start": 3694.32,
        "end": 3699.12
    },
    {
        "text": " ¿Esta es sigueldades porque la causa el mínimo de la alta? Sí, señor. Y vieron que",
        "start": 3699.12,
        "end": 3714.04
    },
    {
        "text": " no importa el orden de la diagonal, ¿no? Porque en la sumatoria no importa que sea el primero",
        "start": 3714.04,
        "end": 3719.2
    },
    {
        "text": " de la lambda 1, puede ser el de Simulta o el de igual. Bueno, hasta acá vamos bien, ¿no",
        "start": 3719.2,
        "end": 3727.84
    },
    {
        "text": " verdad? Pero ¿pós tenés que tomar cualquier vector X? No, estamos tomando vectores de norma",
        "start": 3727.84,
        "end": 3732.8
    },
    {
        "text": " 1. Entonces, en este momento, recordemos eso, tomando que lo que necesitamos para la TZ,",
        "start": 3732.8,
        "end": 3743.04
    },
    {
        "text": " furtores X de norma 1, entonces la de igual, le queda así.",
        "start": 3743.06,
        "end": 3748.2799999999997
    },
    {
        "text": " Vamos muy bien, ok, tomando esto ya vamos a tratar y casi que estamos en el final de la",
        "start": 3748.28,
        "end": 3776.28
    },
    {
        "text": " demostración. Primero de talles que tiene que ver con la pregunta que hicieron hace un rato,",
        "start": 3776.28,
        "end": 3781.86
    },
    {
        "text": " barbaro, todos estos productos están entre el anda 1 y el anda n, venimos muy bien cuando la",
        "start": 3781.86,
        "end": 3790.0
    },
    {
        "text": " norma diquise su uno, pero una cosa que nos gustaría ver es que realmente se obtienen los otros",
        "start": 3790.0,
        "end": 3796.0
    },
    {
        "text": " valores propios también y además queremos ver que no se le metes obtienen, que se obtienen todos",
        "start": 3796.0,
        "end": 3802.1200000000003
    },
    {
        "text": " los coeficientes entre el anda 1, en todos los números entre el anda 1 y el anda n,",
        "start": 3802.12,
        "end": 3806.68
    },
    {
        "text": " lo voy a ser separado aunque podría ser solo el final digamos porque si se obtienen todos los",
        "start": 3806.68,
        "end": 3812.3199999999997
    },
    {
        "text": " números se obtienen todos los valores propios, porque los valores propios están entre el anda 1 y el",
        "start": 3812.3199999999997,
        "end": 3817.7999999999997
    },
    {
        "text": " anda n, pero ahora vamos por gusto, hagamos específicamente para los valores propios aunque no",
        "start": 3817.7999999999997,
        "end": 3825.08
    },
    {
        "text": " sería necesario, entonces si landa y es valor propio o uno cualquiera de lo que está en el medio,",
        "start": 3825.08,
        "end": 3830.64
    },
    {
        "text": " entonces tiene un vector propio, xy y están de acuerdo que si tienes un vector, esto lo hemos visto",
        "start": 3835.3199999999997,
        "end": 3846.44
    },
    {
        "text": " 1000 veces, lo hemos usado 1000 veces, si tienes un vector propio pues tomar hay muchos",
        "start": 3846.44,
        "end": 3853.08
    },
    {
        "text": " vectores propias asociados multiplicando por cualquier coeficiente te queda vector propio,",
        "start": 3853.08,
        "end": 3858.96
    },
    {
        "text": " entonces le puede hacer de norma 1, o sea puede tomar un vector propio de norma 1,",
        "start": 3858.96,
        "end": 3863.52
    },
    {
        "text": " o sea x1 de norma 1 tal que xy de norma 1 tal que a por xy es lambda y por xy,",
        "start": 3869.64,
        "end": 3881.56
    },
    {
        "text": " entonces cuando te queda vamos a hacer la cuenta juntos x estresa y por a xy,",
        "start": 3884.08,
        "end": 3892.44
    },
    {
        "text": " hagamos la cuenta juntos muy sencillo pero lo que quiero decir es nosotros queríamos saber si",
        "start": 3897.44,
        "end": 3902.68
    },
    {
        "text": " de esta manera haciendo el producto x estresa a x obtenemos todos los valores propios, de hecho queremos",
        "start": 3902.68,
        "end": 3908.44
    },
    {
        "text": " probar más que tenemos que encontrar todos los números en la anda 1 y lambda n,",
        "start": 3908.44,
        "end": 3912.2400000000002
    },
    {
        "text": " barbaro pero hagámoslo específicamente para los valores propios y es muy sencillo porque acá",
        "start": 3912.2400000000002,
        "end": 3918.04
    },
    {
        "text": " lo encontraste para los propios porque te quedó en medio de a por x y te queda lambda y y y",
        "start": 3918.04,
        "end": 3923.6
    },
    {
        "text": " queda x y estresa por lambda y que es un número por xy, el lambda y va para adelante,",
        "start": 3923.6,
        "end": 3930.66
    },
    {
        "text": " te quedó de lambda y por x y estresa por xy que es la norma de xy al cuadrado que es 1,",
        "start": 3930.66,
        "end": 3936.32
    },
    {
        "text": " o sea que te quedó en la anda y entonces explícitamente mostraste que de esta manera se gaza",
        "start": 3936.32,
        "end": 3941.2400000000002
    },
    {
        "text": " todos los valores propios, pero más aún queremos probar que sigamos a todos los números entre",
        "start": 3941.2400000000002,
        "end": 3950.6000000000004
    },
    {
        "text": " el anda 1 y lambda n y eso también es sencillo, es muy bonito este tema, por lo que leí estos",
        "start": 3950.6000000000004,
        "end": 3962.2200000000003
    },
    {
        "text": " muchachos, Rayleigh y Ritz no eran matemáticos sino que eran físicos y el final de la demostración",
        "start": 3962.22,
        "end": 3971.5
    },
    {
        "text": " es este igual que yo les comenté hace un rato de ley, acá vamos a probar, ¿urices hasta acá?",
        "start": 3971.5,
        "end": 3979.22
    },
    {
        "text": " ¿Qué probamos cuando teníamos esto? Esta inclusión que todos aquellos valores están acá",
        "start": 3979.22,
        "end": 3987.22
    },
    {
        "text": " dentro, pero ahora quiero probar el igual, acá probamos que cuando vovas variando acá,",
        "start": 3987.22,
        "end": 3997.1
    },
    {
        "text": " te van quedando siempre dentro del intervalo, pero ahora un argumento simplemente,",
        "start": 3997.1,
        "end": 4005.8199999999997
    },
    {
        "text": " hemos hecho varias veces a rumeta este tipo, si la función es esta, que al x ya soció",
        "start": 4005.82,
        "end": 4016.86
    },
    {
        "text": " x estresa a x, ya sabemos que esto es un número real, ¿cómo es la cosa?",
        "start": 4016.86,
        "end": 4023.1800000000003
    },
    {
        "text": " Vamos a analizar un poquito, el cía la n, voy a cía la n,",
        "start": 4024.78,
        "end": 4028.5
    },
    {
        "text": " y tomo el x y lo multiplico por la, primer paso, eso es una función continua, ¿no?",
        "start": 4028.5,
        "end": 4036.06
    },
    {
        "text": " ¿no? Y después último paso, a la por x lo multiplico por x estresa, por supuesto",
        "start": 4036.06,
        "end": 4044.82
    },
    {
        "text": " que en conjuar, al tomar x estresa eso sigue siendo continua y cuando hagamos el producto",
        "start": 4044.82,
        "end": 4056.38
    },
    {
        "text": " es sigue siendo de transformación niña, o sea esto es una transformación niña, ahora",
        "start": 4056.38,
        "end": 4061.9
    },
    {
        "text": " a x es un vector, multiplicado por x estresa es un producto interno, es una transformación niña,",
        "start": 4061.9,
        "end": 4066.06
    },
    {
        "text": " esto se composición, esto sigue siendo continua, ¿no? Entonces esta función es continua,",
        "start": 4066.06,
        "end": 4076.62
    },
    {
        "text": " composición de continua, se continua, acá dentro está es la n, es la n, recuerdos son los",
        "start": 4077.3399999999997,
        "end": 4088.14
    },
    {
        "text": " vectores normales, ¿no? ¿cómo es este conjunto? Es el n, acotado y cerrado, cerrado",
        "start": 4088.14,
        "end": 4102.82
    },
    {
        "text": " y acotado, ¿no? Es el estípico ejemplo de cálculo 2, ¿no? Y lo que vino en cálculo 3 también,",
        "start": 4102.82,
        "end": 4107.0599999999995
    },
    {
        "text": " eso es un compato esto, es un cerrado y acotado y además el concepto del otro que manejamos",
        "start": 4107.780000000001,
        "end": 4123.02
    },
    {
        "text": " juntos es arco con x con x, ¿no? Pero se acuerda que usted me se anotar que el concepto que conoce",
        "start": 4123.02,
        "end": 4130.580000000001
    },
    {
        "text": " a ustedes es de arco con x y es completamente equivalente en sea la n, o sea que es arco con x,",
        "start": 4130.58,
        "end": 4135.74
    },
    {
        "text": " bueno la imagen a través de una función continua de un conjunto compacto y arco con x o la",
        "start": 4138.22,
        "end": 4144.82
    },
    {
        "text": " imagen o sea cdcn como cúes continua, como cúes continua cdcn también es compacto y arco con x",
        "start": 4144.82,
        "end": 4163.0199999999995
    },
    {
        "text": " pero ¿cómo son los compactos en los reales? cálculo 1 cerrado y acotado que son, sí puede ser",
        "start": 4163.02,
        "end": 4177.700000000001
    },
    {
        "text": " el terbalo, pero puede ser así, ¿no? La unión de dos intervales, pero ¿cómo es arco con x o?",
        "start": 4177.7,
        "end": 4190.179999999999
    },
    {
        "text": " exactamente es un intervallo, entonces ccn es un intervallo pero es un intervallo al cual se",
        "start": 4190.18,
        "end": 4208.820000000001
    },
    {
        "text": " gaza a lambda 1 y se gaza a lambda n, entonces el intervallo tiene que ser lambda 1 en lambda n,",
        "start": 4208.820000000001,
        "end": 4213.14
    },
    {
        "text": " es un intervallo que tiene el lambda 1 está incluido, a ver es un intervallo, hubiese que",
        "start": 4213.860000000001,
        "end": 4219.860000000001
    },
    {
        "text": " está incluido en este intervallo pero toca el lambda 1 y toca el lambda n porque llega a",
        "start": 4219.860000000001,
        "end": 4223.38
    },
    {
        "text": " todo lo valor de propio, entonces este intervallo tiene que ser es saltamente este intervallo, se",
        "start": 4223.38,
        "end": 4232.42
    },
    {
        "text": " entendió su último, típico problema que aparece en el segundo parcial, típico pregunta",
        "start": 4232.42,
        "end": 4240.58
    },
    {
        "text": " y es fortísimo, haré resultado que el espectro entonces está incluido en el intervallo y en el",
        "start": 4240.58,
        "end": 4246.38
    },
    {
        "text": " intervallo se sienta exactamente de calculando de esta manera, precios.",
        "start": 4246.38,
        "end": 4249.74
    }
]