[
    {
        "text": " Vamos a dar comienzo bienvenido nuevamente la materia de economía, vamos a dar comienzo a este semestre.",
        "start": 0.0,
        "end": 21.72
    },
    {
        "text": " ¿Qué corresponde a una de las materias que me maten a ustedes durante carrera?",
        "start": 21.72,
        "end": 29.72
    },
    {
        "text": " Una más. No, estaba haciendo un poco de tiempo y por eso estaba tratando de estirar un poco el tiempo,",
        "start": 29.72,
        "end": 34.879999999999995
    },
    {
        "text": " a ver si llegaba a Carlos, que es otro docente, que generalmente es quien el primer día de clases hace",
        "start": 34.879999999999995,
        "end": 41.28
    },
    {
        "text": " durante un rato la presentación de la materia en términos formales, verdad, se habla del reyamento,",
        "start": 41.28,
        "end": 47.879999999999995
    },
    {
        "text": " se habla de las temas que abordaremos durante este semestre, el mecanismo de evaluación,",
        "start": 47.879999999999995,
        "end": 55.16
    },
    {
        "text": " pero bueno, no ha llegado todavía, así que esperamos hasta ahí, vamos a dar comienzo y empezamos a",
        "start": 55.16,
        "end": 60.12
    },
    {
        "text": " hablar nosotros sin perjuicio de que todo lo que hace al reglamento de la materia está documentado",
        "start": 60.12,
        "end": 66.8
    },
    {
        "text": " en el reglamento de economía, la materia de economía está documentado en una página web que",
        "start": 66.8,
        "end": 72.6
    },
    {
        "text": " ahora en un ratito comentaremos donde se encuentra, en un espacio, que quiero decir puede ser que",
        "start": 72.6,
        "end": 78.08
    },
    {
        "text": " haya algunas cosas que me olvide de comentar, pero por eso que los invito a ustedes a darle una leída",
        "start": 78.08,
        "end": 84.47999999999999
    },
    {
        "text": " a un día de estos, a ese reglamento de las cuestiones que hacen la materia, pero son, en general,",
        "start": 84.48,
        "end": 90.08
    },
    {
        "text": " son las que corresponden a todas las materias, todas las materias, bueno, antes de seguir hablando,",
        "start": 90.08,
        "end": 101.96000000000001
    },
    {
        "text": " muchos de ustedes se preguntarán quién es este, no, este tipo que está acá adelante hablando,",
        "start": 101.96000000000001,
        "end": 105.72
    },
    {
        "text": " bueno me llamó Mateo, mi nombre es Mateo, Mateo Yury, soy economista, agresado de esta casa de estudio,",
        "start": 105.72,
        "end": 113.52000000000001
    },
    {
        "text": " de la Universidad Mayor, docente de la Universidad de la República desde hace ya un tiempo, quizás unos",
        "start": 113.52,
        "end": 123.24
    },
    {
        "text": " 14 años, sí hace tiempo, docente de ciencias económicas, obviamente, que es mi casa, ¿verdad?",
        "start": 123.24,
        "end": 131.84
    },
    {
        "text": " Y también docente, entre otras, docente aquí en la Facultad de Ingeniería formando parte de este",
        "start": 131.84,
        "end": 137.51999999999998
    },
    {
        "text": " equipo que lo integramos cinco, seis personas, ¿verdad? Que somos un equipo de dos centes de la Facultad",
        "start": 137.52,
        "end": 145.12
    },
    {
        "text": " de Ingeniería de la Facultad de Ingeniería, que armamos un grupo para dar la materia de economía",
        "start": 145.12,
        "end": 150.12
    },
    {
        "text": " aquí para los futuros ingenieros, para todos los ingenieros, como acá seguramente ahora",
        "start": 150.12,
        "end": 156.72
    },
    {
        "text": " gente que va a ir por la ingeniería civil, va a ir por la ingeniería en computación, que es",
        "start": 156.72,
        "end": 161.16000000000003
    },
    {
        "text": " yo, por la hidráulica ambiental, que se llorirán por mil lados de eléctrica, la alimenticia,",
        "start": 161.16,
        "end": 166.32
    },
    {
        "text": " no sé cómo se llama la delalimentos, la alimenticia está mal dicho, mi ingeniería alimenticia,",
        "start": 166.32,
        "end": 172.32
    },
    {
        "text": " es como que está mal, es de alimentos, alimentaria, de qué te recebiste, de alimentaria, ¿no?",
        "start": 172.32,
        "end": 178.44
    },
    {
        "text": " Bueno, la ingeniería dice ese ingeniería de alimentos, ah está, está buen, está buen, ah está,",
        "start": 178.44,
        "end": 185.04
    },
    {
        "text": " una prima mía de esa recidio de esos un tiempito, nunca supe bien cómo se llamaba por eso,",
        "start": 185.04,
        "end": 189.24
    },
    {
        "text": " ah está, ah está, hace un par de años, se recibió, bueno, úrises, bienvenidos nuevamente,",
        "start": 189.36,
        "end": 195.84
    },
    {
        "text": " a la materia vamos a pasar a hablar de algunas cuestiones ya les digo formales que hacen a esta",
        "start": 195.84,
        "end": 202.44
    },
    {
        "text": " materia que denominamos economía, economía aunque general nos gusta llamarle más nociones",
        "start": 202.44,
        "end": 209.20000000000002
    },
    {
        "text": " de economía, porque es una materia donde la cual no tiene una paralela en las facultades",
        "start": 209.20000000000002,
        "end": 215.96
    },
    {
        "text": " en económicas, no quizás alguno de ustedes dice bueno, hay alguna materia ya o tengo",
        "start": 215.96,
        "end": 221.28
    },
    {
        "text": " algún pariente que está haciendo en las económicas, hay alguna materia que sea paralela de esta para",
        "start": 221.28,
        "end": 225.16
    },
    {
        "text": " pedirle el material, no la hay, aquí nosotros en un semestre que termina siendo como ustedes",
        "start": 225.16,
        "end": 230.96
    },
    {
        "text": " bien saben quizás tres meses de clase, ¿verdad? le llamamos semestre, pero nunca hace un semestre",
        "start": 230.96,
        "end": 235.96
    },
    {
        "text": " termina siendo tres meses de clase, abordaremos un sin fin de temas que hacen a la economía",
        "start": 235.96,
        "end": 243.88
    },
    {
        "text": " en términos generales por eso que obviamente abarcando mucho también la en nivel de profundidad",
        "start": 243.88,
        "end": 250.64
    },
    {
        "text": " relativo, ¿verdad? Relativo que significa bueno que hay algo temas que en facultad de ciencias",
        "start": 250.64,
        "end": 255.96
    },
    {
        "text": " económicas se desarrollan durante un semestre, si o un año entero acá lo desarrollaremos capaz",
        "start": 255.96,
        "end": 260.96
    },
    {
        "text": " que en 40 minutos, ¿verdad? Por lo tanto el nivel de profundidad que dedicaremos a casi todos",
        "start": 260.96,
        "end": 268.2
    },
    {
        "text": " los temas es relativo, ¿qué significa relativo que fácil? No, no significa que sea fácil,",
        "start": 268.2,
        "end": 275.4
    },
    {
        "text": " significa que es relativo, pero ¿qué significa relativo? Bueno, que lo vemos por arriba,",
        "start": 275.4,
        "end": 281.0
    },
    {
        "text": " pero entonces es fácil, bueno, los resultados marcan históricos aquí en facultad de cienería",
        "start": 281.0,
        "end": 286.76
    },
    {
        "text": " que prácticamente el 35, 40% del alumnado que cursa, que no, que de la materia termina",
        "start": 286.76,
        "end": 294.44
    },
    {
        "text": " exonerando las instancias de examen y aprobando definitivamente la materia, es decir no es que",
        "start": 294.44,
        "end": 299.84
    },
    {
        "text": " sea una materia, una papa, ¿no? Economía es una papa porque vamos a dar todo por arriba,",
        "start": 299.84,
        "end": 304.52
    },
    {
        "text": " ¿vamos? Cuidado con esa postura, ¿verdad? Lo que nos lo siempre aconsejamos obviamente,",
        "start": 304.52,
        "end": 310.44
    },
    {
        "text": " esta materia es acompañarla, es gratis, vengan, no cobramos, tienen muchas facilidades porque",
        "start": 310.44,
        "end": 319.92
    },
    {
        "text": " ahora vamos a comentar, tiene dos horarios para poder venir, si no les sirve este pueden cambiarlo,",
        "start": 319.92,
        "end": 324.52000000000004
    },
    {
        "text": " acompañarlo durante el curso, asistiendo a las clases, acompañando con la lectura del material",
        "start": 324.52000000000004,
        "end": 331.48
    },
    {
        "text": " bibliográfico y van a ir a las instancias de evaluación, que ahora comentaremos, de que se trata",
        "start": 331.48,
        "end": 336.68
    },
    {
        "text": " ¿verdad? Y hay sí, la probabilidad de aprobaciones altísimas, el porcentaje de gente que aprueba,",
        "start": 336.68,
        "end": 342.48
    },
    {
        "text": " que tiene una conducta de asistir regularmente a clases, prestar una relativa atención durante la",
        "start": 342.48,
        "end": 348.56
    },
    {
        "text": " misma, decir más o menos seguir los temas, ¿verdad? En la clase después vichar un poco las",
        "start": 348.56,
        "end": 352.76
    },
    {
        "text": " fichas, leer un poco, ya está, vale la prueba y es altamente probable que salga, aquel que lo",
        "start": 352.76,
        "end": 358.68
    },
    {
        "text": " adopte una postura más pintada de olio, ¿no? Bueno, no le voy, no voy, me voy a tomar",
        "start": 358.68,
        "end": 364.44
    },
    {
        "text": " materia de rambla, que se llota, está bien, está buenísimo, está lindísimo, hoy está buenísimo,",
        "start": 364.44,
        "end": 369.12
    },
    {
        "text": " pero bueno, es probable que les sea más difícil, que son el agua material, tenga que ir examen o",
        "start": 369.12,
        "end": 374.32
    },
    {
        "text": " directamente, tenga que recursar. Entonces, lo invito a acompañar la materia C, la materia",
        "start": 374.32,
        "end": 382.4
    },
    {
        "text": " atentamente. El objetivo de esta materia, como dijimos, es brindarle al futuro ingeniero no",
        "start": 382.4,
        "end": 394.48
    },
    {
        "text": "ciones de economía, ¿verdad? Esto es ciertos temas que hacen la realidad cotidiana, que por ahí",
        "start": 394.48,
        "end": 399.88
    },
    {
        "text": " lo podemos oleer en algún medio de prensa o escuchar en la tele, ¿no? están hablando de inflación,",
        "start": 399.88,
        "end": 405.15999999999997
    },
    {
        "text": " están hablando del producto, están hablando del déficit fiscal, del financiamiento, del presupuesto",
        "start": 405.15999999999997,
        "end": 409.96
    },
    {
        "text": " nacional, están hablando de las decisiones de una empresa acerca de cierto mercado monopólico,",
        "start": 409.96,
        "end": 416.32
    },
    {
        "text": " lícopólico, bueno, temas que quizás hasta ahora uno decía, ¿no? prefiero escuchar un tema de",
        "start": 416.32,
        "end": 421.36
    },
    {
        "text": " Lucas Hugo, no sé, no me interesa la política, no, no, no, no, no, no, no me interesa de esos temas,",
        "start": 421.36,
        "end": 425.76
    },
    {
        "text": " bueno, ahora ya somos grandes, ahora ya somos grandes, ya tenemos 18, ¿verdad? Y está",
        "start": 425.76,
        "end": 432.52
    },
    {
        "text": " bueno conocer, conocer de ciertos temas que hacen a la ciencia económica para poder entender y tomar",
        "start": 432.52,
        "end": 440.48
    },
    {
        "text": " una decisión fundada, ¿verdad? decir una decisión con sentido, con fundamento, y no repetir",
        "start": 440.48,
        "end": 446.92
    },
    {
        "text": " como lo lo que me dice miedo, lo humido, la verdad, o directamente tirarnos de gurises de niños,",
        "start": 446.92,
        "end": 453.24
    },
    {
        "text": " de los chicos que no nos interesa nada, no somos comprometidos con la vida cotidiana, porque",
        "start": 453.24,
        "end": 457.56
    },
    {
        "text": " no entendemos nada, bueno, economía va a aportar herramientas para poder comprender gran",
        "start": 457.56,
        "end": 463.6
    },
    {
        "text": " parte de los temas que hacen a la vida cotidiana, ya les digo a nivel de cuestiones públicas,",
        "start": 463.6,
        "end": 471.64
    },
    {
        "text": " de política pública, de política económica pública, estoy hablando o a nivel de lo que",
        "start": 471.64,
        "end": 476.28000000000003
    },
    {
        "text": " son los mercados que participamos prácticamente a diario, una economía como en la que vivimos,",
        "start": 476.28000000000003,
        "end": 481.2
    },
    {
        "text": " en decisiones de los consumidores, decisiones de las empresas, de estructuras de mercado,",
        "start": 481.2,
        "end": 485.71999999999997
    },
    {
        "text": " temas públicos y temas privados, vamos a recorrer un sinfín de temas, más allá de que veremos",
        "start": 485.71999999999997,
        "end": 492.36
    },
    {
        "text": " de todo tipo de temas sabemos que no formamos economistas, que no estamos formando economistas,",
        "start": 492.36,
        "end": 498.0
    },
    {
        "text": " todo lo tanto, la profundidad relativa, la hora de darle nociones de economía futuros ingenieros,",
        "start": 498.0,
        "end": 503.68
    },
    {
        "text": " sabemos discernir, sabemos frenarnos y ver el alcance de profundidad, si estamos hablando de",
        "start": 503.68,
        "end": 510.28
    },
    {
        "text": " IPC de inflación, no le vamos a dar quizás la estructura matemática que está detrás del índice",
        "start": 510.28,
        "end": 517.9599999999999
    },
    {
        "text": " de las peiras, que hace a la cuantificación del índice de preso y consumo, hablaremos de",
        "start": 517.9599999999999,
        "end": 523.8
    },
    {
        "text": " entra, en general es cómo se construye, cómo se interpreta un resultado de IPC, cómo leer ese",
        "start": 523.8,
        "end": 529.76
    },
    {
        "text": " resultado, en qué me afecta, qué utilidad tiene para la gente, para mí, porque es tan importante",
        "start": 529.76,
        "end": 535.4
    },
    {
        "text": " ese dato, que blanca rodríguez todos los meses, en el noticiero comienzo, el noticiero central",
        "start": 535.4,
        "end": 540.68
    },
    {
        "text": " diciendo, el IPC, la inflación se sitúa un tanto, qué tiene de importantes datos, bueno,",
        "start": 540.68,
        "end": 545.56
    },
    {
        "text": " eso es un poco lo que nosotros queremos transmitir a ustedes entre otros temas, ¿verdad? De herramientas",
        "start": 545.56,
        "end": 551.3199999999999
    },
    {
        "text": " para comprender puntos, sabemos que no formamos economistas, será una materia por tanto que,",
        "start": 551.3199999999999,
        "end": 556.76
    },
    {
        "text": " como les digo, el repito nos gusta más llamarle denociones de economía, son nociones de economía.",
        "start": 556.76,
        "end": 562.4
    },
    {
        "text": " A ver, el tema de la estructura de las clases, cómo está organizado, qué está",
        "start": 563.36,
        "end": 569.1999999999999
    },
    {
        "text": " reservo, como tiene un ratito, me lo voy a tardar, está bueno, ¿no?",
        "start": 569.1999999999999,
        "end": 573.28
    },
    {
        "text": " Está bueno, no, no, no, capa que no está bueno, para mí sí, una está reserva, está lindo.",
        "start": 574.88,
        "end": 578.72
    },
    {
        "text": " Claro, ustedes me tienen que ir a mi lapar delante, yo voy a disfrutar, es peles comento como estuvo,",
        "start": 579.6,
        "end": 583.4399999999999
    },
    {
        "text": " le saco una foto, se la mando por WhatsApp, ahí está, bueno, la estructura de las clases,",
        "start": 584.16,
        "end": 590.48
    },
    {
        "text": " ¿cómo está organizado esto? Seguramente, ve que algunos ya tenían algún cronograma, no sé,",
        "start": 590.48,
        "end": 594.48
    },
    {
        "text": " si de esta materia o de otras, bueno, ¿cómo está organizado? Está organizado bajo el formato",
        "start": 594.48,
        "end": 599.2
    },
    {
        "text": " teórico práctico, esto es hay clases que son teóricas y clases que son prácticas,",
        "start": 599.2,
        "end": 604.96
    },
    {
        "text": " cargadoraria, semanal, cuatro horas de teórico, en dos clases, hoy no, tenemos dos, el viernes próximo",
        "start": 604.96,
        "end": 612.88
    },
    {
        "text": " tendremos dos más y una hora semanal de práctico, una hora semanal de práctico, ¿qué?",
        "start": 612.88,
        "end": 619.2
    },
    {
        "text": " Para ustedes, va a estar desarrollando los días viernes si mal no recuerdo de cuatro a cinco,",
        "start": 620.48,
        "end": 625.76
    },
    {
        "text": " esto es el viernes dos platos, de cuatro a cinco prácticos y de cinco a siete teóricos, ¿verdad?",
        "start": 627.2,
        "end": 634.96
    },
    {
        "text": " tres horas, ¿cómo va a matarse? tres horas de economía,",
        "start": 634.96,
        "end": 638.72
    },
    {
        "text": " le damos cinco minutitos ahí para que despejen un poco, se liberen un poco de todo esto,",
        "start": 640.32,
        "end": 644.48
    },
    {
        "text": " tres horas de cosas.",
        "start": 645.28,
        "end": 646.8000000000001
    },
    {
        "text": " A la par se está desarrollando otro grupo que es el que nos llamó de Martes y Jueves,",
        "start": 647.76,
        "end": 653.28
    },
    {
        "text": " dos se treinta, del 14 treinta y el práctico, los mírclees, y debe ser la que creo que a las",
        "start": 653.28,
        "end": 660.64
    },
    {
        "text": " dos se treinta, llúdenme usted de más o menos, dos y media, una y media, ¿tá?",
        "start": 660.64,
        "end": 666.3199999999999
    },
    {
        "text": " ¿Entonces? ¿qué quiero decir con esto? Que ustedes elegieron venir acá, pero pueden elegir",
        "start": 666.3199999999999,
        "end": 673.8399999999999
    },
    {
        "text": " ir al otro, decir no porque hayan venido hoy acá, siempre tienen que venir miércoles y viernes,",
        "start": 673.84,
        "end": 677.9200000000001
    },
    {
        "text": " ¿no? capaz que el compañero, el viernes no podés, entonces decir, bueno, vengo mañana Jueves,",
        "start": 677.9200000000001,
        "end": 685.0400000000001
    },
    {
        "text": " que es la segunda clase, ¿verdad? y vas a escucharlo que vas a escuchar el viernes, ¿verdad?",
        "start": 685.0400000000001,
        "end": 690.0
    },
    {
        "text": " acá me explico con esto, pueden libremente ir a una o otra, esto no vayan, Martes y miércoles,",
        "start": 690.0,
        "end": 697.6800000000001
    },
    {
        "text": " porque ahí van a escucharlo mismo, lo que sí puede pasar y ya va a pasar esta semana, así,",
        "start": 697.6800000000001,
        "end": 703.6
    },
    {
        "text": " ya empezamos con un pequeño de fazaje, claro, ¿qué va a pasar? Si algún día perdemos una clase por algo,",
        "start": 704.16,
        "end": 710.8000000000001
    },
    {
        "text": " obviamente quedamos un poquito, un grupo quedan un poquito de fazado, ¿verdad? por razones obvias,",
        "start": 710.8000000000001,
        "end": 715.6800000000001
    },
    {
        "text": " tengan en cuenta que este viernes no se existan al tanto, imagino que sí, no tiene mi idea, bueno,",
        "start": 716.32,
        "end": 723.76
    },
    {
        "text": " porque ayer vino, un grupo a la clase de los martes vino un grupo acá del centro de estudiantes,",
        "start": 723.76,
        "end": 732.8000000000001
    },
    {
        "text": " ingeniería el 6, ¿verdad? y ustedes saben de qué estoy hablando, vino un grupo a comentarle a todos",
        "start": 732.8,
        "end": 740.4799999999999
    },
    {
        "text": " los chicos que se yo, que el viernes hay una marcha, bueno, hay una serie de medidas revindicativas,",
        "start": 740.4799999999999,
        "end": 747.4399999999999
    },
    {
        "text": " presupuestales, ¿verdad? y tengo entendido, según me comentaron no hay nada oficial,",
        "start": 747.4399999999999,
        "end": 752.0
    },
    {
        "text": " y yo de graciaramente yo tampoco tengo comunicación oficial, ¿qué se paraliza las actividades a las 5",
        "start": 752.0,
        "end": 757.12
    },
    {
        "text": " de la tarde? decir, tengo entendido como que la facultad medio que cierra, no tiene mi idea de esto,",
        "start": 757.12,
        "end": 764.16
    },
    {
        "text": " ¿tá suele pasar esto? que nunca sabemos bien cómo son las cosas, que en principio clase hay,",
        "start": 764.16,
        "end": 770.5600000000001
    },
    {
        "text": " si venimos a ver, hubo unirse del viernes y tenemos la facultad cerrada por razones obvias,",
        "start": 770.5600000000001,
        "end": 777.36
    },
    {
        "text": " no vamos a poner la clase, ¿tá? ¿tá? bueno, no importa, los prácticos no comienzan esta semana,",
        "start": 777.36,
        "end": 786.8000000000001
    },
    {
        "text": " van a comenzar la semana próxima, porque se le da un changuí al teórico para que avance un poco,",
        "start": 786.8000000000001,
        "end": 792.88
    },
    {
        "text": " para poder desarrollar el práctico, ¿verdad? ayer me he preguntado en alumnos si el práctico,",
        "start": 792.88,
        "end": 798.8000000000001
    },
    {
        "text": " como que es el práctico, porque claro, muchas veces uno trae una estructura de la matemática,",
        "start": 798.8000000000001,
        "end": 805.12
    },
    {
        "text": " ¿verdad? ¿dónde se da teórico? teorema, que es yo, ¿y practico? ¿no? cálculo,",
        "start": 805.12,
        "end": 809.6
    },
    {
        "text": " no sé, se acuerda, matemática, no se acuerda, ustedes también, ¿eh? bueno, el teórico",
        "start": 809.6,
        "end": 816.8
    },
    {
        "text": " practico, ¿qué es en economía teórico? el práctico pretende ser un espacio donde no se vuelve a",
        "start": 816.8,
        "end": 824.4
    },
    {
        "text": " dar todo de nuevo, pero si muchas veces se baja a tierra o se embeben en la realidad urwaya, por ejemplo,",
        "start": 824.4,
        "end": 834.24
    },
    {
        "text": " ponga un ejemplo, estamos yo en clase acá, voy a presentar en algún momento, voy a presentar el",
        "start": 834.24,
        "end": 839.52
    },
    {
        "text": " índice de precios del consumidor el IPC o el producto interno bruto, ¿no? cómo se construye, que",
        "start": 839.52,
        "end": 844.48
    },
    {
        "text": " representa, que es yo, todo teóricamente, bueno, en el práctico van en un momento a plantear datos",
        "start": 844.48,
        "end": 850.44
    },
    {
        "text": " de urwaya, ¿eh? ¿cuál fue la variación del producto del año pasado? bueno, datos de la realidad",
        "start": 850.44,
        "end": 856.96
    },
    {
        "text": " para embeversen los números de la realidad, entre otras cosas, eso es el práctico de economía,",
        "start": 856.96,
        "end": 862.2
    },
    {
        "text": " bajar a tierra, a la realidad, mucho de los conceptos teóricos que se ven, que vemos aquí en el",
        "start": 862.76,
        "end": 870.5200000000001
    },
    {
        "text": " en el teórico, ¿eh? ¿de qué estamos hablando? bueno, las clases, los grupos material, material de",
        "start": 870.5200000000001,
        "end": 877.84
    },
    {
        "text": " referencia bibliográfico, ¿eh? hace un rato de sí, ¿hamos? en este espacio de mail, de de de de de de",
        "start": 877.84,
        "end": 885.76
    },
    {
        "text": " de Dici, ¿no sé?, como en el espacio web, entre otras cosas tenemos exámenes y pruebas de años",
        "start": 885.84,
        "end": 892.64
    },
    {
        "text": " anteriores ¿verdad? que a ustedes le van a servir como referencia para, para probarse, para mirar",
        "start": 892.64,
        "end": 901.7
    },
    {
        "text": " como las pruebas, como son, como que se pregunta, como se pregunta, pero además existe un material",
        "start": 901.7,
        "end": 908.96
    },
    {
        "text": " el teórico de referencia bibliográfica que ustedes disponen de forma gratuita en la página web,",
        "start": 908.96,
        "end": 917.44
    },
    {
        "text": " lo pueden bajar. Cada uno de los bloques temáticos que ahora voy a pasar a comentar,",
        "start": 917.44,
        "end": 923.88
    },
    {
        "text": " que son cuatro en esta materia, cada uno de los bloques temáticos tiene su referencia",
        "start": 923.88,
        "end": 928.36
    },
    {
        "text": " bibliográfica que está estructurado, lo que llamamos una fichas, las fichas temáticas.",
        "start": 928.36,
        "end": 934.0400000000001
    },
    {
        "text": " Si mal no recuerdo, están editados, son fichas que hicimos nosotros los docentes,",
        "start": 934.64,
        "end": 941.64
    },
    {
        "text": " pero el centro de estudiantes que es quien edita, los juntos, junto a dos de a dos.",
        "start": 941.64,
        "end": 947.48
    },
    {
        "text": " La fichas de descripción, con la de macro, están en una sola, en un archivo pdf grande,",
        "start": 947.48,
        "end": 953.52
    },
    {
        "text": " y también está disponible, quien no lo puede bajar de internet o no tenga para imprimir,",
        "start": 953.52,
        "end": 958.5999999999999
    },
    {
        "text": " puede ir a la oficina de apuntes, el centro de estudiantes,",
        "start": 958.5999999999999,
        "end": 961.76
    },
    {
        "text": " y creo que esa precio de fotocopia, ahí no sé eso, a precio de fotocopia pueden adquirir",
        "start": 961.76,
        "end": 966.64
    },
    {
        "text": " el material las fichas de economía, ¿verdad? Las que se editan primero son estas dos,",
        "start": 966.64,
        "end": 971.84
    },
    {
        "text": " que corresponden a la primera parte y estas dos todavía no están editadas.",
        "start": 971.84,
        "end": 976.3199999999999
    },
    {
        "text": " Pero sí, lo tienen disponible en internet, quien no quiera comprar abajo en la oficina de apuntes,",
        "start": 976.3199999999999,
        "end": 982.3199999999999
    },
    {
        "text": " lo tienen lo bajan de internet. Entonces, material de referencia tienen obligatorios",
        "start": 982.3199999999999,
        "end": 989.48
    },
    {
        "text": " que son estas fichas teóricas, así como las pruebas.",
        "start": 989.48,
        "end": 993.5600000000001
    },
    {
        "text": " ¿Está bien? ¿De material? ¿Alguna duda? ¿Alguna duda de material?",
        "start": 993.5600000000001,
        "end": 1002.8000000000001
    },
    {
        "text": " Bueno, ¿qué hice ahí abajo de evaluación? ¿No? ¿No? Fichas, hablemos de fichas,",
        "start": 1002.8000000000001,
        "end": 1015.28
    },
    {
        "text": " las fichas de años anteriores. Todos los años las miramos, las volvemos a mirar.",
        "start": 1015.28,
        "end": 1022.28
    },
    {
        "text": " Si le cambiamos, le cambiamos una coma. No han habido grandes cambios.",
        "start": 1022.28,
        "end": 1030.28
    },
    {
        "text": " Eso sí, si conseguís una ficha, me animaría a decirte de cinco, seis años.",
        "start": 1030.28,
        "end": 1035.28
    },
    {
        "text": " No, no. Conseguíte alguna de la año pasado seguro que sí, por ejemplo,",
        "start": 1035.28,
        "end": 1040.84
    },
    {
        "text": " de escripción no va a cambiar nada, ya te lo digo. Pues yo lo digo. Carlos me preguntó,",
        "start": 1040.84,
        "end": 1046.3999999999999
    },
    {
        "text": " ¿Mateo cambiamos algo para este año de las fichas nada? ¿Te daño nada?",
        "start": 1046.3999999999999,
        "end": 1050.28
    },
    {
        "text": " ¿Capas que en el que viven y viste revisamos algo o alguna metodología de escripción?",
        "start": 1050.28,
        "end": 1054.84
    },
    {
        "text": " ¿Qué tal? ¿Es que después cambiamos las fichas por las sones obvios?",
        "start": 1054.84,
        "end": 1058.84
    },
    {
        "text": " Bueno, ¿verán que yo me tomo unos mate cada tanto? Me gusta tomar mate, ¿no?",
        "start": 1063.84,
        "end": 1067.84
    },
    {
        "text": " ¿Vas a cambiar algo? ¿Vas a cambiar algo? ¿Vas a cambiar la página de este de este que sacan?",
        "start": 1068.84,
        "end": 1073.84
    },
    {
        "text": " Sí, pero en un momento se va a publicar, no lo sabemos todavía.",
        "start": 1073.84,
        "end": 1077.84
    },
    {
        "text": " No lo sabemos porque los docentes que tienen acargo esos bloques temáticos son Gustavo Dutra y Pablo de Rocha.",
        "start": 1077.84,
        "end": 1086.84
    },
    {
        "text": " Todavía no se han expedido y la cátera y los habilitas pues están en tiempo todavía.",
        "start": 1086.84,
        "end": 1094.84
    },
    {
        "text": " No habría necesidad de que hule alumno hoy ya esté leyendo porque todavía no llegamos.",
        "start": 1095.84,
        "end": 1100.84
    },
    {
        "text": " Me explico si cuando empiezan y si se va a tener definido si cambian o no.",
        "start": 1100.84,
        "end": 1106.84
    },
    {
        "text": " Yo hoy no puedo decirte y tampoco se han expedido.",
        "start": 1106.84,
        "end": 1110.84
    },
    {
        "text": " Todavía no tenemos respuesta. Descriptiva, seguro que no.",
        "start": 1112.84,
        "end": 1115.84
    },
    {
        "text": " Ya les digo y eso lo confirmo yo. No va a haber cambios, ¿se da en considerar que las pichas de años anteriores tranquilo?",
        "start": 1116.84,
        "end": 1121.84
    },
    {
        "text": " La puedes conseguir. Bien, bien. Evaluación, evaluación. ¿Qué significa evaluación?",
        "start": 1122.84,
        "end": 1131.84
    },
    {
        "text": " ¿Tipo qué cómo se salva la materia? ¿No? ¿Ahí está? ¿Cómo se salva la materia?",
        "start": 1131.84,
        "end": 1137.84
    },
    {
        "text": " Esta materia se evalua mediante pruebas dos pruebas parciales de evaluación parcial.",
        "start": 1137.84,
        "end": 1147.84
    },
    {
        "text": " Son pruebas escritas e individuales de un formato de múltiple opción donde se les presenta unas 30 preguntas.",
        "start": 1147.84,
        "end": 1159.84
    },
    {
        "text": " Preguntas o enunciados no siempre son cuestiones, cuestionamientos.",
        "start": 1160.84,
        "end": 1165.84
    },
    {
        "text": " Ya se son enunciados cada uno de los cuales tienen tres alternativas.",
        "start": 1165.84,
        "end": 1170.84
    },
    {
        "text": " Uno, dos y tres. Una sola es la correcta. No hay dos correctas ni tres correctas.",
        "start": 1171.84,
        "end": 1176.84
    },
    {
        "text": " Solamente una es la correcta. Las otras dos son incorrectas.",
        "start": 1176.84,
        "end": 1180.84
    },
    {
        "text": " El sistema de puntajes que establecemos es que la correcta suma el puntaje del item y de las otras dos,",
        "start": 1180.84,
        "end": 1188.84
    },
    {
        "text": " una de ellas es de punta genéutrica, es decir, ni suma ni resta, cero,",
        "start": 1188.84,
        "end": 1194.84
    },
    {
        "text": " pero hay una tercera que de ser elegida resta el puntaje del item.",
        "start": 1194.84,
        "end": 1201.84
    },
    {
        "text": " Por ejemplo, si la pregunta 14 valía tres y yo elijo en la correcta a la hora de sumar,",
        "start": 1201.84,
        "end": 1209.84
    },
    {
        "text": " en vez de cero tengo un menos tres, me explico, me penaliza.",
        "start": 1209.84,
        "end": 1214.84
    },
    {
        "text": " Está asociado a primero por qué hacer eso. ¿Vo usted, Irán? ¿Qué? ¿Pero para qué hacen eso medio retrogrado de que reste?",
        "start": 1214.84,
        "end": 1223.84
    },
    {
        "text": " Bueno, con esto lo pensamos mucho y lo hablamos también con otras gente.",
        "start": 1223.84,
        "end": 1230.84
    },
    {
        "text": " Entendemos de que eliminamos esa cuestión de que el alumno tira a pejar. ¿Qué quiero decir?",
        "start": 1230.84,
        "end": 1238.84
    },
    {
        "text": " Si hay alguna aventurera o que quiere tirarada, tirar monedita, aquí lo haga.",
        "start": 1238.84,
        "end": 1243.84
    },
    {
        "text": " El tema que el riesgo está ahí, porque también la moneda no se se me explico.",
        "start": 1243.84,
        "end": 1250.84
    },
    {
        "text": " Está, está, punto, es así. No es el mejor sistema de evaluación,",
        "start": 1251.84,
        "end": 1257.84
    },
    {
        "text": " yo no sé para nada, promotor de la multiplicación, pero tengan en cuenta que somos cuatro, cinco, dos centes",
        "start": 1257.84,
        "end": 1269.84
    },
    {
        "text": " y acá verán, pero uno dirá que somos pocos. Si en embargo más o menos son mil personas",
        "start": 1269.84,
        "end": 1274.84
    },
    {
        "text": " que terminan rendiendo el parcial, sería imposible para cuatro, cinco personas corregir textos de 900 personas,",
        "start": 1275.84,
        "end": 1284.84
    },
    {
        "text": " sería una dimensia, no lo podríamos hacer. Por lo tanto hace un tiempo nos fuimos a este formato de multiplicación,",
        "start": 1284.84,
        "end": 1290.84
    },
    {
        "text": " donde no corregimos porque lo corrigo una máquina, una máquina. Al finalizar cada prueba,",
        "start": 1290.84,
        "end": 1296.84
    },
    {
        "text": " ustedes automáticamente van a tener el prototipo, como les gusta llamar a los estudiantes",
        "start": 1296.84,
        "end": 1301.84
    },
    {
        "text": " y el prototipo de solución, pero tanto usted ya termina la prueba, ya saben si salvan y si pierden y en qué se equivocaron,",
        "start": 1302.84,
        "end": 1308.84
    },
    {
        "text": " y que no, por un lado está bueno, pues no tienen que esperar la corregción, ya saben. Bien, aparte de publicarse",
        "start": 1308.84,
        "end": 1315.84
    },
    {
        "text": " en la página web, la solución es verdad. Bien, ¿cómo se aprueba?",
        "start": 1315.84,
        "end": 1321.84
    },
    {
        "text": " Cada una de estas pruebas individuales y escritas, que son dos pruebas de multiplicación, van sobre un total de puntos de 50,",
        "start": 1321.84,
        "end": 1329.84
    },
    {
        "text": " cada una de ellas, 50 puntos. Por lo tanto al finalizar el curso, el puntaje total es de 100, ¿verdad? Si sumamos las dos.",
        "start": 1329.84,
        "end": 1340.84
    },
    {
        "text": " ¿Qué condiciones debe cumplir el estudiante para poder exonerar totalmente la instancia de examen?",
        "start": 1340.84,
        "end": 1348.84
    },
    {
        "text": " Objetivo número uno para muchos, es decir, termina el último prácte, el último parcial y ya está a Chao Economía, ¿no?",
        "start": 1348.84,
        "end": 1354.84
    },
    {
        "text": " Salve, no tengo que examen. Bien, en la suma de ambas pruebas obtener un total de 60 o más puntos.",
        "start": 1354.84,
        "end": 1366.84
    },
    {
        "text": " Esto es, tengo el resultado de la primera, tengo el resultado de la segunda sumo. Si la suma me da mayor igual a 60,",
        "start": 1366.84,
        "end": 1373.84
    },
    {
        "text": " primera condición cumplida, no solo teniendo 60 o más, sino que además, como condición tiene que hacer,",
        "start": 1373.84,
        "end": 1387.84
    },
    {
        "text": " en cuanto a dónde debe cumplirse, que en cada una de ellas, debo tener como mínimo 12,5 puntos, mayor o igual a 12,5,",
        "start": 1387.84,
        "end": 1398.84
    },
    {
        "text": " en cada una que hace al 25% del total del puntaje. Ahora sí me explico, ¿por qué claro hay en DiraBueno, ¿pero qué pasa si saco 14 y 50, 64 salvo, no?",
        "start": 1398.84,
        "end": 1412.84
    },
    {
        "text": " Porque en la primera obtuve 14, no alcancele un brael mínimo de 12, ¿cómo? Bueno, 12,5 y así.",
        "start": 1412.84,
        "end": 1418.84
    },
    {
        "text": " Ahí está, ahí sí, 10, está, 10 y 50, ¿tabienes, ¿no? 10, no llevo, 11 y 49.",
        "start": 1418.84,
        "end": 1429.84
    },
    {
        "text": " Y otras combinaciones posibles que no vienen al caso. Me explico, quedo claro, ¿verdad?",
        "start": 1429.84,
        "end": 1434.84
    },
    {
        "text": " El objetivo acá, les comento, es que el estudiante aproveve algo así como con un poquito de cada cosa.",
        "start": 1434.84,
        "end": 1441.84
    },
    {
        "text": " No nos gusta eso de que saca excelente en un tema, en los dos primeros temas y después prácticamente se rifa todo",
        "start": 1441.84,
        "end": 1450.84
    },
    {
        "text": " y con un puchito de punto ya le logró aconerar, ¿no? Tiene que tener un mínimo piscito ahí de puntaje, saber un poco de cada cosa.",
        "start": 1450.84,
        "end": 1458.84
    },
    {
        "text": " Bien, en ese caso entonces, ¿exo? ¿Qué es exo? Bueno, puede ser muchas cosas, en este caso es exonera, exo de exonera.",
        "start": 1458.84,
        "end": 1468.84
    },
    {
        "text": " Totalmente la instancia de examen, se olvían de economía, ya está, ¿pum? Pingba para la escolaridad una materia más, bien.",
        "start": 1468.84,
        "end": 1479.84
    },
    {
        "text": " Segunda posibilidad, que no alcance en 60, pero que sí obtengan más de 25, es decir que obtengan un puntaje entre 25 y 60.",
        "start": 1479.84,
        "end": 1491.84
    },
    {
        "text": " ¿Qué pasa en esa situación por razón de eso? Bien, ¿no van a poder exonerar la materia?",
        "start": 1491.84,
        "end": 1496.84
    },
    {
        "text": " Pero si adquieren el derecho a Alexa, que en este caso, pues es el quien, adquieren el derecho a Alexa.",
        "start": 1497.84,
        "end": 1506.84
    },
    {
        "text": " Ahí está. ¿Qué significa que puedo no adquir el derecho a Alexa? Sí, puede pasar que el estudiante no alcance entre las dos 25 puntos entre las dos.",
        "start": 1506.84,
        "end": 1521.84
    },
    {
        "text": " En una o otra me explico que no alcance 25 puntos, que saque, no sé, se presente a una sola o a las dos, 3 y 3, 6, ¿pum?",
        "start": 1522.84,
        "end": 1530.84
    },
    {
        "text": " Bueno, en ese caso el estudiante debe recursar la materia si es que quiera probar.",
        "start": 1530.84,
        "end": 1535.84
    },
    {
        "text": " No le vamos a permitir, digo, el reglamento no le permite, no es que el tipo, Mateo no le permite, no me el reglamento.",
        "start": 1535.84,
        "end": 1543.84
    },
    {
        "text": " ¿No lo sé, pero es lo mismo ahora, ¿no es que está la calidad de aire? Bueno, eso me lo dijeron ayer.",
        "start": 1544.84,
        "end": 1550.84
    },
    {
        "text": " Ayer una chica levanta, disculpe, profesor, este año se puede dar los exámenes libres. La respuesta fue, no tengo conocimiento.",
        "start": 1550.84,
        "end": 1562.84
    },
    {
        "text": " No tengo conocimiento, terminó la clase, le checa, lo miraba, mira, mira, mira, mira, mira, mira, ¿tú de normal le digo acá?",
        "start": 1562.84,
        "end": 1568.84
    },
    {
        "text": " Lo mismo, siempre, hubo unirse, todo tranquilo, primer día hablábamos, todo poco, y algunos no me preguntaron esto.",
        "start": 1568.84,
        "end": 1574.84
    },
    {
        "text": " Pa, no, vamos, tenés que averiguar. La Cátera de Economía, al día de hoy todavía no tiene conocimiento de esa situación de la calidad de libre que llama el compañero.",
        "start": 1574.84,
        "end": 1583.84
    },
    {
        "text": " No lo sabemos. Obviamente la Cátera pertenece una facultad.",
        "start": 1583.84,
        "end": 1588.84
    },
    {
        "text": " Si hay alguna norma superior que habilita a los estudiantes a proceder en las materias de alguna forma,",
        "start": 1589.84,
        "end": 1598.84
    },
    {
        "text": " obvio que hubiéramos preferido, y esto no lo grave, ¿no? Pero hubiéramos preferido que nos comunicaran.",
        "start": 1598.84,
        "end": 1604.84
    },
    {
        "text": " Me explico, no, oye día no sabemos, si me decís, se puede dar libre y te digo, ¿no? Me explico.",
        "start": 1604.84,
        "end": 1613.84
    },
    {
        "text": " Entonces, dejemos lo como pregunta. De última, ya tenés en el mail de contacto, ¿no?",
        "start": 1614.84,
        "end": 1621.84
    },
    {
        "text": " Deciaría estimados que si yo Cátera, ¿no es cuánto? Calitos, ¿no?",
        "start": 1621.84,
        "end": 1628.84
    },
    {
        "text": " O Cátera, no sé, a quién corresponde.",
        "start": 1628.84,
        "end": 1631.84
    },
    {
        "text": " Agradecería, me aclaré en esta situación, ¿verdad? Me explico, te invito a que los documentes, a que los documentes.",
        "start": 1631.84,
        "end": 1639.84
    },
    {
        "text": " Así ya probamos también cuanto tarba la respuesta del mail de economía.",
        "start": 1640.84,
        "end": 1645.84
    },
    {
        "text": " Pero tengo entendido hasta, ayer de noche no había respuesta, todavía de nada. No teníamos conocimiento.",
        "start": 1645.84,
        "end": 1653.84
    },
    {
        "text": " Está claro esto, digo, claro, queda la duda de compañero, pero no tengo nada para responderles.",
        "start": 1653.84,
        "end": 1659.84
    },
    {
        "text": " Vamos a tratar de la variedad, tener alguna novedad acerca de esa famosa calidad de libre,",
        "start": 1659.84,
        "end": 1665.84
    },
    {
        "text": " porque hasta ahora no existía el dar, el que el examen reglamentado y el da libre, y qué es la diferencia.",
        "start": 1666.84,
        "end": 1674.84
    },
    {
        "text": " Hasta ahora no diferenciábamos los examen, el examen de Juan y de María eran exactamente los mismos.",
        "start": 1674.84,
        "end": 1681.84
    },
    {
        "text": " Y entonces, ¿qué?",
        "start": 1681.84,
        "end": 1684.84
    },
    {
        "text": " ¿Qué es la que puse agua?",
        "start": 1685.84,
        "end": 1687.84
    },
    {
        "text": " Ah, que vos podés cadera, si mañana me escribo la facultad ingeniería y doy el examen de economía y nunca me reglamente.",
        "start": 1690.84,
        "end": 1699.84
    },
    {
        "text": " Como alumno, me escribo al curso, eso significa libre.",
        "start": 1699.84,
        "end": 1703.84
    },
    {
        "text": " Ah, bueno, ah, bueno.",
        "start": 1703.84,
        "end": 1706.84
    },
    {
        "text": " Está, bueno.",
        "start": 1707.84,
        "end": 1710.84
    },
    {
        "text": " Se yo he escuchado que me pidió el semestre, pero no te hicías.",
        "start": 1712.84,
        "end": 1715.84
    },
    {
        "text": " No, no, no, no, no, no.",
        "start": 1715.84,
        "end": 1718.84
    },
    {
        "text": " ¿Qué significa esto? ¿Qué es la única idea?",
        "start": 1718.84,
        "end": 1722.84
    },
    {
        "text": " Vamos a averiguar los urises, ustedes, por los canales de comunicación que a su respeto,",
        "start": 1722.84,
        "end": 1730.84
    },
    {
        "text": " vamos a averiguar los urises, ustedes, por los canales de comunicación que a su respeto,",
        "start": 1731.84,
        "end": 1736.84
    },
    {
        "text": " ¿cómo es que se llaman delegados, no?",
        "start": 1736.84,
        "end": 1739.84
    },
    {
        "text": " Consejeros estudiantiles o consejeros estudiantiles, y yo a la cátera y bueno, a la asistencia académica.",
        "start": 1739.84,
        "end": 1748.84
    },
    {
        "text": " Bueno, a ver, entonces, ¿más allá de esta última duda, cómo se cisonera, verdad?",
        "start": 1748.84,
        "end": 1757.84
    },
    {
        "text": " Quedo claro, de las pruebas, multiplopsión, alguna duda,",
        "start": 1757.84,
        "end": 1763.84
    },
    {
        "text": " si alguna tiene duda, digo, o más que duda, todavía como que le quede un poco ese sabor de check,",
        "start": 1766.84,
        "end": 1771.84
    },
    {
        "text": " ¿cómo será entre en la página del DC de economía, Bajan, Bajan,",
        "start": 1771.84,
        "end": 1776.84
    },
    {
        "text": " Bajan es el parcial de año pasado, me explico. Bajan lo y bichen lo.",
        "start": 1776.84,
        "end": 1781.84
    },
    {
        "text": " Es algo así, es más, esto es el examen del 14 de julio,",
        "start": 1781.84,
        "end": 1793.84
    },
    {
        "text": " las preguntas de descritivo, las preguntas de macroeconomía, las preguntas de economía americana tiene en Uruguay,",
        "start": 1793.84,
        "end": 1800.84
    },
    {
        "text": " las preguntas de microeconomía. Esto es un examen, ¿verdad?",
        "start": 1800.84,
        "end": 1804.84
    },
    {
        "text": " Se valúa todo, en el parcial, dos temas ¿no?",
        "start": 1804.84,
        "end": 1810.84
    },
    {
        "text": " Así, por lo que pasa por igual, pero la teada por igual, ¿no?",
        "start": 1810.84,
        "end": 1825.84
    },
    {
        "text": " Sí, perdón, perdón, perdón. ¿Eh?",
        "start": 1825.84,
        "end": 1830.84
    },
    {
        "text": " Son 30 por parcial 15 de cada tema y son 25 puntos de cada tema.",
        "start": 1830.84,
        "end": 1837.84
    },
    {
        "text": " Esa es la blota que pesa por igual, pero la teada por igual.",
        "start": 1837.84,
        "end": 1842.84
    },
    {
        "text": " Los cuatro bloques temáticos, Borises, son economías escritivas,",
        "start": 1842.84,
        "end": 1847.84
    },
    {
        "text": " que vamos a estar comenzando el día de hoy y en particular economías escritivas,",
        "start": 1847.84,
        "end": 1851.84
    },
    {
        "text": " voy a ser yo, que los voy a estar acompañando durante el desarrollo teórico,",
        "start": 1851.84,
        "end": 1856.84
    },
    {
        "text": " luego vendrá macroeconomía que ahí va a darse los carlos troncosos,",
        "start": 1856.84,
        "end": 1862.84
    },
    {
        "text": " es otro docente que interesa la cátera, carlos va a estar a cargo del bloque de macroeconomía",
        "start": 1862.84,
        "end": 1867.84
    },
    {
        "text": " que nos va a seguir a nosotros, una vez que finalicen con carlos macro,",
        "start": 1867.84,
        "end": 1873.84
    },
    {
        "text": " ahí vamos a la primera evaluación parcial, a la primera instancia evaluación parcial,",
        "start": 1873.84,
        "end": 1878.84
    },
    {
        "text": " donde se valúa tanto de escritiva, economía escritiva y macroeconomía,",
        "start": 1878.84,
        "end": 1882.84
    },
    {
        "text": " volvemos a clase, ¿verdad? Y aparecen nosotros temas,",
        "start": 1882.84,
        "end": 1885.84
    },
    {
        "text": " economía america latina y uruguay, ese tema lo va a estar dando a gustar o dutra,",
        "start": 1885.84,
        "end": 1890.84
    },
    {
        "text": " economista también, y después por último microeconomía, ¿verdad?",
        "start": 1890.84,
        "end": 1896.84
    },
    {
        "text": " que es el último tema que lo va a estar dando con Paul, ¿verdad?",
        "start": 1896.84,
        "end": 1904.84
    },
    {
        "text": " Bueno, habrán notado, habrán notado economía, economía escritiva, macroeconomía,",
        "start": 1904.84,
        "end": 1915.84
    },
    {
        "text": " economía de america latina y uruguay, microeconomía, Nene, ¿dónde vas?",
        "start": 1915.84,
        "end": 1921.84
    },
    {
        "text": " Mami tengo clase, hoy empiezo economía, ¿eh? ¿y qué es economía?",
        "start": 1921.84,
        "end": 1925.84
    },
    {
        "text": " Bueno, mira mamá, todavía no fue, déjame que vaya y te traigo data de qué significa economía,",
        "start": 1925.84,
        "end": 1935.84
    },
    {
        "text": " todavía no lo sé, ¿qué es economía? ¿A prioridad? ¿si qué preconcepto, qué idea tenemos?",
        "start": 1935.84,
        "end": 1944.84
    },
    {
        "text": " No, economía es una palabra no, no nueva y las trixamos por todos lados,",
        "start": 1944.84,
        "end": 1950.84
    },
    {
        "text": " las primimos, economía le usamos para de todo, todo esto parece algo de economía,",
        "start": 1950.84,
        "end": 1955.84
    },
    {
        "text": " microeconomía, macroeconomía, economía americana y economía de escritiva,",
        "start": 1955.84,
        "end": 1959.84
    },
    {
        "text": " noción de economía, ¿qué es economía? ¿qué es? ¿qué es?",
        "start": 1959.84,
        "end": 1964.84
    },
    {
        "text": " Es el nombre de una materia de facultad, ¿tá? Es el nombre de una facultad de ciencias económicas.",
        "start": 1964.84,
        "end": 1971.84
    },
    {
        "text": " Es el nombre de un ministerio, ministerio de economía, ¿no?",
        "start": 1972.84,
        "end": 1976.84
    },
    {
        "text": " Hay un ministro, Astoria, ¿no? Con todo Astoria, ministro de economía.",
        "start": 1977.84,
        "end": 1982.84
    },
    {
        "text": " Sección del diario, ya te veo la palabra, sección del diario, ¿cómo?",
        "start": 1983.84,
        "end": 1986.84
    },
    {
        "text": " Economía.",
        "start": 1986.84,
        "end": 1988.84
    },
    {
        "text": " Muchas veces no te hicieron metes ahí, economía. ¿qué es economía? ¿qué idea traen?",
        "start": 1989.84,
        "end": 1996.84
    },
    {
        "text": " Te escuchamos, fuerte.",
        "start": 1996.84,
        "end": 1999.84
    },
    {
        "text": " ¿qué es la idea de que estaba en el momento de la economía de escritiva?",
        "start": 2001.84,
        "end": 2006.84
    },
    {
        "text": " ¿qué es el pepio?",
        "start": 2006.84,
        "end": 2009.84
    },
    {
        "text": " Si fuera con Dorito diría plop y me tiraría para atrás,",
        "start": 2013.84,
        "end": 2020.84
    },
    {
        "text": " si fuera más moderno, haría, ¿qué es economía?",
        "start": 2020.84,
        "end": 2025.84
    },
    {
        "text": " ¿qué es economía? ¿no vamos a responder que es economía?",
        "start": 2025.84,
        "end": 2027.84
    },
    {
        "text": " Si no, que un amigo te confirmó que existe la posibilidad de dar libre la materia.",
        "start": 2027.84,
        "end": 2033.84
    },
    {
        "text": " Gracias por el dato. Bien. Buenísimo.",
        "start": 2033.84,
        "end": 2037.84
    },
    {
        "text": " No nos concentremos. ¿qué es economía? ¿qué hablamos? ¿tabó bien a este sitio?",
        "start": 2037.84,
        "end": 2042.84
    },
    {
        "text": " ¿qué entendemos, dije, bueno, al fin? ¿hay uno que quiere hablar?",
        "start": 2042.84,
        "end": 2046.84
    },
    {
        "text": " ¿qué es economía? ¿qué es economía? ¿qué es economía? ¿qué es economía?",
        "start": 2046.84,
        "end": 2052.84
    },
    {
        "text": " ¿qué es economía? ¿qué es lindo? ¿asulcito la celeste?",
        "start": 2052.84,
        "end": 2057.84
    },
    {
        "text": " ¿te preguntaron antes de venir a donde iba? No.",
        "start": 2071.84,
        "end": 2074.84
    },
    {
        "text": " ¿qué es economía? ¿comentaste con algún amigo, amigo?",
        "start": 2074.84,
        "end": 2078.84
    },
    {
        "text": " ¿alguien pareja, voy a clase economía? ¿che que es economía?",
        "start": 2078.84,
        "end": 2082.84
    },
    {
        "text": " ¿nás de te preguntó que era economía?",
        "start": 2082.84,
        "end": 2085.84
    },
    {
        "text": " Si tuvieran preguntado, ¿qué hubiera respondido? ¿qué idea?",
        "start": 2085.84,
        "end": 2092.84
    },
    {
        "text": " ¿qué es economía? ¿ni idea? ¿no te conmira? ¿no te conmira?",
        "start": 2092.84,
        "end": 2098.84
    },
    {
        "text": " ¿increible porque me suena?",
        "start": 2098.84,
        "end": 2101.84
    },
    {
        "text": " ¡hopa! ¿hopa, fuerte? ¿economía es?",
        "start": 2102.84,
        "end": 2105.84
    },
    {
        "text": " Bien, el compañero fue por el lado prolijo, dijo economía es una ciencia.",
        "start": 2105.84,
        "end": 2110.84
    },
    {
        "text": " Una ciencia está bien, es correcto, es una ciencia economía.",
        "start": 2113.84,
        "end": 2117.84
    },
    {
        "text": " ¿ca pasque al pasar por ahí? A mi se me pasó y hablaba de la ciencia económica",
        "start": 2117.84,
        "end": 2122.84
    },
    {
        "text": " o de la facultad de ciencia económica, ¿verdad?",
        "start": 2122.84,
        "end": 2125.84
    },
    {
        "text": " Economía claramente, está muy bien lo que decís, es una ciencia.",
        "start": 2125.84,
        "end": 2128.84
    },
    {
        "text": " ¿qué implicancia tiene que economía sea una ciencia?",
        "start": 2128.84,
        "end": 2132.84
    },
    {
        "text": " ¿a ver, o por partes? ¿qué sea una ciencia significa que hay algo que estudia?",
        "start": 2136.84,
        "end": 2141.84
    },
    {
        "text": " Dicho en palabras machetongas, tiene un objeto de estudio ¿verdad?",
        "start": 2142.84,
        "end": 2146.84
    },
    {
        "text": " Economía como ciencia tiene un objeto de estudio, pero lo aborda",
        "start": 2147.84,
        "end": 2151.84
    },
    {
        "text": " no de cualquier forma y a la que te criaste o de la manera que a mí me parece,",
        "start": 2152.84,
        "end": 2156.84
    },
    {
        "text": " sino que lo aborda desde algún tipo de metodología,",
        "start": 2156.84,
        "end": 2160.84
    },
    {
        "text": " es decir, como ciencia se tiene, se dispone de una aproximación al tema",
        "start": 2160.84,
        "end": 2165.84
    },
    {
        "text": " o lo que llamamos en términos científicos, un método de estudio,",
        "start": 2165.84,
        "end": 2168.84
    },
    {
        "text": " un método científico, un método de estudio.",
        "start": 2168.84,
        "end": 2171.84
    },
    {
        "text": " Hay un solo método de aproximación a los objetos de estudio, ¿no?",
        "start": 2171.84,
        "end": 2176.84
    },
    {
        "text": " ¿qué varios? ¿están métodos deductivos, el inductivo, el histórico estructural?",
        "start": 2176.84,
        "end": 2180.84
    },
    {
        "text": " Hay miles de métodos científicos para aproximarse a el objeto de estudio,",
        "start": 2180.84,
        "end": 2187.84
    },
    {
        "text": " pero claramente que economía hacía una ciencia significa que tiene un objeto,",
        "start": 2187.84,
        "end": 2192.84
    },
    {
        "text": " una cosa que estudia y lo estudia a través de un método, es correcto lo que dicen.",
        "start": 2192.84,
        "end": 2199.84
    },
    {
        "text": " ¿qué estudia economía? ¿a quién estudia? ¿qué tiene nuestro objeto de estudio?",
        "start": 2199.84,
        "end": 2205.84
    },
    {
        "text": " ¿qué es nuestro objeto de estudio? ¿quién? ¿a quién estudiamos?",
        "start": 2205.84,
        "end": 2210.84
    },
    {
        "text": " Las plantas y cómo se desarrollan las plantas, las fotosíntesis, ¿no?",
        "start": 2210.84,
        "end": 2219.84
    },
    {
        "text": " Estudia en los movimientos de terremotos, no de la tierra, ¿no?",
        "start": 2219.84,
        "end": 2225.84
    },
    {
        "text": " Estudia, ¿cómo se mueve el dinero?",
        "start": 2225.84,
        "end": 2231.84
    },
    {
        "text": " Estudia, ¿cómo se mueve el dinero? Estudia, ¿qué es eso de transacciones?",
        "start": 2231.84,
        "end": 2245.84
    },
    {
        "text": " ¿qué es eso de transacciones? ¿qué es transacciones? ¿qué sería eso?",
        "start": 2245.84,
        "end": 2251.84
    },
    {
        "text": " que negras instantá relate alaje잖아 no?",
        "start": 2251.84,
        "end": 2263.34
    },
    {
        "text": " ¿que es sorfarti de mandas? Hay una oferta de una manda...",
        "start": 2263.34,
        "end": 2280.84
    },
    {
        "text": " El mercado que suena el EQ, es una cosa, el mercado de ese compañero que es algo que existe ahí porque sí, ¿qué es el mercado?",
        "start": 2280.84,
        "end": 2291.84
    },
    {
        "text": " A alguien fue una vez algún mercado, fuiste al mercado, ¿eh? Al mercado del puerto, ¿fuiste una vez? ¿qué hay ahí?",
        "start": 2292.84,
        "end": 2302.84
    },
    {
        "text": " ¿eh?",
        "start": 2303.84,
        "end": 2304.84
    },
    {
        "text": " Hay cosas para comprar, ¿qué quien la compra?",
        "start": 2305.84,
        "end": 2307.84
    },
    {
        "text": " Las gente, las personas, ¿y quién lo ofrece?",
        "start": 2309.84,
        "end": 2312.84
    },
    {
        "text": " Otras personas que son empresas, ¿verdad? Por lo tanto nosotros no estudiamos la figura",
        "start": 2314.84,
        "end": 2320.84
    },
    {
        "text": " aislada de un mercado, la figura aislada de una transacción, estudiamos a las personas",
        "start": 2321.84,
        "end": 2328.84
    },
    {
        "text": " que son las personas las que realizan esas coacciones, que tienen esas conductas.",
        "start": 2328.84,
        "end": 2334.84
    },
    {
        "text": " Por tanto, nuestro objeto de estudio primero, pues eso te estaba tratando de llevar a la gente",
        "start": 2335.84,
        "end": 2340.84
    },
    {
        "text": " ¿qué está detrás de todo eso, de las transacciones, del intercambio? ¿qué está detrás de la oferta de la demanda?",
        "start": 2341.84,
        "end": 2346.84
    },
    {
        "text": " ¿Está la gente o no? Por lo tanto, el objeto de estudio de la ciencia económica son las personas.",
        "start": 2347.84,
        "end": 2355.84
    },
    {
        "text": " Diría algún contador, ¡ah, Mateo, tenés que aclarar personas físicas o personas jurídicas!",
        "start": 2355.84,
        "end": 2362.84
    },
    {
        "text": " ¿de carne, hueso o empresa? ¿Voy a en las dos? Por ahora en las dos, todas, todas las personas.",
        "start": 2363.84,
        "end": 2369.84
    },
    {
        "text": " Estudiamos conductas, por tanto, economía como ciencia es una ciencia social.",
        "start": 2370.84,
        "end": 2379.84
    },
    {
        "text": " ¿Qué es economía? Es una ciencia social, vamos avanzando, vamos avanzando.",
        "start": 2380.84,
        "end": 2386.84
    },
    {
        "text": " Por lo tanto, somos científicos sí, pero dentro de las ciencias estamos dentro de la rama de las ciencias sociales.",
        "start": 2387.84,
        "end": 2396.84
    },
    {
        "text": " ¿Por qué? Porque estudiamos nuestro objeto de estudio, como decía vos hace un rato, que son las plantas, no son las plantas.",
        "start": 2397.84,
        "end": 2404.84
    },
    {
        "text": " Son la atmósfera, la tierra, los terremotos, yo me he hecho y viva con alguien ahí de los movimientos,",
        "start": 2405.84,
        "end": 2411.84
    },
    {
        "text": " los terremotos no nos estudiamos, la tierra, el comportamiento de la tierra, ni nada de eso.",
        "start": 2412.84,
        "end": 2416.84
    },
    {
        "text": " Estudiamos las estructuras de los edificios tampoco, estudiamos la fuerza de los materiales,",
        "start": 2417.84,
        "end": 2421.84
    },
    {
        "text": " constructivos tampoco, estudiamos conductas, estudiamos a las personas y por eso,",
        "start": 2422.84,
        "end": 2426.84
    },
    {
        "text": " partencemos a las ciencias sociales.",
        "start": 2426.84,
        "end": 2429.84
    },
    {
        "text": " Fuerze, por favor, porque no. ¿El objeto de estudio de observador?",
        "start": 2436.84,
        "end": 2441.84
    },
    {
        "text": " Ah, bueno, el observador quien estudia forma parte de la sociedad que se estudiada claramente.",
        "start": 2445.84,
        "end": 2453.84
    },
    {
        "text": " ¿Y cómo tal la economía, el ser una ciencia social estudiar conductas?",
        "start": 2454.84,
        "end": 2459.84
    },
    {
        "text": " Pero entonces, ¿qué diferencia un economista de un psicólogo?",
        "start": 2460.84,
        "end": 2464.84
    },
    {
        "text": " Es decir, si algún día ando medio chapita, en vez de un psicólogo, capaz que hay algún economista que me cobra más rato",
        "start": 2465.84,
        "end": 2471.84
    },
    {
        "text": " y me cura todo lo mal, mirad, ¿toy tipo mal, ¿viste?",
        "start": 2472.84,
        "end": 2475.84
    },
    {
        "text": " Bueno, hablar con un economista, ¿por qué? Porque estudia conductas.",
        "start": 2476.84,
        "end": 2479.84
    },
    {
        "text": " Hacemos unos pesos con eso también, puede ser un boliche que tenga movierto.",
        "start": 2480.84,
        "end": 2485.84
    },
    {
        "text": " Atendemos de 5 a 7, ¿os otro hay con el mat? ¿Qué te pasa?",
        "start": 2486.84,
        "end": 2493.84
    },
    {
        "text": " No, estoy mal, ¿de qué? ¿Qué es yo?",
        "start": 2494.84,
        "end": 2497.84
    },
    {
        "text": " Ya mató, amigos, vamos, pero una musarela, bueno, ya está, se te mató los males.",
        "start": 2498.84,
        "end": 2503.84
    },
    {
        "text": " Bueno, ¿qué tipo de conductas estudiamos? Nosotros no estudiamos todas las conductas como sí, lo hacen, por ejemplo, los psicológicos que estudian el tema de las patologías, las enfermedades, de las locuras, estamos todos locos, ¿de dice?",
        "start": 2504.84,
        "end": 2516.84
    },
    {
        "text": " De fróis, esas cosas me arraras. No todo tipo de conductas estudiamos los economistas, sino que la economía estudia un aspecto, una parte de las conductas de las personas, preguntas cuáles.",
        "start": 2517.84,
        "end": 2528.84
    },
    {
        "text": " La industria financiera, las conductas financieras, ¿qué es eso de las conductas financieras?",
        "start": 2533.84,
        "end": 2540.84
    },
    {
        "text": " ¿Para qué? ¿Para qué gasta la plata, la gente? ¿Para qué fuerte?",
        "start": 2542.84,
        "end": 2549.84
    },
    {
        "text": " Cubrir necesidades, por lo tanto, todas las personas, todos ustedes, yo, todos nosotros, tenemos necesidades que queremos satisfazar o no, tenemos metas, tenemos objetivos.",
        "start": 2550.84,
        "end": 2564.84
    },
    {
        "text": " Si yo les pidiera ahora, saque en una hoja y escriban, ¿cuáles son las metas objetivos necesidades que quieren cumplir para hoy, para la semana, para este mes, para este semestre, para este año, seguramente empiece, no no.",
        "start": 2565.84,
        "end": 2582.84
    },
    {
        "text": " Algunos vayan por el lado más académico, salvar, exomerar todas las materias así, tengo el verano libre, conseguir trabajo, comer esta noche, no pasar frío de noche, arreglar la bolsa vocaliente. ¿Qué es eso?",
        "start": 2583.84,
        "end": 2604.84
    },
    {
        "text": " ¿Conseguir no o vía? ¿No?",
        "start": 2605.84,
        "end": 2608.84
    },
    {
        "text": " Uno puede establecer una, y de esas objetivos que cuantos son, cuantos, cuantos, cuantos metas tendrá cada uno.",
        "start": 2611.84,
        "end": 2619.84
    },
    {
        "text": " Es probable que si los dejamos, los dejo, uno sigue apoyendo uno, que esa lista se infinita, porque necesidades, metas, objetivos, las personas,",
        "start": 2620.84,
        "end": 2633.84
    },
    {
        "text": " las tenemos de forma ilimitada.",
        "start": 2633.84,
        "end": 2636.84
    },
    {
        "text": " Miles, muchas cosas quisieramos lo ver, pero las podemos gerar quizás. ¿Qué significa que la podemos gerar quizás, que hay algunas prioridades, obviamente.",
        "start": 2637.84,
        "end": 2645.84
    },
    {
        "text": " Irme de paseo, capaz que en verano, capaz que no es una prioridad, si no es una meta número uno, la meta número uno es, ¿qué es yo?",
        "start": 2646.84,
        "end": 2654.84
    },
    {
        "text": " Mañana de mañana, meta número uno, a ver, llegar en hora clase, bañarme que me dede el tiempo para desayunar, tomarme el hondi. ¿Qué quiero decir con esto? ¿Dónde estoy llendo qué objetivo, necesidades? Tenemos miles.",
        "start": 2655.84,
        "end": 2670.84
    },
    {
        "text": " Y para satisfacer esa necesidad de las personas contamos con lo que en economía llamamos recursos. ¿Qué son los recursos?",
        "start": 2671.84,
        "end": 2681.84
    },
    {
        "text": " En palabras comunes, todas aquellas cosas que disponemos, que tomándolas y usándolas administrando las de alguna forma, nos permiten satisfacer las necesidades.",
        "start": 2682.84,
        "end": 2697.84
    },
    {
        "text": " Por ejemplo, ¿qué recursos tenemos? ¿El tiempo? ¿Quién está hablando? ¿Tú? ¿No? ¿El tiempo es un recurso? ¿El tiempo muchas veces debe ser administrado? ¿Nunca nos pasó?",
        "start": 2697.84,
        "end": 2710.84
    },
    {
        "text": " Pá, tengo que llegar al asocho, no? Tengo 40 minutos y tengo que tanto, tanto, tanto, entonces ahí lo que aparece que es un razonamiento, donde trataré de optimizar el tiempo, no de organizarme, o no, de tal forma para poder cumplir con mi meta.",
        "start": 2710.84,
        "end": 2730.84
    },
    {
        "text": " Me explico, ¿qué otro recurso disponemos las personas para poder satisfacer necesidades en general? Para alimentarnos que le disponemos bueno, le disponemos alimentos, le disponemos de plata, el dinero, el efectivo es un recurso también, un recurso financiero, material, ¿no? Puntual, el dinero.",
        "start": 2731.84,
        "end": 2747.84
    },
    {
        "text": " Con el dinero nosotros podemos ir al super, compranos un refuerzo y alimentarnos esa noche, alimentarnos.",
        "start": 2747.84,
        "end": 2753.84
    },
    {
        "text": " La tierra es un recurso también, un recurso natural, el agua, el aire.",
        "start": 2755.84,
        "end": 2760.84
    },
    {
        "text": " Recursos hay también, pero los hay en cantidades ya no ilimitadas como eran los objetivos, las necesidades de las metas, que eran miles, para poder cumplir las metas.",
        "start": 2761.84,
        "end": 2778.84
    },
    {
        "text": " Contamos con recursos, pero los recursos son escasos, no tengo todo el tiempo del mundo para lograr, tengo que llegar a 8, no puedo llegar a 8, media el trabajo, porque me hecha.",
        "start": 2779.84,
        "end": 2790.84
    },
    {
        "text": " Primera idea de trabajo, entrevista, tengo que llegar a media hora, tengo que afaitarme, vestirme, no sé, no viremos pelota, tengo que vestirme, tengo que comer algo por lo nervio, tampoco mucho, no voy a comer un guiso alenteja, un guiso de por lo tanto antes.",
        "start": 2791.84,
        "end": 2806.84
    },
    {
        "text": " Hay un livianito, como va a sentirme, tranqui, opa, ¿qué tal? Acá yo soy estudiante, primer año, genería cada tipo, evitar el tipo, tipo nada, tipo no digo más, no sé, evitar el tipo, tipo como que soy estudiante y genería, y tipo que vengo a buscar trabajo y tipo que, bueno, se sigue usando el tipo, bueno.",
        "start": 2806.84,
        "end": 2835.84
    },
    {
        "text": " A ver si no me quiere por las ramas, de qué estoy hablando, qué tipo de conductas estudia, la ciencia económica, aquella que hace a las personas físicas jurídicas, aquella que hace a las personas a la hora de administrar estos recursos escasos para poder satisfacer necesidades, no todo tipo de conductas,",
        "start": 2836.84,
        "end": 2862.84
    },
    {
        "text": " decisiones de consumo, decisiones de producción, decisiones de satisfacer necesidades para el colectivo, cuando hablamos del Estado, por ejemplo, miles de decisiones, miles de conductas, esas son las que estudian la ciencia económica, y cómo tal es la conducta, haci dado que por las venas de la gente circula sangre,",
        "start": 2863.84,
        "end": 2886.84
    },
    {
        "text": " las conductas son muchas veces impresibles, dicho otra forma, puede pasar que a nivel de estudio, de preconcepto de estudio, entendamos que cierto comportamiento de una empresa será en un sentido y cuando llegó el momento de que actúe, actual en función de otros, no otra ruta, no fue por este lado que quizás esperábamos una conducta de este tipo,",
        "start": 2886.84,
        "end": 2912.84
    },
    {
        "text": " esperábamos que los consumidores actuaran de determinada forma y qué pasó, no vino nadie, ¿y qué pasó? el modelo económico estipulaba a un cierto conducta y sin embargo las personas fueron por otro lado, ¿qué pasó? es que en economía, 2 más 2 puede ser 5, y no es un problema que 2 más 2 sea 5 en economía, ¿por qué? ¿por qué estábamos en una ciencia social?",
        "start": 2912.84,
        "end": 2939.84
    },
    {
        "text": " no es una ciencia donde 2 más 2 va a ser 4, claro que a nivel de ingeniería seguramente a nivel de los que se dediquen a estructuras, verdad, grandes estructuras, al cálculo estructural de una represa, ahí el 2 más 2 no puede ser 5, ¿qué te dio? ¿y te dio 9, entonces pueden un fierro o hierro de 2014?",
        "start": 2939.84,
        "end": 2962.84
    },
    {
        "text": " bueno, traje 1 de 7, ¿eh lo mismo? no, no es lo mismo, ahí sí, se va a caer la represa o no, ¿eh? porque ahí ha sido más 2 es 4, pero cuando estudiamos conductas,",
        "start": 2962.84,
        "end": 2973.84
    },
    {
        "text": " ah, pensé que el tipo de cambio el dólar iba a quedar en 28, a fin de año, y está en 39, ¿qué pasó? ¿qué pasó? y bueno estamos en la ciencia social, pero un economista que me dijo que era probable que el tipo de cambio se quedaran 28,",
        "start": 2973.84,
        "end": 2989.84
    },
    {
        "text": " sí, te dijo que era probable, pero nunca esperes que la ciencia económica te adivine con certeza el futuro, porque por definición el futuro es, y usted lo tiene más claro que yo incierto,",
        "start": 2989.84,
        "end": 3004.84
    },
    {
        "text": " a los sumo podremos aproximarnos en términos de algún tipo de función de probabilidad, claro que podemos predecir el futuro, pero eso no significa adivinar o no,",
        "start": 3004.84,
        "end": 3016.84
    },
    {
        "text": " claro que podemos predecir a través de un modelo me voy al clima por ejemplo, podemos predecir cierta probabilidad o currencia de una tormenta porque estandaba las cuestiones, ¿no? pero puede pasar que no se concrète, bueno, lo que pasa en el clima pasa en la economía, ¿eh?",
        "start": 3016.84,
        "end": 3033.84
    },
    {
        "text": " Podemos ir aproximarnos, claro, y cuanto más información, cuanto más sepamos, más conozcamos, más herramientas de comprensión de la economía, tengamos más próximos a la realidad futuras teremos, mejor podremos proyectarnos, ¿eh?",
        "start": 3033.84,
        "end": 3055.84
    },
    {
        "text": " pero puede pasar que no se equivoquemos, claro que sí, y puede pasar que tengamos opiniones distintas respecto a algo, claro que sí, tan poco más claro entonces la economía que es, pero entonces la economía está asociado a plata,",
        "start": 3055.84,
        "end": 3073.84
    },
    {
        "text": " entonces si me salgo con una economista, me da ser millonario, bueno si es contadora capaz que, si es contador, ¿no? los contadores sí porque como están pa el peso, ¿eh?",
        "start": 3073.84,
        "end": 3084.84
    },
    {
        "text": " contador, contador está pa el peso, ¿fero? Contador es que sale a comer y cuantos pedazos de pisa comiste tu, porque tu comiste tres y tu cuatro, tu deberías pagar 13,8 pesos más,",
        "start": 3084.84,
        "end": 3099.84
    },
    {
        "text": " está horrible, está horrible, contadores chicas y chicos, contadores son bravo, son bravo, son bravo,",
        "start": 3099.84,
        "end": 3108.84
    },
    {
        "text": " a la madre no piensa, son como máquinas, son como impuestos, ingresos, costos, costos, costos salario, costos, ingresos, un embole, un embole, ¿eh?",
        "start": 3109.84,
        "end": 3127.84
    },
    {
        "text": " ese es el contador, no sé qué hace ahí en sí en el económica debería estudiar en, ¿eh? ¿dónde? ¿no sé? ¿qué no estudien directamente para aprender eso? ¿qué van a estudiar?",
        "start": 3127.84,
        "end": 3141.84
    },
    {
        "text": " bueno, ¿tamos acuerdo?",
        "start": 3141.84,
        "end": 3145.84
    },
    {
        "text": " ¿economía entonces está asusiado a plata, dinero y no porque la necesidad de muchas veces, ¿qué quiero decir con esto? ¿y con no siempre hubo dinero?",
        "start": 3145.84,
        "end": 3154.84
    },
    {
        "text": " hace mil años no había dinero, los billetes y las monedas en el lugar y crean menos, no nacieron hace 800 millones de años, ¿no?",
        "start": 3154.84,
        "end": 3165.84
    },
    {
        "text": " los charrúan, no usaban dinero y entonces que los charrúan los indios, ¿no? ¿no había economía cuando...",
        "start": 3165.84,
        "end": 3172.84
    },
    {
        "text": " no tenían que tomar decisiones de optimizar recursos para satisfacer necesidades, ¿ustedes? ¿oí? desde la mañana ni esta,",
        "start": 3172.84,
        "end": 3184.84
    },
    {
        "text": " ¿no hubo ningún momento en el día que tuvieron que hacer un razonamiento de administrar algo escaso para satisfacer necesidad?",
        "start": 3184.84,
        "end": 3193.84
    },
    {
        "text": " media día, boom, boom tengo hambre, boom eladera, what? un huevo, agua, una cebolla,",
        "start": 3194.84,
        "end": 3204.84
    },
    {
        "text": " manteca y está y una rosque quedó, y de ayer, ¿no? y bueno está y salió una tortilla ahí, de arroz, ¿no?",
        "start": 3205.84,
        "end": 3221.84
    },
    {
        "text": " ¿segollita? ¿no? huevo, ¿tabía? un poquito de queso ahí y si hay algún mapancetito o algo mejor todavía, ¿no?",
        "start": 3222.84,
        "end": 3233.84
    },
    {
        "text": " me explico, ¿ustedes? es muy probable que hayan hecho mucha economía hoy, tuvieron muchas veces que administrar recursos,",
        "start": 3233.84,
        "end": 3244.84
    },
    {
        "text": " y los casos para satisfacer objetivos, tuvieron que administrar tiempo para llegar en hora,",
        "start": 3244.84,
        "end": 3251.84
    },
    {
        "text": " seguramente ahora estarán pensando, ¿no? alguno capaz que tiene la cabeza, cuando salga de acá tengo que pasar por casa,",
        "start": 3251.84,
        "end": 3258.84
    },
    {
        "text": " a dejar todo, me duele un baño, me voy a los flanitos, la van a pasar buscar, voy y no sé cuánto,",
        "start": 3258.84,
        "end": 3262.84
    },
    {
        "text": " bueno estamos haciendo continuamente razonamientos económicos, pero economía va a existir si y solo si los recursos",
        "start": 3262.84,
        "end": 3273.84
    },
    {
        "text": " que administrar sean escasos, ¿qué quiero decir con esto? que si disponemos de recursos de forma ilimitada en cantidades extremadamente suficientes,",
        "start": 3273.84,
        "end": 3286.84
    },
    {
        "text": " me dice, mira, ¿tenes que armar un publicitario perfecto? ¿qué tiempo tengo?",
        "start": 3286.84,
        "end": 3292.84
    },
    {
        "text": " no, tomate el tiempo que quieras, barro perfecto, con cuánta gente voy a contar, no, la que quieras,",
        "start": 3292.84,
        "end": 3299.84
    },
    {
        "text": " gente contratala que quieras, estaba barro y presupuesto que tengo algún tope, no, no, lo que quieras, de plata lo que quieras,",
        "start": 3299.84,
        "end": 3307.84
    },
    {
        "text": " entonces en ese caso cuando los recursos que disponemos existen en cantidades ilimitadas, no hay escasen,",
        "start": 3307.84,
        "end": 3314.84
    },
    {
        "text": " no está presente en las casas, no hay que problema económico, no hay no hay economía que hacer ahí, me explico,",
        "start": 3314.84,
        "end": 3322.84
    },
    {
        "text": " muchas veces popularmente se usa el término economía para ahorro, che hay que hacer economía de la casa,",
        "start": 3322.84,
        "end": 3329.84
    },
    {
        "text": " economía ahorro, está mal usado, ¿verdad? economía no significa ahorro, ahorro es ahorro,",
        "start": 3329.84,
        "end": 3336.84
    },
    {
        "text": " economía tiene que ver con la administración de algo escaso para poder cumplir un objetivo,",
        "start": 3336.84,
        "end": 3343.84
    },
    {
        "text": " queda claro entonces ahora de qué trata la economía y muchas veces esto que decíamos, ¿no? ¿Estás asociada la plata?",
        "start": 3343.84,
        "end": 3350.84
    },
    {
        "text": " no, no, no, no, no, no, no, no, no, sólo cuando está el dinero presente está la economía,",
        "start": 3350.84,
        "end": 3358.84
    },
    {
        "text": " pero el economista trabaja solamente en lugar donde hay plata o no, o no, yo me recibí con una tesis que pretendía establecer medidas,",
        "start": 3358.84,
        "end": 3370.84
    },
    {
        "text": " establecer cuantías de equidad en salud, no hay un peso en juego, me explico y me recibié economista,",
        "start": 3370.84,
        "end": 3377.84
    },
    {
        "text": " al que voy un ejemplo, no digo, no tiene aprofinanzas, los economistas trabajan en la bolsa de valores,",
        "start": 3377.84,
        "end": 3386.84
    },
    {
        "text": " a un economista trabajan en un banco, a un economista, donde puede trabajar en milcas,",
        "start": 3386.84,
        "end": 3397.84
    },
    {
        "text": " porque la economía no es una técnica la cual aprendemos como un cirujano y va y el cirujano aplica su conocimiento con un fiamble,",
        "start": 3397.84,
        "end": 3408.84
    },
    {
        "text": " no, ojalá, por Dios, con un cuerpo adelante que quiero decir, no, me explico, un contador aplica sus conocimientos en una empresa,",
        "start": 3408.84,
        "end": 3422.84
    },
    {
        "text": " en cambio la economía es algo así como que la formación en economía una vez que conocemos,",
        "start": 3423.84,
        "end": 3430.84
    },
    {
        "text": " economía es como que se nos puso un lente, se nos puso un lente por lo tanto una vez que conocemos,",
        "start": 3430.84,
        "end": 3436.84
    },
    {
        "text": " de economía vamos a ver el mundo distinto, ¿qué significa ver el mundo distinto?",
        "start": 3436.84,
        "end": 3441.84
    },
    {
        "text": " vamos a entender ciertos comportamientos, vamos a poder anticiparnos y conocer los mecanismos de transmisión",
        "start": 3441.84,
        "end": 3449.84
    },
    {
        "text": " de este fenómeno tipo de cambio respecto a exportaciones, ¿por qué tiene que ver no las exportaciones con el tipo de cambio,",
        "start": 3449.84,
        "end": 3458.84
    },
    {
        "text": " ¿qué tiene que ver el déficit fiscal con el endeudamiento, ¿qué tiene que ver la inflación con la conducta del almacenero de la esquina?",
        "start": 3458.84,
        "end": 3469.84
    },
    {
        "text": " en función de que las personas toman decisiones de consumo, nosotros, ¿por qué no?",
        "start": 3470.84,
        "end": 3480.84
    },
    {
        "text": " si hay algún cambio en la estructura de preferencias de las personas, bueno, en las conductas en términos de demanda,",
        "start": 3480.84,
        "end": 3488.84
    },
    {
        "text": " en un marcado se van por otro lado, ¿cómo poder establecer medidas del fenómeno de la pobreza?",
        "start": 3488.84,
        "end": 3497.84
    },
    {
        "text": " lo medimos, esos fenómenos, entendemos algunas cosas, todas no,",
        "start": 3497.84,
        "end": 3506.84
    },
    {
        "text": " algún aspecto de la realidad la vamos a entender más que si tuvieramos formaciones medicinas o en arquitectura,",
        "start": 3506.84,
        "end": 3514.84
    },
    {
        "text": " cuando vamos por ahí con mi señora, me emociona esa arquitecta, obviamente ella,",
        "start": 3514.84,
        "end": 3518.84
    },
    {
        "text": " ¿paba, viste que lindo? ¿no sé cuánto, ese edificio, si cuánto de estilo barroco, de estilo que perdón, claro?",
        "start": 3518.84,
        "end": 3525.84
    },
    {
        "text": " no me detuvo, no me llamó la atención, me explico, el médico quizás mirando a los ojos a una persona hasta que",
        "start": 3525.84,
        "end": 3534.84
    },
    {
        "text": " a paz que detecta, ¿no? ¿to estado salud? y te dice, ¿pa? ¿Vos estás refriado? ¿te dice? ¿y cómo saber?",
        "start": 3534.84,
        "end": 3541.84
    },
    {
        "text": " bueno, me miró la cara, me miró los ojos, bueno, lo que tiene ojo clínico, ¿vieron cómo se dices? ¿cómo dicen por ahí?",
        "start": 3541.84,
        "end": 3546.84
    },
    {
        "text": " bueno, la economía algo pareció, no nos pone un par de lentas, una forma de ver, no es una técnica,",
        "start": 3546.84,
        "end": 3552.84
    },
    {
        "text": " no es que mañana, a ver, voy a ver que aprendo con economía y mañana voy y aplico, tipo algo utilitarista,",
        "start": 3552.84,
        "end": 3559.84
    },
    {
        "text": " utilitarista y repractico de voy y aplico, quiero aprender economía, voy y aplico en la realidad economía,",
        "start": 3559.84,
        "end": 3566.84
    },
    {
        "text": " ¿por qué soy economista? a ver, ¿qué nos va a pasar? y bueno, no sé, a ver, vamos a tener que aprender",
        "start": 3566.84,
        "end": 3573.84
    },
    {
        "text": " donde estábamos parado, a ver, ¿qué quieren es lo que preguntan? ¿qué querés? ¿qué te preocupa?",
        "start": 3573.84,
        "end": 3581.84
    },
    {
        "text": " ¿en qué te puedo ayudar? entendiendo eso, voy a ver despacio, ¿qué tenemos?",
        "start": 3581.84,
        "end": 3588.84
    },
    {
        "text": " abramos el adera juntos, a ver qué tenemos, un huevo, ¿no te desesperes? ¿y el economista dice bueno?",
        "start": 3588.84,
        "end": 3595.84
    },
    {
        "text": " pica en juliana de la cebolla y ahí empieza a no a solucionar el problema, a optimizar los recursos,",
        "start": 3595.84,
        "end": 3602.84
    },
    {
        "text": " es caso para satisfacer una necesidad ¿verdad? y la otra, bueno, ¿cuántos tenés? ¿cién peso?",
        "start": 3602.84,
        "end": 3609.84
    },
    {
        "text": " bueno, y trae tu entetra para brindar, ¿no? porque no me padecen efectivos, pero me invitas a comer y ahí nos quedamos todos contentos.",
        "start": 3609.84,
        "end": 3619.84
    },
    {
        "text": " bueno, me gusta la cocina si, me gusta mucho, si después quieren tipo comentar, intercambiar ideas, platos, ¿no?",
        "start": 3619.84,
        "end": 3634.84
    },
    {
        "text": " ¿no sé? ¿eh? ¿a algún idea tipo sí? o para compartir traer algo, me da mateo, preparé esta bella mail,",
        "start": 3634.84,
        "end": 3643.84
    },
    {
        "text": " traigo a cabo, bueno señor Nilsson, ¿no? bueno, ¿vúrese está claro entonces que esa economía más o menos,",
        "start": 3643.84,
        "end": 3654.84
    },
    {
        "text": " hablé mucho, dije mucha, mucha cosa de más, ¿no? quiero decir más o menos entonces economía, como sí,",
        "start": 3654.84,
        "end": 3663.84
    },
    {
        "text": " si tiene que ver con, es una ciencia social, domados después de ser cinco, y estudia conductas de las personas que hacen",
        "start": 3663.84,
        "end": 3674.84
    },
    {
        "text": " a la administración de recursos escasos para satisfacer necesidades, ¿tamos acuerdo?",
        "start": 3674.84,
        "end": 3681.84
    },
    {
        "text": " podemos decir que la ciencia económica la forma en tres grandes áreas de estudio, lo que vamos a",
        "start": 3681.84,
        "end": 3697.84
    },
    {
        "text": " pasar a comentar ahora son justamente las tres grandes áreas de estudio de la ciencia económica,",
        "start": 3697.84,
        "end": 3704.84
    },
    {
        "text": " ¿por qué es el institucio que va ahí? por un lado está la economía descriptiva, también llamada",
        "start": 3704.84,
        "end": 3717.84
    },
    {
        "text": " descripción económica o en el ambiente descriptiva, economía descriptiva, primera área de estudio,",
        "start": 3717.84,
        "end": 3725.84
    },
    {
        "text": " no te sé que tiene que ver, es el mismo nombre que el primer bloque temático, justamente,",
        "start": 3725.84,
        "end": 3730.84
    },
    {
        "text": " ahora vamos a comentar de qué trata, en segundo lugar como se fundaría de estudio tenemos la economía",
        "start": 3730.84,
        "end": 3736.84
    },
    {
        "text": " política, también llamada teoria económica, estoy presentando como se denomina las cuales son",
        "start": 3736.84,
        "end": 3747.84
    },
    {
        "text": " las tres grandes áreas de estudio de la ciencia económica, por un lado de la economía descriptiva,",
        "start": 3747.84,
        "end": 3752.84
    },
    {
        "text": " por otro lado la economía política o la teoría económica y entercer lugar la política,",
        "start": 3752.84,
        "end": 3761.84
    },
    {
        "text": " economía política o teoría en segundo lugar y entercer lugar la política económica,",
        "start": 3761.84,
        "end": 3771.84
    },
    {
        "text": " que me la están complicando, economía descriptiva, economía política, política económica,",
        "start": 3771.84,
        "end": 3777.84
    },
    {
        "text": " esto es el orden de los factores, a ver el mismo, no, no es lo mismo, ¿de qué trata la economía",
        "start": 3777.84,
        "end": 3783.84
    },
    {
        "text": " descriptiva? ¿de qué va a tratar el primer bloque temático que vamos a estar recorriendo aquí",
        "start": 3783.84,
        "end": 3789.84
    },
    {
        "text": " en esta materia de nociones de economía? ¿Qué hacemos cuando describimos algo? ¿Qué economía",
        "start": 3789.84,
        "end": 3796.84
    },
    {
        "text": " descriptiva describe la economía o no? si tuvieramos que responder en un examen o no, ¿qué responderías?",
        "start": 3796.84,
        "end": 3805.84
    },
    {
        "text": " no tengo ni idea, vaya, bueno la economía descriptiva por ejemplo verdad en mi opinión,",
        "start": 3805.84,
        "end": 3813.84
    },
    {
        "text": " y ahí lleno, lleno de palabras como para que parezca mucho, trata, se dedica a describir",
        "start": 3813.84,
        "end": 3819.84
    },
    {
        "text": " a la economía. Bueno, muy bien, excelente, no, ayer le recordé, a los guris de las 12 traíneas,",
        "start": 3819.84,
        "end": 3834.84
    },
    {
        "text": " de las 12 traíntas del curso, cuando una vez allá en macro, en facultad digo allá con",
        "start": 3834.84,
        "end": 3841.84
    },
    {
        "text": " ellos, en facultad en macro, una de las preguntas que vemos armada, era un curso introductorio",
        "start": 3841.84,
        "end": 3846.84
    },
    {
        "text": " en macro también, ¿no? ¿Qué es el PIB? ¿Pero el PIB, no? Cuando uno viene de un curso de macro,",
        "start": 3846.84,
        "end": 3853.84
    },
    {
        "text": " el PIB, el producto interrobruto, ¿no? pero claro en el ambiente le llamamos PIB como seguramente",
        "start": 3853.84,
        "end": 3859.84
    },
    {
        "text": " utilizan siglas también para muchas cosas, ¿no? o van a usar siglas para muchas cosas, ¿no?",
        "start": 3859.84,
        "end": 3864.84
    },
    {
        "text": " ¿no? ¿no? ¿del PIB? ¿qué es el PIB? y el PIB, el PIB es, los puntos, el producto internobruto,",
        "start": 3864.84,
        "end": 3871.84
    },
    {
        "text": " punto, entre otras cosas, perdía, entre otras cosas perdía, viene a lo que en facultad hay en la",
        "start": 3871.84,
        "end": 3879.84
    },
    {
        "text": " instancia de muestra de sobres, donde el alumno viene y el docente le muestra donde estuvieron sus",
        "start": 3879.84,
        "end": 3884.84
    },
    {
        "text": " errores ¿verdad? le comentan, mirad a cafallas, tienes esto, tiene derecho el alumno a verlo,",
        "start": 3884.84,
        "end": 3890.84
    },
    {
        "text": " a su prueba y viene en macuerdo y he estado de otro sentedí y clave el reclamado que le había",
        "start": 3890.84,
        "end": 3895.84
    },
    {
        "text": " respondido bien, porque nos habéis preguntado que es el PIB y el puso, el PIB es el producto interno",
        "start": 3895.84,
        "end": 3902.84
    },
    {
        "text": " bruto, que estaba bien la respuesta, ¿por qué no le damos los puntos? y bueno, no sé si me explico,",
        "start": 3902.84,
        "end": 3910.84
    },
    {
        "text": " tengo que explicar mucho, claro, no es un chiste, es una realidad, no sé un ejemplo acá,",
        "start": 3910.84,
        "end": 3917.84
    },
    {
        "text": " porque pueda pasar acá en ingeniería, que es, no sé, alguna unidad de medida que utiliza",
        "start": 3917.84,
        "end": 3925.84
    },
    {
        "text": " en siglas, hectáreas, hacheas, no sé, kilómetros, kilómetros, cae, ¿no? Bueno, no sé,",
        "start": 3925.84,
        "end": 3934.84
    },
    {
        "text": " no sé, no sé, no sé, claro, no sé, bueno, no sé, ¿qué es creando? ¿Ah, economía",
        "start": 3934.84,
        "end": 3940.84
    },
    {
        "text": " escritorio? ¿Qué hacemos cuando describimos algo? ¿Qué es creando? ¿Qué hacemos cuando",
        "start": 3940.84,
        "end": 3945.84
    },
    {
        "text": " describimos algo? ¿Quién está hablando? Bien, dale, te escucho. Damos información de lo que",
        "start": 3945.84,
        "end": 3957.84
    },
    {
        "text": " estamos definiendo, de como? Definiendo, describiendo, por tanto, cuando definimos algo y ciertamente",
        "start": 3957.84,
        "end": 3971.84
    },
    {
        "text": " la descripción de algo, primero empieza por definirlo, damos respuesta a la pregunta de ¿qué",
        "start": 3971.84,
        "end": 3980.84
    },
    {
        "text": " es tal cosa? ¿Verdad? Digo, empecemos por ahí, al describir primero definimos, mira, tal",
        "start": 3980.84,
        "end": 3985.84
    },
    {
        "text": " cosa es tanto, bueno, y a posteriori, si tuvieramos por ejemplo, describiendo, no sé,",
        "start": 3985.84,
        "end": 3993.84
    },
    {
        "text": " describiendo tu casa ideal, bueno, ahí empezaríamos con que o describirme tu casa, ¿dónde",
        "start": 3993.84,
        "end": 4002.84
    },
    {
        "text": " es? ¿Diríamos que tiene dos cuartos, no? O no, 80 metros cuadrados, en un tercer piso o no,",
        "start": 4002.84,
        "end": 4015.84
    },
    {
        "text": " ventanas, orientación norte, no sé, me explico, empezamos hasta al ejerque las características",
        "start": 4015.84,
        "end": 4027.84
    },
    {
        "text": " de la cosa que no, describimos a tu novia, bueno, mi novia es Juanita y ahí empezamos,",
        "start": 4027.84,
        "end": 4040.84
    },
    {
        "text": " no, de altura, el color del pelo, no, el peso que es yo, el color de ojo, eso rualla,",
        "start": 4040.84,
        "end": 4052.84
    },
    {
        "text": " o sea, es simpática, ¿está le hacemos las características de la persona o no? O no, no sé,",
        "start": 4052.84,
        "end": 4060.84
    },
    {
        "text": " capaz que nunca le preguntaron tipo de escriba a tu pareja, bueno, ¿qué me preguntas? ¿Qué",
        "start": 4060.84,
        "end": 4065.84
    },
    {
        "text": " te importa respuesta? ¿Por qué me estás preguntando? Bueno, porque estoy aprendiendo de economía",
        "start": 4065.84,
        "end": 4073.84
    },
    {
        "text": " y bueno, quiero saber cómo se esto de describir cosas, bueno, está, punto y ahí quedó, dos cuartos,",
        "start": 4073.84,
        "end": 4081.84
    },
    {
        "text": " orientación norte, la casa, ¿no? Descreíme cómo está el tiempo afuera, vos discrímelo, ¿cómo está",
        "start": 4081.84,
        "end": 4090.84
    },
    {
        "text": " el la tarde? ¿noche? Fresco, ¿por qué? ¿Por qué? ¿En qué te vas a hacer? Es una temperatura,",
        "start": 4090.84,
        "end": 4101.84
    },
    {
        "text": " seguro a alguien o me diste la temperatura y te digo 14 grados, bueno, eso te lleva a,",
        "start": 4101.84,
        "end": 4107.84
    },
    {
        "text": " es ti qué tal lo como fresco, porque la temperatura es de 14 grados o no, humedad, mucho humedad,",
        "start": 4107.84,
        "end": 4113.84
    },
    {
        "text": " la podemos medir también o no, la humedad relativa, 97% humedad o no, presión, está repesado,",
        "start": 4113.84,
        "end": 4121.84
    },
    {
        "text": " hay baja presión, mil cuatro hectopascales, ¿no? 97 hectopascales, ¿no? De presión, baja presión,",
        "start": 4121.84,
        "end": 4133.84
    },
    {
        "text": " ¿no? ¿Estamos acuerdo? Entonces, cuando estamos describiendo algo, no solamente respondemos el que",
        "start": 4133.84,
        "end": 4140.84
    },
    {
        "text": " está el cosa, sino además establecemos una medida de los fenómenos, establecemos una mensura,",
        "start": 4140.84,
        "end": 4150.84
    },
    {
        "text": " un cálculo número, por ejemplo, el clima fuera está en una temperatura de 14 grados,",
        "start": 4150.84,
        "end": 4160.84
    },
    {
        "text": " la presión de mil cuatro hectopascales, la humedad relativa, utilizamos herramientas para poder",
        "start": 4160.84,
        "end": 4167.84
    },
    {
        "text": " describir el clima fuera o no, medimos con un termómetro, la casa tiene tres cuartos,",
        "start": 4167.84,
        "end": 4174.84
    },
    {
        "text": " damos características objetivas al describir un fenómeno, lo hacemos de una forma 100% objetiva,",
        "start": 4174.84,
        "end": 4183.84
    },
    {
        "text": " en ningún momento cuando describimos algo aparece la subjetividad, sino que 100% objetivo,",
        "start": 4183.84,
        "end": 4192.84
    },
    {
        "text": " a ver que mi novia tiene el pelo oscuro, se llama Juanita, tiene ojos marrones, a ver para vos,",
        "start": 4193.84,
        "end": 4200.84
    },
    {
        "text": " tiene ojos marrones, para mí tiene ojos marrones para vos, para vos también tiene ojos marrones,",
        "start": 4200.84,
        "end": 4203.84
    },
    {
        "text": " no va a pasar, no, mira, para mí tiene ojos el este, no, a ver, no tiene, no tiene más rrones,",
        "start": 4203.84,
        "end": 4208.84
    },
    {
        "text": " explico, es decir, esas características que uno está describiendo son 100% objetivos,",
        "start": 4208.84,
        "end": 4214.84
    },
    {
        "text": " no va a aparecer dentro de la descripción y la descripción económica, no va a aparecer",
        "start": 4214.84,
        "end": 4219.84
    },
    {
        "text": " la subjetividad de la analista, en ningún momento por eso decimos que esta área donde se define",
        "start": 4219.84,
        "end": 4226.84
    },
    {
        "text": " y cuantifica los fenómenos es pura y estrictamente objetiva, la descripción económica subjetiva,",
        "start": 4226.84,
        "end": 4234.84
    },
    {
        "text": " la inflación, que es la inflación, como fenómeno de la realidad, la inflación representa el crecimiento",
        "start": 4234.84,
        "end": 4243.84
    },
    {
        "text": " del nivel general de precios, de vires y servicios al consumo, barbaro, lo estamos definiendo,",
        "start": 4243.84,
        "end": 4249.84
    },
    {
        "text": " la inflación se define así, para mí, para vos, para vos, para todo el mundo se define así,",
        "start": 4249.84,
        "end": 4254.84
    },
    {
        "text": " no hay tres definiciones distintas de la inflación, hay solo una y valida para todos y además,",
        "start": 4254.84,
        "end": 4262.84
    },
    {
        "text": " ¿cuánto fue la inflación del año pasado, 8%? Los precios, en promedio crecieron el año 2016,",
        "start": 4262.84,
        "end": 4269.84
    },
    {
        "text": " más o menos 1,8% por medio en el año, no va a aparecer a alguien que diga, no, mira,",
        "start": 4269.84,
        "end": 4278.84
    },
    {
        "text": " para mí la inflación no fue 8% el año pasado, fue 62,1, ¿qué? ¿Me explico?",
        "start": 4278.84,
        "end": 4286.84
    },
    {
        "text": " Yo la medí, no, no, a ver, hay una forma, valida de medir, no puede pasar que alguien te diga vos,",
        "start": 4286.84,
        "end": 4294.84
    },
    {
        "text": " no hace 14 grados, yo os voy a decir, perdón, yo utilicí un tormómetro y me dí como se debe medir,",
        "start": 4294.84,
        "end": 4301.84
    },
    {
        "text": " al reparo, que es yo, y venga, la burguría ya, y te diga, no, mira, hace 36 grados de temperatura,",
        "start": 4301.84,
        "end": 4310.84
    },
    {
        "text": " o que le vas a decir, ¿gotad de mente? ¿O hay algún tormómetro mal, ¿verdad?",
        "start": 4310.84,
        "end": 4316.84
    },
    {
        "text": " ¿O alguno está falsiando el dato? Porque el dato, la descripción es y debe ser objetivo,",
        "start": 4316.84,
        "end": 4324.84
    },
    {
        "text": " no debe primar la ideología de la analista, no debe primar nada, es estrictamente objetivo.",
        "start": 4324.84,
        "end": 4330.84
    },
    {
        "text": " La inflación es para todos igual, me explico, entonces ¿qué vamos a hacer acá en economía",
        "start": 4330.84,
        "end": 4337.84
    },
    {
        "text": " de escribito? Vamos a definir fenómenos y vamos a establecer medidas de los fenómenos económicos,",
        "start": 4337.84,
        "end": 4343.84
    },
    {
        "text": " del desempleo, de la pobreza, de la inflación, del saldo de la balanza comercial, de las exportaciones,",
        "start": 4343.84,
        "end": 4350.84
    },
    {
        "text": " del producto gruto interno, del crecimiento de la producción de un país, ¿cómo se mide la producción de un país?",
        "start": 4350.84,
        "end": 4357.84
    },
    {
        "text": " De todo eso vamos a hablar en este bloque temático de economía de escribito.",
        "start": 4357.84,
        "end": 4363.84
    },
    {
        "text": " Pero alguien estará diciendo para hace un rato, decíamos que 2 más 2 podía hacer 5 con economía,",
        "start": 4364.84,
        "end": 4369.84
    },
    {
        "text": " sí, es verdad, pero en economía de escribito no.",
        "start": 4369.84,
        "end": 4373.84
    },
    {
        "text": " En todo lo otro sí, justo en economía de escribito cuando aparece la mensura,",
        "start": 4375.84,
        "end": 4380.84
    },
    {
        "text": " cuando aparece el cálculo, ahí te llevo que 2 más 2 tienes que ser 4, no hay otra,",
        "start": 4380.84,
        "end": 4386.84
    },
    {
        "text": " no puede ser que a ver a mí me dio 8% la inflación y a Jorge Ojoanita le dio 38, no,",
        "start": 4387.84,
        "end": 4395.84
    },
    {
        "text": " no, me explico, está claro lo que estoy diciendo, bien, una vez que definimos y establecemos la medida",
        "start": 4395.84,
        "end": 4405.84
    },
    {
        "text": " de los fenómenos el que y el cuánto respondemos esas 2 preguntas, ¿qué es y a cuánto fue verdad la medida",
        "start": 4405.84,
        "end": 4415.84
    },
    {
        "text": " pasamos a la segunda área que es la economía política o la teoría, es en esta área donde aparecen",
        "start": 4416.84,
        "end": 4425.84
    },
    {
        "text": " los cuestionamientos, aparece la pregunta, aparece la inquietud, ¿por qué fue 8%?",
        "start": 4425.84,
        "end": 4435.84
    },
    {
        "text": " ¿Cuáles son las causas que llevaron a que la inflación haya sido de 8% el año pasado?",
        "start": 4435.84,
        "end": 4442.84
    },
    {
        "text": " ¿Acaso fue la sequía de mitad de año que explica la escasez de producción y suficiencia",
        "start": 4443.84,
        "end": 4452.84
    },
    {
        "text": " oferta, exceso de demanda en los marcados que explica que los precios haya crecido 8%?",
        "start": 4452.84,
        "end": 4458.84
    },
    {
        "text": " Aparecen también preguntas como por ejemplo ¿qué consecuencias tiene?",
        "start": 4458.84,
        "end": 4463.84
    },
    {
        "text": " Es bueno o es malo, también aparece acá en la economía política, en la teoría, los cuyos",
        "start": 4464.84,
        "end": 4473.84
    },
    {
        "text": " de valor, es mucho o es poco, es hace calor o hace frío, está linda o está fea la tarde,",
        "start": 4473.84,
        "end": 4480.84
    },
    {
        "text": " ahora, tarde noche ¿verdad? Está linda o está fea, está linda, está linda,",
        "start": 4480.84,
        "end": 4488.84
    },
    {
        "text": " está linda, horrible, humedad, frío, humedad, tú, linda o feo la tarde, linda, linda,",
        "start": 4488.84,
        "end": 4505.84
    },
    {
        "text": " mi señoras estuviera acá a iria espantosa, los pelos yo tengo así con la humedad que hay,",
        "start": 4506.84,
        "end": 4513.84
    },
    {
        "text": " pues sufre de la humedad, bueno no sé, capaz que alguna le pasa o alguna le pasa que tiene",
        "start": 4513.84,
        "end": 4520.84
    },
    {
        "text": " pelos, no sé, la humedad le deja los pelos chup, bueno ¿a qué voy con esto?",
        "start": 4520.84,
        "end": 4528.84
    },
    {
        "text": " Es guri dice que está linda, es guri dice que está feo, ¿quién tiene razón?",
        "start": 4529.84,
        "end": 4533.84
    },
    {
        "text": " Está horrible la tarde, tienes que creer que está horrible la tarde, yo voy a ser mirada,",
        "start": 4536.84,
        "end": 4541.84
    },
    {
        "text": " Mateo, para mí está linda la tarde, tienes que creer que está horrible, está refriido,",
        "start": 4541.84,
        "end": 4547.84
    },
    {
        "text": " Mateo, 14 grados no es tanto frío, bueno sí está horrible, frío y ahí nos empezamos",
        "start": 4547.84,
        "end": 4552.84
    },
    {
        "text": " tipo a matar a ver, está mal que pensemos distinto, está mal que sintamos distinto,",
        "start": 4553.84,
        "end": 4559.84
    },
    {
        "text": " está mal que él crea que es mucho vospoco, es alto o bajo, la infracción del año pasado",
        "start": 4559.84,
        "end": 4564.84
    },
    {
        "text": " 8%, entonces es mucho vospoco, ¿quién cree que es mucho? ¿quién cree que es poco?",
        "start": 4564.84,
        "end": 4571.84
    },
    {
        "text": " Esto es típico de contador que no se la juega por nada, ¿eh?",
        "start": 4574.84,
        "end": 4577.84
    },
    {
        "text": " El contador, sí, con los contadores como que no se la juega, no pina, no sirve para nada,",
        "start": 4578.84,
        "end": 4585.84
    },
    {
        "text": " no sé qué hacen, bueno es mucho vospoco de la inflación, es un problema,",
        "start": 4585.84,
        "end": 4591.84
    },
    {
        "text": " la inflación, los precios que crecen, es un problema o no es un problema,",
        "start": 4591.84,
        "end": 4596.84
    },
    {
        "text": " está todo barba, lo venimos bien, es un problema o no, ¿no? ¿no qué?",
        "start": 4596.84,
        "end": 4603.84
    },
    {
        "text": " No sabes ni idea, es un problema, es mucho, es poco, es normal, bien, ¿quién tiene ustedes?",
        "start": 4604.84,
        "end": 4617.84
    },
    {
        "text": " 18, 19, más o menos, ¿eh? No te tire de crocante, ¿quién dijo así tipo,",
        "start": 4617.84,
        "end": 4624.84
    },
    {
        "text": " sobrado 21? ¿quién? 21, me tiraba, bueno vos, ¡ahí está, el grande de 21, bueno,",
        "start": 4624.84,
        "end": 4632.84
    },
    {
        "text": " yo te he añadido ustedes un poquito menos, un poco menos, ¿por qué me acuerdo de tenía",
        "start": 4632.84,
        "end": 4638.84
    },
    {
        "text": " bueno un poco menos? El 89 por ejemplo, un poco menos, ¿eh? ¿por qué tenía 130% a no el año?",
        "start": 4638.84,
        "end": 4647.84
    },
    {
        "text": " 89, tuvo 130%, ¿eh? Argentina del 88, teníamos menos 1500% de inflación a no el, ¿eh?",
        "start": 4647.84,
        "end": 4656.84
    },
    {
        "text": " Sí, y Brasil, más o menos por esa época, con el plan cruzado, el cruzadinho,",
        "start": 4656.84,
        "end": 4660.84
    },
    {
        "text": " teníamos sombras también 2500% de inflación, tuvimos 8, ¿verdad? Eso es un dato objetivo,",
        "start": 4660.84,
        "end": 4670.84
    },
    {
        "text": " entonces quién dijo normal? Choto y choto, para mí el problema de precio, no es un problema,",
        "start": 4670.84,
        "end": 4683.84
    },
    {
        "text": " no hay que hacer nada con los precios, no hay que hacer nada, suban tranquilo, no pasa nada,",
        "start": 4683.84,
        "end": 4689.84
    },
    {
        "text": " 8 por ciento no hay nada, ¿no? ¿Qué la gente que te conviene que peso fue a contar?",
        "start": 4689.84,
        "end": 4696.84
    },
    {
        "text": " Sí, ya hay gente que dice que va al supermercado, no le da el sueldo, no sé ni qué es eso,",
        "start": 4696.84,
        "end": 4706.84
    },
    {
        "text": " yo no soy trabajador, yo tengo un minario, yo soy empresario, tengo una 12 estación",
        "start": 4706.84,
        "end": 4712.84
    },
    {
        "text": " en el servicio y un pozo petrolero y no, ¿eh? Y después dos clases acá en facultad de ingeniería,",
        "start": 4712.84,
        "end": 4720.84
    },
    {
        "text": " de onda, ¿eh? No, sí hay gente que se reprecupa, escribe los diarios,",
        "start": 4720.84,
        "end": 4727.84
    },
    {
        "text": " en los grupos de guazado, eh, esto es terrible, yo activaron, ¿no? Ahora me voy a cenar,",
        "start": 4727.84,
        "end": 4738.84
    },
    {
        "text": " en los tránsitos, el fila que habrá ahí, en el prado, no nuevo, 3000 pesos el plato,",
        "start": 4738.84,
        "end": 4743.84
    },
    {
        "text": " tranqui, sacamos tarjeta, ¿no me quede con sueldo en esta silla? Es mucho, ¿no?",
        "start": 4743.84,
        "end": 4750.84
    },
    {
        "text": " ¿no? ¿y si crecieran un 100% significa que se duplican verdad, si no coba cola valía 20 pesos",
        "start": 4751.84,
        "end": 4764.84
    },
    {
        "text": " hoy y la inflación fuera del 100% significa que la coba cola salía 20, ¿dejad?",
        "start": 4764.84,
        "end": 4771.84
    },
    {
        "text": " El año que viene sale 40, es decir, se multiplica por 2, eso si crece 100%, si crece, ¿eh?",
        "start": 4771.84,
        "end": 4779.84
    },
    {
        "text": " El precio estoy hablando, no estoy hablando del poder de compra, el salario,",
        "start": 4779.84,
        "end": 4786.84
    },
    {
        "text": " no te sé que es otra cosa, por eso yo un poco jugaba de que a mí el tema no me interesa",
        "start": 4786.84,
        "end": 4791.84
    },
    {
        "text": " porque yo no soy asalariado, a ver, cuando el tema de cuánto representa un 2,500%",
        "start": 4791.84,
        "end": 4799.84
    },
    {
        "text": " lo puedes calcular, ¿verdad? Bueno, incrementaba una vari, un precio,",
        "start": 4799.84,
        "end": 4805.84
    },
    {
        "text": " una variable un 2,500% y a regal un 2,500% ¿no? Si cienes uno más, ¿eh?",
        "start": 4805.84,
        "end": 4814.84
    },
    {
        "text": " a regal de 2,500, 250 más, se multiplica por 250 veces, si no coba cola valía 10 pesos",
        "start": 4814.84,
        "end": 4823.84
    },
    {
        "text": " es el que viene vale 2,500 ¿verdad? Es mucho, 2,500% bueno, ¿eh?",
        "start": 4823.84,
        "end": 4834.84
    },
    {
        "text": " Si, digo si, el capaco me estoy confundiendo yo, calculen, ¿verdad? Es un cálculo de",
        "start": 4834.84,
        "end": 4838.84
    },
    {
        "text": " percentage, ¿eh? Ahora, no me pierna a mí, ahora me puedo estar equivocando, pero si",
        "start": 4838.84,
        "end": 4843.84
    },
    {
        "text": " representa un aumento, ¿cuál es tu duda? No entendí entonces la duda.",
        "start": 4843.84,
        "end": 4846.84
    },
    {
        "text": " No, no estoy conmigo, pero me voy a ver, ¿dejad?",
        "start": 4846.84,
        "end": 4849.84
    },
    {
        "text": " Y hay países que pueden tener 10,000% de inflación anual y perinflaciones, ¿verdad?",
        "start": 4849.84,
        "end": 4856.84
    },
    {
        "text": " Sí, Venezuela hoy, no entro en el tema político, entro en el tema económico, hoy en Venezuela",
        "start": 4856.84,
        "end": 4861.84
    },
    {
        "text": " hay hiperinflación, hiperinflación, ¿si? El sistema de precios prácticamente no existe,",
        "start": 4861.84,
        "end": 4867.84
    },
    {
        "text": " ¿por qué? Porque los precios sabrían que ajustarlo por millones todos los días, ¿si?",
        "start": 4867.84,
        "end": 4871.84
    },
    {
        "text": " Para pagar un café, tienes que ir al banco y te van a dar una caja con, ¿si?",
        "start": 4871.84,
        "end": 4876.84
    },
    {
        "text": " Faco de billetes, como cuando me tocó a mí, cuando hice, como me compañero",
        "start": 4876.84,
        "end": 4882.84
    },
    {
        "text": " se viaje ese económico, ¿verdad? En año 2000 ya hace un tiempo, pero bueno, cuando",
        "start": 4882.84,
        "end": 4887.84
    },
    {
        "text": " hicimos el viaje caímos a Turquía, ¿no? Fuebimos a cambiar liras turcas que se yo, ¿eh?",
        "start": 4887.84,
        "end": 4892.84
    },
    {
        "text": " Y vamos con Pranko Vocheda y una coacura cuando sale 1,800,000 liras turcas, una cocucha",
        "start": 4892.84,
        "end": 4897.84
    },
    {
        "text": " de la lata, sí, 1,800,000 liras turcas, la lira turca había tanta inflación, los precios crecian",
        "start": 4897.84,
        "end": 4905.84
    },
    {
        "text": " tanto que ya se hablaba de millones, me explico, ni te digo un sueldo y cuándo cobrás",
        "start": 4905.84,
        "end": 4911.84
    },
    {
        "text": " 60 billones de liras turcas, me explico, o decir, ya es un disparate, muchas veces cuando",
        "start": 4911.84,
        "end": 4917.84
    },
    {
        "text": " las economías entran ni preinflaciones, lo que hacen es modificar, ¿no? Justo esto",
        "start": 4917.84,
        "end": 4921.84
    },
    {
        "text": " lo vamos a comentar después, más adelante, ¿no? Modifican su sistema de precios, les",
        "start": 4921.84,
        "end": 4925.84
    },
    {
        "text": " sacan cero salas nominaciones, Uruguay en el año 91, ¿no? Realizó una conversión de su",
        "start": 4925.84,
        "end": 4931.84
    },
    {
        "text": " vieja moneda, que era el nuevo peso al peso Uruguay, que conocemos ustedes y el rango de equivalencia",
        "start": 4931.84,
        "end": 4936.84
    },
    {
        "text": " era 1,000, los 1,000 nuevos pesos de antes, equivalían a un peso nuevo en el, nuevo, no, un",
        "start": 4936.84,
        "end": 4944.84
    },
    {
        "text": " peso Uruguay en el año 91, ¿sí? Y un confite, un chocolate salía 10 centésimos de nuevo",
        "start": 4944.84,
        "end": 4953.84
    },
    {
        "text": " pero obviamente no existiría ahora, no me quiero detener tampoco tanto del tema inflacionario,",
        "start": 4953.84,
        "end": 4961.84
    },
    {
        "text": " pero lo que hoy es cuando establecemos juicios de valor de algo, ¿no? Así que tu novia,",
        "start": 4961.84,
        "end": 4969.84
    },
    {
        "text": " mí de tanto, tiene ojo marrones, tanto es linda, perdón, eso lo digo yo, ¿no? Cuando uno",
        "start": 4969.84,
        "end": 4976.84
    },
    {
        "text": " vive a Novia, el juicio de valor lo pongo yo, che, fea tu novia, bueno, no te pedió piñón,",
        "start": 4976.84,
        "end": 4983.84
    },
    {
        "text": " bueno, la valoración es subjetiva, por tanto en economía puede pasar y va a pasar que tengamos",
        "start": 4983.84,
        "end": 4991.84
    },
    {
        "text": " distinta opinión sobre un mismo fenómeno, lo que estaba diciendo de la inflación más allá de",
        "start": 4991.84,
        "end": 4996.84
    },
    {
        "text": " unos datos ciertos que maneje lo que estaba diciendo del posto petroleo se podrá imaginar que no es real,",
        "start": 4996.84,
        "end": 5001.84
    },
    {
        "text": " no, yo no sé si tengo que aclararlo, creo que no, bueno, sí, tres minutos quedan todavía,",
        "start": 5001.84,
        "end": 5011.84
    },
    {
        "text": " ¿no? Porque me queda hablar de la política económica, en tres palabras, tenemos definido",
        "start": 5011.84,
        "end": 5022.84
    },
    {
        "text": " la inflación, la tenemos medida, de eso se encarbe la economía scriptiva, tenemos analizado el por qué",
        "start": 5022.84,
        "end": 5033.84
    },
    {
        "text": " aumentaron los precios y entendimos que la causa estaba en esto, en tal aspecto, también establecemos",
        "start": 5033.84,
        "end": 5041.84
    },
    {
        "text": " un juicio de valor de que es malo, las consecuencias son negativas de la inflación de la",
        "start": 5041.84,
        "end": 5047.84
    },
    {
        "text": " inflación de la inflación de la inflación de la inflación de la inflación por lo tanto, de ser así,",
        "start": 5047.84,
        "end": 5050.84
    },
    {
        "text": " la política económica, lo que va a tratar es de diseñar la mejor estrategia para corregir",
        "start": 5050.84,
        "end": 5057.84
    },
    {
        "text": " el problema, la política económica tiene que ver con la acción de transformación de la",
        "start": 5057.84,
        "end": 5064.84
    },
    {
        "text": " realidad, en una realidad mejor, política económica, política tiene que ver, repito con actuar",
        "start": 5064.84,
        "end": 5073.84
    },
    {
        "text": " sobre algo, sobre la realidad para transformarla en algo mejor, cuando hablamos de política",
        "start": 5073.84,
        "end": 5080.84
    },
    {
        "text": " económica tiene que ver justamente con esto, política económica de más que están manos de quién,",
        "start": 5080.84,
        "end": 5086.84
    },
    {
        "text": " de la seor de política de estatada, de pública, ¿qué quién es? El Estado, ¿verdad? ¿Qué impost de algún",
        "start": 5086.84,
        "end": 5093.84
    },
    {
        "text": " objetivo que establezca que sea lo mejor para la sociedad, eso lo establece cada uno de los",
        "start": 5093.84,
        "end": 5098.84
    },
    {
        "text": " ciudadanos de política y también hay diferencia entre cuál es el objetivo de política pública",
        "start": 5098.84,
        "end": 5104.84
    },
    {
        "text": " para uno, que para otro, por eso hay diferencias que vemos por ahí o no, por eso es que los",
        "start": 5104.84,
        "end": 5109.84
    },
    {
        "text": " gobernantes a opinan distintos, los gobernantes a ver y hay el oscuro que opinan distintos,",
        "start": 5109.84,
        "end": 5114.84
    },
    {
        "text": " porque ven la realidad distinto, eso no está mal y por ende las soluciones, las mecanismo",
        "start": 5114.84,
        "end": 5121.84
    },
    {
        "text": " de acciones son distintos también, me explico, úrices, bien.",
        "start": 5121.84,
        "end": 5126.84
    }
]