[
    {
        "text": " Entonces, ¿qué lo que estamos viendo? Estamos analizando en un mercado de competencia",
        "start": 0.0,
        "end": 26.32
    },
    {
        "text": " perfecta. ¿Cómo impacta eso en la economía de binestar? Esto es la distribución",
        "start": 26.32,
        "end": 33.0
    },
    {
        "text": " de los diferentes agentes de esos bienes que se dan el equilibrio. Y ahí habíamos",
        "start": 33.0,
        "end": 39.4
    },
    {
        "text": " definido lo que era el excedente del consumidor que lo tomamos como la diferencia entre lo que",
        "start": 39.4,
        "end": 47.120000000000005
    },
    {
        "text": " estaba dispuesto a pagar y lo que efectivamente paga en el precio por el precio del bien dado",
        "start": 47.120000000000005,
        "end": 53.120000000000005
    },
    {
        "text": " por el mercado. Esa área está por debajo de la cura de demanda, definitiva que la",
        "start": 53.12,
        "end": 58.599999999999994
    },
    {
        "text": " depoición apaga el consumidor con el precio efectivamente pagado es el excedente del consumidor.",
        "start": 58.599999999999994,
        "end": 64.64
    },
    {
        "text": " El otro concepto que vimos era el excedente del productor que era justamente la diferencia",
        "start": 64.64,
        "end": 75.12
    },
    {
        "text": " entre el precio que realmente recibe el productor por la venta de ese producto presionado por",
        "start": 75.12,
        "end": 81.0
    },
    {
        "text": " el mercado, que es el mismo que paga el consumidor, menos el costo mínimo que está requiriendo",
        "start": 81.0,
        "end": 87.76
    },
    {
        "text": " para ofrecer ese producto en el mercado dado por su cubo oferta los costos de oportunidad.",
        "start": 87.76,
        "end": 95.8
    },
    {
        "text": " Esa área definitiva hacía que obtenía esto que se conoce como el excedente del consumidor.",
        "start": 97.03999999999999,
        "end": 105.84
    },
    {
        "text": " Acá se ve por ejemplo que el ingreso del consumidor es obviamente P por Q, o sea P por Q sería",
        "start": 105.84,
        "end": 118.92
    },
    {
        "text": " esta área. Bueno justamente esto que está asombrado acá sería los mínimos requirimientos que",
        "start": 118.92,
        "end": 127.92
    },
    {
        "text": " estáis siguiendo el productor para cobrar, para percibir, por vender ese bien, como recibe todo esto",
        "start": 127.92,
        "end": 134.08
    },
    {
        "text": " está área blanca digamos sin sumbir sería justamente eso que se conoce como excedente del productor.",
        "start": 134.08,
        "end": 139.88000000000002
    },
    {
        "text": " Dei que el excedente del productor se calcula como la diferencia entre el precio mínimo que el",
        "start": 142.88000000000002,
        "end": 147.44
    },
    {
        "text": " productor está dispuesto a cobrar y el costo marginal de cada una de las unidades como les me llenaba",
        "start": 147.44,
        "end": 153.16000000000003
    },
    {
        "text": " anteriormente. Uniendo estos dos conceptos tenemos el excedente total de la economía,",
        "start": 153.16,
        "end": 164.56
    },
    {
        "text": " el excedente social, es decir el excedente del consumidor y el excedente del productor nos da el",
        "start": 165.56,
        "end": 174.8
    },
    {
        "text": " excedente que tiene la economía en su conjunto. Me acabo competencia perfecta, me acabo del",
        "start": 174.8,
        "end": 182.68
    },
    {
        "text": " cual el precio está dado por el mercado donde ese precio y bueno obviamente la cantidad se va a",
        "start": 182.68,
        "end": 191.24
    },
    {
        "text": " determinar por la interacción de la fertilidad de manda básicamente el importante acá de esta",
        "start": 191.24,
        "end": 196.4
    },
    {
        "text": " cara es que no hay ninguna interferencia en esa interacción, no hay ninguna gente que interviene para",
        "start": 196.4,
        "end": 203.84
    },
    {
        "text": " distorsionar esa asignación de precios o de cantidades. Entonces en ese entorno, en ese contexto",
        "start": 203.84,
        "end": 212.60000000000002
    },
    {
        "text": " es que se obtiene la máxima posibilidad de excedente del consumidor y del productor como ahora",
        "start": 212.6,
        "end": 220.51999999999998
    },
    {
        "text": " vamos a ver cuando vamos a introducir algún elemento que distorsiona a esta libre interacción.",
        "start": 220.51999999999998,
        "end": 228.76
    },
    {
        "text": " Me sigue hasta acá, pero ya hemos visto pero estoy tomando.",
        "start": 228.76,
        "end": 232.68
    },
    {
        "text": " Entonces, me ha alcanzado competitivo como yo les mencionaba en definitiva, hace que los",
        "start": 232.68,
        "end": 248.64000000000001
    },
    {
        "text": " vines y servicios se distribuyan entre los consumidores que más lo valoran, que distribuye la",
        "start": 248.64000000000001,
        "end": 255.24
    },
    {
        "text": " demanda de vines a los vendedores que los pueden producir al menor costo,",
        "start": 255.24,
        "end": 259.44
    },
    {
        "text": " producen la cantidad de vines que maximiza la suma de excedente del consumidor y del",
        "start": 260.44,
        "end": 266.32
    },
    {
        "text": " producto. Eso es un poco lo que yo les mencionaba recién del mercado de competencia perfecta",
        "start": 266.32,
        "end": 271.76
    },
    {
        "text": " que permite esto, ¿no? ¿Qué pasa? Cuando esto no ocurre, cuando ya el mercado no opera en",
        "start": 273.56,
        "end": 282.04
    },
    {
        "text": " libre competencia sino que hay otro tipo de estructura de mercado, por ejemplo hay alguna empresa",
        "start": 282.04,
        "end": 286.56
    },
    {
        "text": " que tiene poder para decidir en el precio, en el caso más nítido, en el caso un monopolio,",
        "start": 286.56,
        "end": 294.32
    },
    {
        "text": " la empresa que domina el mercado, en el caso estricto es que la única que ofrece el producto,",
        "start": 294.32,
        "end": 301.44
    },
    {
        "text": " que tiene posibilidad de fijar el precio, bueno ahí se genera ineficiencia, se genera",
        "start": 301.44,
        "end": 308.56
    },
    {
        "text": " ineficiencia, que demos lo con la idea de que en definitiva el precio y la cantidad que se",
        "start": 308.56,
        "end": 316.08
    },
    {
        "text": " convergen en el equilibrio, cuando hay un monopolio es mucho más ineficiente que en el caso que",
        "start": 316.08,
        "end": 320.96
    },
    {
        "text": " veíamos reciente competencia perfecta, vamos a ver que en definitiva básicamente es un precio",
        "start": 320.96,
        "end": 328.84000000000003
    },
    {
        "text": " más alto y cantidad transada menor. No es el único elemento que interfide,",
        "start": 328.84000000000003,
        "end": 337.04
    },
    {
        "text": " no, no se lo vamos a ver ahora, síguidamente, esto impuestos, pero el poder de mercado, dado por",
        "start": 337.04,
        "end": 342.8
    },
    {
        "text": " esta empresa que tiene posibilidad de insidir en el mercado, es lo que se conoce en economía como",
        "start": 342.8,
        "end": 348.32
    },
    {
        "text": " una de las fallas del mercado, hay otras como esta analidad, de quienes públicos, etcétera,",
        "start": 348.32,
        "end": 352.12
    },
    {
        "text": " nosotros vamos a ver más adelante el tema de monopolio. Ahora vamos a retomar el tema de este",
        "start": 352.12,
        "end": 358.92
    },
    {
        "text": " impuesto, el tema de los impuestos ya sabemos que es lo que permite el estado financiarse,",
        "start": 358.92,
        "end": 366.52000000000004
    },
    {
        "text": " que hablamos de impuesto directo cuando es el mismo agente grabado que lo vierta de la",
        "start": 366.52000000000004,
        "end": 372.18
    },
    {
        "text": " agente arrecabadador o indirecto cuando se vierta a través de una agente de retención,",
        "start": 372.18,
        "end": 376.76
    },
    {
        "text": " que puede ser una suma fija o puede ser un porcentaje, vamos a ver que importancia tiene cuando",
        "start": 376.76,
        "end": 386.6
    },
    {
        "text": " hay un impuesto en la eficiencia de los marcados y que pasa con la oferta y la demanda.",
        "start": 386.6,
        "end": 392.76000000000005
    },
    {
        "text": " Entonces, veamos un impuesto sobre la demanda, siempre que veamos impuestos sobre la demanda,",
        "start": 392.76000000000005,
        "end": 402.28000000000003
    },
    {
        "text": " consumidores, lo tenemos que mirar justamente de quién compra, de quién está al queriendo ese",
        "start": 402.28000000000003,
        "end": 412.76000000000005
    },
    {
        "text": " bien. Y obviamente cuando hablamos de la oferta es del que está vendiendo. Entonces,",
        "start": 412.76,
        "end": 419.88
    },
    {
        "text": " por cada unidad del bien que los consumidores van a comprar en el mercado tiene que pagar un impuesto",
        "start": 419.88,
        "end": 427.24
    },
    {
        "text": " T, una suma T de unidad es monetaria, un T peso, usted quiere. Lo que ocurre acá es que se",
        "start": 427.24,
        "end": 435.24
    },
    {
        "text": " desdobla el precio, yo les mencionaba recién, el mercado competencia perfecta, el precio que paga",
        "start": 435.24,
        "end": 441.71999999999997
    },
    {
        "text": " el consumidor es el mismo precio que recibe el productor. Cuando hay un impuesto ya eso no es así,",
        "start": 441.72,
        "end": 448.44000000000005
    },
    {
        "text": " aparece un precio que paga el consumidor y un precio que recibe el que vende.",
        "start": 449.88000000000005,
        "end": 455.88000000000005
    },
    {
        "text": " Esa distorsión, esa diferencia está explicada justamente por la manitura del impuesto.",
        "start": 459.72,
        "end": 464.44000000000005
    },
    {
        "text": " Vamos a ver, claro que pasa con los impuestos cuando se graba algún producto, sobre todo quién es",
        "start": 465.4,
        "end": 476.2
    },
    {
        "text": " que lo absorbe o quién es el que lleva la peor parte. Uno tinta a pensar que cuando hay un impuesto",
        "start": 476.2,
        "end": 484.04
    },
    {
        "text": " lo paga el comprador intuitivamente y eso vamos a ver que no están así. Vamos a comprobar",
        "start": 484.76000000000005,
        "end": 496.28000000000003
    },
    {
        "text": " el marco material que estamos acá manejando, que hay otros elementos que juegan,",
        "start": 496.28000000000003,
        "end": 502.6
    },
    {
        "text": " tienen una inicialmente el que compra es el que siempre se va a haber totalmente afectado por el",
        "start": 502.6,
        "end": 510.76
    },
    {
        "text": " impuesto. Vamos a verlo. Entonces arranquemos con este esquema en el cual cuando hay un impuesto",
        "start": 510.76,
        "end": 516.76
    },
    {
        "text": " sobre los consumidores, sobre la demanda, obviamente la culpa que se va a mover la demanda.",
        "start": 516.76,
        "end": 523.0
    },
    {
        "text": " Entonces se genera una brecha entre el precio que paga el consumidor,",
        "start": 524.76,
        "end": 530.04
    },
    {
        "text": " pésubcé y el precio que recibe el vendedor que es de la manitura del impuesto como se va a",
        "start": 531.4,
        "end": 535.4
    },
    {
        "text": " la mencionar recién. ¿Qué ocurre cuando hay un impuesto sobre los consumidores? La demanda se",
        "start": 535.4,
        "end": 540.4399999999999
    },
    {
        "text": " corre, la demanda se corre se les quiera y se corre en la magnitud del impuesto.",
        "start": 540.4399999999999,
        "end": 546.92
    },
    {
        "text": " La demanda está acá y se corre a una curva inferior.",
        "start": 550.76,
        "end": 557.88
    },
    {
        "text": " ¿Qué pasa cuando el impuesto es sobre los vendedores? Sobre la oferta. Bueno, los",
        "start": 557.88,
        "end": 565.58
    },
    {
        "text": " primeros que hay que tomar en cuenta acá es que la curva que se afecta es la curva oferta.",
        "start": 565.58,
        "end": 568.76
    },
    {
        "text": " ¿Qué quiere decir conceptualmente esto que los productores cuando venden al mercado un producto",
        "start": 571.32,
        "end": 575.92
    },
    {
        "text": " tienen que pagar un impuesto? Entonces también se da una brecha entre el precio de venta,",
        "start": 575.92,
        "end": 583.48
    },
    {
        "text": " entre el precio que recibe el productor con el que paga el consumidor.",
        "start": 583.48,
        "end": 589.76
    },
    {
        "text": " ¿Qué es conceptualmente un impuesto para un productor en el marco este que estamos hablando?",
        "start": 592.16,
        "end": 597.8000000000001
    },
    {
        "text": " Es como se ofrece un costo más. Es como si el producto tiene un costo de prudción.",
        "start": 597.8000000000001,
        "end": 604.76
    },
    {
        "text": " Entonces ¿Qué va a ocurrir? Bueno, yo les mencioné recién que cuando hablamos de un",
        "start": 605.8000000000001,
        "end": 611.88
    },
    {
        "text": " impuesto a los vendedores la curva que se corre en la curva oferta, si aumenta el costo la curva",
        "start": 611.88,
        "end": 617.48
    },
    {
        "text": " va a tener este movimiento, se curva se arriba y se les izquierda. Se encarece, digamos si ustedes",
        "start": 617.48,
        "end": 625.6
    },
    {
        "text": " quieren llamarlo conceptualmente con respecto a la situación que no hubiera impuesto.",
        "start": 625.6,
        "end": 631.76
    },
    {
        "text": " Sí, obviamente ahora lo vamos a ver combinado esto. ¿Quién soporta el incremento de precio como",
        "start": 631.76,
        "end": 651.52
    },
    {
        "text": " consecuencia del impuesto? ¿Está la pregunta que tenemos que fórmularlo para ver si podemos",
        "start": 651.52,
        "end": 660.92
    },
    {
        "text": " responder quién absorbe el peso del impuesto que yo le adelanté que no necesariamente, como",
        "start": 660.92,
        "end": 666.88
    },
    {
        "text": " uno tienda, pensáis que últimamente va a ser los consumidores. Entonces tomamos peso",
        "start": 666.88,
        "end": 672.1999999999999
    },
    {
        "text": " sucero, el precio sin impuesto, la incidencia es la demanda va a ser obviamente la diferencia",
        "start": 672.2,
        "end": 681.32
    },
    {
        "text": " y lo mismo por el lado de la oferta. El precio del consumidor es el precio de compra,",
        "start": 683.32,
        "end": 690.48
    },
    {
        "text": " pero el precio sin impuesto y lo vemos en el lado de la oferta es el precio sin impuesto menos el",
        "start": 690.48,
        "end": 696.6
    },
    {
        "text": " precio de venta. La mayor incidencia que van a tener, los agentes que van a absorber más el",
        "start": 696.6,
        "end": 704.4
    },
    {
        "text": " impuesto, los que van a tener más incidencia, van a hacer aquellos que presenten curvas más ineláticas.",
        "start": 704.4,
        "end": 710.9200000000001
    },
    {
        "text": " Esta es la razón que técnicamente responde la pregunta de quienes son los que se absorben más",
        "start": 711.96,
        "end": 719.96
    },
    {
        "text": " el peso de impuesto. Aquestos que curvas tengan menor posibilidad de reacción, menos posibilidad de",
        "start": 719.96,
        "end": 730.12
    },
    {
        "text": " adaptarse, por ejemplo, si alguien que es consumidor de un bien cualquiera, siga rello, como supone, y esta",
        "start": 730.12,
        "end": 740.48
    },
    {
        "text": " persona, disis, yo no puedo dejar de consumir tanta cantidad de siga rello o por ahí andando, la cantidad",
        "start": 740.48,
        "end": 749.24
    },
    {
        "text": " suba el precio de los siga rello por un impuesto. Pero esta persona dice, bueno, sí, suba, pero yo no,",
        "start": 750.52,
        "end": 756.36
    },
    {
        "text": " no estoy dispuesto a consumir mucho menos o un poquito menos. Por lo tanto, ¿qué va a pasar? En este",
        "start": 756.36,
        "end": 762.12
    },
    {
        "text": " caso, el punto vista del gasto de consumidor. Aumenta, ¿no? ¿Por qué? Porque en definitiva esta persona",
        "start": 762.12,
        "end": 770.12
    },
    {
        "text": " no reaccionó sensiblemente, no fue sensible al aumento del precio, aumento del precio, pero la cantidad",
        "start": 770.12,
        "end": 776.36
    },
    {
        "text": " o no varió nada, pues ser un caso o varió poquito. ¿Por qué? Porque en su caso es una cuba de demanda",
        "start": 776.92,
        "end": 784.32
    },
    {
        "text": " inelástica o bastante inelástica. Inelástica, que decir que no, no es muy sensible la variación del",
        "start": 784.32,
        "end": 790.52
    },
    {
        "text": " precio. Puede darse al revés de un consumidor que diga, mira, a mí me sube en los sigarros y chau, no",
        "start": 790.52,
        "end": 797.84
    },
    {
        "text": " fumo más, perfecto. Entonces ahí estamos hablando de una cuba que para ese elástica o muy elástica",
        "start": 797.84,
        "end": 804.72
    },
    {
        "text": " o totalmente elástica. Entonces ahí el efecto de los impuestos no le va a afectar nada. Lo vengo,",
        "start": 804.72,
        "end": 810.36
    },
    {
        "text": " entonces veamos un impuesto sobre el consumo, sobre los consumidores, sobre la demanda. Entonces",
        "start": 813.88,
        "end": 821.48
    },
    {
        "text": " como vimos recién en el marco general, ya sabemos que la cuba que se va a mover la demanda. Entonces",
        "start": 821.48,
        "end": 827.4
    },
    {
        "text": " arrancamos en la situación sin impuesto, ¿no? Este es el punto de equilibrio, sin impuesto a este",
        "start": 827.4,
        "end": 833.52
    },
    {
        "text": " precio sin impuesto y la cantidad sin impuesto. ¿Qué ocurre cuando hay impuestos sobre la demanda?",
        "start": 833.52,
        "end": 839.36
    },
    {
        "text": " Bueno, la demanda se corre, como vimos recientemente. Entonces se corre en la quantidade de impuestos,",
        "start": 839.36,
        "end": 847.36
    },
    {
        "text": " se corre reduciendose, ¿no? ¿Qué consecuencia tiene esto? Ya sabemos que se altera el precio del",
        "start": 847.36,
        "end": 856.0799999999999
    },
    {
        "text": " vendedor y el precio del comprador. La diferencia es de impuesto que voy a ver acá. El precio del",
        "start": 856.0799999999999,
        "end": 862.72
    },
    {
        "text": " comprador es el precio que recibe el vendedor más el t de impuesto. ¿Qué consecuencia hay? Bueno,",
        "start": 862.72,
        "end": 870.88
    },
    {
        "text": " la consecuencia es que el comprador va a pagar un precio más alto. En este gráfico estamos viendo",
        "start": 870.88,
        "end": 878.76
    },
    {
        "text": " que las curvas son relativamente elásticas ambas. Baja el precio que recibe el productor,",
        "start": 878.76,
        "end": 888.32
    },
    {
        "text": " el productor tiene el impacto acá, diminuye el ingreso que tenía antes por unidad. Y a nivel",
        "start": 888.32,
        "end": 896.72
    },
    {
        "text": " del mercado la cantidad que se transa es menor, cuso uno es menor que cuso cero. Este es el efecto",
        "start": 896.72,
        "end": 902.5600000000001
    },
    {
        "text": " en eto que queda de la aplicación del impuesto sobre el consumidor. Veamos que pasa si hay",
        "start": 902.5600000000001,
        "end": 913.0
    },
    {
        "text": " un impuesto sobre los vendedores, sobre la oferta. Ya sabemos que la oferta se corre se",
        "start": 913.0,
        "end": 920.16
    },
    {
        "text": " les quiere de allá arriba, ¿no? Lo mismo estamos viendo curvas relativamente elástica. Entonces,",
        "start": 920.16,
        "end": 926.4
    },
    {
        "text": " en este caso que estamos viendo que lo vendedores tienen que pagar un impuesto porque a unidad",
        "start": 926.4,
        "end": 931.76
    },
    {
        "text": " vendida, ¿qué ocurre? También ocurre que el precio se desdobla, hay un precio del comprador y hay un",
        "start": 931.76,
        "end": 939.8
    },
    {
        "text": " precio de vendedor, la diferencia es el impuesto. Veamos que el precio que paga el comprador es",
        "start": 939.8,
        "end": 946.7199999999999
    },
    {
        "text": " mayor sube con respecto a lo que pagaba sin impuesto. El precio que recibe el vendedor baja,",
        "start": 946.7199999999999,
        "end": 954.16
    },
    {
        "text": " diminuye respecto a lo que recibiara antes sin impuesto. Y la cantidad es menor, es decir, los",
        "start": 954.16,
        "end": 960.4
    },
    {
        "text": " impactos son iguales, los impactos netos son iguales. Sube el precio al que compra, baja al que",
        "start": 960.4,
        "end": 968.52
    },
    {
        "text": " vende y la cantidad de minulli. Solo que en el primero caso que se corre la Cuba de Manda,",
        "start": 968.52,
        "end": 975.0
    },
    {
        "text": " porque es un impuesto sobre los consumidores y acá se corre la curva de oferta, porque es un",
        "start": 975.0,
        "end": 980.4
    },
    {
        "text": " impuesto sobre los vendedores.",
        "start": 980.4,
        "end": 982.0
    },
    {
        "text": " ¿Dudas? En qué proporciones se va a distribuir el impacto del impuesto. En términos generales, esto",
        "start": 982.0,
        "end": 999.36
    },
    {
        "text": " que yo les decía, baja el precio al vendedor, suba el comprador, no, o sea ambos se ven afectados,",
        "start": 999.36,
        "end": 1005.28
    },
    {
        "text": " en estos casos que estamos viendo, en qué mangitu. Bueno, y esto va a depender de las curvas",
        "start": 1005.28,
        "end": 1011.44
    },
    {
        "text": " de la esticidad precio de la demanda y oferta. Como yo les mencionaba recién, en el caso de este",
        "start": 1011.44,
        "end": 1019.0
    },
    {
        "text": " consumidor hipotético sobre cigarrillo, si presenta una demanda muy, muy delástica, va a absorber",
        "start": 1019.0,
        "end": 1026.3200000000002
    },
    {
        "text": " mayor parte del impuesto o todo, y si tiene demanda muy elástica, no va a absorber parte o nada del",
        "start": 1026.3200000000002,
        "end": 1032.48
    },
    {
        "text": " impuesto. Veamos, acá estamos hablando de un consumidor que tiene una demanda muy elástica,",
        "start": 1032.48,
        "end": 1040.8400000000001
    },
    {
        "text": " ¿no? Como se puede ver. Entonces se aplica un impuesto al consumidor, la curva de demanda se corre,",
        "start": 1040.84,
        "end": 1053.8
    },
    {
        "text": " ni minulla, al izquierda, pero observen que el precio del consumidor sube el precio del",
        "start": 1053.8,
        "end": 1061.6399999999999
    },
    {
        "text": " productor baja y la cantidad baja, eso se da como en el caso general, pero observen que la",
        "start": 1061.6399999999999,
        "end": 1068.0
    },
    {
        "text": " magnitud del precio que sube al consumidor es mucho más significativo que lo que baja al productor.",
        "start": 1068.0,
        "end": 1075.84
    },
    {
        "text": " Esto es el peso que tiene para este consumidor, la aplicación del impuesto es mucho mayor que para el",
        "start": 1077.2,
        "end": 1089.52
    },
    {
        "text": " productor, porque si bien el precio subió en proporción mucho menos que lo que bajó la cantidad,",
        "start": 1089.52,
        "end": 1099.92
    },
    {
        "text": " disminuyó en forma porcentual, mucho menos la cantidad que lo que subió el precio. Recordemos",
        "start": 1101.44,
        "end": 1108.0
    },
    {
        "text": " que la esticidad, justamente analiza eso, el cociente, el impacto sobre la cantidad, cuanto",
        "start": 1108.0,
        "end": 1113.56
    },
    {
        "text": " variedad a la cantidad consumida respecto a la variación porcentual de precios. Entonces en este",
        "start": 1113.56,
        "end": 1120.44
    },
    {
        "text": " caso, como la demanda es bastante inelástica, el consumidor absorbe la mayor parte del impuesto.",
        "start": 1120.44,
        "end": 1126.9199999999998
    },
    {
        "text": " Si la demanda es muy elástica, obviamente ocurre al inverso, es decir, se da el mismo el precio",
        "start": 1132.48,
        "end": 1141.48
    },
    {
        "text": " del consumidor sube, el precio del vendedor baja y la cantidad también, la demanda se corre hacia",
        "start": 1141.48,
        "end": 1146.76
    },
    {
        "text": " abajo, pero observen que lo que sube el precio para el vendedor, perdón, para el comprador es mucho",
        "start": 1146.76,
        "end": 1153.16
    },
    {
        "text": " menor que lo que baja para el que vende. En este caso, como la demanda es muy elástica,",
        "start": 1153.16,
        "end": 1158.04
    },
    {
        "text": " acá el absorbe el comprador, dicho otra forma, si tuvieramos un ejemplo, un negocio cualquiera",
        "start": 1159.64,
        "end": 1168.84
    },
    {
        "text": " y en el cual se nos aplica un impuesto a vender tal producto. Dicimos, bueno, se lo carga al",
        "start": 1168.84,
        "end": 1177.9199999999998
    },
    {
        "text": " precio, se lo traslado a precio, se impuesto. Entonces en el caso anterior no habría mucho problema",
        "start": 1177.9199999999998,
        "end": 1186.0
    },
    {
        "text": " porque la demanda es bastante inelástica, en este caso que el problema va en frente yo si soy",
        "start": 1186.0,
        "end": 1191.1999999999998
    },
    {
        "text": " producto y lo traslado a precio. Claro, te baja muchísimo la cantidad, ¿por qué? Porque el",
        "start": 1191.2,
        "end": 1202.2
    },
    {
        "text": " consumidor se enfrenta en la demanda delástica, o sea yo puedo sumir el precio este bien y el consumidor",
        "start": 1202.2,
        "end": 1206.8
    },
    {
        "text": " sencillamente responde mucho más, por lo tanto acá el problema es que no tengo opción, acá, en",
        "start": 1206.8,
        "end": 1218.16
    },
    {
        "text": " este caso tengo que yo como vende dor, como productor tengo que absorber el impuesto, si no me",
        "start": 1218.16,
        "end": 1223.1200000000001
    },
    {
        "text": " quiero ver afectado más tu avión. Y esto por qué? Porque la demanda es muy elástica, entonces",
        "start": 1223.1200000000001,
        "end": 1229.3200000000002
    },
    {
        "text": " en definitiva, cuando el bien presente demanda elástica, el que absorbe el mayor peso del impuesto",
        "start": 1229.3200000000002,
        "end": 1235.52
    },
    {
        "text": " son los vendedores y no los consumidores. Veamos el caso extremo, ¿no? Dumbien que presenta una",
        "start": 1235.52,
        "end": 1245.48
    },
    {
        "text": " demanda absolutamente inelástica, totalmente inelástica, no varía absolutamente nada por más",
        "start": 1245.48,
        "end": 1251.84
    },
    {
        "text": " que varía el precio, la cantidad demandada no se modifica por más que varía el precio, bueno,",
        "start": 1251.84,
        "end": 1258.8
    },
    {
        "text": " obviamente podemos intuir qué lo que va a ocurrir acá, ¿no? Suba el precio en la cuantía del",
        "start": 1258.8,
        "end": 1266.04
    },
    {
        "text": " impuesto y quién lo paga esto, todo.",
        "start": 1266.04,
        "end": 1269.1200000000001
    },
    {
        "text": " ¿Qué le parece usted? La demanda no va a variar por más que varía el precio, quién va a pagar el",
        "start": 1269.12,
        "end": 1277.4399999999998
    },
    {
        "text": " impuesto acá, los consumidores, ¿no? Estamos hablando en un caso de este fumador que dice yo por más",
        "start": 1277.4399999999998,
        "end": 1284.04
    },
    {
        "text": " que suba el precio, voy a fumar tantas cantidades, y la misma cantidad de sigar rillos que antes,",
        "start": 1284.04,
        "end": 1288.3799999999999
    },
    {
        "text": " por lo tanto suba el impuesto, no, no, se aplica el impuesto, suba el precio no va a varía la cantidad,",
        "start": 1288.3799999999999,
        "end": 1295.6399999999999
    },
    {
        "text": " porque la cantidad demandada es totalmente inelástica, o sea que acá no hay vuelta, lo ven esto",
        "start": 1296.3600000000001,
        "end": 1304.18
    },
    {
        "text": " es mucha ayuda, entonces en este caso extremo que ocurre, en primer lugar la cantidad demandada",
        "start": 1304.18,
        "end": 1311.68
    },
    {
        "text": " de la misma, más allá del precio, por lo tanto la cantidad transada no varía, lo que si varía es",
        "start": 1311.68,
        "end": 1316.72
    },
    {
        "text": " el precio que paga el consumidor, mientras que el precio que recibe el vendedor no varía,",
        "start": 1316.72,
        "end": 1324.2800000000002
    },
    {
        "text": " paga solo, varía solo el precio de que paga el que paga el comprador y varía en la",
        "start": 1326.16,
        "end": 1334.4
    },
    {
        "text": " cuantía totalmente del impuesto.",
        "start": 1334.4,
        "end": 1336.5200000000002
    },
    {
        "text": " Bueno, esto es totalmente enálogo si el impuesto es sobre la oferta, si el impuesto sobre la oferta",
        "start": 1345.48,
        "end": 1352.68
    },
    {
        "text": " también la oferta cambia, varía este diminuye en la cuantía del impuesto, pero ¿qué ocurre?",
        "start": 1352.68,
        "end": 1361.3200000000002
    },
    {
        "text": " La cantidad de la transada no varía y el impacto del impuesto también lo absorbe totalmente",
        "start": 1363.0,
        "end": 1371.0
    },
    {
        "text": " el consumidor.",
        "start": 1373.0,
        "end": 1373.96
    },
    {
        "text": " ¿Qué pasa si la demanda es totalmente elástica? Si la demanda es totalmente elástica, en este caso",
        "start": 1373.96,
        "end": 1386.08
    },
    {
        "text": " es un impuesto sobre los consumidores, por lo tanto la demanda baja, baja a de su uno como está acá.",
        "start": 1386.08,
        "end": 1393.24
    },
    {
        "text": " Bueno, acá diminuye el precio que recibe el productor, el precio que paga el consumidor no va a",
        "start": 1393.24,
        "end": 1401.2
    },
    {
        "text": " variar y el equilibrio sea una cantidad transada del bien menor. ¿Qué estamos viendo acá?",
        "start": 1401.2,
        "end": 1409.48
    },
    {
        "text": " Acá estamos viendo el caso de un bien absolutamente sensible para el consumidor a una variación de",
        "start": 1409.48,
        "end": 1415.28
    },
    {
        "text": " precio. Hay una variación de precio y el consumidor varía totalmente, no consumen nada. Por lo",
        "start": 1415.28,
        "end": 1423.3600000000001
    },
    {
        "text": " tanto en este caso el impuesto es totalmente absorbido por el vendedor, totalmente absorbido por",
        "start": 1423.36,
        "end": 1431.8799999999999
    },
    {
        "text": " el comprador, no hay posibilidad de transada de precio, digamos, el impacto del impuesto.",
        "start": 1431.8799999999999,
        "end": 1439.8
    },
    {
        "text": " Lo mismo si el impuesto es sobre la oferta, siempre que estamos hablando de una demanda totalmente",
        "start": 1445.12,
        "end": 1451.32
    },
    {
        "text": " elástica, los impactos son los mismos, tanto si el impuesto sobre la demanda o la oferta,",
        "start": 1451.32,
        "end": 1456.36
    },
    {
        "text": " solo que en este caso se corra la oferta. También baja el precio que recibe el productor, el",
        "start": 1456.36,
        "end": 1464.28
    },
    {
        "text": " consumidor va a pagar el mismo precio y obviamente la cantidad diminuye y el impuesto lo paga totalmente",
        "start": 1464.28,
        "end": 1472.08
    },
    {
        "text": " el vendedor, el productor. ¿Qué pasa cuando lo que es totalmente elástico es la oferta? Esto es",
        "start": 1472.08,
        "end": 1485.3999999999999
    },
    {
        "text": " hay una producción plena, máximo de primeros factores, no se puede modificar la producción y",
        "start": 1486.3999999999999,
        "end": 1493.12
    },
    {
        "text": " hay un impuesto. ¿Qué ocurre cuando el impuesto se aplica en este caso sobre los consumidores?",
        "start": 1493.12,
        "end": 1499.32
    },
    {
        "text": " Cuando hay una demanda totalmente inelástica, bueno, sabemos que la demanda va a correrse, va a",
        "start": 1499.32,
        "end": 1504.48
    },
    {
        "text": " diminuir por el efecto del impuesto, pero en este caso diminuye el precio que recibe el productor,",
        "start": 1504.48,
        "end": 1511.6399999999999
    },
    {
        "text": " el precio de paga el consumidor no va a variar y la cantidad tampoco va a variar. En este caso el",
        "start": 1511.6399999999999,
        "end": 1519.72
    },
    {
        "text": " productor absorbe todo el impuesto, no hay tampoco traslado a precio al consumidor, no hay posibilidad,",
        "start": 1519.72,
        "end": 1525.9199999999998
    },
    {
        "text": " no hay posibilidad. Bueno, si la oferta es totalmente elástica, si la oferta es totalmente elástica",
        "start": 1525.92,
        "end": 1542.4
    },
    {
        "text": " acá ocurre al revés, tanto sea un impuesto sobre los consumidores como por los productores,",
        "start": 1542.4,
        "end": 1548.5600000000002
    },
    {
        "text": " lo que ocurre es, bueno, obviamente sí que el consumidor se corre la cuba de demanda baja,",
        "start": 1548.56,
        "end": 1555.12
    },
    {
        "text": " si fuera el productor baja también la jugador, pero acá en este caso quien absorbe todo el impuesto",
        "start": 1555.12,
        "end": 1563.12
    },
    {
        "text": " es el consumidor, acá sí hay traslado a precio absoluto. En definitiva, estos casos extremos",
        "start": 1563.12,
        "end": 1571.12
    },
    {
        "text": " nos sirve justamente para graficar toda la mayoría de los productos que se encuentran en la",
        "start": 1571.12,
        "end": 1579.04
    },
    {
        "text": " soción intermédia. Quiero que podemos decir en definitiva, entonces, en definitiva cuando se",
        "start": 1579.04,
        "end": 1589.0
    },
    {
        "text": " aplica el impuesto, el impacto que tiene, esto es quien va a absorber el efecto del impuesto,",
        "start": 1589.0,
        "end": 1597.4399999999998
    },
    {
        "text": " generalmente se distribuyen entre los vendedores y los compradores, entre los consumidores y los",
        "start": 1598.16,
        "end": 1604.28
    },
    {
        "text": " soferentes. ¿Qué va a depender de la cuantía del impacto va a depender de la elasticidad de las",
        "start": 1604.28,
        "end": 1611.48
    },
    {
        "text": " curvas? ¿Cuánto más inelácticos sean las curvas? Para ese, a gente más absorbe el impuesto,",
        "start": 1611.48,
        "end": 1618.48
    },
    {
        "text": " menos capacidad de adaptación, menos capacidad de reacción tiene.",
        "start": 1619.44,
        "end": 1623.04
    },
    {
        "text": " Yo ya mente, cuanto más elástico sean las curvas más posibilidades de que no la afecte el impacto",
        "start": 1626.68,
        "end": 1634.56
    },
    {
        "text": " del impuesto. ¿Lo ven? ¿Preguntas?",
        "start": 1634.56,
        "end": 1639.6
    },
    {
        "text": " Entonces, veamos esto, veamos el tema del impuesto. Se aplica un impuesto, sabemos que el precio",
        "start": 1645.96,
        "end": 1654.96
    },
    {
        "text": " que paga los compradores sube, baja el precio que reciben los vendedores, siempre respecto al",
        "start": 1654.96,
        "end": 1660.3999999999999
    },
    {
        "text": " producto al precio, digo sin impuesto, ¿no? Esta área que está acá, la cuantía del",
        "start": 1660.4,
        "end": 1670.72
    },
    {
        "text": " impuesto T por Q, es justamente el monto de recaudación del impuesto, es la recaudación fiscal,",
        "start": 1670.72,
        "end": 1677.4
    },
    {
        "text": " es el monto que el ingreso al Estado por la aplicación del impuesto. ¿Qué genera en general?",
        "start": 1678.4,
        "end": 1689.44
    },
    {
        "text": " Los impuestos en este marco teórico que estamos analizando. Bueno, obviamente afecta en la actividad",
        "start": 1690.5600000000002,
        "end": 1696.76
    },
    {
        "text": " del mercado, como que no es un estímulo, lo desalientan, diminuce la cantidad del bien transado",
        "start": 1696.76,
        "end": 1704.16
    },
    {
        "text": " en el mercado, del bien que se le está grabando, obviamente distorsiona el equilibrio del mercado,",
        "start": 1704.16,
        "end": 1710.8400000000001
    },
    {
        "text": " en general los compradores van a pagar más los vendedores más recibir menos. Esto es independiente",
        "start": 1710.8400000000001,
        "end": 1719.3200000000002
    },
    {
        "text": " de quién esté grabado por el impuesto, veíamos, ¿no? Si es el referente o si los consumidores",
        "start": 1719.32,
        "end": 1724.48
    },
    {
        "text": " edifició los efectos comergían y en general también ambos consumidores y referentes se reparten",
        "start": 1724.48,
        "end": 1734.3999999999999
    },
    {
        "text": " el efecto del impuesto afectando el bienestar, y lo que vamos a ver ahora acá.",
        "start": 1734.3999999999999,
        "end": 1739.2
    },
    {
        "text": " Si recordamos lo que tuvimos viendo hace un ratito que decía más bueno, el excedente",
        "start": 1739.2,
        "end": 1751.28
    },
    {
        "text": " del consumidor estaba dado por la diferencia entre la curva de demanda y el precio efectivamente",
        "start": 1751.28,
        "end": 1757.92
    },
    {
        "text": " pagado.",
        "start": 1757.92,
        "end": 1758.52
    },
    {
        "text": " Deciamos que esta parte era todo el excedente del consumidor y esto era el excedente del",
        "start": 1781.28,
        "end": 1791.76
    },
    {
        "text": " productor ¿no? ¿Tacuéramos? Esta es el precio de equilibrio, sin impuestos y este, la cantidad",
        "start": 1791.76,
        "end": 1801.8
    },
    {
        "text": " sin impuestos. Cuando se aplican impuestos, cuando se aplican impuestos, vemos que el",
        "start": 1801.8,
        "end": 1809.08
    },
    {
        "text": " precio que paga el consumidor sube, ya el precio está acá y el precio que recibe el productor",
        "start": 1809.08,
        "end": 1819.28
    },
    {
        "text": " baja y esta es la recadocción del Estado, esta es la recadoción fiscal. ¿Qué pasa con el excedente",
        "start": 1819.28,
        "end": 1829.1599999999999
    },
    {
        "text": " del consumidor cuando se aplican impuestos?",
        "start": 1829.1599999999999,
        "end": 1833.36
    },
    {
        "text": " Bueno, el excedente del consumidor, si lo vemos acá, antes de aplicar el impuesto era toda esta",
        "start": 1834.36,
        "end": 1842.6
    },
    {
        "text": " área ¿no? A, B, C. Cuando se aplican el impuesto, queda reducido al área A, queda reducido a esto",
        "start": 1842.6,
        "end": 1853.6799999999998
    },
    {
        "text": " acá. Esto es el nuevo excedente del consumidor, esta área acá arriba, pierde ¿no? El área B y C lo pierden",
        "start": 1853.68,
        "end": 1863.8
    },
    {
        "text": " con la aplicación del impuesto. O sea, el efecto que tiene en cuanto al excedente del consumidor",
        "start": 1863.8,
        "end": 1873.8
    },
    {
        "text": " que estamos realizando, de acuerdo a cómo se definió, el impuesto es una distorsión,",
        "start": 1873.8,
        "end": 1879.24
    },
    {
        "text": " diminuye el excedente del consumidor, en este caso queda reducido al área a esta que está en",
        "start": 1880.24,
        "end": 1888.1200000000001
    },
    {
        "text": " A, lo ven.",
        "start": 1888.1200000000001,
        "end": 1888.72
    },
    {
        "text": " Analegamente, el excedente del productor que antes era todo este triángulo, es decir, debajo del",
        "start": 1899.72,
        "end": 1906.2
    },
    {
        "text": " precio hasta la cruva oferta de E y F, con la aplicación del impuesto queda solo reducido a F,",
        "start": 1906.2,
        "end": 1914.88
    },
    {
        "text": " o sea, el nuevo precio hacia la cruva oferta, ¿no? Consexualmente es igual, es el precio que recibe",
        "start": 1914.88,
        "end": 1923.56
    },
    {
        "text": " el precio que recibe el vendedor con la cruva oferta, o lo tanto el nuevo excedente del productor",
        "start": 1923.56,
        "end": 1931.0
    },
    {
        "text": " también se reduce y es, en este caso, F, ¿no? Esta parte que está acá.",
        "start": 1931.56,
        "end": 1936.92
    },
    {
        "text": " O sea que los impuestos tienen el punto vista de la freciencia del mercado, estos efectos.",
        "start": 1940.44,
        "end": 1948.68
    },
    {
        "text": " Lo ven, ahí no lo ve.",
        "start": 1953.32,
        "end": 1955.08
    },
    {
        "text": " Ahora bien,",
        "start": 1958.44,
        "end": 1959.24
    },
    {
        "text": " edificativa, BC, DE, es lo que se pierde, el punto vista del consumidor y el productor,",
        "start": 1961.48,
        "end": 1969.96
    },
    {
        "text": " con la diferencia que B y D coincide con la recaudación del Estado,",
        "start": 1971.4,
        "end": 1976.96
    },
    {
        "text": " por lo tanto, hay una transferencia, digamos, de los consumidores y los vendedores,",
        "start": 1978.36,
        "end": 1983.08
    },
    {
        "text": " hacia el Estado es el área B y D, que es la recaudación fiscal,",
        "start": 1983.6399999999999,
        "end": 1986.6
    },
    {
        "text": " pero C, E, no lo captan a nadie, C, E, es lo que se conoce como la pérdida irrecuperable",
        "start": 1989.1599999999999,
        "end": 1997.56
    },
    {
        "text": " deficiencia, la pérdida irrecuperable de bienestar, este trángulo acá o estos dos trángulo",
        "start": 1997.56,
        "end": 2005.3999999999999
    },
    {
        "text": " muy listos, depende de cómo usted lo quiere mirar,",
        "start": 2005.48,
        "end": 2007.44
    },
    {
        "text": " es una pérdida deficiencia social, no lo captan a nadie.",
        "start": 2010.44,
        "end": 2015.3200000000002
    },
    {
        "text": " Lo ven, o sea que en definitiva, esto es mercado de competencia perfecta, que tiene estas condiciones,",
        "start": 2020.1200000000001,
        "end": 2029.44
    },
    {
        "text": " de libre entrada de salida, de una de una interferencia en los marcados, decíamos maximizar",
        "start": 2030.0,
        "end": 2035.52
    },
    {
        "text": " bienestar, acá vemos cuando interviene un otro agente que es el Estado poniendo un impuesto,",
        "start": 2035.52,
        "end": 2041.68
    },
    {
        "text": " bueno, genera esta distorsión, desde el punto de vista la eficiencia de distribución,",
        "start": 2041.68,
        "end": 2045.04
    },
    {
        "text": " lo ven o no, con la diferencia o con la observación, digamos, que gran parte de esto lo capta",
        "start": 2047.04,
        "end": 2054.16
    },
    {
        "text": " al Estado a través del impuesto, pero hay una parte que se pierde. Entonces, obviamente",
        "start": 2054.16,
        "end": 2062.08
    },
    {
        "text": " los impuestos generan un efecto fiscal, positivo, una recauda positiva al Estado,",
        "start": 2062.08,
        "end": 2070.16
    },
    {
        "text": " hay un cambio en el exidente del consumidor, diminuye, lo mismo a ese productor, también diminuye,",
        "start": 2070.16,
        "end": 2077.3599999999997
    },
    {
        "text": " esta pérdida, esta disminución que tiene los bendidores y los compradores o la pérdida",
        "start": 2078.08,
        "end": 2085.76
    },
    {
        "text": " excedente que tiene en su conjunto es superior al ingreso fiscal, como veíamos, la pérdida de ese",
        "start": 2085.76,
        "end": 2092.32
    },
    {
        "text": " definitiva BCDE, mientras que lo que acaba del Estado es solo BDE, vemos B, por lo tanto la pérdida",
        "start": 2092.32,
        "end": 2100.48
    },
    {
        "text": " excedente superior y justamente lo que excede es esto irrecuperable.",
        "start": 2100.48,
        "end": 2106.0
    },
    {
        "text": " Salvo, salvo que estamos hablando de situaciones de curvas inelásticas, donde ahí, como todo el",
        "start": 2115.04,
        "end": 2123.08
    },
    {
        "text": " impuesto la absorbe uno de los agentes, ahí no habría una pérdida debe estar social,",
        "start": 2123.08,
        "end": 2127.84
    },
    {
        "text": " debe estar total. En definitiva, qué es lo que nos indica esto que se pierde parte del beneficio",
        "start": 2127.84,
        "end": 2137.92
    },
    {
        "text": " que se obtiene por el libre intercambio, por el libre interacción de la competencia perfecta.",
        "start": 2137.92,
        "end": 2144.48
    },
    {
        "text": " ¿Cuánto se pierde? Bueno, la magnitud depende de la elasticidad preciosa y la aférdida de",
        "start": 2147.28,
        "end": 2153.84
    },
    {
        "text": " manda como tuvimos viendo. ¿Cuánto se va a perder? Depende de esto, recién decíamos si",
        "start": 2153.84,
        "end": 2160.32
    },
    {
        "text": " estuvieramos con curva totalmente inelástica, no hay una pérdida social, porque lo absorbe el",
        "start": 2160.32,
        "end": 2168.6400000000003
    },
    {
        "text": " consumidor o lo absorbe los vendedores en su conjunto. En la medida que no sea en los casos estremos,",
        "start": 2168.6400000000003,
        "end": 2176.2400000000002
    },
    {
        "text": " hay una pérdida social. Me sigue acá, muchos. Entonces, veamos, por ejemplo, como con una",
        "start": 2176.24,
        "end": 2187.04
    },
    {
        "text": " aférdida bastante inelástica, la pérdida de bienestar, está dado por ese tiangulito que está acá,",
        "start": 2187.04,
        "end": 2191.6
    },
    {
        "text": " es relativamente chica, ya si la aférdida se laástica observa en que este mismo impuesto genera",
        "start": 2191.6,
        "end": 2199.8799999999997
    },
    {
        "text": " una pérdida mayor. Lo mismo pasa con la demanda, con una demanda inelástica o bastante inelástica,",
        "start": 2199.88,
        "end": 2208.36
    },
    {
        "text": " la pérdida general de mi impuesto es relativamente pequeña, pero si a cuando estamos hablando de una curva",
        "start": 2208.36,
        "end": 2214.28
    },
    {
        "text": " que presenta una demanda más elástica, el impacto que tiene sobre la pérdida social es mayor.",
        "start": 2214.28,
        "end": 2220.2000000000003
    },
    {
        "text": " O sea que el comportamiento que tenga la la acticina de las curvas son muy importantes para",
        "start": 2221.16,
        "end": 2230.3599999999997
    },
    {
        "text": " determinar, son claves para determinar la magnitud, el impacto que tiene, no solo quien se carga",
        "start": 2230.3599999999997,
        "end": 2236.96
    },
    {
        "text": " el impuesto o quien absorbe mayor parte de mi impuesto, sino a nivel del bienestar social,",
        "start": 2236.96,
        "end": 2241.68
    },
    {
        "text": " está pérdida al cooperado de eficiencia. Entonces, en definitiva, a una mayor acticidad de las curvas",
        "start": 2241.68,
        "end": 2249.16
    },
    {
        "text": " de demanda doferta, cuando se aplica el impuesto, mayor va a ser el impacto sobre la cantidad de equilibrio,",
        "start": 2249.16,
        "end": 2255.92
    },
    {
        "text": " más más más más más más la cantidad y mayor va a ser la pérdida de mi inelesta. Es un poco",
        "start": 2255.92,
        "end": 2261.7599999999998
    },
    {
        "text": " la síntesis general que podemos considerar cuando habéis impuesto.",
        "start": 2261.7599999999998,
        "end": 2265.3999999999996
    },
    {
        "text": " Preguntas, ¿qué pasa con la recaudación? Bueno, cuanto mayor sea el monto del impuesto o la",
        "start": 2266.4,
        "end": 2280.04
    },
    {
        "text": " magnitud del impuesto, obviamente la pérdida de inestar se va a incrementar más rápidamente que",
        "start": 2280.04,
        "end": 2285.64
    },
    {
        "text": " ese monto del impuesto. Por ejemplo, si el monto del impuesto es pequeño, acá tenemos una pérdida",
        "start": 2285.64,
        "end": 2291.7200000000003
    },
    {
        "text": " de inestar. Si el monto del impuesto es ya más significativo, vemos que la pérdida de inestar",
        "start": 2291.72,
        "end": 2300.72
    },
    {
        "text": " tiene un aumento considerable con respecto al caso anterior. Este siempre es el ingreso fiscal y",
        "start": 2300.72,
        "end": 2310.2
    },
    {
        "text": " si el impuesto es muy grande, si el impuesto es muy grande, la pérdida de inestar ya es mucho más",
        "start": 2310.2,
        "end": 2316.2799999999997
    },
    {
        "text": " significativo. En este caso particular hay una salvedad en el sentido de que que pasa con el",
        "start": 2316.28,
        "end": 2326.2400000000002
    },
    {
        "text": " ingreso fiscal, en este caso, porque supongamos que se quiere grabar y suertemente a artículos de",
        "start": 2326.2400000000002,
        "end": 2336.52
    },
    {
        "text": " alta gama, de lujo, superlujo. No sé, un dron volador, tipo taxaerio que me lo quiero comprar,",
        "start": 2336.52,
        "end": 2347.12
    },
    {
        "text": " un avión privado, un llate privado. Entonces, ¿qué pasa? Viene el estado y se voy a grabar estos",
        "start": 2347.12,
        "end": 2356.64
    },
    {
        "text": " bienes porque son de superlujo y bueno, cae los grabas fuertemente. ¿Ustedes carías si son usuarios",
        "start": 2356.64,
        "end": 2365.24
    },
    {
        "text": " de estos tipos de bienes? ¿Qué harían? Imagínelo instante que son usuarios y compran",
        "start": 2365.24,
        "end": 2371.2
    },
    {
        "text": " aviones privados y llate privados, que a veces tienen, pero digo, no lo sé. Perfecto, no lo compras",
        "start": 2371.2,
        "end": 2382.12
    },
    {
        "text": " si lo compras acá, lo compras en la tu lado. O sea, desestimula, a veces un impuesto muy fuerte,",
        "start": 2382.12,
        "end": 2389.56
    },
    {
        "text": " desestimula tanto la venta que termina siento favorable para desminuir la venta, si se quiere",
        "start": 2389.56,
        "end": 2398.72
    },
    {
        "text": " desminuir la venta, como puede ser en unos casos, vamos a comentar ahora, pero en el ingreso fiscal",
        "start": 2398.72,
        "end": 2403.36
    },
    {
        "text": " que a pa' que no suerte efecto, ¿no? Pues como decía, bueno, me sube el impuesto, ya",
        "start": 2403.36,
        "end": 2408.32
    },
    {
        "text": " está habido un privado, perfecto, lo compro en otro lado, y chao. Y otra cosa. Y a veces",
        "start": 2408.32,
        "end": 2414.92
    },
    {
        "text": " ha ocurrido, ha habido algunas perecciones relacionadas en esto, ¿no? Que a veces se lo ocurre,",
        "start": 2414.92,
        "end": 2418.52
    },
    {
        "text": " hayan poniendo un impuesto de lujo a un artículo de lujo de esta gama y, bueno, definitiva,",
        "start": 2418.52,
        "end": 2425.28
    },
    {
        "text": " pierde el efecto disfacido de recaudar. Puedes tener efecto positivo, sí, como yo les",
        "start": 2425.28,
        "end": 2431.04
    },
    {
        "text": " me he llenado, para bajar el consumo. Por ejemplo, en los países nórdicos, ha sido mucho tiempo",
        "start": 2431.04,
        "end": 2436.32
    },
    {
        "text": " ya, han impuesto, va a dar redundancia, impuestos a los consumos de vida sacólica, o cigarrillo,",
        "start": 2436.32,
        "end": 2443.2400000000002
    },
    {
        "text": " no? Con fuerte imposición, pero no con un objetivo fiscal, el objetivo es desestimular",
        "start": 2443.24,
        "end": 2449.56
    },
    {
        "text": " el uso y el consumo de soviedes, eso distinto, es decir, cuando se quede estimular el uso",
        "start": 2449.56,
        "end": 2457.3999999999996
    },
    {
        "text": " de algo, se aplica fuertes impuestos para bajar el consumo. ¿Cómo? Sí, suponente que fuera",
        "start": 2457.3999999999996,
        "end": 2470.4799999999996
    },
    {
        "text": " así, aunque no sé si es un impuesto tan alto, como yo te estoy hablando de esto. Sí, sí,",
        "start": 2470.48,
        "end": 2477.72
    },
    {
        "text": " sí, claro, ¿cuándo sabía que ha cacido el garro a cientos y pico peso? ¿No? ¿No",
        "start": 2477.72,
        "end": 2485.0
    },
    {
        "text": " siento cuánto sabía, ahí en FUMA acá? 120 pico peso, 130, ¿no? Por ahí, esto te",
        "start": 2485.0,
        "end": 2491.68
    },
    {
        "text": " habiendo que la caja el cigarro de otros países, el $10, 15 dólares, o sea, en mitad",
        "start": 2491.68,
        "end": 2497.12
    },
    {
        "text": " con un cigarro alién, y saluda, o sea, estamos en dos, tomamos una cervecita, 8, 10 dólares,",
        "start": 2497.12,
        "end": 2505.44
    },
    {
        "text": " tomara. Entonces, estamos en dos, impuestos fuertes, ¿no? Incluso, hay otras medidas,",
        "start": 2505.44,
        "end": 2516.2799999999997
    },
    {
        "text": " también, no se ven en cualquier lado, en fin, hay más regulaciones, pero estamos en",
        "start": 2516.2799999999997,
        "end": 2520.2
    },
    {
        "text": " uno de los que sale, sale bastante. Entonces, ahí tiene un efecto fuerte, ¿no? Acá",
        "start": 2520.2,
        "end": 2528.12
    },
    {
        "text": " creo que esto es un amplio personal, creo que también tuvo un efecto más también disuasivo",
        "start": 2528.12,
        "end": 2533.04
    },
    {
        "text": " de que la gente no se da niepola la salud, que también es importante, eso, no? Por",
        "start": 2533.04,
        "end": 2541.52
    },
    {
        "text": " algo, también se, bueno, tratar de que la sociedad en su conjunto no tenga hábitos",
        "start": 2541.52,
        "end": 2547.4
    },
    {
        "text": " que no sean saludables, un poco la idea, tanto de este tipo de consumo de cosas como",
        "start": 2547.4,
        "end": 2552.44
    },
    {
        "text": " de alimentos, porque también generen un costo social eso, definitivamente la gente se enferma",
        "start": 2552.44,
        "end": 2557.32
    },
    {
        "text": " más y también da a agarrar un costo económico, no solo humano. Vuelvo, entonces, ¿qué",
        "start": 2557.32,
        "end": 2565.48
    },
    {
        "text": " pasa? A veces cuando el impuesto es muy grande, les viene a estar sin duda grande, la",
        "start": 2565.48,
        "end": 2569.08
    },
    {
        "text": " perdi, digo, es grande, porque la cantidad cae. Pero a veces la recaudación puede no",
        "start": 2569.08,
        "end": 2576.68
    },
    {
        "text": " verse beneficiar, pero reitero, puede haberse hecho con un objetivo no recaudatorio, sino",
        "start": 2576.68,
        "end": 2582.4
    },
    {
        "text": " justamente con otro objetivo, y lo que está acá, si el impuesto es pequeño, entonces",
        "start": 2582.4,
        "end": 2589.2799999999997
    },
    {
        "text": " el ingreso fiscal es también reducido, si es mediano, el impuesto mediano, el ingreso",
        "start": 2589.2799999999997,
        "end": 2596.96
    },
    {
        "text": " fiscal va a subir, y si ya el impuesto contenía subiendo mucho, ahí el ingreso fiscal puede",
        "start": 2596.96,
        "end": 2604.96
    },
    {
        "text": " reducirse debido a que baja la cantidad transada. Preguntas, muchachos. ¿No?",
        "start": 2604.96,
        "end": 2614.04
    },
    {
        "text": " ¿Cómo?",
        "start": 2614.04,
        "end": 2623.04
    },
    {
        "text": " ¿Qué hay también? ¿Cuánto sería el impuesto? Sí, claro, sí, sí, sí, sí, sí,",
        "start": 2623.04,
        "end": 2631.8
    },
    {
        "text": " correcto, sí, sí, puede ser analisis, está de ser algún parámetro de referencia,",
        "start": 2631.8,
        "end": 2637.04
    },
    {
        "text": " no puede decir, bueno, hasta acá está bien, porque estimo que la demanda no se va a aprender",
        "start": 2637.04,
        "end": 2641.72
    },
    {
        "text": " afectada, sí, sí, hablás en este caso último, decir, impuesto muy alto, o cualquiera,",
        "start": 2641.72,
        "end": 2647.32
    },
    {
        "text": " sí, sí, bueno, ahora vamos a ver la estructura de mercado monopollo.",
        "start": 2647.32,
        "end": 2665.88
    },
    {
        "text": " Hasta ahora estuvimos viendo nosotros mercados que se llamaba competencia perfecto, mercados",
        "start": 2677.32,
        "end": 2694.76
    },
    {
        "text": " donde había una enorme cantidad de oferentes, un enorme cantidad de consumidores, y que",
        "start": 2694.76,
        "end": 2700.6000000000004
    },
    {
        "text": " el precio estaba determinado por este libre jugo de mercado, o dicho de otra forma, ni",
        "start": 2700.6,
        "end": 2706.92
    },
    {
        "text": " los oferentes ni los demandantes podían influir absolutamente nada en el precio, particular",
        "start": 2706.92,
        "end": 2712.8399999999997
    },
    {
        "text": " las empresas, ¿no? En este caso es distinto, acá estamos hablando de monopollo, bueno,",
        "start": 2712.8399999999997,
        "end": 2719.44
    },
    {
        "text": " la palabra uno, ¿no? Está hablando de que hay una sola empresa que es la que domina el",
        "start": 2719.44,
        "end": 2727.24
    },
    {
        "text": " mercado, o en el caso de extremo es la única que vende ese producto, es decir, cubre toda",
        "start": 2727.24,
        "end": 2733.8799999999997
    },
    {
        "text": " la demanda, que elementos juegan también para que el monopollo sea más robusto, más",
        "start": 2733.8799999999997,
        "end": 2743.0
    },
    {
        "text": " sólido, de la mayor peso, que no haya sustitutos cercanos, es decir, puede haber un producto",
        "start": 2743.0,
        "end": 2749.3999999999996
    },
    {
        "text": " que se venda en un mercado por una sola empresa, un monopollo total, solo esto, pero si",
        "start": 2749.3999999999996,
        "end": 2757.04
    },
    {
        "text": " hay productos que consumidor los que lo considera sustitutos, bueno, en definitiva eso se",
        "start": 2757.04,
        "end": 2762.2799999999997
    },
    {
        "text": " puede extorsionar, en la medida que no haya sustitutos cercanos que está logrando el",
        "start": 2762.2799999999997,
        "end": 2769.1
    },
    {
        "text": " monopollo, justamente que no haya una fácil competencia de su producto que estaba vendiendo,",
        "start": 2769.1,
        "end": 2775.32
    },
    {
        "text": " ¿no? Una empresa competitiva, como yo les mencionaba, toma precios, es decir, el precio",
        "start": 2775.32,
        "end": 2783.6
    },
    {
        "text": " combinado por el mercado, cuando estamos hablando de monopollo, fija precios, y ese elemento clave",
        "start": 2783.6,
        "end": 2792.2799999999997
    },
    {
        "text": " a conseguir a la cada uno de los elementos más importantes. Veamos brevemente algunos",
        "start": 2792.2799999999997,
        "end": 2800.42
    },
    {
        "text": " elementos que explican por qué se gestan, por qué se generan monopollos, por un lado,",
        "start": 2800.42,
        "end": 2807.92
    },
    {
        "text": " que se conoce como monopollo legales, esto es el marco jurídico que ampara a este tipo",
        "start": 2807.92,
        "end": 2818.6800000000003
    },
    {
        "text": " de funcionamiento de las empresas, el Estado le otorga a una empresa pública o privada,",
        "start": 2818.6800000000003,
        "end": 2825.56
    },
    {
        "text": " en exclusividad la producción de determinados bien servicios, con sesión patente derecho",
        "start": 2825.56,
        "end": 2832.1
    },
    {
        "text": " a un doctor, se da algunos casos, este alivio mundial, algunas áreas, algunas los puertos,",
        "start": 2832.1,
        "end": 2840.02
    },
    {
        "text": " por ejemplo, este producción de determinado bien, donde se da este tipo de cosas, también",
        "start": 2840.02,
        "end": 2847.94
    },
    {
        "text": " por derecho de propiedad que puede tener una empresa, justo posee un recurso natural",
        "start": 2847.94,
        "end": 2855.2999999999997
    },
    {
        "text": " importante, en fin, en definitiva hay un marco jurídico, se designa la empresa tal por",
        "start": 2855.3,
        "end": 2863.98
    },
    {
        "text": " un equipy tiempo, por 100, pero no sé, la producción de tal bien o servicio, pero además",
        "start": 2863.98,
        "end": 2872.78
    },
    {
        "text": " está en lo que se conoce como monopollo natural, esto es aquellas empresas que en definitiva",
        "start": 2872.78,
        "end": 2878.5
    },
    {
        "text": " por su funcionamiento, por diferentes composición de factores, se consolidan en el mercado",
        "start": 2878.5,
        "end": 2885.42
    },
    {
        "text": " como monopollo, esa asocia que, esa asocia que la escala que tienen de producción le permite",
        "start": 2885.42,
        "end": 2895.66
    },
    {
        "text": " reducir sus costos medios, los costos promedios, costos unitarios, entonces esa escala de",
        "start": 2895.66,
        "end": 2902.98
    },
    {
        "text": " producción y esa reducción de costos que tienen, en la medida que aumentan la producción,",
        "start": 2902.98,
        "end": 2909.7400000000002
    },
    {
        "text": " torna bastante difícil a otras empresas entrar en el mercado, supongamos una empresa",
        "start": 2909.7400000000002,
        "end": 2915.66
    },
    {
        "text": " de desañamiento o una empresa de suministro de agua potable, o una empresa de suministro",
        "start": 2915.66,
        "end": 2921.3
    },
    {
        "text": " de redes ferrias, ometos, sutarranios en la ciudad, paquiera, entonces en definitiva,",
        "start": 2921.3,
        "end": 2931.98
    },
    {
        "text": " eso implica que eso es una empresa monopública, pero hacer un metro, tampoco algo sencillo,",
        "start": 2931.98,
        "end": 2939.1
    },
    {
        "text": " es una inversión muy grande, captar la venta no está fácil y competirme en el sencillo,",
        "start": 2939.1,
        "end": 2945.54
    },
    {
        "text": " hacer otra redes de saneamiento o una rede de potableización de agua, hay una inversión",
        "start": 2945.54,
        "end": 2951.34
    },
    {
        "text": " fortísima que estamos hablando, de hecho, entonces se torna bastante difícil o gas,",
        "start": 2951.34,
        "end": 2957.5
    },
    {
        "text": " también la distribución de gas porque en hería, o sea hay un montón de elementos que",
        "start": 2957.5,
        "end": 2961.18
    },
    {
        "text": " definitiva torna bastante difícil que otra empresa venda ese producto, en definitiva",
        "start": 2961.18,
        "end": 2968.02
    },
    {
        "text": " está encostoso entrar, para recuperar esta inversión está complicado, entonces esta empresa",
        "start": 2968.02,
        "end": 2977.06
    },
    {
        "text": " ya instalada permite a medida que aumenta la producción, diminuir los costos medios,",
        "start": 2977.06,
        "end": 2985.22
    },
    {
        "text": " entonces opera como una barrera a entrar a ese mercado muy importante, ahí es lo que se conoce",
        "start": 2985.22,
        "end": 2991.2599999999998
    },
    {
        "text": " como monopollo natural, no es que se le dio a esta empresa por temas jurídicos en la explotación",
        "start": 2991.2599999999998,
        "end": 2999.06
    },
    {
        "text": " de tal bien o servicio, sino que en forma por cómo se fue dando las condiciones de producción,",
        "start": 2999.06,
        "end": 3004.14
    },
    {
        "text": " se consolidó en el mercado de forma tal que la unia confrese ese producto, entonces esas",
        "start": 3004.14,
        "end": 3014.3799999999997
    },
    {
        "text": " barreras a la entrada es el elemento clave que hace que un monopollo se consolide o se genere,",
        "start": 3014.38,
        "end": 3020.1
    },
    {
        "text": " y hay elementos que podemos destacar de barreras a la entrada por un lado, la preparación",
        "start": 3022.6600000000003,
        "end": 3029.02
    },
    {
        "text": " recurso clave, como mencionábamos recién, que se dé por parte del gobierno a una empresa",
        "start": 3029.02,
        "end": 3037.98
    },
    {
        "text": " exclusividad, los derechos para explotar determinado producto o servicio, y que los costos de",
        "start": 3038.54,
        "end": 3045.1
    },
    {
        "text": " producción hagan que esa empresa, una empresa sola sea más eficiente que haya más empresas",
        "start": 3045.1,
        "end": 3053.7400000000002
    },
    {
        "text": " en el mercado. Comparando monopollo y competencia, podemos decir que en monopollo hay un solo",
        "start": 3053.7400000000002,
        "end": 3061.94
    },
    {
        "text": " doctor, va a enfrentar una cuba de banda con pendiente negativa, ahora vamos a afundar un",
        "start": 3061.94,
        "end": 3068.3
    },
    {
        "text": " poquito más eso, determina precios, formador de precio, diminuce precios para incrementar las",
        "start": 3068.3,
        "end": 3074.54
    },
    {
        "text": " ventas, mienta que la empresa competitiva es una entre muchas, enfrenta una cura de demanda",
        "start": 3074.54,
        "end": 3082.38
    },
    {
        "text": " horizontal, esto madora de precios y vende mucho o poco a ese mismo precio, esa diferencia fue",
        "start": 3082.38,
        "end": 3091.58
    },
    {
        "text": " fundamental entre competencia perfecta y monopollo, es decir, en definitiva, el monopolista",
        "start": 3091.58,
        "end": 3099.02
    },
    {
        "text": " fija precios, la empresa competitiva no incidente nada, vamos a ver cómo definitiva comparado",
        "start": 3099.02,
        "end": 3108.54
    },
    {
        "text": " precio y cantidad de equilibrio, de maximización, cuando el mercado está en competencia perfecta y me",
        "start": 3108.54,
        "end": 3115.54
    },
    {
        "text": " acabo de monopollo, el monopolio son la cantidad menor y un precio mayor con respecto a mercado",
        "start": 3115.54,
        "end": 3120.66
    },
    {
        "text": " competitivo. El monopolio puede fijar precio, tiene poder de mercado como para poder fijar el",
        "start": 3120.66,
        "end": 3130.64
    },
    {
        "text": " precio, eso no quiere decir que fija cualquier precio o que definitiva pueda fijar cualquier precio,",
        "start": 3130.64,
        "end": 3137.8199999999997
    },
    {
        "text": " porque se van a enfrentar una demanda de los consumidores que va a tener pendiente negativa,",
        "start": 3137.8199999999997,
        "end": 3145.98
    },
    {
        "text": " esto es a mayor precio menos demanda. Vamos a ver que en definitiva el precio hasta",
        "start": 3145.98,
        "end": 3156.34
    },
    {
        "text": " nos haya dado esa demanda de consumidores, no fija las dos cosas, no fija las dos cosas,",
        "start": 3156.34,
        "end": 3165.22
    },
    {
        "text": " el monopolista pero en definitiva condición a la otra, una vez que determina la cantidad de",
        "start": 3168.32,
        "end": 3174.54
    },
    {
        "text": " determina el precio, vamos a verlo eso. El precio está en función de la cantidad demandada y esto",
        "start": 3174.54,
        "end": 3187.38
    },
    {
        "text": " es importante, como recién decimos, si bien fija precio no es cualquiera, va a depender de la",
        "start": 3187.38,
        "end": 3193.62
    },
    {
        "text": " demanda, obviamente si puede vender un precio mayor lo va a vender, pero ojo, porque a medida que vende",
        "start": 3193.62,
        "end": 3201.42
    },
    {
        "text": " más el precio va a bajar porque estamos en una pendiente negativa, por lo tanto no es ilimitada de la",
        "start": 3201.54,
        "end": 3207.34
    },
    {
        "text": " posibilidad que tiene, bueno menos teóricamente hablando de fijar cualquier precio. Entonces la",
        "start": 3207.34,
        "end": 3216.06
    },
    {
        "text": " cuya demanda tiene pendiente negativa y como ya le mencionaba a este precio lo puede vender",
        "start": 3216.06,
        "end": 3220.9
    },
    {
        "text": " esta cantidad demandada y este precio más, precio baja vende más.",
        "start": 3220.98,
        "end": 3226.2200000000003
    },
    {
        "text": " Recuerden que esta era la curva demanda que enfrentaba una empresa competitiva, era el precio",
        "start": 3232.2200000000003,
        "end": 3239.3
    },
    {
        "text": " del bien, a ese precio decíamos recién puede vender una enorme cantidad de productos más o menos,",
        "start": 3239.3,
        "end": 3246.42
    },
    {
        "text": " pero lo vendrá el precio. El monopolista no se enfrenta la curva, realmente como conocioma la",
        "start": 3246.42,
        "end": 3252.1800000000003
    },
    {
        "text": " curva demanda con la ley de demanda, ¿no? Y en verdad, a mayor precio se va a demandarse menos en el",
        "start": 3252.1800000000003,
        "end": 3259.58
    },
    {
        "text": " mercado y a mayor precio se demanda más. Como determina la cantidad óptima del monopolista,",
        "start": 3259.58,
        "end": 3270.26
    },
    {
        "text": " bueno con un quietero racional, el empresario monopolista también va a maximizar beneficios,",
        "start": 3270.26,
        "end": 3277.82
    },
    {
        "text": " va a perseguir maximizar beneficios, donde va a maximizar beneficios, donde la diferencia del",
        "start": 3277.82,
        "end": 3285.2200000000003
    },
    {
        "text": " ingreso total sea mayor con respecto al costo total, esto es ingreso a marginal igual al costo",
        "start": 3285.2200000000003,
        "end": 3292.7400000000002
    },
    {
        "text": " marginal, es decir que la condición de equilibrio de maximización es igual, ingreso a marginal igual al",
        "start": 3292.7400000000002,
        "end": 3300.0200000000004
    },
    {
        "text": " costo marginal, lo que se diferencia con respecto a competencia perfecta que acá no es igual al",
        "start": 3300.02,
        "end": 3306.06
    },
    {
        "text": " precio como era en el caso de competencia perfecta, pero la condición de equilibrio es la misma.",
        "start": 3306.06,
        "end": 3311.66
    },
    {
        "text": " ¿Qué pasa cuando el monopolista quiere maximizar su beneficio y está diciendo, bueno,",
        "start": 3314.78,
        "end": 3322.7
    },
    {
        "text": " cuántas niñas puedo vender, ¿no? Ya sabemos que se enfrenta a una demanda competente negativa,",
        "start": 3322.7,
        "end": 3329.62
    },
    {
        "text": " por lo tanto, y tiene que tomar en cuenta que el precio varía dependiendo de la cantidad,",
        "start": 3330.3399999999997,
        "end": 3340.62
    },
    {
        "text": " ¿no? Entonces sabemos o asumimos también que en el caso competitivo que todo lo que se",
        "start": 3340.62,
        "end": 3347.7799999999997
    },
    {
        "text": " produce se vende, el precio va a estar en función de la demanda, a medida que la producción aumenta o",
        "start": 3347.7799999999997,
        "end": 3354.2799999999997
    },
    {
        "text": " vende, el precio va a bajar, o sea que por un lado vende más unidades, por lo tanto el ingreso",
        "start": 3354.84,
        "end": 3360.5600000000004
    },
    {
        "text": " va a dar dinero, pero el precio que el vende, que vende toda la sonida es diminuye, por lo tanto,",
        "start": 3360.5600000000004,
        "end": 3367.2400000000002
    },
    {
        "text": " este P por Q que veíamos antes en competencia perfecta se diferencia que este P depende de Q,",
        "start": 3367.2400000000002,
        "end": 3375.44
    },
    {
        "text": " por lo tanto el ingreso total va a tener un efecto positivo porque aumenta Q, pero como P baja hay",
        "start": 3375.44,
        "end": 3384.1600000000003
    },
    {
        "text": " que ver cuáles dos realmente se impone. El ingreso medio, el ingreso medio conceptualmente es el",
        "start": 3384.16,
        "end": 3392.18
    },
    {
        "text": " ingreso en promedio, va a ser el ingreso total dividido a Q, por lo tanto va a ser igual al precio",
        "start": 3392.18,
        "end": 3399.08
    },
    {
        "text": " también con la salvedad de que el precio acá es un precio en función de Q, coincide con el",
        "start": 3399.08,
        "end": 3406.52
    },
    {
        "text": " precio que cada vez es menor y todas las unidades se van a vender a ese precio. El ingreso marginal,",
        "start": 3406.52,
        "end": 3415.6
    },
    {
        "text": " recordemos que el ingreso marginal es el ingreso que obtiene la empresa por vender una unidad más,",
        "start": 3415.6,
        "end": 3421.28
    },
    {
        "text": " el ingreso marginal en caso de competencia perfecta igual al precio, ¿sacuérdense?",
        "start": 3423.7599999999998,
        "end": 3431.06
    },
    {
        "text": " Bueno acá hay que tener cuidado, el ingreso marginal es menor el ingreso medio, es menor al precio.",
        "start": 3431.7799999999997,
        "end": 3438.62
    },
    {
        "text": " La caída de precio afecta a todas las unidades no a la última.",
        "start": 3441.9,
        "end": 3447.5
    },
    {
        "text": " El ingreso marginal le monopolista entonces siempre es menor que el precio del bien, la cuba de",
        "start": 3453.22,
        "end": 3458.06
    },
    {
        "text": " manda que se enfrenta, la cuba de manda competente negativa y cuando el monopolista reduce el",
        "start": 3458.06,
        "end": 3465.74
    },
    {
        "text": " precio para vender una unidad más, el ingreso recibió por las unidades que ya había vendido",
        "start": 3465.74,
        "end": 3472.66
    },
    {
        "text": " también diminuces, o sea afecta a todas las unidades. Entonces, ¿qué ocurre cuando el monopolista",
        "start": 3472.66,
        "end": 3484.74
    },
    {
        "text": " vende una unidad más? Bueno, por un lado, como yo le mencionaba, hay un ingreso marginal dado por",
        "start": 3484.74,
        "end": 3493.7799999999997
    },
    {
        "text": " la venta de ese producto, pero por la venta del deputo de unidades, pero ¿qué pasa? Como el",
        "start": 3493.7799999999997,
        "end": 3503.5
    },
    {
        "text": " precio es menor, cae por ese lado, por lo tanto en la cuba de ingreso total tiene esta forma,",
        "start": 3503.5,
        "end": 3509.9799999999996
    },
    {
        "text": " va creciendo, va creciendo hasta que llega un máximo y diminuye.",
        "start": 3509.98,
        "end": 3513.66
    },
    {
        "text": " Es decir, va a llegar un momento que la diminución del precio es la que domina a",
        "start": 3523.38,
        "end": 3530.42
    },
    {
        "text": " el aumento del ingreso que obtiene por vender más unidades. Recuerden, así como vimos también,",
        "start": 3530.42,
        "end": 3537.26
    },
    {
        "text": " para el caso de una empresa que se estaba planteando competitivo, ¿cuántos sonidades de vender?",
        "start": 3537.26,
        "end": 3542.6200000000003
    },
    {
        "text": " Si le convenía vender el máximo de unidades posible, de acuerdo a su capacidad de producción,",
        "start": 3542.6200000000003,
        "end": 3547.86
    },
    {
        "text": " decíamos, ojo, no necesariamente, porque hay que ver los costos, acá también,",
        "start": 3547.86,
        "end": 3552.6200000000003
    },
    {
        "text": " estamos en cuenta que el ingreso total, si bien tiene un máximo, eso no quiere decir que ese sea el",
        "start": 3552.6200000000003,
        "end": 3559.1000000000004
    },
    {
        "text": " punto del monopolista maximiza o los beneficios. Lo único que estamos hablando acá es",
        "start": 3559.1000000000004,
        "end": 3567.2200000000003
    },
    {
        "text": " que la empresa tiene el máximo de ingreso total, pero no quiere decir que tenga el máximo",
        "start": 3567.2599999999998,
        "end": 3572.66
    },
    {
        "text": " de beneficio, porque también hay que considerar acá que pasa con los costos.",
        "start": 3572.66,
        "end": 3576.8999999999996
    },
    {
        "text": " La curva de ingreso medio y la cuba de ingreso marginal, la cuba de ingreso medio es descendente,",
        "start": 3580.5,
        "end": 3586.8999999999996
    },
    {
        "text": " igual que la cuba de ingreso marginal, cuando el ingreso marginal se hace cero, el ingreso total",
        "start": 3586.8999999999996,
        "end": 3595.3799999999997
    },
    {
        "text": " llegó al máximo, nos olvidemos que la derivada del ingreso total es justamente la cuba de ingreso",
        "start": 3595.38,
        "end": 3601.38
    },
    {
        "text": " marginal. La cuba de ingreso medio y si igual a la curva de demanda, la curva de demanda que se enfrenta",
        "start": 3601.38,
        "end": 3609.86
    },
    {
        "text": " el monopolista. Este cuadro simplemente para verificar las tendencias que veíamos,",
        "start": 3609.86,
        "end": 3616.06
    },
    {
        "text": " recién, es decir, vemos que el monopolista va vendiendo más unidades, pero el precio que le va",
        "start": 3617.06,
        "end": 3626.86
    },
    {
        "text": " vendiendo es que a veces menor, el ingreso total va subiendo después baja, el ingreso medio coincide",
        "start": 3626.86,
        "end": 3635.34
    },
    {
        "text": " con el precio y el ingreso marginal tiene una tendencia descendente y en este caso en el último punto",
        "start": 3635.34,
        "end": 3642.14
    },
    {
        "text": " es negativo. Decidamos que el nivel de maximización del monopolista va a ser en la que el nivel de",
        "start": 3642.14,
        "end": 3656.58
    },
    {
        "text": " producción, donde el ingreso marginal es igual al costo marginal, ahí determina el volumen de",
        "start": 3656.58,
        "end": 3662.1
    },
    {
        "text": " producción Q. Con ese nivel de producción Q va en definitiva a encontrar el precio que le indica",
        "start": 3662.1,
        "end": 3673.38
    },
    {
        "text": " la curva de demanda si la despoblición va a pagar de los consumidores y ese va a ser el precio del",
        "start": 3673.38,
        "end": 3680.2599999999998
    },
    {
        "text": " bien que se va a tronzar en el mercado. Entonces, tenemos la curva de costo marginal,",
        "start": 3680.26,
        "end": 3709.6200000000003
    },
    {
        "text": " tenemos la curva de ingreso marginal. El punto de maximización va a ser como siempre cuando la",
        "start": 3709.62,
        "end": 3733.02
    },
    {
        "text": " curva del costo marginal igual a el ingreso marginal, ¿no? Sería este punto de destacar.",
        "start": 3733.02,
        "end": 3738.58
    },
    {
        "text": " Este punto de destacar, pero...",
        "start": 3741.38,
        "end": 3743.02
    },
    {
        "text": " ¿Qué pasa? Fija de ese volumen de producción, lo que decíamos recién es que se traslada esto hacia la curva",
        "start": 3743.02,
        "end": 3767.86
    },
    {
        "text": " de demanda y ahí se fija el precio. Entonces, lo que hace el monopolista es determina el máximo de",
        "start": 3767.86,
        "end": 3776.1800000000003
    },
    {
        "text": " beneficio donde el nivel de producción coincide con el corte de estado dos curvas, corto marginal,",
        "start": 3776.1800000000003,
        "end": 3783.34
    },
    {
        "text": " pero el precio va tardado por la curva de demanda. Entonces, como se expresa acá, el Q,",
        "start": 3783.34,
        "end": 3798.7400000000002
    },
    {
        "text": " como ya le dije, está por el ingreso marginal, la interdición de ingreso marginal y costo marginal.",
        "start": 3798.7400000000002,
        "end": 3803.3
    },
    {
        "text": " Tras la dado de esto la curva de demanda, este es el precio que va a infinitidad a presivir el monopolista",
        "start": 3803.3,
        "end": 3809.2200000000003
    },
    {
        "text": " que va a pagar el consumidor. Obviamente, hay racional esto, ¿no? Si produjera menos, no tenía sentido",
        "start": 3809.22,
        "end": 3823.98
    },
    {
        "text": " porque el ingreso marginal es mayor que el costo marginal, por lo tanto dejaría de ganar y si",
        "start": 3823.98,
        "end": 3830.62
    },
    {
        "text": " producen más, ahí tendría beneficio marginal negativo, ya que no hay duda que el Q es cuando el",
        "start": 3830.62,
        "end": 3835.74
    },
    {
        "text": " ingreso marginal es igual a costo marginal. La diferencia sustantiva con el petro competencia perfecta es",
        "start": 3835.74,
        "end": 3841.06
    },
    {
        "text": " justamente que el monopolista obtiene este precio por encima del costo medio, por encima de los costos",
        "start": 3841.06,
        "end": 3849.3399999999997
    },
    {
        "text": " medios, y obtiene un beneficio positivo y un beneficio extranormal. Está área, digamos, que",
        "start": 3849.3399999999997,
        "end": 3859.14
    },
    {
        "text": " el beneficio, que es la propia del capitalista monopolista, digamos, es un beneficio extra extraordinario,",
        "start": 3859.14,
        "end": 3869.1
    },
    {
        "text": " que es un proficio normal, y ahí la diferencia con competencia perfecta. El monopolio dice,",
        "start": 3869.1,
        "end": 3876.22
    },
    {
        "text": " tiene beneficio de esta normales positivos, y ahí el poder que tiene sobre el mercado, el poder",
        "start": 3876.22,
        "end": 3883.54
    },
    {
        "text": " de fijar el precio, de ahí la ventaja que tiene del punto de vista de la empresa, obtiene un",
        "start": 3883.54,
        "end": 3889.3
    },
    {
        "text": " precio superior al costo medio. Recuerdan que cuando veíamos competencia perfecta, hablamos que el",
        "start": 3889.3,
        "end": 3897.74
    },
    {
        "text": " empresario maximizaba, siempre cuando el precio se iguala el costo marginal, ¿no? Y obtenía beneficios",
        "start": 3897.74,
        "end": 3911.5
    },
    {
        "text": " nulos cuando cortaba a la culpa de coincidiría con el mínimo del costo medio. Y esta es la situación",
        "start": 3911.5,
        "end": 3922.98
    },
    {
        "text": " en largo plazo que podíamos prever. Beneficios nulos, beneficios normales. Bueno, el monopolista,",
        "start": 3922.98,
        "end": 3928.78
    },
    {
        "text": " porque tiene poder de mercado, fija por un precio superior del costo medio, por lo tanto,",
        "start": 3928.78,
        "end": 3933.58
    },
    {
        "text": " supongo su propio costo marginal, por lo tanto se apropia de un beneficio extra extraordinario.",
        "start": 3933.58,
        "end": 3940.42
    },
    {
        "text": " Bueno, les comento, no más, que la cantidad de optimas bastan en el tramo elástico de la",
        "start": 3950.74,
        "end": 3955.62
    },
    {
        "text": " culpa de demanda, implica que a partir de dicha cantidad de optimas, un aumento de precios,",
        "start": 3955.62,
        "end": 3959.86
    },
    {
        "text": " tendrá como consecuencia una caída de cantidad de ese más loco porción.",
        "start": 3960.42,
        "end": 3963.34
    },
    {
        "text": " ¿Por qué hay beneficios superiores a normales en un monopolista? Porque, obviamente, hay barreas",
        "start": 3965.54,
        "end": 3971.02
    },
    {
        "text": " al entrada. Hay difícil que entre otras empresas, como mencionábamos recién. A diferencia de lo",
        "start": 3971.02,
        "end": 3976.54
    },
    {
        "text": " que pasaba, esmercado competitivo, ¿no? De si había beneficios superiores, comentábamos recién,",
        "start": 3976.54,
        "end": 3982.1400000000003
    },
    {
        "text": " lo que ocurría es que iba a haber capitales a procurarse bien, aumentaba la oferta, bajaba el precio.",
        "start": 3982.1400000000003,
        "end": 3987.94
    },
    {
        "text": " Acá como no hay esa flexibilidad de que ingrese en empresa a producir ese bien, el monopolista",
        "start": 3988.5,
        "end": 3994.46
    },
    {
        "text": " mantiene ese poder y mantiene la posibilidad de tener beneficios superiores.",
        "start": 3994.46,
        "end": 3998.9
    },
    {
        "text": " Un elemento interesante es que el monopolista no tiene sentido hablar el cubo oferta,",
        "start": 4001.38,
        "end": 4010.78
    },
    {
        "text": " no hay una cubo oferta, ¿no? Porque, en definitiva, cuando el monopolista define la cantidad,",
        "start": 4010.78,
        "end": 4017.7400000000002
    },
    {
        "text": " también está determinando el precio, no es que hay una variación de la cantidad ofrecida,",
        "start": 4017.7400000000002,
        "end": 4023.94
    },
    {
        "text": " la acuerdo al precio como pasaba en un mercado competitivo, entonces definitiva no hay una cubo",
        "start": 4023.94,
        "end": 4030.6200000000003
    },
    {
        "text": " oferta en monopolia.",
        "start": 4030.6200000000003,
        "end": 4032.42
    },
    {
        "text": " Entonces, el monopolista fija un precio por encima del costo marginal, con respecto a",
        "start": 4032.42,
        "end": 4040.78
    },
    {
        "text": " competirse a perfecta, de punto de vista de los consumidores, esto obviamente no es la situación",
        "start": 4040.78,
        "end": 4046.7400000000002
    },
    {
        "text": " más deseada, del punto de vista de la empresario sí, porque obtiene una ventaja, un beneficio superior,",
        "start": 4046.7400000000002,
        "end": 4052.7000000000003
    },
    {
        "text": " ¿y qué pasa con los accidentes? ¿Qué pasa con el bienestar? Entonces, observemos.",
        "start": 4052.7000000000003,
        "end": 4060.78
    },
    {
        "text": " Acá está el precio que fija en definitiva el funcionamiento del mercado monopolista, ¿no?",
        "start": 4062.98,
        "end": 4070.7400000000002
    },
    {
        "text": " De terminas esta cantidad, va a ser la demanda y fija el precio. Por lo tanto, el accidente,",
        "start": 4070.7400000000002,
        "end": 4076.7400000000002
    },
    {
        "text": " el consumidor, que ha determinado siempre entre la diferencia, entre la demanda y el precio que",
        "start": 4076.7400000000002,
        "end": 4082.66
    },
    {
        "text": " paga, en el triángulo este que está acá arriba, el área está arriba.",
        "start": 4082.66,
        "end": 4087.3
    },
    {
        "text": " El accidente del productor también, ese precio que recibe menos el costo marginal, ya todo",
        "start": 4087.3,
        "end": 4097.18
    },
    {
        "text": " está ahí, que está acá subrayada. Comparado con un mercado competitivo, ¿qué podemos decir que",
        "start": 4097.18,
        "end": 4105.1
    },
    {
        "text": " el accidente del consumidor es inferior, más chico y que el accidente del productor es mayor,",
        "start": 4105.1,
        "end": 4110.7
    },
    {
        "text": " en un monopolio con respecto a un mercado competitivo?",
        "start": 4111.42,
        "end": 4114.0199999999995
    },
    {
        "text": " ¿Qué pasa con las cantidades? Bueno, las cantidades se ven afectadas también como yo les mencionaba,",
        "start": 4125.0199999999995,
        "end": 4131.62
    },
    {
        "text": " esto también afecta el bienestar, esto también afecta el último social, un equilibrio competitivo",
        "start": 4131.62,
        "end": 4139.34
    },
    {
        "text": " comparado con el monopolista, implica que en competencia perfecta la cantidad es mayor que",
        "start": 4139.34,
        "end": 4146.5
    },
    {
        "text": " en monopolio y el precio menor. Entonces también por el lado de las dos lados, por el precio más",
        "start": 4146.5,
        "end": 4154.82
    },
    {
        "text": " alto en monopolio y la cantidad es menor con respecto a competencia perfecta. Entonces, comparando",
        "start": 4154.82,
        "end": 4164.18
    },
    {
        "text": " esta gráfica, compara lo que sería el accidente competitivo, el accidente del mercado",
        "start": 4164.18,
        "end": 4176.14
    },
    {
        "text": " monopolico. Entonces, fíjense, en competencia perfecta el consumidor tendría esta área,",
        "start": 4176.14,
        "end": 4182.42
    },
    {
        "text": " como accidente del consumidor uno más dos más tres. Siempre recuerden la demanda con respecto",
        "start": 4182.42,
        "end": 4191.62
    },
    {
        "text": " al precio, pero cuando hay monopolio, el precio se figa acá, en definitiva, el área del consumidor",
        "start": 4191.62,
        "end": 4201.18
    },
    {
        "text": " que el accidente queda restringido solo al uno. Por lo tanto, el consumidor, los consumidores",
        "start": 4201.18,
        "end": 4212.42
    },
    {
        "text": " despierden las áreas dos más tres cuando hay un monopolio, con respecto al mercado competitivo.",
        "start": 4212.42,
        "end": 4218.58
    },
    {
        "text": " ¿Qué pasa del punto de vista del productor? El productor al mercado competitivo tendría estas dos",
        "start": 4226.74,
        "end": 4231.58
    },
    {
        "text": " áreas, cuatro más cinco, ¿no? Ahora, cuando hay monopolio, pierde esta cinco y gana el dos.",
        "start": 4231.58,
        "end": 4241.74
    },
    {
        "text": " Entonces, acá podemos ver que así como el consumidor ver reducido su accidente con respecto",
        "start": 4246.94,
        "end": 4252.82
    },
    {
        "text": " al mercado competitivo, en dos más tres, el dos se lo transfiere al oferente, en este caso",
        "start": 4252.82,
        "end": 4261.54
    },
    {
        "text": " el monopolista. Un mercado monopolista tiene el punto de vista del productor mayor excedente,",
        "start": 4261.54,
        "end": 4267.42
    },
    {
        "text": " porque esta área que obtiene de transferencia del consumidor es mayor que la que pierde,",
        "start": 4267.42,
        "end": 4275.42
    },
    {
        "text": " respeta competitivo al cinco, o sea, en cuanto a excedente comparando un mercado competitivo,",
        "start": 4276.02,
        "end": 4287.74
    },
    {
        "text": " con un mercado monopolico vemos. El consumidor o los consumidores ven reducido su accidente,",
        "start": 4287.74,
        "end": 4295.82
    },
    {
        "text": " parte lo se den al productor monopolista y los empresarios o los referentes tienen un accidente",
        "start": 4295.82,
        "end": 4308.259999999999
    },
    {
        "text": " mayor, parte lo tienen por los consumidores y pierden esta parte cinco, al igual que los consumidores",
        "start": 4308.259999999999,
        "end": 4321.299999999999
    },
    {
        "text": " es tres y cinco, que esa no se lo recupera nadie, esta también es una pérdia y recuperar",
        "start": 4321.3,
        "end": 4325.58
    },
    {
        "text": " la deficiencia similar a la que habíamos en el caso de impuestos. En definitiva, un mercado",
        "start": 4325.58,
        "end": 4338.7
    },
    {
        "text": " monopolico comparado con el mercado competitivo es perfecta, genera un efecto distorsivo de cuanto",
        "start": 4338.7,
        "end": 4344.54
    },
    {
        "text": " a la eficiencia. Los productores se beneficien, en este caso, los consumidores se perjudican y a nivel",
        "start": 4344.54,
        "end": 4353.18
    },
    {
        "text": " social hay una pérdida también irrecuparable de eficiencia. Es muy similar a los impuestos,",
        "start": 4353.18,
        "end": 4360.26
    },
    {
        "text": " la única diferencia es que en el caso de la aplicación del impuesto estaba el estado que recuperaba",
        "start": 4360.26,
        "end": 4366.58
    },
    {
        "text": " parte de esa disminución, vexadente, en este caso el único que se beneficia es la empresa",
        "start": 4366.58,
        "end": 4373.62
    },
    {
        "text": " monopolista. Pero a nivel social hay una pérdida recuperar la eficiencia, daba por las áreas",
        "start": 4373.62,
        "end": 4379.34
    },
    {
        "text": " tres y cinco en este ejemplo. Se entendió esto, muchos chatos. ¿Duda? ¿Pregundas?",
        "start": 4379.34,
        "end": 4392.34
    },
    {
        "text": " Entonces, la pría ven de estar causada por el monopolio, se mirar de casos impuestos,",
        "start": 4397.9800000000005,
        "end": 4404.26
    },
    {
        "text": " la diferencia como yo les mencionaba es que en el caso de los impuestos que ven los captas a través",
        "start": 4404.26,
        "end": 4411.58
    },
    {
        "text": " de la recaudación impositiva, mientras que en este caso la empresa monopolica y las obtiene todos",
        "start": 4411.58,
        "end": 4416.58
    },
    {
        "text": " los beneficios.",
        "start": 4416.58,
        "end": 4417.34
    },
    {
        "text": " ¿Pregundas? Bueno, oligopolio. Oligopolio es una estructura muy similar, en caso de monopolio,",
        "start": 4417.34,
        "end": 4433.860000000001
    },
    {
        "text": " solo que en vez de hablar de una sola empresa hablamos de un pequeño grupo de empresas. En realidad",
        "start": 4433.860000000001,
        "end": 4439.18
    },
    {
        "text": " es algo que uno puede verificar a nivel de enorme cantidad de productos a nivel mundial,",
        "start": 4439.18,
        "end": 4448.1
    },
    {
        "text": " oligopolios, folicos son de autos, medicamentos, empresas metalúrgicas, una enorme cantidad",
        "start": 4448.1,
        "end": 4457.3
    },
    {
        "text": " de empresas alimenticias, empresas de comunicación, pequeñas grupos de empresas que dominan",
        "start": 4457.3,
        "end": 4465.42
    },
    {
        "text": " en el mercado mundial. El productor adecine, en fin, la inmensa cantidad de ruros, si",
        "start": 4465.42,
        "end": 4475.34
    },
    {
        "text": " vamos a pensar en la mayoría, una gran concentración de empresas que dominan en el mercado, o en su",
        "start": 4475.34,
        "end": 4483.18
    },
    {
        "text": " totalidad o en su inmensa mayoría, la conseja. Ahí es cuando estamos hablando de uno oligopolio.",
        "start": 4483.18,
        "end": 4491.42
    },
    {
        "text": " Entonces, puede dar el caso de que los oligopolios también operen en forma tal que sea con un",
        "start": 4491.42,
        "end": 4504.9400000000005
    },
    {
        "text": " monopolio, por el peso que tengan en el mercado y quiere tener la misma ineficiencia que genera un",
        "start": 4504.9400000000005,
        "end": 4509.86
    },
    {
        "text": " monopolio. Se pueden dar también por concesiones o también por razones naturales, al igual que los",
        "start": 4509.86,
        "end": 4518.34
    },
    {
        "text": " monopolios por escala de producción o por reducción de costos. Dificativa, reitero, o torgamiento",
        "start": 4518.34,
        "end": 4529.34
    },
    {
        "text": " legalmente o por elementos naturales. Hay diferentes situaciones del oligopolio, se habla del",
        "start": 4529.34,
        "end": 4539.860000000001
    },
    {
        "text": " oligopolio corrosivo cuando las empresas acuerdan sobre cantidades o sobre los precios, y ahí",
        "start": 4539.860000000001,
        "end": 4547.900000000001
    },
    {
        "text": " operan en forma monolítica. Cuando acuerdan ya no competen, esto está bastante controlado,",
        "start": 4547.9,
        "end": 4559.66
    },
    {
        "text": " prohibido, mucha legislación de países, como que no se permite que haya este tipo de acuerdon",
        "start": 4559.66,
        "end": 4567.0599999999995
    },
    {
        "text": " entre las empresas. Entonces, tenemos, por ejemplo, el caso del cartel, el cartel, yo no",
        "start": 4567.06,
        "end": 4578.4800000000005
    },
    {
        "text": " digo polio, que en definitiva opera como un monopolio, fija el precio o fija la cantidad, y así",
        "start": 4578.4800000000005,
        "end": 4585.22
    },
    {
        "text": " se van distribuyendo al mercado. Ahí podemos el caso de OPEP, la Comisión de países",
        "start": 4585.22,
        "end": 4593.64
    },
    {
        "text": " de esportadores de petróleo, donde un pequeño punido países, por lo menos durante muchísimos",
        "start": 4593.64,
        "end": 4600.12
    },
    {
        "text": " años tuvieron un peso decisivo en la fijación del precio del barrio de petróleo. También se",
        "start": 4600.12,
        "end": 4610.6
    },
    {
        "text": " habla de liderazgo, el oligopolio de liderazgo, de donde hay una empresa dominante dentro de ese",
        "start": 4610.6,
        "end": 4617.72
    },
    {
        "text": " pequeño grupo de empresas que ofrece ese producto, que es la que en ciertas formas marca las",
        "start": 4617.72,
        "end": 4624.4800000000005
    },
    {
        "text": " pautas a las otras, ya se te lo siguen. Por ejemplo, está empezado a dominante, fija el precio y que",
        "start": 4624.4800000000005,
        "end": 4630.72
    },
    {
        "text": " lo además aceptan así que haya intervenido la decisión. Es el derago, muchas veces se da por",
        "start": 4630.72,
        "end": 4639.88
    },
    {
        "text": " prestigio, por eficiencia, por tamaño de la empresa, por el peso que tiene la empresa de",
        "start": 4639.88,
        "end": 4645.92
    },
    {
        "text": " mercado. Cuando hay colución, muchas veces no se mantienen eso, hay como una tendencia violar esos",
        "start": 4645.92,
        "end": 4661.72
    },
    {
        "text": " recuerdos, ya que, bueno, algunos de los integrantes que pautan ese acuerdo pueden ver se",
        "start": 4661.72,
        "end": 4673.5
    },
    {
        "text": " intenta salirse, obtener un beneficio adicional y no tiene ser muy estable. ¿Qué pasa cuando hay",
        "start": 4673.5,
        "end": 4681.22
    },
    {
        "text": " un oligopolio colusivo? Las cantidades y el precio que se obtienen son las mismas que un monopólio.",
        "start": 4681.22,
        "end": 4688.46
    },
    {
        "text": " En definitiva, un oligopolio colusivo tiene, en punto de vista del mercado, un efecto similar",
        "start": 4689.46,
        "end": 4695.58
    },
    {
        "text": " en cuanto al precio ya, ya la cantidad como si fuera una empresa monopólica. Esto es una cantidad",
        "start": 4696.14,
        "end": 4704.34
    },
    {
        "text": " menor y un precio mayor con respecto al mercado competitivo. Ya cuando los oligopolios compiten, o sea,",
        "start": 4704.34,
        "end": 4711.14
    },
    {
        "text": " no hay una acuerdo, no son colusivos, pueden competir en cantidad o en precio, ahí ya la cosa",
        "start": 4711.14,
        "end": 4719.34
    },
    {
        "text": " varía un poco. Es decir, cuando las empresas competen por calidad, por ejemplo, ahí lo que hacen",
        "start": 4719.34,
        "end": 4725.74
    },
    {
        "text": " es que las empresas observan o determina su capacidad de producción, en función de lo que estiman",
        "start": 4725.74,
        "end": 4732.1
    },
    {
        "text": " que la otra va a producir o las otras van a producir. Entonces, si bien se reparten el mercado,",
        "start": 4732.1,
        "end": 4737.66
    },
    {
        "text": " hacen como una reacción a lo que preven que van a hacer las otras. Entonces, en base a eso es",
        "start": 4737.66,
        "end": 4747.3
    },
    {
        "text": " que toman la decisión de producir siempre con un objetivo maximizador. Entonces, se genera una",
        "start": 4747.3,
        "end": 4754.9800000000005
    },
    {
        "text": " interdependencia entre las empresas dando lugar a lo que se conoce como la función de reacción.",
        "start": 4754.9800000000005,
        "end": 4759.34
    },
    {
        "text": " ¿Qué pasa el oligopolio que compita a cantidades? Bueno, acá las cantidades son menores a un mercón",
        "start": 4763.06,
        "end": 4771.62
    },
    {
        "text": " competitivo, pero es mayor que lo que se daría el monopollo.",
        "start": 4771.62,
        "end": 4778.42
    },
    {
        "text": " Cuando las empresas compiten por precio, acá hay una competencia por precio, entonces las empresas",
        "start": 4792.26,
        "end": 4797.5
    },
    {
        "text": " entran como una dinámica de competir y bajar los precios para tratar obviamente de captar el",
        "start": 4798.06,
        "end": 4802.86
    },
    {
        "text": " mercado, vender la famosa barata, ahí obviamente eso tiene una barrera, un límite que es el costo",
        "start": 4802.86,
        "end": 4810.94
    },
    {
        "text": " marginal. No olvidemos que estamos hablando de la empresa que tiene por el mercado y que venden por",
        "start": 4810.94,
        "end": 4815.58
    },
    {
        "text": " encima del costo marginal, por lo tanto, si entran a bajar los precios, cada vez se hace más",
        "start": 4815.58,
        "end": 4822.46
    },
    {
        "text": " competitivo, más similar a un mercado competitivo, pero el límite sería el costo marginal, si no,",
        "start": 4822.46,
        "end": 4828.3
    },
    {
        "text": " ya sería obviamente un mercado competitivo perfecto. Entonces, en un mercadolivo,",
        "start": 4828.3,
        "end": 4842.06
    },
    {
        "text": " polico, los productores consideran que pasa con las demás, la reacción de las empresas,",
        "start": 4842.06,
        "end": 4849.1
    },
    {
        "text": " hay como una análisis más de estrategia, a ver qué van a hacer las otras empresas, entonces ahí",
        "start": 4849.660000000001,
        "end": 4856.14
    },
    {
        "text": " tomo la decisión. En el caso de un monopollo, la empresa es la única en el mercado, por lo tanto",
        "start": 4856.14,
        "end": 4861.820000000001
    },
    {
        "text": " obviamente no, ahí nada y las empresas que pensan por fuera tampoco, ahí son tan insignificantes,",
        "start": 4861.820000000001,
        "end": 4867.820000000001
    },
    {
        "text": " lo que pesa, cada empresa en el mercado, que ahí no hay un estudio de cuánto que va a pasar con",
        "start": 4867.820000000001,
        "end": 4875.34
    },
    {
        "text": " las otras. Esto es veces cedado, digamos, esto es veces cedado, en el empezo monopólica, uno lo",
        "start": 4875.34,
        "end": 4882.62
    },
    {
        "text": " ve por ejemplo con algunos productos innovadores, es decir, saco este producto, o sale un producto",
        "start": 4882.62,
        "end": 4889.58
    },
    {
        "text": " nuevo en el mercado, y al poco tiempo las mismas marcas competitivas lo sacan con alguna pequeña",
        "start": 4889.58,
        "end": 4896.34
    },
    {
        "text": " variante, pero definitiva ofrecen lo mismo, lo vemos en las cosas electrónicas, continuamente",
        "start": 4896.34,
        "end": 4902.9400000000005
    },
    {
        "text": " los automóvides también se ve eso. ¿Qué pasa con esta interacción? Es como un",
        "start": 4902.94,
        "end": 4917.66
    },
    {
        "text": " idioma, es decir, una empresa fija el precio o suponer o la cantidad, en función de lo que pasa",
        "start": 4917.66,
        "end": 4926.74
    },
    {
        "text": " con las otras, ya suben las otras competidoras también, toman en cuenta la decisión de la empresa,",
        "start": 4926.74,
        "end": 4931.66
    },
    {
        "text": " y ahí esa dependencia que se da en la toma de decisiones. Entonces las empresas consiguen",
        "start": 4931.66,
        "end": 4940.42
    },
    {
        "text": " uno mejor resultados posibles y no tienen razón alguna para alterar su precio o su nivel de producción",
        "start": 4940.42,
        "end": 4946.62
    },
    {
        "text": " cuando llegan al equilibrio, y cada empresa toma en cuenta sus competidoras, y además",
        "start": 4946.62,
        "end": 4956.22
    },
    {
        "text": " asume que las demás también actúan de esa forma. Por supuesto que el mercado es más complejo",
        "start": 4956.22,
        "end": 4964.5
    },
    {
        "text": " que esto, por supuesto, pero el marco tiene que conocer que en cierta forma hay este comportamiento.",
        "start": 4964.5,
        "end": 4973.46
    },
    {
        "text": " Entonces veamos lo que se conoce como el modelo de CURNOT que es un modelo de un duopolio,",
        "start": 4975.14,
        "end": 4981.06
    },
    {
        "text": " o sea dos empresas, duopolio es como el mismo, como una empresa, un mercado dominado por dos",
        "start": 4981.06,
        "end": 4989.38
    },
    {
        "text": " empresas, por ejemplo ¿qué mercado se le ocurre? ¿Tienes que hacer un duopolio?",
        "start": 4989.38,
        "end": 4994.740000000001
    },
    {
        "text": " Claro, en el periodo refrescante, un claro ejemplo de un mercado duopolico, ¿no?",
        "start": 4998.26,
        "end": 5003.22
    },
    {
        "text": " Hay otras vidas refrescantes similares, por supuesto, pero está ni significante el peso relativo",
        "start": 5004.740000000001,
        "end": 5009.740000000001
    },
    {
        "text": " que tiene al nivel mundial que podemos hablar de que el mercado está dominado por estas",
        "start": 5009.74,
        "end": 5015.219999999999
    },
    {
        "text": " en todos grandes expresas multinacionales. En algunos países, domina Pepsi, no todos",
        "start": 5015.219999999999,
        "end": 5022.099999999999
    },
    {
        "text": " minas coca, pero en general, a nivel mundial, salvo asipciones son las dominantes completamente.",
        "start": 5022.099999999999,
        "end": 5029.7
    },
    {
        "text": " Bueno, el modelo de CURNOT es un duopolio, son empresas que competen entre sí, producen un",
        "start": 5029.7,
        "end": 5035.78
    },
    {
        "text": " pino homogéneo, conoce la CUP de manda del mercado, cada una debe decir cuántas son las",
        "start": 5035.78,
        "end": 5041.58
    },
    {
        "text": " producir, el precio de mercado va a depender de la producción de ambas y las empresas consideran",
        "start": 5041.58,
        "end": 5047.7
    },
    {
        "text": " fijo en nivel de producción de la otra, ya sí deciden producir, esto es lo supuesto del modelo,",
        "start": 5047.7,
        "end": 5054.0599999999995
    },
    {
        "text": " básicamente es lo que yo le estaba pensando recién, es decir, se conoce la demanda del mercado,",
        "start": 5055.0599999999995,
        "end": 5060.38
    },
    {
        "text": " se divide entre ambas empresas, en este caso, pero la toma de decisiones de una va a depender de",
        "start": 5060.38,
        "end": 5065.42
    },
    {
        "text": " lo que supone que va a ser la otra, eso es un poco el esquema. Entonces, el nivel de producción",
        "start": 5065.42,
        "end": 5073.18
    },
    {
        "text": " que va a maximizar la empresa uno va a depender de cuánto estima que va a producir la otra,",
        "start": 5073.18,
        "end": 5081.78
    },
    {
        "text": " la dos. Ambas deciden el mismo tiempo, la cantidad de mandada se repartan de ambas empresas,",
        "start": 5081.78,
        "end": 5091.74
    },
    {
        "text": " obviamente, si se da que ambas empresas son idénticas se van a dividir la mitad del mercado,",
        "start": 5091.74,
        "end": 5097.3
    },
    {
        "text": " entonces acá tenemos en definitiva estos pesados graficamente, entonces por ejemplo en este caso,",
        "start": 5103.78,
        "end": 5111.58
    },
    {
        "text": " si la empresa uno piensa que era empresa dos no va a producir nada, su Cuba de manda va a ser",
        "start": 5112.78,
        "end": 5118.7
    },
    {
        "text": " justamente la demanda del mercado y va a maximizar ahí en tantas unidades.",
        "start": 5118.7,
        "end": 5123.0199999999995
    },
    {
        "text": " Si la empresa uno piensa que era empresa dos va a producir 50 unidades, su Cuba de manda se va",
        "start": 5126.0199999999995,
        "end": 5131.54
    },
    {
        "text": " a desplazar el izquierda en esa cuantía y va a maximizar en la cuantía menor.",
        "start": 5131.54,
        "end": 5135.94
    },
    {
        "text": " Y así suecidamente, así suecivamente, en este caso para significar el costo marginal es 0,",
        "start": 5137.3,
        "end": 5143.9
    },
    {
        "text": " es costante digo, siempre se va a determinar la Cuba de ingreso imaginar y costo marginal va a",
        "start": 5143.9,
        "end": 5149.5
    },
    {
        "text": " determinar la maximización, conceptualmente lo importante acá es que la empresa va a decir bueno,",
        "start": 5149.5,
        "end": 5157.219999999999
    },
    {
        "text": " la otra produce tanto, todo ello, produjo en definitiva en función de lo que estima que va a",
        "start": 5157.219999999999,
        "end": 5162.179999999999
    },
    {
        "text": " producir la otra. Entonces, mirado de la empresa uno, si la empresa uno piensa que la dos no va",
        "start": 5162.179999999999,
        "end": 5170.7
    },
    {
        "text": " a producir nada, su Cuba de manda la de mercado, maximiza en 50 donde el costo marginal es igual",
        "start": 5170.7,
        "end": 5179.9
    },
    {
        "text": " en ingreso marginal que se supone constante para significar. Si la empresa uno estima que la",
        "start": 5179.9,
        "end": 5186.82
    },
    {
        "text": " empresa dos va a producir 50, como decía la gráfica, su Cuba de manda se va a desplazar en esa",
        "start": 5186.82,
        "end": 5192.62
    },
    {
        "text": " cuantía, maximiza en la de 25 ni idea. Si la empresa uno piensa que la dos va a producir 75,",
        "start": 5192.62,
        "end": 5201.22
    },
    {
        "text": " ocurre la mismo y la empresa va a producir 2050 y si la empresa uno dice que la empresa dos va a",
        "start": 5201.22,
        "end": 5209.38
    },
    {
        "text": " producir todo todo el mercado no produce nada.",
        "start": 5209.38,
        "end": 5211.62
    },
    {
        "text": " Entonces, en definitiva, en nivel de producción de la empresa uno es una función de creciente",
        "start": 5211.62,
        "end": 5221.94
    },
    {
        "text": " de lo que piensa que va a producir la otra y en definitiva lo que nos da es la función de",
        "start": 5221.94,
        "end": 5229.3
    },
    {
        "text": " reacción de la empresa uno y esto es en definitiva lo importante. En nivel de producción que",
        "start": 5229.3,
        "end": 5235.46
    },
    {
        "text": " va a maximizar beneficio en la empresa es una función de creciente de lo que esta empresa",
        "start": 5235.46,
        "end": 5240.5
    },
    {
        "text": " estima que va a producir la otra. Entonces, ahí se genera la Cuba de reacción que es una función",
        "start": 5240.5,
        "end": 5247.98
    },
    {
        "text": " que depende de la demanda del otro tanto en la empresa uno como en la empresa dos.",
        "start": 5247.98,
        "end": 5252.9
    },
    {
        "text": " Entonces, la Cuba de reacción de la empresa uno muestra cuánto va a producir en función de",
        "start": 5259.02,
        "end": 5264.66
    },
    {
        "text": " cuánto piensa que produce la dos. La dos pasa lo mismo y ahí se grafica y el punto de corte es",
        "start": 5264.66,
        "end": 5277.099999999999
    },
    {
        "text": " el equilibrio de curnos. Cualquier otro punto sería inestable. Entonces, el único punto que",
        "start": 5277.099999999999,
        "end": 5284.139999999999
    },
    {
        "text": " satisface este modelo es el equilibrio donde cada empresa supone correctamente cuánto va a producir",
        "start": 5284.139999999999,
        "end": 5292.0599999999995
    },
    {
        "text": " la otra y por lo tanto va a maximizar sus beneficios.",
        "start": 5292.06,
        "end": 5295.820000000001
    },
    {
        "text": " ¿Cuánto ofusica de la empresa? Bueno, la Cuba de reacción de cada empresa va a indicar",
        "start": 5300.06,
        "end": 5304.9400000000005
    },
    {
        "text": " este cuánto va a producir cada una de edad en función de lo que estima la otra. En el equilibrio",
        "start": 5304.9400000000005,
        "end": 5312.9400000000005
    },
    {
        "text": " cada empresa va a fijar su nivel de producción según su propia curva de reacción.",
        "start": 5312.9400000000005,
        "end": 5318.620000000001
    },
    {
        "text": " Entonces, el equilibrio de curnos es justamente el corte de estas dos curvas de reacción.",
        "start": 5318.62,
        "end": 5326.38
    },
    {
        "text": " Este equilibrio de curnos es el punto donde maximiza cada una de las empresas,",
        "start": 5335.18,
        "end": 5340.62
    },
    {
        "text": " dado de lo que produce la otra y ninguna empresa tiene incentivos para moverse de este punto.",
        "start": 5340.62,
        "end": 5348.18
    },
    {
        "text": " Cualquier otro punto que no es el equilibrio a la empresa a una, la beneficia más",
        "start": 5348.7,
        "end": 5353.78
    },
    {
        "text": " que la otra, por lo tanto no va a ser un punto estable. El único punto estable va a ser el punto",
        "start": 5353.78,
        "end": 5359.38
    },
    {
        "text": " de corte donde se establece de acuerdo a este modelo. Hasta acá hay los que vemos en el",
        "start": 5359.38,
        "end": 5365.78
    },
    {
        "text": " curso con este punto les comento simplemente que esto se deriva más en profundidad en la",
        "start": 5365.78,
        "end": 5375.78
    },
    {
        "text": " historia de juegos, en la estrategia, el equilibrio de NASH, es decir, hay una derivación de",
        "start": 5375.78,
        "end": 5385.5
    },
    {
        "text": " esto que tiene muchas aplicaciones en las competencias de las empresas, en lo que es la de",
        "start": 5385.5,
        "end": 5390.259999999999
    },
    {
        "text": " agramación de las estrategias de ventas o diagrama de conversación, incluso hay algunos",
        "start": 5390.259999999999,
        "end": 5395.74
    },
    {
        "text": " manuales también que decían que esto, las estrategias juegos, es importante para las",
        "start": 5395.74,
        "end": 5400.34
    },
    {
        "text": " estrategias de guerra también, se los comento, en definitiva, y cerramos con esto.",
        "start": 5400.34,
        "end": 5407.14
    },
    {
        "text": " ¿Por qué es importante esto de los acuerdos, si los eligopolios y la teoría de juegos y la",
        "start": 5407.14,
        "end": 5413.28
    },
    {
        "text": " estrategia? Supongamos que yo quiero poner un producto en el mercado y se me ocurre como a veces",
        "start": 5413.28,
        "end": 5421.22
    },
    {
        "text": " pasa, que bueno, voy a vender este producto y agarra unos tenis, sí, pero mira que si",
        "start": 5421.22,
        "end": 5426.78
    },
    {
        "text": " ponés este producto, el comerciante que está acá te va a bajar los precios y porque",
        "start": 5426.78,
        "end": 5433.0599999999995
    },
    {
        "text": " vende el mismo producto que vos y perdiste, no creas que vende es un producto y no pasa nada",
        "start": 5433.0599999999995,
        "end": 5438.179999999999
    },
    {
        "text": " y no tiene efectos. Bueno, eso se estudia todo a nivel de este tipo de teoría, como",
        "start": 5438.179999999999,
        "end": 5445.0599999999995
    },
    {
        "text": " mayor diseño, mayor profundidad, y tiene bastante aplicación en cuanto a los impactos",
        "start": 5445.0599999999995,
        "end": 5449.78
    },
    {
        "text": " que tiene. ¿Qué voy con esto? No es neutro a veces cuando uno escucha por ahí, yo",
        "start": 5449.78,
        "end": 5457.219999999999
    },
    {
        "text": " te parece que es poner este producto en la venta, sí, sí, perfecto, pero mira que tenés",
        "start": 5457.219999999999,
        "end": 5461.219999999999
    },
    {
        "text": " alrededor un montón de elementos que juegan y que juegan y pesa. Y a nivel de empresas",
        "start": 5461.219999999999,
        "end": 5469.36
    },
    {
        "text": " más grandes es más fuerte la reacción. Si yo mañana se me ocurre producir un producto",
        "start": 5469.36,
        "end": 5477.34
    },
    {
        "text": " y lo comercializa las grandes empresas, seguramente la reacción que va a haber de putrita",
        "start": 5477.34,
        "end": 5483.64
    },
    {
        "text": " comercial sea muy agresiva, muy fuerte y va a ser complicado para que yo pueda competir,",
        "start": 5483.64,
        "end": 5488.62
    },
    {
        "text": " no refiero por ese punto de vista. Nosotros no vamos a ver, bueno, para este curso terminamos",
        "start": 5488.62,
        "end": 5493.82
    },
    {
        "text": " con esto el modelo de CUMNOT. Bueno, nos vamos.",
        "start": 5493.82,
        "end": 5496.34
    }
]