[
    {
        "text": " Bueno, Boris Es, entonces la clase de hoy, yo les he escribido primero que nada, los objetivos",
        "start": 0.0,
        "end": 6.12
    },
    {
        "text": " de la clase de hoy, los enumere para, entonces, objetivos de hoy. La mayoría son objetivos",
        "start": 6.12,
        "end": 16.52
    },
    {
        "text": " chicos, cortos más bien de tiempo, capaz de alguno mediano, de un par de ellos mediano.",
        "start": 16.52,
        "end": 22.52
    },
    {
        "text": " Esta es la última lamentablemente. Después las del lunes y viernes son de consulta, o",
        "start": 22.52,
        "end": 27.7
    },
    {
        "text": " sea, este es consulta teórico, consulta de práctico. Alabra de... Lunes y viernes, ahora",
        "start": 27.7,
        "end": 34.42
    },
    {
        "text": " la obra de clase, ahora de práctico y ahora de... Bueno, entonces es objetivo. Uno, cerrar",
        "start": 34.42,
        "end": 45.019999999999996
    },
    {
        "text": " birco bandegraff, que no sé cómo, no nos dimos cuenta de un argumento trivial, que nos",
        "start": 45.019999999999996,
        "end": 52.2
    },
    {
        "text": " quedamos dudando de final, pero trivial, así que no nos dimos cuenta para cerrar el teóremán",
        "start": 52.2,
        "end": 56.7
    },
    {
        "text": " que quedó pendiente en la clase pasada. Dos, entonces, vamos a dar la definición de",
        "start": 56.7,
        "end": 64.98
    },
    {
        "text": " cono, propiamente invariante. Tres, vamos a mencionar un teóremán que... Teóremán intermedio,",
        "start": 64.98,
        "end": 75.86
    },
    {
        "text": " lo veía maracá, pero que no lo vamos a poder demostrar por falta de tiempo.",
        "start": 75.86,
        "end": 82.26
    },
    {
        "text": " Quatro, arrancamos, decína acá la sección tres, que bueno, acá tenemos que hablar de",
        "start": 82.26,
        "end": 92.74000000000001
    },
    {
        "text": " definiciones de poner así, de matriz no negativa, matriz positiva. Aunque muchas de",
        "start": 92.74000000000001,
        "end": 97.88000000000001
    },
    {
        "text": " ellas sabemos, matriz reducible, matriz irreducible, matriz de permutación, entonces acá",
        "start": 97.88000000000001,
        "end": 105.86000000000001
    },
    {
        "text": " voy a poner matrices con apellido, todo este es que le dije y además matriz de permutación",
        "start": 105.86,
        "end": 113.82
    },
    {
        "text": " también. Veamos algunos ejemplos también, después tenemos un lema intermedio, es que si",
        "start": 113.82,
        "end": 124.1
    },
    {
        "text": " la matriz irreducible y suene masa al aire menos uno, termina siendo positiva, en esa es",
        "start": 124.1,
        "end": 132.12
    },
    {
        "text": " la definición del espacio. Y después bueno, el teóremán de permutación.",
        "start": 132.12,
        "end": 140.92000000000002
    },
    {
        "text": " Ok, entonces las cosas que nos va a llevar un poquito de tiempo, son seis, un poquito,",
        "start": 140.92000000000002,
        "end": 147.96
    },
    {
        "text": " siete, un poco, jugar un poco con las matrices con apellido, acá el jugar, dar ejemplo,",
        "start": 147.96,
        "end": 156.08
    },
    {
        "text": " alguna pregunta nos va a llevar un poquito de tiempo y nada más. El resto es todo bastante",
        "start": 156.08,
        "end": 162.08
    },
    {
        "text": " sencillo, pero la suma no lleva toda la clase de origen. Bueno, entonces el objetivo uno",
        "start": 162.08,
        "end": 170.20000000000002
    },
    {
        "text": " es cerrar bircof bandera, yo no voy a poner todas las hipótesis de vuelta, pero que decía,",
        "start": 170.20000000000002,
        "end": 179.64000000000001
    },
    {
        "text": " repasemos oralmente, que decía el teóremán de bircof bandera. ¿Quién tiene gana de",
        "start": 179.64000000000001,
        "end": 185.60000000000002
    },
    {
        "text": " contarles al resto del equipo que decía el teóremán de bircos bandera? A la gente",
        "start": 185.6,
        "end": 195.68
    },
    {
        "text": " open-fing que está atrás de pantalla, que le decimos que decía el teóremán de bircos bandera",
        "start": 195.68,
        "end": 200.24
    },
    {
        "text": " que dice Martin.",
        "start": 200.24,
        "end": 203.4
    },
    {
        "text": " y el 1 es 10.",
        "start": 230.24,
        "end": 236.24
    },
    {
        "text": " Ahí, esto me falta una hipote y sé, cada con el propio sólido,",
        "start": 236.24,
        "end": 242.24
    },
    {
        "text": " variante por A, es una matriz cuadrada de repuerre,",
        "start": 242.24,
        "end": 249.24
    },
    {
        "text": " la nula y las t se serán.",
        "start": 249.24,
        "end": 255.24
    },
    {
        "text": " Si see,",
        "start": 255.24,
        "end": 275.24
    },
    {
        "text": " la tercera Winlab nos Paul dee a que fija con elίας",
        "start": 275.24,
        "end": 283.24
    },
    {
        "text": " Perfecto. Toda esta cosa le habíamos demostrado, digamos, pero nos faltaba el CR. ¿Por qué",
        "start": 283.24,
        "end": 298.94
    },
    {
        "text": " pasó? En el medio de la demostración, nosotros quedó pendiente, quedó pendiente probar",
        "start": 298.94,
        "end": 306.48
    },
    {
        "text": " que la notación del texto, la notación de la demostración, estos eran algunos factores",
        "start": 306.48,
        "end": 315.20000000000005
    },
    {
        "text": " propios, ni siquiera todos, siendo que esto, todos estos era completito de uno hasta",
        "start": 315.20000000000005,
        "end": 324.96000000000004
    },
    {
        "text": " en el la base de Jordan. Estos de aquí son algunos de la base de Jordan, ¿sacurran? ¿Cuáles",
        "start": 324.96000000000004,
        "end": 333.52000000000004
    },
    {
        "text": " es alguno de los factores propios? Ni siquiera todos, esto estaba incluido acá. Algunos de",
        "start": 333.52,
        "end": 340.32
    },
    {
        "text": " los factores propios por supuesto, asociados a los valores propios, la andate, etcétera,",
        "start": 340.32,
        "end": 350.29999999999995
    },
    {
        "text": " etcétera. Y había quedado para la clase pasada de mostrar en el medio de la demostración",
        "start": 350.29999999999995,
        "end": 359.24
    },
    {
        "text": " que es pendiente esto, que usando estos factores propios existían coeficientes que creo que",
        "start": 359.24,
        "end": 366.36
    },
    {
        "text": " lo llamábamos de uno de T complejos, tal que de uno por Epsilon M1 más de T por Epsilon",
        "start": 366.36,
        "end": 376.0
    },
    {
        "text": " Mt pertenecía que con estos factores yo podía encontrar un elemento del con. ¿Sacurran?",
        "start": 376.0,
        "end": 385.8
    },
    {
        "text": " Y hicimos toda la cuenta, y tomamos un límite al fina. En realidad hicimos un límite y no",
        "start": 386.04,
        "end": 393.48
    },
    {
        "text": " lo tomamos, ese fue el problema, porque dijimos bueno acá, eliminarles estos y en algún momento",
        "start": 393.48,
        "end": 401.64
    },
    {
        "text": " manejamos la posibilidad de que el punto fuera interior, entonces nos movimos poquitito y nos",
        "start": 401.64,
        "end": 407.16
    },
    {
        "text": " quedamos dentro del cono. No era ese, el argumento era más sencillo porque el cono acá, que es",
        "start": 407.16,
        "end": 415.68
    },
    {
        "text": " propi sólido para la definición de cono, la de cono en sí tiene tres puntos, tres propidades",
        "start": 415.68,
        "end": 424.8
    },
    {
        "text": " que debe cumplir para hacer un cono cerrado por la suma, cerrado por el producto de escalares",
        "start": 424.8,
        "end": 430.48
    },
    {
        "text": " negativos y además es cerrado. Y bueno esa fue la hipótesis que deberíamos",
        "start": 430.48,
        "end": 443.12
    },
    {
        "text": " saber usar, que caera cerrado, porque cuando nosotros voy a poner el final, nada más, con la",
        "start": 443.12,
        "end": 449.96
    },
    {
        "text": " notación que estábamos usando, nosotros estábamos tomando el límite, cuando R suca, tiende",
        "start": 449.96,
        "end": 457.92
    },
    {
        "text": " más infinito, Día a la R suca de Z dividido R a la M menos 1 por R, roba la R, sólo",
        "start": 457.92,
        "end": 473.56
    },
    {
        "text": " para, por ejemplo, Alessandro que no vino en la última clase, A es la matriz, R, bueno acá",
        "start": 473.56,
        "end": 486.92
    },
    {
        "text": " debe ir a poner el resucar también, R suca y el resucar, entonces R suca es esta que tiene",
        "start": 486.92,
        "end": 496.04
    },
    {
        "text": " más infinito, R, es el que menciono Martín, R, es simplemente R, R, D, y Z era el nosotros",
        "start": 496.04,
        "end": 514.36
    },
    {
        "text": " agramos un Z que estaba escrito en la base de Sordan, un Z que era interior, se acuerdan,",
        "start": 514.36,
        "end": 520.0
    },
    {
        "text": " acá, R, es su que lo pronto era un Z que era interior, bueno y tomamos este límite, analizamos",
        "start": 520.56,
        "end": 535.64
    },
    {
        "text": " en la matriz, hicimos un montón de cuentas y vimos que en casi todos los casos eso tendría",
        "start": 535.64,
        "end": 541.76
    },
    {
        "text": " a ser todos los coeficientes, de casi todas los bloques de Sordan, tendría a ser excepto cuando",
        "start": 541.76,
        "end": 550.96
    },
    {
        "text": " justamente el bloque era, era maximal y el valor propio, se acuerdan en el caso, valor propio,",
        "start": 550.96,
        "end": 560.12
    },
    {
        "text": " con modulo y guara R y además en el caso tenía que suceder que S, o sea, nos estábamos analizando",
        "start": 561.48,
        "end": 569.28
    },
    {
        "text": " en la forma, el bloque de Sordan ha sucedido en modo de tamaño S, el único que sobrevivían",
        "start": 569.28,
        "end": 577.8399999999999
    },
    {
        "text": " era cuando se cumplían estas dos cosas en mismo tiempo, se acuerdan y además en ese caso sólo",
        "start": 577.8399999999999,
        "end": 585.88
    },
    {
        "text": " sobrevivía, en este caso al tener mu, cero, si esto le hacemos a la R muela R, muela R,",
        "start": 585.88,
        "end": 600.88
    },
    {
        "text": " combinaciones de R tomado uno de muela R menos uno, todo esto va a cero cuando dividimos entre",
        "start": 600.88,
        "end": 614.6
    },
    {
        "text": " este factor de R y el único que sobrevivía era el de la esquina acá, se acuerdan y ese que",
        "start": 614.6,
        "end": 624.32
    },
    {
        "text": " sobrevivía de la esquina era que justamente a multiplicar por el vector, esta pregunta, como este",
        "start": 624.32,
        "end": 631.5600000000001
    },
    {
        "text": " vector está escrito en Epsilon 1, Epsilon N, porque esta es la base de Sordan, cuando vas",
        "start": 631.5600000000001,
        "end": 639.72
    },
    {
        "text": " multiplicando los únicos que sobrevivían eran justamente los verdesitos que aparecían cada",
        "start": 639.72,
        "end": 648.84
    },
    {
        "text": " tanto, acá todo lo demás iba a parar a cero que se correspondían justamente, este multiplicaba",
        "start": 648.84,
        "end": 655.72
    },
    {
        "text": " este, después si viene otra, si justo hay otro bloque de Sordan de el mismo tamaño, M por M,",
        "start": 655.72,
        "end": 664.4
    },
    {
        "text": " entonces todo va a parar a cero, ese to, este y que multiplica acá y así para cada todo",
        "start": 664.92,
        "end": 675.84
    },
    {
        "text": " de los casos que se repita esta condición, y esto son exactamente estos de acá, Epsilon",
        "start": 675.84,
        "end": 685.9599999999999
    },
    {
        "text": " M1, Epsilon M2, la blablabla, Epsilon Mt, ok y qué fue lo que faltó? Que cuando tomábamos el",
        "start": 685.96,
        "end": 696.0400000000001
    },
    {
        "text": " límite, veíamos que todos nos tomamos el límite, dijimos lo que es que tomás el límite,",
        "start": 696.0400000000001,
        "end": 700.2800000000001
    },
    {
        "text": " de hacíamos analizábamos, veíamos que nos acercábamos y nos faltaba argumentar por qué el final",
        "start": 700.2800000000001,
        "end": 706.2
    },
    {
        "text": " que es este objeto que sobrevivía, digamos porque todo lo es más va parando a cero en el límite,",
        "start": 706.2,
        "end": 711.24
    },
    {
        "text": " porque estaba en C, y simplemente yo voy a escribir nada más, es porque es cerrado,",
        "start": 711.8,
        "end": 717.0
    },
    {
        "text": " chiquilines, ese tempo, entonces que nosamos, todos los elementos son acá, porque porque",
        "start": 717.0,
        "end": 723.0
    },
    {
        "text": " C está en C, los que tenemos junto acá, A, Tilo, L, A, D, C, A, Tilo, L, hasta que A, Tilo,",
        "start": 723.0,
        "end": 734.2
    },
    {
        "text": " lleva a la R, D, C, que está en C, porque C es invariante por A, y estos son números",
        "start": 734.2,
        "end": 742.0400000000001
    },
    {
        "text": " positivos, unicé, entonces todo esto está en C, todos los objetos están en C, entonces el límite",
        "start": 742.0400000000001,
        "end": 747.8000000000001
    },
    {
        "text": " como C es cerrado, como C es cerrado, este límite pertenece acá, y ese límite es justamente",
        "start": 747.8000000000001,
        "end": 761.9200000000001
    },
    {
        "text": " sobreviven los elementos que queríamos, o sea la combinación es de esta forma, lo pongo acá,",
        "start": 761.92,
        "end": 768.0799999999999
    },
    {
        "text": " ya está escrito pero lo remar con verde, el final es un objeto de esta manera,",
        "start": 768.0799999999999,
        "end": 773.76
    },
    {
        "text": " nos olvidamos usar que era cerrado y por lo tanto límite de una sucesión de cosas que",
        "start": 777.1999999999999,
        "end": 783.0
    },
    {
        "text": " estaban en cáltar, por último nada más, este, yo voy a analizar un poquito pero solo esto",
        "start": 783.0,
        "end": 795.04
    },
    {
        "text": " ya está escrito, lo escribo poco más como el repaso para el límite, cuando recáctenas más",
        "start": 795.04,
        "end": 802.92
    },
    {
        "text": " infinito, y por qué dice recáctenas y no dice R, quien se acuerda, por qué tuvimos que encontrar",
        "start": 802.92,
        "end": 810.24
    },
    {
        "text": " una subsuscesión, a ver quién me lo puede llegar a decir,",
        "start": 810.24,
        "end": 813.0
    },
    {
        "text": " porque es cuando el recáctenas más infinito, cuando el recáctenas más infinito,",
        "start": 827.0,
        "end": 830.5600000000001
    },
    {
        "text": " ¿no verdad? Era una subsuscesión, no podíamos tomar la subsuscesión R, de las potencias y no era una subsuscesión,",
        "start": 830.56,
        "end": 837.56
    },
    {
        "text": " que no es más que suficiente ¿no?",
        "start": 840.16,
        "end": 843.4399999999999
    },
    {
        "text": " ¿Qué pasaba? Te quedaba un, ese consciente que era un complejo de normal uno, que empezaba a girar,",
        "start": 843.44,
        "end": 862.44
    },
    {
        "text": " que empezaba a girar como el loco y límite no hay, a no ser que tomar nada más una subsuscesión",
        "start": 862.44,
        "end": 868.96
    },
    {
        "text": " que convergiese, quien sabíamos que existe porque el conjunto la espera es compacto.",
        "start": 868.96,
        "end": 874.0
    },
    {
        "text": " Bueno, se r había costado para los conceptos que me han manejado ustedes pero es lo mismo.",
        "start": 874.0,
        "end": 880.4000000000001
    },
    {
        "text": " Bueno, esto estaba así, esto lo hicimos pero lo estoy aclarando de vuelta ¿no? Esto es la sumatoria.",
        "start": 880.4000000000001,
        "end": 887.4000000000001
    },
    {
        "text": " Y acá abajo ese subache de poner así.",
        "start": 899.6800000000001,
        "end": 902.9200000000001
    },
    {
        "text": " No me quedó tan lindo porque en realidad no está mal, está correcto matemáticamente pero didácticamente no es lo que pretendía.",
        "start": 918.76,
        "end": 927.4000000000001
    },
    {
        "text": " Dígate prácticamente ese este el momento que quería visualizarlo ese este.",
        "start": 928.4,
        "end": 934.4
    },
    {
        "text": " Acá.",
        "start": 940.4,
        "end": 941.4
    },
    {
        "text": " Y a más como es una notación que no es el todo, no voy a escribir.",
        "start": 950.4,
        "end": 956.4
    },
    {
        "text": " El libro acá, Urice, loscribe si quieren veanlo, bueno nos vemos.",
        "start": 957.4,
        "end": 961.4
    },
    {
        "text": " Si quieren, Urice acá veanlo con el libro, acá es de desarrollo a todo este término.",
        "start": 961.4,
        "end": 965.4
    },
    {
        "text": " Nosotros lo que hicimos es me desarrollar todo este término, yo eso es el esquive porque era muy pesado.",
        "start": 965.4,
        "end": 970.4
    },
    {
        "text": " Simplemente hicimos el análisis con el producto de la matriz de Jordán este clip.",
        "start": 970.4,
        "end": 977.4
    },
    {
        "text": " Quedan analizamos juntos ¿no?",
        "start": 980.4,
        "end": 982.4
    },
    {
        "text": " Entonces, igual ahí no está del todo explícito, yo quería ponerle explícito pero no está de todo explícito porque en realidad acá sale la potencia, ¿no?",
        "start": 987.4,
        "end": 1002.4
    },
    {
        "text": " La potencia la anda su hacha ahí, al arriesucar, perdón.",
        "start": 1003.4,
        "end": 1007.4
    },
    {
        "text": " Sale la potencia la anda su...",
        "start": 1007.4,
        "end": 1009.4
    },
    {
        "text": " Y en realidad sale la potencia a esa en lo que son de esta forma, en los rojos acá, en lo que son victores propios.",
        "start": 1015.4,
        "end": 1022.4
    },
    {
        "text": " En los otros sale todo un, sale mucho más porque los otros no son victores propios.",
        "start": 1022.4,
        "end": 1027.4
    },
    {
        "text": " Entonces, cuando desarrollas eso queda mucho más grande en el libro está explícito, ¿no?",
        "start": 1028.4,
        "end": 1032.4
    },
    {
        "text": " En el libro está explícito. Nosotros hicimos el análisis directamente en la matriz.",
        "start": 1032.4,
        "end": 1036.4
    },
    {
        "text": " Y en definitiva, ahora sí me sauteo porque acá en el medio aparece toda la análisis que hicimos juntos.",
        "start": 1036.4,
        "end": 1043.4
    },
    {
        "text": " De este igual, la estiguela aparece toda la análisis.",
        "start": 1043.4,
        "end": 1046.4
    },
    {
        "text": " Entonces, de repente lo que decimos es en este límite, bueno si quieren poder sacar su maturía para afuera todavía.",
        "start": 1046.4,
        "end": 1053.4
    },
    {
        "text": " Vamos a sacar la supotaria para afuera para que vean que eso no es el problema.",
        "start": 1053.4,
        "end": 1058.4
    },
    {
        "text": " Y ese su hr a la m, se me fue un menos 1 en el momento, no acaban menos, acá hay menos 1, creo que yo me he atapado.",
        "start": 1062.4,
        "end": 1071.4
    },
    {
        "text": " A la r su caa, ¿no?",
        "start": 1075.4,
        "end": 1079.4
    },
    {
        "text": " Y en este, acá es el momento que hicimos el análisis en la matriz y vemos que en el comportamiento de r, r, k por su bache,",
        "start": 1080.4,
        "end": 1089.4
    },
    {
        "text": " todos los coeficientes terminan en el límite, terminan dando 0 excepto los verdes que multiplican a estas coordenadas del vector z, esta z.",
        "start": 1089.4,
        "end": 1102.4
    },
    {
        "text": " El resto de las coordenadas terminan dando un límite 0 y por lo tanto se van.",
        "start": 1103.4,
        "end": 1108.4
    },
    {
        "text": " Acá el libro te explica cuánto dato de este chorizo nosotros le hicimos acá.",
        "start": 1108.4,
        "end": 1114.4
    },
    {
        "text": " Y entonces, bueno, finalmente solamente sobrevive, en vez de 1 hasta n, sobrevive desde 1 hasta t, desde j igual 1 hasta t,",
        "start": 1114.4,
        "end": 1128.4
    },
    {
        "text": " se me jota por r, j, m, j.",
        "start": 1129.4,
        "end": 1135.4
    },
    {
        "text": " Y este ha hecho j que no explicito quién es, simplemente el resultado de hacer tu hasta cuenta, tomar el límite,",
        "start": 1141.4,
        "end": 1150.4
    },
    {
        "text": " este es, incluso hay el valor propio, el cosiente, ahí está todo.",
        "start": 1151.4,
        "end": 1157.4
    },
    {
        "text": " Y no me acuerdo, creo que les llamamos a j, nosotros, pero no me acuerdo cómo les llamamos, les llamamos a j, techo o cómo les llamamos,",
        "start": 1162.4,
        "end": 1169.4
    },
    {
        "text": " el punto del límite que existe, es el que, a partir de cual dijimos, ha sido una surcesión que hace que converge",
        "start": 1169.4,
        "end": 1179.4
    },
    {
        "text": " y ahí el límite lo vamos a dar para no más acuerdo, como les llamamos.",
        "start": 1179.4,
        "end": 1184.4
    },
    {
        "text": " En algún momento tú se esté, es su bache, pero es el que se nos bache, pero ahí piensa su maturía de hache con qué finito.",
        "start": 1184.4,
        "end": 1194.4
    },
    {
        "text": " Tema que lo digo abajo.",
        "start": 1194.4,
        "end": 1198.4
    },
    {
        "text": " Acá finita de ha hecho igual 1 hasta n.",
        "start": 1198.4,
        "end": 1201.4
    },
    {
        "text": " Sí, sí, sí.",
        "start": 1201.4,
        "end": 1202.4
    },
    {
        "text": " Antes la suma de la tonilla es el resultado, entonces creo que por lo más, si lo se,",
        "start": 1202.4,
        "end": 1208.4
    },
    {
        "text": " acá,",
        "start": 1208.4,
        "end": 1211.4
    },
    {
        "text": " yo no sé si es, yo no sé si es, yo sí lo se va a hacer, yo no ha hecho el asumandó.",
        "start": 1211.4,
        "end": 1214.4
    },
    {
        "text": " Acá, este es el auro.",
        "start": 1214.4,
        "end": 1218.4
    },
    {
        "text": " Sí, este es el mismo.",
        "start": 1218.4,
        "end": 1220.4
    },
    {
        "text": " Sí, sí, sí.",
        "start": 1220.4,
        "end": 1221.4
    },
    {
        "text": " Sí, porque el asumé finita es como que voitamos el límite de una suma finita, el límite pasa para adentro, de cada sumando.",
        "start": 1221.4,
        "end": 1231.4
    },
    {
        "text": " Está, creo que antes se son los hotéis en los subens, ¿verdad?",
        "start": 1232.4,
        "end": 1236.4
    },
    {
        "text": " Sí, pero lo que pasa es que cuáles la diferencia de notación.",
        "start": 1236.4,
        "end": 1240.4
    },
    {
        "text": " Cuando yo poco epsilon su hache desde hache igual 1 hasta n, estoy usando todo el de la base de su orden.",
        "start": 1240.4,
        "end": 1246.4
    },
    {
        "text": " Y cuando pongo epsilon sub m, es porque ya me quede solo con los verdes.",
        "start": 1246.4,
        "end": 1251.4
    },
    {
        "text": " Esto es de acá.",
        "start": 1251.4,
        "end": 1254.4
    },
    {
        "text": " Y por qué me quede con suelo con los verdes? ¿Qué vinc?",
        "start": 1254.4,
        "end": 1256.4
    },
    {
        "text": " Porque en los otros los coeficientes que van a multiplicar a todos los demás niveles donde aparecen los otros,",
        "start": 1257.4,
        "end": 1265.4
    },
    {
        "text": " las otras coordenadas de los otros vector base, digamos, todos estos van a cero, entonces no es los multiplicados.",
        "start": 1265.4,
        "end": 1273.4
    },
    {
        "text": " Bueno, creo que les llamamos a su jote, te he hecho este de acá, en el clase.",
        "start": 1273.4,
        "end": 1279.4
    },
    {
        "text": " Y esto es definitiva, el concepto de que estaban castas directamente en el comienzo.",
        "start": 1279.4,
        "end": 1285.4
    },
    {
        "text": " Como es un límite de cosas que están en caas y que hay cerrado, esto está en caas.",
        "start": 1285.4,
        "end": 1290.4
    },
    {
        "text": " Y estos coeficientes son los de su jote que precisamos acá.",
        "start": 1290.4,
        "end": 1297.4
    },
    {
        "text": " Ok, ese es el cierre.",
        "start": 1297.4,
        "end": 1307.4
    },
    {
        "text": " Sólo que nos habíamos olvidado usar y que caer a ese rado, pido disculpa, lamentablemente, me...",
        "start": 1307.4,
        "end": 1314.4
    },
    {
        "text": " Porque cada vez que te queda un pendiente, en vez de hacerlo en 2 minutos, que era lo que hubiera llevado, llevó 10, 12, 15 minutos, volver a explicar todo.",
        "start": 1314.4,
        "end": 1321.4
    },
    {
        "text": " Sepiaró mucho tiempo.",
        "start": 1321.4,
        "end": 1324.4
    },
    {
        "text": " Bueno, si no quedo dudas, chicos, este es el cierre.",
        "start": 1325.4,
        "end": 1329.4
    },
    {
        "text": " Y vamos a estas puntos que son mas ágiles, con lo propio invariante, el teoría intermedio.",
        "start": 1329.4,
        "end": 1338.4
    },
    {
        "text": " Hay algunas definiciones que necesitamos.",
        "start": 1341.4,
        "end": 1344.4
    },
    {
        "text": " Hay una cosa que no dije explícitamente.",
        "start": 1345.4,
        "end": 1350.4
    },
    {
        "text": " Seguro cuando lo estudien, mas de uno usted va a decir, acá el profe no se está haciendo una trampita.",
        "start": 1350.4,
        "end": 1355.4
    },
    {
        "text": " No es trampita. Cuando la encuentren, créanme nuestra ampita, al esano.",
        "start": 1355.4,
        "end": 1360.4
    },
    {
        "text": " Ah ok, este... Si alguna la encuentra, yo se la explico a todos, pero no es trampita.",
        "start": 1360.4,
        "end": 1367.4
    },
    {
        "text": " Simplemente no quiero perder más tiempo.",
        "start": 1367.4,
        "end": 1370.4
    },
    {
        "text": " Bueno, bien, nos vamos al...",
        "start": 1373.4,
        "end": 1376.4
    },
    {
        "text": " Nos vamos al punto 2, con lo propio invariante.",
        "start": 1380.4,
        "end": 1384.4
    },
    {
        "text": " Esto lo adelantamos en la clase pasada, entonces punto 2, definición, con lo propiamente invariante.",
        "start": 1384.4,
        "end": 1397.4
    },
    {
        "text": " Bueno, entonces la situación es la misma de siempre, tienes un cono adentro de B que se reala N",
        "start": 1400.4,
        "end": 1409.4
    },
    {
        "text": " y tienes una matriz A cuadrada del coeficiente real.",
        "start": 1409.4,
        "end": 1414.4
    },
    {
        "text": " Y un cono propiamente invariante, decíamos, es un cono, es propiamente invariante.",
        "start": 1414.4,
        "end": 1421.4
    },
    {
        "text": " Y pongo lo que está en el libro que está mal y lo corregimos, ahora no más.",
        "start": 1421.4,
        "end": 1427.4
    },
    {
        "text": " Lo pongo así con espacio.",
        "start": 1427.4,
        "end": 1429.4
    },
    {
        "text": " Es cuando existe un M, acá hay un M, existe un M, mayor que uno, mayor igual que uno,",
        "start": 1430.4,
        "end": 1441.4
    },
    {
        "text": " tal que a la MDK está incluido en casera.",
        "start": 1441.4,
        "end": 1446.4
    },
    {
        "text": " Y el único de estas necesitas que recuerden, lo dijimos ya que la se pasada, hay que quitarle, hay que sacarle el vector nulo al cono",
        "start": 1446.4,
        "end": 1454.4
    },
    {
        "text": " porque ese evidente que el vector nulo siempre va al vector nulo y el vector nulo nunca está en el interior.",
        "start": 1454.4,
        "end": 1459.4
    },
    {
        "text": " Entonces nunca tendríamos un cono propio invariante.",
        "start": 1459.4,
        "end": 1463.4
    },
    {
        "text": " Entonces, a la definición del cono propio invariante, es un poco más exigente, claro, que la decono invariante.",
        "start": 1468.4,
        "end": 1479.4
    },
    {
        "text": " ¿A ver si es el nulo? ¿A la interior?",
        "start": 1485.4,
        "end": 1488.4
    },
    {
        "text": " Ah, sí, sí, lo que pasa es que si vos tomás, si la definición, quiero decir, puede suceder, puede suceder, pero el problema es este, en general la imagen de cono que tenemos es esta, ¿ok?",
        "start": 1490.4,
        "end": 1512.4
    },
    {
        "text": " Y entonces, por ejemplo, vos querés que el cono, digamos, que tenga sentido esta definición, o sea que en algún momento esto lo lleve, digamos, al interior del propio K,",
        "start": 1513.4,
        "end": 1533.4
    },
    {
        "text": " no tiene por ser a la 1, puede ser a la 2, a la 3 o a la 4, en algún momento que pasa que el vector nulo siempre se queda acá y el vector nulo nunca está en el interior.",
        "start": 1534.4,
        "end": 1546.4
    },
    {
        "text": " Entonces, nunca tendríamos nunca, o sea, que no cogeríamos nunca, este ejemplo de cono propio invariante, digamos, de los prototípicos.",
        "start": 1546.4,
        "end": 1555.4
    },
    {
        "text": " ¿Qué quiere decir, a propio?",
        "start": 1556.4,
        "end": 1563.4
    },
    {
        "text": " Ah, que K es propio, sí, sí, sí, el modelo prototípico de cono es verdad, son cono propios, estoy acuerdos contigo, es que el modelo que uno piensa siempre es el propio, estoy acuerdos.",
        "start": 1569.4,
        "end": 1581.4
    },
    {
        "text": " Y no tiene por qué solo eso, estoy acuerdos. Vamos a colocar el teoremo intermedio, este que lamentablemente no dio el tiempo de darlo.",
        "start": 1582.4,
        "end": 1593.4
    },
    {
        "text": " ¿Puedes para el pelo matrizado para dar como lo que está?",
        "start": 1593.4,
        "end": 1596.4
    },
    {
        "text": " No, voy a una pregunta, gracias, es cono propieto invariante para esa matriz, es el cono propieto invariante para esa matriz, gracias por la pregunta.",
        "start": 1596.4,
        "end": 1611.4
    },
    {
        "text": " Igual que antes era que el cono era invariante, nada más, pero para esa matriz, sí, como, hay tanta definición, uno tiene que tener cuidado.",
        "start": 1612.4,
        "end": 1626.4
    },
    {
        "text": " Bueno, entonces vamos al teoremo a este intermedio que nos queda pendiente y no lo vamos a poder demostrar, dice así este teoremo.",
        "start": 1626.4,
        "end": 1633.4
    },
    {
        "text": " Entonces, este es de punto 2, punto 3, están la sección 2 todavía, este teoremo, y si así se acá, cono, propio, sólido y propiamente invariante.",
        "start": 1633.4,
        "end": 1661.4
    },
    {
        "text": " Todas las, ¿no?",
        "start": 1662.4,
        "end": 1671.4
    },
    {
        "text": " Probablemente variante para la matriz, siempre hay una matriz aquí. ¿Cómo?",
        "start": 1672.4,
        "end": 1681.4
    },
    {
        "text": " O sea, si siempre existe una para el cono. O sea, dado un cono, si vos puedes encontrar una matriz de tal manera que sea propiamente invariante para a.",
        "start": 1681.4,
        "end": 1693.4
    },
    {
        "text": " Yo creo que sí, es una buena pregunta para meter en el práctico, en el práctico 9. ¿Cómo para?",
        "start": 1693.4,
        "end": 1707.4
    },
    {
        "text": " Si es propiamente invariante, sólido y sí, tiene que tener interior.",
        "start": 1708.4,
        "end": 1715.4
    },
    {
        "text": " No te entendís, la pregunta de ¿qué he venido a un cono?",
        "start": 1725.4,
        "end": 1731.4
    },
    {
        "text": " Necesariamente existe una matriz de tal manera que sea propiamente invariante para esa matriz.",
        "start": 1732.4,
        "end": 1737.4
    },
    {
        "text": " ¿Quieres verlo a la que los montadores de la frontera hay un conjunto de efectos que pasan más de la frontera?",
        "start": 1737.4,
        "end": 1743.4
    },
    {
        "text": " No tienen por qué ser de la frontera, de hecho en la demostración eran todos los interiores.",
        "start": 1743.4,
        "end": 1748.4
    },
    {
        "text": " ¿Tienes que ser solida porque si no esto vacío?",
        "start": 1748.4,
        "end": 1759.4
    },
    {
        "text": " No tenemos ningún punto interior, ¿sierto?",
        "start": 1760.4,
        "end": 1764.4
    },
    {
        "text": " Bueno, muy bien, entonces, muy bueno, esas cosas ayudan ahí de asimilando los conceptos.",
        "start": 1764.4,
        "end": 1769.4
    },
    {
        "text": " Y en esta situación, que si se fijan lo que agregamos es este hipote, sino su rasión rojo la hipote y si esta respecto del teorema anterior, fíjense todas las cosas que se ganan.",
        "start": 1769.4,
        "end": 1785.4
    },
    {
        "text": " Primero, igual que hoy, rodea es valor propio.",
        "start": 1785.4,
        "end": 1792.4
    },
    {
        "text": " Para, pero se agrega esto, valor propio simple.",
        "start": 1792.4,
        "end": 1804.4
    },
    {
        "text": " Sí. A ver, Uricedes, una de las cosas que se gana, me faltan puntos en la T, sin verdad.",
        "start": 1804.4,
        "end": 1824.4
    },
    {
        "text": " Pero es que rodeas valor propio lo sabemos del teorema anterior.",
        "start": 1824.4,
        "end": 1828.4
    },
    {
        "text": " Que es simple, es que la multiplicidad es uno, la multiplicidad que abre es casuno.",
        "start": 1828.4,
        "end": 1839.4
    },
    {
        "text": " Bueno, pero además se sigue ganando más cosas.",
        "start": 1839.4,
        "end": 1849.4
    },
    {
        "text": " Le pongo como doy yo, pero para todo el anda perteneciente al espectro de A que no sea rodea, el módulo de anda es menor que rodea.",
        "start": 1849.4,
        "end": 1868.4
    },
    {
        "text": " Esto es muy fuerte, no? No solamente que es simple, sino que además que cualquier otro valor propio tiene módulo menor.",
        "start": 1869.4,
        "end": 1883.4
    },
    {
        "text": " No, no, porque podría haber otros que tuvieran el módulo, aunque no fuera igual a rodea.",
        "start": 1883.4,
        "end": 1890.4
    },
    {
        "text": " Sí, pero sí, pero es la multiplicidad de Uricedes.",
        "start": 1890.4,
        "end": 1893.4
    },
    {
        "text": " Sí. Pero puede ser otro. Claro, puede ser un estilo o menos sí.",
        "start": 1893.4,
        "end": 1899.4
    },
    {
        "text": " Claro, puede ser rodea por 90 grados, o sea, y por rodea.",
        "start": 1899.4,
        "end": 1905.4
    },
    {
        "text": " ¿No hay más que el módulo que se podría haber sido rodeado?",
        "start": 1905.4,
        "end": 1908.4
    },
    {
        "text": " No, lo que tenía que ser más grande era el tamaño de bloque de SORDA.",
        "start": 1908.4,
        "end": 1922.4
    },
    {
        "text": " Incluso los M1, Mt tenía en principio el T podía ser más actual igual que 2.",
        "start": 1923.4,
        "end": 1931.4
    },
    {
        "text": " No, más actual igual, más actual igual, podía haber varios exactamente.",
        "start": 1931.4,
        "end": 1936.4
    },
    {
        "text": " Ahora es mucho más fuerte, ¿no? Es el único que tiene ese valor propio y además el único que tiene ese módulo.",
        "start": 1936.4,
        "end": 1943.4
    },
    {
        "text": " Este es el teorema de Google, este es el que dice Google. Para ese lado hay que apuntar, te dice, ¿no?",
        "start": 1943.4,
        "end": 1949.4
    },
    {
        "text": " Después, claro, viene toda la parte comercial y te pone el abuscador, te pone el que más paga arriba, pero en principio este es el teorema.",
        "start": 1950.4,
        "end": 1958.4
    },
    {
        "text": " Y tercero, existe un vector propio de A, ¿no?",
        "start": 1960.4,
        "end": 1968.4
    },
    {
        "text": " Hasta acá nada nuevo, ¿no? Por supuesto. Hasta acá tampoco, pero no lo termine.",
        "start": 1969.4,
        "end": 1984.4
    },
    {
        "text": " Entonces voy a marcar en rojo la nuevo, todo 2 es nuevo, ¿no? Simple es nuevo, todo es nuevo.",
        "start": 1984.4,
        "end": 1991.4
    },
    {
        "text": " Y en 3, hasta acá no hay nada nuevo, ¿por qué esto lo vimos? Esto es lo nuevo, ¿urice?",
        "start": 1991.4,
        "end": 1996.4
    },
    {
        "text": " Que en realidad ese vector es interior. ¿Tá? Ahí está destacado, con la hipótesis propiamente invariante, ¿qué fue lo que se ganó?",
        "start": 1998.4,
        "end": 2007.4
    },
    {
        "text": " El teorema, lo hubiéramos hecho en media clase, pero bueno, no tenemos tiempo.",
        "start": 2009.4,
        "end": 2014.4
    },
    {
        "text": " Y tiene más temática que podemos entender. ¿OK? ¿Se entendió?",
        "start": 2016.4,
        "end": 2022.4
    },
    {
        "text": " Y el perro en Provenius en definitiva se va a pasar en el que hicimos juntos y en esta, un poco en esta versión también.",
        "start": 2023.4,
        "end": 2034.4
    },
    {
        "text": " Bien, sección 3 definiciones, entonces nomamos el punto 4 de lo programado, sección 3 definiciones.",
        "start": 2042.4,
        "end": 2049.4
    },
    {
        "text": " Pero las primeras definiciones, gurices, son muy sencillas. Matriz, por ejemplo, matriz non negativa. ¿Qué es una matriz non negativa? ¿Ya lo sabemos, ¿no?",
        "start": 2050.4,
        "end": 2065.4
    },
    {
        "text": " ¿Está en la maquilidad de cuantas? Sí, sección 3, o sea, nada nuevo.",
        "start": 2066.4,
        "end": 2072.4
    },
    {
        "text": " Incluso nosotros ya tenemos notación para eso, ¿no? A, mayor igual que 0, ya saben lo que quiere decir, ¿no? ¿Qué hace mi jota?",
        "start": 2073.4,
        "end": 2080.4
    },
    {
        "text": " Si es esta forma, entonces hace mi jota mayor igual que 0 para todo y para todo jota. Una matriz, por supuesto, cuadra...",
        "start": 2083.4,
        "end": 2093.4
    },
    {
        "text": " Y bueno, si tenemos la definición de matriz non negativa, la definición de matriz positiva, lo mismo, ¿no?",
        "start": 2094.4,
        "end": 2102.4
    },
    {
        "text": " Lo mismo, no voy a escribir todo, simplemente nosotros lo notamos a mayor que 0. Así que la primera de definiciones ya las tenemos.",
        "start": 2107.4,
        "end": 2114.4
    },
    {
        "text": " Tercero, dije que eran cuatro, cuatro, cinco conceptos, matriz reducible.",
        "start": 2115.4,
        "end": 2122.4
    },
    {
        "text": " Voy a definir lo que es matriz reducible.",
        "start": 2129.4,
        "end": 2132.4
    },
    {
        "text": " Bueno, y para eso voy a usar lo que es matriz de permutación, porque estoy seguro que lo vieron en galuno, pero después voy a definir lo que es matriz irreducible y después vamos a por lado, vamos a repasar el concepto de matriz de permutación y vamos a jugar un poco con el concepto de matriz de permutación para que si no lo saben o no lo recuerdan, no sea un impedimento, porque no me interesa que eso tiene menos.",
        "start": 2133.4,
        "end": 2158.4
    },
    {
        "text": " Matriz reducible, entonces, a, una matriz cuadrada, es reducible, si existe, p, una matriz de permutación, matriz de permutación,",
        "start": 2158.4,
        "end": 2179.4
    },
    {
        "text": " tal que, a, es, pero no, mejor queda más bonito así, lo mismo, pero queda más bonito si p, por A por P transpuesta, es igual a una matriz de la forma a 1, 1,",
        "start": 2179.4,
        "end": 2208.4
    },
    {
        "text": " 0 a 1, 2, a 2, 2, o sea, acá digamos que es S por S y acá por lo tanto N minus S por N minus S, y este es un 0 grandote, ¿no?",
        "start": 2208.4,
        "end": 2236.4
    },
    {
        "text": " Obvio que ese mayor igual que 1, o sea, o sea que vos en el fondo, este, poder reducirla a, a una matriz, me dejan hablar mal de forma medio que triangular, y si, si acuerdan de algún ejercicio de galuno, de gal 2, si vos tenes una matriz de esta manera, el determinante de A, o sea, determinante de, de esta matriz, como se calculaba.",
        "start": 2238.4,
        "end": 2267.4
    },
    {
        "text": " Que no es una diagonal en sí, pero lo producto de esos dos determinantes, se acuerdan de eso, seguro que lo vieron. Ahora, este, acá, y es como una partición en bloque, ¿no?",
        "start": 2269.4,
        "end": 2282.4
    },
    {
        "text": " Bueno, y cuando ese, eso es reducible, y la, el concepto 4, es trivial, A es irreducible, pero a, si no es reducible, muy sencillo, el concepto 4, ¿ok?",
        "start": 2283.4,
        "end": 2305.4
    },
    {
        "text": " ¿No es irreducible si no es reducible? Sí, en día. ¿Eso es el tema del tratamiento de la acertatura que usted ha dado con esta mania?",
        "start": 2306.4,
        "end": 2314.4
    },
    {
        "text": " No, es verdad, siempre, para ser determinante, esto termina probando que es el determinante de la S por S por el determinante de la N minus de la otra del 30 mania.",
        "start": 2314.4,
        "end": 2328.4
    },
    {
        "text": " Y si es irreducible, si no es reducible, muy bien. Ahora, ¿quién se acuerda que es una matriz de permuntación? ¿Lo vieron? Si, seguramente apareció en algún ejercicio. ¿Capas que apareció en discreta? ¿No en discreta uno?",
        "start": 2329.4,
        "end": 2344.4
    },
    {
        "text": " El concepto de permuntación tiene que ver con lo que vieron en discreta.",
        "start": 2344.4,
        "end": 2347.4
    },
    {
        "text": " ¿No es una matriz de empiezo en el día de la que se nació en discreta uno? Sí.",
        "start": 2348.4,
        "end": 2352.4
    },
    {
        "text": " ¿Es exactamente? Es una, es casi una matriz de entidad donde se movieron los unos.",
        "start": 2352.4,
        "end": 2359.4
    },
    {
        "text": " Eso es lo que quiere decir una, entonces vamos a poner el concepto 5 por la duda, recordar el concepto de matriz de permuntación.",
        "start": 2359.4,
        "end": 2368.4
    },
    {
        "text": " Además, chigrines, voy a borrar acá. Así trabajamos un poco, un poco de ese concepto.",
        "start": 2377.4,
        "end": 2385.4
    },
    {
        "text": " Entonces, matriz de permuntación.",
        "start": 2385.4,
        "end": 2389.4
    },
    {
        "text": " Como dijo Nico, es una matriz que casi es de entidad. Pero es así.",
        "start": 2395.4,
        "end": 2400.4
    },
    {
        "text": " Una permuntación, ya lo recordan de varios cursos, seguramente.",
        "start": 2401.4,
        "end": 2406.4
    },
    {
        "text": " Es una función bisectiva de uno N en uno N, ¿no?",
        "start": 2406.4,
        "end": 2412.4
    },
    {
        "text": " Bisectiva. Por ejemplo, la entidad es una permuntación.",
        "start": 2417.4,
        "end": 2422.4
    },
    {
        "text": " Entonces vimos que esto tiene estructura de grupo, bueno, mis millones de cosas, se volven a haber visto en discreta 2,",
        "start": 2422.4,
        "end": 2428.4
    },
    {
        "text": " en discreta 1 contaron cuantas preguntaciones, ahí en fin las preguntaciones aparecen por todo.",
        "start": 2429.4,
        "end": 2435.4
    },
    {
        "text": " Y entonces, en definitiva lo que vos estás diciendo es, es una función, por ejemplo, 5 de I te da para cada I, tienes 5 de I, ¿no?",
        "start": 2435.4,
        "end": 2445.4
    },
    {
        "text": " Bueno, y esto es una función bisectiva.",
        "start": 2447.4,
        "end": 2449.4
    },
    {
        "text": " La matriz de permuntación, una matriz de permuntación P, es justamente, si la matriz y identidad, ¿no?",
        "start": 2450.4,
        "end": 2458.4
    },
    {
        "text": " Las que vi, es como se llama lo C subijota con I j, donde vos sabes que C sub I y es 1 y C subijota es 0 y distinto de j, ¿no?",
        "start": 2458.4,
        "end": 2474.4
    },
    {
        "text": " Esta es la matriz y identidad. Entonces, la P es de la forma C sub I sigma de I.",
        "start": 2475.4,
        "end": 2483.4
    },
    {
        "text": " ¿Se entiende? Variando I.",
        "start": 2486.4,
        "end": 2488.4
    },
    {
        "text": " Pero, mejor dicho, C subI j, tal que C subI j vale 1, C j es igual a sigma de I y C subI j vale 0, C j es distinto de sigma de I.",
        "start": 2489.4,
        "end": 2508.4
    },
    {
        "text": " Como dijo Enico, es cambiar los unos de lugar, ¿sí?",
        "start": 2509.4,
        "end": 2514.4
    },
    {
        "text": " Sí, es una matriz estocástica que no aparece ningún coeficiente más que el 0 y 1, totalmente igual.",
        "start": 2523.4,
        "end": 2530.4
    },
    {
        "text": " Bueno, en definitiva es una matriz que le cambiaste de lugar. Por ejemplo, simplemente para trabajar juntos.",
        "start": 2531.4,
        "end": 2543.4
    },
    {
        "text": " Un poquitito. Si vos tenés la función 1, 2, 3, 1 va a parar al 3, 2 va a parar a 1 y 3 va a parar a 2.",
        "start": 2543.4,
        "end": 2554.4
    },
    {
        "text": " Tiene el disébil inyectiva, ¿no? Por lo tanto, no puedo repetir.",
        "start": 2555.4,
        "end": 2558.4
    },
    {
        "text": " O sea, sigma de I es 3, sigma de II es I, sigma de III es II.",
        "start": 2558.4,
        "end": 2566.4
    },
    {
        "text": " Entonces, la matriz de permutación es 0, 0, 1. Corrigan, por favor.",
        "start": 2566.4,
        "end": 2573.4
    },
    {
        "text": " 1, 0, 0, 0, 1, 0. ¿OK? Porque C subI j vale 1, C j, la segunda coordenada es la imagen de la primera.",
        "start": 2574.4,
        "end": 2590.4
    },
    {
        "text": " ¿Cierto? Ojo, esto es una posible definición, pueden ver.",
        "start": 2590.4,
        "end": 2596.4
    },
    {
        "text": " En definitiva, lo importe es el concepto, lo suelo lo definimos así, pero capaz que otro lo definió tomando la inversa del inyectivo.",
        "start": 2597.4,
        "end": 2604.4
    },
    {
        "text": " Yo que sé, en definitiva, no cambia mucho.",
        "start": 2604.4,
        "end": 2607.4
    },
    {
        "text": " Bueno, ¿y qué pasa si vos da una matriz a 1, 1 a 1, 2 a 1, 3 a 2, 1 a 2, 2 a 2, 2 a 2, 3 a 3, 1 a 3, 2 a 3, 3, 3, le aplica a P y peta a puerta.",
        "start": 2607.4,
        "end": 2625.4
    },
    {
        "text": " ¿Cuánto vale el peta a puerta? Bueno, el peta a puerta va a lecer, 0, 1, 1, 0, 0, 0, 1, 0.",
        "start": 2626.4,
        "end": 2636.4
    },
    {
        "text": " ¿A ver si está bien? ¿Le apare? ¿Le apare? ¿Le apare? ¿Le apare? ¿Le apare?",
        "start": 2636.4,
        "end": 2642.4
    },
    {
        "text": " Sí, P por peta a puerta siempre de la identidad. Eso es muy importante.",
        "start": 2642.4,
        "end": 2648.4
    },
    {
        "text": " Y P y P y P y P y P y P y P y P y P y P y P y P. Veamos lo por favor.",
        "start": 2649.4,
        "end": 2653.4
    },
    {
        "text": " 0, 0, 1 y después no maché nunca más.",
        "start": 2654.4,
        "end": 2658.4
    },
    {
        "text": " 1, 0, 0 y después no maché nunca más. Y justamente la identidad es porque es la respuesta, sino.",
        "start": 2658.4,
        "end": 2663.4
    },
    {
        "text": " Bueno, ¿y esto cuantodá? Bueno, esto no es la voy a hacer para no perder tiempo en clase, pero esto lo voy a poner.",
        "start": 2665.4,
        "end": 2670.4
    },
    {
        "text": " Lo voy a hacer para el práctico, no está ahora, lo voy a poner para no perder tiempo ahora.",
        "start": 2670.4,
        "end": 2676.4
    },
    {
        "text": " Te va a cambiar filas y columnas de lugar, ¿no verdad? Y en ese caso queda así, se lo calculé para que jugar un poquito con ustedes ahí en clase.",
        "start": 2677.4,
        "end": 2685.4
    },
    {
        "text": " Cambia filas y columnas según exactamente la permutación, ¿no verdad?",
        "start": 2687.4,
        "end": 2691.4
    },
    {
        "text": " Entonces, bueno, lo pongo.",
        "start": 2691.4,
        "end": 2694.4
    },
    {
        "text": " De resultado finales, a su 3, 3, a su 3, 1, a su 3, 2, a su 1 o 3, a su 1 o 1 o 1 o 2, a su 2, 3, a su 2, 1 o 2, 2 o 2.",
        "start": 2694.4,
        "end": 2713.4
    },
    {
        "text": " Si hablamos de filas, más o sea que no están ordenadas, la fila tercera pasó al primer lugar.",
        "start": 2714.4,
        "end": 2725.4
    },
    {
        "text": " ¿Cierto? La fila primera pasó al segundo lugar y la fila segunda pasó al tercer lugar. No están ordenados dentro de la fila.",
        "start": 2727.4,
        "end": 2736.4
    },
    {
        "text": " Si hablamos de columna, la columna tercera pasó al primer lugar, la columna segunda, la columna primera disculpa,",
        "start": 2737.4,
        "end": 2746.4
    },
    {
        "text": " pasó al segundo lugar y la columna segunda pasó al tercer lugar. ¿Acaso hay algo?",
        "start": 2746.4,
        "end": 2751.4
    },
    {
        "text": " Sí, está bien.",
        "start": 2751.4,
        "end": 2754.4
    },
    {
        "text": " Bueno, en definitiva, eso es lo que pasó y por eso es el resultado final, por supuesto, van las cuentas en el ejercicio.",
        "start": 2756.4,
        "end": 2763.4
    },
    {
        "text": " O sea que en definitiva lo que hace es que estas puertas te cambien de lugar a los coeficientes.",
        "start": 2764.4,
        "end": 2768.4
    },
    {
        "text": " Por eso se llama matriz de permutación, te permuta a todos los coeficientes de lugar.",
        "start": 2768.4,
        "end": 2773.4
    },
    {
        "text": " Creo que esta hubiera deservido bastante para aquel ejercicio que le costó tanto en el práctico a uno.",
        "start": 2776.4,
        "end": 2781.4
    },
    {
        "text": " Es más cuerdo, cual era, pero él les costaba... ¿Por qué esto es con jugar en el fondo? Estamos con jugando con matriz de permutación.",
        "start": 2781.4,
        "end": 2788.4
    },
    {
        "text": " Si...",
        "start": 2789.4,
        "end": 2792.4
    },
    {
        "text": " ¿Apuedes tener mucho cero?",
        "start": 2800.4,
        "end": 2802.4
    },
    {
        "text": " Claro, pero no necesariamente.",
        "start": 2802.4,
        "end": 2805.4
    },
    {
        "text": " No, bueno, pero lo que te está diciendo es, si hay alguna manera de reordenar de tal manera que te queto un bloque de cero es reducible.",
        "start": 2805.4,
        "end": 2814.4
    },
    {
        "text": " Es eso. Claro que si tu matriz no tiene ningún cero, no hay chance.",
        "start": 2815.4,
        "end": 2819.4
    },
    {
        "text": " Es una matriz grandeota, es por ese. Y a dos dos, es una matriz grandeota, en menos ese, por en menos ese.",
        "start": 2822.4,
        "end": 2828.4
    },
    {
        "text": " Y esta es una matriz que no te importa mucho, pero esta tiene una matriz de cero.",
        "start": 2828.4,
        "end": 2833.4
    },
    {
        "text": " O sea, en definitiva cero que vos puedes reordenar de tal manera que te quede...",
        "start": 2834.4,
        "end": 2839.4
    },
    {
        "text": " Bueno.",
        "start": 2845.4,
        "end": 2847.4
    },
    {
        "text": " Y el concepto irreducible se lo dijimos. Y a otros, ya estamos en el punto 6, donde aparece el primer lema de la sección 3, previo el tema de perrofrovenio.",
        "start": 2849.4,
        "end": 2860.4
    },
    {
        "text": " Sí.",
        "start": 2862.4,
        "end": 2864.4
    },
    {
        "text": " No, no son cuadrados.",
        "start": 2868.4,
        "end": 2871.4
    },
    {
        "text": " A no ser que justo...",
        "start": 2871.4,
        "end": 2874.4
    },
    {
        "text": " No tiene por qué serla, para nada. A no ser que justito sea la mitad.",
        "start": 2875.4,
        "end": 2879.4
    },
    {
        "text": " Ese, cualquier cosa mayor, igual que uno. Y en M lo sé, es de tal manera que la suma a Mdn y que de esta forma.",
        "start": 2883.4,
        "end": 2890.4
    },
    {
        "text": " Bueno, entonces, lema. Mire que linda la demostración de este lema.",
        "start": 2891.4,
        "end": 2896.4
    },
    {
        "text": " Lo que dice técnico, en principio está bien, pero digamos la demostración es muy bonito.",
        "start": 2897.4,
        "end": 2905.4
    },
    {
        "text": " ¿Perdón? No, aquel teorema no lo vamos a mostrar porque no se varía el que marqué en rojo lo que se ganaba, no.",
        "start": 2907.4,
        "end": 2914.4
    },
    {
        "text": " Entonces, lema, tenemos una matriz mayor, no negativa, mayor igual que cero, irreducible.",
        "start": 2915.4,
        "end": 2922.4
    },
    {
        "text": " Siempre, por supuesto, recuerdan que nuestra matriz están en M su NDR, cuadradas en M por N que hubiese terreal.",
        "start": 2922.4,
        "end": 2931.4
    },
    {
        "text": " Entonces, dice, el lema, si le suma el identidad y lo elevás a la N-1, te queda positivo.",
        "start": 2932.4,
        "end": 2940.4
    },
    {
        "text": " ¿Pero se le va a traer el nº? Sí, le va a traer el nº.",
        "start": 2946.4,
        "end": 2949.4
    },
    {
        "text": " O sea, la potencia tiene que quedar con el tamaño y la matriz.",
        "start": 2952.4,
        "end": 2955.4
    },
    {
        "text": " Y la demostración es muy bonita.",
        "start": 2956.4,
        "end": 2958.4
    },
    {
        "text": " Creo que la vamos a hacer en este plazo de alcance con esta parte del pizarro.",
        "start": 2959.4,
        "end": 2964.4
    },
    {
        "text": " Y es muy bonita porque dice así, bueno, de hecho, que sea mayor...",
        "start": 2965.4,
        "end": 2974.4
    },
    {
        "text": " Es suficiente probar que para todo, para probar que mayor que cero es suficiente,",
        "start": 2974.4,
        "end": 2982.4
    },
    {
        "text": " necesaria y suficiente, de hecho, probar que para cualquier vector mayor igual que cero,",
        "start": 2983.4,
        "end": 2992.4
    },
    {
        "text": " en el rey, por supuesto, no anulo, por supuesto.",
        "start": 2994.4,
        "end": 2999.4
    },
    {
        "text": " Entonces, cuando lo multiplicas por ese vector, no le pongo.",
        "start": 3000.4,
        "end": 3008.4
    },
    {
        "text": " Ustedes me tienen que decir que va para que esa parte de la demostración no se anteriore ni hacerlo.",
        "start": 3009.4,
        "end": 3016.4
    },
    {
        "text": " Claro, si vos querés que entonces sea mayor que cero, que todos sus opciones sean positivas,",
        "start": 3017.4,
        "end": 3021.4
    },
    {
        "text": " cuando lo multiplicas por cualquier vector que sea mayor igual que cero, que no sea todo cero, por supuesto.",
        "start": 3021.4,
        "end": 3028.4
    },
    {
        "text": " Lo que necesitas es que esto sea mayor que cero.",
        "start": 3029.4,
        "end": 3031.4
    },
    {
        "text": " Lo mismo. Porque si no fuera así, si tiene algún casi cero esta matriz escondido que va a cero,",
        "start": 3032.4,
        "end": 3040.4
    },
    {
        "text": " a vos vas a encontrar un vector cito que de tal manera que pone los llenaz de cero y en ese lugar le pones algo positivo y el producto te va a dar cero.",
        "start": 3041.4,
        "end": 3050.4
    },
    {
        "text": " ¿No?",
        "start": 3051.4,
        "end": 3052.4
    },
    {
        "text": " El producto te va a dar cero, no, disculpe, el producto va a dar mayor igual que cero, disculpe.",
        "start": 3057.4,
        "end": 3061.4
    },
    {
        "text": " Puede haber una coordenada positiva, pero algún cero.",
        "start": 3065.4,
        "end": 3069.4
    },
    {
        "text": " Claro, no es lo que quiero decir justamente. Para probar que esto es mayor que cero,",
        "start": 3074.4,
        "end": 3080.4
    },
    {
        "text": " para probar esto, es condición y salir suficiente.",
        "start": 3081.4,
        "end": 3084.4
    },
    {
        "text": " Lo que digo es si esta no fuera mayor que cero, si tuvieras condido algún cero,",
        "start": 3085.4,
        "end": 3093.4
    },
    {
        "text": " lo descubrí con algún I, este, recorden a las mayoras igual que cero, de tal manera que el producto te de mayor igual que cero.",
        "start": 3094.4,
        "end": 3104.4
    },
    {
        "text": " Y el vector resultante te queda mayor igual que cero.",
        "start": 3104.4,
        "end": 3111.4
    },
    {
        "text": " Sí.",
        "start": 3112.4,
        "end": 3113.4
    },
    {
        "text": " Puede ser que algún vector para que le pasa algún, alguna otra popular raíz que ha cero,",
        "start": 3114.4,
        "end": 3119.4
    },
    {
        "text": " se dice que no sea el vector mulo, pero puede tener alguna cero.",
        "start": 3120.4,
        "end": 3124.4
    },
    {
        "text": " Oliminado una va a priscuular, en el encendado cero te va a dar cero.",
        "start": 3125.4,
        "end": 3129.4
    },
    {
        "text": " No puede tener que dar cero.",
        "start": 3130.4,
        "end": 3132.4
    },
    {
        "text": " Claro, porque usted tiene que hacer el primer fila por el vector, segunda fila por el vector,",
        "start": 3133.4,
        "end": 3138.4
    },
    {
        "text": " y al final todo el jornal te queda positiva.",
        "start": 3139.4,
        "end": 3142.4
    },
    {
        "text": " No, está bien, pero esa es la clave, justamente.",
        "start": 3143.4,
        "end": 3145.4
    },
    {
        "text": " Por eso estaba bien visualizar que esta condición es una desviabilidad insuficiente.",
        "start": 3146.4,
        "end": 3149.4
    },
    {
        "text": " Entonces, he dicho esto, miren que bonito en la demostración,",
        "start": 3150.4,
        "end": 3153.4
    },
    {
        "text": " dice bueno, entonces lo que es lo único que tenemos que hacer es mostrar que cada vez que",
        "start": 3153.4,
        "end": 3158.4
    },
    {
        "text": " voy a poner la misma notación, que comienzo con un vector, dicho esto dice,",
        "start": 3159.4,
        "end": 3164.4
    },
    {
        "text": " mostraremos que para todo x mayor igual que cero, cualquier vector, mayor igual que cero,",
        "start": 3165.4,
        "end": 3174.4
    },
    {
        "text": " no, nulo, por supuesto.",
        "start": 3175.4,
        "end": 3176.4
    },
    {
        "text": " Entonces, cuando lo multiplico por y suene masa por x, me queda mayor igual que cero,",
        "start": 3176.4,
        "end": 3185.4
    },
    {
        "text": " pero con menos estrictamente, menos, estrictamente, menos, coordenada cero.",
        "start": 3186.4,
        "end": 3196.4
    },
    {
        "text": " Vamos a mostrar esto. Este o, si quieres lo hemos hecho de ese lado del pizarro,",
        "start": 3206.4,
        "end": 3211.4
    },
    {
        "text": " lo que voy a mostrar de este lado del pizarro, ahora mismo es, asumamos que se aprobamos esto.",
        "start": 3212.4,
        "end": 3216.4
    },
    {
        "text": " ¿Cómo, por qué esto implica que entonces si suene masa a la nm1 por x mayor que cero?",
        "start": 3217.4,
        "end": 3224.4
    },
    {
        "text": " O sea, y después en ese plásito del pizarro, se me la contitra por qué esto,",
        "start": 3226.4,
        "end": 3231.4
    },
    {
        "text": " como se prueba que esto, ahora ¿qué quiere decir? Con menos, resulta que usted",
        "start": 3232.4,
        "end": 3237.4
    },
    {
        "text": " es un vector x de todas coordenadas, no negativas, todas mayor igual que cero, lo multiplico,",
        "start": 3238.4,
        "end": 3243.4
    },
    {
        "text": " me queda un vector de coordenadas mayor igual que cero, pero lo que dice es que tenemos que probar,",
        "start": 3244.4,
        "end": 3248.4
    },
    {
        "text": " si había algunos cero acá, ahí por lo menos, un cero menos, matamos cero, quedo claro.",
        "start": 3249.4,
        "end": 3257.4
    },
    {
        "text": " Entonces, ¿qué pasa? Tengo el y, a este le llamamos x, porque la tenemos que probar con x,",
        "start": 3258.4,
        "end": 3265.4
    },
    {
        "text": " pero ahora vuelvo al y, acá arriba.",
        "start": 3266.4,
        "end": 3268.4
    },
    {
        "text": " Sí.",
        "start": 3269.4,
        "end": 3270.4
    },
    {
        "text": " Es que como una cero tiene por lo menos, como máximo, nm1, y nm1,",
        "start": 3271.4,
        "end": 3278.4
    },
    {
        "text": " lo primero cual hay que sacar la cantidad, como máximo, como lo voy a multiplicarlo,",
        "start": 3279.4,
        "end": 3283.4
    },
    {
        "text": " y nm1, ¿no es una verdad que se hace por el cero?",
        "start": 3283.4,
        "end": 3286.4
    },
    {
        "text": " Exactamente, arranco con lo que dijo Nico, arranco con el y, que ya era mayor igual que cero,",
        "start": 3287.4,
        "end": 3292.4
    },
    {
        "text": " lo multiplico, por eso nm1, este era, ¿accuál de se quedan en un hulro, ¿no verdad?",
        "start": 3293.4,
        "end": 3301.4
    },
    {
        "text": " mayor igual que cero, y este me quedó mayor igual que cero, y por supuesto que en un hulro,",
        "start": 3304.4,
        "end": 3309.4
    },
    {
        "text": " porque en realidad tiene menos coordenada 0, si este ya no era nulo, este tampoco.",
        "start": 3309.4,
        "end": 3314.4
    },
    {
        "text": " Entonces, ahora lo multiplico por y suene más a, o sea,",
        "start": 3315.4,
        "end": 3321.4
    },
    {
        "text": " y ahora resulta que tiene por lo menos una coordenada menos cero, y así sigo,",
        "start": 3322.4,
        "end": 3327.4
    },
    {
        "text": " hasta llegar a y suene más a, a la nm1 por y,",
        "start": 3330.4,
        "end": 3336.4
    },
    {
        "text": " recuerden que este proceso es estricto, ¿no?",
        "start": 3339.4,
        "end": 3342.4
    },
    {
        "text": " Sí.",
        "start": 3343.4,
        "end": 3344.4
    },
    {
        "text": " El mayor acero.",
        "start": 3345.4,
        "end": 3348.4
    },
    {
        "text": " Es que es todo el hulro, no es el cero.",
        "start": 3350.4,
        "end": 3352.4
    },
    {
        "text": " Toda la coordenada tiene ese mayor acero, exactamente.",
        "start": 3353.4,
        "end": 3355.4
    },
    {
        "text": " No sé qué pasó.",
        "start": 3356.4,
        "end": 3358.4
    },
    {
        "text": " Este último es mayor que cero, ¿por qué?",
        "start": 3360.4,
        "end": 3363.4
    },
    {
        "text": " Arrancaste con uno mayor igual que cero, te quedaste con uno mayor igual que cero,",
        "start": 3364.4,
        "end": 3368.4
    },
    {
        "text": " pero con por lo menos le mataste un cero.",
        "start": 3368.4,
        "end": 3371.4
    },
    {
        "text": " Le mataste un cero.",
        "start": 3372.4,
        "end": 3374.4
    },
    {
        "text": " Al final de nm1 paso, le mataste todo lo que sea, porque acá había por lo menos una coordenada que era distinto de cero.",
        "start": 3376.4,
        "end": 3382.4
    },
    {
        "text": " Porque si no hubiera sido el coitonulo, y le va a ser eliminando, ojo,",
        "start": 3383.4,
        "end": 3387.4
    },
    {
        "text": " porque si la coordenada es 5 y la 7 era cero, capaz que acá es la coordenada 4,",
        "start": 3388.4,
        "end": 3392.4
    },
    {
        "text": " y cero y la 5 y 7, bueno, no sé, no, eso no puede suceder, ¿no?",
        "start": 3393.4,
        "end": 3397.4
    },
    {
        "text": " Yo que yo digo que cada vez tiene menos coordenada cero, pero además, en realidad,",
        "start": 3398.4,
        "end": 3402.4
    },
    {
        "text": " las únicas que pueden ser cero eran algunas de las que antes se han cero.",
        "start": 3403.4,
        "end": 3406.4
    },
    {
        "text": " ¿Eso en el nm1 le ha quedado?",
        "start": 3407.4,
        "end": 3409.4
    },
    {
        "text": " O sea, puede ser que sea mayor acero antes, que sea el nm1.",
        "start": 3410.4,
        "end": 3412.4
    },
    {
        "text": " Sí, claro, exactamente.",
        "start": 3413.4,
        "end": 3414.4
    },
    {
        "text": " ¿Es como el caso máximo?",
        "start": 3415.4,
        "end": 3416.4
    },
    {
        "text": " El caso máximo, me aseguro el caso máximo.",
        "start": 3417.4,
        "end": 3418.4
    },
    {
        "text": " Exactamente.",
        "start": 3419.4,
        "end": 3420.4
    },
    {
        "text": " En todo me da mayor igual que cero, mayor igual que cero, pero en el último me dio mayor que cero.",
        "start": 3421.4,
        "end": 3424.4
    },
    {
        "text": " Está buenísimo el procedimiento, ¿no?",
        "start": 3425.4,
        "end": 3427.4
    },
    {
        "text": " Ir matando cero.",
        "start": 3428.4,
        "end": 3429.4
    },
    {
        "text": " Y ahora solo nos queda probar, y es verdad esto de que podemos matar cero,",
        "start": 3430.4,
        "end": 3436.4
    },
    {
        "text": " por lo menos día 1, veamos.",
        "start": 3437.4,
        "end": 3439.4
    },
    {
        "text": " ¿Cuál es la hipotecia que nos usamos?",
        "start": 3440.4,
        "end": 3442.4
    },
    {
        "text": " Lo de reducible, no hemos usado, ¿no?",
        "start": 3443.4,
        "end": 3444.4
    },
    {
        "text": " Tíjense, tenemos que el x, acá vamos a asumir que como siempre pasa que tenemos que ordenar las coordenadas,",
        "start": 3455.4,
        "end": 3466.4
    },
    {
        "text": " reordenarlas un poquito para que quede bonita la demostración.",
        "start": 3467.4,
        "end": 3469.4
    },
    {
        "text": " Pero no es un problema de que voy a suponer que esto es y cero, esto es s y esto es nm0s.",
        "start": 3470.4,
        "end": 3477.4
    },
    {
        "text": " ¿Se entiende?",
        "start": 3478.4,
        "end": 3479.4
    },
    {
        "text": " Acaí nm0s es el coordenado y acaí es el coordenado.",
        "start": 3480.4,
        "end": 3482.4
    },
    {
        "text": " Todo se acaso un cero y que u es mayor que cero, o sea, ninguna coordenada es cero.",
        "start": 3483.4,
        "end": 3488.4
    },
    {
        "text": " Ponga por favor, si no lo reordenamos, estamos haciendo una cuenta para que quede más proligito,",
        "start": 3489.4,
        "end": 3493.4
    },
    {
        "text": " vamos todos los distintos cero arriba y la otra.",
        "start": 3494.4,
        "end": 3496.4
    },
    {
        "text": " Bueno, entonces yo multiplico y su nm0s por x,",
        "start": 3498.4,
        "end": 3504.4
    },
    {
        "text": " y su nm0s por este vector u0, que eso me torlardo, ¿no?",
        "start": 3505.4,
        "end": 3514.4
    },
    {
        "text": " O sea, que me quedó u0 más a por u0.",
        "start": 3515.4,
        "end": 3522.4
    },
    {
        "text": " ¿Certo? Y vamos a suponer que esto me queda usted hecho, 0, pero que no gané espacio en la parte de arriba,",
        "start": 3523.4,
        "end": 3531.4
    },
    {
        "text": " sigue siendo s y nm0s, que no maté ningún cero, vamos a suponer que no maté ningún cero.",
        "start": 3531.4,
        "end": 3537.4
    },
    {
        "text": " Supongamos que no matamos cero.",
        "start": 3544.4,
        "end": 3550.4
    },
    {
        "text": " No, no, solo que no matamos cero, pero usted hecho en el sencidio,",
        "start": 3550.4,
        "end": 3559.4
    },
    {
        "text": " porque puede ser otras coordenadas.",
        "start": 3560.4,
        "end": 3562.4
    },
    {
        "text": " Ahora bien, entonces, cuando yo hago a,",
        "start": 3568.4,
        "end": 3572.4
    },
    {
        "text": " este, que no quedó, no quedó, un cero más a esta a, chiquilines, la voy a escribir así,",
        "start": 3572.4,
        "end": 3585.4
    },
    {
        "text": " a su 1 o 1, a su 1 o 2, pronto, a su 2 o 2, a su 1 o 2,",
        "start": 3586.4,
        "end": 3594.4
    },
    {
        "text": " a su 2 o 1, pues ya está, la acá a su 2 o 2,",
        "start": 3595.4,
        "end": 3598.4
    },
    {
        "text": " u0, donde claramente la repartición en bloque se está dado por lo tamaño de allá,",
        "start": 3602.4,
        "end": 3612.4
    },
    {
        "text": " esto es s y s, porque esto era s, esto era nm0s, nm0s, nm0s.",
        "start": 3612.4,
        "end": 3621.4
    },
    {
        "text": " Claro, resulta, dice hacia arriba, supuesto que esto da usted hecho, 0,",
        "start": 3621.4,
        "end": 3633.4
    },
    {
        "text": " s, no ganamos, no matamos ni un cero.",
        "start": 3634.4,
        "end": 3639.4
    },
    {
        "text": " ¿Cuál es la conclusión? Por favor, y con esto se termina este lema,",
        "start": 3643.4,
        "end": 3649.4
    },
    {
        "text": " dejo un espacio, ¿no?",
        "start": 3650.4,
        "end": 3652.4
    },
    {
        "text": " Porque lo que yo supuse acá en rojo, me tiene que ser un absurdo, pero está casi presente el absurdo.",
        "start": 3653.4,
        "end": 3661.4
    },
    {
        "text": " ¿Qué cual?",
        "start": 3664.4,
        "end": 3666.4
    },
    {
        "text": " A2, una porú tiene la s, 0 y a 1 una porú tiene la s, 0.",
        "start": 3666.4,
        "end": 3669.4
    },
    {
        "text": " ¿Qué ha su 2 o 1 por u es 0? Pero ha su 2 o 1 como era, era, era, era nm0,",
        "start": 3672.4,
        "end": 3679.4
    },
    {
        "text": " perfecto, y u, entonces como esta su 2 o 1?",
        "start": 3680.4,
        "end": 3685.4
    },
    {
        "text": " Todo a 0, tiene que ser todo a 0, porque si hubiera algo mayor que ser lo que ha dentro,",
        "start": 3686.4,
        "end": 3694.4
    },
    {
        "text": " multiplicado por u, te queda en este pedacito.",
        "start": 3694.4,
        "end": 3697.4
    },
    {
        "text": " Exactamente.",
        "start": 3700.4,
        "end": 3702.4
    },
    {
        "text": " Si, en la otra forma.",
        "start": 3702.4,
        "end": 3704.4
    },
    {
        "text": " No es 0, 1, ¿no?",
        "start": 3704.4,
        "end": 3705.4
    },
    {
        "text": " Sí, sí, es que la definición irreducible, no es lo que había dicho en ese momento,",
        "start": 3705.4,
        "end": 3712.4
    },
    {
        "text": " no importa de que la ate que el 0, porque la matriz de preguntación la cambias.",
        "start": 3712.4,
        "end": 3717.4
    },
    {
        "text": " O sea, es importante eso que me acaban de decir, si vos conseguís a 1 o 1, a 1 o 2, 0 y a 2 o 2,",
        "start": 3717.4,
        "end": 3727.4
    },
    {
        "text": " esta es reducible también, porque le cambias en vez de usar esta peña, esta petrapuesta cambia en los lugares,",
        "start": 3727.4,
        "end": 3733.4
    },
    {
        "text": " los 1, de tal manera que el 0 queda arriba, el de abajo.",
        "start": 3733.4,
        "end": 3736.4
    },
    {
        "text": " Entonces esto, lo que me está llevando es que esto es 1, 2, 0, a 2 o 2.",
        "start": 3737.4,
        "end": 3744.4
    },
    {
        "text": " Exactamente, por lo tanto reducible a su rojo.",
        "start": 3744.4,
        "end": 3750.4
    },
    {
        "text": " Y ojo, en ese razonamiento que hicieron ustedes recién usaron también la hipótesis y samba a su igual que 0,",
        "start": 3750.4,
        "end": 3756.4
    },
    {
        "text": " usaron la hipótesis y samba a su igual que 0 y ahora estamos usando que si reducible contradices.",
        "start": 3756.4,
        "end": 3762.4
    },
    {
        "text": " Muy bonito, se termina ahí ese lema.",
        "start": 3763.4,
        "end": 3767.4
    },
    {
        "text": " ¿Dónde? A 2 o 1 por 1.",
        "start": 3776.4,
        "end": 3778.4
    },
    {
        "text": " Este es el igual que 0.",
        "start": 3780.4,
        "end": 3781.4
    },
    {
        "text": " Todo el suelso es el que 0.",
        "start": 3781.4,
        "end": 3783.4
    },
    {
        "text": " Cuando lo hagas la cuentita, tra fila por lo que te va a ver.",
        "start": 3783.4,
        "end": 3788.4
    },
    {
        "text": " Claro, alguien va a sobrevivir en este pedacito y acá te va a ser.",
        "start": 3789.4,
        "end": 3794.4
    },
    {
        "text": " Sí, sí, es irreducible y hipótesis y todo el suelso.",
        "start": 3800.4,
        "end": 3803.4
    },
    {
        "text": " Bueno, Boris, entonces llegamos al famoso telema de Perrón,",
        "start": 3804.4,
        "end": 3807.4
    },
    {
        "text": " provenia en el último 10 minutos de clase que van a ser veinti, por supuesto,",
        "start": 3807.4,
        "end": 3811.4
    },
    {
        "text": " porque yo llegué unos minutos más tarde.",
        "start": 3811.4,
        "end": 3814.4
    },
    {
        "text": " En el que se conjuga todo lo que hemos visto hasta ahora y donde la demostración,",
        "start": 3815.4,
        "end": 3823.4
    },
    {
        "text": " casi todas las demostraciones ya fueron dadas, es casi que un resumidero de resultados",
        "start": 3823.4,
        "end": 3833.4
    },
    {
        "text": " excepto que hay que hacer un par de cuentitas en el medio, pero muy sencillo.",
        "start": 3833.4,
        "end": 3839.4
    },
    {
        "text": " ¿Cómo matemos una de los testos en esta dos?",
        "start": 3840.4,
        "end": 3843.4
    },
    {
        "text": " No, el telema es el que quedó antes, eso no lo vamos a demostrar.",
        "start": 3844.4,
        "end": 3848.4
    },
    {
        "text": " Es el telema que vimos hoy, está en el libro, se puede ver, pero no da el tiempo para hacerlo.",
        "start": 3850.4,
        "end": 3856.4
    },
    {
        "text": " Es el que va a quedar pendiente.",
        "start": 3856.4,
        "end": 3858.4
    },
    {
        "text": " Entonces, este telema final, perrón proveños, pero es el que quedó pendiente",
        "start": 3859.4,
        "end": 3864.4
    },
    {
        "text": " porque no dio el tiempo, no porque...",
        "start": 3864.4,
        "end": 3866.4
    },
    {
        "text": " No es porque se ha complejo, para nada.",
        "start": 3867.4,
        "end": 3869.4
    },
    {
        "text": " Entonces, el telema de Perrón provenios, que tiene dos versiones,",
        "start": 3871.4,
        "end": 3875.4
    },
    {
        "text": " eso está dando una de las versiones, el libro también ofrece la otra.",
        "start": 3875.4,
        "end": 3878.4
    },
    {
        "text": " provenios, sí, F provenios y la 10, si creo que llevo.",
        "start": 3880.4,
        "end": 3886.4
    },
    {
        "text": " Creo que no me acuerdo.",
        "start": 3886.4,
        "end": 3888.4
    },
    {
        "text": " Entonces, si tienes una matriz, no negativa y reducible,",
        "start": 3888.4,
        "end": 3893.4
    },
    {
        "text": " ojo, si buscas en la internet hay versiones, varias versiones similares,",
        "start": 3897.4,
        "end": 3901.4
    },
    {
        "text": " nosotros estamos dando una, creo que es la más fuerte,",
        "start": 3901.4,
        "end": 3904.4
    },
    {
        "text": " en las que van a encontrar, probablemente, este sea la más fuerte,",
        "start": 3904.4,
        "end": 3907.4
    },
    {
        "text": " porque recuerden que no estamos sacando a Ferrof provenios y un telema más general,",
        "start": 3907.4,
        "end": 3911.4
    },
    {
        "text": " que es el Virkhov Bandegraft,",
        "start": 3911.4,
        "end": 3914.4
    },
    {
        "text": " con la limitante de la falta de tiempo, nada más.",
        "start": 3917.4,
        "end": 3919.4
    },
    {
        "text": " Tenemos esta es hipótesis, entonces,",
        "start": 3920.4,
        "end": 3923.4
    },
    {
        "text": " y es el telema de Perrón provenios,",
        "start": 3926.4,
        "end": 3928.4
    },
    {
        "text": " este Rodea es valor propio, simple,",
        "start": 3929.4,
        "end": 3937.4
    },
    {
        "text": " de A,",
        "start": 3938.4,
        "end": 3939.4
    },
    {
        "text": " dos, existe un vector mayor que cero,",
        "start": 3942.4,
        "end": 3947.4
    },
    {
        "text": " que es vector propio asociado al valor propio radio espectral,",
        "start": 3949.4,
        "end": 3954.4
    },
    {
        "text": " tres,",
        "start": 3956.4,
        "end": 3957.4
    },
    {
        "text": " si lambda 1 es Rodea,",
        "start": 3963.4,
        "end": 3966.4
    },
    {
        "text": " y el resto de los valores propios han lambda 2 hasta lambda h,",
        "start": 3967.4,
        "end": 3971.4
    },
    {
        "text": " digo, estos son los valores propios que tienen valores propios,",
        "start": 3972.4,
        "end": 3978.4
    },
    {
        "text": " tal que el módulo de todos estos valores propios es Rodea 1,",
        "start": 3978.4,
        "end": 3985.4
    },
    {
        "text": " menos igual que h,",
        "start": 3986.4,
        "end": 3988.4
    },
    {
        "text": " o sea, me estoy moviendo en la parte 3,",
        "start": 3989.4,
        "end": 3991.4
    },
    {
        "text": " en aquellos valores propios que tienen el mismo módulo,",
        "start": 3991.4,
        "end": 3994.4
    },
    {
        "text": " más el módulo Rodeapro,",
        "start": 3995.4,
        "end": 3997.4
    },
    {
        "text": " entonces,",
        "start": 3998.4,
        "end": 3999.4
    },
    {
        "text": " bueno, antes de poner esta t,",
        "start": 4000.4,
        "end": 4001.4
    },
    {
        "text": " si yo tenía en mi preparación de clase,",
        "start": 4001.4,
        "end": 4004.4
    },
    {
        "text": " hacer una observación antes de número comodio,",
        "start": 4004.4,
        "end": 4007.4
    },
    {
        "text": " de número complejos,",
        "start": 4007.4,
        "end": 4009.4
    },
    {
        "text": " muy, muy sencilla,",
        "start": 4012.4,
        "end": 4014.4
    },
    {
        "text": " pero le había puesto antes en la preparación del clase justamente",
        "start": 4015.4,
        "end": 4018.4
    },
    {
        "text": " para que, a la hora de poner la t, si que viene ahora,",
        "start": 4018.4,
        "end": 4020.4
    },
    {
        "text": " se da completamente natural,",
        "start": 4021.4,
        "end": 4022.4
    },
    {
        "text": " ese resultado,",
        "start": 4023.4,
        "end": 4024.4
    },
    {
        "text": " olvides de telema de Perrón provenios y le pregunto,",
        "start": 4025.4,
        "end": 4028.4
    },
    {
        "text": " número complejo, tengo la ecuación,",
        "start": 4029.4,
        "end": 4030.4
    },
    {
        "text": " x a la s, menos a la s, igual cero,",
        "start": 4031.4,
        "end": 4034.4
    },
    {
        "text": " a, eso este,",
        "start": 4034.4,
        "end": 4036.4
    },
    {
        "text": " pongo el que hay es tener,",
        "start": 4037.4,
        "end": 4039.4
    },
    {
        "text": " pero la ecuación es en c,",
        "start": 4039.4,
        "end": 4041.4
    },
    {
        "text": " y más, pongo que hay R más, o sea, es un número positivo.",
        "start": 4043.4,
        "end": 4047.4
    },
    {
        "text": " Sí, ¿cuál es la observación?",
        "start": 4051.4,
        "end": 4053.4
    },
    {
        "text": " Un azano ¿cuál más?",
        "start": 4055.4,
        "end": 4057.4
    },
    {
        "text": " Claro, pues agarras, si ese se agarras,",
        "start": 4058.4,
        "end": 4064.4
    },
    {
        "text": " este, tomas 2p sobre ese ángulo,",
        "start": 4065.4,
        "end": 4069.4
    },
    {
        "text": " y entonces, a por y veces ese ángulo,",
        "start": 4070.4,
        "end": 4074.4
    },
    {
        "text": " son las diferentes soluciones, exactamente,",
        "start": 4074.4,
        "end": 4077.4
    },
    {
        "text": " o sea, e a la 2p sobre ese y por, por a.",
        "start": 4078.4,
        "end": 4085.4
    },
    {
        "text": " ¿Más que?",
        "start": 4088.4,
        "end": 4089.4
    },
    {
        "text": " ¿Más que?",
        "start": 4091.4,
        "end": 4092.4
    },
    {
        "text": " No, no, si queremos, podemos poner más,",
        "start": 4094.4,
        "end": 4097.4
    },
    {
        "text": " pero no hay problema, digamos, pero en realidad es,",
        "start": 4098.4,
        "end": 4102.4
    },
    {
        "text": " ¿cómo llegas a la s, digamos, con a,",
        "start": 4103.4,
        "end": 4107.4
    },
    {
        "text": " llegas a la s, pero si vamos a llegar a este,",
        "start": 4108.4,
        "end": 4109.4
    },
    {
        "text": " ponerle que ese fuera 4,",
        "start": 4110.4,
        "end": 4112.4
    },
    {
        "text": " entonces, si ese es 4, por ejemplo,",
        "start": 4113.4,
        "end": 4115.4
    },
    {
        "text": " tenés que menos a por y, también,",
        "start": 4115.4,
        "end": 4120.4
    },
    {
        "text": " a la 4, te queda a cuadrado y cuadrado,",
        "start": 4120.4,
        "end": 4124.4
    },
    {
        "text": " a la 4, no, a ver,",
        "start": 4124.4,
        "end": 4127.4
    },
    {
        "text": " a cuadrado y cuadrado, que menos 1, a la 4 te queda,",
        "start": 4128.4,
        "end": 4130.4
    },
    {
        "text": " en el siguiente paso, o sea, quiero decir,",
        "start": 4130.4,
        "end": 4132.4
    },
    {
        "text": " en ese caso si es 4, los 4, que son 1,",
        "start": 4133.4,
        "end": 4136.4
    },
    {
        "text": " acá, otro acá, otro acá, y otro acá,",
        "start": 4136.4,
        "end": 4138.4
    },
    {
        "text": " ¿de verdad?",
        "start": 4139.4,
        "end": 4140.4
    },
    {
        "text": " Y si son ese, lo tenés que vivir en 3.",
        "start": 4140.4,
        "end": 4141.4
    },
    {
        "text": " No, y si me di eso, es una tontería, yo sé,",
        "start": 4142.4,
        "end": 4144.4
    },
    {
        "text": " pero a veces, porque lo que dice acá,",
        "start": 4144.4,
        "end": 4146.4
    },
    {
        "text": " hubo un híces de eso justamente,",
        "start": 4147.4,
        "end": 4148.4
    },
    {
        "text": " si estos son los valores propios que tienen el mismo,",
        "start": 4149.4,
        "end": 4151.4
    },
    {
        "text": " el mismo módulo, resulta que son,",
        "start": 4152.4,
        "end": 4154.4
    },
    {
        "text": " estos valores propios, ya sabemos quién son,",
        "start": 4155.4,
        "end": 4156.4
    },
    {
        "text": " entonces, lambda 1, lambda 2,",
        "start": 4157.4,
        "end": 4160.4
    },
    {
        "text": " y lambda 1, la roda, y se la haya, ¿no?",
        "start": 4161.4,
        "end": 4163.4
    },
    {
        "text": " Estos son las raíces,",
        "start": 4164.4,
        "end": 4166.4
    },
    {
        "text": " en c, por supuesto, de la ecuación,",
        "start": 4166.4,
        "end": 4173.4
    },
    {
        "text": " lambda l h menos roda a la h,",
        "start": 4178.4,
        "end": 4182.4
    },
    {
        "text": " o sea, son esos términos, ¿eh?",
        "start": 4183.4,
        "end": 4186.4
    },
    {
        "text": " Nosotros vamos a llegar a demostrar estos 3 puntos,",
        "start": 4189.4,
        "end": 4194.4
    },
    {
        "text": " pero tiene 2 puntos más, pero a un proveño 4 y 5,",
        "start": 4194.4,
        "end": 4197.4
    },
    {
        "text": " a ver, Uricies,",
        "start": 4201.4,
        "end": 4202.4
    },
    {
        "text": " lo que acabamos de decirle sugiere que para pasar de un valor",
        "start": 4204.4,
        "end": 4206.4
    },
    {
        "text": " por el pelo otro y que rotar en un ángulo 2 p sobre h, ¿no?",
        "start": 4206.4,
        "end": 4209.4
    },
    {
        "text": " Bueno, eso mismo que acabo de decir, es verdad en general,",
        "start": 4211.4,
        "end": 4213.4
    },
    {
        "text": " no solamente para los valores propios que tienen módulo rodeado,",
        "start": 4214.4,
        "end": 4218.4
    },
    {
        "text": " es verdad en general, o sea,",
        "start": 4219.4,
        "end": 4221.4
    },
    {
        "text": " ese es el punto 4, si yo tomo el espectro de a,",
        "start": 4222.4,
        "end": 4224.4
    },
    {
        "text": " que están todos los valores propios, no solamente lo de máximo módulo,",
        "start": 4225.4,
        "end": 4228.4
    },
    {
        "text": " esto es un succo junto de seno, ¿verdad?",
        "start": 4229.4,
        "end": 4231.4
    },
    {
        "text": " y le hago la rotación de centro y lo origen y ángulo 2 p sobre h,",
        "start": 4233.4,
        "end": 4238.4
    },
    {
        "text": " bueno, me da el espectro de a, exactamente,",
        "start": 4240.4,
        "end": 4243.4
    },
    {
        "text": " al ir rotando, voy pasando entre todos los valores propios,",
        "start": 4245.4,
        "end": 4247.4
    },
    {
        "text": " pero me da exactamente, o sea, uno van a parar el otro,",
        "start": 4248.4,
        "end": 4250.4
    },
    {
        "text": " pero es muy fuerte ese resultado,",
        "start": 4251.4,
        "end": 4253.4
    },
    {
        "text": " tan demasiado bien ordenadito los valores propios,",
        "start": 4254.4,
        "end": 4256.4
    },
    {
        "text": " y 5, esto tampoco lo vamos a demostrar,",
        "start": 4261.4,
        "end": 4263.4
    },
    {
        "text": " si h es más sure que 1,",
        "start": 4264.4,
        "end": 4266.4
    },
    {
        "text": " pero es útil a la obra de hacer aplicaciones,",
        "start": 4268.4,
        "end": 4273.4
    },
    {
        "text": " a poder llevarse por preguntas,",
        "start": 4276.4,
        "end": 4278.4
    },
    {
        "text": " y la rotación cíclica,",
        "start": 4281.4,
        "end": 4282.4
    },
    {
        "text": " está, ni porta el 5, está el 5, la no voy a dar,",
        "start": 4293.4,
        "end": 4295.4
    },
    {
        "text": " no pueden leer en el libro,",
        "start": 4296.4,
        "end": 4297.4
    },
    {
        "text": " está muy bonito, pero como no lo vamos a dar,",
        "start": 4298.4,
        "end": 4299.4
    },
    {
        "text": " miren en el libro que está ahí,",
        "start": 4300.4,
        "end": 4301.4
    },
    {
        "text": " 4 tampoco lo vamos a demostrar,",
        "start": 4302.4,
        "end": 4303.4
    },
    {
        "text": " pero digamos, vamos a demostrar 1, 2, 3, aparece en 5",
        "start": 4305.4,
        "end": 4308.4
    },
    {
        "text": " y al 5 también vale la pena a la obra de hacer aplicaciones,",
        "start": 4308.4,
        "end": 4315.4
    },
    {
        "text": " pero el lean lo que ustedes están ahí muy sencillo, la notación.",
        "start": 4316.4,
        "end": 4320.4
    },
    {
        "text": " Bueno, y tenemos casi todo demostrado, úrises,",
        "start": 4322.4,
        "end": 4324.4
    },
    {
        "text": " el realidad no hay casi nada, porque todo es el resultado santerior,",
        "start": 4325.4,
        "end": 4327.4
    },
    {
        "text": " primero, vamos a recopilar información,",
        "start": 4328.4,
        "end": 4330.4
    },
    {
        "text": " primero, ya tenemos un vector,",
        "start": 4332.4,
        "end": 4337.4
    },
    {
        "text": " aquí tienes el cono, acá, esto lo dijimos desde la primer clase que empezamos con cono,",
        "start": 4338.4,
        "end": 4343.4
    },
    {
        "text": " si perrofrobíos, ¿quién es el cono?",
        "start": 4344.4,
        "end": 4345.4
    },
    {
        "text": " ¿Quién es el cono?",
        "start": 4350.4,
        "end": 4351.4
    },
    {
        "text": " El cono positivo, ¿se acuerdan?",
        "start": 4352.4,
        "end": 4353.4
    },
    {
        "text": " El cono positivo que no me acuerdo con lo anotamos,",
        "start": 4355.4,
        "end": 4357.4
    },
    {
        "text": " o el cono no negativo, ¿cómo lo llamamos?",
        "start": 4358.4,
        "end": 4360.4
    },
    {
        "text": " El cono positivo, con la negativa, positivo,",
        "start": 4361.4,
        "end": 4363.4
    },
    {
        "text": " los veintores que son mayores iguales que cero,",
        "start": 4363.4,
        "end": 4370.4
    },
    {
        "text": " los veintentos y también mayor igual que cero,",
        "start": 4375.4,
        "end": 4377.4
    },
    {
        "text": " ese es el cono, o sea, vamos a aplicar todo el teonema de Virkos van de Graft,",
        "start": 4378.4,
        "end": 4384.4
    },
    {
        "text": " parece cono, porque como el amatriz es mayor igual que cero,",
        "start": 4385.4,
        "end": 4387.4
    },
    {
        "text": " entonces quiero decir, cuando diga, cuando empieza a cosechar resultado,",
        "start": 4388.4,
        "end": 4392.4
    },
    {
        "text": " profe, ¿qué cono me está usando?",
        "start": 4393.4,
        "end": 4394.4
    },
    {
        "text": " y ese es el cono, eso lo había avisado desde el primer clase.",
        "start": 4395.4,
        "end": 4398.4
    },
    {
        "text": " Entonces tenemos un vector, mayor igual que cero,",
        "start": 4399.4,
        "end": 4402.4
    },
    {
        "text": " mayor igual que cero,",
        "start": 4404.4,
        "end": 4405.4
    },
    {
        "text": " poná por b, igual a ro por b, donde ro,",
        "start": 4407.4,
        "end": 4412.4
    },
    {
        "text": " ro, esto ya lo probamos en el teonema de Virkos,",
        "start": 4413.4,
        "end": 4416.4
    },
    {
        "text": " y el b es mayor igual que cero,",
        "start": 4418.4,
        "end": 4420.4
    },
    {
        "text": " lo mismo que decir acá lo que estoy diciendo,",
        "start": 4421.4,
        "end": 4422.4
    },
    {
        "text": " b pertenece al cono positivo, ¿no?",
        "start": 4423.4,
        "end": 4424.4
    },
    {
        "text": " es mayor igual que cero, pero la tc es,",
        "start": 4428.4,
        "end": 4430.4
    },
    {
        "text": " es que es mayor que cero,",
        "start": 4431.4,
        "end": 4433.4
    },
    {
        "text": " entonces ahora esa es la única cuenta que tenemos que hacer.",
        "start": 4434.4,
        "end": 4436.4
    },
    {
        "text": " Bueno, eso es obvio que este cono que de invariante la jaleción de A,",
        "start": 4437.4,
        "end": 4441.4
    },
    {
        "text": " eso es muy importante que si ustedes están demostrando lo digan en el papel, ¿no?",
        "start": 4442.4,
        "end": 4446.4
    },
    {
        "text": " Como A es mayor igual que cero,",
        "start": 4448.4,
        "end": 4449.4
    },
    {
        "text": " te deja invariante el cono positivo,",
        "start": 4450.4,
        "end": 4451.4
    },
    {
        "text": " y por tanto puedo aplicar Vikov,",
        "start": 4452.4,
        "end": 4453.4
    },
    {
        "text": " más de B, más de B,",
        "start": 4454.4,
        "end": 4455.4
    },
    {
        "text": " Virkos van de Graft.",
        "start": 4456.4,
        "end": 4457.4
    },
    {
        "text": " Entonces hasta ahí ya tenemos un vector propio,",
        "start": 4459.4,
        "end": 4461.4
    },
    {
        "text": " el tipo valor propio, vamos muy bien, segundo,",
        "start": 4462.4,
        "end": 4464.4
    },
    {
        "text": " segundo a punto que vamos a recoger,",
        "start": 4464.4,
        "end": 4466.4
    },
    {
        "text": " que precisa afirmo que en realidad,",
        "start": 4467.4,
        "end": 4470.4
    },
    {
        "text": " en realidad, de es mayor que cero,",
        "start": 4473.4,
        "end": 4476.4
    },
    {
        "text": " y por qué?",
        "start": 4478.4,
        "end": 4479.4
    },
    {
        "text": " Fíjense, nosotros tenemos que y suene masa a la N-1,",
        "start": 4488.4,
        "end": 4493.4
    },
    {
        "text": " es mayor que cero, ¿por qué?",
        "start": 4494.4,
        "end": 4496.4
    },
    {
        "text": " Ahí estoy usando, uricela es potis y si reducible mayor igual que cero,",
        "start": 4500.4,
        "end": 4503.4
    },
    {
        "text": " ese es el Lema, acá estoy usando el Lema,",
        "start": 4504.4,
        "end": 4506.4
    },
    {
        "text": " y estoy usando, ya en este momento he usado todas las hipotis,",
        "start": 4507.4,
        "end": 4509.4
    },
    {
        "text": " porque ahora estoy usando el reducible mayor igual que cero,",
        "start": 4510.4,
        "end": 4511.4
    },
    {
        "text": " como esto es mayor que cero,",
        "start": 4512.4,
        "end": 4513.4
    },
    {
        "text": " si yo multiplico por un vector mayor igual que cero,",
        "start": 4514.4,
        "end": 4516.4
    },
    {
        "text": " que es el I, que es el V, perdón,",
        "start": 4517.4,
        "end": 4518.4
    },
    {
        "text": " que por supuesto no es nulo,",
        "start": 4519.4,
        "end": 4520.4
    },
    {
        "text": " porque es un vector propio,",
        "start": 4521.4,
        "end": 4522.4
    },
    {
        "text": " entonces, y suene masa a la N-1,",
        "start": 4522.4,
        "end": 4526.4
    },
    {
        "text": " por V es mayor que cero, ¿eh?",
        "start": 4527.4,
        "end": 4529.4
    },
    {
        "text": " Pero a ver si hacen conmigo la cuenta,",
        "start": 4539.4,
        "end": 4541.4
    },
    {
        "text": " y suene masa por otro lado, ¿no?",
        "start": 4542.4,
        "end": 4544.4
    },
    {
        "text": " a la N-1, por V, esto me queda",
        "start": 4546.4,
        "end": 4550.4
    },
    {
        "text": " y suene masa a la N-2, por y suene masa por V,",
        "start": 4552.4,
        "end": 4559.4
    },
    {
        "text": " pero y suene masa por V es V más rdb,",
        "start": 4560.4,
        "end": 4564.4
    },
    {
        "text": " porque a por V me queda rdb,",
        "start": 4569.4,
        "end": 4571.4
    },
    {
        "text": " y esto sigue igual, ¿no?",
        "start": 4572.4,
        "end": 4573.4
    },
    {
        "text": " voy a aplicar lo de vuelta, de vuelta de vuelta de vuelta,",
        "start": 4574.4,
        "end": 4576.4
    },
    {
        "text": " o sea que perdón, grises para que se vean mejor,",
        "start": 4577.4,
        "end": 4580.4
    },
    {
        "text": " cuando yo hago hice una masa por V me queda V más rdb,",
        "start": 4581.4,
        "end": 4584.4
    },
    {
        "text": " me dejan sacar por favor V de factor como una a la derecha,",
        "start": 4585.4,
        "end": 4587.4
    },
    {
        "text": " acá mismo, y lo escribo como uno más rdb,",
        "start": 4588.4,
        "end": 4591.4
    },
    {
        "text": " porque ahora lo ve más fácil,",
        "start": 4594.4,
        "end": 4595.4
    },
    {
        "text": " porque el uno más rd sale para afuera,",
        "start": 4596.4,
        "end": 4597.4
    },
    {
        "text": " y entonces vuelvo a aplicar y vuelvo a aplicar y sale un uno más rdb,",
        "start": 4598.4,
        "end": 4601.4
    },
    {
        "text": " y sale un uno más rdb, y sale un uno más rdb,",
        "start": 4602.4,
        "end": 4603.4
    },
    {
        "text": " al final le cuenta,",
        "start": 4604.4,
        "end": 4605.4
    },
    {
        "text": " esto te quedó uno más rdb,",
        "start": 4607.4,
        "end": 4608.4
    },
    {
        "text": " uno más rdb, al final menos uno, por V,",
        "start": 4608.4,
        "end": 4611.4
    },
    {
        "text": " conclusión,",
        "start": 4618.4,
        "end": 4619.4
    },
    {
        "text": " mateo,",
        "start": 4622.4,
        "end": 4623.4
    },
    {
        "text": " parte 1, parte 2,",
        "start": 4626.4,
        "end": 4628.4
    },
    {
        "text": " cuáles la conclusión.",
        "start": 4630.4,
        "end": 4631.4
    },
    {
        "text": " Y sí,",
        "start": 4634.4,
        "end": 4635.4
    },
    {
        "text": " es exactamente, esto es un número positivo,",
        "start": 4636.4,
        "end": 4639.4
    },
    {
        "text": " resulta que esto es positivo,",
        "start": 4640.4,
        "end": 4642.4
    },
    {
        "text": " y suena masar, es positivo,",
        "start": 4643.4,
        "end": 4645.4
    },
    {
        "text": " entonces, el que es positivo V,",
        "start": 4646.4,
        "end": 4648.4
    },
    {
        "text": " porque este número es un número positivo.",
        "start": 4649.4,
        "end": 4650.4
    },
    {
        "text": " Perfecto, o sea que no voy a hacer nada,",
        "start": 4653.4,
        "end": 4655.4
    },
    {
        "text": " simplemente vino gratis del lema, ¿no?",
        "start": 4656.4,
        "end": 4657.4
    },
    {
        "text": " Bueno, entonces ya estamos casi,",
        "start": 4659.4,
        "end": 4661.4
    },
    {
        "text": " estamos recogiendo por todos lados los frutos,",
        "start": 4662.4,
        "end": 4664.4
    },
    {
        "text": " para hoy,",
        "start": 4665.4,
        "end": 4668.4
    },
    {
        "text": " vamos a obs�ras con los 4 frutos.",
        "start": 4670.4,
        "end": 4672.4
    },
    {
        "text": " Bueno, permitame 6 minutos más,",
        "start": 4675.4,
        "end": 4685.4
    },
    {
        "text": " desde que empecé la clase un poquito más tarde,",
        "start": 4686.4,
        "end": 4690.4
    },
    {
        "text": " voy a borrar las tesis 4, que es muy bonita,",
        "start": 4691.4,
        "end": 4693.4
    },
    {
        "text": " 3°, si para cada p mayor igual que 0, nosotros anotamos a la p notaciones, no? Notación",
        "start": 4693.4,
        "end": 4715.24
    },
    {
        "text": " a su hijota p, notación nada más, así si quieren le ponemos los paréntesis para que quede",
        "start": 4715.24,
        "end": 4722.5199999999995
    },
    {
        "text": " claro, entonces la afirmación del punto 3 que también merece una pequeña demostración",
        "start": 4722.5199999999995,
        "end": 4729.28
    },
    {
        "text": " cita es que existe una constante c mayor que 0 tal que a su hijota p que todos esos coeficientes",
        "start": 4729.28,
        "end": 4746.5199999999995
    },
    {
        "text": " son menores iguales que c por r o a la p para todo p mayor igual que 0 igual, bueno,",
        "start": 4746.52,
        "end": 4760.120000000001
    },
    {
        "text": " hagamos esa demostración cita la demostración cita de la afirmación, entonces el coeficiente",
        "start": 4760.120000000001,
        "end": 4776.280000000001
    },
    {
        "text": " a su hijota p, si lo multiplico por b su j, b su j es la coordenada j esima del vector b que es el",
        "start": 4776.28,
        "end": 4786.2
    },
    {
        "text": " que tuvimos trabajando en la parte unido ¿no? esto por supuesto es que es menor igual que si sumo",
        "start": 4786.2,
        "end": 4792.759999999999
    },
    {
        "text": " a su hl p por b su hl, de igual 1 hasta 1 a ver, Gullich acá no dice nada, simplemente digo este es un",
        "start": 4792.76,
        "end": 4808.4800000000005
    },
    {
        "text": " sumando de lo que está acá, es un o solo, pero recuerden que estamos marejando con",
        "start": 4808.4800000000005,
        "end": 4812.320000000001
    },
    {
        "text": " con vectores mayores que 0 y que una matriz mayor igual que 0, todos los sumando que aparecen ahí",
        "start": 4812.320000000001,
        "end": 4817.06
    },
    {
        "text": " son mayores igual que 0, entonces este es un sumando, entonces está claro que es menor igual que la suma",
        "start": 4817.06,
        "end": 4821.92
    },
    {
        "text": " porque todos los demás aportan, pero esto que está acá grises es el producto de la matriz",
        "start": 4821.92,
        "end": 4829.76
    },
    {
        "text": " p esima por b cuando vos hiciste la fila y utiliste la fila y le pongo acá si quieren fila y esima",
        "start": 4829.76,
        "end": 4842.92
    },
    {
        "text": " eso es lo que estoy anotando, la fila y esima la coordenada y esima siquiera, mejor,",
        "start": 4843.92,
        "end": 4854.4800000000005
    },
    {
        "text": " vamos con el coordenada y esima, pero cuál es la coordenada y esima en realidad,",
        "start": 4854.4800000000005,
        "end": 4862.92
    },
    {
        "text": " de a la p por b, más que la más aquí en el válvalo propio, ro, roba el a p por",
        "start": 4863.92,
        "end": 4873.84
    },
    {
        "text": " exactamente, roba el a p por b suy, roba el a p por b suy exactamente, entonces mire el comienzo",
        "start": 4873.84,
        "end": 4884.56
    },
    {
        "text": " y el final, entonces a su hijota al a p por b sujota es menor igual que roba el a p por b suy",
        "start": 4884.56,
        "end": 4897.84
    },
    {
        "text": " recuerden que estoy hablando del vector fijo, ve que se ha trabajado en 1 y en 2 que tiene coordenadas",
        "start": 4902.84,
        "end": 4908.6
    },
    {
        "text": " v su uno, v su dos, todas positivas, v suy, v sujota, v suena, yo que sé, esto es una coordenada,",
        "start": 4908.6,
        "end": 4916.280000000001
    },
    {
        "text": " ok, esto es que vas a hacer, tomar todos los cocientes posibles y tomar, porque vos querés",
        "start": 4916.280000000001,
        "end": 4923.400000000001
    },
    {
        "text": " encontrar una constante, tomar todos los cocientes posibles, tomar el máximo, de todos los cocientes",
        "start": 4923.400000000001,
        "end": 4931.240000000001
    },
    {
        "text": " posibles, o sea, lo llamamos sea el máximo de todos los posibles posibles entre v suy y v su",
        "start": 4931.24,
        "end": 4938.76
    },
    {
        "text": " jota variando y hijota, este número es mayor que 0, está claro, porque todos los cocientes v suy",
        "start": 4938.76,
        "end": 4948.32
    },
    {
        "text": " y v su jota son todos mayor que 0, lo acabamos de probar, no tenemos problema para dividir,",
        "start": 4948.32,
        "end": 4952.32
    },
    {
        "text": " siempre existe la división y todos son números positivos, el más grande es un número positivo,",
        "start": 4952.32,
        "end": 4958.84
    },
    {
        "text": " bueno, entonces esto es, por lo tanto, lo que estamos diciendo es que a suy j, de todos estos",
        "start": 4958.84,
        "end": 4966.84
    },
    {
        "text": " cocientes, de la matriz p esima, es menor igual que c por rho a la p, sí, como pro?",
        "start": 4966.84,
        "end": 4987.400000000001
    },
    {
        "text": " No, no, no, no, el C es el máximo de estos cocientes, pero estos factores, este vector está",
        "start": 4987.4,
        "end": 5000.639999999999
    },
    {
        "text": " fijo, el C está fijo, y es para todo el mismo, sí, sí, sí, y no quedan solo dos sistemas, ya",
        "start": 5000.639999999999,
        "end": 5007.839999999999
    },
    {
        "text": " amostramos uno, dos, tres, el tres es técnico y lo vamos a usar en 4 y en 5, el 4 y 5 seguimos",
        "start": 5007.839999999999,
        "end": 5012.879999999999
    },
    {
        "text": " recogiendo y haciendo demostraciones chiquititas para terminar toda la demostración del teorema,",
        "start": 5012.88,
        "end": 5016.92
    },
    {
        "text": " entonces, les pido un poquito de paciencia para recetar la clase de hoy, que capaz que",
        "start": 5016.92,
        "end": 5027.92
    },
    {
        "text": " es un poquito más de una hora y media, que se más tarde y voy a terminar capaz que menos",
        "start": 5027.92,
        "end": 5034.08
    },
    {
        "text": " 4 o menos 10, 4, la multiplicidad geométrica de roo, como valor de propio de A es 1, a ver,",
        "start": 5034.08,
        "end": 5059.88
    },
    {
        "text": " purices para que no nos confundamos, yo sé que a veces pongo estas pausa que alarga las",
        "start": 5059.88,
        "end": 5065.06
    },
    {
        "text": " demostraciones, pero a mí me interesa que estas pausa sean sirvo en derrazo enamiento.",
        "start": 5065.06,
        "end": 5070.64
    },
    {
        "text": " El objetivo es este, el próximo objetivo de trapar, es este, está, de que sea simple,",
        "start": 5070.64,
        "end": 5081.12
    },
    {
        "text": " la métable, o sea, aquí lo decía, la métablemente no, esto nos ayuda, pero esto no prueba que",
        "start": 5081.12,
        "end": 5085.6
    },
    {
        "text": " ¿de verdad? Acá te dice la multiplicidad geométrica, es uno, vos queremos la algebraica,",
        "start": 5085.6,
        "end": 5091.320000000001
    },
    {
        "text": " ¿cuál es siempre la más grande? Entre la geométrica y la algebraica. La geométrica",
        "start": 5091.320000000001,
        "end": 5095.4800000000005
    },
    {
        "text": " puede ser más grande. Entonces, lo que vas atrapando es la geométrica, pero esta nos va",
        "start": 5095.4800000000005,
        "end": 5100.58
    },
    {
        "text": " a ayudar a atrapar las geométricas. Bueno, entonces, dice así, hacemos la de matrasioncita",
        "start": 5100.58,
        "end": 5117.64
    },
    {
        "text": " de 4 que chiquita también. Sí, sí, sí, o sea, Santiago, lo dijimos incluso cuando arrancamos",
        "start": 5117.64,
        "end": 5129.74
    },
    {
        "text": " el capítulo. ¿Por qué tenía sentido en los cono? Puse cono positivo. El hecho de que",
        "start": 5129.74,
        "end": 5134.66
    },
    {
        "text": " hace a mayor igual que 0 es exactamente lo mismo que decir que deja variante cono positivo.",
        "start": 5134.66,
        "end": 5140.62
    },
    {
        "text": " Bueno, ¿qué tenemos ahora? Tenemos un vector en el interior del cono, o sea, porque",
        "start": 5140.62,
        "end": 5150.0599999999995
    },
    {
        "text": " es un vector positivo, acabamos de probar el surrato que es positivo, por lo tanto",
        "start": 5150.0599999999995,
        "end": 5152.86
    },
    {
        "text": " está en el interior del cono. En el cono positivo canónico, este de las coordenadas",
        "start": 5152.86,
        "end": 5157.58
    },
    {
        "text": " a mayor igual que 0, las paredes es cuando alguna coordenada es 0, ¿no? Las fronteras",
        "start": 5157.58,
        "end": 5162.46
    },
    {
        "text": " cuando alguna de las coordenadas es 0. Como nuestro vector, tenía todas las coordenadas",
        "start": 5162.46,
        "end": 5166.2
    },
    {
        "text": " a mayor que 0 es interior. Este es un vector propio asociado a Rho. Bien, supongamos, bien,",
        "start": 5166.2,
        "end": 5183.4
    },
    {
        "text": " que bonito. Supongamos que existe un otro vector propio, que este U, perteneciente",
        "start": 5183.4,
        "end": 5188.46
    },
    {
        "text": " a B, otro vector propio asociado a Rho. Si yo quiero probar que la multiplicidad geométrica",
        "start": 5188.46,
        "end": 5201.799999999999
    },
    {
        "text": " 1 y tengo otro vector propio asociado a Rho, tienen que terminar siendo coliniales. Eso",
        "start": 5201.799999999999,
        "end": 5208.2
    },
    {
        "text": " es lo que tengo que probar, para el punto 4, para lograr el punto 4 si tienes otro,",
        "start": 5208.2,
        "end": 5215.28
    },
    {
        "text": " tiene que ser colinial. Y eso es lo que vamos a probar, ¿por qué pasa? Por un lado y su",
        "start": 5215.28,
        "end": 5223.48
    },
    {
        "text": " N, ¿cómo jugamos con el y su N en masa? Esa es la segunda vez que jugamos con y su N",
        "start": 5223.48,
        "end": 5227.84
    },
    {
        "text": " en masa, ¿cómo le estamos aprovechando? Y su N en masa por U, esto es 1 más Rho por",
        "start": 5227.84,
        "end": 5234.179999999999
    },
    {
        "text": " U, pero su N en masa por B, por supuesto es 1 más Rho por B, pero su N en masa aplicado,",
        "start": 5234.18,
        "end": 5248.900000000001
    },
    {
        "text": " voy a usar el teorema que no demostramos en este momento. Ese teorema que no demostramos",
        "start": 5248.900000000001,
        "end": 5256.22
    },
    {
        "text": " tenía una hipótesis que era propiamente invariante, que yo subracían rojo. Ese hipótesis,",
        "start": 5256.22,
        "end": 5264.780000000001
    },
    {
        "text": " me pide probar que al cono, excepto el cero, sacándole el vectonulo, lo manda adentro",
        "start": 5264.780000000001,
        "end": 5276.26
    },
    {
        "text": " al interior. Bueno, esto es uno de los ejercicios del práctico 9, ¿vale? Y bastante sencillo,",
        "start": 5276.26,
        "end": 5289.9800000000005
    },
    {
        "text": " si quieren lo podemos hacer acá, pero digamos, o sea, el interior del cono son los vectores,",
        "start": 5289.9800000000005,
        "end": 5297.18
    },
    {
        "text": " se lo dijimos recién, ¿no? Que tienen todas las coordenadas positivas. Esa es si yo,",
        "start": 5297.18,
        "end": 5305.900000000001
    },
    {
        "text": " así es una cuantita ahí con el, no se preocupa eso, eso queda como ejercicio y ustedes",
        "start": 5305.900000000001,
        "end": 5313.14
    },
    {
        "text": " lo van a saber hacer rápidamente. Pero entonces fíjense que no lo estoy aplicando el teorema",
        "start": 5313.14,
        "end": 5318.42
    },
    {
        "text": " para la matriz, lo estoy aplicando para la matriz y su N en masa, ¿vale? O sea, el teorema",
        "start": 5318.42,
        "end": 5325.58
    },
    {
        "text": " que nos demostramos es lo usamos como técnico de apoyo para la matriz y su N en masa,",
        "start": 5325.58,
        "end": 5333.82
    },
    {
        "text": " resulta que en ese caso como transforma el cono, forma propia, propiamente adentro del interior,",
        "start": 5333.82,
        "end": 5341.62
    },
    {
        "text": " ¿sí? Entonces resulta que decía una de las cosas que se ganaban en ese teorema que",
        "start": 5341.62,
        "end": 5347.3
    },
    {
        "text": " el valor propio es simple. Pero acá hay un detalle muy importante, ¿a qué es esto",
        "start": 5347.3,
        "end": 5352.3
    },
    {
        "text": " es evidente? Que esta parte va dentro del casero, se la puse en el práctico, pero esto",
        "start": 5352.3,
        "end": 5356.1
    },
    {
        "text": " es evidente, una hace la cuantita y, inmediatamente, tiene que quedar acá, porque el IZN, el identidad",
        "start": 5356.1,
        "end": 5364.14
    },
    {
        "text": " te deja las mismas coordenadas y viene la y las multiplica y suma, ¿no? Pero acá la",
        "start": 5364.14,
        "end": 5370.26
    },
    {
        "text": " cuanta van a ver que ahora bien, en ese teorema el valor propio es simple, el valor propio",
        "start": 5370.26,
        "end": 5376.900000000001
    },
    {
        "text": " es que va el propio y ahí es a la segunda parte del ejercicio del práctico 9, el valor",
        "start": 5376.9,
        "end": 5382.42
    },
    {
        "text": " propio asociado al radio espectral de esa matriz, pero resulta, úrice que no es nada difícil",
        "start": 5382.42,
        "end": 5389.0199999999995
    },
    {
        "text": " probar que el radio espectral de la matriz y su N en masa, ojo con la notación, acá",
        "start": 5389.0199999999995,
        "end": 5394.42
    },
    {
        "text": " nos estoy poniendo ropo y suene masa, pongan por favor, el radio espectral de la matriz",
        "start": 5394.42,
        "end": 5400.339999999999
    },
    {
        "text": " y suene masa, esta la notación correcta, pero como se puede confundir con ropo y suene",
        "start": 5400.339999999999,
        "end": 5404.78
    },
    {
        "text": " masa, el radio espectral de suene masa es justamente uno más roo, uno más el radio espectral",
        "start": 5404.78,
        "end": 5413.219999999999
    },
    {
        "text": " de la, pero eso es por las condiciones en que estábamos, mayor igual que cierto, es bastante",
        "start": 5413.219999999999,
        "end": 5417.179999999999
    },
    {
        "text": " sencillo, lo puse en la parte 2 del ejercicio del práctico, no es difícil para nada y es",
        "start": 5417.179999999999,
        "end": 5422.86
    },
    {
        "text": " creíble, pero hay que hacer, ¿no? Entonces decía el teorema que nos está abrando que",
        "start": 5422.86,
        "end": 5429.099999999999
    },
    {
        "text": " este es simple, pero miren lo acá está, este es un valor mejor propio asociado a uno",
        "start": 5429.1,
        "end": 5440.06
    },
    {
        "text": " más roo, este es un valor propio asociado a uno más roo, para la matriz y suene masa,",
        "start": 5440.06,
        "end": 5447.56
    },
    {
        "text": " pero esta matriz, según el teorema tiene valor propio, simple, en particular la multiplicidad",
        "start": 5447.56,
        "end": 5453.820000000001
    },
    {
        "text": " de la arquivera de cae es una, la multiplicidad geométrica es uno, por lo tanto huy beso",
        "start": 5453.82,
        "end": 5457.82
    },
    {
        "text": " en colineales, quédale lo que queríamos probar y tenemos probado 4, está muy bueno, y ahora",
        "start": 5457.82,
        "end": 5475.54
    },
    {
        "text": " así en 2 reglones se termina 5 y se termina todo el teorema, no quiero borrar esta parte",
        "start": 5475.54,
        "end": 5483.94
    },
    {
        "text": " lema técnico 3 porque es el momento que lo vamos a usar esa hora, así que el aumento",
        "start": 5483.94,
        "end": 5489.26
    },
    {
        "text": " voy a borrar la hipóste si es por un fromenio, 5 y última parte roo valor propio, simple",
        "start": 5489.26,
        "end": 5503.26
    },
    {
        "text": " y la demostración cita de esto, consideramos, consideramos, considerar entonces la matriz",
        "start": 5503.26,
        "end": 5524.820000000001
    },
    {
        "text": " p1 sobre roo por rá y bueno la notación de siempre p a la q la voy a notar como p es",
        "start": 5524.82,
        "end": 5538.82
    },
    {
        "text": " bj q, los coeficiente los sanatos a manera, bueno claro que p a la q por un lado es 1 sobre",
        "start": 5538.82,
        "end": 5551.78
    },
    {
        "text": " roo a la q por rá a la q, y ahora por el lema técnico 3 por el lema técnico 3 se le",
        "start": 5551.78,
        "end": 5566.82
    },
    {
        "text": " imite, pudimos seguir al medio, resulta que p es bj q, entonces que es 1 sobre roo a la q por rá",
        "start": 5566.82,
        "end": 5578.179999999999
    },
    {
        "text": " a su bj q, ok, es menor igual, acá aparece, el matriz p1 sobre roo a la q por c por roo a la q",
        "start": 5578.179999999999,
        "end": 5594.139999999999
    },
    {
        "text": " esto para todo como yo digo el p es 0, por lo tanto lo que estamos diciendo es",
        "start": 5597.7,
        "end": 5605.7
    },
    {
        "text": " bueno, ahí está, y ahora para el cierre ya usé el lema técnico 3, voy a poner una",
        "start": 5610.7,
        "end": 5624.62
    },
    {
        "text": " afirmación y me encantaría, hasta me voy feliz si me dicen por qué, pero ojo, no hay que",
        "start": 5624.62,
        "end": 5630.7
    },
    {
        "text": " remontarse la única pista que no hay que remontarse a las últimas clases, hay que remontarse a todo el",
        "start": 5630.7,
        "end": 5637.58
    },
    {
        "text": " curso, no, entonces fíjense, una cosa obviamente es el entonces, ¿cuál es un valor propio obvio",
        "start": 5637.58,
        "end": 5652.0599999999995
    },
    {
        "text": " de pebo? ¿Cuál es el valor propio de A? Era roo y vi un roo, valor propio de peo es 1,",
        "start": 5652.06,
        "end": 5661.9400000000005
    },
    {
        "text": " tá, entonces unos valor propio de peo, bien, bien, pero o sea, o no, bueno, uno es valor propio de peo,",
        "start": 5661.9400000000005,
        "end": 5672.34
    },
    {
        "text": " obviamente, muy bien, yo lo que digo y esto está cuenta cuanto a digo, grise, se las estoy simplificando",
        "start": 5672.34,
        "end": 5680.9800000000005
    },
    {
        "text": " lo máximo posible, esta última cuenta se fue roo a la cú, se fue roo a la cú, te quedó",
        "start": 5680.98,
        "end": 5684.98
    },
    {
        "text": " sé esto, ¿no? O sea, ¿cómo te quedan los coeficientes pedes, pues su hijo te ha la cú?",
        "start": 5684.98,
        "end": 5689.98
    },
    {
        "text": " Minores igual a que sé, todos, mi no es igual a que sé, siempre, para todo cú, entonces,",
        "start": 5689.98,
        "end": 5700.419999999999
    },
    {
        "text": " yo lo que afirmo es que la multiplicidad geometrica de 1 es igual a la multiplicidad que",
        "start": 5700.419999999999,
        "end": 5706.339999999999
    },
    {
        "text": " hay que adecuarlo, para peor, ¿por qué? A ver quién se aguarda,",
        "start": 5706.34,
        "end": 5714.1
    },
    {
        "text": " que pueden citar dos cosas distintas y las dos están bien, te van imparentadas entre sí, ¿no?",
        "start": 5714.1,
        "end": 5723.7
    },
    {
        "text": " Por supuesto, no es de la primera, de la segunda mitad del curso, de la primera mitad del",
        "start": 5723.7,
        "end": 5737.38
    },
    {
        "text": " curso, ¿se acuerdan lo de las matrices acotadas? O perfectamente, ¿qué matrices, qué potencia",
        "start": 5737.38,
        "end": 5753.139999999999
    },
    {
        "text": " matrices tenían límites? Pero se acuerdan lo que hicimos después, ¿cuáles son las matrices",
        "start": 5753.14,
        "end": 5757.38
    },
    {
        "text": " acotadas? ¿qué matrices son acotadas? ¿cuales caractericen ustedes las matrices acotadas?",
        "start": 5757.38,
        "end": 5764.3
    },
    {
        "text": " Bueno, bueno, para, lo único que sabemos acá en principio es que son acotadas, no sabemos",
        "start": 5764.3,
        "end": 5779.9800000000005
    },
    {
        "text": " que tengan límites, pero se acuerdan que hicimos todo el análisis para que tengan límites",
        "start": 5779.98,
        "end": 5783.62
    },
    {
        "text": " y ejercicio después todo el análisis, la caracterización de las acotadas, ¿quieras casi",
        "start": 5783.62,
        "end": 5789.099999999999
    },
    {
        "text": " iguales que la utilidad límite, solo que le permitíamos alguna posibilidad más en el",
        "start": 5789.099999999999,
        "end": 5795.9
    },
    {
        "text": " que el... Exactamente, pero sí se acuerdan de esto, que la multiplicidad geometria que la",
        "start": 5795.9,
        "end": 5810.7
    },
    {
        "text": " que habría que conseguir, porque si no podíamos tener, ah, ya no me acuerdo ahora, hasta",
        "start": 5810.7,
        "end": 5817.74
    },
    {
        "text": " yo me olvides de la caracterización. Entonces acá estamos usando la caracterización",
        "start": 5817.74,
        "end": 5823.0199999999995
    },
    {
        "text": " de matrices acotadas, tendría que haberlo traído, no lo hice, pido disculpa y explicar",
        "start": 5823.02,
        "end": 5831.34
    },
    {
        "text": " acá, colocar cuál fue la caracterización que hicimos juntos, aparecen prácticamente.",
        "start": 5831.34,
        "end": 5837.580000000001
    },
    {
        "text": " Bueno, entonces, gurices tenemos que la multiplicidad geometrica de uno para, es igual a multiplicidad",
        "start": 5837.580000000001,
        "end": 5842.900000000001
    },
    {
        "text": " y que habría que haber que haber de uno, todo para P y ya está, ¿por qué pasa? La multiplicidad",
        "start": 5842.900000000001,
        "end": 5848.860000000001
    },
    {
        "text": " geometrica de uno para P, voy a notar así, para que se entiende que estoy usando para P,",
        "start": 5848.86,
        "end": 5854.38
    },
    {
        "text": " es igual a la multiplicidad algebraica para P de uno, pero a la multiplicidad geometrica",
        "start": 5854.38,
        "end": 5860.219999999999
    },
    {
        "text": " de esto, a la multiplicidad geometrica para derró y esto es la multiplicidad algebraica para",
        "start": 5860.219999999999,
        "end": 5868.66
    },
    {
        "text": " derró, porque una es, una es sobre derró por la otra. Entonces, en definitiva la multiplicidad",
        "start": 5869.66,
        "end": 5880.3
    },
    {
        "text": " algebraica para derró es su. Y color incolorado, tenemos probado esto, tenemos probado esto. Y bueno,",
        "start": 5880.3,
        "end": 5891.98
    },
    {
        "text": " faltó hacer tres, cuatro, cinco, pero son conclusiones rápidas a partir de los difíciles",
        "start": 5891.98,
        "end": 5899.7
    },
    {
        "text": " de la unidos y logramos, sobre todo logramos uno, quería terminar el teorema, quería terminar",
        "start": 5899.7,
        "end": 5909.139999999999
    },
    {
        "text": " el curso por lo menos logrando uno que es el famoso teorema de Google, me quedó gurices,",
        "start": 5909.139999999999,
        "end": 5916.58
    },
    {
        "text": " otras versiones de Perrón, pero ven, me quedó, matríces esto cástica, me quedó grafos, me quedó",
        "start": 5916.94,
        "end": 5924.46
    },
    {
        "text": " un montón de matemáticas, la en el curso del año que viene, que voy a dar las otras matemáticas,",
        "start": 5924.46,
        "end": 5929.3
    },
    {
        "text": " para ver otros cursos en 2024, que voy a usar todo el material general con ustedes de Urise.",
        "start": 5930.58,
        "end": 5935.98
    },
    {
        "text": " Es menos igual a c, y c es mayor a cero, entonces tiene a cero, digamos, menos igual a cero,",
        "start": 5946.58,
        "end": 5954.82
    },
    {
        "text": " pero c, no, no, no, no, cada entrada para todo c, acá está c, acá está cero, todas las",
        "start": 5954.82,
        "end": 5964.86
    },
    {
        "text": " entradas están por acá, un de igual que un c, no, cesta fijo, cesta fijo, ese que encontramos,",
        "start": 5964.86,
        "end": 5975.78
    },
    {
        "text": " se quien era, era el máximo de los conscientes de Ibejota, y ve esta fijo, quien era V,",
        "start": 5975.78,
        "end": 5983.139999999999
    },
    {
        "text": " el valor propio que encontramos fijo y que probamos que todas las coordenadas eran positivas,",
        "start": 5983.139999999999,
        "end": 5987.46
    },
    {
        "text": " por eso pudimos dividir, etcétera. Urise es un placer, sé que el curso continúa",
        "start": 5987.46,
        "end": 5995.62
    },
    {
        "text": " en lunes, el bienes con la clase de consulta, que el parcial también es parte del curso, etcétera,",
        "start": 5995.62,
        "end": 6001.94
    },
    {
        "text": " etcétera, pero fue un placer trabajar con ustedes, espero les haya servido.",
        "start": 6001.94,
        "end": 6006.7
    }
]