[
    {
        "text": " Hoy vamos a arrancar con el bloque de macro con nosotros. Vamos a hacer una pequeña presentación",
        "start": 0.0,
        "end": 23.12
    },
    {
        "text": " para tener una idea de qué es el panorama de estas 6-7 clases que vamos a tener de este bloque.",
        "start": 23.12,
        "end": 30.12
    },
    {
        "text": " Si el curso siempre está organizado aproximadamente en 6-7 clases todos los bloques.",
        "start": 30.12,
        "end": 37.120000000000005
    },
    {
        "text": " Bien, entonces vamos a presentar ahora de qué se trata esto y vamos a arrancar a ver una parte de eso.",
        "start": 37.120000000000005,
        "end": 46.120000000000005
    },
    {
        "text": " La macro economía va a estudiar algunos de los temas más con un contenido teórico,",
        "start": 47.12,
        "end": 53.12
    },
    {
        "text": " vamos a salir un poco de la parte más descriptiva, indicadores de ver cómo leemos cierta información,",
        "start": 53.12,
        "end": 58.12
    },
    {
        "text": " aponerlo un poco de interpretación conceptual a esos indicadores.",
        "start": 58.12,
        "end": 62.12
    },
    {
        "text": " Pero la idea es que haya un hilo conductor entre los distintos bloques del curso.",
        "start": 62.12,
        "end": 65.12
    },
    {
        "text": " Por eso vamos a retomar a algunas cuestiones.",
        "start": 65.12,
        "end": 68.12
    },
    {
        "text": " Entonces si yo les digo por ejemplo PBI, ¿qué era esto que ustedes habían visto en descripción?",
        "start": 69.12,
        "end": 75.12
    },
    {
        "text": " ¿A qué refiere el PBI? ¿Qué nos mide?",
        "start": 75.12,
        "end": 80.12
    },
    {
        "text": " ¿El qué?",
        "start": 93.12,
        "end": 94.12
    },
    {
        "text": " ¿Consumo de bienes?",
        "start": 95.12,
        "end": 97.12
    },
    {
        "text": " Lo que produce el país, PBI es producto gruto interno como que mide valor de los bienes producidos por un país.",
        "start": 99.12,
        "end": 106.12
    },
    {
        "text": " Entonces si mide lo producido por un país nos va a servir para medir una variable importante que es el crecimiento económico.",
        "start": 106.12,
        "end": 115.12
    },
    {
        "text": " El crecimiento económico es una variable macroeconómica, ahora después vamos a tratar de después que veamos algunas de estas variables,",
        "start": 116.12,
        "end": 124.12
    },
    {
        "text": " a ver qué es lo que tienen en común, pero es una variable macroeconómica que lo que nos dice es que le pasó el país en términos de producción.",
        "start": 124.12,
        "end": 131.12
    },
    {
        "text": " Obtuvo más o menos producción que el año anterior.",
        "start": 131.12,
        "end": 135.12
    },
    {
        "text": " PBI te se acuerdas que se mide todos los años, entonces año calendario, por lo tanto vamos a tener una medida de crecimiento económico.",
        "start": 135.12,
        "end": 143.12
    },
    {
        "text": " La macroeconómica, unas de las tres cosas que va a estudiar es y acá es lo que les decía, vamos a usar el PBI, vamos a usar los distintos indicadores,",
        "start": 144.12,
        "end": 152.12
    },
    {
        "text": " pero vamos a ver por qué ese PBI puede subir o bajar, o sea cual son las causas, vamos a ponerle contenido a esa parte.",
        "start": 152.12,
        "end": 159.12
    },
    {
        "text": " Y este es uno de las preocupaciones de la macroeconómica.",
        "start": 160.12,
        "end": 165.12
    },
    {
        "text": " Hay otra que también la podemos asimilar a uno de los indicadores que ustedes ya vieron, que es el IPC y este otro que mide de un país.",
        "start": 166.12,
        "end": 178.12
    },
    {
        "text": " Indicador de qué era este? De los precios.",
        "start": 179.12,
        "end": 187.12
    },
    {
        "text": " Entonces este indicador nos va a estar midiendo qué pasa con los precios de una economía y eso hay otra variable también en la vuelta.",
        "start": 187.12,
        "end": 199.12
    },
    {
        "text": " ¿Qué pasa con los precios? No se está dando una señal de qué variable.",
        "start": 200.12,
        "end": 204.12
    },
    {
        "text": " De la inflación y la inflación es otra de las variables macroeconómicas.",
        "start": 205.12,
        "end": 211.12
    },
    {
        "text": " Que la teoría macroeconómica le va a buscar explicaciones de por qué los países tienen más o tienen menos inflación.",
        "start": 216.12,
        "end": 223.12
    },
    {
        "text": " Y una tercera. ¿Qué son estas variables? ¿Para qué nos sirven? ¿Para me dir qué cosa?",
        "start": 224.12,
        "end": 240.12
    },
    {
        "text": " El mercado de trabajo y hay una tercera variable que es la tercera preocupación macroeconómica que es la cuestión del empleo o si lo pensamos desde la mirada más comunicativa de preocupaciones de desemple.",
        "start": 241.12,
        "end": 256.12
    },
    {
        "text": " La macroeconómica entonces nace como una disciplina que tiene en su norte estudiar estas tres cosas.",
        "start": 258.12,
        "end": 264.12
    },
    {
        "text": " Tienes grandes preocupaciones que hacen a un país, por eso son variables agregadas.",
        "start": 265.12,
        "end": 271.12
    },
    {
        "text": " Estas tres variables tienen en común que es la idea de la macroeconómica variables agregadas.",
        "start": 271.12,
        "end": 280.12
    },
    {
        "text": " A diferencia de lo que podrían ser variables individuales y este agregadas lo vamos a asociar a un país.",
        "start": 281.12,
        "end": 298.12
    },
    {
        "text": " Cuando nosotros nos refiramos a algún término macro es algo que es agregado, porque son variables preocupaciones que hacen a todo el país.",
        "start": 299.12,
        "end": 310.12
    },
    {
        "text": " Cuando hablamos de crecimiento económico es el país, está creciendo, está produciendo más bien en sus servicios.",
        "start": 310.12,
        "end": 317.12
    },
    {
        "text": " No estamos mirando si en ese que le pasó al país hay algunas empresas que producen más, otras que producen menos, que además puede pasar.",
        "start": 318.12,
        "end": 325.12
    },
    {
        "text": " Cuando Uruguay crece hay algunos sectores, algunas empresas que le están yendo más y otras bien.",
        "start": 325.12,
        "end": 330.12
    },
    {
        "text": " La macroeconómica no se va a preocupar de eso de aquí en el leo a mala, de aquí en el leo a bien, sino que se va a preocupar de que a nivel agregado de que el país crezca.",
        "start": 330.12,
        "end": 338.12
    },
    {
        "text": " Esa es la preocupación de la macro, capaz que hay otros que se van a dedicar a estudiar otra cosa, a ver por qué dentro de ese contexto global hay unos que les va mejor y otros que les va más.",
        "start": 339.12,
        "end": 350.12
    },
    {
        "text": " Pero la macroeconómica no le va a estudiar, por eso la mirada de los problemas macroeconómicos son tres miradas bien globales, agregadas, global refiere a eso.",
        "start": 350.12,
        "end": 360.12
    },
    {
        "text": " Y en nuestro curso vamos a hacer mucha referencia a que esto global sea Uruguay, sea el país para que esté un poco más aplicado y en algún caso podamos traer algún dato o alguna idea de cosas que están pasando.",
        "start": 360.12,
        "end": 371.12
    },
    {
        "text": " Por si alguno lo ve y para definir por diferencia, esto es de la macro, es distinto a las variables microeconómicas que cuando uno quiere estudiar a nivel individual, por ejemplo una empresa o a un consumidor, y ahí están las teorías microeconómicas.",
        "start": 371.12,
        "end": 387.12
    },
    {
        "text": " ¿Quiénes de ustedes vieron algún curso de economía a nivel del ICE o capaz quisieron en otra facultad?",
        "start": 388.12,
        "end": 393.12
    },
    {
        "text": " Nunca nadie, tema de mercados, de oferta de manda, eso escucharon alguna vez, análisis de mercados, eso es típicamente el análisis micro.",
        "start": 398.12,
        "end": 409.12
    },
    {
        "text": " La microeconomía va a estudiar individualmente a los agentes económicos más allá que después para sacar conclusiones, siempre la micro también va a querer ir a algo agregado, pero básicamente analiza el concepto de un mercado y el concepto de un mercado se conforma de una oferta, una demanda y un precio.",
        "start": 410.12,
        "end": 433.12
    },
    {
        "text": " En un mercado cualquiera, y puede ser una mirada micro, una mirada macro, en un mercado quienes quieren ofrecer, vender algo, hay quienes quieren demandar algo, comprarlo, y en ese juego entre quienes quieren vender y quienes quieren comprar es que se va a determinar a que precio se va a hacer esa transacción de todas las cantidades que se vendan y se compre.",
        "start": 434.12,
        "end": 460.12
    },
    {
        "text": " Bien, entonces, temas macroeconomicos, acá tenemos tres grandes, pero después van a ver otros también, ustedes vieron cuestiones en descripción de balanza de pagos, ¿no? Cuenta corrientes, portaciones, importaciones, esos conceptos también van a estar acá, porque son parte, por ejemplo, de explicar, porque un país puede crecer, entonces van a estar arriba de la mesa, muchas de esas variables, y estas también tienen esa",
        "start": 460.12,
        "end": 461.12
    },
    {
        "text": " idea de que ese punto en común con las que pusimos acá en el pizarrón, que refieren a variables agregadas, cuando hablamos de exportaciones, más allá hay capas que en descripción habieron, ¿no? ¿Cuáles son los sectores o los bienes más exportados? Acá vamos a hablar del global, y la balanza de pagos es un indicador global, ¿no? ¿cuánto es portador y guay? ¿la cuenta con todo lo que importó? Hay otras variables también, que son las cuentas fiscales, por ejemplo, el concepto de déficit fiscal, este también es un concepto agregado, ¿no? ¿no? ¿no? ¿no? ¿no? ¿no? ¿no? ¿no? ¿no? ¿no? ¿no? ¿no? ¿no? ¿no? ¿no? ¿no? ¿no? ¿no? ¿no? ¿no? ¿no? ¿no? ¿no? ¿no? ¿no",
        "start": 490.12,
        "end": 520.12
    },
    {
        "text": " ¿no? ¿no? ¿no? ¿no? ¿no? ¿no? ¿no? ¿no? ¿no? ¿no? ¿no?",
        "start": 520.12,
        "end": 550.12
    },
    {
        "text": " cosas que podemos ver tiene determinadas explicaciones.",
        "start": 550.12,
        "end": 554.08
    },
    {
        "text": " Y vamos a utilizar una herramienta de análisis que es la que se denomina el modelo de oferta",
        "start": 554.08,
        "end": 564.24
    },
    {
        "text": " y demanda agregado.",
        "start": 564.24,
        "end": 565.36
    },
    {
        "text": " Un modelo, ¿no?",
        "start": 565.36,
        "end": 572.48
    },
    {
        "text": " Esta es una herramienta para uno, sintetizar ideas, ver cómo funcionan y sacar conclusiones",
        "start": 572.48,
        "end": 578.44
    },
    {
        "text": " a partir de eso.",
        "start": 578.44,
        "end": 581.2
    },
    {
        "text": " La macroeconomía es una disciplina de la ciencia económica, ¿no?",
        "start": 581.2,
        "end": 591.0400000000001
    },
    {
        "text": " Que nace en los 30 con este señor que si nunca hicieron ningún curso de economía, seguramente",
        "start": 591.0400000000001,
        "end": 601.12
    },
    {
        "text": " tampoco lo ya les escuchaba.",
        "start": 601.12,
        "end": 604.1600000000001
    },
    {
        "text": " Que nace en los 30 empiezan a elaborar la economía con esta lógica de ver estos problemas",
        "start": 604.16,
        "end": 612.8399999999999
    },
    {
        "text": " macroeconómicos.",
        "start": 612.8399999999999,
        "end": 614.8399999999999
    },
    {
        "text": " Se escapa un poco lo que era la corriente de pensamiento de cómo se planteaba ese estudio",
        "start": 614.8399999999999,
        "end": 619.3199999999999
    },
    {
        "text": " y por eso en los 30 y además en los 30, ¿no?",
        "start": 619.3199999999999,
        "end": 622.56
    },
    {
        "text": " 1929 crisis económica muy grande.",
        "start": 622.56,
        "end": 626.3199999999999
    },
    {
        "text": " Este planteo toma mucha fuerza.",
        "start": 626.3199999999999,
        "end": 629.28
    },
    {
        "text": " Este planteo después en los 60 lo retoma en otros autores que son los que se denominan",
        "start": 629.28,
        "end": 635.0
    },
    {
        "text": " de la síntesis neoclásica.",
        "start": 635.0,
        "end": 643.16
    },
    {
        "text": " Y estos autores son los que de alguna manera nos definen este modelo de oferta y demanda.",
        "start": 643.16,
        "end": 648.8399999999999
    },
    {
        "text": " Que tiene el planteo que inician y que tiene otros planteos un poco más modernos.",
        "start": 648.8399999999999,
        "end": 654.0799999999999
    },
    {
        "text": " Nosotros lo que vamos a estar desarrollando para analizar estos problemas macroeconómicos",
        "start": 654.0799999999999,
        "end": 659.0
    },
    {
        "text": " pero en realidad para tirar arriba de la mesa una serie de ideas y de cómo se relacionan",
        "start": 659.0,
        "end": 664.32
    },
    {
        "text": " las diferentes variables macroeconómicas, vamos a apoyarnos en esta herramienta.",
        "start": 664.32,
        "end": 669.16
    },
    {
        "text": " Entonces vamos a ir recorriendo.",
        "start": 669.16,
        "end": 670.92
    },
    {
        "text": " Hoy por ejemplo vamos a arrancar con una parte de esta herramienta que es la parte de",
        "start": 670.92,
        "end": 674.4
    },
    {
        "text": " la oferta.",
        "start": 674.4,
        "end": 675.88
    },
    {
        "text": " Después de una clase vamos a ver la demanda.",
        "start": 675.88,
        "end": 679.04
    },
    {
        "text": " Seí cómo funciona que hay ahí adentro que las variables interrelación.",
        "start": 679.04,
        "end": 683.2
    },
    {
        "text": " Después vamos a ver juntas y ahí podríamos decir estamos con el juego ese de oferti",
        "start": 683.2,
        "end": 687.52
    },
    {
        "text": " de mando.",
        "start": 687.52,
        "end": 688.52
    },
    {
        "text": " Y después le vamos a agregar algunas cosas más modernas.",
        "start": 689.24,
        "end": 693.64
    },
    {
        "text": " Algunas conceptos o ideas más modernas que van a ser algunos elementos que este modelo",
        "start": 693.64,
        "end": 700.36
    },
    {
        "text": " no los tiene pero que para entender por ejemplo si a cada hicimos balanza de pagos, de",
        "start": 700.36,
        "end": 704.96
    },
    {
        "text": " fiscizcales, bueno, hablemos de interpretaciones más cercanas en el tiempo de cómo se financia",
        "start": 704.96,
        "end": 710.76
    },
    {
        "text": " en de fiscizcales, cómo es que funciona en los sistemas cambiarios, el tema del tipo",
        "start": 710.76,
        "end": 715.48
    },
    {
        "text": " de cambio, el dólar, todo eso.",
        "start": 715.48,
        "end": 718.8000000000001
    },
    {
        "text": " Entonces, ¿cómo nos vamos a organizar en estas clases?",
        "start": 718.8000000000001,
        "end": 722.24
    },
    {
        "text": " Este ejercicio de analizar el modelo oferti de manda nos va a llegar a que justamente",
        "start": 722.24,
        "end": 728.04
    },
    {
        "text": " pensemos en términos de mercados muchas cosas.",
        "start": 728.04,
        "end": 731.24
    },
    {
        "text": " Entonces por ejemplo vamos a analizar primero el mercado de bienes y servicios.",
        "start": 731.24,
        "end": 736.52
    },
    {
        "text": " ¿Sí?",
        "start": 736.52,
        "end": 739.52
    },
    {
        "text": " Vamos a empezar en la clase hoy a analizar la oferta agregada.",
        "start": 739.52,
        "end": 743.12
    },
    {
        "text": " ¿Sí?",
        "start": 743.12,
        "end": 744.12
    },
    {
        "text": " ¿Por qué?",
        "start": 744.12,
        "end": 745.12
    },
    {
        "text": " Porque el mercado de bienes y servicios, esto del PBI, ¿no?",
        "start": 745.12,
        "end": 748.16
    },
    {
        "text": " Asociado del PBI, PBI, valor de los bienes y servicios producidos.",
        "start": 748.16,
        "end": 751.92
    },
    {
        "text": " Entonces vamos a tratar analizar cómo que funciona eso, cómo funcionan, quiénes ofrecen",
        "start": 751.92,
        "end": 756.4
    },
    {
        "text": " la producción, cuáles son sus factores, lo que lo lleva que produzca, puedan producir",
        "start": 756.4,
        "end": 761.08
    },
    {
        "text": " más o puedan producir menos y después también en la parte de la demanda.",
        "start": 761.08,
        "end": 767.28
    },
    {
        "text": " Lo mismo, quiénes son los que demandan los bienes, cuáles son las variables que influyen",
        "start": 767.28,
        "end": 771.6
    },
    {
        "text": " en sus decisiones.",
        "start": 771.6,
        "end": 773.72
    },
    {
        "text": " Y vamos a empezar a plantearnos a cabo que lo vamos ir retomando clase a clase, cierta",
        "start": 773.72,
        "end": 778.4
    },
    {
        "text": " nomenclatura.",
        "start": 778.4,
        "end": 779.4
    },
    {
        "text": " Vamos a llamarle Q al PBI.",
        "start": 779.4,
        "end": 782.48
    },
    {
        "text": " Q es la producción del país.",
        "start": 782.48,
        "end": 784.64
    },
    {
        "text": " Sí, en esta lógica de que miramos un país, variables agregadas, Q, cuando pongamos",
        "start": 784.64,
        "end": 790.84
    },
    {
        "text": " Q en el pizarro vamos a estar hablando de la producción del país, de toda la producción",
        "start": 790.84,
        "end": 794.84
    },
    {
        "text": " del país.",
        "start": 794.84,
        "end": 795.84
    },
    {
        "text": " ¿Qué vamos?",
        "start": 795.84,
        "end": 796.84
    },
    {
        "text": " ¿Cómo dijimos?",
        "start": 796.84,
        "end": 797.84
    },
    {
        "text": " Por el lado de la oferta, ¿de quiénes producen esos bienes?",
        "start": 797.84,
        "end": 800.6
    },
    {
        "text": " Por el lado de los que la demanda.",
        "start": 800.6,
        "end": 802.52
    },
    {
        "text": " Y lo que vamos a tener es QPBI, ¿no?",
        "start": 802.52,
        "end": 805.28
    },
    {
        "text": " Y acabamos a tener a P. Y PBI va a ser el IPC.",
        "start": 805.28,
        "end": 809.48
    },
    {
        "text": " El resultante de este juego en el mercado de bienes y servicios de un país, entre Opharte",
        "start": 809.48,
        "end": 814.0799999999999
    },
    {
        "text": " y demanda, entre quienes producen y quienes quieren comprar esos bienes va a surgir",
        "start": 814.0799999999999,
        "end": 820.36
    },
    {
        "text": " cuál es el nivel de precios que se transan el mercado.",
        "start": 820.36,
        "end": 824.28
    },
    {
        "text": " Entonces, todo esto nos va a llevar, vamos a organizar las clases y la bibliografía.",
        "start": 824.28,
        "end": 833.16
    },
    {
        "text": " ¿Sí?",
        "start": 833.16,
        "end": 840.64
    },
    {
        "text": " En la bibliografía esto está en el capítulo 2, en el 3 y en el 4.",
        "start": 840.64,
        "end": 847.4399999999999
    },
    {
        "text": " En el capítulo 2, ustedes van a tener la oferta, en el 3 la demanda y cómo funciona el",
        "start": 847.4399999999999,
        "end": 852.76
    },
    {
        "text": " mercado, una primera aproximación en el capítulo 4.",
        "start": 852.76,
        "end": 858.96
    },
    {
        "text": " Y esto va a ser básicamente abordado en la clase de hoy y en la próxima.",
        "start": 858.96,
        "end": 868.56
    },
    {
        "text": " No, perdón, en la otra no me.",
        "start": 868.56,
        "end": 870.56
    },
    {
        "text": " En las primeras tres clases vamos a tratar de analizar el mercado de bienes y servicios.",
        "start": 870.56,
        "end": 875.08
    },
    {
        "text": " Tanto desde la oferta, cómo le ha demandado.",
        "start": 875.08,
        "end": 876.92
    },
    {
        "text": " La oferta, le vamos a mover hoy y la clase que viene y la demanda en la otra.",
        "start": 876.92,
        "end": 881.3199999999999
    },
    {
        "text": " Cuando analiza el mercado de bienes, también ahí, en particular de la oferta y nos va a pasar",
        "start": 882.32,
        "end": 888.32
    },
    {
        "text": " sobre el final de la clase de hoy, vamos a dar que para producir aparece el trabajo,",
        "start": 888.32,
        "end": 894.32
    },
    {
        "text": " la mano de obra.",
        "start": 894.32,
        "end": 896.32
    },
    {
        "text": " Entonces hay otro mercado que en la macroconomi vamos a tener que ver que es el mercado de trabajo.",
        "start": 896.32,
        "end": 901.32
    },
    {
        "text": " Y para bordarlo también lo vamos a ver con esta lógica de oferta y demanda,",
        "start": 901.32,
        "end": 910.32
    },
    {
        "text": " de un mercado.",
        "start": 911.32,
        "end": 913.32
    },
    {
        "text": " Hay quienes van a querer ofrecer su mano de obra y hay quienes quieren contratar la mano de obra.",
        "start": 913.32,
        "end": 918.32
    },
    {
        "text": " Entonces vamos a ver cómo es que se toman esas decisiones por parte de los agentes económicos",
        "start": 918.32,
        "end": 922.32
    },
    {
        "text": " y cómo después funciona un mercado de trabajo en el cual oferte y demanda.",
        "start": 922.32,
        "end": 927.32
    },
    {
        "text": " Todos los mercados tienen, dijimos, agentes que ofrecen, que quieren vender,",
        "start": 927.32,
        "end": 931.32
    },
    {
        "text": " agentes que demandan y un precio de referencia de lo que se está ofreciendo y demandan.",
        "start": 931.32,
        "end": 936.32
    },
    {
        "text": " En el mercado de trabajo cuál es el precio de referencia.",
        "start": 936.32,
        "end": 939.32
    },
    {
        "text": " El sueldo, ¿no? Vamos a llamarles salario, pero es lo mismo.",
        "start": 939.32,
        "end": 944.32
    },
    {
        "text": " Y vamos a denominarlo W.",
        "start": 944.32,
        "end": 947.32
    },
    {
        "text": " Entonces vamos a ver algunas cuestiones para analizar cómo funcionan los mercados de trabajo",
        "start": 947.32,
        "end": 954.32
    },
    {
        "text": " desde una lógica que les decía hoy, conceptual, no indicadores de que cómo nos dicen,",
        "start": 954.32,
        "end": 959.32
    },
    {
        "text": " sino que se puede hacer, por ejemplo, si hay desempleo para que haya menos desempleo.",
        "start": 959.32,
        "end": 963.32
    },
    {
        "text": " Bien. Esto en la violografía hasta dentro del capítulo 2.",
        "start": 963.32,
        "end": 970.32
    },
    {
        "text": " Y esto lo vamos a ver en la clase que viene.",
        "start": 970.32,
        "end": 975.32
    },
    {
        "text": " Después vamos a precisar algunas cuestiones vinculadas al mercado,",
        "start": 975.32,
        "end": 987.32
    },
    {
        "text": " vamos a poner cambiario primero.",
        "start": 987.32,
        "end": 996.32
    },
    {
        "text": " Ustedes conocen el concepto de divisas.",
        "start": 996.32,
        "end": 1000.32
    },
    {
        "text": " Vamos a tener agentes económicos que en Uruguay quieren comprar divisas y otros que quieren vendados.",
        "start": 1000.32,
        "end": 1007.32
    },
    {
        "text": " Entonces vamos a tener los demandantes y a los referentes, y entre ellos se va a definir",
        "start": 1007.32,
        "end": 1012.32
    },
    {
        "text": " justamente el precio de la divisa. ¿Cuál es la divisa más importante en Uruguay?",
        "start": 1012.32,
        "end": 1017.32
    },
    {
        "text": " El dólar. Entonces cuando hablen más cada divisa, vamos a estar hablando de gente que quiere ofrecer dólares,",
        "start": 1017.32,
        "end": 1022.32
    },
    {
        "text": " gente que quiere demandar dólares, y un precio.",
        "start": 1022.32,
        "end": 1025.3200000000002
    },
    {
        "text": " Y el precio es lo que denominamos el tipo de cambio.",
        "start": 1025.3200000000002,
        "end": 1028.3200000000002
    },
    {
        "text": " Esta es el 29 pesos de hoy, ¿no?",
        "start": 1028.3200000000002,
        "end": 1032.3200000000002
    },
    {
        "text": " Vamos a llamarle al tipo de cambio.",
        "start": 1032.3200000000002,
        "end": 1035.3200000000002
    },
    {
        "text": " Todas las casitas, las variables, la nomenclatura que vamos a estar usando,",
        "start": 1035.3200000000002,
        "end": 1038.3200000000002
    },
    {
        "text": " es la nomenclatura de la literatura económica y es en el inglés.",
        "start": 1038.32,
        "end": 1043.32
    },
    {
        "text": " ¿Sí?",
        "start": 1043.32,
        "end": 1044.32
    },
    {
        "text": " Esto es el mercado cambiario.",
        "start": 1047.32,
        "end": 1050.32
    },
    {
        "text": " Está en el capítulo 6 de la ficha y nosotros lo vamos a ver por la clase 5,",
        "start": 1050.32,
        "end": 1059.32
    },
    {
        "text": " pongamos leer.",
        "start": 1059.32,
        "end": 1061.32
    },
    {
        "text": " O capaz que en la clase 4 ya entramos con esto. ¿Sí?",
        "start": 1061.32,
        "end": 1066.32
    },
    {
        "text": " Acá no vamos a entrar tanto en una lógica de ofert y demanda,",
        "start": 1069.32,
        "end": 1073.32
    },
    {
        "text": " sino de para analizar el resultado, ¿no? ¿Qué pasa con el tipo de cambio?",
        "start": 1073.32,
        "end": 1077.32
    },
    {
        "text": " Sinó para entender cómo funciona las reglas de juego de este mercado,",
        "start": 1077.32,
        "end": 1081.32
    },
    {
        "text": " que puede tener reglas de juego específicas y diferentes a las que funcionan en los demás mercados.",
        "start": 1081.32,
        "end": 1087.32
    },
    {
        "text": " Y tenemos dos mercados más.",
        "start": 1087.32,
        "end": 1090.32
    },
    {
        "text": " Uno es el mercado monetario, donde vamos a tener una oferta de dinero y una demanda de dinero,",
        "start": 1090.32,
        "end": 1097.32
    },
    {
        "text": " y el otro es el mercado financiero, donde vamos a tener activos financieros",
        "start": 1097.32,
        "end": 1105.32
    },
    {
        "text": " que hay gente que quiere vendarlos y activos financieros que hay gente que quiere comprar.",
        "start": 1105.32,
        "end": 1111.32
    },
    {
        "text": " Y lo que vamos a tener acá es un precio que le vamos a llamar taza de interés.",
        "start": 1111.32,
        "end": 1120.32
    },
    {
        "text": " Entonces, para seguir avanzando en cómo es que funcionan y que se interrelasen",
        "start": 1120.32,
        "end": 1126.32
    },
    {
        "text": " en qué se interrelasen, en distintas variables macroeconómicas que ya hoy estamos como escupiendo un montón,",
        "start": 1126.32,
        "end": 1132.32
    },
    {
        "text": " tipo de cambio, pareció, exportaciones, dinero, activos financieros.",
        "start": 1132.32,
        "end": 1138.32
    },
    {
        "text": " Bueno, en los mercados monetarios y financieros hay un precio que es como de los dos mercados.",
        "start": 1138.32,
        "end": 1145.32
    },
    {
        "text": " No es que el precio del dinero es la taza de interés, su precio de los activos financieros es la taza de interés.",
        "start": 1145.32,
        "end": 1150.32
    },
    {
        "text": " La taza de interés es un regulador por ahí de ambos mercados.",
        "start": 1150.32,
        "end": 1154.32
    },
    {
        "text": " Entonces, estos mercados, si bien no nos vamos a detener tanto en analizar así desde el lado de la falta,",
        "start": 1154.32,
        "end": 1161.32
    },
    {
        "text": " la demanda y cómo son los dos y cómo funciona, si los vamos a estar viendo en ideas y en cómo se relacionan esas variables.",
        "start": 1161.32,
        "end": 1169.32
    },
    {
        "text": " Y la taza de interés va a aparecer ahí arriba la mesa.",
        "start": 1169.32,
        "end": 1172.32
    },
    {
        "text": " Y esto también está en el capítulo 6 de la ficha y seguramente nos lleve parte de la clase número 5.",
        "start": 1172.32,
        "end": 1182.32
    },
    {
        "text": " Entonces, a esa altura nosotros vamos a estar con unas primeras clases donde analizamos el mercado de bienes,",
        "start": 1183.32,
        "end": 1189.32
    },
    {
        "text": " no incorporamos todavía estas cosas como elementos complementarios, de mercado cambiario, financiero y monetario,",
        "start": 1189.32,
        "end": 1196.32
    },
    {
        "text": " y vamos a tener una aproximación a cómo es que funciona la macroeconómica, cómo se puede crecer,",
        "start": 1196.32,
        "end": 1202.32
    },
    {
        "text": " cómo los precios pueden bajar, más o menos desempler.",
        "start": 1202.32,
        "end": 1205.32
    },
    {
        "text": " Ideas básicas las primeras clases.",
        "start": 1206.32,
        "end": 1208.32
    },
    {
        "text": " Le incorporamos estos conceptos y vamos a llegar a tener una idea más acabada, más argumentos y vinculaciones con estos otros mercados.",
        "start": 1208.32,
        "end": 1218.32
    },
    {
        "text": " Y ahí entonces vamos a tener las últimas clases del curso, clases 6 y 7 capítulo de la violencia número 7,",
        "start": 1218.32,
        "end": 1231.32
    },
    {
        "text": " que está vinculado a analizar todo de manera conjunta.",
        "start": 1231.32,
        "end": 1238.32
    },
    {
        "text": " Hay envío ya pruebas de parciales de economía.",
        "start": 1238.32,
        "end": 1243.32
    },
    {
        "text": " ¿Y bueno? ¿Sabes qué multipliación?",
        "start": 1243.32,
        "end": 1248.32
    },
    {
        "text": " Cuando vean las últimas preguntas de macroeconómica, las últimas, las dos últimas o las tres últimas,",
        "start": 1248.32,
        "end": 1256.32
    },
    {
        "text": " esas preguntas van a haber que parecen difíciles, ¿por qué?",
        "start": 1256.32,
        "end": 1261.32
    },
    {
        "text": " Y porque son preguntas que tratan de combinar variables de todas estas.",
        "start": 1261.32,
        "end": 1265.32
    },
    {
        "text": " No es una pregunta concretita que apunta a algo acá y la oferta me están preguntando un data específico esto.",
        "start": 1265.32,
        "end": 1270.32
    },
    {
        "text": " No, esas últimas preguntas hacen a una interpretación conjunta de todo esto.",
        "start": 1270.32,
        "end": 1275.32
    },
    {
        "text": " E incluso la idea es que para resolverla y que arrancar con una cadena causar donde ponemos que acá pasa algo",
        "start": 1275.32,
        "end": 1281.32
    },
    {
        "text": " y empezamos a aumentar flechas que si pasa esto, pasa esto otro, pasa esto otro",
        "start": 1281.32,
        "end": 1285.32
    },
    {
        "text": " y debería terminar acá, debería ocuparnos estos dos pizarrones, la cadena de razonamiento, esa que vamos a hacer.",
        "start": 1285.32,
        "end": 1292.32
    },
    {
        "text": " ¿Qué es la forma que vamos a emplear? Eso no se lo dije hoy.",
        "start": 1292.32,
        "end": 1295.32
    },
    {
        "text": " Estamos desarrollando una herramienta pero la idea para relacionar variables va a ser estilo cadena causar.",
        "start": 1295.32,
        "end": 1301.32
    },
    {
        "text": " Van a ver que vamos a hacer mucho de flechita.",
        "start": 1301.32,
        "end": 1303.32
    },
    {
        "text": " Si sube la tasa de interés, entonces qué podemos decir que le va a pasar tal cosa esta otra variable",
        "start": 1303.32,
        "end": 1308.32
    },
    {
        "text": " y entonces eso va a ser que esta otra variable y así es lo que le decía que vamos a tratar de interpretar",
        "start": 1308.32,
        "end": 1313.32
    },
    {
        "text": " y ver cómo se vinculan las distintas variables macroeconómicas para terminar conclusiendo sobre lo que es el objeto final",
        "start": 1313.32,
        "end": 1322.32
    },
    {
        "text": " que pasa con estas variables.",
        "start": 1322.32,
        "end": 1325.32
    },
    {
        "text": " Por ejemplo, hay una de las preguntas puede ser, Siembras Hill suba el tipo de cambio, el real por dólar.",
        "start": 1325.32,
        "end": 1332.32
    },
    {
        "text": " Si suba esa variable, eso es lo que nos dispara el razonamiento.",
        "start": 1332.32,
        "end": 1335.32
    },
    {
        "text": " Bueno, si suba eso, ¿cómo terminamos concluyendo qué pase con estas variables?",
        "start": 1335.32,
        "end": 1340.32
    },
    {
        "text": " Y esto va a estar al final de la cadena razonamiento porque antes vamos a estar pasando por estos mercados.",
        "start": 1340.32,
        "end": 1347.32
    },
    {
        "text": " Pero bueno, ese es el objetivo y para eso tenemos las últimas dos clases destinadas a macroeconómicas para ver de manera conjunta como funciona eso.",
        "start": 1347.32,
        "end": 1360.32
    },
    {
        "text": " Y acá está faltando un capítulo que es el capítulo 5 de la ficha y que seguramente en la clase 5 estemos viendo algo que eso va a estar separado de este esquema de razonamiento porque va a estar dedicado a la inflación.",
        "start": 1361.32,
        "end": 1378.32
    },
    {
        "text": " Y esta inflación no se explica bien con esta herramienta.",
        "start": 1378.32,
        "end": 1383.32
    },
    {
        "text": " Por eso, o parte de esto que yo les decía acá que vamos a dar esto de la síntesis clas y de esas ideas, le vamos a agregar algunas otras.",
        "start": 1383.32,
        "end": 1391.32
    },
    {
        "text": " Bueno, en particular la inflación la vamos a ver con otras ideas.",
        "start": 1391.32,
        "end": 1395.32
    },
    {
        "text": " Vamos a estar haciendo un rato dedicado a distintas teorías de la inflación que nos plantean por qué los países se generan procesos inflacionarios o por qué o qué se puede hacer para bajar la inflación.",
        "start": 1395.32,
        "end": 1407.32
    },
    {
        "text": " Entonces eso es como que se aparta. Si bien yo les insisto que tratamos de que haya un hilo conductor a lo largo de todo el curso y adentro de macro también que el hilo conductor es ir recordiendo esto, incorporando conocimientos pero puede volver y tenerlos en estas últimas clases de manera grupada.",
        "start": 1407.32,
        "end": 1427.32
    },
    {
        "text": " Esto de la inflación se escapa. Es imposible. Es distinto.",
        "start": 1427.32,
        "end": 1431.32
    },
    {
        "text": " Ah, no entra con ese esquema de razonamiento. Entonces lo vemos aparte.",
        "start": 1431.32,
        "end": 1435.32
    },
    {
        "text": " Y eso lo vamos a ver ahí en la clase 5 un rato de la clase 5.",
        "start": 1435.32,
        "end": 1439.32
    },
    {
        "text": " Bien, alguna duda?",
        "start": 1439.32,
        "end": 1443.32
    },
    {
        "text": " Hay dos temas que antes de meternos en la oferta agregada me interesa que no los damos claros.",
        "start": 1457.32,
        "end": 1471.32
    },
    {
        "text": " Yo lo vieron en descrutiva pero es importante resaltarlos de cara a lo que vamos a analizar.",
        "start": 1471.32,
        "end": 1479.32
    },
    {
        "text": " El primero de ellos está vinculado a diferenciar lo que son variables, no minales de variables reales.",
        "start": 1479.32,
        "end": 1497.32
    },
    {
        "text": " Esto es algo que lo tenemos que tener claro porque vamos a trabajar así.",
        "start": 1497.32,
        "end": 1501.32
    },
    {
        "text": " Cuando hagamos toda la parte de la análisis y estamos definiendo cosas y manejemos con su, salario, etcétera, tenemos que saber si estamos hablando en términos reales o nominales y cuáles la variable correcta usado.",
        "start": 1501.32,
        "end": 1515.32
    },
    {
        "text": " Entonces prefiero destinarlo unos minutos a repasar esta idea.",
        "start": 1515.32,
        "end": 1519.32
    },
    {
        "text": " Por acá también aparece la cuestión de variables aprecios corrientes y aprecios constantes.",
        "start": 1519.32,
        "end": 1524.32
    },
    {
        "text": " Está vinculado a esto. Pero vamos con un ejemplo.",
        "start": 1524.32,
        "end": 1528.32
    },
    {
        "text": " Números gruesos para tener una idea.",
        "start": 1528.32,
        "end": 1534.32
    },
    {
        "text": " PVEI en 2015 de Rui.",
        "start": 1534.32,
        "end": 1539.32
    },
    {
        "text": " 40 mil millones de dólares.",
        "start": 1539.32,
        "end": 1544.32
    },
    {
        "text": " ¿Sí?",
        "start": 1544.32,
        "end": 1547.32
    },
    {
        "text": " PVEI del 2016.",
        "start": 1552.32,
        "end": 1557.32
    },
    {
        "text": " 50 mil millones de dólares.",
        "start": 1557.32,
        "end": 1562.32
    },
    {
        "text": " ¿Crees que Rui?",
        "start": 1562.32,
        "end": 1571.32
    },
    {
        "text": " Entre el 2015 y el 2016.",
        "start": 1571.32,
        "end": 1576.32
    },
    {
        "text": " ¿Qué era lo que nos medía el PVEI? ¿Qué dijimos que era?",
        "start": 1576.32,
        "end": 1582.32
    },
    {
        "text": " producción. Producción de todo el país.",
        "start": 1583.32,
        "end": 1586.32
    },
    {
        "text": " O sea, acá el que hizo esta cuenta, que se hacen el banco central, son los que miren el PVEI, ¿qué empezaron a contar?",
        "start": 1586.32,
        "end": 1596.32
    },
    {
        "text": " ¿Sarmar un excel y qué empezaron a poner en el excel?",
        "start": 1599.32,
        "end": 1602.32
    },
    {
        "text": " Acá dentro está toda la producción. ¿Cómo sumamos la producción de un país?",
        "start": 1603.32,
        "end": 1608.32
    },
    {
        "text": " ¿Qué produciruais? ¿Produce soja? ¿Cómo hacemos para tener que ver cuántas toneladas de soja?",
        "start": 1608.32,
        "end": 1616.32
    },
    {
        "text": " ¿Espos que más produce?",
        "start": 1616.32,
        "end": 1620.32
    },
    {
        "text": " Carnes. Hay que ver cuántas toneladas de carne. ¿Cómo le asumamos?",
        "start": 1620.32,
        "end": 1625.32
    },
    {
        "text": " En la escuela nos decían que no se podían sumar.",
        "start": 1625.32,
        "end": 1629.32
    },
    {
        "text": " El ejemplo que le pusió de la maestra a usted, pero manzanas con naranja, papa con moñato, no se podía.",
        "start": 1629.32,
        "end": 1636.32
    },
    {
        "text": " Soja con carne tampoco. ¿Cómo se hace para sumar?",
        "start": 1636.32,
        "end": 1640.32
    },
    {
        "text": " Equivalente en dinero, valor como decía el compañero.",
        "start": 1640.32,
        "end": 1644.32
    },
    {
        "text": " O sea, ¿qué esto de acá en realidad este 40 mil?",
        "start": 1644.32,
        "end": 1648.32
    },
    {
        "text": " ¿Alguien hizo una especie de sumatoria, de un precio por cantidad de todos los bienes?",
        "start": 1648.32,
        "end": 1655.32
    },
    {
        "text": " Toneladas, ¿no? Cues toneladas de soja por el precio de la soja.",
        "start": 1656.32,
        "end": 1661.32
    },
    {
        "text": " Toneladas de carne, precio de carne.",
        "start": 1661.32,
        "end": 1664.32
    },
    {
        "text": " Cantidad de boletos, precio boleto. Y así eso todos los bienes y servicios finales.",
        "start": 1664.32,
        "end": 1669.32
    },
    {
        "text": " Recordemos acá tenemos los bienes y servicios finales.",
        "start": 1669.32,
        "end": 1673.32
    },
    {
        "text": " Y este de acá entonces que es, lo mismo, alguien agarró y dijo, tenemos que hacer todos los precios y todas las cantidades del otro año.",
        "start": 1673.32,
        "end": 1683.32
    },
    {
        "text": " Y entonces si miramos que 40 mil es el P4Q, es el PVE en 2015 y 50 mil el PVE en 2016 creció, no creció Uruguay.",
        "start": 1686.32,
        "end": 1698.32
    },
    {
        "text": " La pregunta que yo estoy haciendo es sobre si creció cuando alguien habla de si creció algo. ¿En qué está pensando?",
        "start": 1701.32,
        "end": 1714.32
    },
    {
        "text": " En qué miramos tonúmero y decimos 50 mil es mayor a 40 mil y eso está claro, ¿no?",
        "start": 1716.32,
        "end": 1722.32
    },
    {
        "text": " Acá hay una variación de 25%. Ahora si la queremos descomponer, ¿qué hay adentro del 25%?",
        "start": 1722.32,
        "end": 1732.32
    },
    {
        "text": " Si acá tenemos P4Q y acá tenemos P4Q, esta variación de 25% a qué componente se debe?",
        "start": 1733.32,
        "end": 1744.32
    },
    {
        "text": " A los dos, esto es una suma de la variación BP y de la variación de Q.",
        "start": 1744.32,
        "end": 1751.32
    },
    {
        "text": " Entonces ¿a qué estoy yendo con este ejemplo? Cuando nosotros hablemos de crecimiento económico.",
        "start": 1751.32,
        "end": 1758.32
    },
    {
        "text": " ¿a qué nos vamos a referir? ¿a qué la producción de Uruguay sale más cara?",
        "start": 1759.32,
        "end": 1764.32
    },
    {
        "text": " Acá todos hablando de 50 mil P4Q, valor de la producción. ¿a qué sale más cara?",
        "start": 1764.32,
        "end": 1769.32
    },
    {
        "text": " Combina con que haya más producción. ¿Qué el año anterior?",
        "start": 1769.32,
        "end": 1773.32
    },
    {
        "text": " Cuando hablo de creció el economía Uruguay, me estoy refiliendo a los dos componentes.",
        "start": 1774.32,
        "end": 1779.32
    },
    {
        "text": " No, sólo voy a quedar ver esto porque el crecimiento económico es una variable real.",
        "start": 1779.32,
        "end": 1786.32
    },
    {
        "text": " Entonces yo no puedo decir que Uruguay creció 25%.",
        "start": 1787.32,
        "end": 1792.32
    },
    {
        "text": " El 25% ese, lo que nos está diciendo es que la producción de Uruguay es un 25% más cara o vale 25% más que el año anterior.",
        "start": 1792.32,
        "end": 1804.32
    },
    {
        "text": " Y es una combinación de que haya producido más y de que haya sido más cara en los bien.",
        "start": 1804.32,
        "end": 1809.32
    },
    {
        "text": " Entonces lo que uno tiene que mirar es hacer una especie de triquiñuela acá y sólo poder",
        "start": 1810.32,
        "end": 1816.32
    },
    {
        "text": " hay que aislar esto para que sólo nos quede la variación de las cantidades.",
        "start": 1819.32,
        "end": 1824.32
    },
    {
        "text": " Y eso sí es el crecimiento económico.",
        "start": 1824.32,
        "end": 1827.32
    },
    {
        "text": " ¿Cómo se hace eso? Y ahí aparece esto de expresar variables en términos nominales y reales o lo que les decía hoy.",
        "start": 1828.32,
        "end": 1838.32
    },
    {
        "text": " Esto es expresar aprecios corrientes y esto es expresar aprecios con tanques.",
        "start": 1838.32,
        "end": 1848.32
    },
    {
        "text": " Entonces fíjense lo que hace lo en concentrar, lo que son estadísticas, internacionales de producción.",
        "start": 1850.32,
        "end": 1856.32
    },
    {
        "text": " ¿Qué es lo que se caecula acá para todos los bienes pero está considerando el precio del año 2015 y la cantidad del año 2015?",
        "start": 1858.32,
        "end": 1866.32
    },
    {
        "text": " Por eso llegamos a que la producción del año 2015 es 40 mil. Me fijo cuántas toneladas de cada bien, los precios de cada bien.",
        "start": 1867.32,
        "end": 1875.32
    },
    {
        "text": " Voy al año 2016 y hice lo mismo. Precio por cantidad.",
        "start": 1876.32,
        "end": 1880.32
    },
    {
        "text": " Ahora esto es expresar aprecios constantes lo que va a hacer es una sumatoria de precio por cantidad de las cantidades del año 2016",
        "start": 1881.32,
        "end": 1892.32
    },
    {
        "text": " porque quiero ver si creció Uruguay, estoy midiendo el PBI del 2016.",
        "start": 1892.32,
        "end": 1898.32
    },
    {
        "text": " Acá yo tengo el PBI del 2016 pero miren lo que hace.",
        "start": 1899.32,
        "end": 1905.32
    },
    {
        "text": " Le pone los precios del otro año.",
        "start": 1906.32,
        "end": 1909.32
    },
    {
        "text": " Esto de acá es lo que nos permite aislar la variación de precio.",
        "start": 1911.32,
        "end": 1916.32
    },
    {
        "text": " Y ahí lo que uno va a encontrar es que Uruguay pongamos el E para devuelta estos números aproximados, creció 10%.",
        "start": 1917.32,
        "end": 1935.32
    },
    {
        "text": " Porque había un 15% en esos números inventados que eran varias aproximados, que era variación de precios.",
        "start": 1936.32,
        "end": 1943.32
    },
    {
        "text": " Para medir la evolución de variables en términos reales no hay que comerse este efecto de los precios.",
        "start": 1944.32,
        "end": 1952.32
    },
    {
        "text": " El mismo ejemplo o algo muy similar de haber visto cuando analizaban el salario real y el salario nominal.",
        "start": 1955.32,
        "end": 1961.32
    },
    {
        "text": " Capas que acá yo en vez de PBI les podía haber dicho el sueldo de usted en un año o en un mes es 40 mil y en el otro mes es 50 mil.",
        "start": 1962.32,
        "end": 1971.32
    },
    {
        "text": " Ustedes ganaron 25% de poder de compra.",
        "start": 1972.32,
        "end": 1976.32
    },
    {
        "text": " Si el salario usted se lo suben 25%.",
        "start": 1978.32,
        "end": 1981.32
    },
    {
        "text": " Si o no.",
        "start": 1982.32,
        "end": 1983.32
    },
    {
        "text": " Porque ese salario al momento de comprarlo, quien juega también ahí.",
        "start": 1984.32,
        "end": 1988.32
    },
    {
        "text": " Los precios. Esto es lo mío.",
        "start": 1989.32,
        "end": 1991.32
    },
    {
        "text": " Por eso algunas variables son por excelencia reales y las tenemos que pensar así el crecimiento económico es una variable real.",
        "start": 1992.32,
        "end": 1999.32
    },
    {
        "text": " Entonces esto nunca le vamos a pensar. Vamos a pensar en estos términos reales.",
        "start": 2000.32,
        "end": 2003.32
    },
    {
        "text": " Cuando digamos Uruguay crece o no crece estamos haciendo referencia a esta comparación.",
        "start": 2004.32,
        "end": 2008.32
    },
    {
        "text": " Aprecios constantes o en términos reales. Esta otra no va a estar arriba a la mesa porque está mal pensar de esa manera.",
        "start": 2009.32,
        "end": 2016.32
    },
    {
        "text": " Hay otras variables que sí tienen la ascepción de uno querer dar las en términos nominales y después también en términos reales que las dos nos interesa.",
        "start": 2018.32,
        "end": 2026.32
    },
    {
        "text": " Pero casi todas las variables que vamos a manejar van a tener este corte real.",
        "start": 2027.32,
        "end": 2031.32
    },
    {
        "text": " La prioridad va a ser pensar en términos reales. Poder queremos justamente analizar decisiones y esas decisiones van a tener que ser bien informadas.",
        "start": 2032.32,
        "end": 2041.32
    },
    {
        "text": " Y el bien informado pasa por no enquivocarse o no comerse eso que se llama el efecto de los precios.",
        "start": 2042.32,
        "end": 2048.3199999999997
    },
    {
        "text": " A veces también se le denomina la ilusión monetaria de creer que porque tenemos más.",
        "start": 2049.3199999999997,
        "end": 2053.3199999999997
    },
    {
        "text": " Estamos todos más mejor, no? No estamos 25% mejor. Crecimos 10%.",
        "start": 2054.32,
        "end": 2064.32
    },
    {
        "text": " Entonces, esa primera saludidad para poner en términos comunes, ¿cómo vamos a estar hablando?",
        "start": 2065.32,
        "end": 2072.32
    },
    {
        "text": " Cuando más adelante o cuando siempre acabamos trabajo, producción, consumos, portaciones, siempre vamos a estar pensando en términos reales.",
        "start": 2073.32,
        "end": 2081.32
    },
    {
        "text": " El PBE, asume las dos formas, pero nosotros para comparar vamos a estar hablando en términos reales.",
        "start": 2084.32,
        "end": 2090.32
    },
    {
        "text": " Este es nominal, el P4Q de cada año es nominal. Estos 50.000 son nominales o aprecios corrientes. Esto de acá es verlo en términos reales.",
        "start": 2091.32,
        "end": 2100.32
    },
    {
        "text": " Poder hacer estas comparaciones en términos reales.",
        "start": 2101.32,
        "end": 2104.32
    },
    {
        "text": " O sea, reales asocienlo a que hay que aislar el efecto de los precios.",
        "start": 2107.32,
        "end": 2111.32
    },
    {
        "text": " Si los precios no nos pueden interferir en el análisis.",
        "start": 2112.32,
        "end": 2115.32
    },
    {
        "text": " Segundo tema, porque también va a estar presente a lo largo de buena parte del curso en la manera de que vamos a estar pensando.",
        "start": 2122.32,
        "end": 2130.32
    },
    {
        "text": " Si yo un gráfico del PBE, no decimos que hoy acá, 2015,",
        "start": 2131.32,
        "end": 2140.32
    },
    {
        "text": " pusimos 40.000 millones de dólares.",
        "start": 2141.32,
        "end": 2145.32
    },
    {
        "text": " En 1900, ¿cuál es parece que era el PBE del año 1900 en Uruguay?",
        "start": 2149.32,
        "end": 2160.32
    },
    {
        "text": " Más bajo, igual, más alto, que el que tenemos hoy en el 2015, menos. O sea, en el 900 se producía menos.",
        "start": 2161.32,
        "end": 2174.32
    },
    {
        "text": " ¿Qué hoy?",
        "start": 2176.32,
        "end": 2178.32
    },
    {
        "text": " Sí o no, esto es lo que estamos diciendo es que había menos bienes y servicios.",
        "start": 2179.32,
        "end": 2184.32
    },
    {
        "text": " La tendencia de casi todos los países del mundo es que el PBE va a crecer.",
        "start": 2185.32,
        "end": 2190.32
    },
    {
        "text": " Y si acá nos ponemos un 2030 o 50, por lo del mundial, lo que sea, seguramente el PBE va a estar más arriba de lo que es hoy.",
        "start": 2191.32,
        "end": 2197.32
    },
    {
        "text": " Hay una parte de la macroeconomía que lo que va a estudiar es justamente eso.",
        "start": 2200.32,
        "end": 2205.32
    },
    {
        "text": " ¿Qué se puede hacer o cuáles son las variables que hacen que el PBE este, salte acá y salte acá y siga saltando en peor.",
        "start": 2206.32,
        "end": 2213.32
    },
    {
        "text": " Y esto es una especie de tendencia y por eso esto se denomina el PBE tendencial y esto tiene una mirada de largo plazo.",
        "start": 2214.32,
        "end": 2234.32
    },
    {
        "text": " Y esto lo va a estudiar la teoría del crecimiento económico. O sea, en lo que vamos a estar mirando nosotros en macroeconomía, muchas veces va a estar arriba de la mesa conceptos de la teoría del crecimiento económico.",
        "start": 2235.32,
        "end": 2255.32
    },
    {
        "text": " Que a lo que apunta es a una mirada de largo plazo y va a dejar de lado cosas que puedan en el corto plazo modificar esta tendencia.",
        "start": 2256.32,
        "end": 2263.32
    },
    {
        "text": " Pero no le importa, lo que le importa es mirar a la largo plazo. ¿Qué hay que hacer para que el PBE se ha más alto en el largo plazo?",
        "start": 2264.32,
        "end": 2273.32
    },
    {
        "text": " Dentro de 10 años, no ahora el mes que viene, eso no lo va a estudiar esto. Esto se preocupa como a las raíces, a lo más profundo, a lo que me marca el largo plazo de la economía.",
        "start": 2273.32,
        "end": 2285.32
    },
    {
        "text": " Pero si uno mira la evolución del PBE es esa, esta en así, está al inial.",
        "start": 2287.32,
        "end": 2295.32
    },
    {
        "text": " Por más que en el sur huayo somos medio, no? Todo tranquilo, colores y gris, no? No, no, caracterizamos por eso, pero seremos así tan moderados.",
        "start": 2296.32,
        "end": 2306.32
    },
    {
        "text": " En el 2002, pasó algo en el Uruguay en el 2002, una crisis. Entonces, suruguay en el 2002. Estaba acá con este PBE, con lo que decía la tendencia,",
        "start": 2310.32,
        "end": 2324.32
    },
    {
        "text": " según lo que teníamos, estábamos por encima o por debajo. Por debajo, en el 2002, Uruguay estaba acá.",
        "start": 2324.32,
        "end": 2333.32
    },
    {
        "text": " Las capacidades que teníamos, que es lo que mira la terria de crecimiento económico, nos decían que podíamos producir más, pero estábamos en una crisis.",
        "start": 2335.32,
        "end": 2342.32
    },
    {
        "text": " Entonces, la evolución del PBE muestra peridos, realidad acabamos a lo bien, peridos cítlicos, estábamos por acá arriba y en el 2002, bajamos, costó y estamos por acá.",
        "start": 2343.32,
        "end": 2360.32
    },
    {
        "text": " Y bueno, en algún momento, va a pasar esto y vamos a volver a seguir así. Esto es lo que se denomina el PBE efectivo y tiene una mirada de corto plazo.",
        "start": 2361.32,
        "end": 2382.32
    },
    {
        "text": " Y esto lo va a estudiar la teoría del ciclo económico. O sea, hay otra rama de la ciencia económica, macro, que va a estudiar a corto plazo cuáles son las razones que hacen con una economía entre en crisis o que esté produciendo más de su tendencia.",
        "start": 2383.32,
        "end": 2407.32
    },
    {
        "text": " Entonces, esto sí se va a dedicar a estudiar esto, a ver por qué estamos por acá abajo.",
        "start": 2408.32,
        "end": 2413.32
    },
    {
        "text": " Nosotros, en estas clases, no vamos a ver ni la teoría de crecimiento en la teoría del ciclo, pero si vamos a estar manejando en algún momento argumentos que están vinculados a largo plazo y en otro argumentos que están vinculados a corto plazo.",
        "start": 2415.32,
        "end": 2426.32
    },
    {
        "text": " Entonces, esta diferenciación la vamos a manejar.",
        "start": 2427.32,
        "end": 2430.32
    },
    {
        "text": " ¿Sí?",
        "start": 2430.32,
        "end": 2432.32
    },
    {
        "text": " Está claro. Hay alguna pregunta, hay una duda.",
        "start": 2435.32,
        "end": 2439.32
    },
    {
        "text": " Acá es el punto en el que cerramos lo que es la bibliografía capítulo uno, que es introductorio, que nos ordena un poco la cancha de lo que vamos a estar viendo en las próximas.",
        "start": 2443.32,
        "end": 2452.32
    },
    {
        "text": " Y vamos a arrancar ahora con el capítulo dos. Siempre les voy a estar manejándolo de la bibliografía, porque hay algunas cosas que uno hace más énfasis unos años que otros y la bibliografía permanece para darle ese carácter más.",
        "start": 2453.32,
        "end": 2466.32
    },
    {
        "text": " Si bien la tendríamos que actualizar en breve, pero le da ese carácter más permanente.",
        "start": 2467.32,
        "end": 2472.32
    },
    {
        "text": " En algunos momentos vamos a decir, bueno, terminamos este capítulo, tengan en cuenta que tal sección o tal parte no la vimos y si no lo vimos en clase, no lo vamos a preguntar.",
        "start": 2473.32,
        "end": 2483.32
    },
    {
        "text": " Esas son las reglas de juego. Si no se ve en clase, no se pregunta. Una cosa también es no va a la clase y otra darle menos énfasis.",
        "start": 2484.32,
        "end": 2492.32
    },
    {
        "text": " Que eso también a ustedes les tiene que alertar que si le damos mucha bolilla, algún tema en clase y seguramente sea más preguntado que otros en el momento del pasión.",
        "start": 2493.32,
        "end": 2503.32
    },
    {
        "text": " Pero vamos a ir manejándonos de esa manera durante las clases. Ahora entonces cerrado el capítulo uno de la bibliografía.",
        "start": 2504.32,
        "end": 2515.32
    },
    {
        "text": " Capítulo dos arrancamos entonces ahora. Digimos que esta variable la vamos a similar a lo que ustedes ya vieron al PBI.",
        "start": 2553.32,
        "end": 2564.32
    },
    {
        "text": " La variable oferta agregada es la producción de un país. En términos reales, o sea estamos haciendo Q, una variable física.",
        "start": 2565.32,
        "end": 2575.32
    },
    {
        "text": " Lo que queremos representar acá por más que esto está presado en millones de dólares, los presamos en valor porque precisamos sumar todo.",
        "start": 2576.32,
        "end": 2584.32
    },
    {
        "text": " Pero la idea es pensar en términos reales esta variable. Esto es nuestra cosa que toda la producción, o sea vamos a usar 2 subindices ahora para esta ejemplificación de li bienes y servicios, o sea hasta la vez que la gente se vea.",
        "start": 2584.32,
        "end": 2604.32
    },
    {
        "text": " Estamos sumando todos los bienes y servicios y vamos a ponerlo de juta para representar a todas las empresas.",
        "start": 2605.32,
        "end": 2613.32
    },
    {
        "text": " Así ya nos vamos asimilando aquí la variable PBI oferta agregada está asociado al actor económico en precio.",
        "start": 2614.32,
        "end": 2623.32
    },
    {
        "text": " Generalmente lo que se denominal los agentes económicos se clasifican en por un lado empresarios, por otro lado hogares, estado y resto del mundo.",
        "start": 2624.32,
        "end": 2638.32
    },
    {
        "text": " Son como los cuatro grandes agentes de un homanjo, grupos de agentes, empresarios, hogares, estado y resto del mundo.",
        "start": 2638.32,
        "end": 2647.32
    },
    {
        "text": " Entre ellos se dan cosas y uno le demanda una cosa a otro, uno le ofrece otra cosa a otro, cada gente le demanda una cosa en un mercado ofrece en el hombre.",
        "start": 2648.32,
        "end": 2656.32
    },
    {
        "text": " En este caso estamos hablando de que los empresarios son los que ofrecen los bienes y servicios de un país, son los que producen, los que llevan adelante el proceso productivo.",
        "start": 2656.32,
        "end": 2666.32
    },
    {
        "text": " Y atrás de esta variable entonces es PBI, es toda la producción del país. Mirando esta variable Q es que nosotros vamos a ver si Ruaïcresio no crece.",
        "start": 2666.32,
        "end": 2675.32
    },
    {
        "text": " Entonces como esa es nuestra idea, lo que tenemos que pensar y de esta manera lo vamos a tratar de representar es ¿cuáles son los distintos factores de tercera?",
        "start": 2677.32,
        "end": 2695.32
    },
    {
        "text": " Y es que es el terminante de la ofertarea. La manera de que vamos a abordar cada una de las variables que van a ir apareciendo, esa es, definamos la, lo que hicimos acá, verde que se trata, quién es el agente económico que está acá atrás.",
        "start": 2696.32,
        "end": 2714.32
    },
    {
        "text": " Y porque tenemos claro que es lo que estamos hablando, bueno, pensemos ¿cuáles son aquellos factores que determinan que influyen en este?",
        "start": 2714.32,
        "end": 2724.32
    },
    {
        "text": " Y si por ejemplo invento encontramos que es la tasa de interés, bueno la metemos acá y es la manera de ir resumiendo que la tasa de interés me influye en la producción de un país.",
        "start": 2725.32,
        "end": 2737.32
    },
    {
        "text": " Bien, eso es hacia donde vamos. Hay un concepto que está vinculado a esto al de la oferta agregada que es el de la función de producción.",
        "start": 2737.32,
        "end": 2748.32
    },
    {
        "text": " La función de producción es justamente una función que me dice ¿cuáles son los factores productivos? ¿Me cuantifica, no?",
        "start": 2748.32,
        "end": 2763.32
    },
    {
        "text": " Me está primero identificando ¿qué factores productivos tengo? Y después me está cuantificando como es la relación entre esos factores productivos y la producción.",
        "start": 2764.32,
        "end": 2773.32
    },
    {
        "text": " Y esto es una relación técnica, o sea, es una relación física, tecnológica, que me dice ¿qué preciso yo para producir esto?",
        "start": 2773.32,
        "end": 2785.32
    },
    {
        "text": " Entonces para analizar este ejemplo vamos a un avión sencillo. Quiero hacer una torta. ¿Cuáles son? ¿Qué necesito para hacer una torta?",
        "start": 2786.32,
        "end": 2800.32
    },
    {
        "text": " Así como allá en Q, teníamos el PBI, bueno acá yo tengo Q de una torta. Yo lo que quiero es 3 kilos que Q de una torta sea 3 kilos.",
        "start": 2800.32,
        "end": 2814.32
    },
    {
        "text": " Una torta de chocolate, de pared a esta altura de la clase viene bien. ¿Cuáles son los factores determinantes de la torta?",
        "start": 2815.32,
        "end": 2824.32
    },
    {
        "text": " Los ingredientes en términos de una receta. ¿Arina? Entonces acá dentro voy a poner Q de arena. ¿Cuánto le ponemos?",
        "start": 2824.32,
        "end": 2839.32
    },
    {
        "text": " ¿Diezas? ¿Tres kilos 2? ¿Dos tasarín? ¿Sí? ¿Dos tasarín? ¿Qué más?",
        "start": 2839.32,
        "end": 2854.32
    },
    {
        "text": " He oído, cuantos, ocho, doce, dos unidades, ¿qué más? ¿Qué más? ¿Qué? ¿Cacao. ¿Cuánto volemos? ¿Medioquilo?",
        "start": 2854.32,
        "end": 2883.32
    },
    {
        "text": " No, no estoy para más terchef, ¿no?",
        "start": 2884.32,
        "end": 2887.32
    },
    {
        "text": " ¿Qué más?",
        "start": 2889.32,
        "end": 2890.32
    },
    {
        "text": " Lache",
        "start": 2892.32,
        "end": 2893.32
    },
    {
        "text": " Medio litro",
        "start": 2898.32,
        "end": 2899.32
    },
    {
        "text": " Dejemos la parte de ingredientes, ¿sí?",
        "start": 2903.32,
        "end": 2906.32
    },
    {
        "text": " Pongámole que hay más, más ingredientes que hasta, podríamos decir que todos estos son lo que uno podría",
        "start": 2906.32,
        "end": 2912.32
    },
    {
        "text": " aglutinar en esta categoría de materias primas son y sub.",
        "start": 2912.32,
        "end": 2917.32
    },
    {
        "text": " Ahora, ¿qué pasa? ¿Qué más precisamos?",
        "start": 2917.32,
        "end": 2921.32
    },
    {
        "text": " Mano de obra, esos ingredientes son los, ¿no? Hay que mezclarlos, ¿no?",
        "start": 2921.32,
        "end": 2925.32
    },
    {
        "text": " Entonces, se acaba a aparecer la variable heli. ¿Cuánto no llevo a hacer una torta de esta?",
        "start": 2925.32,
        "end": 2930.32
    },
    {
        "text": " 30 minutos",
        "start": 2930.32,
        "end": 2932.32
    },
    {
        "text": " ¿Sí? Una persona y 30 minutos ¿no?",
        "start": 2934.32,
        "end": 2938.32
    },
    {
        "text": " Energía",
        "start": 2942.32,
        "end": 2944.32
    },
    {
        "text": " Energía a través de qué",
        "start": 2945.32,
        "end": 2948.32
    },
    {
        "text": " Para el horno, entonces ahí me voy a adelantar y voy a decir en esta variable K",
        "start": 2951.32,
        "end": 2956.32
    },
    {
        "text": " vamos a resumir lo que son las herramientas instrumentos de trabajo",
        "start": 2956.32,
        "end": 2962.32
    },
    {
        "text": " Esta variable K, capital, hace ilusión a capital, ¿sí?",
        "start": 2962.32,
        "end": 2967.32
    },
    {
        "text": " Pero un capital físico, capital físico es eso, los equipos, las maquinarias, las herramientas, las instalaciones que vamos a usar",
        "start": 2967.32,
        "end": 2976.32
    },
    {
        "text": " ¿Cuánto vamos a usar?",
        "start": 2976.32,
        "end": 2978.32
    },
    {
        "text": " 20 minutos del horno, de energía, si lo vinculamos a energía, aunque energía también podría hacer otro insumo ¿no?",
        "start": 2978.32,
        "end": 2984.32
    },
    {
        "text": " Lo podríamos poner como un insumo distinto y, acaso, lo dejamos el desgaste del horno ¿sí?",
        "start": 2984.32,
        "end": 2990.32
    },
    {
        "text": " Batidor, el licuador, no sé, algo de eso también podría entrar ahí ¿sí?",
        "start": 2991.32,
        "end": 2995.32
    },
    {
        "text": " Y por ahí podríamos decir que queda la torta ¿no?",
        "start": 2999.32,
        "end": 3002.32
    },
    {
        "text": " A grandes rasgos que tenemos entonces, que una función de producción que me está diciendo a mí, que yo para obtener determinada cantidad de este bien,",
        "start": 3008.32,
        "end": 3017.32
    },
    {
        "text": " cantidad, dije ¿no? Fíjico, estoy pensando en términos reales para obtener determinada cantidad, preciso,",
        "start": 3017.32,
        "end": 3024.32
    },
    {
        "text": " determinadas cantidades de materias primas, determinada cantidad de trabajo y determinada cantidad de capital",
        "start": 3024.32,
        "end": 3032.32
    },
    {
        "text": " Todos expresados en términos físicos, o sea, que esta función de producción no podría ir resumiendo el aire",
        "start": 3032.32,
        "end": 3039.32
    },
    {
        "text": " pero entonces depende de materias primas y insumos, de trabajo y de capital ¿sí?",
        "start": 3039.32,
        "end": 3046.32
    },
    {
        "text": " Pregunto, ¿a alguno podría con estas mismas dos tasas de harina, dos huevos, medio kiló de cacado, etcétera, todos los mismos, los mismos insumos?",
        "start": 3054.32,
        "end": 3068.32
    },
    {
        "text": " Perdón, revovino un segundo, esto es una lógica la de la función de producción que lo que me está planteando es, yo tengo determinado sin put, insumos, los pongo adentro de la fábrica y me sale el producto",
        "start": 3068.32,
        "end": 3087.32
    },
    {
        "text": " Esa es la lógica de la función de producción, tengo acá Q y tengo acá todo lo que le pongo, insumos, trabajo, capital, todo lo que le pongo lo comino y sale esto",
        "start": 3088.32,
        "end": 3099.32
    },
    {
        "text": " Esa es la función de producción, me cuantifica eso de ahí que es como medio mágico que usa tal cosa y sale esto que es totalmente distinto",
        "start": 3099.32,
        "end": 3108.32
    },
    {
        "text": " Entonces pregunta, poniendo todo lo mismo, todas estas mismas cantidades, puedo lograr 4 kiló de torta?",
        "start": 3109.32,
        "end": 3120.32
    },
    {
        "text": " Todo lo mismo, dos tasas, dos huevos, 30 minutos",
        "start": 3128.32,
        "end": 3133.32
    },
    {
        "text": " Todo el mundo con los mismos insumos o tiene lo mismo? Nos ponemos todos nosotros con los mismos ingredientes, imagínemos, nos ponen ahí delantar el coso, todo eso, todos vamos a sacar los 3 kiló de torta de la misma torta igualita",
        "start": 3139.32,
        "end": 3160.32
    },
    {
        "text": " Yo capacuesa con una torta de 4 kiló porque mientras estaba masclando los alimentos les cantaba, eso funciona con las plantas, no mano?",
        "start": 3161.32,
        "end": 3174.32
    },
    {
        "text": " Pero pongamos el tipo de alimentos también funcionara, si? Capacias alguien combina de una manera diferente esto y saca otro Q",
        "start": 3174.32,
        "end": 3183.32
    },
    {
        "text": " ¿A qué me refiero con esto? ¿Qué uno puede?",
        "start": 3184.32,
        "end": 3189.32
    },
    {
        "text": " Acá resumamos como factores productivos, uno puede, con los mismos factores productivos lograr más producción",
        "start": 3192.32,
        "end": 3202.32
    },
    {
        "text": " ¿Cómo logra eso? Porque los combina, porque este aumento está viniendo por acá, porque en esta combinación los estoy haciendo rendir más",
        "start": 3203.32,
        "end": 3214.32
    },
    {
        "text": " De hecho eso como se resume, como que hay alguien que está aplicando una tecnología diferente",
        "start": 3215.32,
        "end": 3221.32
    },
    {
        "text": " Entonces saca lo que estoy metiendo es que hay algo más a los factores productivos que es la forma en que uno los combina",
        "start": 3222.32,
        "end": 3228.32
    },
    {
        "text": " Y eso es lo que se le denomina o resume como tecnología de producción",
        "start": 3229.32,
        "end": 3233.32
    },
    {
        "text": " La tecnología de producción la mayoría lo representa como si fuera otra función porque estamos justamente diciendo que los combina de manera distinta",
        "start": 3235.32,
        "end": 3244.32
    },
    {
        "text": " No es esta misma función, es otra función, es una F1 más derivada, una función G, H, la función que quiera, tanta funciones como cambios técnicos o tecnología de producción",
        "start": 3245.32,
        "end": 3259.32
    },
    {
        "text": " Ahora como nosotros estamos presentando de manera agregada, resumida, determinada cuestión macro, vamos a simplificar y no andar con una u otra función",
        "start": 3260.32,
        "end": 3268.32
    },
    {
        "text": " Bueno vamos a poner forma funcional, simplemente apelamos a esta tipo de expresión para que nos queden ahí representados los factores productivos",
        "start": 3269.32,
        "end": 3277.32
    },
    {
        "text": " Entonces voy a agregar otro que le voy a llamar Z que es justamente la tecnología de producción",
        "start": 3278.32,
        "end": 3285.32
    },
    {
        "text": " Esto entonces está vinculado a la tecnología, a la innovación, cuestiones que me dan mayor producción utilizando los mismos insubes",
        "start": 3286.32,
        "end": 3304.32
    },
    {
        "text": " Y eso lo vamos a representar como Z y ese Z es también entonces un factor productivo más porque es parte de esa receta, es como lo manejo, como gestiono los otros factores productivos",
        "start": 3305.32,
        "end": 3320.32
    },
    {
        "text": " Está claro",
        "start": 3321.32,
        "end": 3323.32
    },
    {
        "text": " Si tuvieramos que hacer la función de producción de la harina, ¿de qué depende la producción de harina?",
        "start": 3335.32,
        "end": 3347.32
    },
    {
        "text": " Vamos a meter acá dentro el tribo ¿no?",
        "start": 3348.32,
        "end": 3351.32
    },
    {
        "text": " ¿Qué más?",
        "start": 3354.32,
        "end": 3356.32
    },
    {
        "text": " ¿eh?",
        "start": 3357.32,
        "end": 3358.32
    },
    {
        "text": " En el molín o vamos a tener ahí determinadas instrumentos en el molín o vamos a tener trabajo, podemos tener otros insumos",
        "start": 3359.32,
        "end": 3371.32
    },
    {
        "text": " Ahora quiero ver la del tribo",
        "start": 3372.32,
        "end": 3378.32
    },
    {
        "text": " Para producir tribo que precisamos, tierra vamos a llamarle recurso natural, agua, aire, resumámosle o por ahí, todos esos como recursos naturales",
        "start": 3379.32,
        "end": 3401.32
    },
    {
        "text": " Vamos a precisar alguna maquinaria para sembrar, para cosechar, mano de obra, semilla, fertilizantes, etc. ¿a qué voy con esto?",
        "start": 3402.32,
        "end": 3419.32
    },
    {
        "text": " Supongamos que la producción de tribo es 100",
        "start": 3420.32,
        "end": 3426.32
    },
    {
        "text": " ¿Qué puede hacer un país y supongamos que esto es Uruguay? Uruguay produjo 100 de tribo, ¿a dónde puede ir esto 100 de tribo?",
        "start": 3430.32,
        "end": 3438.32
    },
    {
        "text": " ¿Tonela lo que quiere? Un número, ¿ex? ¿si?",
        "start": 3439.32,
        "end": 3444.32
    },
    {
        "text": " Esto 100 podría anirse al resto del mundo, pongamos el que se van 30 al resto del mundo y después a dónde pueden ir?",
        "start": 3446.32,
        "end": 3456.32
    },
    {
        "text": " ¿Calarina? ¿si? pongamos el que esto 70 van a los molítanos para producir alito o si quieren resto del mundo y otros, ¿no? Y otros estidos",
        "start": 3457.32,
        "end": 3473.32
    },
    {
        "text": " Ahora, con esto 70 de tribo se produce, pongamos el 60 de harina, vamos para que los números sean cualquier otra cosa, vamos a volar esto son 600 bolsas de harina",
        "start": 3474.32,
        "end": 3493.32
    },
    {
        "text": " y la bolsa harina puede venir a muchos destinos pero a alguno de estos puede venir a cada, las dos tacitas que precisamos para la torta",
        "start": 3494.32,
        "end": 3505.32
    },
    {
        "text": " y ahí salieron los 3 kilos que teníamos acá de torta",
        "start": 3509.32,
        "end": 3513.32
    },
    {
        "text": " Entonces, cuando yo quiero hablar de la producción de un país, si decíamos que teníamos que sumar todo, todos los bienes y servicios producidos, yo acá debería decir entonces 100 de tribo, 600 de harina, 3 kilos de torta, si simplifico que mi país es eso, produce esas tres cosas, entonces acá yo estoy sumando todo eso",
        "start": 3513.32,
        "end": 3542.32
    },
    {
        "text": " El PVE era un indicador de la producción de un país, del esfuerzo productivo, seguramente definió Mateo de un país, ahora estos 3 kilos de torta, parte del esfuerzo productivo estos 3 kilos de torta están estas dos tacas de harina",
        "start": 3543.32,
        "end": 3561.32
    },
    {
        "text": " y estas dos tacas de harina ya la estamos contando en los 600 de harina que están en esa suma, y a su besa dentro de esa suma esos 600 de harina usaron 70 de tribo que también los estoy sumando acá",
        "start": 3562.32,
        "end": 3573.32
    },
    {
        "text": " Entonces, ¿qué le ocurre cuando uno habla acá de la oferta estos son bienes y servicios finales?",
        "start": 3574.32,
        "end": 3582.32
    },
    {
        "text": " Y que sean bienes y servicios finales, no lleva aquí la función de producción macroeconómica, tiene que eliminar estos porque no son finales, son intermedios, son insumos, intermédios, entonces no los puedo contar más de una vez",
        "start": 3583.32,
        "end": 3609.32
    },
    {
        "text": " Los 70 de tribo que se produjeron, yo no los puedo contar acá dentro, no los puedo contar porque los 70 los usó en la harina y a su bes parte de la harina dos tacas los usó en la torta, entonces yo acá tengo que contar bienes y servicios finales",
        "start": 3610.32,
        "end": 3630.32
    },
    {
        "text": " y si voy a contar solo los finales, los factores que a mí me lleven a poder producir más o menos, no van a hacer las materias prima",
        "start": 3631.32,
        "end": 3639.32
    },
    {
        "text": " van a hacer los que yo acá abajo identifique y ahí quien aparece la tierra y el resto de recursos naturales que ha hablado",
        "start": 3640.32,
        "end": 3650.32
    },
    {
        "text": " Entonces, ponemos a los recursos naturales como otros factormas a nivel macro, recuerden que estamos con esto que es una función de producción de un país, nos dice la producción de un país de que depende de las materias primas que él mismo produce, nos queda en doje, no eso, referencia circular diría a la excel, si tengo esto acá que también está acá, no me cierre esa cuasi, entonces la producción de un país no puede depender de la",
        "start": 3650.32,
        "end": 3651.32
    },
    {
        "text": " idea de sus materias prima, las materias primas también van a estar acá, lo que es producción que se usa como materias primas está acá, lo que sí podría estar y eso salgo que la ficha no está el todo recogido y ahora les explico por qué, son los que sean materias primas importadas, si, esta sí podrían estar",
        "start": 3680.32,
        "end": 3700.32
    },
    {
        "text": " y en la ficha esas no están porque este esquema de análisis sigue un modelo este que yo les decía hoy y ese modelo tiene cierta formalidad que a veces en economía se trata de simplificar y ese modelo tiene en su formalización el supuesto de que no hay insumos importados",
        "start": 3701.32,
        "end": 3721.32
    },
    {
        "text": " pero como nosotros acá lo estamos pensando en sentido amplio, bueno, de qué depende que un país pueda producir más o menos y va a depender del trabajo que esté empleando, que se esté utilizando, de los medios de producción esto que denominábamos como capital, de la tecnología que combina todo lo demás, de los recursos naturales que se utilicen y de las materias primas importadas, lo que son materias primas en insumonacionales van a ser parte de la producción, entonces tenemos que ir como arrascar más atrás para ver cuál es la forma que se llama la producción, ¿no?",
        "start": 3721.32,
        "end": 3750.32
    },
    {
        "text": " y las elecciones efectivamente los factores que llevan aquí un país pueda producir más o pueda producirme, bien se entiende esta definición de producción y por lo tanto de sus factores, ¿sí?",
        "start": 3751.32,
        "end": 3768.32
    },
    {
        "text": " Matriz de transacciones, ¿es eso si estuvieron viendo? Bueno, eso de la matriz de transacciones está vinculado a esto, ¿no? que un sector tenga destino intermedio o uso intermedio y uso finales, ¿no? y por eso unos cuentan y otros no cuentan a la hora de estimar o de calcular el PBL.",
        "start": 3768.32,
        "end": 3791.32
    },
    {
        "text": " Tenemos entonces identificados, ¿quienes son los factores productivos a nivel agregado? Vamos a ver ahora cómo se relacion, son como los pasos que siempre vamos a ver, primero identificar cuáles son esas variables que me afectan a la otra y después ver cómo es la relación.",
        "start": 3799.32,
        "end": 3824.32
    },
    {
        "text": " Por ejemplo, si aumentan la cantidad de trabajadores, ¿qué podemos esperar que pase con la producción? ¿un país se emplea magente para utilizar sus insumos, sus recursos naturales, medios de producción? ¿que aumenta la producción?",
        "start": 3824.32,
        "end": 3846.32
    },
    {
        "text": " Lo lógico es que si hay magente trabajando se pueda producir más, ¿sí? Si aumenta la cantidad de capital, de medios de producción, de instalaciones, máquinas, equipamientos, ¿qué podemos esperar que pase con la producción de un país?",
        "start": 3846.32,
        "end": 3865.32
    },
    {
        "text": " Esto puede ser en cantidad o en calidad, cualquiera de los dos, ¿no? También podemos esperar que aumenta y lo mismo con los otros, ¿no?",
        "start": 3865.32,
        "end": 3874.32
    },
    {
        "text": " con los recursos naturales y también con un cambio tecnológico, el Z lo definimos como una mejora tecnológica, entonces cualquiera de estos que estén mejorando en cantidad o en calidad van a implicar que la producción de un país sea mayor.",
        "start": 3874.32,
        "end": 3891.32
    },
    {
        "text": " Esto es decir que si aumenta el otra aumenta en términos más matemáticos también lo podemos representar de esta manera, derivada no más.",
        "start": 3892.32,
        "end": 3904.32
    },
    {
        "text": " Si, bien, si uno aumenta el otra aumenta, bueno la derivada de eso tiene que ser positivo, la derivada generalmente le vamos a interpretar como me está cambiando la producción ante cambios infinitesimales en la cantidad de trabajadores.",
        "start": 3905.32,
        "end": 3924.32
    },
    {
        "text": " Y este concepto le llamamos productividad marginal, en este caso es del trabajo pero también las otras también tienen lo mismo, ¿no?",
        "start": 3924.32,
        "end": 3938.32
    },
    {
        "text": " Ideen para cualquiera de estas.",
        "start": 3941.32,
        "end": 3943.32
    },
    {
        "text": " Todos van a tener entonces una derivada primera positiva, derivada primera, si hablamos en términos matemáticos, productividad, si hablamos en términos económicos.",
        "start": 3944.32,
        "end": 3955.32
    },
    {
        "text": " Muchas de las cosas, aunque todavía no hemos hecho muchos en economía se llevan un gráfico, en economía, en los planteos, en las modelizaciones se utilizan en términos formales, más de cuaciones y en términos gráficos más para simplificar y sacar conclusiones más rápidas.",
        "start": 3956.32,
        "end": 3977.32
    },
    {
        "text": " Por cuestión de cantidad de clases, en este curso vamos a tratar de siguiendo lo más sencillo posible pero deber representaciones gráficas y no tanto modelos formales porque no llevaría una clase ver un modelo.",
        "start": 3978.32,
        "end": 3991.32
    },
    {
        "text": " Entonces, si yo quiero poner a Cacu y a Capon Goelle, ¿cómo represento esta relación? Entre estas dos variables que acabamos de hablar trabajo y producción.",
        "start": 3992.32,
        "end": 4008.32
    },
    {
        "text": " Si no uso trabajadores, si en el país hacemos un paro todos, ¿quién prende las máquinas, quién no usa si sumo, nadie? Si usamos esta cantidad, ¿sí?",
        "start": 4009.32,
        "end": 4027.32
    },
    {
        "text": " Ponemos el EQ, acá tenemos un aumento, vamos a poner así acá. Si aumento 10% de la cantidad de trabajadores, ponemos el que la producción aumenta 5%.",
        "start": 4028.32,
        "end": 4048.32
    },
    {
        "text": " Acá tendríamos los 40 mil millones de dólares, ¿no? Y acá podemos decir que tenemos un millón y medio de personas. ¿Qué pasa si vuelve a aumentar 10%? La cantidad de trabajadores.",
        "start": 4049.32,
        "end": 4068.32
    },
    {
        "text": " ¿Me ha aumentado otra vez 5% acá la producción? ¿Homenta más? ¿Homenta menos lo mismo? ¿Eh?",
        "start": 4069.32,
        "end": 4086.32
    },
    {
        "text": " ¿Pensemos en la soja? ¿Le metemos más gente? Sí, al prédio, más trabajadores. ¿No os puede afectar el clima?",
        "start": 4086.32,
        "end": 4109.32
    },
    {
        "text": " Pero como queremos analizar el impacto de la cantidad de trabajos sobre la producción, supongamos que el clima los recursos naturales se mantienen.",
        "start": 4109.32,
        "end": 4117.32
    },
    {
        "text": " ¿Sí? Este análisis tiene implícito que los recursos naturales lo dejamos constante, que la maquinaria que estamos utilizando la dejamos constante y que la tecnología es el mismo.",
        "start": 4117.32,
        "end": 4131.32
    },
    {
        "text": " ¿Me metemos más gente a trabajar con la misma máquina, los mismos recursos, la misma tecnología? ¿Homenta la misma proporción, la producción?",
        "start": 4131.32,
        "end": 4145.32
    },
    {
        "text": " ¿Qué aumenta? Ya lo planteamos acá. El tema es en cuanto aumenta, es constante esta relación. Si yo aumento de un factor productivo, el uso de un factor productivo y los demás lo dejo constante,",
        "start": 4145.32,
        "end": 4158.32
    },
    {
        "text": " ¿Maginemos ese prédio, donde estamos plantando soja? ¿Va a aumentar la soja y seguimos metiendo gente y la soja va a seguir creciendo cada vez más?",
        "start": 4158.32,
        "end": 4167.32
    },
    {
        "text": " ¿Parecería que esto tiene cierto agotamiento? Entonces esto deberíamos de representarlo de algo más o menos así, donde está a escú que es una función de él y de todos los demás, fija, ¿no?",
        "start": 4167.32,
        "end": 4183.32
    },
    {
        "text": " Y esto está asociado a algo que le vamos a llamar los rendimientos marginales y los rendimientos marginales en términos matemáticos van a estar representados por la derivada segunda, que la que nos mide nos determina ahí la forma en la que crece, ¿no?",
        "start": 4188.32,
        "end": 4217.32
    },
    {
        "text": " Y esta es negativo. O sea, identificamos una serie de factores productivos que afectan a la producción de un país.",
        "start": 4218.32,
        "end": 4232.32
    },
    {
        "text": " Decimos que cuando esos factores suen, aumenten la producción va a aumentar, pero eso tiene un límite porque ir aumentando los factores productivos genera cierto desgaste en el uso de los demás, ¿sí?",
        "start": 4232.32,
        "end": 4246.32
    },
    {
        "text": " En esta mirada está tiga que estamos haciendo y por eso sumimos esto que por ser negativo hablamos desde crecientes.",
        "start": 4246.32,
        "end": 4254.32
    },
    {
        "text": " Y acabamos de una productividad positiva. La productividad es positiva, a más factor más producción, ahora el rendimiento es de creciente, a más producción, a más factor productivo, la producción aumenta pero cada desmeno.",
        "start": 4255.32,
        "end": 4274.32
    },
    {
        "text": " Aumenta tasa de creciente.",
        "start": 4275.32,
        "end": 4279.32
    },
    {
        "text": " Ejemplo en el agro cuando uno trabaja cada vez más, la misma tierra le metemos cada vez más gente, se van a empezar a pisar, ya va a ver mucha gente para manejar la misma cosechadora.",
        "start": 4282.32,
        "end": 4294.32
    },
    {
        "text": " Eso lo estamos analizando en relación, trabajo con producción, ¿pero qué pasa si analizáramos capital con producción?",
        "start": 4294.32,
        "end": 4306.32
    },
    {
        "text": " Yo ahora quiero ver otro, quiero ver la relación entre el capital y la producción.",
        "start": 4307.32,
        "end": 4318.32
    },
    {
        "text": " Entonces ahora imaginemos un call center, ¿sí? Tenemos dos personas, chiquito el call center, dos personas con dos teléfonos.",
        "start": 4321.32,
        "end": 4331.32
    },
    {
        "text": " ¿Y producen? Dos personas producen 100 llamadas, ¿qué pasa si metemos cuatro personas? ¿Qué es esperable que suceda?",
        "start": 4331.32,
        "end": 4343.32
    },
    {
        "text": " ¿Cuatro personas? No, cuatro personas, no, cuatro teléfonos, ¿no?",
        "start": 4346.32,
        "end": 4352.32
    },
    {
        "text": " Sí, acá capital, perdón, en qué o qué yo? Dos personas con dos teléfonos, producen 100 llamadas, ahora el call center no está yendo bien, entonces el dueño el call center compra dos teléfonos más, ahora hay cuatro teléfonos, pero tenemos dos personas, capaz que con una mano agarró un teléfono, mientras el otro los pone en espera, no sé cuánto, ¿sí?",
        "start": 4353.32,
        "end": 4374.32
    },
    {
        "text": " Entonces la producción pongamos en el que aumenten, pero no va a aumentar a 200, va a aumentar a 150, y si el empresario le compra dos teléfonos más, ¿hay estas dos personas?",
        "start": 4374.32,
        "end": 4386.32
    },
    {
        "text": " ¿Tres teléfonos? Para dos personas, para cada una de las personas, para dos manos que tienen cada persona, entonces esto devuelta también, puede aplicar la misma lógica,",
        "start": 4388.32,
        "end": 4401.32
    },
    {
        "text": " que si sólo aumentamos uno de los factores productivos, esto ahora sería una función en este gráfico, ¿no?",
        "start": 4401.32,
        "end": 4408.32
    },
    {
        "text": " que estamos representando en función de K, pero para un eledado, para unos recursos naturales dados y una tecnología dado.",
        "start": 4408.32,
        "end": 4415.32
    },
    {
        "text": " Entonces, esta idea de los rendimientos marginales, de crecientes, de que este crecimiento de la producción sí se da por la productividad positiva,",
        "start": 4415.32,
        "end": 4427.32
    },
    {
        "text": " porque cada vez que use más de un factor, la producción va a aumentar, pero cada vez menos, pues se va desgastando, se va agotando, mejor dicho, las posibilidades del crecimiento de esa producción.",
        "start": 4427.32,
        "end": 4439.32
    },
    {
        "text": " Lo que debería pasar es que hay que comprar más teléfonos, que debería ser el empresario también.",
        "start": 4439.32,
        "end": 4445.32
    },
    {
        "text": " Contratar más gente, como vemos en este gráfico que contrate más gente, un aumento de L, tenemos que la relación entre K y K era esto.",
        "start": 4446.32,
        "end": 4458.32
    },
    {
        "text": " Ahora, si cambiamos L y ahora, en vez de L, su cero es un L sub 1, que implica mayor cantidad de trabajadores.",
        "start": 4458.32,
        "end": 4467.32
    },
    {
        "text": " Estos 6 van a producir esto más, entonces la función de producción que me representa la relación entre el capital y la producción va a ser otra, una función G sería, ¿no?",
        "start": 4468.32,
        "end": 4487.32
    },
    {
        "text": " Con un L sub 1, que aumentó.",
        "start": 4488.32,
        "end": 4492.32
    },
    {
        "text": " Esto para no quedarnos con que siempre es todo estático y solo, si bien vamos siempre a tratar de mirar de a uno de las cosas, si ver esto de la cadena causal, de que si pasa una cosa, como vemos el efecto sobre otra,",
        "start": 4500.32,
        "end": 4511.32
    },
    {
        "text": " acá también uno puede analizar en la relación capital, producción, ¿qué pasa con esa relación? Si aumenta otro en los factores productivos.",
        "start": 4511.32,
        "end": 4519.32
    },
    {
        "text": " Y acá lo que me va a provocar es que aumenta la productividad y capital, ¿sí? Porque las mismas cantidades de teléfonos van a rendir más llamadas porque se está poniendo más gente.",
        "start": 4519.32,
        "end": 4530.32
    },
    {
        "text": " Entonces, para resumir nuestra idea de la producción, de que depende, lo vamos a hacer, poniéndole algunos símbolos acá, en realidad el signo de en más o el signo de menos, este también ¿no?",
        "start": 4531.32,
        "end": 4555.32
    },
    {
        "text": " Pero no le vamos a dar mucha bolilla a ese porque no lo tenemos en la ficha, entonces no vamos a complicar ¿no?",
        "start": 4556.32,
        "end": 4563.32
    },
    {
        "text": " Lo que nos va a decir de esta expresión es la producción de un país depende de estos factores productivos y depende este símbolo de más acá lo que me está diciendo es esto.",
        "start": 4563.32,
        "end": 4577.32
    },
    {
        "text": " La relación es directa, cuando aumenta uno el factor productivo aumenta la producción. Esto acá es el signo positivo o esta derivada primera, ¿cómo quiera?",
        "start": 4578.32,
        "end": 4589.32
    },
    {
        "text": " Bien. ¿Sí? ¿Hay una pregunta?",
        "start": 4589.32,
        "end": 4600.32
    },
    {
        "text": " ¿Conultas?",
        "start": 4608.32,
        "end": 4617.32
    },
    {
        "text": " ¿En algunas clases, a veces, esto debería haberlo dicho, cuando teníamos la receta ahí de la torta, ¿no?",
        "start": 4618.32,
        "end": 4630.32
    },
    {
        "text": " Pero cuando pensábamos, no, preguntaba yo, tiraba para ir armando los ingredientes, había gente que decía, ¿qué precisamos para producir la torta?",
        "start": 4630.32,
        "end": 4640.32
    },
    {
        "text": " ¿Qué es la gente que decía plata? Dinero, ¿sí? El dinero nos está acá, recordemos que este caca, que está acá, es capital físico.",
        "start": 4641.32,
        "end": 4652.32
    },
    {
        "text": " Si ni hay gente que habla capital financiero y está bien en el término capital financiero, esto acá es capital físico.",
        "start": 4652.32,
        "end": 4659.32
    },
    {
        "text": " Digimos que para hablar de esto, alamente tiene que venir una fábrica, equipos, maquinarias, ¿sí? No dinero acá.",
        "start": 4660.32,
        "end": 4670.32
    },
    {
        "text": " Ahora el dinero nos está acá, ¿por qué no está?",
        "start": 4672.32,
        "end": 4678.32
    },
    {
        "text": " Cuando hacemos la torta, el dinero lo ponemos ahí en la batidora, en la licuadora para mezclar, batidora para la torta.",
        "start": 4679.32,
        "end": 4688.32
    },
    {
        "text": " ¿Lo precisamos si el dinero para hacer la torta?",
        "start": 4688.32,
        "end": 4690.32
    },
    {
        "text": " Lo precisamos si el dinero para hacer la torta, pero no es parte de los ingredientes. Esto de acá nos está diciendo, y vuelvo a lo de hoy, esto es una relación física.",
        "start": 4690.32,
        "end": 4700.32
    },
    {
        "text": " Acá nos está diciendo que la cantidad de kilos de torta depende de esto y depende de los ingredientes.",
        "start": 4700.32,
        "end": 4707.32
    },
    {
        "text": " Ahora yo estoy los ingredientes, lo tengo que comprar, sí. Voy a precisar dinero para comprarlo, pero el dinero nos toca en la función de producción.",
        "start": 4707.32,
        "end": 4715.32
    },
    {
        "text": " Está claro.",
        "start": 4715.32,
        "end": 4717.32
    },
    {
        "text": " Por ejemplo, él él este, ¿quién es él este que ponemos acá? En la función de producción, en el de la torta. ¿Qué poníamos a las cinco personas que estaban en esa casa esperando la torta?",
        "start": 4718.32,
        "end": 4729.32
    },
    {
        "text": " Ponemos acá en la función de producción de la torta, ponemos a las cinco personas.",
        "start": 4729.32,
        "end": 4734.32
    },
    {
        "text": " A solo a los que la cocina, ¿sí?",
        "start": 4734.32,
        "end": 4738.32
    },
    {
        "text": " Lesto es una relación técnica, no se está diciendo, el que está cocinando la torta, ¿cómo está usando esos ingredientes?",
        "start": 4738.32,
        "end": 4745.32
    },
    {
        "text": " Y la demanda, esos cinco, ¿qué son los que la querían comer? ¿Dónde lo ponemos acá?",
        "start": 4745.32,
        "end": 4750.32
    },
    {
        "text": " Y eso nos toca, porque no va, porque acá es la torta que se va a ofrecer, la torta que va a salir.",
        "start": 4750.32,
        "end": 4758.32
    },
    {
        "text": " Y no importa si son tres kilos después había ocho o quince para comer.",
        "start": 4758.32,
        "end": 4763.32
    },
    {
        "text": " Acá lo que va a salir, lo que uno ponga acá dentro y los que uno trabaje.",
        "start": 4764.32,
        "end": 4768.32
    },
    {
        "text": " Si había después más personas ahí en la vuelta, eso no va en la función de producción.",
        "start": 4768.32,
        "end": 4772.32
    },
    {
        "text": " Por eso, la función de producción, lo que me dice son los factores productivos que uno está utilizando. ¿Bien?",
        "start": 4772.32,
        "end": 4781.32
    },
    {
        "text": " Entonces, tratando de resumir esta parte de la oferta agregada, ya identificamos.",
        "start": 4782.32,
        "end": 4793.32
    },
    {
        "text": " ¿Cuáles son esos factores productivos? ¿Cómo es la relación de los factores productivos con la producción?",
        "start": 4793.32,
        "end": 4801.32
    },
    {
        "text": " Y ahora vamos a dar un paso más y es diferenciar estos de este.",
        "start": 4802.32,
        "end": 4809.32
    },
    {
        "text": " Estos vamos a decir que son relativamente fijo a corto plazo.",
        "start": 4812.32,
        "end": 4823.32
    },
    {
        "text": " Y acá esto ya se vincula un poco con lo que hablábamos hoy al principio,",
        "start": 4824.32,
        "end": 4829.32
    },
    {
        "text": " es si queremos mirar enfocar nuestra mirada en el corto o en el largo plazo.",
        "start": 4829.32,
        "end": 4834.32
    },
    {
        "text": " A nivel agregado de una economía, el estoque de maquinaria, sequipos, instalaciones, cambios tecnológicos, recursos naturales,",
        "start": 4834.32,
        "end": 4844.32
    },
    {
        "text": " son variables que tienen más un horizonte de largo plazo.",
        "start": 4844.32,
        "end": 4848.32
    },
    {
        "text": " Cambios en estas variables, cambios importantes en estas variables son más a largo plazo, son las que explican más el crecimiento a largo plazo de una economía.",
        "start": 4849.32,
        "end": 4858.32
    },
    {
        "text": " Mientras que a corto plazo la variable clave es el trabajo.",
        "start": 4858.32,
        "end": 4866.32
    },
    {
        "text": " Y ahora vamos a dar un paso más y la nueva economía.",
        "start": 4878.32,
        "end": 4885.32
    },
    {
        "text": " Y ahora vamos a dar un paso más y la nueva economía.",
        "start": 4885.32,
        "end": 4889.32
    },
    {
        "text": " Entonces, como esta es la variable clave a largo plazo, vamos a analizar ahora, a empezar a analizar,",
        "start": 4889.32,
        "end": 4918.32
    },
    {
        "text": " el mercado de trabajo.",
        "start": 4918.32,
        "end": 4927.32
    },
    {
        "text": " Un mercado de trabajo que se compone de una demanda y de una oferta.",
        "start": 4927.32,
        "end": 4946.32
    },
    {
        "text": " En un lado vamos a tener a quienes quieren contratar gente, que es algo que le llamamos la demanda de trabajo,",
        "start": 4946.32,
        "end": 4953.32
    },
    {
        "text": " y por otro a los que quieren ofrecer gente, la mano de obra, que son los hogares.",
        "start": 4953.32,
        "end": 4960.32
    },
    {
        "text": " Por eso acá, primera cosa, definamos que es cada una de estas variables, quírese la gente económico que está detrás.",
        "start": 4960.32,
        "end": 4969.32
    },
    {
        "text": " Acá están detrás, las empresas, acá están detrás los hogares.",
        "start": 4969.32,
        "end": 4989.32
    },
    {
        "text": " Estábamos con la oferta agregada, llegamos casi al final, pero como llegamos ahí a esa parte y vemos que uno de los factores de la oferta agrega ese trabajo,",
        "start": 4989.32,
        "end": 5000.32
    },
    {
        "text": " el LST, tenemos que meternos a analizar el mercado de trabajo. Estamos como adentro de la oferta agregada, apareció esto.",
        "start": 5000.32,
        "end": 5007.32
    },
    {
        "text": " Para qué nos metemos a ver el mercado de trabajo, para ver cómo es que se determina quién es este L que ponemos acá.",
        "start": 5007.32,
        "end": 5015.32
    },
    {
        "text": " Con el ejemplo que decíamos hoy de la torta, ¿quién es este L que voy a poner acá?",
        "start": 5015.32,
        "end": 5020.32
    },
    {
        "text": " La cantidad de los 3 millones de habitantes, en el caso de Uruguay, el millón y medio, que son los que trabajan,",
        "start": 5020.32,
        "end": 5027.32
    },
    {
        "text": " los 2 millones 800, que son los mayores de 14 años, ¿quién es el L que vamos a poner acá?",
        "start": 5027.32,
        "end": 5034.32
    },
    {
        "text": " O los puestos de trabajo que las empresas ofrecen.",
        "start": 5034.32,
        "end": 5037.32
    },
    {
        "text": " El otro 3 casos estaba pensando más por este lado.",
        "start": 5037.32,
        "end": 5041.32
    },
    {
        "text": " Por eso es que nos metemos a ver esto.",
        "start": 5041.32,
        "end": 5043.32
    },
    {
        "text": " El mercado de trabajo vamos a analizarlo ahora, vamos a ver algunas cuestiones de cómo funciona ni qué elementos son los claves ahí,",
        "start": 5043.32,
        "end": 5051.32
    },
    {
        "text": " porque apareció esto acá y es importante ver bien esta variable.",
        "start": 5051.32,
        "end": 5056.32
    },
    {
        "text": " Además, porque justo es la que nos explica más, los cambios a corto plazo en el PBI en un país.",
        "start": 5056.32,
        "end": 5062.32
    },
    {
        "text": " Entonces, ver qué pasa con los mercados de trabajo toma esa importancia.",
        "start": 5062.32,
        "end": 5068.32
    },
    {
        "text": " Entonces, primera organización, mercado de trabajo, lo clave en el mercado de trabajo es la persona,",
        "start": 5068.32,
        "end": 5075.32
    },
    {
        "text": " el factor productivo trabajo. ¿Sí? Por eso, ¿quién es dueño a ese factor productivo?",
        "start": 5075.32,
        "end": 5083.32
    },
    {
        "text": " ¿Quién es el dueño de lo que acá se está tratando de transar de negociar?",
        "start": 5084.32,
        "end": 5089.32
    },
    {
        "text": " ¿Quién es el dueño de el factor productivo trabajo?",
        "start": 5090.32,
        "end": 5093.32
    },
    {
        "text": " El factor productivo trabajo, ¿cuál es? La mano de obra, las manos. ¿Quién es el dueño de eso?",
        "start": 5096.32,
        "end": 5102.32
    },
    {
        "text": " El hogar y por eso lo ofrece. ¿Quién quiere contratar a esa mano de obra?",
        "start": 5102.32,
        "end": 5109.32
    },
    {
        "text": " La empresa. Por eso el concepto de ofarte y demanda está ligado a que lo que tenemos acá en el mercado de trabajo es que se transa el factor productivo trabajo.",
        "start": 5109.32,
        "end": 5118.32
    },
    {
        "text": " No se transa el puesto de trabajo. ¿Sí? El gallito Luis tiene el foco en ese otro lado ¿no?",
        "start": 5118.32,
        "end": 5124.32
    },
    {
        "text": " Gallito Luis lo vieron últimamente.",
        "start": 5125.32,
        "end": 5128.32
    },
    {
        "text": " Cuando habla de oferta de trabajo, ¿qué es lo que aparece en la parte de oferta de trabajo?",
        "start": 5130.32,
        "end": 5135.32
    },
    {
        "text": " ¿Y gallito Luis? ¿Eh? El puesto de trabajo ¿no?",
        "start": 5135.32,
        "end": 5141.32
    },
    {
        "text": " La empresa que busca trabajo. Pero acá no estamos diciendo que la empresa es la que ofrece trabajo.",
        "start": 5141.32,
        "end": 5147.32
    },
    {
        "text": " El gallito Luis que lo que dice, el que ofrece el puesto de trabajo es la empresa.",
        "start": 5148.32,
        "end": 5153.32
    },
    {
        "text": " Pero el foco en el gallito Luis tan el puesto de trabajo.",
        "start": 5153.32,
        "end": 5156.32
    },
    {
        "text": " Acá el foco está en el factor productivo trabajo. El NL no es el puesto sino que es la mano de obra que está trabajando ¿Sí?",
        "start": 5156.32,
        "end": 5165.32
    },
    {
        "text": " Si arrancamos con la empresa vamos a quedarme justo para terminarlo hoy. Vamos a la parte de los hogares.",
        "start": 5178.32,
        "end": 5185.32
    },
    {
        "text": " Vamos a ver cómo toma decisiones. Los hogares a la hora de ofrecer su mano de obra, el factor productivo y las empresas lo tomamos en la clase que hay.",
        "start": 5185.32,
        "end": 5195.32
    },
    {
        "text": " El análisis... Bueno, los dos análisis estos que vamos a estar viendo acá van a ver que tiene un cejo que es microeconómico.",
        "start": 5196.32,
        "end": 5207.32
    },
    {
        "text": " Y de hecho esto lo van a volver a ver cuando en las últimas partes del curso vean con Gustavo el bloque de micro.",
        "start": 5207.32,
        "end": 5216.32
    },
    {
        "text": " Entonces, para analizar cómo hacen los hogares a la hora de ver cuántas horas de trabajo van a ofrecer en un país,",
        "start": 5217.32,
        "end": 5223.32
    },
    {
        "text": " este se plantea el dilema de decidir de una decisión de qué hacer con las 24 horas de un día.",
        "start": 5223.32,
        "end": 5238.32
    },
    {
        "text": " Y eso simplifica un análisis diario para salos en sí yo lo podríamos ser mensuala, no al importan, pero en un día es más fácil de ilustrarlo.",
        "start": 5239.32,
        "end": 5247.32
    },
    {
        "text": " Y dice bueno, ¿cuál es la decisión que tiene que tomar una persona que hacer con sus 24 horas?",
        "start": 5247.32,
        "end": 5253.32
    },
    {
        "text": " Y esa decisión vinculada del mercado de trabajo es cuantas horas quiere trabajar, ofrecer de trabajo y cuantas horas quiere no trabajar.",
        "start": 5253.32,
        "end": 5265.32
    },
    {
        "text": " Y a esto le vamos a llamar Ocio. O sea, decisión de una persona en torno al mercado de trabajo es ver qué cosas le oyeven a decir quiero de esas 24 tantas trabajar y tantas de Ocio.",
        "start": 5266.32,
        "end": 5283.32
    },
    {
        "text": " Y el Ocio es esparcimiento, no hace nada, pero es dormir, es descansar, también tiene necesidades, ¿no?",
        "start": 5283.32,
        "end": 5291.32
    },
    {
        "text": " O sea, Ocio es todo lo demás que no es trabajo. Bien, y vamos a trabajar con un ejemplo.",
        "start": 5292.32,
        "end": 5304.32
    },
    {
        "text": " Supongamos que estamos trabajando cuatro horas, que la persona está trabajando cuatro horas y le están ofreciendo un salario de 15.",
        "start": 5306.32,
        "end": 5319.32
    },
    {
        "text": " Vamos a hablar de salario ahora para no confundir, no mezclado. Vamos a hablar de un salario 1500 por hora.",
        "start": 5322.32,
        "end": 5331.32
    },
    {
        "text": " Bien, imaginemos lo que es, ¿no? Ustedes están trabajando cuatro horas, la decisión que usted tomara en trabajar cuatro horas y qué pasa si aumenta el salario.",
        "start": 5331.32,
        "end": 5344.32
    },
    {
        "text": " ¿En qué afecta esta decisión? Vamos a pensar en eso, antes, ¿por qué la gente quiere trabajar?",
        "start": 5345.32,
        "end": 5353.32
    },
    {
        "text": " ¿Por qué con esto va a obtener un salario y para que quiera un salario? ¿De qué? ¿De qué? ¿De Sinario bolsillo?",
        "start": 5361.32,
        "end": 5371.32
    },
    {
        "text": " ¿Quiere comprar bienes y servicios? ¿Quiere comprar bienes, ¿no? ¿cu? ¿Y por qué quiere bienes y servicios? ¿Por qué quiere comer? ¿Por qué quiere Alcine?",
        "start": 5374.32,
        "end": 5387.32
    },
    {
        "text": " ¿Para Satifacer? ¿Necesidades? ¿Sí? El final de querer trabajar, lo hacemos bien materialista y es quiero vista, porque quiero bienes, porque quiero Satifacer necesidades materiales.",
        "start": 5387.32,
        "end": 5414.32
    },
    {
        "text": " Ahora, ¿por qué quiero ocio también? Voy a quiero quedarme en mi casa, ir a la rambla, tomar mate, ¿por qué? ¿Por qué eso directamente me satiface necesidades? ¿Sí?",
        "start": 5415.32,
        "end": 5438.32
    },
    {
        "text": " Y para ilustrarnos en esto tenemos a unas necesidades más materialistas y otras más espiritualistas ¿Sí? ¿Y lo que quiere la persona es que esto sea? Vamos a ponerle lo máximo posible, ¿quiere lograr lo máximo de satisfacción de necesidades?",
        "start": 5439.32,
        "end": 5464.32
    },
    {
        "text": " Vamos a pensar que esta decisión tiene que ser una decisión que vamos a agregarle acá, racional, no, vamos a ponerle acá, vamos a ponerle acá, bien cerca de este maxi.",
        "start": 5465.32,
        "end": 5478.32
    },
    {
        "text": " La decisión es racional que tiene que tomar esta persona y esa racionalidad pasa por qué esto sea lo máximo posible que puedas satisfacer de necesidades. ¿Está claro?",
        "start": 5479.32,
        "end": 5497.32
    },
    {
        "text": " Entonces, teniendo ese panorama, tomando como punto de partida que estamos trabajando cuatro horas y que las otras veinte horas, vamos a poner por acá.",
        "start": 5498.32,
        "end": 5508.32
    },
    {
        "text": " Osio igual a veinte, ¿Sí? Con este salario tomamos esa decisión, ¿qué pasa si vamos al trabajo?",
        "start": 5509.32,
        "end": 5522.32
    },
    {
        "text": " Los está esperando el jefe con un cafésito, les dice, hablé con el profe de usted, vamos a aumentarle el salario porque están aprendiendo, no están estudiando.",
        "start": 5523.32,
        "end": 5534.32
    },
    {
        "text": " Y vamos a poner un salario, les aumentaron el salario a 1.800 por hora. ¿Qué hacen?",
        "start": 5534.32,
        "end": 5546.32
    },
    {
        "text": " ¿Qué hacen? Jefe, los está esperando, les pregunto eso y ahora la pregunta es ¿quieren trabajar más horas? ¿quieren trabajar menos horas? ¿Qué pasan del aumento del salario con esta variable? ¿Qué hacen ustedes?",
        "start": 5547.32,
        "end": 5568.32
    },
    {
        "text": " Les pasa eso, le aumentan el sueldo y les dejan a él a elegir, ¿qué decían ustedes? ¿Pasan a trabajar seis horas, ocho horas, sí en trabajando las cuatro? ¿Pasan a trabajar dos?",
        "start": 5569.32,
        "end": 5585.32
    },
    {
        "text": " ¿Qué es eso? ¿Qué es eso? ¿Qué es eso?",
        "start": 5586.32,
        "end": 5590.32
    },
    {
        "text": " Compañero trabaja más horas. ¿Qué es eso?",
        "start": 5590.32,
        "end": 5592.32
    },
    {
        "text": " Compañero trabaja más horas, ¿qué pasa con la variable?",
        "start": 5592.32,
        "end": 5598.32
    },
    {
        "text": " Le está diciendo materialista del compañero, que es un materialista.",
        "start": 5598.32,
        "end": 5604.32
    },
    {
        "text": " Si sube el salario va a subir esto de acá, ¿no? Si sube el salario, además se metemos más horas de trabajo, esta necesidad va a aumentar esa satisfacción de necesidades, ¿no?",
        "start": 5605.32,
        "end": 5616.32
    },
    {
        "text": " Pero si subimos acá abajo a esto, el tema es en el balance de este, pongamos el que esa sea la decisión.",
        "start": 5616.32,
        "end": 5625.32
    },
    {
        "text": " Entonces el compañero se va a ocho horas y le quedan 16 horas de ocio, ¿sí?",
        "start": 5625.32,
        "end": 5635.32
    },
    {
        "text": " Y al mes que viene, vuelve a pasarlo mismo, dos mil cien la hora.",
        "start": 5637.32,
        "end": 5645.32
    },
    {
        "text": " Perdón, cuando aumenta el salario, ¿por qué el compañero quiere trabajar más horas?",
        "start": 5645.32,
        "end": 5657.32
    },
    {
        "text": " ¿Por qué esta variable salario generalmente se mida, se mida, digo, con arremida? ¿Cómo costo de oportunidad?",
        "start": 5657.32,
        "end": 5671.32
    },
    {
        "text": " De ilocio. Este es un concepto del costo oportunario que se usa en muchas oportunidades en economía. ¿Qué quiere decir el costo oportunario?",
        "start": 5675.32,
        "end": 5687.32
    },
    {
        "text": " El ocio tiene un costo que yo me vaya a la rambla, que yo me quede viendo el atelio, que me quede durmiendo, le pago a alguien, costo en ese sentido y que gasto plata.",
        "start": 5687.32,
        "end": 5699.32
    },
    {
        "text": " No, pero ¿qué pasa con esas horas que yo estoy en la rambla o que estoy durmiendo? Me estoy perdiendo de ganar esto.",
        "start": 5699.32,
        "end": 5707.32
    },
    {
        "text": " ¿Costa oportunidad es eso? Me pierdo de ganar esto. Entonces, si a mí me sube el salario, eso es un incentivo a que, a que si yo me quedo en mi casa, me estoy perdiendo más tos había ganado.",
        "start": 5707.32,
        "end": 5719.32
    },
    {
        "text": " No me estoy perdiendo mil quinientos, me estoy perdiendo mil ochocientos. Entonces, ¿en qué me incentivo a que suba el salario, en que me sale más caro quedarme en mi casa, quedarme con horas de ocio?",
        "start": 5719.32,
        "end": 5730.32
    },
    {
        "text": " Entonces, aumento las horas de trabajo. Seguimos, acá hay una mezcla de que ese costo hace más caro quedarme en mi casa y además de que yo estoy viendo la oportunidad de que puedo tener más necesidades, satisfacción en necesidades materiales.",
        "start": 5730.32,
        "end": 5747.32
    },
    {
        "text": " Ahora, estoy trabajando de churas y me aumentan a dos mil cien, vuelvo a tener un nuevo salario. Entonces, como yo le había entendido al profesor de la clase, que esto era el costo oportunidad y si suba el salario tengo que volver a ser un costo.",
        "start": 5747.32,
        "end": 5759.32
    },
    {
        "text": " Si suba el salario tengo que bajar el ocio, sigo con lo mismo. Entonces, me voy a 14 horas de trabajo y 10 de ocio.",
        "start": 5759.32,
        "end": 5771.32
    },
    {
        "text": " Y vuelve a aumentar el salario y yo sigo bien tabulado y digo bueno.",
        "start": 5771.32,
        "end": 5783.32
    },
    {
        "text": " Las necesidades materiales como las tengo. Supercubiertas, parecería. Por acá son casi todas mis necesidades, satisfacción de necesidades, la utilidad que está logrando en la persona viene toda por acá.",
        "start": 5783.32,
        "end": 5801.32
    },
    {
        "text": " Ahora, ¿qué pasa con las horas para dormir? Porque en esta sete tiene que dormir, comer, divertirse, estar con la familia.",
        "start": 5801.32,
        "end": 5810.32
    },
    {
        "text": " ¿Sí? Entonces, ¿capas que cuando acáúmen todos 20, qué decisión podía haber tenido el consumido en la persona?",
        "start": 5810.32,
        "end": 5820.32
    },
    {
        "text": " ¿Por qué? Porque ¿qué es lo que está pasando? Cuando suba el salario, cuando está subiendo el salario, yo que puedo hacer si mantengo las mismas horas con un salario más alto.",
        "start": 5820.32,
        "end": 5836.32
    },
    {
        "text": " Voy a tener igual un incremento en la cantidad de plata. Las mismas horas con un salario más alto, tengo más plata.",
        "start": 5836.32,
        "end": 5850.32
    },
    {
        "text": " O incluso podría pasar con menos horas o falta de horas. Capaje también hasta podría depende cuál pese más. También podría tener un aumento de esto.",
        "start": 5850.32,
        "end": 5862.32
    },
    {
        "text": " Entonces, esta relación de acá que nosotros decíamos, bueno, aumenta el salario, aumenta la oferta de trabajo, eso lo podemos reflejar de la siguiente manera.",
        "start": 5862.32,
        "end": 5874.32
    },
    {
        "text": " Cuando aumenta el salario, la persona tiene un efecto que es querer trabajar más horas, que es lo que hablamos hoy y que lo vamos a resumir por denominándolo el efecto sustitución.",
        "start": 5874.32,
        "end": 5891.32
    },
    {
        "text": " ¿Qué sustituye lo que sale más caro el osio por trabajo? Sí, esto es sustituye, osio por trabajo.",
        "start": 5891.32,
        "end": 5903.32
    },
    {
        "text": " Suel salario hay un parte de mi inconsciente que me está diciendo, andá a trabajar más horas, porque quedarte sin trabajar, es muy caro.",
        "start": 5903.32,
        "end": 5914.32
    },
    {
        "text": " Te está perdiendo mucho, de ganar. Entonces, el efecto sustituye, me dice, trabajar más horas. Pero a su vez hay otra parte de mi inconsciente que me dice, trabaja menos, porque tienes un efecto ingreso.",
        "start": 5914.32,
        "end": 5930.32
    },
    {
        "text": " Y lo que está diciendo el efecto ingreso es que al aumentar el salario ya eso de por sí, con mismas horas o con menos horas, incluso podría tener más ingreso, más plata.",
        "start": 5930.32,
        "end": 5945.32
    },
    {
        "text": " Y lo que tenemos es entonces un resultado que es ambiguo.",
        "start": 5945.32,
        "end": 5952.32
    },
    {
        "text": " Sí, acá hay una ambigueda teórica.",
        "start": 5952.32,
        "end": 5961.32
    },
    {
        "text": " ¿Cuál pesa más de estos dos? Y va a depender de la persona, se dice, uno capaz que es más materialista, define de una manera, otro más espiritualista, otro que no, que es materialista, pero igual decide de otra manera.",
        "start": 5961.32,
        "end": 5982.32
    },
    {
        "text": " Entonces, en términos teóricos, tenemos dos, esta variable movida, esta manera, un aumento, siempre acabamos de un aumento, pero podríamos analizar lo mismo con una disminución y sería lo contrario los resultados.",
        "start": 5982.32,
        "end": 5995.32
    },
    {
        "text": " Tenemos efectos contradictorios y no tenemos nada que nos estamos tratando cuál pesa más. ¿Entonces, ¿qué pasa con el análisis de la teoría del mercado de trabajo, de la falta de trabajo?",
        "start": 5995.32,
        "end": 6007.32
    },
    {
        "text": " Nos vamos a apoyar, o la teoría, en realidad se apoya, en la evidencia empírica. ¿Y qué muestra la evidencia empírica? ¿O qué es la evidencia empírica?",
        "start": 6007.32,
        "end": 6025.32
    },
    {
        "text": " ¿Y es ver, ¿qué pasa con las horas de trabajo cuando suba el salario?",
        "start": 6025.32,
        "end": 6035.32
    },
    {
        "text": " En realidad acá yo comete un error, comete un error no asumir precios dados, pero en realidad la variable que tendríamos que mirar es salario real, ¿no?",
        "start": 6035.32,
        "end": 6046.32
    },
    {
        "text": " Como acá los precios no dijimos que pasen nada, cualquier aumento del salario nominal es pensado en términos reales también, pero ya que lo vamos a representar en un gráfico y como lo vamos a ver después es salario real lo que deberíamos saber manejado en todo momento.",
        "start": 6046.32,
        "end": 6063.32
    },
    {
        "text": " Entonces, ¿qué dice la evidencia empírica? Mira a lo largo del tiempo que pasa con las horas ofrecidas por la gente y el salario y lo que observa es para ejemplificar con lo que teníamos, ¿no?",
        "start": 6076.32,
        "end": 6093.32
    },
    {
        "text": " ¿Qué cuando el salario es 1500, la gente ofrecía? 4, después cuando el salario subió a 1800, pasó a ofrecer más horas, cuando el salario subió a 200, se vino a 14 y cuando el salario volvió a subir, vamos a ponarle acá abajo.",
        "start": 6093.32,
        "end": 6122.32
    },
    {
        "text": " Entonces, la oferta de trabajo nos muestra esta evidencia empírica nos muestra esta relación, ¿qué? A medida que aumenta el salario la gente trabaja más horas, pero llega a un momento y ese momento va a depender de cada persona, va a depender de la cultura de trabajo de cada país, que cuando ya tiene determinado nivel de horas de trabajo, ¿no?",
        "start": 6122.32,
        "end": 6151.32
    },
    {
        "text": " De horas de trabajo ya empieza a valorar otras cosas y no solo la parte monetaria de bienes materiales y ahí entonces mayor salario reduce la oferta de trabajo.",
        "start": 6151.32,
        "end": 6161.32
    },
    {
        "text": " De todas maneras este tramo generalmente no se ve, si tienen que ser una economía que haya muchísima recalentada, se le denomina, que hay muchísima gente con muchas horas trabajando, que no hay mano de obra disponible, por eso se contrata la gente puede trabajar muchas horas.",
        "start": 6161.32,
        "end": 6179.32
    },
    {
        "text": " Pero en términos teóricos entonces resolvemos de esta manera, no tenemos un argumento teórico para ver cuál de estas dos decisiones que tienen adentro de la cabeza cada persona, le llevan para saber si el salario afecta de una manera o de otra a las horas a ofrecer, nos apoyamos en la evidencia empírica donde lo que pesa más es el efecto sustitución.",
        "start": 6179.32,
        "end": 6205.32
    },
    {
        "text": " Aunque tengamos en cuenta de esto de acá. Entonces para cerrar esta idea y que nos quede resumido vamos a hacerlo de la misma manera que hicimos con la función de producción, la oferta de trabajo va a ser una función del salario real.",
        "start": 6205.32,
        "end": 6225.32
    },
    {
        "text": " Siempre vamos a poner puntos suspensivos para asumir que pueden haber otras variables que afectan, cuando uno habla de las horas de trabajo de una persona, de qué depende que uno quiere trabajar más o menos, ustedes mismo acá, de qué depende que quieran trabajar más o menos.",
        "start": 6225.32,
        "end": 6242.32
    },
    {
        "text": " Y de cómo ven la educación, si a repente empiezan a manejar o a observar que el sistema educativo es cualquiera que no está bueno, que no sé qué y capaz que dice, no me conviene ahora salirme de acá, empiezo a trabajar más horas porque ve que el sistema educativo está y cosa.",
        "start": 6243.32,
        "end": 6258.32
    },
    {
        "text": " O al revés, capaz que si la gente empiezaba a ver la educación es muy importante para el futuro, no por salarios, sino por otros motivos y bueno, hay otras variables que vamos a jugar acá para que la gente ofrezca más hora, ofrezca menos en el ejemplo que estaba siguiendo.",
        "start": 6258.32,
        "end": 6276.32
    },
    {
        "text": " Ahora estamos en macro, entonces todas aquellas variables que me influyen acá, pero que no son variables macro y no las vamos a modelizar o poner de esta manera.",
        "start": 6277.32,
        "end": 6287.32
    },
    {
        "text": " Si las podemos tener en cuenta y conversar, pero no las vamos a incluir como variable, lo que estamos poniendo de acá son variables macro con óx.",
        "start": 6287.32,
        "end": 6295.32
    },
    {
        "text": " Y qué signo ponemos entonces acá, como es la relación entre el salario y la oferta, después de todo lo que estuvimos diciendo.",
        "start": 6295.32,
        "end": 6301.32
    },
    {
        "text": " Esa ambigua en principio, pero cuál dijimos que si nos apoyamos en la evidencia pesa más.",
        "start": 6307.32,
        "end": 6315.32
    },
    {
        "text": " El efecto sustitución que nos dice que a más salario la gente quiere trabajar más horas.",
        "start": 6315.32,
        "end": 6324.32
    },
    {
        "text": " ¿Sí?",
        "start": 6324.32,
        "end": 6326.32
    },
    {
        "text": " A más salario entonces la gente va a ofrecer más horas.",
        "start": 6327.32,
        "end": 6332.32
    },
    {
        "text": " Sabiendo, teniendo esa advertencia de ese límite de que, bueno, más horas hasta determinado nivel después la gente puede decidir considerar reducir las horas y eso ya no se cumplirí.",
        "start": 6332.32,
        "end": 6344.32
    },
    {
        "text": " Pero hecha la advertencia, nos quedamos con esta parte que es lo que generalmente se ve en los países.",
        "start": 6344.32,
        "end": 6351.32
    },
    {
        "text": " Sí, sólo que ahí, bueno, si las horas se trajustamente hacen eso, el incentivo, ¿no?",
        "start": 6357.32,
        "end": 6362.32
    },
    {
        "text": " Buscan incentivar y una de las quiera trabajar.",
        "start": 6362.32,
        "end": 6365.32
    },
    {
        "text": " Bien, alguna duda, seguimos estando adentro del capítulo 2 de la Fichio.",
        "start": 6370.32,
        "end": 6378.32
    },
    {
        "text": " La clase que viene retomamos estos resúmenes de función de producción y de la oferta de hogares y nos metemos con las empresas para poder tratar de desarrar el mercado de trabajo.",
        "start": 6378.32,
        "end": 6392.32
    }
]