[
    {
        "text": " Bueno, vamos a empezar la clase con un repaso rápido como siempre. Si se acuerdan,",
        "start": 0.0,
        "end": 26.04
    },
    {
        "text": " lo último que vimos fue lo siguiente. Bueno, como siempre tiene un operador",
        "start": 26.04,
        "end": 34.36
    },
    {
        "text": " lineal en un espacio vectorial que consideramos dimensiones.",
        "start": 34.36,
        "end": 44.8
    },
    {
        "text": " Y ahí teníamos lo siguiente. Suponemos que el am da cero se un valor propio del operador.",
        "start": 44.8,
        "end": 52.120000000000005
    },
    {
        "text": " Lo primero que hicimos la clase pasada fue definir la multiplicidad algebraica, la multiplicidad",
        "start": 52.12,
        "end": 58.239999999999995
    },
    {
        "text": " geométrica de ese valor propio. Si ustedes recuerdan la multiplicidad algebraica del am da cero,",
        "start": 58.239999999999995,
        "end": 64.52
    },
    {
        "text": " que es algo que des notamos así, es la multiplicidad como raíz del polinomio característico.",
        "start": 64.52,
        "end": 71.67999999999999
    },
    {
        "text": " Bien, es decir, si el polinomio característico ustedes saben que es un polinomio de orden N en",
        "start": 71.67999999999999,
        "end": 79.56
    },
    {
        "text": " la lambda, lambda es la variable y en la dimensión del espacio que estamos trabajando y se",
        "start": 79.56,
        "end": 84.52
    },
    {
        "text": " escribe como producto de sus raíces. O sea, hay un menos 1 a la N acá y después de esta lambda",
        "start": 84.52,
        "end": 91.12
    },
    {
        "text": " 0, menos lambda a una cierta potencia que llamamos M0, estamos pensando que lambda 0",
        "start": 91.12,
        "end": 96.68
    },
    {
        "text": " valor propio, o sea que es raíz de esto, lambda 1, menos lambda a la M1, etcétera, lambda 2,",
        "start": 96.68,
        "end": 104.76
    },
    {
        "text": " lambda a la M2, entonces estas cantidades acas son las que se llaman las multiplicidades algebraicas",
        "start": 104.76,
        "end": 112.16000000000001
    },
    {
        "text": " de cada valor propio. O sea, me dicen de qué ordenen la raíz es lambda 0 como raíz del polinomio.",
        "start": 112.16000000000001,
        "end": 117.12
    },
    {
        "text": " Si es una raíz simple, esto te le va a dar 1, si te le va en cuadras es una raíz doble,",
        "start": 117.12,
        "end": 122.16000000000001
    },
    {
        "text": " las multiplicidades 2, etcétera. Y en general este esto es la multiplicidad algebraica de un",
        "start": 122.16000000000001,
        "end": 128.76
    },
    {
        "text": " valor propio. Y la segunda cosa que habíamos visto era la multiplicidad geométrica del lambda",
        "start": 128.76,
        "end": 138.0
    },
    {
        "text": " 0, de un valor propio, que es la cosa que la dimensión del espacio propio, el socio de",
        "start": 138.0,
        "end": 148.0
    },
    {
        "text": " lambda 0. Bien, y después habíamos probado que este número siempre es menor igual que este",
        "start": 148.0,
        "end": 155.56
    },
    {
        "text": " y habíamos finalmente probado un resultado que me dice que este diagonalizable sí sólo sí,",
        "start": 156.28,
        "end": 160.72
    },
    {
        "text": " todas las raíces están en el cuerpo y todas las multiplicidades algebraicas y la geométrica es",
        "start": 160.72,
        "end": 165.56
    },
    {
        "text": " para cada valor propio coincida. Es una condición necesaria y suficiente para que un operador sea",
        "start": 165.56,
        "end": 171.64000000000001
    },
    {
        "text": " diagonalizable sí sí sólo sí entonces toda la raíz lambda,",
        "start": 171.64,
        "end": 185.55999999999997
    },
    {
        "text": " lambda el polinomio característico, así a toda la raíz característica está en ca,",
        "start": 189.76,
        "end": 194.72
    },
    {
        "text": " que está en el cuerpo en el que estamos trabajando y además y cumple que la multiplicidad geométrica",
        "start": 195.68,
        "end": 205.76
    },
    {
        "text": " de esa raíz coincide con la multiplicidad geométrica. Entonces esto me da un criterio para",
        "start": 205.76,
        "end": 213.64
    },
    {
        "text": " saber cuando un operador es diagonalizable, tengo que encontrar las raíces del polinomio característico,",
        "start": 213.64,
        "end": 220.72
    },
    {
        "text": " verificar que todas las detenen en el cuerpo en el que estamos trabajando y verificar que para",
        "start": 221.28,
        "end": 225.72
    },
    {
        "text": " cada raíz la dimensión de su espacio propio, el socio coincide con la multiplicidad geométrica.",
        "start": 225.72,
        "end": 230.8
    },
    {
        "text": " El jueves y la clase del martes de la semana próxima vamos a ver qué pasa cuando un operador no es",
        "start": 235.8,
        "end": 242.0
    },
    {
        "text": " diagonalizable, en particular vamos a estudiar el caso en el que tenemos diagonalizable pero toda la",
        "start": 242.0,
        "end": 247.48
    },
    {
        "text": " raíz está en el cuerpo solamente que no se cumple esta igualdad para todas las raíces. Entonces",
        "start": 247.48,
        "end": 251.95999999999998
    },
    {
        "text": " vamos a ver que hay hay formas asociadas a T que son bastante parecidas una diagonal pero no",
        "start": 251.95999999999998,
        "end": 257.03999999999996
    },
    {
        "text": " son diagonales que son los que se llaman las formas de Jordan y eso lo vamos a ver en la clase de jueves.",
        "start": 257.03999999999996,
        "end": 263.48
    },
    {
        "text": " Y qué vamos a hacer en la clase de hoy vamos a volver al librito rojo y vamos a estudiar un resultado",
        "start": 263.48,
        "end": 271.76
    },
    {
        "text": " que permite localizar en el plano complejo donde están las raíces del polinomio característico.",
        "start": 271.76,
        "end": 277.88
    },
    {
        "text": " ¿Usted saben si algunas preguntas?",
        "start": 282.15999999999997,
        "end": 284.59999999999997
    },
    {
        "text": " Exacto, con que una raíz no esté en el cuerpo, ¿Vos sabés por el, esto es un polinomio morado N?",
        "start": 289.2,
        "end": 295.92
    },
    {
        "text": " Por el trono fundamental de la algebra, acá hay N raíces complejas si yo les cuento con su multiplicidad.",
        "start": 296.48,
        "end": 301.76
    },
    {
        "text": " Contan las raíces con su multiplicidad quiere decir que si una raíz tiene multiplicidad 2 las cuento 2 veces,",
        "start": 301.76,
        "end": 307.0
    },
    {
        "text": " es como si hubiera 2 aunque son iguales. Me basta con ver que algunas a raíces no están en el cuerpo para",
        "start": 307.0,
        "end": 314.04
    },
    {
        "text": " deducir que no es diagonalizable y si están todas en el cuerpo me basta con verificar que algunas",
        "start": 314.04,
        "end": 320.24
    },
    {
        "text": " de esas raíces no cumple eso y ya está. Ahora qué pasa, acá hay un problema técnico cuando uno quiere",
        "start": 320.24,
        "end": 327.6
    },
    {
        "text": " encontrar las raíces, tiene que trabajar con un polinomio de grado N. Y para encontrar la raíz",
        "start": 327.6,
        "end": 336.96000000000004
    },
    {
        "text": " un polinomio de grado N es solamente hay fórmulas cerradas para enigualados, para las raíces, para polinomos",
        "start": 336.96000000000004,
        "end": 343.2
    },
    {
        "text": " cuadraticos para cubicos y para, creo que para un parador en cuatro y en general para una de",
        "start": 343.2,
        "end": 349.8
    },
    {
        "text": " mayores no hay fórmulas explícitas para encontrar las raíces a no ser que sean casos muy",
        "start": 349.8,
        "end": 354.84
    },
    {
        "text": " particulares de las matrices asociadas del polinomio característico. Entonces en la mayoría de los",
        "start": 354.84,
        "end": 359.96
    },
    {
        "text": " casos uno tiene que resolver numericamente ¿cuáles son las raíces? Y para eso es necesario tener",
        "start": 359.96,
        "end": 370.36
    },
    {
        "text": " idea en dónde están las raíces en el plano complejo. El tenemos fundamental de la",
        "start": 370.36,
        "end": 375.32
    },
    {
        "text": " algebraa me dice que este polinomio característico tiene N raíces en el plano compleja contadas",
        "start": 375.32,
        "end": 380.84000000000003
    },
    {
        "text": " con su multiplicidad, pueden ser todas reales eventualmente, pero las raíces que tú consideras",
        "start": 380.84000000000003,
        "end": 385.40000000000003
    },
    {
        "text": " son siempre complejas, entonces están en el plano complejo, quiero decir. Entonces yo acá estoy",
        "start": 385.40000000000003,
        "end": 390.04
    },
    {
        "text": " trabajando en el plano real, si hay alguna raíz, comparte imagina de anónula, eso no es",
        "start": 390.04,
        "end": 397.48
    },
    {
        "text": " valor propio, etcétera. Por el principio tengo que saber cuáles son las raíces. Bien, entonces",
        "start": 397.48,
        "end": 402.12
    },
    {
        "text": " el teorema de Gargoyne me dice dónde están, me permite localizar en el plano complejo,",
        "start": 402.12,
        "end": 410.24
    },
    {
        "text": " dónde están las raíces del polinomio característico. Y bueno y eso es útil para empezar a buscar",
        "start": 410.24,
        "end": 421.04
    },
    {
        "text": " numericamente, bueno, usar técnicas numericas que hay muchas técnicas para los otros",
        "start": 421.6,
        "end": 426.68
    },
    {
        "text": " tipos problemas, bueno, mas ir para ubicar las numericamente las raíces. Como punto de",
        "start": 426.68,
        "end": 432.82
    },
    {
        "text": " partir para ubicar las raíces. Entonces vamos a empezar definiendo los ingredientes previos",
        "start": 432.82,
        "end": 440.48
    },
    {
        "text": " que vamos a necesitar para el teorema. En primer lugar vamos a trabajar en el cuerpo complejo,",
        "start": 440.48,
        "end": 448.04
    },
    {
        "text": " vamos a considerar una matriz, una matriz que le vamos a llamar a las entradas de la matriz,",
        "start": 448.04,
        "end": 463.36
    },
    {
        "text": " le vamos a llamar a Ij, esta es la entrada de la filaí columna J y vamos a pensar que estas",
        "start": 463.36,
        "end": 468.64000000000004
    },
    {
        "text": " componentes que estas entradas son un número complejo en general. O sea que esto es una matriz",
        "start": 468.64000000000004,
        "end": 473.16
    },
    {
        "text": " cuadrada con coeficientes en el cuerpo complejo. Bien, el caso real se puede adaptar de ahí",
        "start": 474.12,
        "end": 482.52000000000004
    },
    {
        "text": " considerando justamente a los reales y identificando los reales como los complejos con la parte",
        "start": 482.52000000000004,
        "end": 488.56
    },
    {
        "text": " imaginar y igual acceder. Pero uno trabaja en el cuerpo complejo porque como digo, el teorema",
        "start": 488.56,
        "end": 493.8
    },
    {
        "text": " fundamental de la bíjabra me dice que estas raíces en general, bueno, están en el cuerpo complejo,",
        "start": 493.8,
        "end": 498.56
    },
    {
        "text": " pueden ser reales todas, que no generan esta en el cuerpo complejo. Bien, entonces,",
        "start": 498.56,
        "end": 504.08
    },
    {
        "text": " entonces supongamos que yo tengo la matriz, vamos a dar un par de definiciones previas,",
        "start": 508.08,
        "end": 512.0
    },
    {
        "text": " yo tengo una matriz como decíamos, vamos a escribir aquí explícitamente algunos coeficientes,",
        "start": 512.0,
        "end": 522.08
    },
    {
        "text": " desde el 1, 1, 1, 2, etcétera, a n n, perdón, a 1 n acá, a 2 n, bien, considera la filaí,",
        "start": 522.08,
        "end": 539.72
    },
    {
        "text": " eso va a ser a I, a I, 2, etcétera por acá tendrá el término de diagonal, ahí, ahí n,",
        "start": 541.32,
        "end": 551.2
    },
    {
        "text": " y finalmente la fila n.",
        "start": 552.96,
        "end": 554.64
    },
    {
        "text": " Entonces, el asunto del siguiente, para cada fila vamos a construir un círculo en el",
        "start": 554.64,
        "end": 584.4399999999999
    },
    {
        "text": " plano complejo de la siguiente manera, para cada filaí, igual desde 1 hasta n, vamos a construir un",
        "start": 584.44,
        "end": 601.36
    },
    {
        "text": " círculo en el plano complejo, acá son todos números complejos, esos, el círculo,",
        "start": 601.36,
        "end": 614.84
    },
    {
        "text": " entonces esto acá es la filaí, el círculo que vamos a construir está centrado en el coeficiente",
        "start": 614.84,
        "end": 635.52
    },
    {
        "text": " corresponde la diagonal, o sea en el A y en el corresponde la diagonal en esa fila.",
        "start": 635.52,
        "end": 641.4
    },
    {
        "text": " Y el radio que vamos a considerar es todos estos son números complejos, considera los módulos de",
        "start": 655.3199999999999,
        "end": 663.0
    },
    {
        "text": " esos números, o sea la parte real al cuadrado, más la parte diagonal cuadrado, pero ahí cuadra",
        "start": 663.0,
        "end": 669.24
    },
    {
        "text": " eso, considera los módulos de estos números y los sumos, excepto dejo afuera el que corresponda",
        "start": 669.24,
        "end": 675.52
    },
    {
        "text": " la diagonal, sí, entonces para cada fila consideramos el círculo en el plano complejo, porque escribiron",
        "start": 675.52,
        "end": 682.16
    },
    {
        "text": " esto, el círculo en el plano complejo, con centro en A y y radio, que le vamos a llamar",
        "start": 682.16,
        "end": 691.88
    },
    {
        "text": " este R subí, que es la suma de todos los módulos de esos coeficientes, ahí j, donde j",
        "start": 691.88,
        "end": 701.88
    },
    {
        "text": " son todos estos elementos excepto 10 y el corresponde la diagonal, como dije en la ciencia, o sea",
        "start": 701.88,
        "end": 706.92
    },
    {
        "text": " acá j está es distinto de ahí, bien esto es el centro del círculo asociado la fila y esto es el",
        "start": 707.04,
        "end": 720.0799999999999
    },
    {
        "text": " radio del círculo asociado la fila y eventualmente este radio podría ser cero, si todas estas entradas",
        "start": 720.0799999999999,
        "end": 727.4799999999999
    },
    {
        "text": " fuera del que corresponde la diagonal son cero por ejemplo, estaría un punto en ese caso, un punto",
        "start": 727.4799999999999,
        "end": 734.8399999999999
    },
    {
        "text": " que correspondería a esto, sí sí sí es el punto, porque son los círculos cerrados que vamos a",
        "start": 734.84,
        "end": 742.96
    },
    {
        "text": " considerar, entonces hacemos eso para cada fila, con lo cual os voy a tener acá el círculo 1,",
        "start": 742.96,
        "end": 750.64
    },
    {
        "text": " ya voy a ser un dibujito acá el círculo 2, etcétera, acá el círculo 10 y acá el círculo N,",
        "start": 750.64,
        "end": 758.36
    },
    {
        "text": " o sea estoy trabajando con matrices N por N y considero N círculos en el plano complejo,",
        "start": 758.36,
        "end": 766.24
    },
    {
        "text": " cada uno de los cuales está centrado en estos elementos la diagonal y tiene como radio la suma",
        "start": 768.0,
        "end": 776.88
    },
    {
        "text": " de los módulos los elementos están fuera de la diagonal en la fila que la fila corresponde",
        "start": 776.88,
        "end": 781.8000000000001
    },
    {
        "text": " se entendió eso, esa es la construcción del galecioring, entonces con esto lo que estamos diciendo",
        "start": 781.8,
        "end": 789.4799999999999
    },
    {
        "text": " es muy útil y muy ingeniosa además la demostración del resultado de este que vamos a ver",
        "start": 795.92,
        "end": 802.3599999999999
    },
    {
        "text": " por eso justamente tiene el nombre de su autor, construimos entonces los círculos si escribo",
        "start": 804.24,
        "end": 811.04
    },
    {
        "text": " explícitamente como son los círculos en el plano complejo, el círculo asociado a la fila yésima",
        "start": 811.04,
        "end": 819.5999999999999
    },
    {
        "text": " es el conjunto de los números en el plano complejo, de los números complejos tales que la distancia",
        "start": 819.5999999999999,
        "end": 828.68
    },
    {
        "text": " en módulo, la distancia como módulo es número complejo, la distancia deseta al centro del círculo",
        "start": 828.68,
        "end": 836.16
    },
    {
        "text": " es menor igual que el radio correspondiente esa fila, acá estoy escribiendo explícitamente",
        "start": 836.16,
        "end": 845.52
    },
    {
        "text": " lo que dije acá arriba, son el círculo relleno digamos son todos los cítanos complejos tales",
        "start": 845.52,
        "end": 853.7199999999999
    },
    {
        "text": " que la distancia al centro en módulo es menor igual que el radio que estoy considerando,",
        "start": 853.7199999999999,
        "end": 860.52
    },
    {
        "text": " entonces pensemos lo siguiente, vamos al plano complejo, acá está la parte real de los",
        "start": 861.52,
        "end": 874.52
    },
    {
        "text": " complejos, acá está la parte imaginario de los complejos, han visto números complejos,",
        "start": 874.52,
        "end": 878.52
    },
    {
        "text": " no es cierto, en un cálculo supongo, sí, entonces pensemos que yo vengo, entonces para la primera",
        "start": 878.52,
        "end": 885.6
    },
    {
        "text": " fila tengo acá el punto de esta centrada y el círculo este, para la segunda tengo algo por acá",
        "start": 885.6,
        "end": 896.2
    },
    {
        "text": " y el círculo este, yo que sé para la tercera tengo algo por acá y el círculo este,",
        "start": 899.6800000000001,
        "end": 908.96
    },
    {
        "text": " no sé, pongamos un, para ejemplo más, para la cuarta tengo un círculo centrado acá,",
        "start": 908.96,
        "end": 919.64
    },
    {
        "text": " esto quiere decir que el coeficiente real tiene parte imaginaria nula y tiene un círculo por acá,",
        "start": 919.64,
        "end": 927.6
    },
    {
        "text": " yo más ser uno más, vamos a ser un par más, para la quinta está por acá arriba,",
        "start": 928.6,
        "end": 935.6
    },
    {
        "text": " tiene radio a 5 y digamos la sexta acá ya corto hacer círculo acá porque posta toda la tarde,",
        "start": 940.0,
        "end": 947.72
    },
    {
        "text": " todo el mañana, uno, dos, tres, cuatro, cinco, a seis, supongamos que yo tengo esos círculos,",
        "start": 947.72,
        "end": 963.12
    },
    {
        "text": " ahora bien, ¿qué me dice el resultado que voy a probar y qué me dice justamente dónde están",
        "start": 965.12,
        "end": 971.52
    },
    {
        "text": " las raíces características del policómico? Bueno, ¿qué me dicen? Vamos a escribir el teorema,",
        "start": 971.52,
        "end": 976.9200000000001
    },
    {
        "text": " lo vamos a leer y lo vamos a probar y vamos a ver qué resultados se desprende ahí, el teorema en",
        "start": 976.92,
        "end": 983.4399999999999
    },
    {
        "text": " consideraciones el teorema de Garcigoring, Garcigoring un matemático ruso de principios del siglo XX,",
        "start": 983.4399999999999,
        "end": 996.8
    },
    {
        "text": " que me dice justamente dónde buscar los valores propios de esta matriz, las raíces características,",
        "start": 996.8,
        "end": 1006.0799999999999
    },
    {
        "text": " de esta matriz, que en el caso complejo son valores propios, por el caso real pueden serlo, no,",
        "start": 1006.92,
        "end": 1012.16
    },
    {
        "text": " entonces ¿qué me dice el teorema de este? Me dice, da la matriz a, en Eporen, y dado los",
        "start": 1012.16,
        "end": 1021.92
    },
    {
        "text": " círculos y construí que justamente se llaman círculos de Garcigoring, esto acá, el teorema me dice,",
        "start": 1021.92,
        "end": 1028.48
    },
    {
        "text": " el primer resultado, si landa es valor propio de A, como estamos trabajando en los complejos,",
        "start": 1028.48,
        "end": 1044.64
    },
    {
        "text": " valor propio y raíces características lo mismo, todas las raíces características son valores",
        "start": 1044.64,
        "end": 1049.76
    },
    {
        "text": " propios, si landa es valor propio de A, entonces landa está contenido en la unión de todos esos",
        "start": 1049.76,
        "end": 1061.8799999999999
    },
    {
        "text": " círculos de Garcigoring, de los en círculos de Garcigoring que tengo ahí, eso quiere decir la",
        "start": 1061.8799999999999,
        "end": 1067.24
    },
    {
        "text": " unión de esos círculos, se una, unión c2, unión c3, a suión cn, y el segundo resultado que",
        "start": 1067.24,
        "end": 1074.92
    },
    {
        "text": " ya lo vamos a ver, lo vamos a escribir acá, hay tanto subindice,",
        "start": 1074.92,
        "end": 1104.24
    },
    {
        "text": " son círculos con un subindice, con un subindice,",
        "start": 1104.24,
        "end": 1111.84
    },
    {
        "text": " bien lo leemos entonces, ¿qué me dice el teorema de Garcigoring? Agarre una matriz en Eporen,",
        "start": 1194.24,
        "end": 1207.92
    },
    {
        "text": " como esta, construya los círculos o discos de Garcigoring, según o sea de dos hasta cn, tengo",
        "start": 1207.92,
        "end": 1214.2
    },
    {
        "text": " en el círculos, entonces me dice que si algo es un valor propio de esta matriz, si algo es raíz",
        "start": 1214.2,
        "end": 1221.48
    },
    {
        "text": " característica, en el caso complejo, entonces necesariamente ese valor propio está contenido",
        "start": 1221.48,
        "end": 1226.52
    },
    {
        "text": " en la unión de esos círculos, o sea que si algo es valor propio está metido acá dentro,",
        "start": 1226.52,
        "end": 1232.96
    },
    {
        "text": " en este conjunto, es decir, todos los valores propios, todas las raíces características,",
        "start": 1235.6,
        "end": 1240.24
    },
    {
        "text": " todas las raíces del polinismo característico están ahí adentro, no hay ninguna en esta región",
        "start": 1240.24,
        "end": 1245.52
    },
    {
        "text": " que está en blanco, tanto vas ahí, o sea si van a ser simulaciones numéricas o estimaciones del",
        "start": 1245.52,
        "end": 1251.96
    },
    {
        "text": " cálculo numérico para encontrarlas, trabajen acá en estas regiones, lo cual me limita bastante,",
        "start": 1251.96,
        "end": 1257.84
    },
    {
        "text": " la búsqueda, mira si bien estos círculos pueden ser enormemente grandes, pero por lo menos me",
        "start": 1257.84,
        "end": 1262.44
    },
    {
        "text": " dice, búsquen acá, y ese segundo resultado me dice que si yo tengo un conjunto de m círculos,",
        "start": 1262.44,
        "end": 1273.0
    },
    {
        "text": " este m m chiquito acá no se ve a pena, pero estoy diciendo tengo circos y uno, el 6 y dos,",
        "start": 1273.0,
        "end": 1279.6
    },
    {
        "text": " el 6 y m son círculos que son disjuntos de los restantes de círculos o discos, si tengo",
        "start": 1279.6,
        "end": 1286.68
    },
    {
        "text": " m chiquito disjuntos o círculos, que son disjuntos del resto, entonces acá en esta unión hay",
        "start": 1286.68,
        "end": 1293.48
    },
    {
        "text": " exactamente m valores propios, si yo los cuento con la multiplicidad, es decir, puede haber un",
        "start": 1293.48,
        "end": 1300.36
    },
    {
        "text": " rey doble, entonces la tengo que contar dos veces, ¿no? Está claro, ¿qué significa eso en",
        "start": 1300.36,
        "end": 1309.36
    },
    {
        "text": " este dibujito? Esto a veces cuesta entender, lo hay que leerlo bien, lo que estoy diciendo acá y",
        "start": 1309.36,
        "end": 1315.0
    },
    {
        "text": " no leer algo que no está dicho acá, lo que está diciendo es que por ejemplo, acá tengo dos",
        "start": 1315.0,
        "end": 1321.36
    },
    {
        "text": " círculos que están separados del resto, que me hice la parte de los de Gersgore, que acá hay",
        "start": 1321.36,
        "end": 1326.1599999999999
    },
    {
        "text": " dos raíces, eventualmente puede ser una raíz como multiplicidad doble, pero acá hay dos,",
        "start": 1326.16,
        "end": 1331.92
    },
    {
        "text": " si las cuantos no son multiplicidad, acá cuantas hay, tengo tres círculos que están separados",
        "start": 1331.92,
        "end": 1337.5600000000002
    },
    {
        "text": " del resto, tres raíces, tres raíces, insisto, contadas con su multiplicidad y acá que está",
        "start": 1337.5600000000002,
        "end": 1345.96
    },
    {
        "text": " separado el resto acá hay una raíz, o sea que no solamente me dice dónde están localizadas",
        "start": 1345.96,
        "end": 1353.5600000000002
    },
    {
        "text": " el conjunto de las raíces, sino que me dice acá hay tres, acá hay dos, y acá hay uno, es un",
        "start": 1353.56,
        "end": 1359.84
    },
    {
        "text": " resultado bien importante, estamos trabajando en el ejemplo que hice acá tengo 6 discos, o sea",
        "start": 1359.84,
        "end": 1366.76
    },
    {
        "text": " estamos trabajando con matrices, una matrices en tamaño 6x6 y me dice las 6 raíces",
        "start": 1366.76,
        "end": 1372.56
    },
    {
        "text": " características busquen 2 acá, 3 acá y 1 ahí, después ¿cómo se distribuyen acá dentro?",
        "start": 1372.56,
        "end": 1378.8
    },
    {
        "text": " Bueno eso no lo sé, no sé, no sé, no sé, no sé, no sé, eso no sé, depende de cada",
        "start": 1378.8,
        "end": 1387.1599999999999
    },
    {
        "text": " problema particular, de hecho fíjense que nada me impide que los círculos coincidan, por ejemplo",
        "start": 1387.1599999999999,
        "end": 1393.56
    },
    {
        "text": " un círculo podría estar centrado al mismo punto y tener el mismo radio, o sea eventualmente",
        "start": 1393.56,
        "end": 1398.3999999999999
    },
    {
        "text": " podría tener dos discos iguales, lo tengo que contar dos veces, si este fueran dos discos iguales,",
        "start": 1398.3999999999999,
        "end": 1403.8
    },
    {
        "text": " si agregar otro discos exactamente con esto, bueno acá tengo dos raíces, bien eso lo",
        "start": 1404.36,
        "end": 1411.4199999999998
    },
    {
        "text": " queremos aprobar en la clase de hoy, ahora hay un tema, si uno está trabajando, yo les dije",
        "start": 1411.4199999999998,
        "end": 1420.3999999999999
    },
    {
        "text": " recién el caso de matrices reales, se puede adaptar a este, basta considerar, si acá tengo",
        "start": 1420.3999999999999,
        "end": 1427.84
    },
    {
        "text": " dos reales, basta considerar a los reales con los complejos de parte imaginaria en Google,",
        "start": 1427.84,
        "end": 1435.1599999999999
    },
    {
        "text": " entonces si esas entradas son todas reales, quiere decir que los discos están todos centrados",
        "start": 1435.1599999999999,
        "end": 1441.32
    },
    {
        "text": " en la parte real, pero son discos en el plano complejo, es decir, si yo tuviese un disco acá como",
        "start": 1441.32,
        "end": 1447.6399999999999
    },
    {
        "text": " esto, se entraba en el plano, en el eje real, este disco complejo y me dice que acá hay una raíz,",
        "start": 1447.6399999999999,
        "end": 1455.6399999999999
    },
    {
        "text": " yo en principio no puedo concluir que la raíz es real, podría estar acá o podría estar arriba,",
        "start": 1456.5200000000002,
        "end": 1461.0
    },
    {
        "text": " por el excepto salvo, si esta situación, pero hay que tener un poquito cuidado por eso, por",
        "start": 1461.0,
        "end": 1466.8000000000002
    },
    {
        "text": " esos que a veces, bueno por esos que uno trabaja en el plano complejo, digamos, para siempre tener",
        "start": 1466.8000000000002,
        "end": 1474.48
    },
    {
        "text": " garantía que todas las reyes características son valores propios, en el caso reales que tener un",
        "start": 1474.48,
        "end": 1479.8000000000002
    },
    {
        "text": " poquito de cuidado con las afirmaciones, fíjense por ejemplo si, perdense el union, quiere decir",
        "start": 1479.8,
        "end": 1493.6399999999999
    },
    {
        "text": " que está en el union de todos los discos acá, cada valor propio está en ese union, lo que está",
        "start": 1493.6399999999999,
        "end": 1498.6
    },
    {
        "text": " diciendo de primera es todos los valores propios están en esta union y la que me está diciendo",
        "start": 1498.6,
        "end": 1505.12
    },
    {
        "text": " segunda es más precisa, me dice cuánto se haya acá y cuánto se haya ahí, está bien?",
        "start": 1505.12,
        "end": 1511.1599999999999
    },
    {
        "text": " Ah eso no lo sé, eso no lo sé, sí porque imagínate vos que imagínate vos que tengas por ejemplo",
        "start": 1520.1599999999999,
        "end": 1527.36
    },
    {
        "text": " un disco, un disco de rayo cero, o sea que fue un punto, yo tengo acá esto y tengo acá",
        "start": 1527.36,
        "end": 1534.28
    },
    {
        "text": " 2, 0, 0, 0 y tengo otro disco que tiene este como borde, bueno ahí, ahí lo que bueno,",
        "start": 1534.28,
        "end": 1548.9199999999998
    },
    {
        "text": " ahí hay que ver, la raíz puede estar acá y la segunda, yo que sea donde posta.",
        "start": 1548.92,
        "end": 1554.44
    },
    {
        "text": " Bueno se puede ver que si hago si un disco, si un disco coincide con un punto,",
        "start": 1569.2,
        "end": 1572.8400000000001
    },
    {
        "text": " si yo acá tuviera por ejemplo, si yo acá tuviera un numerito a, a, 0, 0, 0, 0 o sea si el",
        "start": 1572.84,
        "end": 1579.8
    },
    {
        "text": " primer disco fue un punto se traba una a, cuando yo hago esto quiero calcular el determinante",
        "start": 1579.8,
        "end": 1585.1599999999999
    },
    {
        "text": " de a menos lambda por I igual a 0 para ver las raíces, cuando yo hago a menos lambda determinante",
        "start": 1585.1599999999999,
        "end": 1591.08
    },
    {
        "text": " igual a 0 y desarrollando el determinante usando esta fila va a ver un primer factor que va a ser",
        "start": 1591.08,
        "end": 1595.56
    },
    {
        "text": " a a menos lambda multiplicado por el resto, o sea que esto siempre, si hay un numerito con todo",
        "start": 1595.56,
        "end": 1601.6399999999999
    },
    {
        "text": " 0, eso es un numerito en la diagonal, perdón, en el elemento de diagonal y el resto 0, ahí",
        "start": 1601.64,
        "end": 1608.0400000000002
    },
    {
        "text": " voy a tener un valor propio que coincide con un numerito, o sea que yo sé que si tengo esta",
        "start": 1608.0400000000002,
        "end": 1612.4
    },
    {
        "text": " situación que hay un puntito, un disco en rayo 0 y el otro, yo sé que este punto es un,",
        "start": 1612.4,
        "end": 1619.88
    },
    {
        "text": " necesariamente una raíz y la otra no sea donde puede estar, o bien puede ser una raíz",
        "start": 1619.88,
        "end": 1624.68
    },
    {
        "text": " y dobleta o bien puede estar acá, eso no lo sé, hay que verlo. Estamos, guarda con lo que",
        "start": 1624.68,
        "end": 1633.6000000000001
    },
    {
        "text": " dije recién, yo no dije, yo dije si tengo una fila donde todo lo elemento fuera de que",
        "start": 1633.6000000000001,
        "end": 1640.92
    },
    {
        "text": " corresponde de diagonal son 0, entonces eso es valor propio, pero guarda que no me digan",
        "start": 1640.92,
        "end": 1647.0
    },
    {
        "text": " esa misma afirmación, si que es distinto de 0 no es el que está en lo que corresponde",
        "start": 1647.0,
        "end": 1651.72
    },
    {
        "text": " de 0, bueno, preguntas, la demostración afíquense este resultado, por ejemplo supongamos",
        "start": 1651.72,
        "end": 1666.64
    },
    {
        "text": " que yo estoy trabajando un dibujito, le voy a hacer, supongamos que yo estoy trabajando",
        "start": 1666.64,
        "end": 1673.8
    },
    {
        "text": " en el con coeficiente complejo, o sea con matrices complejas y tengo que los, los",
        "start": 1673.8,
        "end": 1681.36
    },
    {
        "text": " enediscos de gashgoring son así, no se intersecan 2 a 2, la intersección de cualquiera 2",
        "start": 1681.36,
        "end": 1689.9199999999998
    },
    {
        "text": " de ellos es vacía, son entonces disco así, o sea piensen que tengo enediscos como esto,",
        "start": 1689.9199999999998,
        "end": 1700.48
    },
    {
        "text": " ¿qué me dice gashgoring? Exacto, lo que me dice gashgoring es acá tengo un valor propio,",
        "start": 1700.48,
        "end": 1713.08
    },
    {
        "text": " acá tengo un valor propio, acá tengo un valor propio, acá tengo un valor propio, acá",
        "start": 1713.08,
        "end": 1715.96
    },
    {
        "text": " un valor propio, acá un valor porque son todos distintos porque tengo exactamente 1 acá",
        "start": 1715.96,
        "end": 1720.2
    },
    {
        "text": " en cada uno de esto y como no se intersecan no pueden se coincidir, entonces en este caso",
        "start": 1720.2,
        "end": 1725.1200000000001
    },
    {
        "text": " tenemos n valores propios distintos, estamos trabajando en los complejos así que las",
        "start": 1725.12,
        "end": 1731.3999999999999
    },
    {
        "text": " raíces son valores propios y ahí hemos visto hace ya varias clases que si un T tiene",
        "start": 1731.3999999999999,
        "end": 1739.1999999999998
    },
    {
        "text": " los n valores propios distintos entonces es diagonalizable, fíjense que esta, esta conclusión",
        "start": 1739.1999999999998,
        "end": 1750.04
    },
    {
        "text": " de que te hago diagonalizable, fíjense que en este caso con una construcción geométrica",
        "start": 1750.04,
        "end": 1767.72
    },
    {
        "text": " bien sencilla si se da esto se puede concluir que te haya diagonalizable, si estamos trabajando",
        "start": 1767.72,
        "end": 1772.28
    },
    {
        "text": " los complejos, si estamos trabajando con los reales hay que tener un poquito cuidado porque",
        "start": 1772.28,
        "end": 1776.84
    },
    {
        "text": " yo tengo en el círculo, bueno hay que tener un poquito cuidado, ya lo comentaremos",
        "start": 1776.84,
        "end": 1783.48
    },
    {
        "text": " ahora hay que garantizar que las raíces sean reales que si los coeficientes son reales",
        "start": 1783.48,
        "end": 1793.3999999999999
    },
    {
        "text": " y los círculos son disjuntos y cumple, pero no me quiero adelantar a lo que, a los ejemplos",
        "start": 1793.3999999999999,
        "end": 1799.56
    },
    {
        "text": " al final, bueno la demostración de Gallegorin que después que uno la vez bien sencilla y",
        "start": 1799.56,
        "end": 1808.9199999999998
    },
    {
        "text": " es muy ingeniosa, vamos a probar esta y les voy a comentar la idea tal como está hecho",
        "start": 1808.9199999999998,
        "end": 1818.28
    },
    {
        "text": " en el libro rojo de esta, no lo vamos a probar en todo detalle porque hay unas cuestiones",
        "start": 1818.28,
        "end": 1821.44
    },
    {
        "text": " técnicas acá que no las vamos a probar, bien, cara ahí donde puedo borrar ahora,",
        "start": 1821.44,
        "end": 1833.28
    },
    {
        "text": " puedo borrar en algún lado ahí, bien vamos a la demostración, lo que me dice de aparte",
        "start": 1833.28,
        "end": 1844.0800000000002
    },
    {
        "text": " uno es que todo valor propio está contenido en la unión de esos círculos entonces vamos",
        "start": 1844.0800000000002,
        "end": 1848.0800000000002
    },
    {
        "text": " a considerar un valor propio, consideramos un valor propio, lambda 0 que le vamos a llamar",
        "start": 1848.08,
        "end": 1866.96
    },
    {
        "text": " así y vamos a ver que necesariamente ese valor propio está contenido en la unión",
        "start": 1866.96,
        "end": 1873.56
    },
    {
        "text": " de estos círculos de gallegorin, los círculos de construy ahí, entonces yo tengo un valor",
        "start": 1873.56,
        "end": 1880.9199999999998
    },
    {
        "text": " propio, considera entonces un vector propio, que es un vector propio, un vector propio",
        "start": 1880.9199999999998,
        "end": 1885.76
    },
    {
        "text": " en este contexto es una n³ con n números complejos, tal vez que si yo la pongo acá",
        "start": 1885.76,
        "end": 1894.76
    },
    {
        "text": " al n³, la colgaca y multiplico a por esa n³ me da lambda 0 por esa n³, entonces consideramos",
        "start": 1894.76,
        "end": 1902.8799999999999
    },
    {
        "text": " lambda 0 un valor propio de a y consideramos x³, x³ hasta xn, un vector con n",
        "start": 1902.88,
        "end": 1912.8400000000001
    },
    {
        "text": " tradas complejas o sea un elemento de cial n, vector propio es o sea lambda 0.",
        "start": 1912.84,
        "end": 1936.52
    },
    {
        "text": " Por marcho dibujito este tabla, entonces consideramos un valor propio lambda 0 y un vector",
        "start": 1936.52,
        "end": 1945.32
    },
    {
        "text": " propio cualquiera, hay infinitos vectores propios, agarramos uno cualquiera, vector propios",
        "start": 1945.32,
        "end": 1950.68
    },
    {
        "text": " o sea de este, las entradas de este valor propio son complejas, entonces entonces",
        "start": 1950.68,
        "end": 1962.84
    },
    {
        "text": " lo que se cumple es que ha, como le hacía recién, si le aplico por ese vector puesto",
        "start": 1962.84,
        "end": 1967.9599999999998
    },
    {
        "text": " como columna, eso me da lo mismo que lambda 0 por el vector puesto como columna. Y ahora",
        "start": 1967.9599999999998,
        "end": 1987.32
    },
    {
        "text": " lo que vamos a hacer y esta es la gran idea de gershuring es considerar de este vector",
        "start": 1987.32,
        "end": 1996.08
    },
    {
        "text": " la componente que tenga mayor módulo, es decir considero el módulo de este número complejo,",
        "start": 1996.08,
        "end": 2003.08
    },
    {
        "text": " el módulo de este número complejo, etcétera, etcétera, veo cuál es el más grande",
        "start": 2003.08,
        "end": 2007.12
    },
    {
        "text": " de todos esos números complejos y me quedo con la componente, con esa componente,",
        "start": 2007.12,
        "end": 2014.6799999999998
    },
    {
        "text": " supongamos que esta, supongamos que la tercera fuese la más grande, me quedo con la",
        "start": 2014.68,
        "end": 2019.3600000000001
    },
    {
        "text": " iniciatriz que corresponde a la componente más grande y se se repetiera a la más grande",
        "start": 2019.3600000000001,
        "end": 2023.6000000000001
    },
    {
        "text": " si la más grande fuese a esta y la dos y la diez, bueno elijo alguna, tanto da.",
        "start": 2023.6000000000001,
        "end": 2030.96
    },
    {
        "text": " Me estoy quedando de todas estas componentes con números complejos, me estoy quedando con",
        "start": 2030.96,
        "end": 2037.4
    },
    {
        "text": " aquella que tiene el módulo más grande, la distancia al cero, es alto, es alto, entonces",
        "start": 2037.4,
        "end": 2045.0800000000002
    },
    {
        "text": " lo que vamos a hacer es, no fijamos el componente de mayor módulo.",
        "start": 2045.0800000000002,
        "end": 2067.12
    },
    {
        "text": " El vector propio y consideramos entonces consideramos entonces el índice hícero que corresponde",
        "start": 2067.12,
        "end": 2086.68
    },
    {
        "text": " a la componente de mayor módulo, supongamos que la componente de mayor módulo fuese la cuarta,",
        "start": 2086.68,
        "end": 2091.2
    },
    {
        "text": " el índice hícero es cuatro, entonces consideramos hícero tal que el módulo de la componente",
        "start": 2091.2,
        "end": 2101.24
    },
    {
        "text": " hícero es igual al máximo de todas las componentes, x1, x2, hasta aquí se ve.",
        "start": 2101.24,
        "end": 2117.96
    },
    {
        "text": " Esto marea pero ya lo repito.",
        "start": 2117.96,
        "end": 2129.88
    },
    {
        "text": " O sea lo que estoy haciendo es este vector propio agarré uno a cualquiera los infinitos",
        "start": 2129.88,
        "end": 2137.42
    },
    {
        "text": " vectoros propios que hay, de este vector propio las componentes son números complejos,",
        "start": 2137.42,
        "end": 2143.1
    },
    {
        "text": " los módulos de todas esas componentes y veo cuál es la que tiene módulo más grande,",
        "start": 2143.1,
        "end": 2149.2599999999998
    },
    {
        "text": " pero la componente tiene módulo más grande, o sea en este caso la x0 es el máximo",
        "start": 2149.2599999999998,
        "end": 2155.4
    },
    {
        "text": " de todas las componentes, la de note así y me fico cuál es esa componente, entonces",
        "start": 2155.4,
        "end": 2159.36
    },
    {
        "text": " si me fico la hícero, lo que estoy diciendo es si la primera componente más grande",
        "start": 2159.36,
        "end": 2164.24
    },
    {
        "text": " fuese la primera en módulo el índice que estoy considerando es el uro, o sea consideramos",
        "start": 2164.24,
        "end": 2171.2
    },
    {
        "text": " el hícero tal que la componente hícero es la que tiene módulo máximo. Una observación",
        "start": 2171.2,
        "end": 2179.48
    },
    {
        "text": " bien sencilla, van a ver, es lindo esta prueba porque uno acá está agarrando un vector",
        "start": 2179.48,
        "end": 2188.8999999999996
    },
    {
        "text": " totalmente arbitrario y está ligiendo la componente módulo máximo y van a ver que después",
        "start": 2188.8999999999996,
        "end": 2193.5
    },
    {
        "text": " las pruebas a esas componentes se van todas, desaparece el vector, no me tengo que preocupar",
        "start": 2193.5,
        "end": 2199.1
    },
    {
        "text": " por este que vector era. Hay un punto importante, como esto es un vector propio, como esto es",
        "start": 2199.1,
        "end": 2212.12
    },
    {
        "text": " un vector propio tiene que ser distinto el vector nulo, eso quiere decir que las componentes",
        "start": 2212.12,
        "end": 2220.2599999999998
    },
    {
        "text": " bueno algunas podrán ser cero pero no todas pueden ser cero, o sea que el módulo máximo",
        "start": 2220.2599999999998,
        "end": 2224.7799999999997
    },
    {
        "text": " tiene que ser distinto el cero tiene que ser mayor el estricto de cero, porque decir",
        "start": 2224.78,
        "end": 2228.92
    },
    {
        "text": " el módulo máximo fuese cero significa que todas las componentes son cero, entonces lo",
        "start": 2228.92,
        "end": 2233.82
    },
    {
        "text": " que se cumple es que EX y cero es distinto de cero, es estrictamente mayor que cero, se",
        "start": 2233.82,
        "end": 2242.38
    },
    {
        "text": " entendió eso, insisto, esto es un vector propio, no puede ser por definición el vector nulo,",
        "start": 2242.38,
        "end": 2250.3
    },
    {
        "text": " entonces como estoy considerando el módulo máximo estas componentes, la componente módulo",
        "start": 2250.3,
        "end": 2254.98
    },
    {
        "text": " máximo no puede ser cero, sino todas serían cero. Bien y lo que vamos a hacer ahora,",
        "start": 2254.98,
        "end": 2265.86
    },
    {
        "text": " nos vamos a fijar de esta ecuación, la componente corresponde a este índice, al índice",
        "start": 2265.86,
        "end": 2276.38
    },
    {
        "text": " y cero que corresponde al vector propio de esta mayor maxima, parece todo medio",
        "start": 2276.38,
        "end": 2282.42
    },
    {
        "text": " rebuscado y en realidad sí es un poco rebuscado, pues ya van a ver cómo con esa elección sale",
        "start": 2282.42,
        "end": 2289.34
    },
    {
        "text": " todo derecho, lo que vamos a probar es que este lambda cero con el cual arranque está contenido",
        "start": 2289.34,
        "end": 2299.62
    },
    {
        "text": " con el círculo correspondiente a esta fila, la fila I es y cero, donde I cero es el índice",
        "start": 2299.62,
        "end": 2308.18
    },
    {
        "text": " acá el que corresponde al mayor módulo del vector propio que leje, bien, no quería borrar",
        "start": 2308.18,
        "end": 2316.7799999999997
    },
    {
        "text": " nada, no quiero borrar esto acá, me deja borrar esta parte, esto que tenemos acá,",
        "start": 2316.7799999999997,
        "end": 2328.38
    },
    {
        "text": " entonces nos fijamos en la fila I es y cero, perdón, nos fijamos en la fila y cero de lo",
        "start": 2328.38,
        "end": 2349.1400000000003
    },
    {
        "text": " que hemos llamado ahí asterisco, la ecuación es matricial, cómo construyo, es una estupiedera",
        "start": 2349.14,
        "end": 2364.62
    },
    {
        "text": " que voy a preguntar, pero cómo construyo, cómo me fijo de este lado, cuál es la fila",
        "start": 2364.62,
        "end": 2368.5
    },
    {
        "text": " I cero, cuál es el elemento que correspondería al lugar I cero acá como fila, tengo que agarrar",
        "start": 2368.5,
        "end": 2376.7
    },
    {
        "text": " pero tengo que agarrar acá la fila I cero, con la primera fila me construyo el primer",
        "start": 2376.7,
        "end": 2386.08
    },
    {
        "text": " elemento, una segunda fila del segundo, el I cero me lo construyo considerando acá la fila I cero,",
        "start": 2386.08,
        "end": 2392.2599999999998
    },
    {
        "text": " bien, no sea acá que sea lo que Dios quiere, lo importante que acá tenemos A I cero I,",
        "start": 2392.2599999999998,
        "end": 2398.7
    },
    {
        "text": " se empieza a poner fe acá la notación por el I cero S y por que son el índice de la matriz,",
        "start": 2398.7,
        "end": 2409.22
    },
    {
        "text": " la I cero I, el A y cero II, por acá vendrá el A y cero y cero que es Cero y por acá",
        "start": 2409.22,
        "end": 2423.98
    },
    {
        "text": " vendrá el A y cero N y esto, nuestra cosa, esto acá es la fila I cero, bien, entonces",
        "start": 2423.98,
        "end": 2443.34
    },
    {
        "text": " estoy considerando lo que corresponde la fila I cero acá, eso lo tengo que multiplicar por",
        "start": 2443.34,
        "end": 2447.7
    },
    {
        "text": " X I, X II hasta X N que son las coronadas del vector propio y esto me dará, bueno acá",
        "start": 2447.7,
        "end": 2455.46
    },
    {
        "text": " arriba me dará lo que me debe dar pero la componente I cero lo que corresponde a la fila I cero será",
        "start": 2455.46,
        "end": 2460.66
    },
    {
        "text": " A y cero I por esto, más A y cero II, por aquí es 2, etcétera, más A y cero y cero por",
        "start": 2460.66,
        "end": 2475.74
    },
    {
        "text": " X I cero, es horrible la escritura de esto, más A y cero N por X N y acá abajo seguirán",
        "start": 2475.74,
        "end": 2492.1
    },
    {
        "text": " las otras componentes, entonces me estoy concentrando en la componente I cima de esta igualdad,",
        "start": 2492.1,
        "end": 2502.4599999999996
    },
    {
        "text": " en lo que corresponde la fila I cima de esta igualdad vectoría al que tengo ahí. Bueno,",
        "start": 2502.46,
        "end": 2523.66
    },
    {
        "text": " y eso es lo que está de este lado, eso es lo que está de lado izquierdo y lo que está",
        "start": 2523.66,
        "end": 2528.1
    },
    {
        "text": " de lado derecho será, será lambda 0 por la corrupondiente X I cero acá, esto será igual entonces",
        "start": 2528.1,
        "end": 2535.14
    },
    {
        "text": " lo que está de lado derecho será a cala 0 por X I cero y el resto.",
        "start": 2538.3399999999997,
        "end": 2544.62
    },
    {
        "text": " Me siguen hasta acá.",
        "start": 2544.62,
        "end": 2557.22
    },
    {
        "text": " Repaso por el quede por 5 a ver todo, agarro un valor propio cualquiera, me fijó en un",
        "start": 2557.22,
        "end": 2574.8799999999997
    },
    {
        "text": " valor vector propio cualquiera, de ese vector propio me fijó cuál es la componente que tiene",
        "start": 2574.8799999999997,
        "end": 2581.74
    },
    {
        "text": " un módulo máximo, a esa componente la agarro le llamo y sub cero y sub cero entonces pone",
        "start": 2581.74,
        "end": 2587.2599999999998
    },
    {
        "text": " finición aquella que corresponde a la componente de módulo máximo y después vengo a esta igualdad",
        "start": 2587.2599999999998,
        "end": 2595.02
    },
    {
        "text": " vectoría y me quedo con la fila I cero, lo que corresponde a I cero, trabajamos eso y vamos a",
        "start": 2595.02,
        "end": 2602.1
    },
    {
        "text": " ver que efectivamente el lambda 0, el valor propio original estaba en el disco correspondiente a",
        "start": 2602.1,
        "end": 2607.58
    },
    {
        "text": " esta I cero, esa es la idea de la demostración. Entonces de la de la igualdad de aquello correspondiente",
        "start": 2607.58,
        "end": 2620.66
    },
    {
        "text": " a la fila I cero sale que esto acá es igual a lambda 0 por X I cero, entonces lo que tenemos",
        "start": 2620.66,
        "end": 2631.1
    },
    {
        "text": " A y cero por X I, más A y cero, pero no A y cero, uno por X I, uno más A y cero, dos por",
        "start": 2637.58,
        "end": 2645.2999999999997
    },
    {
        "text": " X I, dos más A y cero y cero por X I cero, más A y cero N por X N igual a lambda 0 por X I cero.",
        "start": 2645.3,
        "end": 2666.7000000000003
    },
    {
        "text": " Uy ha sido mejor llamarle cae en lugar de I cero, pero bueno, todo por seguir la notación del libro.",
        "start": 2675.3,
        "end": 2689.94
    },
    {
        "text": " Calma que ya termina. Y lo que vamos a hacer entonces es vamos a pasar esto que tiene",
        "start": 2696.7400000000002,
        "end": 2704.2200000000003
    },
    {
        "text": " X I cero por este otro lado y entonces me va a quedar y ahora sí escribo esto como una sumatoria,",
        "start": 2704.22,
        "end": 2714.58
    },
    {
        "text": " me va a quedar de este lado la sumatoria de A y cero, J por X J, o sea Y cero, 1, X I,",
        "start": 2714.58,
        "end": 2725.7
    },
    {
        "text": " 1, A y cero, 2, X I, etc. hasta A y cero N, X N, o sea J desde 1 hasta N excepto que acá no está",
        "start": 2725.7,
        "end": 2733.22
    },
    {
        "text": " el sumado correspondiente a Y cero, porque lo pase por el otro lado, me va a quedar eso,",
        "start": 2734.58,
        "end": 2740.4199999999996
    },
    {
        "text": " A y cero J, A y Cero, sumo sobre todo los J distintos D cero y de este lado me va a quedar",
        "start": 2740.4199999999996,
        "end": 2747.48
    },
    {
        "text": " X I cero, lo saco como un factor común, esa componente y me va a quedar entonces lambda 0 menos A y cero y cero por X I cero.",
        "start": 2747.56,
        "end": 2758.84
    },
    {
        "text": " Y esta es una igualdad de números complejos.",
        "start": 2758.84,
        "end": 2760.96
    },
    {
        "text": " Estamos.",
        "start": 2765.44,
        "end": 2766.16
    },
    {
        "text": " Queda el último pasito, que hacemos con esa igualdad de números complejos, tomamos módulos",
        "start": 2769.4,
        "end": 2775.18
    },
    {
        "text": " ambos lados, módulos de los números complejos, ¿no?",
        "start": 2775.18,
        "end": 2785.18
    },
    {
        "text": " Si tomo módulos ambos lados y ahora pongo esto cambio el orden de esto,",
        "start": 2795.06,
        "end": 2799.7799999999997
    },
    {
        "text": " porque es más cómodo, me va a quedar por un lado lambda 0 menos A y cero y cero por X I cero,",
        "start": 2799.78,
        "end": 2810.02
    },
    {
        "text": " el módulo de eso, el módulo de esto, igual al módulo de todo eso suma, que lo vamos a",
        "start": 2810.02,
        "end": 2820.1000000000004
    },
    {
        "text": " escribir así, en lugar de poner suma de J igual a 1 hasta N con J distintos D cero, vamos a poner",
        "start": 2820.1000000000004,
        "end": 2824.46
    },
    {
        "text": " directamente J distintos D cero, J distintos D cero de A y cero J por X j.",
        "start": 2824.46,
        "end": 2834.7400000000002
    },
    {
        "text": " Estamos. Ya sale esto. Ahora que hacemos en este lado del igualdad tenemos el módulo",
        "start": 2834.74,
        "end": 2856.9599999999996
    },
    {
        "text": " de una suma, acotamos eso por arriba por la suma de los módulos, la propiedad que ustedes",
        "start": 2856.9599999999996,
        "end": 2862.2999999999997
    },
    {
        "text": " conocen, o sea que esto es menor igual que la suma de J sobre J distintos D cero, del",
        "start": 2862.3,
        "end": 2870.82
    },
    {
        "text": " módulo de esto, pero el módulo de un producto es el módulo de los módulos, o sea que",
        "start": 2870.82,
        "end": 2874.26
    },
    {
        "text": " eso lo puede escribir así, A y cero J por módulo de X j, o sea que esto lo puede",
        "start": 2874.26,
        "end": 2882.9
    },
    {
        "text": " acotar por arriba por la suma de J, del módulo de esto por el módulo de esto, me falta",
        "start": 2882.9,
        "end": 2895.54
    },
    {
        "text": " un 2 mini pasos ahí, como acotarían esto, acá es una suma de J, el IN se J aparece",
        "start": 2895.54,
        "end": 2903.78
    },
    {
        "text": " acá y aparece acá, no para para para, como acotaríamos esto? Recordemos que como elegimos",
        "start": 2903.78,
        "end": 2914.1400000000003
    },
    {
        "text": " el elicero, lo elegimos alicero tal manera que el módulo de X j es mayor igual que",
        "start": 2914.1400000000003,
        "end": 2919.7400000000002
    },
    {
        "text": " cualquiera de estos módulos, o sea que cualquiera que sea el módulo que yo ponga acá, el",
        "start": 2919.7400000000002,
        "end": 2923.5400000000004
    },
    {
        "text": " X j que yo ponga acá, el X j va a ser menor igual que el X j, el módulo por elección",
        "start": 2923.5400000000004,
        "end": 2929.34
    },
    {
        "text": " delicero, o sea que esto es la derecha, por elección delicero cada uno de estos lo",
        "start": 2929.34,
        "end": 2935.38
    },
    {
        "text": " puede acotar por X y cero, o sea que esto lo puede acotar por su matoria J a distinto",
        "start": 2935.38,
        "end": 2942.1000000000004
    },
    {
        "text": " delicero, de A y cero J por X y cero y eso lo cotamos, bueno voy a tener que borrar esto",
        "start": 2942.1000000000004,
        "end": 2953.1400000000003
    },
    {
        "text": " lamentablemente, eso va a a la elección delicero justamente, y cero le elegimos tal manera",
        "start": 2953.14,
        "end": 2967.54
    },
    {
        "text": " que esto que respondiera el módulo de la componente, por lo tanto esto es mayor igual que",
        "start": 2967.54,
        "end": 2971.98
    },
    {
        "text": " X j para todo j, entonces con esto yo tenemos algo que es independiente de J, lo podemos",
        "start": 2971.98,
        "end": 2978.5
    },
    {
        "text": " sacar para fuera de su matoria, es un factor común, y de este lado que tenemos, tenemos",
        "start": 2978.5,
        "end": 2986.42
    },
    {
        "text": " el módulo de un producto que es el producto de los módulos, o sea de este lado tenemos",
        "start": 2986.42,
        "end": 2990.46
    },
    {
        "text": " lambda cero menos A y cero y cero por módulo de X y cero igual a eso está ahí arriba,",
        "start": 2990.46,
        "end": 3006.26
    },
    {
        "text": " estamos entonces de este lado tenemos esta igualdad, de este lado tenemos acotado por esto,",
        "start": 3006.26,
        "end": 3014.3
    },
    {
        "text": " esta expresión, ¿qué podemos hacer ahí? Fíjense que X y cero el módulo está acá y X y cero",
        "start": 3014.3,
        "end": 3021.98
    },
    {
        "text": " el módulo está acá como falta el común, ¿qué podemos hacer cancelarlo? Y ¿por qué lo podemos",
        "start": 3021.98,
        "end": 3026.1400000000003
    },
    {
        "text": " cancelar justamente porque hay cinto de cero? ¿por qué hay cinto de cero? Sabemos que hay cinto de cero",
        "start": 3026.1400000000003,
        "end": 3032.02
    },
    {
        "text": " entonces puede vivir a ambos lados, por esto y este X y cero se me cancela con esto, bien entonces",
        "start": 3032.02,
        "end": 3039.0600000000004
    },
    {
        "text": " me implica entonces, me implica entonces como X y cero el distinto de cero me implica que",
        "start": 3039.06,
        "end": 3053.94
    },
    {
        "text": " lambda cero menos A y cero y cero, simplifique los dos de X y cero ahí es menor igual que la suma",
        "start": 3053.94,
        "end": 3066.02
    },
    {
        "text": " de j de distinto de cero a y cero j",
        "start": 3066.9,
        "end": 3074.46
    },
    {
        "text": " se entendió, o sea fíjense que esta es una de la igualdad que me involucra los elementos de la",
        "start": 3074.46,
        "end": 3100.34
    },
    {
        "text": " matriz original de la fila y cero y el valor propio original el lambda cero y ahí como les decía",
        "start": 3100.34,
        "end": 3109.1000000000004
    },
    {
        "text": " todo lo que involucrase a las componentes del vector propio se desaparecido ya no están más y",
        "start": 3109.1000000000004,
        "end": 3115.7400000000002
    },
    {
        "text": " ¿qué me dice este igualdad? ¿qué justamente esto? esto estoy agarrando la fila y cero y estoy sumando",
        "start": 3115.7400000000002,
        "end": 3122.86
    },
    {
        "text": " todos estos módulos, el de este, el de este, etcétera el de este excepto el que corresponde la",
        "start": 3122.86,
        "end": 3130.3
    },
    {
        "text": " diagonal, excepto el de este eso por definición que era de los círculos de gargigorin, eso es el",
        "start": 3130.3,
        "end": 3136.94
    },
    {
        "text": " radio de círculo de gargigorin correspondiente a la fila y cero o sea esto acá es, esto acá es",
        "start": 3136.94,
        "end": 3144.6200000000003
    },
    {
        "text": " el radio de gargigorin correspondiente a la fila y cero y esto acá es el centro del círculo de",
        "start": 3144.62,
        "end": 3163.2799999999997
    },
    {
        "text": " gargigorin correspondiente a la fila y cero o sea acá tenemos del círculo de gargigorin correspondiente",
        "start": 3163.2799999999997,
        "end": 3172.46
    },
    {
        "text": " a la fila y cero acá tenemos el centro y acá tenemos el radio y estamos diciendo que la distancia",
        "start": 3172.46,
        "end": 3178.34
    },
    {
        "text": " de lambda cero al centro el módulo es menor igual que el radio correspondiente entonces",
        "start": 3178.34,
        "end": 3184.3
    },
    {
        "text": " que estamos diciendo que lambda cero está en el círculo de gargigorin correspondiente a este",
        "start": 3184.3,
        "end": 3190.5
    },
    {
        "text": " índice esto es lo que estamos diciendo acá es que lambda cero está en el círculo de gargigorin",
        "start": 3190.5,
        "end": 3203.54
    },
    {
        "text": " correspondiente a el índice y cero es decir recuerden que el círculo es aquellos con aquellos",
        "start": 3203.54,
        "end": 3209.32
    },
    {
        "text": " elementos del plano complejo tal que la distancia al centro es el módulo del cargario y vamos",
        "start": 3209.32,
        "end": 3214.86
    },
    {
        "text": " estamos diciendo que la distancia de lambda cero al centro es menor igual que el radio por",
        "start": 3214.86,
        "end": 3219.1400000000003
    },
    {
        "text": " tanto lambda cero está en el círculo complejo asociado a ese índice al cero y por lo tanto lambda",
        "start": 3219.1400000000003,
        "end": 3228.7000000000003
    },
    {
        "text": " cero está en algunos círculos por lo tanto lambda cero está en la unión de todos los círculos",
        "start": 3228.7000000000003,
        "end": 3235.98
    },
    {
        "text": " de gargigorin con hídes de 1 hasta n o sea lo que estamos probando es que cada valor",
        "start": 3235.98,
        "end": 3244.26
    },
    {
        "text": " propio para cada valor propio podemos encontrar un círculo tal que contiene ese valor propio",
        "start": 3244.26,
        "end": 3250.7
    },
    {
        "text": " por lo tanto el valor propio está en la unión de todos esos círculos se entendió fíjense",
        "start": 3250.7,
        "end": 3259.14
    },
    {
        "text": " que es muy ingeniosa la prueba porque se mete con un vector propio pero después el vector",
        "start": 3259.14,
        "end": 3264.1
    },
    {
        "text": " propio eligiendo apropiadamente la componente se ve esto propio desaparece y me queda una",
        "start": 3264.1,
        "end": 3270.54
    },
    {
        "text": " condición entre lambda cero y los elementos de la fila correspondiente a cero y lo que me",
        "start": 3270.54,
        "end": 3279.14
    },
    {
        "text": " termine diciendo es que la distancia de lambda cero al centro al círculo de gargigorin con",
        "start": 3279.14,
        "end": 3283.8199999999997
    },
    {
        "text": " los medios de fila es menor igual que el radio o sea que está en ese círculo de verdad.",
        "start": 3283.8199999999997,
        "end": 3288.1
    },
    {
        "text": " Bueno preguntas es un poco tedioso pero esto es solamente útil. Lo que voy a hacer como les decía",
        "start": 3288.1,
        "end": 3304.58
    },
    {
        "text": " es comentarles la idea que es bien sencilla pero tiene una cuestión técnica hay que resolver de",
        "start": 3304.58,
        "end": 3310.86
    },
    {
        "text": " cómo se prueba la parte 2 y con eso terminamos la clase. Bueno la parte 2 sí se acuerdan",
        "start": 3310.86,
        "end": 3328.7400000000002
    },
    {
        "text": " lo que me decía la parte 2 si tengo m círculos que son disjuntos el resto entonces en ese conjunto",
        "start": 3328.7400000000002,
        "end": 3334.58
    },
    {
        "text": " en el círculo hay m raíces características contadas con su multiplicidad. Se vamos a contar",
        "start": 3334.58,
        "end": 3339.42
    },
    {
        "text": " la idea de esto porque hay una cuestión técnica que no vamos a probar. Entonces lo que hacemos es a la",
        "start": 3339.42,
        "end": 3348.2999999999997
    },
    {
        "text": " matriz la descomponemos en la diagonal y en el resto de la diagonal o sea consideramos",
        "start": 3348.2999999999997,
        "end": 3355.1
    },
    {
        "text": " las matrices. Me las construyo partir de a no la de la diagonal es tiene los elementos la diagonal",
        "start": 3355.1,
        "end": 3375.62
    },
    {
        "text": " que coinciden con los elementos de la matrices original y todo lo que está fuera de diagonal lo",
        "start": 3375.62,
        "end": 3381.18
    },
    {
        "text": " chanto igual a cero. Esa es la primera matriz que consideramos y la segunda matriz es una matriz",
        "start": 3381.18,
        "end": 3396.06
    },
    {
        "text": " que ahora hago todo lo elemento le da una ligua a cero y los fuera de diagonal lo hago coincidir con los",
        "start": 3396.06,
        "end": 3401.22
    },
    {
        "text": " fuera. Que ese matriz le vamos a llamar E.",
        "start": 3401.22,
        "end": 3405.5
    },
    {
        "text": " Estamos entonces agarro la matriz se paro por un lado la diagonal y por el lado el resto.",
        "start": 3432.22,
        "end": 3444.54
    },
    {
        "text": " Con la diagonal me fabrico la matriz de que coincide con la de A y todo el resto son cero y con",
        "start": 3445.54,
        "end": 3451.4199999999996
    },
    {
        "text": " el resto las entradas me fabrico la matriz de donde en todas las entradas de diagonal le puesto cero.",
        "start": 3451.4199999999996,
        "end": 3456.14
    },
    {
        "text": " Bueno, ¿qué relaciona hay entre esas matrices?",
        "start": 3457.14,
        "end": 3462.14
    },
    {
        "text": " Obviamente si yo sumo esas dos matrices tengo A o sea que A es igual a Dmac.",
        "start": 3464.14,
        "end": 3472.22
    },
    {
        "text": " Bien hasta ahí es una definición de matrices que separa la parte diagonal del resto pero ahora lo",
        "start": 3478.22,
        "end": 3485.74
    },
    {
        "text": " que vamos a hacer es vamos a asignar vamos a construir una familia a matrices que depende de un",
        "start": 3485.74,
        "end": 3493.7799999999997
    },
    {
        "text": " parámetro epsilo que está entre cero y uno y lo construimos a familia de la siguiente manera.",
        "start": 3493.7799999999997,
        "end": 3497.9799999999996
    },
    {
        "text": " Para cada epsilo entre cero y uno para cada epsilo entre cero y uno se define la matrices",
        "start": 3499.58,
        "end": 3510.74
    },
    {
        "text": " A que depende de epsilón que es igual a D más epsilón por E.",
        "start": 3516.74,
        "end": 3524.66
    },
    {
        "text": " Fíjense que lo que estamos haciendo estamos agarrando la matriz diagonal esa es a",
        "start": 3530.8999999999996,
        "end": 3535.9799999999996
    },
    {
        "text": " esa queda como está y le estamos sumando la matriz diagonal esta matriz cada una de las entradas",
        "start": 3535.9799999999996,
        "end": 3541.9399999999996
    },
    {
        "text": " han multiplicado por epsilón evidentemente cuando epsilón igual a uno recupero esto pero cuando",
        "start": 3541.94,
        "end": 3548.14
    },
    {
        "text": " epsilón lo va arriendo entre cero y uno cuando epsilón va al cero me queda esta matriz la diagonal",
        "start": 3548.14,
        "end": 3552.82
    },
    {
        "text": " porque esto se llama el cero y en medida que hubiera montado epsilón le voy agregando estos",
        "start": 3552.82,
        "end": 3558.62
    },
    {
        "text": " términos con mayor peso acá hasta que eventualmente cuando epsilón va a leer uno me queda la matriz",
        "start": 3558.62,
        "end": 3562.98
    },
    {
        "text": " a final o sea esta es una deformación continua una familia continua de matrices que dependen",
        "start": 3562.98,
        "end": 3570.78
    },
    {
        "text": " continuamente el parámetro epsilón solamente estoy multiplicando vez que ha entrado por epsilón que",
        "start": 3570.78,
        "end": 3576.6600000000003
    },
    {
        "text": " cumple familia de matrices familia que dependen para continuamente de epsilón",
        "start": 3576.6600000000003,
        "end": 3584.0600000000004
    },
    {
        "text": " se cumple a cuando epsilón va al cero me queda la diagonal bien y a cuando epsilón va al",
        "start": 3589.5800000000004,
        "end": 3598.6400000000003
    },
    {
        "text": " cero y uno en el otro caso extremo me queda la matriz original la y además depende con",
        "start": 3598.64,
        "end": 3605.8799999999997
    },
    {
        "text": " y son matrices continuas hay continuidad en el parámetro epsilón es si yo tengo una familia",
        "start": 3605.8799999999997,
        "end": 3616.6
    },
    {
        "text": " de matrices que dependen de un parámetro y ese parámetro cuando lo va a arro entre cero y uno",
        "start": 3616.6,
        "end": 3621.96
    },
    {
        "text": " tengo una familia continua de matrices que van desde la diagonal hasta la matriz final hasta",
        "start": 3621.96,
        "end": 3629.12
    },
    {
        "text": " la matriz que estoy considerando la tendrónio entonces para cada epsilón yo tengo una matriz para",
        "start": 3629.12,
        "end": 3637.92
    },
    {
        "text": " esa matriz le voy a considerar el polinomio característico y los correspondientes valores propios",
        "start": 3637.92,
        "end": 3643.88
    },
    {
        "text": " para cada epsilón en cero y uno consideramos",
        "start": 3652.12,
        "end": 3659.76
    },
    {
        "text": " si le voy a llamar así si epsilón de la anda que es el polinomio característico de la matriz a epsilón",
        "start": 3664.56,
        "end": 3671.8
    },
    {
        "text": " y tengo el polinomio característico associado a epsilón y me considero las raíces",
        "start": 3681.96,
        "end": 3696.84
    },
    {
        "text": " características que van a depender de epsilón les voy a llamar lambda epsilón 1 pero un lambda 1 de epsilón",
        "start": 3696.84,
        "end": 3707.12
    },
    {
        "text": " lambda 2 de epsilón etcétera lambda n de epsilón sabemos que estamos trabajando los complejos y por el",
        "start": 3711.96,
        "end": 3721.16
    },
    {
        "text": " terrofa fundamental de la vez que hay n raíces contada con su multiplicidad lambda n de epsilón las raíces",
        "start": 3721.16,
        "end": 3727.44
    },
    {
        "text": " con su multiplicidad",
        "start": 3727.44,
        "end": 3730.2000000000003
    },
    {
        "text": " Bien, quiero ver que no me saltí nada, bueno entonces retomando. Tengo la matrisa, se",
        "start": 3757.44,
        "end": 3777.52
    },
    {
        "text": " paro por un lado la diagonal, por otro lado el resto de diagonal. Y con eso me fabrico",
        "start": 3777.52,
        "end": 3782.16
    },
    {
        "text": " una familia que depende de parada, una familia de matrisa que depende de un parada de px,",
        "start": 3782.16,
        "end": 3786.46
    },
    {
        "text": " que va entre 0 y 1, eso es la diagonal, más la matrisa es por epsilón, así por todas",
        "start": 3786.46,
        "end": 3791.32
    },
    {
        "text": " las entradas multiplicadas por epsilón. Entonces esta familia de matrisa es cumple, que si",
        "start": 3791.32,
        "end": 3795.88
    },
    {
        "text": " le va a valorar el epsilón igual a 0 la diagonal y si le va a valorar el epsilón igual",
        "start": 3795.88,
        "end": 3799.06
    },
    {
        "text": " a 1 es la matrisa que estoy considerando la. Y además para cada epsilón entonces me",
        "start": 3799.06,
        "end": 3805.84
    },
    {
        "text": " fijo en el polínomo característico, la matrisa corresponde, eso lo llamó G sobre",
        "start": 3805.84,
        "end": 3810.28
    },
    {
        "text": " la habla y me fijo las correspondientes raíces característicos con su multiplicidad, que son",
        "start": 3810.28,
        "end": 3814.8
    },
    {
        "text": " las entradas, tan da 1 de epsilón, tan da 1 de epsilón, etcétera, hasta la landa de epsilón.",
        "start": 3814.8,
        "end": 3819.36
    },
    {
        "text": " Y acá viene la parte técnica que no vamos a probar, y vamos a seguir con la idea. Hay un resultado",
        "start": 3819.36,
        "end": 3826.36
    },
    {
        "text": " técnico fíjense, acá las entradas son de estas matrisas son funciones continuas en epsilón,",
        "start": 3826.36,
        "end": 3834.84
    },
    {
        "text": " sí porque fíjense de cuando sumo la diagonal, si le voy a hacer la diagonal, más esto multiplicado",
        "start": 3834.84,
        "end": 3839.48
    },
    {
        "text": " por epsilón, obviamente todas las entradas estoy multiplicando por epsilón, las que están",
        "start": 3839.48,
        "end": 3843.04
    },
    {
        "text": " fuera de diagonal y están dejo igual. Esas son funciones continuas de epsilón, por lo",
        "start": 3843.04,
        "end": 3847.72
    },
    {
        "text": " tanto si yo calculo el determinante es a matriz, menos landa por e me va a quedar un polinomio",
        "start": 3847.72,
        "end": 3854.12
    },
    {
        "text": " en donde los coeficientes son funciones continuas de epsilón, serán epsilón epsilón",
        "start": 3854.12,
        "end": 3858.82
    },
    {
        "text": " al cuadrado, sino al cúbulo que fuera, son funciones continuas de epsilón. El resultado técnico",
        "start": 3858.82,
        "end": 3864.42
    },
    {
        "text": " es que si yo tengo un polinomio que depende continuamente de un parámetro entonces sus",
        "start": 3864.42,
        "end": 3869.04
    },
    {
        "text": " raíces también dependen de manera continuo ese parámetro, es decir, si yo tengo un polinomio",
        "start": 3869.04,
        "end": 3876.04
    },
    {
        "text": " cuyas raíces características son estas y yo lo muevo un poquito, se polinomó a los",
        "start": 3876.04,
        "end": 3880.36
    },
    {
        "text": " coeficientes, entonces las raíces características cambian muy poquito, es un resultado que",
        "start": 3880.36,
        "end": 3885.4
    },
    {
        "text": " razonable y natural, pero un resultado técnico que hay que probar y que no vamos a probar,",
        "start": 3885.4,
        "end": 3890.92
    },
    {
        "text": " que es que como acá tenemos continuidad en epsilón, en la matriz y en el polinomio,",
        "start": 3890.92,
        "end": 3896.68
    },
    {
        "text": " las raíces son continuas en epsilón, entonces se cumple, se cumple, para cada ahí, desde",
        "start": 3896.68,
        "end": 3913.9199999999996
    },
    {
        "text": " uno todo hasta n, lambda y de epsilón, es una función continuada de epsilón, epsilón",
        "start": 3913.92,
        "end": 3930.12
    },
    {
        "text": " este es el resultado, como ya decía, este es el resultado técnico que hay que probar",
        "start": 3930.12,
        "end": 3940.3599999999997
    },
    {
        "text": " y además, cuanto vale en esta raíces cuando epsilón vale cero y cuando epsilón vale",
        "start": 3940.3599999999997,
        "end": 3950.16
    },
    {
        "text": " cero, la matriz y el cero corresponde a la diagonal y tengo una matriz diagonal, entonces",
        "start": 3950.16,
        "end": 3968.7999999999997
    },
    {
        "text": " los elementos de la diagonal son los valores propios, son las raíces, ya tengo una",
        "start": 3968.7999999999997,
        "end": 3974.08
    },
    {
        "text": " matriz diagonal, entonces podemos pensar que la raí y de epsilón la llamamos a aquella",
        "start": 3974.08,
        "end": 3978.64
    },
    {
        "text": " de corresponde acá a la entrada y epsilón la diagonal, o sea que la raí y lambda y en cero corresponde",
        "start": 3978.64,
        "end": 3987.7599999999998
    },
    {
        "text": " con el elemento a su vi, o sea justamente identifica la idea y epsilón con la que corresponde a",
        "start": 3987.7599999999998,
        "end": 3997.64
    },
    {
        "text": " la cae elemento a su vi y en medio que voy cambiando epsilón voy deformando esa raí",
        "start": 3997.64,
        "end": 4004.04
    },
    {
        "text": " característica, voy variando de manera continua hasta que finalmente cuando llegó al otro",
        "start": 4004.04,
        "end": 4008.52
    },
    {
        "text": " extremo cuando epsilón vale uno, en que se va a convertir esa lambda y, en la raí",
        "start": 4008.52,
        "end": 4013.3399999999997
    },
    {
        "text": " característica de la matriz original que estamos estudiando, la matriz inicial de la",
        "start": 4013.3399999999997,
        "end": 4016.8799999999997
    },
    {
        "text": " y o sea en cero la raí vale a su vi y cuando vale uno tengo la valor propio de a, que",
        "start": 4017.88,
        "end": 4027.36
    },
    {
        "text": " le vamos a llamar lambda y valor propio de a, o sea que cada una de estas funciones de epsilón",
        "start": 4027.36,
        "end": 4038.88
    },
    {
        "text": " cada una de estas raíces características que dependen de epsilón son funciones que van desde",
        "start": 4038.88,
        "end": 4045.08
    },
    {
        "text": " cada uno de los elementos de diagonal como punto de partida hasta una raí, hasta las raíces",
        "start": 4045.08,
        "end": 4051.92
    },
    {
        "text": " 1, 2 etcétera hasta n de la matriz que estoy trabajando la y esas funciones cambian de manera",
        "start": 4051.92,
        "end": 4059.4
    },
    {
        "text": " continua y entonces y acá ya terminamos, crean me que ya terminamos, que me dice el",
        "start": 4059.4,
        "end": 4071.44
    },
    {
        "text": " el terreno de gheres goring la parte 1 me dice que si yo considero los círculos de gheres goring",
        "start": 4074.1600000000003,
        "end": 4079.96
    },
    {
        "text": " asociados a estas matriz en la a, a su epsilón todas las raíces en el epsilón están en la",
        "start": 4079.96,
        "end": 4085.28
    },
    {
        "text": " unión de esos círculos entonces por el teorema de gheres goring parte 1 se cumple que cada una de",
        "start": 4085.28,
        "end": 4098.76
    },
    {
        "text": " las raíces lambda y de epsilón para cada epsilón fijo está en los círculos de gheres goring",
        "start": 4098.76,
        "end": 4105.52
    },
    {
        "text": " que construyo con las matrices a su epsilón",
        "start": 4109.4800000000005,
        "end": 4112.400000000001
    },
    {
        "text": " y esto vale para todo el epsilón obviamente en 0 1 eso es el resultado 1 de gheres goring y además",
        "start": 4115.28,
        "end": 4124.0
    },
    {
        "text": " hay otra cosa fíjense",
        "start": 4124.0,
        "end": 4132.96
    },
    {
        "text": " por esta transición al siguiente comentario los círculos de gheres goring yo los construyo sumando",
        "start": 4138.5599999999995,
        "end": 4144.12
    },
    {
        "text": " los elementos que están fuera de la diagonal en modulo entonces los elementos que están fuera de",
        "start": 4144.12,
        "end": 4148.48
    },
    {
        "text": " diagonal son los que corresponden a epsilón por e o sea son los que corresponden a estos multiplicados",
        "start": 4148.48,
        "end": 4155.8
    },
    {
        "text": " por epsilón o sea fíjense que el radio va creciendo con epsilón el radio lo círculo va desde",
        "start": 4155.8,
        "end": 4162.48
    },
    {
        "text": " epsilón igual a 0 que es un punto que corresponde con el centro hasta los círculos finales de gheres goring",
        "start": 4162.48,
        "end": 4169.12
    },
    {
        "text": " esas son funciones con ti crecientes con epsilón estoy poniendo para cada epsilón acá entonces el",
        "start": 4169.24,
        "end": 4174.76
    },
    {
        "text": " radio se multiplica por epsilón entonces el círculo de gheres goring correspondiente a la fila",
        "start": 4174.76,
        "end": 4183.0
    },
    {
        "text": " j para cualquier valor de epsilón está contenido dentro del círculo de gheres goring correspondiente",
        "start": 4183.0,
        "end": 4191.36
    },
    {
        "text": " a la fila j cuando epsilón vale 1 porque los círculos eso se van conteniendo unos en otros todos",
        "start": 4191.36,
        "end": 4196.44
    },
    {
        "text": " tienen este centro que no cambia y todos tienen los radios que van cambiando con epsilón y los",
        "start": 4196.44,
        "end": 4204.36
    },
    {
        "text": " centros siguen siendo los mismos los elementos le llegó a la que no los toco entonces este los",
        "start": 4204.36,
        "end": 4213.679999999999
    },
    {
        "text": " círculos de gheres goring cuando epsilón vale 1 son los círculos de gheres goring de la matriz",
        "start": 4213.679999999999,
        "end": 4218.32
    },
    {
        "text": " original le llamamos el j los la matriz este que estábamos considerando entonces con esto lo que",
        "start": 4218.32,
        "end": 4227.4
    },
    {
        "text": " sacamos para cada epsilón los valores propios lambda epsilón están contenidos en la unión de estos",
        "start": 4227.4,
        "end": 4235.92
    },
    {
        "text": " círculos se subjota epsilón pero cada uno esto se subjota epsilón está contenido dentro",
        "start": 4235.92,
        "end": 4241.0
    },
    {
        "text": " el círculo final se subjota o sea que lo que estamos viendo es que lambda epsilón está siempre",
        "start": 4241.0,
        "end": 4248.2
    },
    {
        "text": " en la unión de todos los círculos de gheres goring con gotiguales de unos taines o sea",
        "start": 4249.16,
        "end": 4253.96
    },
    {
        "text": " estos valores propios que depende de manera continua de epsilón que corresponden a la familia de",
        "start": 4254.76,
        "end": 4259.96
    },
    {
        "text": " matriz en su epsilón están todos dentro de los círculos de gheres goring correspondiente de la",
        "start": 4259.96,
        "end": 4264.32
    },
    {
        "text": " matriz a la matriz original y la prueba termina con un dibujito",
        "start": 4264.32,
        "end": 4274.599999999999
    },
    {
        "text": " es muy ingeniosa, a este poco termina de cerrar el sultado van a ver que realmente es muy ingenioso esto",
        "start": 4274.6,
        "end": 4281.4400000000005
    },
    {
        "text": " supongamos como recién como recién hemos en el unciado que la unión de los círculos",
        "start": 4284.4400000000005,
        "end": 4291.72
    },
    {
        "text": " se iúno se i dos hasta se iéne se iéme perdón se adijunte el resto",
        "start": 4291.72,
        "end": 4298.84
    },
    {
        "text": " el resto lo círculo, a ese resto lo círculo lo vamos a notar",
        "start": 4307.84,
        "end": 4311.08
    },
    {
        "text": " ese conjunto lo vamos a notar en o sea hacemos un dibujito yo tengo",
        "start": 4312.72,
        "end": 4318.400000000001
    },
    {
        "text": " por ejemplo tres círculos que se intersecan y esos círculos están separados del resto que",
        "start": 4322.68,
        "end": 4333.08
    },
    {
        "text": " estarán por acá digamos entonces yo estoy considerado por un lado",
        "start": 4333.08,
        "end": 4339.56
    },
    {
        "text": " esta unión de tres círculos que se intersecan que le llamo M y por el otro lado todo el resto",
        "start": 4341.16,
        "end": 4346.68
    },
    {
        "text": " que le llamo M, todo el resto del de los círculos",
        "start": 4347.16,
        "end": 4350.52
    },
    {
        "text": " entonces fíjense cuando epsilon vale cero la matriz a su pcero es la matriz diagonal",
        "start": 4353.240000000001,
        "end": 4361.96
    },
    {
        "text": " entonces todos los valores propios justamente corresponden con los elementos de diagonal y los",
        "start": 4363.0,
        "end": 4367.76
    },
    {
        "text": " elementos de diagonal no son otras cosas que los centros los círculos de gheres goringo o sea que",
        "start": 4367.76,
        "end": 4371.92
    },
    {
        "text": " cuando epsilon igual a cero tenemos acá tantas raíces como círculos tenemos o sea acá tenemos",
        "start": 4372.92,
        "end": 4382.92
    },
    {
        "text": " si es a un unión de M círculos chicos acá tenemos M raíces cuando epsilon vale cero",
        "start": 4382.92,
        "end": 4390.8
    },
    {
        "text": " y acá tenemos el resto no N menos M raíces",
        "start": 4393.08,
        "end": 4399.2
    },
    {
        "text": " cuando epsilon vale cero",
        "start": 4402.76,
        "end": 4405.16
    },
    {
        "text": " justamente esas raíces son los centros de los círculos bien entonces pensemos en este dibujito",
        "start": 4409.64,
        "end": 4417.4400000000005
    },
    {
        "text": " tengo tres círculos de gheres goringo acá y tengo separados de estos entonces acá dentro cuando",
        "start": 4418.4400000000005,
        "end": 4423.88
    },
    {
        "text": " epsilon vale cero tengo tres raíces una de este centro tres centros y tres de nuestro y acá tengo",
        "start": 4423.88,
        "end": 4429.56
    },
    {
        "text": " el resto y ahora lo que voy haciendo es a medida que voy aumentando epsilon hasta llegar finalmente",
        "start": 4429.56,
        "end": 4436.080000000001
    },
    {
        "text": " con los círculos igual a 1 la matriz original estos valores propios van a ir cambiando de manera",
        "start": 4436.080000000001,
        "end": 4441.200000000001
    },
    {
        "text": " continua sí pero siempre van a estar adentro de la unión de estos círculos o no dice el",
        "start": 4441.200000000001,
        "end": 4447.280000000001
    },
    {
        "text": " teorema de gheres goringo uno entonces tengo funciones continuas que van se van moviendo acá",
        "start": 4447.280000000001,
        "end": 4454.56
    },
    {
        "text": " estos valores propios se van a ir moviendo acá de manera continua igual que estos",
        "start": 4454.56,
        "end": 4458.68
    },
    {
        "text": " pero siempre van a estar dentro de la de la de la unión de los círculos ahora pregunta",
        "start": 4461.8,
        "end": 4466.64
    },
    {
        "text": " puede unos valores propios saltar de acá hasta acá es decir puede tener de pasar de tener",
        "start": 4466.64,
        "end": 4473.4800000000005
    },
    {
        "text": " tres valores propios acá tener dos acá y esto y que se pase para allá no porque por continuidad",
        "start": 4473.4800000000005,
        "end": 4481.4400000000005
    },
    {
        "text": " porque como los grandes son continuos en epsilon no puedo tener un cambio desde acá para esta otra",
        "start": 4481.44,
        "end": 4489.16
    },
    {
        "text": " región porque eso significaría pasar por una zona donde no hay valores propios y yo sé que para",
        "start": 4489.16,
        "end": 4495.48
    },
    {
        "text": " todo epsilon los valores propios están contenidos en la unión de los círculos de gheres goringo se",
        "start": 4495.48,
        "end": 4502.879999999999
    },
    {
        "text": " entendió entonces por continuidad si acá tengo m círculos y en con m grandes círculos pero en",
        "start": 4502.879999999999,
        "end": 4510.28
    },
    {
        "text": " mi chico círculos en consecuencia m raíces cuando el epsilon vale cero voy a tener siempre m raíces",
        "start": 4510.28,
        "end": 4516.84
    },
    {
        "text": " acá no voy a tener cambios acá para allá eso significa que al final cuando el epsilon vale uno y",
        "start": 4516.84,
        "end": 4523.8
    },
    {
        "text": " tengo la matriz a original voy a tener tres raíces acá m raíces en general y el resto acá se",
        "start": 4523.8,
        "end": 4533.0
    },
    {
        "text": " entendió o sea terminamos probando la parte 2 o es decir por continuidad por continuidad de los",
        "start": 4533.0,
        "end": 4549.86
    },
    {
        "text": " landaí por continuidad los landaí en m en esa unión hay m valores propios",
        "start": 4549.86,
        "end": 4569.9
    },
    {
        "text": " repito acá cuando el epsilon vale cero los valores propios coinciden con los con los centros los",
        "start": 4580.86,
        "end": 4587.86
    },
    {
        "text": " círculos y a mí que lo camiendo el epsilon los voy deformando a esos valores propios pero nunca me",
        "start": 4587.86,
        "end": 4592.42
    },
    {
        "text": " puedo pasar de esta región a una región disjuntas que están otro lado porque las funciones",
        "start": 4592.42,
        "end": 4596.98
    },
    {
        "text": " vary en de manera continua y no puedo tener para pasar acá para allá de ser realmente lo que",
        "start": 4596.98,
        "end": 4601.38
    },
    {
        "text": " pasa por el medio y acá no hay valores propios para ningún epsilon un comentario más y",
        "start": 4601.38,
        "end": 4608.7
    },
    {
        "text": " se determinamos un comentario más y terminamos si yo tengo una matriz real tres por tres",
        "start": 4608.7,
        "end": 4616.3
    },
    {
        "text": " ahora con coeficientes reales",
        "start": 4616.3,
        "end": 4623.7
    },
    {
        "text": " si significa que como son todas las reales los círculos están centrados en el en el eje en la",
        "start": 4629.22,
        "end": 4637.26
    },
    {
        "text": " parte imaginaria cero entonces supongamos que los círculos de el góner son disjuntos 2 agodis",
        "start": 4637.26,
        "end": 4642.78
    },
    {
        "text": " juntos es decir tengo en el plano complejo tengo tres círculos que están centrados en la",
        "start": 4642.78,
        "end": 4660.66
    },
    {
        "text": " parte real en el en el eje real lo que tiene parte imaginaria cero y será una cosa como esta",
        "start": 4660.66,
        "end": 4668.58
    },
    {
        "text": " bien el teorema del góner me dice que acá hay una raíz acá hay una raíz y acá hay una raíz",
        "start": 4669.58,
        "end": 4677.58
    },
    {
        "text": " ahora bien como le decía al principio esa raíz podría ser tener parte imaginaria en principio",
        "start": 4677.58,
        "end": 4684.46
    },
    {
        "text": " no nula y no sea real ahora se puede ver que si algo es una si yo tengo estoy trabajando con",
        "start": 4684.46,
        "end": 4692.14
    },
    {
        "text": " los reales y el problema característico tiene coeficientes reales es fácil ver que si",
        "start": 4692.14,
        "end": 4696.58
    },
    {
        "text": " una raíz es solución entonces su complejo conjugado también es solución de manera que si",
        "start": 4696.58,
        "end": 4702.94
    },
    {
        "text": " esto es solución si tuviera una solución acá el complejo conjugado que está acá abajo también",
        "start": 4702.94,
        "end": 4706.7
    },
    {
        "text": " sería solución y es una contradicción porque acá necesariamente tengo que tener una única",
        "start": 4706.7,
        "end": 4711.5
    },
    {
        "text": " raíz entonces eso es una contradicción para donde si la parte imaginaria es distinto de cero",
        "start": 4711.5,
        "end": 4717.3
    },
    {
        "text": " por lo tanto la única forma de tener con coeficientes reales una raíz acá una raíz acá hay una",
        "start": 4717.3,
        "end": 4723.3
    },
    {
        "text": " raíz acá es que esas raíces sean reales que tengan parte imaginaria nula porque si fuera",
        "start": 4723.3,
        "end": 4729.02
    },
    {
        "text": " repito no nula el complejo conjugado también sería raíz entonces en ese caso se concluye también",
        "start": 4729.02,
        "end": 4736.54
    },
    {
        "text": " que si los círculos es góneres son disjuntos tengo n raíz es que son reales por lo tanto son",
        "start": 4736.54,
        "end": 4743.26
    },
    {
        "text": " valores propios en raíz distinta y por lo tanto n valores propios distinto y por lo tanto t",
        "start": 4743.26,
        "end": 4748.66
    },
    {
        "text": " es diabilizar estamos con eso terminamos gars goring las semanas que vienen a rancar pero",
        "start": 4748.66,
        "end": 4755.0199999999995
    },
    {
        "text": " no jueves arrancamos con forma de llorna",
        "start": 4755.0199999999995,
        "end": 4759.22
    }
]