[
    {
        "text": " ¿Pero es un en el matriz de materiales y el matriz de cooperación?",
        "start": 0.0,
        "end": 6.0
    },
    {
        "text": " Sí, por la metrisa de cooperación, tomar este...",
        "start": 6.0,
        "end": 12.0
    },
    {
        "text": " ¿Para la metrisa de cooperación?",
        "start": 12.0,
        "end": 15.0
    },
    {
        "text": " Bueno, por eso, dijiste, matrisa en los reales, pero no dijiste que...",
        "start": 15.0,
        "end": 19.0
    },
    {
        "text": " No dijiste como en el documento de la metrisa.",
        "start": 19.0,
        "end": 23.0
    },
    {
        "text": " ¿Todo es una metrisa?",
        "start": 23.0,
        "end": 24.0
    },
    {
        "text": " Ah, es una en el matriz de cooperación.",
        "start": 24.0,
        "end": 27.0
    },
    {
        "text": " Ah, entonces en el matriz.",
        "start": 27.0,
        "end": 30.0
    },
    {
        "text": " Menos para el aceluto en fuera de la deona.",
        "start": 36.0,
        "end": 39.0
    },
    {
        "text": " ¿Dónde es el aceluto de la deona?",
        "start": 39.0,
        "end": 41.0
    },
    {
        "text": " Sí.",
        "start": 41.0,
        "end": 42.0
    },
    {
        "text": " Sí.",
        "start": 50.0,
        "end": 51.0
    },
    {
        "text": " Bueno, muy bien.",
        "start": 57.0,
        "end": 59.0
    },
    {
        "text": " Y, este...",
        "start": 59.0,
        "end": 61.0
    },
    {
        "text": " Se aclaró ahí, entonces.",
        "start": 61.0,
        "end": 63.0
    },
    {
        "text": " Estoy de acuerdo.",
        "start": 63.0,
        "end": 65.0
    },
    {
        "text": " Que la matriz de comparación, en el caso que hiciste una metrisa,",
        "start": 65.0,
        "end": 67.0
    },
    {
        "text": " que hiciste reales, él a mí.",
        "start": 67.0,
        "end": 69.0
    },
    {
        "text": " ¿Para ni mejor o cuál es?",
        "start": 69.0,
        "end": 73.0
    },
    {
        "text": " ¿Para ni mejor o cuál es?",
        "start": 73.0,
        "end": 75.0
    },
    {
        "text": " ¿Pierras de la metrisa de cooperación?",
        "start": 75.0,
        "end": 77.0
    },
    {
        "text": " ¿Pero qué es el aceluto de cooperación?",
        "start": 77.0,
        "end": 80.0
    },
    {
        "text": " ¿Pierras de cooperación?",
        "start": 80.0,
        "end": 82.0
    },
    {
        "text": " ¿Pierras de cooperación?",
        "start": 82.0,
        "end": 84.0
    },
    {
        "text": " No, pero... ¿Cuál es el tercer terreno?",
        "start": 85.0,
        "end": 88.0
    },
    {
        "text": " Bueno.",
        "start": 98.0,
        "end": 100.0
    },
    {
        "text": " ¿Para para para?",
        "start": 100.0,
        "end": 102.0
    },
    {
        "text": " Se me adapto y arranco por prática y que va a ser el primer teórico.",
        "start": 102.0,
        "end": 105.0
    },
    {
        "text": " Pero práctica, hacemos primero práctica y pues teórico.",
        "start": 105.0,
        "end": 107.0
    },
    {
        "text": " No, pero...",
        "start": 107.0,
        "end": 109.0
    },
    {
        "text": " Sí, lo puse en el Eva, puse que iba a ser 45 minutos de teórico",
        "start": 109.0,
        "end": 113.0
    },
    {
        "text": " y 45 minutos de práctica porque es un nuevo práctico.",
        "start": 113.0,
        "end": 116.0
    },
    {
        "text": " Y porque además, con 45 minutos se supone que termino el teórico de Leon Tief.",
        "start": 116.0,
        "end": 122.0
    },
    {
        "text": " Entonces, no quería empezar otra de manuevo.",
        "start": 122.0,
        "end": 125.0
    },
    {
        "text": " ¿No vas a dar eso?",
        "start": 125.0,
        "end": 127.0
    },
    {
        "text": " Sí.",
        "start": 127.0,
        "end": 129.0
    },
    {
        "text": " ¿Estás con prática o qué va a ser por este?",
        "start": 129.0,
        "end": 131.0
    },
    {
        "text": " ¿Más terminado?",
        "start": 131.0,
        "end": 133.0
    },
    {
        "text": " No, va a que agravar los dos, porque de la parte de práctica que preparé",
        "start": 133.0,
        "end": 137.0
    },
    {
        "text": " tiene que ver justo con el ejercicio, así solamente sí, es que es el teorema que vamos a dar.",
        "start": 137.0,
        "end": 146.0
    },
    {
        "text": " Hay un ejercicio que deja que trata ese tema, ¿no?",
        "start": 146.0,
        "end": 151.0
    },
    {
        "text": " Probar que la afirmación hay y la afirmación es, son equivalentes.",
        "start": 151.0,
        "end": 156.0
    },
    {
        "text": " Está escrito en el práctico a más puse la letra, ¿cuál era la? ¿Cuál era el l?",
        "start": 156.0,
        "end": 161.0
    },
    {
        "text": " Y entonces, ¿y justo el teorema que va a malar?",
        "start": 161.0,
        "end": 164.0
    },
    {
        "text": " Entonces, se arraba todo el teórico y práctico, pero a mismo tiempo tenía todo que ver en lo mío.",
        "start": 164.0,
        "end": 172.0
    },
    {
        "text": " Hagamos así, empecemos con teórico, en hecho, así me aseguro de terminar y después nos vamos a práctico, ¿sí?",
        "start": 172.0,
        "end": 179.0
    },
    {
        "text": " Es, nos queda un solunto y el tema.",
        "start": 179.0,
        "end": 183.0
    },
    {
        "text": " Última clase de Leon Tief para el odio Penfing.",
        "start": 183.0,
        "end": 187.0
    },
    {
        "text": " Si la anterior se llama Última clase de Leon Tief, te se llevará, se amará Última Última.",
        "start": 187.0,
        "end": 193.0
    },
    {
        "text": " ¿Cómo dice a los niños? ¿Y la Última Última?",
        "start": 194.0,
        "end": 198.0
    },
    {
        "text": " Bueno, Última teorema.",
        "start": 198.0,
        "end": 201.0
    },
    {
        "text": " En la clase pasada, vimos el teorema, este que me llevó un montón de tiempo,",
        "start": 201.0,
        "end": 208.0
    },
    {
        "text": " que mostraba que una más de 3 cuadrada tiene diagonal dominante,",
        "start": 208.0,
        "end": 213.0
    },
    {
        "text": " si solamente sí, su matriz de comparación, ¿V? Es una de mi matriz.",
        "start": 213.0,
        "end": 217.0
    },
    {
        "text": " Me llevó un montón, la demostración es muy bonita, pero me llevó un montón.",
        "start": 217.0,
        "end": 221.0
    },
    {
        "text": " Quiere teorema que es el último modelo de Leon Tief,",
        "start": 222.0,
        "end": 226.0
    },
    {
        "text": " es de matemática, esto es un poco recoger la matemática buena",
        "start": 226.0,
        "end": 230.0
    },
    {
        "text": " que se produjo a partir del concepto de mi matriz, que se produjo a partir de el modelo de Leon Tief.",
        "start": 230.0,
        "end": 237.0
    },
    {
        "text": " Y tomo 30 segundos la matemática,",
        "start": 237.0,
        "end": 241.0
    },
    {
        "text": " si muchas veces recoges de otras ciencias, ideas y desarrollas ideas",
        "start": 241.0,
        "end": 245.0
    },
    {
        "text": " que vayas a saber si se van utilizando, ¿no?",
        "start": 245.0,
        "end": 248.0
    },
    {
        "text": " Y a revés también, la matemática sigue desarrollando ideas",
        "start": 248.0,
        "end": 251.0
    },
    {
        "text": " y después viene otra ciencia y las toma como ejemplo en física un montón.",
        "start": 251.0,
        "end": 256.0
    },
    {
        "text": " Entonces, es un ídio y vuelta continuo entre lo que es matemática,",
        "start": 256.0,
        "end": 260.0
    },
    {
        "text": " lo que se llama pura y lo que se llama matemática aplicada.",
        "start": 260.0,
        "end": 264.0
    },
    {
        "text": " Y además, en ese ídio y vuelta continuo, nunca se sabe cuál es la matemática pura que se va a usar.",
        "start": 264.0,
        "end": 270.0
    },
    {
        "text": " Ejemplo criptografía, toda el desarrollo que se hizo teorea en números,",
        "start": 270.0,
        "end": 274.0
    },
    {
        "text": " parecía hasta un juego inútil durante...",
        "start": 274.0,
        "end": 277.0
    },
    {
        "text": " ...ciindlos, especialmente en los 1900, en los 1800, 1900.",
        "start": 277.0,
        "end": 283.0
    },
    {
        "text": " Parecía un juego inútil de matemáticos y terminó siendo la base de una viajomputación.",
        "start": 283.0,
        "end": 289.0
    },
    {
        "text": " Por todo el que no me imaginará, que era la base de toda la seguridad internoe por hoy.",
        "start": 289.0,
        "end": 296.0
    },
    {
        "text": " Entonces, cuando escuchamos los...",
        "start": 296.0,
        "end": 300.0
    },
    {
        "text": " ...porque para desarrollar la ciencia hay que hacer política científica y política académica",
        "start": 300.0,
        "end": 305.0
    },
    {
        "text": " y muchas veces nos venden que hay que hacer lo que se produce, o hay que trabajar,",
        "start": 305.0,
        "end": 310.0
    },
    {
        "text": " lo que realmente tiene aplicación.",
        "start": 310.0,
        "end": 313.0
    },
    {
        "text": " Y lo han dicho tanto el gobierno actual como el gobierno anterior.",
        "start": 313.0,
        "end": 317.0
    },
    {
        "text": " O sea, lo he escuchado de candidato de primera línea del gobierno actual como candidato",
        "start": 317.0,
        "end": 322.0
    },
    {
        "text": " en vicepresidente del gobierno anterior. Un disparate.",
        "start": 322.0,
        "end": 326.0
    },
    {
        "text": " Es un disparate, es la incomprensión total de lo que es la ciencia.",
        "start": 326.0,
        "end": 330.0
    },
    {
        "text": " La ciencia es justamente que jala desarrollarse por sí misma y hay que apoyar tanto de trabajo puro",
        "start": 331.0,
        "end": 337.0
    },
    {
        "text": " o matemática fundamental, mejor dicho en más que matemática aplicada,",
        "start": 337.0,
        "end": 341.0
    },
    {
        "text": " más que matemática teórica y la matemática aplicada también, o la ciencia pure y la ciencia aplicada.",
        "start": 341.0,
        "end": 347.0
    },
    {
        "text": " Ese juego constante y de vuelta es el que en su libre trabajo es el que da mejor resultado.",
        "start": 347.0,
        "end": 356.0
    },
    {
        "text": " Bueno, dicho esto...",
        "start": 356.0,
        "end": 360.0
    },
    {
        "text": " Nos vamos al último tele.",
        "start": 363.0,
        "end": 366.0
    },
    {
        "text": " O sea, ¿Ve una matriz de las que son típicas las que aparecen las de las formas que tienen las de matriz de comparación?",
        "start": 366.0,
        "end": 378.0
    },
    {
        "text": " Con, B, B, y, mayor igual que 0 y B, y J, en or igual que 0 si es distinto.",
        "start": 379.0,
        "end": 388.0
    },
    {
        "text": " Es el modelo al cual hemos llegado en este avance, en este desarrollo de los conceptos de matemática.",
        "start": 390.0,
        "end": 400.0
    },
    {
        "text": " Yo voy a poner muchas cosas que son equivalentes para cerrar esta parte del leontif, algunas se las probamos,",
        "start": 401.0,
        "end": 408.0
    },
    {
        "text": " pero va a ir la pena el resumen final.",
        "start": 408.0,
        "end": 412.0
    },
    {
        "text": " Son cinco afirmaciones que son equivalentes.",
        "start": 412.0,
        "end": 415.0
    },
    {
        "text": " Primero, B es una M matriz.",
        "start": 415.0,
        "end": 420.0
    },
    {
        "text": " Lo definimos y lo repasamos en la clase pasada, el concepto de matriz.",
        "start": 420.0,
        "end": 426.0
    },
    {
        "text": " Segundo, B tiene diagonal dominante.",
        "start": 427.0,
        "end": 431.0
    },
    {
        "text": " Otro concepto que hemos desarrollado en esta parte del curso, y que hemos repasado en la clase.",
        "start": 432.0,
        "end": 441.0
    },
    {
        "text": " Tercero, este teonema lo recordarán fue fundamental, es el que se acerca, el que nos propone en la de la leontif,",
        "start": 441.0,
        "end": 449.0
    },
    {
        "text": " que nos lleva a ser tu en la matemática para desarrollarla para todo el vector que podemos pensar",
        "start": 450.0,
        "end": 456.0
    },
    {
        "text": " a este al vector de demanda, para todo el vector de demanda, no me acuerdo si es el I de demanda o el de la ganancia.",
        "start": 456.0,
        "end": 465.0
    },
    {
        "text": " Existe un único vector X, mayor igual que 0, tal que B por X es igual ahí.",
        "start": 467.0,
        "end": 474.0
    },
    {
        "text": " El modelo este fue el que nos presentó leontif, esta pregunta, y bueno, la respuesta fue afirmativa.",
        "start": 475.0,
        "end": 483.0
    },
    {
        "text": " De la matriz B es de la forma esta nueva,",
        "start": 483.0,
        "end": 492.0
    },
    {
        "text": " S, S por I, menos C, con C mayor igual que 0, recuérden cuando pongo un vector mayor igual que 0,",
        "start": 493.0,
        "end": 505.0
    },
    {
        "text": " una matriz mayor igual que 0, quiere decir que todas sus coordenadas se mayor igual que 0,",
        "start": 505.0,
        "end": 510.0
    },
    {
        "text": " y además S, este S que está multiplicando la identidad mayor que el radio espectral de C.",
        "start": 510.0,
        "end": 518.0
    },
    {
        "text": " Y la E y última de estas secuencias de equivalencias es que la parte real de todo valor propio,",
        "start": 519.0,
        "end": 532.0
    },
    {
        "text": " B es positivo.",
        "start": 532.0,
        "end": 539.0
    },
    {
        "text": " ¿Rom, ¿el curo? La D y la E son nuevas, son las firmaciones nuevas,",
        "start": 551.0,
        "end": 556.0
    },
    {
        "text": " que terminan siendo equivalentes a las tres anteriores que la veníamos desarrollando.",
        "start": 557.0,
        "end": 561.0
    },
    {
        "text": " La E es nueva, pero tiene que ver con un coloelario, el coloelario 1 y 3 que trabajamos antes.",
        "start": 561.0,
        "end": 567.0
    },
    {
        "text": " Entonces, vamos a la demostración, hay muchas cosas ya hechas.",
        "start": 567.0,
        "end": 574.0
    },
    {
        "text": " Entonces, la demostración, primero que nada,",
        "start": 575.0,
        "end": 581.0
    },
    {
        "text": " si solamente C, B, saludimos, ya está demostrado, ¿por qué digo ya ha demostrado? ¿Por qué bueno?",
        "start": 581.0,
        "end": 588.0
    },
    {
        "text": " Creo que mostramos en la clase pasada es que si A tiene diagonal dominante, su matriz de comparación y su NM matriz, ¿accuerdad?",
        "start": 589.0,
        "end": 612.0
    },
    {
        "text": " Pero que A tiene diagonal dominante, si solamente sí su matriz de comparación tiene diagonal dominante, ya lo vimos también.",
        "start": 613.0,
        "end": 619.0
    },
    {
        "text": " O sea que esas dos ya están, si solamente si ve, con el que hemos loco acá también, para que se vea.",
        "start": 619.0,
        "end": 626.0
    },
    {
        "text": " Otro que ya hicimos es B, si solamente si C,",
        "start": 628.0,
        "end": 631.0
    },
    {
        "text": " es el hicimos la semana pasada, no la otra que le decía, ya he demostrado.",
        "start": 632.0,
        "end": 643.0
    },
    {
        "text": " Aquí hay un detalle y es el detalle que ya les mencioné la clase pasada y lo mejor para no perder tiempo ahora es que le subo el pequeño cambio de demostración que hay que hacer.",
        "start": 643.0,
        "end": 660.0
    },
    {
        "text": " ¿Cuál es el detalle? Lo vuelvo a observar hoy. Cuando probamos esto, este resultado es B, si solamente si C, las condiciones aquí eran mayor que C,",
        "start": 660.0,
        "end": 678.0
    },
    {
        "text": " o sea, tienes un hipótesis un poquito más exigente para B, si solamente si C, ¿ok?",
        "start": 678.0,
        "end": 684.0
    },
    {
        "text": " Lo que hice es reice un pedacito de la demostración que hicimos en aquel entonces, mostrando que con mayor igual que C, también vale.",
        "start": 685.0,
        "end": 696.0
    },
    {
        "text": " Eso se las voy a subir a internet, pero además, después de resultar todas estas equivalencias, resulta que los veis subir,",
        "start": 696.0,
        "end": 704.0
    },
    {
        "text": " y en realidad van a ser mayor que C, pero después de probar las equivalencias, entonces estaría siendo trampas y que no, esto va a ser mayor que C, primero probarlo.",
        "start": 704.0,
        "end": 713.0
    },
    {
        "text": " Pero entonces, yo lo que hice es un cambio de una cuentita ahí, y las voy a ponerle poco las fotos y les marco exactamente, ¿por qué con mayor igual que C, también vale aquella demostración que le habíamos puesto mayor que C,",
        "start": 713.0,
        "end": 728.0
    },
    {
        "text": " era un poquito más exigente del hipótesis. Y la habíamos usado en el que momento el mayor que C, pero yo la cambié un poquito la demostración y no es necesario, ¿ok?",
        "start": 728.0,
        "end": 737.0
    },
    {
        "text": " El libro de esa observación no le hace, es uno de los tantos detalles que tiene el libro, acá ponía C y dice, remitase a la otra demostración y se olvidó que en aquella demostración había exigido mayor que C.",
        "start": 737.0,
        "end": 750.0
    },
    {
        "text": " Muy bien, C implica D, eso lo que vamos a hacer ahora, aquí ya tenemos conectado estos dos y estos dos. Claro, las primeras semanas, la primera semana y media de el concepto de este o dos semanas del D on Tiff, el concepto central era diagonal dominante, después apareció lo de Mehmetris, pero este pivotío con este y este pivotío con este, entonces por eso las equivalencias acá.",
        "start": 751.0,
        "end": 779.0
    },
    {
        "text": " Ahora vamos a hacer este, C implica D y después recordales, este lo que vamos a hacer ahora, les pongo en rojo lo que quedó para práctico,",
        "start": 779.0,
        "end": 801.0
    },
    {
        "text": " o en rojo o en narajita mejor, esto está en práctico, así solucía, ok, te quedan un acuerdo del ejercicio y el último se los dejo en azul, que no vamos a hacer hoy, el que vamos a hacer ahora es el C implica D, este quedó en práctico y para cerrar el circuito necesitamos, por ejemplo, de implica C.",
        "start": 802.0,
        "end": 830.0
    },
    {
        "text": " Ahí se arramos el circuito, ¿cierto? Este queda post el teorema de perronfrobényo, y eso viene mucho después, o sea para implica C en necesitamos perronfrobényo, ese es el famoso teorema que se usa para las page rank y todo eso, eso no lo tiene más famoso de aplicaciones que venden.",
        "start": 831.0,
        "end": 856.0
    },
    {
        "text": " Y ahí se arrozircúit, ¿cierto? Entonces ahora vamos a probar C implica D y después corto esto, no metemos en práctico, discutimos lo que quieran discutir, pero en particular a mi me gustaría discutir en naranja, pero ahí trabajan ustedes.",
        "start": 857.0,
        "end": 874.0
    },
    {
        "text": " Sí. ¿No mantiene esta vez que se ha desviado el circuito en el circuito? Creo que sí, porque decir que es invertible, ¿jabrét?",
        "start": 874.0,
        "end": 888.0
    },
    {
        "text": " ¿A ver, ¿no se deshe? ¿Qué es el circuito? ¿Qué es el circuito en el circuito en el circuito para todo el índice, para todo una solición?",
        "start": 888.0,
        "end": 897.0
    },
    {
        "text": " Pero, acordarte que C no dice eso, C dice mucho más que eso, que para todo y mayor igual que C es, existe y es única la solución y la parte más dura, más difícil, es que la solución es mayor igual que C.",
        "start": 897.0,
        "end": 914.0
    },
    {
        "text": " Es fundamental, ¿eh? Es mal, Nacho lo preguntó, ¿en quién fue el que lo preguntó en ese momento en clase?",
        "start": 914.0,
        "end": 920.0
    },
    {
        "text": " Claro. ¿Y esa es positiva? Y ese es el punto clado, existe una solución porque es invertible, pero lo clave es que esa solución es mayor igual que Cero.",
        "start": 920.0,
        "end": 932.0
    },
    {
        "text": " Y por eso tiene toda la interpretación económica y resulta que es una que resuelve realmente el problema económica o que la más temática termina ayudando realmente a la economía.",
        "start": 932.0,
        "end": 941.0
    },
    {
        "text": " Porque si no fuera mayor igual que Cero, la solución matemática no tenía ninguna interpretación económica.",
        "start": 942.0,
        "end": 948.0
    },
    {
        "text": " Bueno, muy bien, vamos así y se implica de que es una línea de mostración. C, la hipotec y C está acá, pero como ya probamos, puedo usar cualquiera de las 3. A, B o C, están ya están, son equivalentes a las 3.",
        "start": 948.0,
        "end": 965.0
    },
    {
        "text": " Entonces, de hecho, yo salgo de C y voy a usar que en realidad B está matriz, tiene diagonal de 20.",
        "start": 966.0,
        "end": 973.0
    },
    {
        "text": " Entonces, B tiene diagonal de 20. Por lo tanto, existe un vector de dominación,",
        "start": 974.0,
        "end": 984.0
    },
    {
        "text": " más sure que Cero, un vector de dominación, coordenados de 1, de 2, de n, está un vector,",
        "start": 985.0,
        "end": 999.0
    },
    {
        "text": " tal que ¿qué es que sea de una alumina?",
        "start": 999.0,
        "end": 1003.0
    },
    {
        "text": " Tal que, de J por B J J, es mayor que menos la sumatoria con y distinto de J, de Dei por B J,",
        "start": 1004.0,
        "end": 1027.0
    },
    {
        "text": " ahora sí, que está expresión, pero acá lo ven, esto estoy escribiendo en la ecuación de diagonal dominante, recordando que los B sub y o los B subjotas J son mayores igual que Cero,",
        "start": 1028.0,
        "end": 1041.0
    },
    {
        "text": " o sea que cuando salen en normas está bien así, y que como los, acá me falta B subijot, te escuta, y como los B subijotas son menores igual que Cero,",
        "start": 1041.0,
        "end": 1053.0
    },
    {
        "text": " cuando salen en normas saben con menos, entonces que este termino, o sea, si quieren lo pasan para el otro lado,",
        "start": 1054.0,
        "end": 1065.0
    },
    {
        "text": " lo pongo del otro lado, primero, a ver si se, por las dudas, lo ven, esto, o sea, cuando lo pasamos para el otro lado,",
        "start": 1073.0,
        "end": 1079.0
    },
    {
        "text": " te queda de su J por B subjota más, los de su B por B subjota, esto, pero no necesito pasar para otro lado, así es la definición original,",
        "start": 1079.0,
        "end": 1100.0
    },
    {
        "text": " que este termino le gana a los otros, ahí está en la definición original, el formato original está, le está dando vuelta para dar lo vuelta a vuelta,",
        "start": 1101.0,
        "end": 1109.0
    },
    {
        "text": " que esto le gana a la suma de los otros en valor absoluto, pero recordando que lo veis subijotas a menos igual que Cero, está bien escrito esto en valor absoluto,",
        "start": 1114.0,
        "end": 1121.0
    },
    {
        "text": " ahora bien, estos términos que son en valor absoluto, esto es mayor igual que Cero, evidentemente, porque los de su B son mayores que es mayor que Cero, y los de su B subjota son menos igual que Cero, con el menos que es mayor igual que Cero,",
        "start": 1122.0,
        "end": 1136.0
    },
    {
        "text": " y acá un detallecito, si lo van a repasar en el libro, lo doto en fin también, acá el libro dice que es mayor que Cero, después se puede probar que es verdad,",
        "start": 1138.0,
        "end": 1149.0
    },
    {
        "text": " pero en principio no, y no se usan la demostración, que es mayor que Cero, entonces pongamos mayor igual que Cero, que es lo correcto, y la demostración sale igual,",
        "start": 1149.0,
        "end": 1159.0
    },
    {
        "text": " es un detallecito de lo tanto que quiero informar, que tiene el libro para aquellos que estudian usando el libro, bueno, ¿qué más les iba a decir al respecto? Bien, en particular de toda esta ecuación, una cosa, una consecuencia menor, pero que quiero sacarla ya,",
        "start": 1160.0,
        "end": 1178.0
    },
    {
        "text": " yo afirmo en particular, B subjota es mayor que Cero, porque esto es para todo jota desde uno hasta en, ¿cierto? Y esta conclusión también es para todo jota desde uno hasta en,",
        "start": 1178.0,
        "end": 1200.0
    },
    {
        "text": " o sea, la desigualdad, diagonal dominante, se da para todas las columnas, y en particular su jota jota mayor que Cero, lo ven que ve su jota mayor que Cero,",
        "start": 1201.0,
        "end": 1211.0
    },
    {
        "text": " porque si no fuera mayor que Cero, te quedaba Cero esta expresión, y Cero no puede ser mayor estricto que algo que es mayor igual que Cero,",
        "start": 1212.0,
        "end": 1220.0
    },
    {
        "text": " entonces en particular sale la conclusión que veníamos afirmando, que lo veis de jota son mayores que Cero, pero en la evolución de las pruebas quiero ser presisos y voy a poner en,",
        "start": 1221.0,
        "end": 1232.0
    },
    {
        "text": " en el Eva, la corrección, no en la corrección, porque la agencia de demostraciones correctas, pero para poder aplicar ahora esta nueva forma, la nueva demostración, la voy a poner en,",
        "start": 1232.0,
        "end": 1244.0
    },
    {
        "text": " bueno, muy bien, pero en particular sale que lo veis de jota son mayores que Cero, ¿sí?",
        "start": 1245.0,
        "end": 1249.0
    },
    {
        "text": " Sí, no, disculpa, me dices, yo no se le dije mal, me equivoque, corrigimos eso, en fin lo borra, acá no, yo me equivoque, lo que quise decir,",
        "start": 1262.0,
        "end": 1270.0
    },
    {
        "text": " mientras veré, es que estos son mayores que Cero, no, acá no tiene por qué ser, totalmente acuerdo, gracias a que, acá es mayor igual que Cero y no voy a poder demostrar que es mayor que Cero,",
        "start": 1271.0,
        "end": 1281.0
    },
    {
        "text": " gracias, y el libro está mal, ahí, a ver, puesto mayor que Cero, totalmente acuerdo, bueno, muy bien, entonces tenemos esto que no es nada hasta ahora, pero vamos aclarando la situación, y entonces lo que es este truco de considerar esta matriz de,",
        "start": 1281.0,
        "end": 1295.0
    },
    {
        "text": " que es la matriz diagonal, usando los coeficientes del vector de dominación, ya lo hemos hecho, si tomamos la matriz de y considero,",
        "start": 1296.0,
        "end": 1306.0
    },
    {
        "text": " si dieron, debe de la, de, consideramos, de, de la amenazuna, bueno, antes de seguir la demostración, juguemos un poquito con esta matriz,",
        "start": 1306.0,
        "end": 1330.0
    },
    {
        "text": " este, olvíate de la amenazuna, primero general, cuál es de la amenazuna?",
        "start": 1331.0,
        "end": 1338.0
    },
    {
        "text": " Perfecto, uno sobre de uno, uno sobre de dos, uno sobre de, muy bien, cuando olvíate de la amenazuna, si son multiplicos de por B, ese truco ya lo hicimos, ¿qué te da?",
        "start": 1339.0,
        "end": 1350.0
    },
    {
        "text": " Sí, todo la matriz por D, pero como lo ves?",
        "start": 1352.0,
        "end": 1355.0
    },
    {
        "text": " La fila por D, no lo hicimos.",
        "start": 1355.0,
        "end": 1356.0
    },
    {
        "text": " La fila por D, uno, la fila por D, dos, la fila última por D, ¿teno acuerdo? Vale, ahora olvíate de D,",
        "start": 1356.0,
        "end": 1367.0
    },
    {
        "text": " multiplicas B por D a la menos uno, no está, ¿la de? ¿Ven por D a la amenazuna? ¿qué lo que te da?",
        "start": 1368.0,
        "end": 1373.0
    },
    {
        "text": " Ahí va, la primera y el cual, uno sobre de uno, la segunda y el cual, uno sobre dos, ¿teno de acuerdo? Ahora multiplicamos todo.",
        "start": 1374.0,
        "end": 1381.0
    },
    {
        "text": " La diagonal que tiene.",
        "start": 1381.0,
        "end": 1382.0
    },
    {
        "text": " La diagonal que queda, la misma, y en el término ij, de I sobre de J por B, ¿de I sobre de J?",
        "start": 1382.0,
        "end": 1392.0
    },
    {
        "text": " De I sobre de, ahí va, perfecto, ya está, entonces estamos pronto para la demostración.",
        "start": 1393.0,
        "end": 1397.0
    },
    {
        "text": " Ese es el gran truco que hace digamos, después hay otro, pero ese está muy bueno ¿no?",
        "start": 1397.0,
        "end": 1401.0
    },
    {
        "text": " Entonces, considera E, porque tenemos que encontrar este D, ¿se vieron?",
        "start": 1402.0,
        "end": 1407.0
    },
    {
        "text": " Considera E, el máximo, este de los B sui,",
        "start": 1407.0,
        "end": 1417.0
    },
    {
        "text": " o ves su jota como, igual uno, dos, E.",
        "start": 1417.0,
        "end": 1426.0
    },
    {
        "text": " El término de la diagonal que son dos mayores que cero, toma el máximo.",
        "start": 1426.0,
        "end": 1433.0
    },
    {
        "text": " Y define, yo quiero encontrar que B se escribe esta manera, entonces tengo que encontrar E, E y C,",
        "start": 1436.0,
        "end": 1444.0
    },
    {
        "text": " E, E se se dije que en E, E se va a hacer E por I su N menos B.",
        "start": 1444.0,
        "end": 1450.0
    },
    {
        "text": " O sea, si yo digo que en E se me queda definido E y E, sólo que después tiene que probar todo esto, ¿no?",
        "start": 1451.0,
        "end": 1455.0
    },
    {
        "text": " O tiene que probar que C es la correcta.",
        "start": 1455.0,
        "end": 1458.0
    },
    {
        "text": " Entonces, considera E, este máximo, E se despeja de ahí, E por I su N menos E.",
        "start": 1458.0,
        "end": 1468.0
    },
    {
        "text": " Y ya estamos casi pronto, primero de esta, si tengo que probar que C es mayor igual que C, ¿no?",
        "start": 1469.0,
        "end": 1477.0
    },
    {
        "text": " Eso está, ¿no? A ver.",
        "start": 1477.0,
        "end": 1480.0
    },
    {
        "text": " Lo ve y lo ve, ojo, porque acá puse C igual E, E por I su N menos B.",
        "start": 1482.0,
        "end": 1487.0
    },
    {
        "text": " Sí, tengo que probar que C es mayor igual que C.",
        "start": 1487.0,
        "end": 1491.0
    },
    {
        "text": " ¿Por qué es la diagonal de mayor igual que C?",
        "start": 1491.0,
        "end": 1496.0
    },
    {
        "text": " Exacto.",
        "start": 1496.0,
        "end": 1498.0
    },
    {
        "text": " ¿Por qué? ¿Lo que fue tan fuera de la diagonal? ¿Por qué?",
        "start": 1498.0,
        "end": 1503.0
    },
    {
        "text": " Exacto, y lo que está fuera de la diagonal de un solo.",
        "start": 1503.0,
        "end": 1506.0
    },
    {
        "text": " Exacto, y lo que le multiplica por menos I, ¿no?",
        "start": 1506.0,
        "end": 1508.0
    },
    {
        "text": " ¿Qué queda mayor igual que C? Y en la diagonal lo que decía Facundo, ¿no?",
        "start": 1508.0,
        "end": 1511.0
    },
    {
        "text": " ¿Le resto los otros, a lo sumo te da C, ¿no?",
        "start": 1511.0,
        "end": 1517.0
    },
    {
        "text": " Tan acuerdo que este mayor le pongo a quitar el signo de pregunta, o sea que se ya está.",
        "start": 1518.0,
        "end": 1523.0
    },
    {
        "text": " Y los que nos queda solamente para cerrar la demostración es que el radio espetral de esta matriz es menor que ese máximo de los PSVG que es ese.",
        "start": 1523.0,
        "end": 1535.0
    },
    {
        "text": " Bueno, que todavía no usamos esto, ¿no?",
        "start": 1540.0,
        "end": 1542.0
    },
    {
        "text": " O sea que acá aparece el truquito de este.",
        "start": 1542.0,
        "end": 1544.0
    },
    {
        "text": " Entonces, calculamos Rdc, Rdc, Rdc y su N menos B.",
        "start": 1544.0,
        "end": 1562.0
    },
    {
        "text": " ¿Te gusta?",
        "start": 1575.0,
        "end": 1577.0
    },
    {
        "text": " Sí.",
        "start": 1577.0,
        "end": 1578.0
    },
    {
        "text": " ¿Vaya a infectar el radar que la tuque es máximo de la tuque?",
        "start": 1578.0,
        "end": 1584.0
    },
    {
        "text": " Sí, eso vamos a.",
        "start": 1584.0,
        "end": 1585.0
    },
    {
        "text": " Exactamente, ese es el frasición, en un momento.",
        "start": 1585.0,
        "end": 1589.0
    },
    {
        "text": " Sólo que voy a hacer una cuantita previa para usar eso, exactamente.",
        "start": 1589.0,
        "end": 1593.0
    },
    {
        "text": " Acá, urises esto, están todos de acuerdo, este truco le hicimos mil veces, ya no, D por S y su N menos B por D y a la menos 1, pero vale la pena, por si alguno no pén fin está perdido. ¿Por qué vale esto, Martin?",
        "start": 1594.0,
        "end": 1608.0
    },
    {
        "text": " Claro, porque Rdc es el mayor valor propio.",
        "start": 1614.0,
        "end": 1617.0
    },
    {
        "text": " ¿Cómo se calcula?",
        "start": 1618.0,
        "end": 1620.0
    },
    {
        "text": " El mayor valor propio, no, es el valor propio, es el módulo más grande de todos los valores propios.",
        "start": 1620.0,
        "end": 1628.0
    },
    {
        "text": " Pero los valores propios, de S y su N menos B y de D por S y su N menos B, ¿cómo son?",
        "start": 1628.0,
        "end": 1637.0
    },
    {
        "text": " ¿Por qué?",
        "start": 1637.0,
        "end": 1638.0
    },
    {
        "text": " Claro, porque exactamente es el aclado, es un módulo determinante.",
        "start": 1638.0,
        "end": 1644.0
    },
    {
        "text": " Y por lo tanto, si son iguales, el Rdc es el mismo también.",
        "start": 1645.0,
        "end": 1650.0
    },
    {
        "text": " Porque en definitiva, cuando vos has logrado que conjugar por D y a la menos 1, el matriz de invertible, no te cambia el espectro.",
        "start": 1651.0,
        "end": 1659.0
    },
    {
        "text": " Sí, y creo que en alguna más también es musado ese truco, ese truco esencial.",
        "start": 1662.0,
        "end": 1668.0
    },
    {
        "text": " Y bueno, pero si puedo... hago las cuentas y si hago las cuentas en este primer,",
        "start": 1669.0,
        "end": 1677.0
    },
    {
        "text": " este es una S que es un numerito, es un real.",
        "start": 1677.0,
        "end": 1682.0
    },
    {
        "text": " Entonces, D por S por D a la menos 1 se va todo, porque le entiendan, como estamos del mundo.",
        "start": 1683.0,
        "end": 1689.0
    },
    {
        "text": " O sea, que esto me queda Rdc y su N, como que esta parte, la deja fija.",
        "start": 1689.0,
        "end": 1696.0
    },
    {
        "text": " De hecho hay un ejercicio que nos costó en el Prérdico 1 probar que él, esta son las únicas más tríceas que quedan fija por conjugación,",
        "start": 1697.0,
        "end": 1705.0
    },
    {
        "text": " menos D, B y a la menos u.",
        "start": 1706.0,
        "end": 1711.0
    },
    {
        "text": " Y por eso es que quería que ustedes vieran como son los elementos acá.",
        "start": 1712.0,
        "end": 1715.0
    },
    {
        "text": " Ahora lo tienen clarísimo cuándo son los elementos acá y vamos a usar la desigualdad que mencionó Ténicolás.",
        "start": 1715.0,
        "end": 1722.0
    },
    {
        "text": " La desigualdad del ejercicio que el radio espectral es menor que el máximo de las sumas de los módulos de las columnas.",
        "start": 1723.0,
        "end": 1731.0
    },
    {
        "text": " Exactamente, menor igual, dije menor, menor igual.",
        "start": 1731.0,
        "end": 1736.0
    },
    {
        "text": " Entonces, esto sigue menor igual, menor igual que el máximo.",
        "start": 1736.0,
        "end": 1744.0
    },
    {
        "text": " Yo puse acá que ejercicio era, no puse ejercicio de práctico, me no puse la numeración, pero debe ser ejercicio práctico 4.",
        "start": 1745.0,
        "end": 1751.0
    },
    {
        "text": " Máximo de E, menos B y J, menos sumatoria con el distinto de J, de Sui a la menos 1, de Su J, pero en la menos 1, por B sui J, por Sui, variando J.",
        "start": 1752.0,
        "end": 1778.0
    },
    {
        "text": " A ver, aquí vale tanto por columna por fila, acá que hice por...",
        "start": 1783.0,
        "end": 1789.0
    },
    {
        "text": " Sí, por columna y acá.",
        "start": 1796.0,
        "end": 1799.0
    },
    {
        "text": " Siempre me cuesta vez cuando escogí una onda bien, pero vale en las dos casos, acá le hicimos por columna.",
        "start": 1799.0,
        "end": 1806.0
    },
    {
        "text": " Lo ven esto, o sea, voy a mirar las columnas de esta matriz.",
        "start": 1806.0,
        "end": 1813.0
    },
    {
        "text": " Las columnas de esta matriz son las columnas de esta matriz que ustedes me dijeron cuanto valía en los coeficientes.",
        "start": 1813.0,
        "end": 1820.0
    },
    {
        "text": " Solo que está con menos adelante y tenés que sumarle ese por isso viene.",
        "start": 1820.0,
        "end": 1828.0
    },
    {
        "text": " Entonces vamos a agarrar en ese porición de esta acá, ese.",
        "start": 1829.0,
        "end": 1833.0
    },
    {
        "text": " Después recuerden que esta matriz es mayor igual que 0, todos los coeficientes son mayor igual que 0.",
        "start": 1833.0,
        "end": 1841.0
    },
    {
        "text": " Lo hicimos lo primero que hicimos, sea mayor igual que 0.",
        "start": 1841.0,
        "end": 1844.0
    },
    {
        "text": " Entonces cuando miremos la columna, todos los coeficientes son mayor igual que 0.",
        "start": 1844.0,
        "end": 1848.0
    },
    {
        "text": " Por lo tanto lo único que tengo que hacer es sumarle.",
        "start": 1848.0,
        "end": 1851.0
    },
    {
        "text": " No me preocupo, el valor absoluto y toda la cisteria, porque están todos mayor igual que 0.",
        "start": 1851.0,
        "end": 1855.0
    },
    {
        "text": " Lo hicimos junto.",
        "start": 1855.0,
        "end": 1857.0
    },
    {
        "text": " Entonces cuando voy sumando, si mirando con cuidado, en el término que toca la diagonal en esa columna,",
        "start": 1857.0,
        "end": 1864.0
    },
    {
        "text": " es este. Y fuera de la diagonal, es este, me dijeron a ustedes.",
        "start": 1864.0,
        "end": 1868.0
    },
    {
        "text": " Entonces está. Ahora que pasa, esto, viren acá, de acá.",
        "start": 1868.0,
        "end": 1875.0
    },
    {
        "text": " Ahora sí lo paso para el otro lado, lo que quería hacer hoy.",
        "start": 1875.0,
        "end": 1880.0
    },
    {
        "text": " Dividamos esta expresión por de subjota,",
        "start": 1881.0,
        "end": 1888.0
    },
    {
        "text": " dividamos esta expresión por de subjota,",
        "start": 1888.0,
        "end": 1892.0
    },
    {
        "text": " y ¿qué más tengo que hacer?",
        "start": 1892.0,
        "end": 1896.0
    },
    {
        "text": " Y multiplicaremos por menos 1.",
        "start": 1896.0,
        "end": 1900.0
    },
    {
        "text": " Esta expresión, la divido por de subjota, lo paso por aquí y multiplico por menos 1.",
        "start": 1900.0,
        "end": 1907.0
    },
    {
        "text": " Entonces, hagámoslo junto.",
        "start": 1908.0,
        "end": 1910.0
    },
    {
        "text": " De subjota mayor que 0, puedo dividir entre subjota.",
        "start": 1910.0,
        "end": 1913.0
    },
    {
        "text": " Me queda, vez subjota, j,",
        "start": 1913.0,
        "end": 1916.0
    },
    {
        "text": " mayor que menos sumatoria y distinto de j, de subjota, la menos 1, de subíbe subj.",
        "start": 1916.0,
        "end": 1921.0
    },
    {
        "text": " Lo multiplico, lo paso para este lado, que en vez de menos queda más.",
        "start": 1921.0,
        "end": 1927.0
    },
    {
        "text": " Está bien. Y después multiplico por menos 1, con lo cual, me queda todo menos.",
        "start": 1927.0,
        "end": 1934.0
    },
    {
        "text": " Y en vez de mayor que 0, me queda menor que 0. ¿De acuerdo?",
        "start": 1934.0,
        "end": 1939.0
    },
    {
        "text": " O sea, lo que digo que de acá, con esos tres cambios, me queda.",
        "start": 1939.0,
        "end": 1943.0
    },
    {
        "text": " Veas subjota j, menos, menos sumatoria, con distinto de j, de subí, de subj, la menos 1,",
        "start": 1943.0,
        "end": 1955.0
    },
    {
        "text": " por vez subj, menor que 0.",
        "start": 1955.0,
        "end": 1959.0
    },
    {
        "text": " Esto lo podemos olvidar si quieren para que no les mare este mayor igual que 0.",
        "start": 1960.0,
        "end": 1965.0
    },
    {
        "text": " Estoy jugando con esa desigualdad.",
        "start": 1966.0,
        "end": 1969.0
    },
    {
        "text": " Correcto.",
        "start": 1971.0,
        "end": 1973.0
    },
    {
        "text": " Pero esto es exactamente esto en lo que está acá.",
        "start": 1973.0,
        "end": 1977.0
    },
    {
        "text": " Es exactamente eso.",
        "start": 1979.0,
        "end": 1980.0
    },
    {
        "text": " Menos, vez subjota j, menos, de...",
        "start": 1980.0,
        "end": 1983.0
    },
    {
        "text": " quiere decir que le está restando...",
        "start": 1983.0,
        "end": 1986.0
    },
    {
        "text": " O sea, esto es menor que 0.",
        "start": 1987.0,
        "end": 1989.0
    },
    {
        "text": " Esta presión es menor que 0. O sea, que es ese y después le ha restado algo.",
        "start": 1989.0,
        "end": 1994.0
    },
    {
        "text": " Esto es menor que 0.",
        "start": 1994.0,
        "end": 1995.0
    },
    {
        "text": " O sea, ese más algo que es menor que 0.",
        "start": 1995.0,
        "end": 1998.0
    },
    {
        "text": " O sea, en cuenta, entonces, en cualquier caso para todo j, esto vale para todo j.",
        "start": 1998.0,
        "end": 2003.0
    },
    {
        "text": " Lo aplico en todos los j, en todos los casos, me da menor que 0, máximo también es menor que 0.",
        "start": 2004.0,
        "end": 2009.0
    },
    {
        "text": " Nuevamente es una maravilla, como encaja toda la matemática, ¿no?",
        "start": 2016.0,
        "end": 2020.0
    },
    {
        "text": " Y no hay nada más para probar, ese es eso.",
        "start": 2028.0,
        "end": 2030.0
    },
    {
        "text": " Ahí hemos probado...",
        "start": 2030.0,
        "end": 2032.0
    },
    {
        "text": " Se implica de...",
        "start": 2033.0,
        "end": 2035.0
    },
    {
        "text": " Y terminamos el teorema y terminamos el modelo de identidad.",
        "start": 2035.0,
        "end": 2039.0
    },
    {
        "text": " Claro, nos queda pendiente.",
        "start": 2039.0,
        "end": 2041.0
    },
    {
        "text": " La discusión naranja que está en práctico",
        "start": 2041.0,
        "end": 2043.0
    },
    {
        "text": " y el dé implica sé que necesitamos el teorema y por un fronfroides.",
        "start": 2043.0,
        "end": 2047.0
    },
    {
        "text": " Esa es 7.",
        "start": 2050.0,
        "end": 2051.0
    },
    {
        "text": " Exactamente, es 7.",
        "start": 2051.0,
        "end": 2053.0
    },
    {
        "text": " Esas ejercicio 7, el práctico 5 lo pongo acá para que quedé grabado y ya después borramos el resto.",
        "start": 2053.0,
        "end": 2058.0
    },
    {
        "text": " Lo naranja es práctico 5 en ejercicio 7.",
        "start": 2058.0,
        "end": 2064.0
    },
    {
        "text": " Si les parece bien, yo les propongo lo siguiente.",
        "start": 2066.0,
        "end": 2069.0
    },
    {
        "text": " Hay una parte más fácil y una parte más difícil.",
        "start": 2069.0,
        "end": 2072.0
    },
    {
        "text": " No sé si alguien lo hizo.",
        "start": 2072.0,
        "end": 2073.0
    },
    {
        "text": " Martín, Nico, alguien lo hizo, fue con uno, Santiago, un hecho, ¿no?",
        "start": 2075.0,
        "end": 2078.0
    },
    {
        "text": " Es esta parte.",
        "start": 2081.0,
        "end": 2082.0
    },
    {
        "text": " Si nadie lo hizo.",
        "start": 2082.0,
        "end": 2084.0
    },
    {
        "text": " Ahí, digamos, una parte que a mí me resultó más sencilla, que es aplica E.",
        "start": 2089.0,
        "end": 2096.0
    },
    {
        "text": " Y una parte que es un poco más complicada.",
        "start": 2097.0,
        "end": 2099.0
    },
    {
        "text": " A mí me resultó más complicada, de veridad, así.",
        "start": 2100.0,
        "end": 2103.0
    },
    {
        "text": " Quieren que yo haga implica E y sigo con el micrófono.",
        "start": 2106.0,
        "end": 2109.0
    },
    {
        "text": " Esto es práctico, hacemos implica E, que es parte de también si querés el teórico.",
        "start": 2109.0,
        "end": 2112.0
    },
    {
        "text": " Y después si querés cortamos y cuitemos implica E.",
        "start": 2112.0,
        "end": 2115.0
    },
    {
        "text": " Es más rico porque me parece que hay que revolverse más.",
        "start": 2115.0,
        "end": 2119.0
    },
    {
        "text": " Entonces, salgamos a implica E que podría tomarse como parte del teórico",
        "start": 2120.0,
        "end": 2124.0
    },
    {
        "text": " o como el carcizo 7 de práctico.",
        "start": 2124.0,
        "end": 2127.0
    },
    {
        "text": " Les recuerdo que hay un coroelario, el 1.3, vayan como tres clases para atrás,",
        "start": 2130.0,
        "end": 2135.0
    },
    {
        "text": " que dice que si tenés una matriz con diagonal dominante negativa,",
        "start": 2136.0,
        "end": 2140.0
    },
    {
        "text": " decían el libro y yo aclaré en el clase que quería ser negativa,",
        "start": 2141.0,
        "end": 2144.0
    },
    {
        "text": " una matriz con diagonal dominante, donde todas sus entradas I, I, I eran menores que cero,",
        "start": 2145.0,
        "end": 2153.0
    },
    {
        "text": " entonces,",
        "start": 2155.0,
        "end": 2157.0
    },
    {
        "text": " la parte real de los valores propios será negativa, ¿se acuerdas del cimo?",
        "start": 2165.0,
        "end": 2171.0
    },
    {
        "text": " La parte real de los valores propios es negativa.",
        "start": 2172.0,
        "end": 2174.0
    },
    {
        "text": " Entonces para implica E vamos a usar el secorelario,",
        "start": 2175.0,
        "end": 2177.0
    },
    {
        "text": " es bastante sencillo usando el secorelario.",
        "start": 2177.0,
        "end": 2179.0
    },
    {
        "text": " Primero detalle, acabamos de observar porque yo quiero hacer A implica E, ¿no?",
        "start": 2180.0,
        "end": 2187.0
    },
    {
        "text": " Pero asumamos que A a veces E y D están todos equivalentes entre C.",
        "start": 2188.0,
        "end": 2192.0
    },
    {
        "text": " Y por lo tanto, en este momento, A veces E y D son equivalentes entre C.",
        "start": 2193.0,
        "end": 2196.0
    },
    {
        "text": " Y por lo tanto, yo puedo asumir esta prueba, si B tiene diagonal dominante,",
        "start": 2197.0,
        "end": 2203.0
    },
    {
        "text": " pero dije B, si B tiene diagonal dominante, entonces vale esto,",
        "start": 2204.0,
        "end": 2208.0
    },
    {
        "text": " en particular los B subjotas son mayores que cero.",
        "start": 2209.0,
        "end": 2212.0
    },
    {
        "text": " Porque estos dos son conceptos equivalentes, en particular los B subjotas son mayores que cero,",
        "start": 2215.0,
        "end": 2220.0
    },
    {
        "text": " porque quiero usar el coro elario 1,3, que pedía que los A suí eran menores que cero,",
        "start": 2221.0,
        "end": 2226.0
    },
    {
        "text": " estrictamente menores que cero. La que voy a tomar es menos A, B es igual A es igual a menos B,",
        "start": 2226.0,
        "end": 2232.0
    },
    {
        "text": " bueno, B es menos A, pero quiere decir A es igual a menos B,",
        "start": 2233.0,
        "end": 2236.0
    },
    {
        "text": " pero tomar la opuesta de B y voy a usar el secorelario 1,3, ¿no?",
        "start": 2237.0,
        "end": 2240.0
    },
    {
        "text": " Entonces, ya conté un poquito el cuento por donde viene,",
        "start": 2241.0,
        "end": 2250.0
    },
    {
        "text": " la parte en la que yo creo que es más sencilla,",
        "start": 2252.0,
        "end": 2254.0
    },
    {
        "text": " lo pongo una arranja, es A implica E, parte del ejercicio 7 del práctico 5.",
        "start": 2257.0,
        "end": 2266.0
    },
    {
        "text": " Y bueno, lo que les proponía es usar justamente el coro elario 1,3",
        "start": 2269.0,
        "end": 2275.0
    },
    {
        "text": " y tomando A igual a menos B, si A es menos B,",
        "start": 2278.0,
        "end": 2283.0
    },
    {
        "text": " entonces los A suí y son menores igual a que cero,",
        "start": 2284.0,
        "end": 2291.0
    },
    {
        "text": " pero como a recién a observe como hay B son equivalentes con la previta que acabamos de observar,",
        "start": 2292.0,
        "end": 2296.0
    },
    {
        "text": " de hacer juntos en este pizarro, en realidad puedo decir que A suí es menor que Cero,",
        "start": 2297.0,
        "end": 2301.0
    },
    {
        "text": " porque el B subjota j, o el B suí es mayor de Cero.",
        "start": 2303.0,
        "end": 2306.0
    },
    {
        "text": " Dicho esto, puedo usar el coro elario 1,3 ahora sí, lo puedo usar porque tengo esta situación",
        "start": 2307.0,
        "end": 2313.0
    },
    {
        "text": " y decía, si A tiene D, ¡Ah! hay un detalle más que lo dijimos en clase la vez pasada.",
        "start": 2314.0,
        "end": 2319.0
    },
    {
        "text": " Si una matriz tiene D, ¿qué es el concepto de D, ¿qué es el concepto de D,",
        "start": 2320.0,
        "end": 2328.0
    },
    {
        "text": " y a un aluminante es usando balones absolutos,",
        "start": 2329.0,
        "end": 2331.0
    },
    {
        "text": " o sea que si le cambias de ponerse lo puesto a los coeficientes,",
        "start": 2332.0,
        "end": 2334.0
    },
    {
        "text": " ni se entera las definiciones de D, ¿qué es el aluminante?",
        "start": 2335.0,
        "end": 2337.0
    },
    {
        "text": " Por supuesto más balones absolutos cada uno, entonces si B tiene D,",
        "start": 2338.0,
        "end": 2342.0
    },
    {
        "text": " ¿qué es el aluminante? O es todo son equivalentes, ¿qué es el que es el que es el que es el",
        "start": 2343.0,
        "end": 2348.0
    },
    {
        "text": " aluminante? ¿Qué es el que es el que es el que es el que es el que es el que es el",
        "start": 2349.0,
        "end": 2353.0
    },
    {
        "text": " coeficientes negativos y a un aluminante que me dice el coro elario 1,3,",
        "start": 2353.0,
        "end": 2357.0
    },
    {
        "text": " que la parte real de lambda para todo el lambda va al or propio,",
        "start": 2359.0,
        "end": 2367.0
    },
    {
        "text": " de A la parte real de lambda, ¿eh? ¿seguenan?",
        "start": 2368.0,
        "end": 2373.0
    },
    {
        "text": " menor que Cero, para todo el lambda va al or propio real de A.",
        "start": 2374.0,
        "end": 2378.0
    },
    {
        "text": " Pero en la parte real, ¿lo valor es propio de A? ¿Cómo son con respecto a lo valor de",
        "start": 2379.0,
        "end": 2387.0
    },
    {
        "text": " es propio de B? Claro, D, si solamente sí, menos lambda,",
        "start": 2387.0,
        "end": 2396.0
    },
    {
        "text": " es valor propio de B. Claro, por lo tanto la parte real de menos lambda,",
        "start": 2397.0,
        "end": 2407.0
    },
    {
        "text": " vale para todo, menos lambda, valor propio de B, es mayor que Cero.",
        "start": 2407.0,
        "end": 2416.0
    },
    {
        "text": " Ni importa que si saben menos lambda, son valores de propio de B, todos los valores de",
        "start": 2417.0,
        "end": 2420.0
    },
    {
        "text": " propio de B, saben cómo se llaman, acá se llamaron menos lambda porque venían",
        "start": 2420.0,
        "end": 2423.0
    },
    {
        "text": " de los valores de propiedad. Todos sus valores propies son positivos,",
        "start": 2423.0,
        "end": 2428.0
    },
    {
        "text": " la parte real, ¿no? Disculten, la parte real son positivos.",
        "start": 2428.0,
        "end": 2431.0
    },
    {
        "text": " Entonces tenemos a implica de usando ese coro elario.",
        "start": 2432.0,
        "end": 2434.0
    },
    {
        "text": " ¿Aí ¿no es usted que payoff lessen M o R a이어 a M clubar?",
        "start": 2438.0,
        "end": 2443.5
    },
    {
        "text": " Hey, ¿no es usted? ¿Es un régimen deegen amountרים? ¿Es de que no voy a reapезar?",
        "start": 2445.0,
        "end": 2455.0
    },
    {
        "text": " Bueno, pero sul vale que fleeing levone clumsy, ¿sía ni aпadro?",
        "start": 2456.0,
        "end": 2460.0
    },
    {
        "text": " ¿Hay que tener los deler? ¿Por qué es por mi parte de la idea de la idea?",
        "start": 2460.0,
        "end": 2467.0
    },
    {
        "text": " Sí. ¿Lo que tiene va a ir los propios parte real? ¿Cómo es idea?",
        "start": 2467.0,
        "end": 2473.0
    },
    {
        "text": " Los de A tiene la parte real negativa. Entonces, los de B tiene parte real positivo. ¿Está bien? ¿Sí?",
        "start": 2473.0,
        "end": 2484.0
    },
    {
        "text": " ¿Cordamos acá? Pues, bien, porque ahora viene la parte e implica. Y ahí quiero que pasen ustedes.",
        "start": 2484.0,
        "end": 2490.0
    },
    {
        "text": " Y hay que jugar y dibujar en el pizarro en el centro.",
        "start": 2490.0,
        "end": 2493.0
    }
]