[
    {
        "text": " Bueno, bien, entonces empecemos con el repaso pero muy cortito, recordándoles que fue",
        "start": 0.0,
        "end": 11.28
    },
    {
        "text": " lo que hicimos la clase del martes, empezamos trabajando con los enteros, los números",
        "start": 11.28,
        "end": 21.740000000000002
    },
    {
        "text": " y después nos fuimos a los polinomios. Y de hecho la parte que más me interesa recordarle",
        "start": 21.740000000000002,
        "end": 27.98
    },
    {
        "text": " es la de los polinomios, por supuesto que la quedamos a aplicar. Y entonces,",
        "start": 27.98,
        "end": 32.26
    },
    {
        "text": " dedicemos 5, 10 minutos al repaso de Besut, lo que decía Besut, lo que repasamos el otro",
        "start": 32.26,
        "end": 52.7
    },
    {
        "text": " día fue, dividir polinomios, cómo se diría polinomios, el algoritmo de Euclides, el",
        "start": 52.7,
        "end": 59.2
    },
    {
        "text": " algoritmo de Euclides se acuerdan tratados polinomios P1DT y P2DT, pero tiene ciente",
        "start": 59.2,
        "end": 69.18
    },
    {
        "text": " acá del T, el anillo de polinomios, acá es un cuerpo. Entonces el algoritmo de Euclides",
        "start": 69.18,
        "end": 77.54
    },
    {
        "text": " planteaba, bueno, P1DT dividido, P2DT, me da un cociente Q1DT y un resto de R1DT.",
        "start": 77.54,
        "end": 88.14
    },
    {
        "text": " Con el grado esta notación ya quiere decir que el grado del cierre esto el grado es menor,",
        "start": 88.14,
        "end": 95.7
    },
    {
        "text": " pero bueno vamos a notarlo para que quede bien claro. Y entonces P1P2 y el resto resulta",
        "start": 95.7,
        "end": 108.88
    },
    {
        "text": " que hicimos cuenta juntos y los divisores del conjunto de los divisores, de P1DT y P2DT,",
        "start": 108.88,
        "end": 122.18
    },
    {
        "text": " los divisores comunes, de los divisores comunes, de P1DT, pero de T escoh incidida si se acuerdan",
        "start": 122.18,
        "end": 130.3
    },
    {
        "text": " con el conjunto de divisores comunes de quienes.",
        "start": 130.3,
        "end": 139.26000000000002
    },
    {
        "text": " Hay va, de P2DT y R1DT, que lo llamamos, bueno, R1DT lo llamamos P3DT, lo definimos así",
        "start": 139.26,
        "end": 159.7
    },
    {
        "text": " para que se escribir a tipo algoritmo. Y entonces el algoritmo seguía, el paso 1, el",
        "start": 159.7,
        "end": 167.64
    },
    {
        "text": " paso 2, seguía simplemente tomando P2DT dividido, R1DT, un segundo cociente que muchas",
        "start": 167.64,
        "end": 176.32
    },
    {
        "text": " pelotas no le toman los cocientes, un segundo resto, por supuesto si es un resto quiere decir",
        "start": 176.32,
        "end": 181.6
    },
    {
        "text": " que el grado del segundo resto, de este resto es menor, pero menor que el grado del R1DT,",
        "start": 181.6,
        "end": 192.51999999999998
    },
    {
        "text": " bueno, R1DT, dijimos que se llama P3DT, bueno y entonces tenemos que los divisores comunes,",
        "start": 192.52,
        "end": 205.76000000000002
    },
    {
        "text": " de P2DT y P3DT, que esa R1DT, son los mismos que los divisores comunes,",
        "start": 205.76,
        "end": 215.32
    },
    {
        "text": " de P3DT y R2DT, y a este lo llamábamos P4DT, lo definimos P4DT, etcétera. Y esto seguía, seguía,",
        "start": 220.07999999999998,
        "end": 232.79999999999998
    },
    {
        "text": " seguía, seguía y como al final de cuenta el grado de los restos va bajando, siempre es menor y bueno,",
        "start": 233.36,
        "end": 239.48000000000002
    },
    {
        "text": " empezás con un polinomio P2, con un grado fijo, no sé, será grande o no tiene importe del grado,",
        "start": 239.48000000000002,
        "end": 245.60000000000002
    },
    {
        "text": " pero cada vez son más chicos, los grados cada vez más chicos, esto va a terminar. Y cuando terminaba,",
        "start": 245.60000000000002,
        "end": 250.88000000000002
    },
    {
        "text": " lo que pasaba es que a partir de que los divisores comunes son los mismos entre cada 2 polinamios",
        "start": 250.88000000000002,
        "end": 258.68
    },
    {
        "text": " consecutivos, resulta concluíamos que el último, entonces el último resto no enulo,",
        "start": 258.68,
        "end": 270.24
    },
    {
        "text": " el último resto no enulo terminaba siendo el máximo comun divisor del algoritmo,",
        "start": 274.52,
        "end": 281.28000000000003
    },
    {
        "text": " terminaba siendo el máximo comun divisor de P1 y P2,",
        "start": 281.28,
        "end": 289.35999999999996
    },
    {
        "text": " todo este proceso, este proceso digamos, vamos a ponerle punto suspensivo,",
        "start": 301.23999999999995,
        "end": 306.4
    },
    {
        "text": " se llama algoritmo de ucris, esto se ve por ejemplo en discretado, pero también antes se veían al",
        "start": 306.4,
        "end": 319.76
    },
    {
        "text": " diseo para no para los polinamios y no para los centeros, para los números, los números",
        "start": 319.76,
        "end": 325.56
    },
    {
        "text": " centeros, el último, el último divisor no enulo era el máximo comun divisor de los",
        "start": 325.56,
        "end": 332.76
    },
    {
        "text": " dos números con que empezaste y así calculan el máximo conodición las computadoras,",
        "start": 332.76,
        "end": 337.76
    },
    {
        "text": " no con descomposición factorial porque es muchísimo mucho más agasto energético que hacer el algoritmo",
        "start": 337.76,
        "end": 344.8
    },
    {
        "text": " excepto que tenga una descomposición factorial obvia, bueno en fin, entonces esto es el último",
        "start": 347.2,
        "end": 353.2
    },
    {
        "text": " resto no enulo del algoritmo, es el máximo comun divisor y donde aparece Besut, bueno nosotros",
        "start": 353.2,
        "end": 360.56
    },
    {
        "text": " empezamos a desarmar hacia atrás y ese último máximo comun divisor que podemos llamarlo,",
        "start": 360.56,
        "end": 367.28000000000003
    },
    {
        "text": " le pongo por un nombre yo que es DDT, es el divisor con un de los dos pero es el máximo",
        "start": 367.28000000000003,
        "end": 375.28000000000003
    },
    {
        "text": " el último resto, resulta que existen al Fibeta, dos polinamios,",
        "start": 375.28000000000003,
        "end": 381.96
    },
    {
        "text": " tal que el DDT, tal que DDT se podía escribir como alpha de T por P1 de T más beta de T por P2",
        "start": 381.96,
        "end": 401.15999999999997
    },
    {
        "text": " de T, esto es lo que se llama Lema de Besut, que le hicimos también, esto es Besut,",
        "start": 401.16,
        "end": 411.84000000000003
    },
    {
        "text": " no me acuerdo creo que tiene algún tilde, la E creo que tiene un tilde, o sea que el máximo",
        "start": 413.84000000000003,
        "end": 420.6
    },
    {
        "text": " comun divisor se puede escribir en función de P1 y P2, ¿no? Como le hicimos, se acuerdan a que",
        "start": 420.6,
        "end": 426.96000000000004
    },
    {
        "text": " se acuenta verde el pizarro en abajo, que íbamos desarmando, desarmando, desarmando,",
        "start": 426.96,
        "end": 431.35999999999996
    },
    {
        "text": " desarmando, paso a paso, bueno lo escribía del este resultado, es realmente tiene muchísima",
        "start": 431.35999999999996,
        "end": 438.2
    },
    {
        "text": " polenta para un montón de resultados posteriores en el análisis de polinamios y nosotros lo vamos",
        "start": 438.2,
        "end": 446.56
    },
    {
        "text": " a usar directamente en el tema de Sjorda, ahora bien, ¿qué pasa? Pregunto, para aplicarlo,",
        "start": 446.56,
        "end": 458.98
    },
    {
        "text": " ya pensando en los pasos que voy a dar con Sjorda, ¿no? ¿Qué pasa? ¿Qué sucede?",
        "start": 458.98,
        "end": 466.44
    },
    {
        "text": " Creo que lo dijimos también a clase pasada, si P1 de T y P2 de T no tienen raíces comunes,",
        "start": 466.44,
        "end": 479.0
    },
    {
        "text": " no comparten ninguna raíz,",
        "start": 485.0,
        "end": 487.44
    },
    {
        "text": " de lo que tenemos escrito ahí podemos sacar conclusiones, creo que lo dijimos pero en todo caso",
        "start": 487.44,
        "end": 499.76
    },
    {
        "text": " la pueden razonar también si no le dijimos, o sea entre el tema de Bessuth y esa otra información,",
        "start": 499.76,
        "end": 508.44
    },
    {
        "text": " ¿cómo se llama la compañera? Sara, ¿qué podríamos concluir?",
        "start": 508.44,
        "end": 518.76
    },
    {
        "text": " Bueno vamos a sumir que en toda esta parte capaz que sí, capaz que sí, capaz que",
        "start": 530.76,
        "end": 536.68
    },
    {
        "text": " bajo cierta manera podríamos cumplir eso pero al revés pongamos que eso es hipótesis,",
        "start": 537.2399999999999,
        "end": 542.0
    },
    {
        "text": " cuerpo al quebraicamente se rara y con eso como base que vamos a cumplir.",
        "start": 544.0,
        "end": 551.4799999999999
    },
    {
        "text": " Porque el último resto no nudo, el máximo común divisor, el dete, porque si tuviera",
        "start": 551.48,
        "end": 574.84
    },
    {
        "text": " grado uno más que pasaba, si tuviera grado uno, empecemos con el caso grado uno.",
        "start": 574.84,
        "end": 580.72
    },
    {
        "text": " Claro no, una raíz en común porque este es muchacho, al ser divisor de ambos porque sea",
        "start": 580.72,
        "end": 588.08
    },
    {
        "text": " máximo común divisor en particular, de acá, al ser máximo común divisor en particular,",
        "start": 588.08,
        "end": 594.0400000000001
    },
    {
        "text": " lo divide a los dos. Entonces, si el grado de D fuera uno empecemos por ese caso,",
        "start": 594.04,
        "end": 610.9599999999999
    },
    {
        "text": " entonces como D divide a P1 y D divide a P2, D divide a P1 y D divide a P2,",
        "start": 610.9599999999999,
        "end": 620.8
    },
    {
        "text": " entonces tendrían una raíz en común, porque D divide a grado uno es un buenomio,",
        "start": 621.8,
        "end": 628.52
    },
    {
        "text": " al ser un buenomio tiene una raíz, tendrían raíz en común.",
        "start": 628.52,
        "end": 632.0799999999999
    },
    {
        "text": " Al menos 1 y bueno eso si grado es 1 y qué pasa si el grado es mayor igual que",
        "start": 641.3599999999999,
        "end": 649.28
    },
    {
        "text": " 2. Es casi lo mismo pero hay que agregar un detallecito en el resonamiento.",
        "start": 651.8,
        "end": 659.04
    },
    {
        "text": " Pero tiene raíz siempre, porque ahí aparece esto, ahí aparece lo de cuerpo al que era",
        "start": 663.04,
        "end": 670.28
    },
    {
        "text": " que era que ha de que me te he cerrado porque si no lo fuera, por ejemplo en los reales podríamos",
        "start": 670.28,
        "end": 675.28
    },
    {
        "text": " tener un polínomio grado 2, X cuadro a más 1, que no tiene raíces y por más que los",
        "start": 675.28,
        "end": 681.28
    },
    {
        "text": " divide a los dos, no les hace compartir raíces a P1 y P2, porque X cuadro a más 1 no tiene nada",
        "start": 681.28,
        "end": 688.72
    },
    {
        "text": " para compartir, no tiene raíces en los reales. Pero como acá, como dijo la compañera,",
        "start": 688.72,
        "end": 694.68
    },
    {
        "text": " nos recordó, ojo que acá está trabajando con cuerpo, que habre que hambre serrado,",
        "start": 694.68,
        "end": 698.52
    },
    {
        "text": " cuando decir grado mayor igual que 2, entonces tenés dos raíces o más. Entonces,",
        "start": 698.52,
        "end": 702.9599999999999
    },
    {
        "text": " termina siendo el mismo resonamiento que en anterior, solo que tuvimos que advertir ojo,",
        "start": 702.96,
        "end": 708.88
    },
    {
        "text": " recuerden que tenemos un cuerpo al que era que ha de que se ha cerrado y por lo tanto tenemos",
        "start": 708.88,
        "end": 713.76
    },
    {
        "text": " raíces para compartir. Si grado de, vamos a decir así es N, es mayor igual que 2,",
        "start": 713.76,
        "end": 723.8000000000001
    },
    {
        "text": " de tiene N, con tal multiplicidad, ¿cierto? Con tal multiplicidad, entonces si tiene N,",
        "start": 723.8,
        "end": 737.24
    },
    {
        "text": " es, bueno, conclusión, tendríamos la misma conclusión. Quiere decir que si el grado es mayor igual",
        "start": 737.24,
        "end": 750.5999999999999
    },
    {
        "text": " que 1 les hace compartir raíces a P1 y P2, como no tienen raíces comunes, conclusión,",
        "start": 750.6,
        "end": 757.32
    },
    {
        "text": " la que dijo la compañera, entonces el máximo común divisor de DT, que era el máximo",
        "start": 757.32,
        "end": 763.64
    },
    {
        "text": " común divisor de ambos, tiene grado 0 y decir que tiene grado 0, es la misma que decir que",
        "start": 763.64,
        "end": 778.9200000000001
    },
    {
        "text": " es igual a 1, el 1 del cuerpo, podría ser de un número cualquiera, pero recuerden que los",
        "start": 778.92,
        "end": 787.64
    },
    {
        "text": " máximos comunes divisores siempre se toman mónicos, todos polinomios mónicos y el mónico de los",
        "start": 787.64,
        "end": 794.76
    },
    {
        "text": " números es el 1, no el a 8 ni el menos 1, ¿no? El 1. Entonces quiere decir que en este caso es 1,",
        "start": 794.76,
        "end": 802.76
    },
    {
        "text": " ese es exactamente el caso que vamos a usar en el medio del terema de lloros, es en parte de la",
        "start": 803.76,
        "end": 811.24
    },
    {
        "text": " administración, les decía hace un par de clases que el terema de lloran tiene 3 partes, vamos a",
        "start": 811.24,
        "end": 816.36
    },
    {
        "text": " hacer la 1 y en la 2 vamos a usar exactamente el ticas y la 3 y la que vamos a dejar planteado para",
        "start": 816.36,
        "end": 823.4
    },
    {
        "text": " el martes que viene, sacándonos todas las cuentas en gorrosas hoy para que el martes quede más",
        "start": 823.4,
        "end": 829.64
    },
    {
        "text": " livía, vamos, si vió el repaso, fueron más de 5 minutos, fueron como 10, pero no son triviales",
        "start": 829.64,
        "end": 838.08
    },
    {
        "text": " estas cosas, en particular si en el liseón o no si existieron mucho con polinomios o no",
        "start": 838.08,
        "end": 844.12
    },
    {
        "text": " necesitan jugar con polinomios, antes de pasaban haciendo dividir polinomios, creo que ahora no",
        "start": 844.12,
        "end": 852.34
    },
    {
        "text": " insisten tanto con eso, por eso, preguntas antes que borre el pizarrón, los mishachos de penfin marcharon,",
        "start": 852.34,
        "end": 860.82
    },
    {
        "text": " no pueden preguntar voy a borrar el pizarrón, no tenemos eso de que vaya para atrás en el tiempo,",
        "start": 860.82,
        "end": 868.02
    },
    {
        "text": " muy bien, mientras borro les comento, no?",
        "start": 868.02,
        "end": 895.54
    },
    {
        "text": " Vieron que hay un ejercicio de práctico, se acuerdas que se les dije que este libro tiene errores",
        "start": 895.54,
        "end": 904.3
    },
    {
        "text": " que lo vamos a ensanando, subsanando, corregiendo, algunos se alicimos, corrigimos una matriz,",
        "start": 904.3,
        "end": 910.02
    },
    {
        "text": " se acuerdan que estaba mal, tiene errores de ese tipo, de tipeo, tiene errores de gap,",
        "start": 910.02,
        "end": 916.86
    },
    {
        "text": " tiene errores de ese tipo, no tiene errores matemáticos, por fondo, es un gran libro por eso",
        "start": 916.86,
        "end": 921.4599999999999
    },
    {
        "text": " nos cogimos, pero van a ir limpiando esos detalles sitios, ahora bien, también tiene otras cosas",
        "start": 921.46,
        "end": 929.26
    },
    {
        "text": " que son desloblamientos, lo llamó yo en realidad, y una parece la tomé para el práctico, si se fijan,",
        "start": 929.26,
        "end": 937.38
    },
    {
        "text": " les pido que preguntar si tiene sentido un límite, lo vieron en el ejercicio del límite, bueno,",
        "start": 937.38,
        "end": 944.98
    },
    {
        "text": " eso lo vamos a discutir al lunes, pero vamos a discutir sobre todo de la perspectiva,",
        "start": 945.54,
        "end": 950.58
    },
    {
        "text": " si observan más adelante, aparece en los límites de matrices, en el libro, pero eso está antes,",
        "start": 950.58,
        "end": 958.4200000000001
    },
    {
        "text": " y la idea es esa, plantearnos que el sentido tiene algo del punto de vista intuitivo cuando",
        "start": 958.4200000000001,
        "end": 964.14
    },
    {
        "text": " nadie nos definió antes que era el límite de matriz, pero esa capacidad la tienen,",
        "start": 964.14,
        "end": 968.7
    },
    {
        "text": " en especial los estudiantes y generías, de plantearse situaciones problemáticas en lugares,",
        "start": 969.26,
        "end": 975.5400000000001
    },
    {
        "text": " en espacios que no tienen todas las definiciones armaditas, la repente en facultad,",
        "start": 975.5400000000001,
        "end": 980.82
    },
    {
        "text": " yo he dado en ciencias, clases en ciencias, en el de setuna matica, en el IPA,",
        "start": 980.82,
        "end": 985.62
    },
    {
        "text": " en el Sínces Económica, en el arquivitura, antes también,",
        "start": 985.62,
        "end": 988.22
    },
    {
        "text": " he dado clase en Brasil y en Canadá, lo que quiero decir es, en cada espacio, cada estudiante",
        "start": 988.22,
        "end": 996.58
    },
    {
        "text": " tiene sus cosas buenas y sus cosas notan buenas, el hecho de que ustedes se les he reclamado",
        "start": 997.14,
        "end": 1006.1800000000001
    },
    {
        "text": " varias veces, que no toma nota al suficiente, no habrá que ser lo se reclamado, y que",
        "start": 1006.1800000000001,
        "end": 1010.3000000000001
    },
    {
        "text": " les he reclamado también que no tienen ejercitada la capacidad de traducir lo que tienen",
        "start": 1010.3000000000001,
        "end": 1015.4200000000001
    },
    {
        "text": " acá, que general está bien, con lo que está en el papel que general está mal, cierto,",
        "start": 1015.4200000000001,
        "end": 1019.9000000000001
    },
    {
        "text": " lo han visto en montón de parcis, pero profe, yo quise poner tantas cosas, pero pusiste",
        "start": 1019.9000000000001,
        "end": 1024.6200000000001
    },
    {
        "text": " tal otra, cuantas veces se tuvieron ante esa situación, sin embargo, ahí ha lo muy bueno",
        "start": 1024.62,
        "end": 1032.78
    },
    {
        "text": " que tiene, que tienen dos cosas que les he destacado, primero, el ingenio a la hora de resolver",
        "start": 1032.78,
        "end": 1042.06
    },
    {
        "text": " problemas, aparecen soluciones continuamente en los parciales, exámenes o en el práctico,",
        "start": 1042.06,
        "end": 1048.06
    },
    {
        "text": " soluciones distintas, entre sí, entre ustedes y válidas, por ejemplo, el otro día que",
        "start": 1048.06,
        "end": 1053.82
    },
    {
        "text": " vi en paso, y me dio un era práctico eso, el atheórico, el aptió, ¿no? Y me te",
        "start": 1053.82,
        "end": 1058.7
    },
    {
        "text": " hice una ahí, que es la armamo, la arreglamos, ¿no? y salió adelante, muchas veces hacen",
        "start": 1058.7,
        "end": 1065.58
    },
    {
        "text": " eso ustedes, tienen esa capacidad, y otro punto importante que tiene es el que le está",
        "start": 1065.58,
        "end": 1069.46
    },
    {
        "text": " aquí a su rato, la capacidad de, bueno, no tengo todo esto bien definido, pero no importa,",
        "start": 1069.46,
        "end": 1076.58
    },
    {
        "text": " igualmente me sambulcio y veo como luego yo armando, eso es natural en un tipo que",
        "start": 1077.1399999999999,
        "end": 1084.1
    },
    {
        "text": " va haciendo ingeniería, no tiene todo armadito para seguir adelante cuando sean ingenieros,",
        "start": 1084.1,
        "end": 1089.46
    },
    {
        "text": " ¿no? Así que eso es una capacidad que vamos a explotar también, y eso está en el práctico,",
        "start": 1089.46,
        "end": 1095.82
    },
    {
        "text": " eso aparece en el práctico y va a aparecer varias veces, de plantearnos problemas que después",
        "start": 1095.82,
        "end": 1101.4199999999998
    },
    {
        "text": " en todo caso, porque ahí está mi pecado, que yo sí soy matemático, entonces eso formalizo",
        "start": 1101.42,
        "end": 1106.54
    },
    {
        "text": " las cosas, pero bueno, vamos a tratar de ir jugando con eso, de apostar que ustedes son",
        "start": 1106.54,
        "end": 1112.5
    },
    {
        "text": " capaces de razonar desde esa perspectiva, bueno, muy bien, la demostración de Jordan, pero el cuerpo",
        "start": 1112.5,
        "end": 1120.0600000000002
    },
    {
        "text": " se alcide bien que se raro. Decíamos que esto tiene tres pases, tres etapas,",
        "start": 1120.06,
        "end": 1146.78
    },
    {
        "text": " la tapa uno, la tapa dos, si les voy a comentar en cada tapa, aquí lo que vamos a hacer, la tapa",
        "start": 1147.66,
        "end": 1156.54
    },
    {
        "text": " uno es más bien cortita, las hacemos en 15 minutos, 20, la dos nos va a llevar entre 45 minutos y",
        "start": 1156.54,
        "end": 1165.54
    },
    {
        "text": " una hora y la tres nos va a llevar parte de hoy, parte del marcha, la primera parte de la demostración,",
        "start": 1165.54,
        "end": 1173.5
    },
    {
        "text": " la tapa de la demostración, la primera parte es que vamos a probar que existe un polinomio,",
        "start": 1173.5,
        "end": 1191.26
    },
    {
        "text": " en el cuerpo, claro, en el anicio, en el anicio de polinomio sobre el cuerpo, aquí decir,",
        "start": 1191.26,
        "end": 1203.34
    },
    {
        "text": " tal que para antes de poner la conclusión, recuerden que donde está el parado, nosotros queremos",
        "start": 1205.1,
        "end": 1210.42
    },
    {
        "text": " probar Jordan y qué es Jordan, nosotros tenemos una transformación lineal de DMB o si quieren,",
        "start": 1210.42,
        "end": 1217.66
    },
    {
        "text": " si el contexto que prefieren es este, una matriz, una matriz que te da una transformación",
        "start": 1218.38,
        "end": 1229.28
    },
    {
        "text": " lineal de DMB, yo prefiero una transformación lineal porque nosotros vamos a jugar con las bases,",
        "start": 1229.28,
        "end": 1236.14
    },
    {
        "text": " cuando te dan una matriz, la matriz es porque tenés una transformación lineal con una base",
        "start": 1236.14,
        "end": 1240.8600000000001
    },
    {
        "text": " fijan ahora, pero ya sabemos que dar una transformación y una base de la matriz y tener",
        "start": 1240.86,
        "end": 1247.26
    },
    {
        "text": " la matriz, la suceso y una base, tenés una transformación lineal, si, la suceso",
        "start": 1247.26,
        "end": 1253.1
    },
    {
        "text": " otra base tenés este, digamos, diferentes representaciones de lo mismo, de la misma transformación",
        "start": 1253.1,
        "end": 1260.78
    },
    {
        "text": " bueno, entonces lo primero que vamos a probar es que existe un polinomio tal que se acuerdan que",
        "start": 1261.78,
        "end": 1273.3
    },
    {
        "text": " nosotros salicimos en el ejercicio que Kevin pasó al pizarrón, esta plantidad me practico",
        "start": 1273.3,
        "end": 1279.3
    },
    {
        "text": " uno, ya lo plantíamos incluso en clase antes, nosotros tenemos derecho a los polinomios se",
        "start": 1279.3,
        "end": 1284.7
    },
    {
        "text": " va a eluarlos en las matrices o en las transformaciones señales porque les recuerdo el chiquito, un polinomio,",
        "start": 1284.7,
        "end": 1291.5800000000002
    },
    {
        "text": " pdt que tiene azú, azuerre, teala r más azú uno temas azú 0, así es una forma tan",
        "start": 1291.5800000000002,
        "end": 1308.5800000000002
    },
    {
        "text": " oigan polinomio, entonces yo tengo derecho a decir pdf, ya lo hemos hecho pero va a",
        "start": 1308.58,
        "end": 1314.86
    },
    {
        "text": " ir la pena repasarlo una vez más antes y ya lo han hecho también en galdo seguramente y que era",
        "start": 1314.86,
        "end": 1321.1
    },
    {
        "text": " pdf, bueno sustituir la t por fin, pero ¿qué es eso? sustituir la t por fin, y bueno, tenés",
        "start": 1321.1,
        "end": 1325.06
    },
    {
        "text": " derecho porque vos sabes que la fila puedes multiplicar por fin, o sea azúrre, fíala r tiene sentido",
        "start": 1325.06,
        "end": 1332.3799999999999
    },
    {
        "text": " porque fin por fin por fin, es fin como puesta con fin, como puesta con fin, como puesta con fin,",
        "start": 1333.58,
        "end": 1337.58
    },
    {
        "text": " lo mismo que si en vez de fíbril ha puesto a, ¿no verdad? ya saben, es lo mismo, aporá, aporá, aporá,",
        "start": 1337.58,
        "end": 1342.26
    },
    {
        "text": " y después tengo que multiplicarla por azúrre, azúrre resun número del cuerpo, entonces tengo",
        "start": 1342.26,
        "end": 1348.02
    },
    {
        "text": " derecho, yo sé multiplicar transformaciones señales por número, dos veces la transformación",
        "start": 1348.02,
        "end": 1352.22
    },
    {
        "text": " señal, tres veces la opuesta de la transformación señal, ¿no verdad? y después también se sumar",
        "start": 1352.22,
        "end": 1358.1799999999998
    },
    {
        "text": " transformaciones señales porque todo esto lo hacía ser y se sumar la transformación señal,",
        "start": 1358.1799999999998,
        "end": 1364.1399999999999
    },
    {
        "text": " el asuma de transformación señal, y la última es azúrcero, ¿qué ha suelto? ¿no? ¿cómo dijimos",
        "start": 1364.7,
        "end": 1370.66
    },
    {
        "text": " que reparábamos eso? azúrcero, azúrcero te ha la cero ¿no verdad? entonces acá queda",
        "start": 1370.66,
        "end": 1376.98
    },
    {
        "text": " azúrcero, fíala cero, pero fíala cero es la identidad, o sea, esto es lo mismo que ha",
        "start": 1376.98,
        "end": 1382.6200000000001
    },
    {
        "text": " puesto azúrcero por la matriz identidad o la transformación y la identidad, si estamos como",
        "start": 1382.6200000000001,
        "end": 1388.26
    },
    {
        "text": " a triste la matriz identidad, si estamos contra formación, la transformación y la identidad.",
        "start": 1388.26,
        "end": 1392.06
    },
    {
        "text": " ¿Tabien? Eso quiere decir evaluar una fíjeme y el ejercicio aquí el que pasó,",
        "start": 1393.66,
        "end": 1403.74
    },
    {
        "text": " que vino adelante y después pasó la mi caela era ¿no? y pasó mi caela, jugábamos con",
        "start": 1403.74,
        "end": 1409.9
    },
    {
        "text": " el famoso tenemos a Calijámito, que es nuestro objetivo ¿no? Probable, tenemos a Calijámito,",
        "start": 1409.9,
        "end": 1414.3799999999999
    },
    {
        "text": " que es que el polínio mecárasterístico he valuado en fíjeme, he valuado nada a ser.",
        "start": 1414.38,
        "end": 1423.46
    },
    {
        "text": " Bueno, eso no lo sabemos, eso es el futuro, pero entonces es en la primera parte lo que",
        "start": 1425.6200000000001,
        "end": 1432.0600000000002
    },
    {
        "text": " vamos a probar que existe algún polinomio, se da de este, tal que c da he valuado en fíjeme,",
        "start": 1433.2600000000002,
        "end": 1440.2600000000002
    },
    {
        "text": " el teorema Calijámito te dice que el característico ya vale eso, bueno sí, pero ese teorema todavía",
        "start": 1440.26,
        "end": 1452.74
    },
    {
        "text": " no lo vimos en este curso. Bueno, en la segunda parte de la demostración esto ya les repito,",
        "start": 1452.74,
        "end": 1459.94
    },
    {
        "text": " no nos va a llevar mucho rato, en la segunda parte de la demostración supongamos este polinomio",
        "start": 1459.94,
        "end": 1468.58
    },
    {
        "text": " o cualquier otro, sea ceda, perteneciente a cada ete, el mismo polinomio o cualquier otro que",
        "start": 1468.58,
        "end": 1476.3
    },
    {
        "text": " hayas encontrado tal que ceda de fíjeme, entonces ¿qué pasa? El ceda de fí, pero el ceda de t,",
        "start": 1476.3,
        "end": 1490.9399999999998
    },
    {
        "text": " como polinomio, tiene la expresión T-1, L-1, L-1 por T-2, L-2, L-2, acá lo factorizo todo,",
        "start": 1490.94,
        "end": 1503.98
    },
    {
        "text": " por T-2 me voy a poner la notación yo aquí va a ir, L-1, L-1, lo factorise. Y acá yo mientras agarro el",
        "start": 1503.98,
        "end": 1517.94
    },
    {
        "text": " draipen rojo, este acá y ustedes me van a decir por qué vale es igual, así lo pongo en rojo en el",
        "start": 1517.94,
        "end": 1525.8600000000001
    },
    {
        "text": " pizarro. ¿O ser anicolas, no? Sí, Martín, Nicolas eran, ¿cuál sean los Nicolas y había",
        "start": 1525.8600000000001,
        "end": 1536.74
    },
    {
        "text": " donicolas? Un o Nicolas 2 y ¿vos os vacunan Nicolas? El otro que me quites pa' guanda, me decía",
        "start": 1536.74,
        "end": 1541.74
    },
    {
        "text": " Nicolas, me mataba Nicolas, Nicolas, Nicolas, los tres. A ver, Urises, ya estoy apuntando acá,",
        "start": 1541.74,
        "end": 1549.66
    },
    {
        "text": " ¿por qué vale es igual? ¿Por qué tengo derecho ser esto? Sí señor, acá viene el hipótesis,",
        "start": 1549.66,
        "end": 1559.26
    },
    {
        "text": " si no no tengo derecho a encontrar todas las raíces, y los logramos factorizar todo el polinomio,",
        "start": 1559.26,
        "end": 1564.74
    },
    {
        "text": " decir que logramos factorizar todo, porque estás en los complejos o en algún cuerpo al",
        "start": 1564.74,
        "end": 1569.28
    },
    {
        "text": " que le da el caminete cerrado. Y vuelvo a decir, x4 más 1, los reales no pueden factorizar.",
        "start": 1569.28,
        "end": 1574.72
    },
    {
        "text": " Es ejemplo, lo tenemos que tener siempre para recordar. Entonces acá, este UC, que es al",
        "start": 1574.72,
        "end": 1585.72
    },
    {
        "text": " que le da el caminete cerrado para factorizar completamente ese polinomio. ¿Quién es ese",
        "start": 1585.72,
        "end": 1589.48
    },
    {
        "text": " polinomio cualquiera que el que está en la parte 1 o cualquiera de ustedes se encuentren,",
        "start": 1589.48,
        "end": 1594.16
    },
    {
        "text": " que anula al operador figa, la transformación ni al fi. Entonces, ah, perdón, y en esta",
        "start": 1594.16,
        "end": 1602.8000000000002
    },
    {
        "text": " expresión vale la pena, estamos poniendo el amdaíxito, el amdajota cuando distinto",
        "start": 1602.8000000000002,
        "end": 1607.7
    },
    {
        "text": " ajota. ¿Se acuerdan que cuando ponemos este así con exponentes es que todos los",
        "start": 1607.7,
        "end": 1611.5600000000002
    },
    {
        "text": " amdaíxos son distintos, ¿no? ¿Verdad? Eso es lo típico, también la sien en galdozo. Y entonces",
        "start": 1611.5600000000002,
        "end": 1617.68
    },
    {
        "text": " aquí probaremos acá con esta notación. Vamos a probar dentro de dos, dos pasos. Vamos",
        "start": 1617.68,
        "end": 1624.96
    },
    {
        "text": " a probar que el espacio vectorial v es el del dominio o del condomio como quieran, el",
        "start": 1624.96,
        "end": 1630.76
    },
    {
        "text": " lo mismo. Recuerden que la matriz es que estamos trabajando son cuadradas, estamos pensando",
        "start": 1630.76,
        "end": 1637.04
    },
    {
        "text": " en un modelo típico, matriz es cuadrado que va de bien bebo. Nimporta si es v, doble",
        "start": 1637.04,
        "end": 1642.24
    },
    {
        "text": " v, si es donde son el somorfo como espacio vectorial porque tienen la misma dimensión son el",
        "start": 1642.24,
        "end": 1646.1200000000001
    },
    {
        "text": " somorfo, entonces pongamos de bien be. Entonces vamos a probar que el espacio vectorial",
        "start": 1646.12,
        "end": 1653.8799999999999
    },
    {
        "text": " v se escribe como la suma directa de varios espacios vectoriales.",
        "start": 1653.88,
        "end": 1682.0
    },
    {
        "text": " No de apoco como en el interior de la notación, no hay apuros, yo quiero que nadie se me pierdan,",
        "start": 1682.0,
        "end": 1686.84
    },
    {
        "text": " entonces vamos a apoco. ¿Qué puso el profe ahí?",
        "start": 1686.84,
        "end": 1694.6
    },
    {
        "text": " Mejan corregir una cosita nada más acá, vamos a ponerle así cuando es de transformación",
        "start": 1694.6,
        "end": 1702.24
    },
    {
        "text": " al inal y en masúscula con el matriz, simple convención que apague en los libros al revetro,",
        "start": 1702.24,
        "end": 1707.84
    },
    {
        "text": " vamos a una convención para, bueno, ¿qué dice acá? Primero que se acuerdan que era",
        "start": 1707.84,
        "end": 1715.26
    },
    {
        "text": " el chirimolo suma directa, a ver, quien nos recuerda al resto de los compañeros que",
        "start": 1715.26,
        "end": 1720.6399999999999
    },
    {
        "text": " era el chirimolo, ¿qué quería decir? Por ejemplo que v era doble más z, en ese caso, ¿qué",
        "start": 1720.6399999999999,
        "end": 1729.6999999999998
    },
    {
        "text": " quería decir que v se escribía como doble suma directa z?",
        "start": 1729.6999999999998,
        "end": 1732.9199999999998
    },
    {
        "text": " Wb intercisión z es el 0, o sea, podemos poner así si quieren, para que quede bien explícito.",
        "start": 1737.84,
        "end": 1750.9199999999998
    },
    {
        "text": " ¿Y qué más? Esas es una forma, la definición original probablemente sea otra, pero es ese",
        "start": 1750.9199999999998,
        "end": 1759.56
    },
    {
        "text": " equivalente. ¿Se puede poner así? Si en el chirimolo o sea todo vector de v, lo que dijo",
        "start": 1759.56,
        "end": 1777.32
    },
    {
        "text": " el compañero, todo vector de v es un vector doble más o un vector de z, ¿no? O lo que dijo",
        "start": 1777.32,
        "end": 1783.36
    },
    {
        "text": " el compañero era otra forma es si tenésse a que la intercisión es solo el vector nulo",
        "start": 1783.36,
        "end": 1788.84
    },
    {
        "text": " y la suma de las dimensiones, este da todo es equivalente. ¿Són equivalencias? Lo que",
        "start": 1788.84,
        "end": 1795.84
    },
    {
        "text": " te está diciendo en suma directa es que toda la información de v se reparte entre doble",
        "start": 1795.84,
        "end": 1801.6799999999998
    },
    {
        "text": " z y entre lo do recograste la información. Lo típico, en el R3, el espacio R3, si tenés",
        "start": 1801.6799999999998,
        "end": 1809.84
    },
    {
        "text": " el plano, podría ser doble, una recta perpendicular, podría ser z, la suma directa da todo el",
        "start": 1809.84,
        "end": 1817.74
    },
    {
        "text": " espacio, un plano y una recta, eso es lo típico, el típico modelo para recordar que",
        "start": 1817.74,
        "end": 1823.94
    },
    {
        "text": " es esto de la suma directa. Y acá es lo que se está diciendo, es que el espacio vectorial",
        "start": 1823.94,
        "end": 1832.46
    },
    {
        "text": " se va a escribir como suma directa de estos espacios vectoriales, no suma directa de dos",
        "start": 1832.46,
        "end": 1838.18
    },
    {
        "text": " sino de varios, muy bien. ¿Y quiénes son esos espacios vectoriales? Son núcleos, que",
        "start": 1838.18,
        "end": 1842.78
    },
    {
        "text": " es el que arne, que arne, que arne son dos núcleos, núcleos, núcleos de quién, bueno,",
        "start": 1842.78,
        "end": 1847.3799999999999
    },
    {
        "text": " veamos uno, agarras la phi, que es la transformación lineal, le restas la identidad, la transformación",
        "start": 1847.3799999999999,
        "end": 1855.18
    },
    {
        "text": " lineal identidad pero multiplicada por lambda 1, este, esta raíz, o después lo mismo",
        "start": 1855.18,
        "end": 1861.86
    },
    {
        "text": " con la, y además acá el n1 aquí en afecta, al operador, o sea esto vendría a ser si",
        "start": 1861.86,
        "end": 1868.5
    },
    {
        "text": " soy súper prolijo, el kernel de todo esto, ¿sí entiende? El kernel de la transformación",
        "start": 1868.5,
        "end": 1876.18
    },
    {
        "text": " lineal que es fí, menos lambda 1 por la identidad elevado a la n1, o sea compuesta",
        "start": 1876.18,
        "end": 1882.5
    },
    {
        "text": " consigo mismo en una vez. Quiero claro, lo mismo, lo mismo para todos esto, si miran",
        "start": 1882.5,
        "end": 1893.14
    },
    {
        "text": " bien es como que puse la fía acá, ¿no verdad? Y el por los por se transformaron en su",
        "start": 1893.14,
        "end": 1898.7800000000002
    },
    {
        "text": " madiré, ¿no? Tome el kernel, el kernel que anel, los por se transformaron en su madiré.",
        "start": 1898.7800000000002,
        "end": 1905.46
    },
    {
        "text": " Vamos a probar eso a partir de este dato y lo otro que vamos a probar entre V y que es",
        "start": 1905.46,
        "end": 1912.98
    },
    {
        "text": " cada espacio, vamos a llamar a estos espacios, V1, V2, Vs, este de aquí, si llama V1 y",
        "start": 1912.98,
        "end": 1927.58
    },
    {
        "text": " V2, V2, V1, V2, V2, Vs, entonces la parte V dice que cada espacio, V2, o sea el kernel",
        "start": 1927.58,
        "end": 1949.1399999999999
    },
    {
        "text": " de fí, menos lambda y por la identidad a la n1, cada espacio de esto es fí invariante.",
        "start": 1949.14,
        "end": 1963.14
    },
    {
        "text": " Ahora escribo lo que quiere decir fí invariante, pero estoy seguro que algunos ya se dio cuenta",
        "start": 1963.14,
        "end": 1968.6200000000001
    },
    {
        "text": " que quiere decir, o sea recuerda porque lo definió en el N2, seguramente, ¿qué quiere",
        "start": 1968.6200000000001,
        "end": 1973.2
    },
    {
        "text": " decir fí invariante? La fíba de Vmb, Vs, Vs es un pedazo de V, termina siendo un sumando",
        "start": 1973.2,
        "end": 1984.3600000000001
    },
    {
        "text": " directo, ¿no verdad? Pero en principio es un sub espacio vectorial, ¿qué quiere decir",
        "start": 1984.3600000000001,
        "end": 1991.6000000000001
    },
    {
        "text": " que se ha fí invariante? Es exactamente eso es glorioso porque si vuelo",
        "start": 1991.6000000000001,
        "end": 2002.8
    },
    {
        "text": " gracias a esas cosas, o sea que fí va de Vs, Vs, Vs, cuando la restringís a Vs, si fíla",
        "start": 2002.8,
        "end": 2011.28
    },
    {
        "text": " restringís a Vs, va de Vs, Vs y por qué es glorioso eso? Porque hubiese pensémos juntos,",
        "start": 2011.28,
        "end": 2019.9199999999998
    },
    {
        "text": " si vos tenés la matriz asociada y vos se, la transformación lineal, en cada bloque va",
        "start": 2019.9199999999998,
        "end": 2027.48
    },
    {
        "text": " para dar a sí mismo, ¿sí? Y armás una base, una base de acá, se acuerda como el",
        "start": 2027.48,
        "end": 2034.84
    },
    {
        "text": " lo espacio vectorial, como se llamaba la base con la suma directa, pues armabas una base",
        "start": 2034.84,
        "end": 2038.96
    },
    {
        "text": " de acá, armabas una base de acá y después tomabas la base de V como todo el pedazo de base",
        "start": 2038.96,
        "end": 2045.92
    },
    {
        "text": " total ¿no verdad? Entonces, vos armás una base de acá, una base de acá, una base de acá,",
        "start": 2045.92,
        "end": 2051.36
    },
    {
        "text": " y resulta que la transformación lineal, la transformación lineal F esta parte se mete",
        "start": 2051.36,
        "end": 2058.76
    },
    {
        "text": " con sí mismo, esta parte se mete con sí mismo, esta parte se mete con sí mismo. Entonces,",
        "start": 2058.76,
        "end": 2064.1200000000003
    },
    {
        "text": " como te queda la matriz asociada, en esa base imaginaria que estamos, ¿cómo te queda",
        "start": 2064.1200000000003,
        "end": 2071.88
    },
    {
        "text": " esa matriz? ¿Qué va a quedar así? Acá va a de vez uno, en vez uno, acá va a de vez",
        "start": 2071.88,
        "end": 2086.6
    },
    {
        "text": " dos la base, ¿no? Habría que poner la base, yo estoy poniendo todo a vez dos, ustedes saben",
        "start": 2086.6,
        "end": 2091.7200000000003
    },
    {
        "text": " que para armar las matrices se necesiten la base, pero no la tengo escrita, entonces la base",
        "start": 2091.7200000000003,
        "end": 2096.6
    },
    {
        "text": " va de acá y el resto cero, porque estamos diciendo y acá va acá y entonces, etcétera,",
        "start": 2096.6,
        "end": 2103.16
    },
    {
        "text": " ¿no verdad? Y el resto cero, estremendo bolazo esta información, esto que nos dijo",
        "start": 2103.16,
        "end": 2109.3199999999997
    },
    {
        "text": " la compañera estremendo bolazo si lo logramos, porque la matriz se te descompone totalmente",
        "start": 2109.3199999999997,
        "end": 2115.24
    },
    {
        "text": " y nosotros no sabemos que la matriz se desjordan, tenieros de ese formato, o sea,",
        "start": 2115.24,
        "end": 2119.04
    },
    {
        "text": " cuándo que así las definimos con los bloque, ahí se están apareciendo en los bloque de",
        "start": 2119.04,
        "end": 2123.2
    },
    {
        "text": " yjordan, ahí están apareciendo en los bloque de yj, pero si esto, esto es un golazo,",
        "start": 2123.2,
        "end": 2128.8799999999997
    },
    {
        "text": " porque realmente se para los mundos, de vez uno en vez uno, de vez dos en vez uno, de vez",
        "start": 2128.8799999999997,
        "end": 2135.4399999999996
    },
    {
        "text": " uno, ¿qué más quiere? Bueno, bien, y no falta decir cuál va a ser el tercer paso, ¿no?",
        "start": 2135.4399999999996,
        "end": 2146.8799999999997
    },
    {
        "text": " El tercer paso que va a ser el más de cuentas, ¿sí? Se analiza para cerrar toda la",
        "start": 2146.88,
        "end": 2159.84
    },
    {
        "text": " demostración, se analiza el caso finil potente para cerrar la demostración.",
        "start": 2159.84,
        "end": 2182.28
    },
    {
        "text": " Pero para repasar a Sara no vino la última clase, ¿qué era你 el potente? ¿Cómo era",
        "start": 2182.7400000000002,
        "end": 2190.1600000000003
    },
    {
        "text": " tu nombre? Acan, ¿ Haven't you heard about this satellite?",
        "start": 2190.1600000000003,
        "end": 2194.32
    },
    {
        "text": " casi si viene el tema clases, con tal la zara que era ni el potente.",
        "start": 2194.32,
        "end": 2201.32
    },
    {
        "text": " Ahí va y en vez de A es para FI una transformación ideal, FIA a S o sea que en algún momento",
        "start": 2201.32,
        "end": 2213.6800000000003
    },
    {
        "text": " esa transformación ideal sea cero, componiéndola consigo misma ¿no? Va de BnB, de BnB, de BnB,",
        "start": 2213.6800000000003,
        "end": 2219.7400000000002
    },
    {
        "text": " y en un momento ese es el cero, la componiera componer como nesta. A veces sucede a veces, no,",
        "start": 2220.74,
        "end": 2227.58
    },
    {
        "text": " toda la transformación ideal es unir potente, a veces sí, a veces no.",
        "start": 2227.58,
        "end": 2232.54
    },
    {
        "text": " Este, muy bien.",
        "start": 2232.54,
        "end": 2237.74
    },
    {
        "text": " Bueno, estos son los tres pasos de la demostración, pienos que lo estoy tomando con karma, lo",
        "start": 2237.74,
        "end": 2246.4399999999996
    },
    {
        "text": " estoy haciendo despacito para que nadie se me pierda. Vamos a arrancar con el paso 1, voy",
        "start": 2246.44,
        "end": 2251.36
    },
    {
        "text": " a borrar el pizarro y vamos a arrancar con el paso 1 que es el más sencillo. Lo que nosotros",
        "start": 2251.36,
        "end": 2258.6
    },
    {
        "text": " tenemos es una transformación ideal de BnB, con un cuerpo, estamos trabajando con cuerpo",
        "start": 2258.6,
        "end": 2265.0
    },
    {
        "text": " se agilará que se arra. Borro 2 y 3, dejo 1 es mi próximo objetivo.",
        "start": 2265.0,
        "end": 2272.0
    },
    {
        "text": " Bien, entonces, la demostración de 1, que tenemos que probar que existe algún polinomio",
        "start": 2295.0,
        "end": 2314.16
    },
    {
        "text": " en importe si es muy grande, de tal manera que anula la transformación ideal. Y esto no",
        "start": 2314.16,
        "end": 2321.72
    },
    {
        "text": " es tan difícil. No sólo estamos trabajando con un espacio vectorial de emisión finita,",
        "start": 2321.72,
        "end": 2330.7999999999997
    },
    {
        "text": " se puede trabajar con un espacio vectorial de emisión finita, sí, pero no es el objetivo",
        "start": 2330.7999999999997,
        "end": 2334.48
    },
    {
        "text": " del curso. El espacio vectorial B que estamos trabajando tiene emisión finita N, finita,",
        "start": 2334.48,
        "end": 2343.8799999999997
    },
    {
        "text": " un número finita. Creo que en Algebra Nial 2, en Galdos, ustedes lo llamaban así,",
        "start": 2343.88,
        "end": 2352.36
    },
    {
        "text": " corríjame, LDB, Pueser, esta notación, tiene sentido para ustedes. Las transformaciones",
        "start": 2352.36,
        "end": 2360.56
    },
    {
        "text": " de Nial de BnB, cómo les escribían? Operadores de BnB, yo lo se ve a llamar así,",
        "start": 2360.56,
        "end": 2371.4
    },
    {
        "text": " Home, su ca de BnB, pero no sé qué notación se van en Galdos. Le protea Marcoperes que",
        "start": 2371.4,
        "end": 2378.52
    },
    {
        "text": " estuvo dando balón, pero no sé, usemos esta, Home de ca, son las transformaciones",
        "start": 2378.52,
        "end": 2387.16
    },
    {
        "text": " de Niales, el conjunto de las transformaciones, Línaes, DBnB. Así, capazes de la reconocer,",
        "start": 2387.16,
        "end": 2402.3199999999997
    },
    {
        "text": " así, LDB, la transformación de Nial de BnB con L no era, ¿no? T, T grande, así, así,",
        "start": 2402.3199999999997,
        "end": 2411.68
    },
    {
        "text": " todo. No, no, esa sería una, estas una, estas una de todas, ¿no?",
        "start": 2411.68,
        "end": 2422.2799999999997
    },
    {
        "text": " El, ¿no? Ay, va, a mí me dijo Marcoperes que se usaba LD, pero los libros van cambiando,",
        "start": 2422.2799999999997,
        "end": 2429.3599999999997
    },
    {
        "text": " entonces, nosotros vamos a usar este, si quieren le pongo acá por las dudas para los que",
        "start": 2429.3599999999997,
        "end": 2437.12
    },
    {
        "text": " vayan al libro Rojo y vean, creo que se usaba LDB, todas las transformaciones Niales",
        "start": 2437.12,
        "end": 2442.4
    },
    {
        "text": " de BnB, ahí estas F, perdón, perdón, de BnB en este caso, nosotros no queremos de BnB,",
        "start": 2442.4,
        "end": 2453.2799999999997
    },
    {
        "text": " no de BnB, de BnC, aca estas F y están todas las que van de B, ahora bien, pregun, de",
        "start": 2453.2799999999997,
        "end": 2462.56
    },
    {
        "text": " ver si estudiaron, sí, ¿jom? Este, OM, ¿por qué ese esto vale la pena? Me detengo un",
        "start": 2462.56,
        "end": 2472.16
    },
    {
        "text": " poquito, yo sí que a veces los hago un poquito, pero ¿por qué, ¿jom? Home es de, Home es",
        "start": 2472.16,
        "end": 2480.88
    },
    {
        "text": " de, Homemorphismos, ¿ta? Y los somos morphismos, ven�ianos a hacer este, las transformaciones Niales,",
        "start": 2480.88,
        "end": 2496.0
    },
    {
        "text": " no voy a ocurrir, ¿no? Porque claro, es realidad, pues tenés la categoría de, de, de, de, de,",
        "start": 2496.0,
        "end": 2501.56
    },
    {
        "text": " de, de, de las espacios vectoriales, y de transformaciones Niales, o tenés, si te vas para",
        "start": 2501.56,
        "end": 2505.36
    },
    {
        "text": " otro lado, tenés otras categorías, está lleno, vieron que les dije hace un rato que las",
        "start": 2505.36,
        "end": 2510.1
    },
    {
        "text": " la demostración del tema general de Jordans se hace con módulos, usando teoría de módulos,",
        "start": 2510.1,
        "end": 2515.74
    },
    {
        "text": " la categoría de módulos es otra categoría y tiene sus morfismos, ¿verdad? Entonces",
        "start": 2515.74,
        "end": 2520.98
    },
    {
        "text": " y tenés a ver ustedes conozco en otra, creo que sí, no me decueta, hay muchas que los",
        "start": 2520.98,
        "end": 2531.62
    },
    {
        "text": " grafos van a aparecer en el capítulo 5, capaz que se lo vieron en discreta 1, grafos,",
        "start": 2531.62,
        "end": 2537.58
    },
    {
        "text": " la categoría de los grafos tiene sus transformaciones, que son los morfimos grafos, se",
        "start": 2537.58,
        "end": 2541.54
    },
    {
        "text": " acuerdan los morfimos grafos y bueno entonces cada categoría tiene sus morfismos y esta",
        "start": 2541.54,
        "end": 2547.06
    },
    {
        "text": " la notación general de Home es los morfimos en esa categoría, ¿por qué es un K? Porque",
        "start": 2547.06,
        "end": 2552.9
    },
    {
        "text": " son transformaciones lineales bajo el cuerpo K, usando K, los coeficientes en K. Ahora viene",
        "start": 2552.9,
        "end": 2560.2999999999997
    },
    {
        "text": " la pregunta al millón a ver quién se acuerda de Galdos, mira, ya está todo pronto a",
        "start": 2560.2999999999997,
        "end": 2566.74
    },
    {
        "text": " cada plato, la dimensión de BSN, esto, primera pregunta, esto, ¿qué estructura tenía?",
        "start": 2566.74,
        "end": 2579.66
    },
    {
        "text": " ¿Quién se acuerda? Este conjunto, por principio es un conjunto, ¿qué estructura tenía?",
        "start": 2579.66,
        "end": 2589.2599999999998
    },
    {
        "text": " ¿Quién se acuerda de Galdos? ¿Qué estructura tenía? ¿Qué estructura tenía?",
        "start": 2589.26,
        "end": 2603.1400000000003
    },
    {
        "text": " Era un espacio vectorial y ahí viene la pregunta, ¿si este tenía dimensión N? ¿Este",
        "start": 2603.1400000000003,
        "end": 2608.0200000000004
    },
    {
        "text": " dimensión tenía? N cuadrado, N cuadrado, ¿si acuerdan eso? Bien, de hecho ahora que",
        "start": 2608.02,
        "end": 2632.06
    },
    {
        "text": " recuerdo, esto no llega el 2, esto es de Galuno, sí porque si vos tenés que esto espacio",
        "start": 2632.06,
        "end": 2638.86
    },
    {
        "text": " tiene dimensión N, ¿qué es dar una transformación lineal de BNB? No es dar la base, ponerle que",
        "start": 2638.86,
        "end": 2647.7799999999997
    },
    {
        "text": " la base esta fija, la base esta fija, ¿no? Ahora, ponerle fija para no complicado, ¿qué",
        "start": 2647.7799999999997,
        "end": 2653.02
    },
    {
        "text": " es dar la transformación N, es dar que? La matriz, la matriz, ¿cuántos abujeritos",
        "start": 2653.02,
        "end": 2657.62
    },
    {
        "text": " tienes? N por N, ¿eh? N cuadrado, ¿cá? En cada lugar vos podés poner un elemento del cuerpo",
        "start": 2657.62,
        "end": 2664.9
    },
    {
        "text": " distinto, ¿si acuerdan? Esa era el definitiva, la, todo el trabajo que hicieron. Cada cuadradito",
        "start": 2664.9,
        "end": 2675.74
    },
    {
        "text": " es un grado de libertad y terminas probando que todas las matrices forman el definitiva",
        "start": 2675.74,
        "end": 2679.8199999999997
    },
    {
        "text": " todas las transformaciones y ale de BNB, ¿qué es lo que tienes que ir haciendo cambiando?",
        "start": 2679.8199999999997,
        "end": 2686.1
    },
    {
        "text": " La base fija, ¿no? Para no complicado la historia, ¿qué es lo que vas haciendo? Es",
        "start": 2686.1,
        "end": 2689.36
    },
    {
        "text": " que cambiarle un numerito y tienes otra transformación lineal, el definitiva es eso, está",
        "start": 2689.36,
        "end": 2694.2599999999998
    },
    {
        "text": " claro, muy bien, con esto ya tenemos pronto el, el, el, el es piedo para, para probar",
        "start": 2694.2599999999998,
        "end": 2702.08
    },
    {
        "text": " que existe un polinomio, ¿por qué gurises? Resulta que ceda es una, perdón, que fí, es",
        "start": 2702.08,
        "end": 2710.2
    },
    {
        "text": " una transformación lineal acá, ¿cierto? Es una, entonces tenés, mira, fíela cero,",
        "start": 2710.2,
        "end": 2722.2799999999997
    },
    {
        "text": " que es la identidad, fíela 1, que es fí y después ya me dejo de complicar, fí",
        "start": 2722.2799999999997,
        "end": 2729.58
    },
    {
        "text": " al cuadrado, fí al cubo, fí a la cuarta y ya alguno está voliendo por ahí, allá el",
        "start": 2729.58,
        "end": 2739.96
    },
    {
        "text": " compañero al fondo, como te llamaba bol, bol, ¿no entén es más? ¿Sí? Mateo, ¿hasta",
        "start": 2739.96,
        "end": 2746.0
    },
    {
        "text": " dónde voy a seguir con esto? Un poquito más, hay cuadrado, hasta fí a la N cuadrado",
        "start": 2746.0,
        "end": 2757.64
    },
    {
        "text": " y ¿por qué voy a tomar este como junto? ¿qué son todas estas? Fíes una, pero todas",
        "start": 2757.64,
        "end": 2763.92
    },
    {
        "text": " las más son transformaciones lineales también, le ponemos ahí abajo, ¿no verdad? Eso de que",
        "start": 2763.92,
        "end": 2768.16
    },
    {
        "text": " hay que notar a ver si lo quise el profe, todas las zetas son transformaciones lineales",
        "start": 2768.16,
        "end": 2772.0
    },
    {
        "text": " de bnb, porque fí cuadrado es fí y compuesta con fí, fí al cubo, fí y compuesta con fí",
        "start": 2772.0,
        "end": 2777.24
    },
    {
        "text": " y compuesta con fí, de bnb, entonces la compañera que está al lado inicuela, ¿cómo era?",
        "start": 2777.24,
        "end": 2786.04
    },
    {
        "text": " Lucia, ¿cómo es este conjunto? Mira bien cuánto elementos tiene Lucia.",
        "start": 2786.04,
        "end": 2792.12
    },
    {
        "text": " ¿Cuántos elementos tiene? Hay va, uno más y cuál es la dimensión del espacio. Entonces,",
        "start": 2792.12,
        "end": 2810.3599999999997
    },
    {
        "text": " como es el conjunto, todo conjunto con más victores que la dimensión como es. El de",
        "start": 2810.3599999999997,
        "end": 2817.6
    },
    {
        "text": " voalá, pero anda volando mucha. Ld, ¿qué quiere decir que sea le de? Entonces, existe",
        "start": 2817.6,
        "end": 2829.6
    },
    {
        "text": " una combinación lineal, queda 0, queda la transformación lineal 0, ¿no trivial? Una",
        "start": 2829.6,
        "end": 2847.7599999999998
    },
    {
        "text": " combinación lineal no trivial, decir no trivial es decir que alguna subdistinto de 0. Tanda",
        "start": 2847.7599999999998,
        "end": 2855.4
    },
    {
        "text": " ¿cuándo acuerdan, verdad? Tanda, ¿cuándo acuerdan, eso? Tú de donde sos que no me acuerdo",
        "start": 2855.4,
        "end": 2869.2400000000002
    },
    {
        "text": " de qué origen, ¿sí? ¿De ver sola? ¿Está acumando a tu nombre? Gabriel. Gabriel, yo digo",
        "start": 2869.2400000000002,
        "end": 2880.84
    },
    {
        "text": " que el polinomio ya está adelante de nuestras narices, este polinomio, el que queremos,",
        "start": 2880.84,
        "end": 2886.6800000000003
    },
    {
        "text": " ¿quién es ese polinomio que estamos buscando? Queremos un polinomio que evaluamos fíjede",
        "start": 2886.6800000000003,
        "end": 2892.2000000000003
    },
    {
        "text": " 0. Gabriel, ese cae de maduro, el polinomio ya está. ¿Pero en vez de fíjede tener que poner?",
        "start": 2892.2,
        "end": 2913.24
    },
    {
        "text": " Claro, ya está, ahí tenés el polinomio, entonces considero cedad de t igual a su matoria",
        "start": 2913.24,
        "end": 2926.7999999999997
    },
    {
        "text": " desde igual cero, hay enecuadrado de a su y, por ti a la y, pronto. Ceda, ponga, no,",
        "start": 2926.7999999999997,
        "end": 2939.52
    },
    {
        "text": " otra pongan delta, si pongan las que quieran, pongan las que, pero siempre la misma, pues",
        "start": 2939.52,
        "end": 2945.64
    },
    {
        "text": " mantenga la misma, pongan rosa, si quieren las que les salga, landa, muna, que du claro,",
        "start": 2945.64,
        "end": 2954.64
    },
    {
        "text": " eso te tomás este polinomio, este polinomio es un polinomio, no es un polinomio trivial,",
        "start": 2954.64,
        "end": 2959.7599999999998
    },
    {
        "text": " ¿por qué no es un polinomio trivial? Porque tiene coeficiente, ¿por qué? Porque esta era",
        "start": 2959.7599999999998,
        "end": 2964.32
    },
    {
        "text": " una combinación que no era trivial, o sea hay alguna su distinto de cero, es un polinomio",
        "start": 2964.32,
        "end": 2968.56
    },
    {
        "text": " no trivial. Bien, y ese polinomio, si le evaluas en fíjede 0, si de ahí lo encontramos",
        "start": 2968.56,
        "end": 2974.36
    },
    {
        "text": " el polinomio, es un polinomio que está en cae de t, ¿por qué? Todos los coeficiente",
        "start": 2974.36,
        "end": 2980.8
    },
    {
        "text": " se están en cae, que si le evaluas en fíjede 0, ese polinomio que está buscando, se terminó,",
        "start": 2980.8,
        "end": 2989.7200000000003
    },
    {
        "text": " ¿por qué no estuvo el truco? En tomar composiciones hasta pasarnos del árbode, la dimensión",
        "start": 2989.72,
        "end": 2995.7599999999998
    },
    {
        "text": " del espacio interior donde estás, toma fíjero, fíjede 0, fíjede 1, fíjede 3, fíjede",
        "start": 2995.7599999999998,
        "end": 3000.02
    },
    {
        "text": " 4, me pase del árbode, a ese le da una combinación y hace el término, ahí está el polinomio,",
        "start": 3000.02,
        "end": 3006.14
    },
    {
        "text": " podríamos haber encontrado otro, probablemente podemos encontrar de muchas maneras,",
        "start": 3006.14,
        "end": 3010.08
    },
    {
        "text": " pero ahí hay uno, queda la primera parte de la demostración, nos pide encontrar un polinomio",
        "start": 3010.08,
        "end": 3013.9399999999996
    },
    {
        "text": " que evaluado en FIDACER. Fíjense cómo la empieza la teoría en samplarse, que la dimensión,",
        "start": 3013.94,
        "end": 3022.58
    },
    {
        "text": " la dimensión cuadrado, que PIK, entonces, de pasarse el ED, sermoso como empieza a enzambrarse",
        "start": 3022.58,
        "end": 3028.2000000000003
    },
    {
        "text": " todos los resultados, para ir encontrando las demostraciones. Punto 1 ya está pronto,",
        "start": 3028.2000000000003,
        "end": 3034.2200000000003
    },
    {
        "text": " vamos al 2, Nico.",
        "start": 3034.22,
        "end": 3037.2999999999997
    },
    {
        "text": " No lo he logrado de la dimensión. Sí. ¿Se lo pueden hacer con la base de ED?",
        "start": 3037.2999999999997,
        "end": 3042.8599999999997
    },
    {
        "text": " Sí, poner el ED, un ED FIDACER. ¿Qué significa que la dimensión de todo la samplarse",
        "start": 3042.8599999999997,
        "end": 3050.3399999999997
    },
    {
        "text": " de ED, el ED, que hay que poner el cuadrado de todo? Quiere decir que hay ED cuadrado",
        "start": 3050.3399999999997,
        "end": 3055.4599999999996
    },
    {
        "text": " de libertad, pero pensarlo así, acordate que si tienes un espacio de dimensión ED,",
        "start": 3055.4599999999996,
        "end": 3061.2999999999997
    },
    {
        "text": " si gasto una base, fija una base de N vector, pero ya fija, fija. Entonces, dar una transformación",
        "start": 3061.3,
        "end": 3069.02
    },
    {
        "text": " lineal, no le va a llamar FID porque esta es la FIDACER, pero dar una transformación",
        "start": 3069.02,
        "end": 3073.82
    },
    {
        "text": " lineal cualquiera de NB, ya tienes una base fija, es lo mismo que dar que una matriz,",
        "start": 3073.82,
        "end": 3085.98
    },
    {
        "text": " es la transformación en esa base, ¿no verdad? ¿Cuántas matrices puedes elegir? Porque la",
        "start": 3085.98,
        "end": 3093.7400000000002
    },
    {
        "text": " matriz es a la que tamaño va a ser. Va a ser N, en el por N, ¿cuántas matrices",
        "start": 3093.7400000000002,
        "end": 3100.58
    },
    {
        "text": " tenés? N por N, en el cuadrado. O sea, la cantidad de posibilidades, ahí está de acuerdo",
        "start": 3100.58,
        "end": 3109.3
    },
    {
        "text": " que son todas las transformaciones señales. Cada transformación señal tiene una matriz,",
        "start": 3109.3,
        "end": 3113.38
    },
    {
        "text": " también este matriz tiene una base fija, ¿no verdad? Tiene una transformación señal y",
        "start": 3113.38,
        "end": 3119.5
    },
    {
        "text": " entonces es la forma de producir toda la transformación lineal, toda la matriz es posible",
        "start": 3119.5,
        "end": 3124.94
    },
    {
        "text": " y una vez más perdón con la base fija. Si entramos en model la base, ahí tenemos otro",
        "start": 3124.94,
        "end": 3129.9
    },
    {
        "text": " juego posible que se quita más y no hay el principio del curso, la P, P, la menos 1,",
        "start": 3129.9,
        "end": 3134.6600000000003
    },
    {
        "text": " la matriz es C, C, M, J, etc. ¿Y acuerdas con esto? Bien, nos vamos a 2, ¿cómo estamos",
        "start": 3134.66,
        "end": 3143.8199999999997
    },
    {
        "text": " de tiempo? Tenemos 20 minutos, le vamos a usar los 22 minutos.",
        "start": 3143.82,
        "end": 3150.82
    },
    {
        "text": " Javel un subdulezo lo quefahren por BE può sin duda, para que se ponen un seen. O sea,",
        "start": 3173.82,
        "end": 3200.82
    },
    {
        "text": " Fía el cuadrado, hasta Fía el cuadrado era un subconjunto del conjunto de todas. Es un",
        "start": 3200.82,
        "end": 3212.9
    },
    {
        "text": " subconjunto del conjunto de todas. Pero como este tiene dimensión, dimensión es",
        "start": 3212.9,
        "end": 3221.02
    },
    {
        "text": " en el cuadrado y acá me pase, tengo el cuadrado más 1, entonces este es el edad. ¿Acuerdado?",
        "start": 3221.02,
        "end": 3228.78
    },
    {
        "text": " Mi nombre es que me gusta que fue más diferente. Mi importa, sí son diferentes. ¿Por qué si no",
        "start": 3228.78,
        "end": 3237.14
    },
    {
        "text": " son diferentes? Ya igual a la otra ya tienes un polínomio. O sea, poner ese Fía el ahí",
        "start": 3237.14,
        "end": 3244.14
    },
    {
        "text": " sigue, te queda idéntica, a Fía la J, ahí ya tenés el polínomio. Te alai menos te alajote",
        "start": 3244.14,
        "end": 3254.06
    },
    {
        "text": " igual cero y eso se tiene. O sea, de hecho, formalmente lo que me acabe, como era tu nombre",
        "start": 3254.06,
        "end": 3264.06
    },
    {
        "text": " que me acuerdo, Nicolás, lo que me acaba de hacer notar Nicolás es un detalle súper delicado",
        "start": 3264.06,
        "end": 3269.46
    },
    {
        "text": " de matemática que tiene razón, que yo debería ver escrito así. En vez de así, así.",
        "start": 3269.46,
        "end": 3274.82
    },
    {
        "text": " Ya os cuenta, porque él me dice, ¿quién te dijo que tenés en el cuadrado más un elemento",
        "start": 3274.82,
        "end": 3281.14
    },
    {
        "text": " o se haya dentro si en un cojo junto las repeticiones no se cuentan? Acá sí, se cuentan",
        "start": 3281.14,
        "end": 3287.2200000000003
    },
    {
        "text": " porque este es el vector ordenado de todas. Entonces formalmente la demostración tendría",
        "start": 3287.2200000000003,
        "end": 3292.38
    },
    {
        "text": " que haber puesto así. Acá hay en el cuadrado más 1, ese le dé. Claro, gracias.",
        "start": 3292.38,
        "end": 3298.46
    },
    {
        "text": " Pero viene o qué pasa, si hay dos repetidos los que va a pasar ese esto, si te armar",
        "start": 3299.18,
        "end": 3302.9
    },
    {
        "text": " el polínomio inmediatamente. Muy bien.",
        "start": 3302.9,
        "end": 3307.2200000000003
    },
    {
        "text": " ¿Qué decía la parte 2? Vamos a recordar cómo empezaba la parte 2, decía. Suponete que",
        "start": 3314.02,
        "end": 3319.98
    },
    {
        "text": " tenés un polínomio y ahora sí ya lo tenemos, el polinomio cddt, tal que evaluado en fí da 0.",
        "start": 3320.5,
        "end": 3332.34
    },
    {
        "text": " Como el cuerpo es algebre que a veces es rado el polinomio cddt se va a factorizar plenamente,",
        "start": 3332.34,
        "end": 3339.94
    },
    {
        "text": " totalmente se va a factorizar y como puede haber repeticiones en las raíces aparece la",
        "start": 3339.94,
        "end": 3348.06
    },
    {
        "text": " expresión típica, tm nos la anda, estas sí nos enseñan en el deseo, no? Factorizar en",
        "start": 3348.06,
        "end": 3353.82
    },
    {
        "text": " E2 por tm nos la anda Ec a la Ns. Ahora sí, cuando están totalmente factorizados lo que",
        "start": 3353.82,
        "end": 3360.82
    },
    {
        "text": " estamos diciendo en esta notación típicamente es que la anda es diferente de la hamna jota",
        "start": 3360.82,
        "end": 3365.9
    },
    {
        "text": " cuando hay un instinto de jota. Muy bien. Así empezaba la parte 2 y nos proponía que con esto el",
        "start": 3365.9,
        "end": 3375.38
    },
    {
        "text": " espacio vectorial velo vamos a describir como la suma directa de los que arna y les",
        "start": 3375.38,
        "end": 3379.28
    },
    {
        "text": " etcétera, lo que hicimos hace un rato. Bien, yo les dije que en la parte 2 usaba todo",
        "start": 3379.28,
        "end": 3383.86
    },
    {
        "text": " lo del tema de Besut, es el momento chicos, es el gran momento y ya tenemos todo pronto,",
        "start": 3383.86,
        "end": 3390.9
    },
    {
        "text": " todo dito pronto porque este que está acá y ojo la elección de P1 y P2 puede ser de",
        "start": 3390.9,
        "end": 3396.34
    },
    {
        "text": " mil maneras distintas. Este que está acá va a ser P1, P1 de T y este que está acá el resto",
        "start": 3396.34,
        "end": 3407.82
    },
    {
        "text": " va a ser P2 de T. Aquí tuvimos trabajando toda la clase pasada y repasando el comienzo",
        "start": 3410.58,
        "end": 3417.54
    },
    {
        "text": " de la clase de dos. ¿Cuál es la información o cuál es el dato que vamos a usar ahora entre",
        "start": 3417.54,
        "end": 3432.06
    },
    {
        "text": " P1 de T y P2 de T entre el naranja y el verde? Exactamente que no tienen raíces en común,",
        "start": 3432.06,
        "end": 3439.88
    },
    {
        "text": " exactamente que Gabriel, que no tienen raíces en común, eso es lo que planteamos hace un",
        "start": 3439.88,
        "end": 3445.9
    },
    {
        "text": " rato, se cuernan. No tienen raíces en común porque el naranja es distinto de naranja jota,",
        "start": 3445.9,
        "end": 3450.14
    },
    {
        "text": " así distinto de jota. Ok, a profe y no lo podría haber partido al medio por acá, sí, la",
        "start": 3450.14,
        "end": 3457.0
    },
    {
        "text": " separación la podemos hacer de mil maneras, lo puse así ordenadito, uno por un lado y el resto",
        "start": 3457.0,
        "end": 3461.38
    },
    {
        "text": " por otro, podriamos poner todo junto si el último por separado, lo que quieran. Las cuestiones",
        "start": 3461.38,
        "end": 3467.02
    },
    {
        "text": " que la conclusión es que P1 de T y P2 de T no tienen raíces comunes, excelentes y entonces",
        "start": 3467.02,
        "end": 3480.38
    },
    {
        "text": " estamos prontos a usar la conclusión que se acambos juntos al comienzo del clase. Usamos el",
        "start": 3480.38,
        "end": 3486.2599999999998
    },
    {
        "text": " lema de Besut y qué nos dice? Por el lema de Besut, existe dos polinomios, alpha de T y beta de T,",
        "start": 3486.26,
        "end": 3502.94
    },
    {
        "text": " tal que el 1, el número 1 de K se puede vivir como alpha de T por P1 de T, más beta de T por",
        "start": 3502.94,
        "end": 3519.62
    },
    {
        "text": " P2 de T, tremendo o el azo. Y de ahí nos va a salir todo lo que pretendía el .2,",
        "start": 3519.62,
        "end": 3531.5
    },
    {
        "text": " aquello de la separación del V, bueno, vamos con eso.",
        "start": 3531.5,
        "end": 3536.8599999999997
    },
    {
        "text": " Bien, acá hay un detallecito que como vamos a usar las cuatro versiones, yo se las voy a escribir",
        "start": 3536.86,
        "end": 3552.54
    },
    {
        "text": " las cuatro. Aquí puse una, esta es una, el lema de Besut, perfecto, no tiene ninguna error,",
        "start": 3552.54,
        "end": 3560.82
    },
    {
        "text": " pero polinomios son polinomios y nosotros sabemos que los polinomios comunitan, o sea yo puedo poner",
        "start": 3560.82,
        "end": 3566.5
    },
    {
        "text": " alpha por P1, P1 por alpha de la misma historia, y beta por P2, bueno, yo voy a escribir los cuatro",
        "start": 3566.5,
        "end": 3573.02
    },
    {
        "text": " porque los cuatro la vamos a usar, vamos a usar las cuatro versiones, o sea, qué es esto de las",
        "start": 3573.02,
        "end": 3577.38
    },
    {
        "text": " cuatro versiones, o sea el 1 también puede ser P1 de T por alpha de T, más beta de T por P2 de T,",
        "start": 3577.38,
        "end": 3586.26
    },
    {
        "text": " el 1 también va a ser igual a este vuelvo a la primera aquí pero cambio en el segundo sumando,",
        "start": 3587.26,
        "end": 3596.3
    },
    {
        "text": " parece increíble, las cuatro versiones no van a dar información distinta en un rato y por",
        "start": 3598.7000000000003,
        "end": 3605.0200000000004
    },
    {
        "text": " último me falta uno que es haber si me ayudan P1 de T por alpha, más P2 por beta, ¿no?",
        "start": 3605.0200000000004,
        "end": 3611.78
    },
    {
        "text": " Creo que hay tengo las cuatro versiones de la misma información, no hice nada, el único que",
        "start": 3612.78,
        "end": 3617.02
    },
    {
        "text": " hice es cambiar el lugar los factores en cada multiplicación y eso en la escuela ya en el lisión",
        "start": 3617.02,
        "end": 3623.0600000000004
    },
    {
        "text": " nos enseñaron que se puede hacer, son polinomios, sin embargo cuando en vez de T pongamos FI en cada una",
        "start": 3623.0600000000004,
        "end": 3631.94
    },
    {
        "text": " de esos lugares, nosotros sabemos que vamos a cambiar la T por FI, te está dando un montón de",
        "start": 3631.94,
        "end": 3638.0600000000004
    },
    {
        "text": " información extra cada una de las versiones, porque si hay algo que no se se llama lo",
        "start": 3638.06,
        "end": 3645.62
    },
    {
        "text": " profesores de gal, es que la más tríces no comutan, que las transformaciones y ya les no comutan,",
        "start": 3645.62,
        "end": 3651.9
    },
    {
        "text": " no tienen por qué comutan, algún así pero en general no comutan, se acuerdan de eso, entonces",
        "start": 3651.9,
        "end": 3659.02
    },
    {
        "text": " fíjense que las cuatro versiones no se están dando en montón de información porque cuando en",
        "start": 3659.02,
        "end": 3664.34
    },
    {
        "text": " vez de T pongas FI te está diciendo que P1 de FI y alpha de FI cambiado del lugar va a dar",
        "start": 3664.34,
        "end": 3673.58
    },
    {
        "text": " todos los mismos y eso es esencial para la prueba. Bueno dicho esto, empecemos a usarlo, por ejemplo",
        "start": 3673.58,
        "end": 3682.58
    },
    {
        "text": " vamos directamente en la primera, la primera version alpha y beta y v, de acá, ¿qué sacamos",
        "start": 3682.58,
        "end": 3697.06
    },
    {
        "text": " el lugar? Quiero que me dian ustedes cuanto del resultado, es sencillo pero la vez quiero que",
        "start": 3712.58,
        "end": 3724.22
    },
    {
        "text": " como se piensa esto, en vez de T pongo FI ya sabemos que lo podemos hacer y cuánto da en vez de",
        "start": 3724.22,
        "end": 3731.74
    },
    {
        "text": " uno queda, en entidad, porque uno que es, a ver siempre me pierdo, siempre me pierdo,",
        "start": 3731.74,
        "end": 3738.6
    },
    {
        "text": " del uno que el uno es uno por TL a 0, el uno es porque es uno por TL a 0, entonces es uno por FI",
        "start": 3738.6,
        "end": 3747.16
    },
    {
        "text": " a la 0 que tengo que poner a profía la 0 en la entidad, entonces me queda la entidad, la transformación",
        "start": 3747.16,
        "end": 3752.7599999999998
    },
    {
        "text": " o la linea de identidad, si quieren le ponga un B para que acordan lo que estamos de B en B, bien.",
        "start": 3752.76,
        "end": 3762.88
    },
    {
        "text": " En los cuatro casos me va a dar lo mismo ¿no verdad? Me permiten no copiar los cuatro sino que",
        "start": 3768.1600000000003,
        "end": 3775.2000000000003
    },
    {
        "text": " ustedes dejen el espacio, los cuatro casos me da la entidad cambiando T por FI y los cuatro como",
        "start": 3775.2000000000003,
        "end": 3781.7200000000003
    },
    {
        "text": " les dije hace un rato, los cuatro le vamos a usar. Y esto que quiere decir, lo escribo acá para",
        "start": 3781.72,
        "end": 3788.48
    },
    {
        "text": " usar el pizarrón pero ustedes dejen un espacio para las versiones naranja, ¿qué quiere decir que",
        "start": 3788.48,
        "end": 3793.72
    },
    {
        "text": " de la entidad? Quiero decir bueno que para todos B en B cuando vos hagas alpha de FI por P1 de FI en B más",
        "start": 3793.72,
        "end": 3806.12
    },
    {
        "text": " B está de FI, Evaluado en P2 de FI en B y camin un poquito la natación para que se entienda,",
        "start": 3806.64,
        "end": 3817.04
    },
    {
        "text": " ya estoy evaluando la transformación lineal en B y después compongo con la transformación",
        "start": 3817.04,
        "end": 3821.58
    },
    {
        "text": " lineal, esto quiere decir que esto da igual a B. Muy bien, en particular sigo avanzando",
        "start": 3821.58,
        "end": 3844.5
    },
    {
        "text": " elentamente en particular, si B pertenece al kernel de la transformación lineal P1 de FI",
        "start": 3844.5,
        "end": 3862.54
    },
    {
        "text": " en particular si B está en el kernel de P1 de FI, entonces ¿qué pasa? Evaluado en Cero,",
        "start": 3862.54,
        "end": 3882.7
    },
    {
        "text": " Cero más cualquier cosa, el Cero se va, o sea que lo que queda es que B está de FI Evaluado en",
        "start": 3882.7,
        "end": 3890.98
    },
    {
        "text": " P2 de FI de B, da B. Dicho otra manera, B está de FI por P2 de FI da la entidad, porque esto era",
        "start": 3890.98,
        "end": 3906.46
    },
    {
        "text": " para todo, pero no, y cuy, ni nada más, acá que eso, esto es para todo B en el que",
        "start": 3906.46,
        "end": 3915.9
    },
    {
        "text": " han de resumir, muy bien, muy bien, ahí está, yo mismo les dije que había",
        "start": 3915.9,
        "end": 3931.26
    },
    {
        "text": " que hacer, lo que dije está perfecto, pero lo que quería aprovechar no era la primera,",
        "start": 3931.26,
        "end": 3937.42
    },
    {
        "text": " vieron, era la tercera, la que tenía que empezar a aprovechar, disculpen, lo hago de vuelta",
        "start": 3937.42,
        "end": 3941.6600000000003
    },
    {
        "text": " con la, a ver si es la tercera, no quiero meter la pata, si está en el roo, si la tercera",
        "start": 3941.6600000000003,
        "end": 3947.5400000000004
    },
    {
        "text": " es, voy a escribir lo mismo pero en la tercera, o sea lo que escribí esta bien pero no es lo que",
        "start": 3947.5400000000004,
        "end": 3953.42
    },
    {
        "text": " quiero sacar, así que voy de vuelta, pero usando la tercera, digo para todo B en B, lo que va",
        "start": 3953.42,
        "end": 3963.46
    },
    {
        "text": " a suceder es que alfa, les escribo lo mismo y la mismo, son cuatro identidades todas válidas,",
        "start": 3963.46,
        "end": 3975.2200000000003
    },
    {
        "text": " pero voy a usar la tercera, entonces es P2 de F, evaluado en B está de F, de B, esto da B,",
        "start": 3975.7799999999997,
        "end": 3985.7799999999997
    },
    {
        "text": " para todo B, y repito en la misma frase, si ves está en el que han de P1 de F,",
        "start": 3987.4599999999996,
        "end": 3994.14
    },
    {
        "text": " si ves está en el carne, de P1 de F, que es operador, P1 de F, entonces P2 de F por B está",
        "start": 3994.66,
        "end": 4010.8199999999997
    },
    {
        "text": " lo de B es igual a B, y por qué quería usar la tercera, la tercera versión, son cuatro igualidades",
        "start": 4010.8199999999997,
        "end": 4020.46
    },
    {
        "text": " todas iguales, solo que te dan diferentes informaciones, por esto chicos, resulta que si usando",
        "start": 4020.46,
        "end": 4029.02
    },
    {
        "text": " la tercera, la conclusión es que si ves está en el que han de F, entonces fíjense, B el",
        "start": 4029.02,
        "end": 4036.9
    },
    {
        "text": " mismo B está en la imagen de P2, de F, usando la tercera, si ves está en el que han",
        "start": 4036.9,
        "end": 4055.2200000000003
    },
    {
        "text": " de F, entonces ves está en la imagen de P2 de F, y voy a concluir ese caso, repito, para cada",
        "start": 4055.22,
        "end": 4078.66
    },
    {
        "text": " una voy a sacar información, debería haber arrancado con la tercera, les pido disculpa ver",
        "start": 4078.66,
        "end": 4082.58
    },
    {
        "text": " la recabuela primera que quedó trunca por ahí, la tercera me dice que si ves está en el",
        "start": 4082.58,
        "end": 4087.06
    },
    {
        "text": " que han de R1 de F, entonces ves está en la imagen de P2 de F, de P1 de F, está en la imagen de",
        "start": 4087.06,
        "end": 4092.02
    },
    {
        "text": " P2 de F, y ahora voy a concluir esa situación y digo ahora, supongamos que ahora ves está,",
        "start": 4092.02,
        "end": 4097.18
    },
    {
        "text": " sigo acá por otro lado, supongamos que B está en la imagen de P2 de F,",
        "start": 4097.18,
        "end": 4112.42
    },
    {
        "text": " voy a querer terminar probando que son iguales, el que han de F1 y la imagen de P2 de F, ese es",
        "start": 4117.62,
        "end": 4124.18
    },
    {
        "text": " mi objetivo, probar que son iguales, ya provee que está incluido, porque todo vector del que han",
        "start": 4124.18,
        "end": 4129.780000000001
    },
    {
        "text": " el de P1 está en la imagen de P2, ahora voy a probar al contrario que todo vector de la imagen está en",
        "start": 4129.780000000001,
        "end": 4135.22
    },
    {
        "text": " el que han de F, y voy a usar este truquito, entonces si ves está en la imagen de P2 de F,",
        "start": 4135.22,
        "end": 4141.58
    },
    {
        "text": " ¿qué quiere decir que existe? Alguien es igual a P2 de F, de W, entonces,",
        "start": 4141.58,
        "end": 4170.0599999999995
    },
    {
        "text": " P1 de R, de B, voy a calcular P1 de R, P1 de F, de B, disculpen P1 de F, en vez de B voy a poner",
        "start": 4172.14,
        "end": 4187.76
    },
    {
        "text": " P2 de F, en vez de B sustitución, me queda P1 de F, o si quieren D, P2 de F,",
        "start": 4187.76,
        "end": 4199.62
    },
    {
        "text": " que he dicho otra manera esto, lo mismo que decir P1 de F por P2 de F calculado, ¿no?",
        "start": 4201.74,
        "end": 4208.78
    },
    {
        "text": " Ya estamos por meter el gol en esta parte, pero cada tanto de una paucita, el profe dijo que en",
        "start": 4217.3,
        "end": 4225.46
    },
    {
        "text": " esta parte C, probamos que existaban el kernel de P1 de F, está en la imagen de P2 de F y que el",
        "start": 4225.46,
        "end": 4231.14
    },
    {
        "text": " objetivo era probar que eran el mismo conjunto, arranqué con un vector B que estaba en la imagen de",
        "start": 4231.14,
        "end": 4237.58
    },
    {
        "text": " P2 de F, tengo que terminar probando que está en el kernel de P1 de F, o sea que más vale que esto",
        "start": 4237.58,
        "end": 4243.22
    },
    {
        "text": " me desero, quiero probar que esto da C, y por qué da C, vuelvo a este pizarrón, P1 de F y por P2",
        "start": 4243.22,
        "end": 4251.860000000001
    },
    {
        "text": " de F y quien es? P1 de T por P2 de T es C1 de T, entonces P1 de F por P2 de F es C1 de F y",
        "start": 4251.86,
        "end": 4262.94
    },
    {
        "text": " cuánto valía C1 de F? C0, entonces eso es, lo pongo, pongo C1 de F, evaluado a un W, pero es",
        "start": 4262.94,
        "end": 4273.74
    },
    {
        "text": " C0 por W o sea C0, entonces probaste la otra inclusión, vamos a poner rojo, rojo 1,",
        "start": 4273.74,
        "end": 4286.82
    },
    {
        "text": " acá, parte 1 y acá parte 2, entre 1 y 2, quiero que probamos que la imagen de P2 de W es igual",
        "start": 4286.82,
        "end": 4306.54
    },
    {
        "text": " al kernel de P1, pero que la imagen de P2 de F, F es igual al kernel de P1 de F,",
        "start": 4306.54,
        "end": 4322.1
    },
    {
        "text": " entre 1 y 2 probamos eso, está bien, no nos apuremos, sé que no va a llevar un poco más de tiempo,",
        "start": 4322.1,
        "end": 4343.34
    },
    {
        "text": " pero no nos apuremos, los quedan 2 minutos, se quiere hacer una pregunta, además antes de",
        "start": 4343.34,
        "end": 4348.38
    },
    {
        "text": " irnos, nos quedó por la mitad la demostración de 2, seguimos el martes, Uc3, alpha P1, P2 beta,",
        "start": 4348.38,
        "end": 4357.38
    },
    {
        "text": " igual 1, Uc3 y saque la conclusión que anunle P1 igual a imagen de P2, ahora bien, si yo uso la 2,",
        "start": 4357.38,
        "end": 4369.42
    },
    {
        "text": " quiero sacar como conclusión, exactamente, imagen de P1 igual a que anunle P2 porque se cambian",
        "start": 4369.42,
        "end": 4379.02
    },
    {
        "text": " del lugar, la que estaba acá es P1 y la que estaba fuera, digamos, como segunda, ahora P2,",
        "start": 4379.02,
        "end": 4386.02
    },
    {
        "text": " acá la que está como primera es P2 y la que está como segunda es P1, entonces usando esta de acá,",
        "start": 4386.02,
        "end": 4393.86
    },
    {
        "text": " voy a concluir que la imagen de P1 de F es igual al que da nel de P2 de F, ¿de acuerdo?",
        "start": 4394.38,
        "end": 4409.42
    },
    {
        "text": " vamos de poquita pero lo vamos armando, bien, o sea que todavía no sé, ni 1 ni 4, que nos van a dar",
        "start": 4409.42,
        "end": 4419.82
    },
    {
        "text": " otras informaciones 1 ni 4, está bien, yo 1530, son las 1530, vamos a parar por acá, pero estamos",
        "start": 4419.82,
        "end": 4427.98
    },
    {
        "text": " de poquita armando la parte esta en lucha, así que el martes arrancamos, retomamos la parte 2 y vamos",
        "start": 4427.98,
        "end": 4434.86
    },
    {
        "text": " a hacer también la parte 3, está bien, en general, directamente no sepan a la demostración de",
        "start": 4434.86,
        "end": 4440.0599999999995
    },
    {
        "text": " la mitad pero nos quedó por la mitad, malas suerte, así que bueno, fin de semana les aviso por el",
        "start": 4440.0599999999995,
        "end": 4445.78
    },
    {
        "text": " foro si logros vivir del práctico entre hoy y mañana, estamos",
        "start": 4445.78,
        "end": 4449.34
    }
]