[
    {
        "text": " Bueno arrancamos con la clase.",
        "start": 0.0,
        "end": 21.48
    },
    {
        "text": " Un rápido repaso lo que terminamos de ver en las clases pasadas, terminamos de ver la",
        "start": 21.48,
        "end": 30.12
    },
    {
        "text": " noción de diagonalización de un operador y vimos una condición necesaria suficiente",
        "start": 30.12,
        "end": 36.4
    },
    {
        "text": " para que fuera diagonalizable. Así que uno tiene un operador lineal en un espacio de",
        "start": 36.4,
        "end": 43.400000000000006
    },
    {
        "text": " dimensión finita, dimensar donde veis igual a N, y vimos ahí que T diagonalizable si",
        "start": 43.4,
        "end": 53.04
    },
    {
        "text": " solo si todas las raíces del polinomo característico están en el cuerpo en el que estamos trabajando",
        "start": 53.04,
        "end": 58.64
    },
    {
        "text": " y todas las multiplicidades algebraicas de un valor propio coinciden con las multiplicidades",
        "start": 58.64,
        "end": 63.36
    },
    {
        "text": " geometricas. O dicho de otra manera, cuando T no es diagonalizable.",
        "start": 63.36,
        "end": 71.44
    },
    {
        "text": " Hay dos posibilidades, o bien hay raíces características que no están en el cuerpo,",
        "start": 71.44,
        "end": 80.92
    },
    {
        "text": " por lo tanto no son valores propios, no hay raíces del polinomo característico que no",
        "start": 80.92,
        "end": 91.0
    },
    {
        "text": " están en el cuerpo en el que estamos trabajando. Si esta es una posibilidad o la otra posibilidad",
        "start": 91.0,
        "end": 99.52
    },
    {
        "text": " que haya valores propios para los cuales la multiplicidad geometrica es estrictamente",
        "start": 99.52,
        "end": 105.16
    },
    {
        "text": " menor que la algebraica, en ese caso no hay raíces diagonalizables. Entonces esa es una",
        "start": 105.16,
        "end": 109.88
    },
    {
        "text": " posibilidad, la otra es que haya valores propios para los cuales la multiplicidad algebraica,",
        "start": 109.88,
        "end": 123.92
    },
    {
        "text": " la multiplicidad algebraica y la geometrica son diferentes. Se acuerdan que la multiplicidad",
        "start": 123.92,
        "end": 128.35999999999999
    },
    {
        "text": " algebraica de un valor propio es la multiplicidad valor propio como raí del polinomo característico",
        "start": 128.36,
        "end": 136.84
    },
    {
        "text": " y la multiplicidad geometrica es la dimensión del subespacio propio y sociable. Pero hay valores",
        "start": 136.84,
        "end": 142.56
    },
    {
        "text": " propios por los cuales esto es distinto. Entonces si pasa eso no es diagonalizable y lo mismo",
        "start": 142.56,
        "end": 149.32000000000002
    },
    {
        "text": " si hay raíces del cuerpo que no están en el cuerpo, si hay raíces ponemos que la",
        "start": 149.32000000000002,
        "end": 153.52
    },
    {
        "text": " multiplicidad algebraica no están en el cuerpo, o sea que no son valores propios. En lo que",
        "start": 153.52,
        "end": 157.44
    },
    {
        "text": " sigue el curso en las próximas clases nos vamos a concentrar en esta situación, vamos a",
        "start": 157.44,
        "end": 162.16000000000003
    },
    {
        "text": " suponer que todas las raíces están en el cuerpo pero que hay o sea todas las raíces",
        "start": 162.16000000000003,
        "end": 168.44
    },
    {
        "text": " son valores propios pero hay al menos un valor propio por el cual no se cumple que multiplicidad",
        "start": 168.44,
        "end": 172.64000000000001
    },
    {
        "text": " geometrica es igual la multiplicidad algebraica. Y ahí vamos a ver que los operadores pueden",
        "start": 172.64000000000001,
        "end": 177.68
    },
    {
        "text": " llevarse una forma diagonal porque no es diagonalizable pero algo que es parecido en el diagonal,",
        "start": 177.68,
        "end": 182.92000000000002
    },
    {
        "text": " es sentido que tiene elementos no nulos o tiene elementos digamos notríbiales en la diagonal",
        "start": 182.92,
        "end": 190.28
    },
    {
        "text": " y tiene uno en algunos elementos en tradas de la diagonal inferior. Y este caso no lo vamos",
        "start": 190.28,
        "end": 197.64
    },
    {
        "text": " a ver en el curso pero también se puede llevar en el caso de que las raíces no estén en",
        "start": 197.64,
        "end": 202.07999999999998
    },
    {
        "text": " el cuerpo se puede llevar en un operador a formas relativamente más sencillas de trabajar.",
        "start": 202.07999999999998,
        "end": 206.92
    },
    {
        "text": " Pero nos vamos a concentrar entonces acá.",
        "start": 207.48,
        "end": 210.16
    },
    {
        "text": " Entonces déjenme hacer un, vamos a hacer varios dibujos en la clase de hoy,",
        "start": 215.32,
        "end": 219.56
    },
    {
        "text": " más que teore más, va a hacer una clase con dibujos y explicación de ideas. Fíjense lo siguiente,",
        "start": 221.56,
        "end": 229.51999999999998
    },
    {
        "text": " vamos a hacer un dibujito acá.",
        "start": 230.88,
        "end": 232.2
    },
    {
        "text": " Cuando te diga una lisable, cuando te diga una lisable uno tiene el siguiente esquema,",
        "start": 232.2,
        "end": 246.92
    },
    {
        "text": " uno tiene el espacio vectorial y los valores propio y los subespacios propios asociados.",
        "start": 246.92,
        "end": 254.2
    },
    {
        "text": " Entonces tendrá hacemos dibujos y decimos varias veces, este será subespacio propio,",
        "start": 254.2,
        "end": 258.91999999999996
    },
    {
        "text": " que es sube con lambda 1, por acá tendremos subespacio propio con asociado lambda 2, por acá",
        "start": 258.92,
        "end": 265.04
    },
    {
        "text": " subespacio propio, subespacio lambda 3 etc. Y todos estos subespacios tienen la misma dimensión",
        "start": 265.04,
        "end": 273.12
    },
    {
        "text": " que la tiene la dimensión de la multiplicidad gebráica de valor propio. Entonces puede elegir",
        "start": 273.12,
        "end": 279.96000000000004
    },
    {
        "text": " en cada subespacio tantos vectores propios, linealmente independiente como la multiplicidad gebráica",
        "start": 279.96000000000004,
        "end": 286.08000000000004
    },
    {
        "text": " del valor propio. Entonces yo puedo formar mi una base del espacio vectorial B agarrando",
        "start": 286.08,
        "end": 292.71999999999997
    },
    {
        "text": " vectores eley acá, vectores eley acá, vectores eley acá y con esos vectores juntos me formo",
        "start": 294.32,
        "end": 301.32
    },
    {
        "text": " una base de B. Está claro, eso es por qué diagonalizable, existe una base de vectores propios.",
        "start": 301.32,
        "end": 306.32
    },
    {
        "text": " Ahora, ¿qué pasa cuando usted no es diagonalizado por esta situación? Cuando usted no",
        "start": 306.88,
        "end": 316.56
    },
    {
        "text": " diagonalizado por esa situación, en ese caso estamos pensando que todo la raíz es un valor",
        "start": 316.56,
        "end": 332.56
    },
    {
        "text": " exprópios, pero lo que pasa es que los subespacios propios hay al menos alguno que no tiene",
        "start": 332.56,
        "end": 336.32
    },
    {
        "text": " la dimensión de la multiplicidad gebráica. Entonces en ese caso lo que tenemos es algo como esto.",
        "start": 336.32,
        "end": 341.48
    },
    {
        "text": " Yo tengo el espacio vectorial, tengo los subespacios propios ahí, como los dibujé",
        "start": 343.12,
        "end": 349.72
    },
    {
        "text": " ahí, el único elemento en común que tienen estos es el 0, este es el es el lambda 1,",
        "start": 349.72,
        "end": 355.68
    },
    {
        "text": " este es el es el lambda 2, pongamos y este es el es el lambda 3. Entonces, ¿qué pasa? Supongamos",
        "start": 356.24,
        "end": 363.28000000000003
    },
    {
        "text": " que el es el lambda 1 tenga una dimensión menor que la multiplicidad gebráica el lambda 1. Entonces",
        "start": 363.28000000000003,
        "end": 368.8
    },
    {
        "text": " acá voy a poder elegir un número de vectores propios para formar una base de B, pero me va a",
        "start": 368.8,
        "end": 373.94
    },
    {
        "text": " quedar como entre comillas, digamos una dimensión sin cubrir. De acá lo mismo, pasará, no puedo elegir",
        "start": 373.94,
        "end": 380.44
    },
    {
        "text": " vectores propios acá y de acá puedo elegir vectores propios. El punto es que quedaran para formar",
        "start": 380.44,
        "end": 386.08
    },
    {
        "text": " una base de B quedará una base incompleta con vectores propios los que les debo agregar más",
        "start": 386.08,
        "end": 394.4
    },
    {
        "text": " vectores de B para formar una base, sí tengo que agregar más vectores para formar una base.",
        "start": 394.4,
        "end": 399.88
    },
    {
        "text": " Y la idea justamente es agregar esos vectores de una manera apropiada para que la base",
        "start": 399.88,
        "end": 407.24
    },
    {
        "text": " tenga una forma para que la tea asociera esa base, tengo una forma parecida o no de agora.",
        "start": 407.24,
        "end": 411.7
    },
    {
        "text": " Eso es lo que vamos a hacer. Eso es lo que se llama el método de Jordan que me lleva a un",
        "start": 411.7,
        "end": 417.64
    },
    {
        "text": " operador, no de una normalizada porque se sucede esto a una forma que se llama forma de Jordan,",
        "start": 417.64,
        "end": 425.36
    },
    {
        "text": " que como les dije algo parecido a la diagonal, pero no es una diagonal. Bien, eso es lo que vamos a",
        "start": 425.36,
        "end": 431.40000000000003
    },
    {
        "text": " ver en la clase de hoy. El punto clave está en esto, cómo elegir de manera propiada estos",
        "start": 431.4,
        "end": 440.15999999999997
    },
    {
        "text": " vectores. Yo empezo a formar una base de B, elegiendo tantos vectores y llenamente independientes",
        "start": 440.15999999999997,
        "end": 444.15999999999997
    },
    {
        "text": " como puede acá, tantos como puede acá, tantos como puede acá y bueno, me quedaran dimensiones",
        "start": 444.15999999999997,
        "end": 449.15999999999997
    },
    {
        "text": " por cubrir, bueno como el hijo los vectores que me faltan para formar una base. Bien, entonces",
        "start": 449.15999999999997,
        "end": 456.96
    },
    {
        "text": " aquellos subespacios que tienen multiplicidad geobra y que igual a la multiplicidad geométrica,",
        "start": 457.52,
        "end": 461.84
    },
    {
        "text": " el hijo tantos vectores ahí como la multiplicidad geobra y que eso nos van a tener problemas,",
        "start": 461.84,
        "end": 466.15999999999997
    },
    {
        "text": " los problemas van a venir con nosotros, aquellos en los cuales la multiplicidad geométrica es",
        "start": 466.15999999999997,
        "end": 470.84
    },
    {
        "text": " estrictamente menor que la multiplicidad geobra. Entonces, para contarles el método de Jordan,",
        "start": 470.84,
        "end": 476.52
    },
    {
        "text": " les voy a contarle idea, no vamos a hacer demostraciones porque hacer demostraciones nos llevaría",
        "start": 476.52,
        "end": 483.67999999999995
    },
    {
        "text": " dos o tres clases y de manera que está fuera el objetivo del curso, pero sí les voy a contar",
        "start": 483.68,
        "end": 489.8
    },
    {
        "text": " la idea para que quede claro cómo se construyen, cómo se ligen estos. Estos vectores para formar",
        "start": 489.8,
        "end": 495.18
    },
    {
        "text": " una base de B en las cuales el operador tiene una forma razonablemente sencilla, fácil de manipular.",
        "start": 495.18,
        "end": 500.32
    },
    {
        "text": " Entonces lo que vamos a hacer es vamos a considerar, me voy a concentrar en un valor propio para el",
        "start": 501.8,
        "end": 508.44
    },
    {
        "text": " cual no se cumple esto. Consiguera, vamos a un valor propio que le vamos a llamar lambda 0,",
        "start": 508.44,
        "end": 516.84
    },
    {
        "text": " lambda 0, valor propio de T, vamos a considerar este, es el lambda 0, el subespacio propio asociado,",
        "start": 516.84,
        "end": 529.28
    },
    {
        "text": " la multiplicidad geobra, asociado lambda 0 y vamos a suponer como les decía recién que la",
        "start": 529.28,
        "end": 550.36
    },
    {
        "text": " dimensión de ese subespacio propio, o sea la multiplicidad geométrica, es estrictamente menor que la",
        "start": 550.36,
        "end": 556.64
    },
    {
        "text": " multiplicidad geobraica. Y esta le vamos a llamar em para simplificar la notación. Y la idea",
        "start": 556.64,
        "end": 567.76
    },
    {
        "text": " como les dije recién es cómo elegir emeventores propios, linealmente independientes asociados con",
        "start": 567.76,
        "end": 575.12
    },
    {
        "text": " lambda 0, algunos serán elementos de acá, de subespacio propio, pero otros los tengo que elegir de",
        "start": 575.12,
        "end": 582.12
    },
    {
        "text": " manera propia, ahí no está en ningún subespacio propio, son los que marquen ahí fuera de los subespacios",
        "start": 582.12,
        "end": 587.24
    },
    {
        "text": " propios, o algunos de eso. Bien y la idea es que esto es el argumento que les voy a contar, se repite para",
        "start": 587.24,
        "end": 595.44
    },
    {
        "text": " cada uno los valores propios para los cuales no se cumple esta condición, o sea les comento el argumento",
        "start": 595.44,
        "end": 599.76
    },
    {
        "text": " para uno y obviamente se puede extender el mismo argumento, el mismo resonamiento para todos los",
        "start": 599.76,
        "end": 605.8
    },
    {
        "text": " valores propios para los cuales acá tengo una desigualdad estricta, que acá tengo una desigualdad.",
        "start": 605.8,
        "end": 610.3599999999999
    },
    {
        "text": " Bueno, preguntas acá, como les decía recién va a hacer una clase con muchos dibujitos,",
        "start": 614.88,
        "end": 620.52
    },
    {
        "text": " muchos dibujos y casi ninguna demostración, pero quiero que se entienda la idea, la idea de",
        "start": 622.12,
        "end": 632.8
    },
    {
        "text": " yo, y la idea es trabajar con lo que se llama el subespacio generalizado, en el lugar de trabajar con",
        "start": 632.8,
        "end": 641.04
    },
    {
        "text": " subespacios propios, vamos a definir otros subespacios que contienen a esos subespacios propios y que",
        "start": 641.04,
        "end": 647.9599999999999
    },
    {
        "text": " se llama los subespacios generalizados. Es muy ingenioso lo que hizo Jordan, más allá de que hay",
        "start": 647.9599999999999,
        "end": 662.12
    },
    {
        "text": " cuestiones técnicas por detrás que hay que probar y que no les vamos a probar, pero la idea es bien ingeniosa,",
        "start": 662.12,
        "end": 666.28
    },
    {
        "text": " es trabajar con los subespacios generalizados, entonces vamos a empezar diciendo que son los subespacios generalizados,",
        "start": 666.28,
        "end": 688.08
    },
    {
        "text": " estas construcciones se hacen para insisto, para el caso para cada valor propio, para el cual se",
        "start": 688.08,
        "end": 694.36
    },
    {
        "text": " cumple esta desigualdad, para aquellos en los cuales esto es una igualdad, esta construcción",
        "start": 694.36,
        "end": 701.6800000000001
    },
    {
        "text": " estribuía no aporta nada, bueno, vamos a definir, entonces vamos a empezar definiendo el concepto",
        "start": 701.68,
        "end": 717.7199999999999
    },
    {
        "text": " de vector propio generalizado asociado a lambda cero.",
        "start": 717.72,
        "end": 721.0
    },
    {
        "text": " Vectores propios generalizados asociados a lambda cero.",
        "start": 721.0,
        "end": 749.08
    },
    {
        "text": " Para cada lambda cero vamos a definir una noción de vector propio que generaliza la noción que estuvimos",
        "start": 751.0,
        "end": 763.64
    },
    {
        "text": " usando la definición de vector propio. La construcción es bien, bien sencisa. Primero, qué es",
        "start": 763.64,
        "end": 773.32
    },
    {
        "text": " condición cumple en los vectores propios y asociados a lambda cero, bien los vectores en ese lambda cero son",
        "start": 773.32,
        "end": 787.8000000000001
    },
    {
        "text": " vectores propios de lambda cero, por lo tanto cumple en que si tele aplico un vectore de eso me da",
        "start": 787.8000000000001,
        "end": 791.6800000000001
    },
    {
        "text": " lambda cero por ese vectore, o es crito otra manera cumple que si le aplico el operador T",
        "start": 791.68,
        "end": 804.88
    },
    {
        "text": " menos lambda cero por I al vectore B eso me da cero, escribir lo mismo que dije recién de otra forma,",
        "start": 804.88,
        "end": 813.4799999999999
    },
    {
        "text": " los elementos en ese lambda cero son los que cumple en T menos lambda cero por I aplicado a B y",
        "start": 814.0,
        "end": 819.12
    },
    {
        "text": " vuelve a cero, bien o sea que es el lambda cero, es el conjunto de todos los vectores en el espacio",
        "start": 819.12,
        "end": 830.24
    },
    {
        "text": " que estamos trabajando, tal es que T menos lambda cero por I aplicado a B es igual a cero y esto",
        "start": 830.24,
        "end": 837.96
    },
    {
        "text": " justamente no es otra cosa que el núcleo de esta transformación lineal T menos lambda cero por I,",
        "start": 837.96,
        "end": 844.6800000000001
    },
    {
        "text": " tal esto es el núcleo de T menos lambda cero por I, hasta acá no dije nada simplemente",
        "start": 844.6800000000001,
        "end": 852.72
    },
    {
        "text": " interpreto los su espacio propio como el núcleo de la transformación lineal T menos lambda cero por I",
        "start": 852.72,
        "end": 859.96
    },
    {
        "text": " y ya de esto porque vamos a definir de espacio que generalizan este su espacio,",
        "start": 859.96,
        "end": 866.6
    },
    {
        "text": " permíteme llamarle en lugar de ese lambda cero es el lambda cero uno porque ahora voy a llamar",
        "start": 866.6,
        "end": 871.76
    },
    {
        "text": " definir lo que llaman los vectores propios generalizados de orden 2, esto sería en los de orden 1,",
        "start": 871.76,
        "end": 876.96
    },
    {
        "text": " se entiende? entonces vamos a acompañar con un dibujo por acá",
        "start": 878.24,
        "end": 885.36
    },
    {
        "text": " pensemos que este es el lambda cero o es el lambda cero uno que son todos los vectores propios",
        "start": 897.6,
        "end": 903.72
    },
    {
        "text": " asociados lambda cero, yo sé que ese es un conjunto no trivial, entonces ahora vamos a hacerlo",
        "start": 905.72,
        "end": 911.52
    },
    {
        "text": " siguiente consideramos un nuevo su espacio que le vamos a llamar",
        "start": 911.52,
        "end": 924.24
    },
    {
        "text": " es el lambda cero y le vamos a poner arriba un 2 que es el conjunto de todos los vectores en",
        "start": 926.0,
        "end": 932.68
    },
    {
        "text": " el espacio que estoy trabajando tales que T menos lambda cero por I al cuadrado aplicado a B",
        "start": 932.68,
        "end": 940.48
    },
    {
        "text": " me da cero, es decir aquellos vectores tal que si le aplico T menos lambda cero por I,",
        "start": 940.48,
        "end": 945.5600000000001
    },
    {
        "text": " dos veces obtengo cero, o sea justamente fíjese que esto le llamo uno porque esto viene acá la",
        "start": 945.5600000000001,
        "end": 952.08
    },
    {
        "text": " potencia uno y a esto le llamo dos porque acá viene la potencia dos, bien, o sea son el núcleo,",
        "start": 952.08,
        "end": 959.48
    },
    {
        "text": " son los vectores que están en el núcleo de T menos lambda cero por I al cuadrado",
        "start": 959.48,
        "end": 969.36
    },
    {
        "text": " bien ahora qué relaciona a hay entre esos dos subespacios, es decir se cumple que algunos está",
        "start": 971.28,
        "end": 980.5600000000001
    },
    {
        "text": " contenido en principio en el otro o eso ni igual esto porque fíjate que si puedes arrollaar",
        "start": 980.5600000000001,
        "end": 989.2
    },
    {
        "text": " eso lo mismo que decir T en B menos lambda cero por I al cuadrado a B que es B es igual a cero",
        "start": 989.2,
        "end": 995.48
    },
    {
        "text": " te ha aplicado a B y esto lo mismo que decir que T ha aplicado a B es lambda cero por I o sea",
        "start": 996.48,
        "end": 1004.4
    },
    {
        "text": " que es vector pro, vamos y ahora fíjense acá lo que estoy considerando es le ha aplicado dos",
        "start": 1004.4,
        "end": 1011.6800000000001
    },
    {
        "text": " veces T menos lambda cero por I y esto le va al cuadrado que es ir componer dos veces, no se",
        "start": 1011.6800000000001,
        "end": 1016.4
    },
    {
        "text": " acuerda, cuáles está contenido en cual si es que alguno está contenido en otro, claro fíjense",
        "start": 1016.4,
        "end": 1024.72
    },
    {
        "text": " que si algo esté en el núcleo fíjense lo siguiente vamos a escribirlo allá",
        "start": 1024.72,
        "end": 1034.16
    },
    {
        "text": " no está para toda transformación lineal T se cumple que el núcleo de T está contenido o es",
        "start": 1034.16,
        "end": 1055.16
    },
    {
        "text": " igual al núcleo de T cuadrado que está contenido igual que el núcleo de T al cubo etcétera",
        "start": 1055.16,
        "end": 1060.64
    },
    {
        "text": " porque eso porque si algo está en el núcleo de T si está en el núcleo de T eso implica que",
        "start": 1061.2,
        "end": 1068.0400000000002
    },
    {
        "text": " T ha aplicado a B me da cero y si yo eso le vuelvo a aplicarte eso me implica que T a T",
        "start": 1068.0400000000002,
        "end": 1076.6000000000001
    },
    {
        "text": " debe es cero o sea esto me implica que ve está en el núcleo de T cuadrado etcétera y si le vuelvo",
        "start": 1076.6000000000001,
        "end": 1084.3600000000001
    },
    {
        "text": " a aplicarte B está en el núcleo de T al cubo etcétera o sea en general se cumple que el núcleo de T está",
        "start": 1084.36,
        "end": 1091.12
    },
    {
        "text": " contenido igual el está contenido en el núcleo de T cuadrado contenido igual al núcleo de T al cubo etcétera",
        "start": 1091.12,
        "end": 1096.84
    },
    {
        "text": " de esta manera que esto como el núcleo de T menos lambda cero por I y esto que es el núcleo de T menos",
        "start": 1096.84,
        "end": 1102.52
    },
    {
        "text": " lambda cero por I al cuadrado esto está contenido en esto pueden ser iguales de hecho cuando",
        "start": 1102.52,
        "end": 1108.3999999999999
    },
    {
        "text": " bueno cuando la dimensión geométrica le dimensión al que habrá que coinciden son iguales",
        "start": 1109.3600000000001,
        "end": 1114.5600000000002
    },
    {
        "text": " pero en principio si no lo son esto está contenido en esto entonces acá tendría lo que se llama",
        "start": 1114.5600000000002,
        "end": 1122.0800000000002
    },
    {
        "text": " el subesparcio es el lambda cero dos que son aquellos vectores para los cuales",
        "start": 1122.88,
        "end": 1129.2
    },
    {
        "text": " T menos lambda cero por I al cuadrado en vez de igual a cero fíjense que este subesparcio",
        "start": 1129.2,
        "end": 1134.0800000000002
    },
    {
        "text": " contiene este como le decía recién o sea que estos son los vectores propios y además",
        "start": 1134.08,
        "end": 1140.04
    },
    {
        "text": " otros vectores sí los vectores propios asociados al lambda cero se entendió hasta ahí",
        "start": 1140.04,
        "end": 1148.8799999999999
    },
    {
        "text": " estos son los vectores propios que no son otra cosa que los que están en el núcleo de T menos",
        "start": 1157.8799999999999,
        "end": 1163.52
    },
    {
        "text": " lambda cero por I y estos son los que están en el núcleo de T menos lambda cero por I al cuadrado",
        "start": 1163.52,
        "end": 1172.32
    },
    {
        "text": " bueno acá hay una cuestión de notación que son los vectores propios generalizados asociados",
        "start": 1175.84,
        "end": 1180.8
    },
    {
        "text": " al lambda cero los vectores propios generalizados y al lambda cero de orden dos son los que están acá",
        "start": 1180.8,
        "end": 1187.84
    },
    {
        "text": " pero no están acá o sea los que están en esta parte en este subesparcio pero no están en",
        "start": 1188.36,
        "end": 1193.6
    },
    {
        "text": " este o sea no son vectores propios pero sí cumple en que T menos lambda cero y al cuadrado",
        "start": 1193.6,
        "end": 1198.36
    },
    {
        "text": " aplicados subectores me da cero esos son los vectores propios generalizados y obviamente",
        "start": 1198.36,
        "end": 1203.8
    },
    {
        "text": " esto esta definición la puede seguir extendiendo de manera recursiva ahora puede definir el subesparcio",
        "start": 1203.8,
        "end": 1210.8
    },
    {
        "text": " lambda cero tres como aquellos vectores que están en el núcleo de T menos lambda cero y al cubo y",
        "start": 1210.8,
        "end": 1218.72
    },
    {
        "text": " eso eventualmente me va a dar una secuencia de subesparcio que se están conteniendo uno adentro",
        "start": 1218.72,
        "end": 1223.32
    },
    {
        "text": " del otro estamos o sea",
        "start": 1223.32,
        "end": 1225.44
    },
    {
        "text": " sigo agregando sigo agregando ya que tener ese lambda cero uno es el lambda cero dos es el",
        "start": 1230.3999999999999,
        "end": 1235.46
    },
    {
        "text": " lambda cero tres que serán",
        "start": 1235.98,
        "end": 1237.02
    },
    {
        "text": " el conjunto de los vectores tal es que T menos lambda cero y al cubo aplicado a b es igual a cero",
        "start": 1250.46,
        "end": 1260.22
    },
    {
        "text": " o sea los que están en el núcleo de T menos lambda cero por y al cubo y así seguimos",
        "start": 1260.22,
        "end": 1266.5
    },
    {
        "text": " lo que están acá dijimos son esto no está en el libro no está ninguna nota pero",
        "start": 1268.98,
        "end": 1277.8600000000001
    },
    {
        "text": " es bastara infirmada y es entender la idea lo que se hace los que están en el caso los vectores",
        "start": 1277.8600000000001,
        "end": 1284.8600000000001
    },
    {
        "text": " propios. Las los p ぀ porque lo que están acá y no están acá son los vectores propios generalizados",
        "start": 1285.02,
        "end": 1290.4199999999998
    },
    {
        "text": " de orden uno lo que están acá y no están acá son los vectores propios generalizados pero",
        "start": 1290.4199999999998,
        "end": 1298.26
    },
    {
        "text": " pero generalizados de orden dos el que están acá la que están acá pero en un caso son los vectores",
        "start": 1299.6599999999999,
        "end": 1303.04
    },
    {
        "text": " propios ehrlichados de orden tres gueces en que se attecimos esa construcción ahora pero acá y",
        "start": 1303.04,
        "end": 1309.4199999999998
    },
    {
        "text": " varias cosas que se cumple, en principio, y a casi yo no lo voy a probar, pero lo que",
        "start": 1309.42,
        "end": 1321.74
    },
    {
        "text": " se cumple es que su espacio no se puede ir aumentando por sí, en principio, en primer lugar",
        "start": 1321.74,
        "end": 1328.9
    },
    {
        "text": " porque estoy trabajando con dimensión finita. Y en segundo lugar, ¿por qué hay un resultado",
        "start": 1328.9,
        "end": 1335.46
    },
    {
        "text": " que me dice que tarde o temprano yo voy ampliando esto y lleve un punto en que el núcleo de digamos",
        "start": 1335.46,
        "end": 1342.14
    },
    {
        "text": " T menos nada cero y a la k coincide con el núcleo T menos nada cero y a la k más 1. O sea",
        "start": 1342.14,
        "end": 1348.06
    },
    {
        "text": " que hay un punto acá donde todos los núcleos son iguales, o sea que eso se va grandando",
        "start": 1348.06,
        "end": 1353.1000000000001
    },
    {
        "text": " hasta que llegue un punto en que ya no se agranda más. Eso se prueba, yo no lo voy a probar,",
        "start": 1353.1000000000001,
        "end": 1358.74
    },
    {
        "text": " lo que insisto, quiero que hay que declara la idea. Entonces, yo voy a seguir aumentando",
        "start": 1358.74,
        "end": 1366.42
    },
    {
        "text": " estos círculos, esta es su círculo, esto es su espacio hasta que me llegue un punto en que,",
        "start": 1366.42,
        "end": 1370.66
    },
    {
        "text": " si los aumentos ya no agrego nada nuevo, me quedo ahí. Bien, se entendió alguna,",
        "start": 1370.66,
        "end": 1379.9
    },
    {
        "text": " alguna pregunta.",
        "start": 1381.66,
        "end": 1382.9
    },
    {
        "text": " O sea digamos que los sigo aumentando hasta que eventualmente llegue a un es el anda cero,",
        "start": 1388.86,
        "end": 1398.1
    },
    {
        "text": " como le vamos a notar.",
        "start": 1398.1,
        "end": 1399.5
    },
    {
        "text": " Eme cero digamos, notaciones esto, a partir del cual sus cías potencias no me aumentan el núcleo,",
        "start": 1402.7,
        "end": 1410.42
    },
    {
        "text": " el núcleo sus cías potencias no me aumentan este sub espacio. ¿Se entendió?",
        "start": 1410.42,
        "end": 1413.86
    },
    {
        "text": " Creanme eso se prueba. Entonces, cada vez que yo escribas se cumple, es algo que se cumple,",
        "start": 1413.86,
        "end": 1431.34
    },
    {
        "text": " pero que no lo voy a probar. Entonces, se cumple, bueno, y otra cosa, está claro que todo",
        "start": 1431.34,
        "end": 1439.78
    },
    {
        "text": " esto son sub espacio, pues justamente son núcleos de una transformación lineal. Entonces,",
        "start": 1439.78,
        "end": 1444.18
    },
    {
        "text": " considero su espacio que en principio se contiene un nuevo adentro, hasta que llegue un punto",
        "start": 1444.18,
        "end": 1449.1399999999999
    },
    {
        "text": " límito, no ya sus cías potencias del operador este no me aporta nada, el núcleo de sus cías potencias",
        "start": 1449.1399999999999,
        "end": 1455.06
    },
    {
        "text": " no me aporta nada. Nada nuevo.",
        "start": 1455.06,
        "end": 1456.74
    },
    {
        "text": " Se cumple, ya van a ver en un ratito que ingeniosa que es esta construcción de Jorda. En primer lugar,",
        "start": 1456.74,
        "end": 1475.82
    },
    {
        "text": " yo a la multiplicidad que braga hay que el andacer o le había llamado M, lo que se cumple",
        "start": 1475.82,
        "end": 1486.62
    },
    {
        "text": " y estamos teniendo una situación de que la dimensión de ese andacer o el espacio",
        "start": 1486.62,
        "end": 1490.74
    },
    {
        "text": " de partida era menos tríctube M, lo que se cumple es que es su espacio que llegamos",
        "start": 1490.74,
        "end": 1495.6599999999999
    },
    {
        "text": " acá el M0, la cantidad de veces que intero hasta que esto ya no me aporta más nada.",
        "start": 1495.6599999999999,
        "end": 1500.54
    },
    {
        "text": " Es menor igual que M, que es la multiplicidad que braga hay que el andacer. O sea, seguro que si le aplico",
        "start": 1506.54,
        "end": 1514.82
    },
    {
        "text": " más de M, interaciones, donde M es la multiplicidad que braga hay que el andacer o ya no agrego más nada.",
        "start": 1514.82,
        "end": 1520.34
    },
    {
        "text": " Eso se cumple.",
        "start": 1520.34,
        "end": 1522.54
    },
    {
        "text": " M más aún, más aún y acá van a empezar a cerrar las cosas. M más aún, se cumple lo siguiente,",
        "start": 1522.54,
        "end": 1546.06
    },
    {
        "text": " se cumple que si yo darro y veo la dimensión de su espacio generalizado este más grande",
        "start": 1546.06,
        "end": 1554.3
    },
    {
        "text": " que contiene a todos los otros, la dimensión de ese su espacio es justamente la multiplicidad",
        "start": 1554.3,
        "end": 1567.46
    },
    {
        "text": " que es la jeraica de la andacer. Tampoco lo vamos a probar, pero quiero decir, digamos si la",
        "start": 1567.46,
        "end": 1576.9
    },
    {
        "text": " multiplicidad geometrica de la andacer o es tres y la multiplicidad al jeraica es cinco, yo puedo",
        "start": 1576.9,
        "end": 1583.3400000000001
    },
    {
        "text": " hacer esta construcción hasta que llevo un subespacio y mencion cinco, eso en todos los subespacios",
        "start": 1583.3400000000001,
        "end": 1588.42
    },
    {
        "text": " generalizados a sociados de la andacer, están contenidos unos adentro de otro.",
        "start": 1588.42,
        "end": 1593.42
    },
    {
        "text": " Entonces, la idea de Jordan es elegir de manera propiada M vectores propios acá dentro,",
        "start": 1593.42,
        "end": 1605.5
    },
    {
        "text": " que es un espacio de dimensión M y con eso es que de tal manera que por lo menos la parte de la",
        "start": 1605.5,
        "end": 1613.8600000000001
    },
    {
        "text": " transformación ideal del operador que corresponde a este subespacio se escriba la manera más sencilla",
        "start": 1613.8600000000001,
        "end": 1618.8200000000002
    },
    {
        "text": " posible, una diagonal y algo y uno fuera de la diagonal, alguno su, esa es la idea de Jordan.",
        "start": 1618.82,
        "end": 1626.1
    },
    {
        "text": " Entonces, yo voy a formar una base de este subespacio que tiene dimensión igual a la multiplicidad",
        "start": 1626.1,
        "end": 1631.56
    },
    {
        "text": " jeraica arrancando con vectores propios acá y agregándole propiedadmente vectores aquí hasta",
        "start": 1631.56,
        "end": 1638.1799999999998
    },
    {
        "text": " formar una base de espacio de dimensión, la multiplicidad jeraica lambda 0. Una vez hecho eso",
        "start": 1638.1799999999998,
        "end": 1645.5
    },
    {
        "text": " con lambda 0 paso a otro valor propio para el cual la multiplicidad jerométrica es menor",
        "start": 1645.5,
        "end": 1651.54
    },
    {
        "text": " que la multiplicidad jeraica hago lo mismo, etcétera y finalmente voy a tener la forma que estoy",
        "start": 1651.54,
        "end": 1656.38
    },
    {
        "text": " buscando para el operador que no era diagonalizada. Preguntas, se entendió esto, se entiende acá?",
        "start": 1656.38,
        "end": 1665.54
    },
    {
        "text": " La construcción es bien sencilla, arrancamos con los vectores con subespacios y",
        "start": 1668.54,
        "end": 1672.74
    },
    {
        "text": " los vectores propios, el núcleo esta transformación lineal, después consiguieron núcleo esta transformación",
        "start": 1672.74,
        "end": 1678.3
    },
    {
        "text": " al cuadrado, esto es un subespacio que en principio lo contiene, los que están acá y no están acá",
        "start": 1678.3,
        "end": 1683.18
    },
    {
        "text": " son los vectores propios generados Jordan 2, sigo, consiguieron núcleos de temenos lambda 0 y",
        "start": 1683.18,
        "end": 1688.36
    },
    {
        "text": " al cubo paso acá, los que están acá y no están en las otras en esta son los vectores",
        "start": 1688.36,
        "end": 1694.76
    },
    {
        "text": " propios generados Jordan 3, etcétera y sigo hasta que llega un punto en que llega un emceiro,",
        "start": 1694.76,
        "end": 1701.22
    },
    {
        "text": " lo se atengo el núcleo temenos lambda 0 y al emceiro ese subespacio contiene a todos",
        "start": 1701.22,
        "end": 1706.14
    },
    {
        "text": " los otros, los que están acá y no están acá son los vectores propios generados Jordan emceiro",
        "start": 1706.14,
        "end": 1711.42
    },
    {
        "text": " y en partir de ahí sucesivas potencias cuando consiguieron núcleos no me agregan más nada.",
        "start": 1711.42,
        "end": 1715.66
    },
    {
        "text": " El primer resultado es que este emceiro es menor igual que la multiplicidad jeraica lambda",
        "start": 1715.66,
        "end": 1720.34
    },
    {
        "text": " 0 y el segundo resultado es que la dimensión de este subespacio grande coincide justamente",
        "start": 1720.34,
        "end": 1726.18
    },
    {
        "text": " con la multiplicidad jeraica lambda 0. Entonces voy a formar una base de este subespacio grande",
        "start": 1726.18,
        "end": 1732.26
    },
    {
        "text": " arrancando con tantos vectores acá como puede elegir vectores propios y completando",
        "start": 1732.26,
        "end": 1736.94
    },
    {
        "text": " la con vectores acá el EI, el EI2 apropiadamente esa es toda la idea de Jordan.",
        "start": 1736.94,
        "end": 1746.1000000000001
    },
    {
        "text": " ¿Aacto qué? Claro, es alto. Sí, sí, sí, acá en el fondo hay hay un, es una pregunta importante",
        "start": 1746.1,
        "end": 1760.5
    },
    {
        "text": " porque en el fondo como si tuvieramos considerando la restricción de T a un cierto subespacio,",
        "start": 1760.5,
        "end": 1765.6599999999999
    },
    {
        "text": " ya vamos a ver lo que subespacio invariante en un ratito, es como si yo me olvido todos",
        "start": 1765.6599999999999,
        "end": 1770.26
    },
    {
        "text": " los otros valores propios y me concentra una parte en su subespacio total y ahí encuentro",
        "start": 1770.26,
        "end": 1775.06
    },
    {
        "text": " de esa parte una base y después paso los otros valores propios lo mismo, si me",
        "start": 1775.06,
        "end": 1780.98
    },
    {
        "text": " también encontrano una base del espacio general. ¿Cuándo son los valores?",
        "start": 1780.98,
        "end": 1787.5
    },
    {
        "text": " ¿Cuándo son los valores? ¿Cuándo son los valores? Sí, sí, sí, es alto. ¿Ese dibujo",
        "start": 1787.5,
        "end": 1796.78
    },
    {
        "text": " realidad es un ozolo? Sí, es uno solo, exactamente, es como está bien la pregunta que hace,",
        "start": 1796.78,
        "end": 1803.3799999999999
    },
    {
        "text": " o sea, me dice yo inicialmente tenía, les había hecho este dibujito. Ahora, pensemos",
        "start": 1803.38,
        "end": 1809.66
    },
    {
        "text": " que este sí, esto tiene una dimensión geométrica y que volamos a ver que habrá y que",
        "start": 1809.66,
        "end": 1813.2600000000002
    },
    {
        "text": " o sea que acá no tiene problemas en el Hilbertor, pero pensemos que este no. Entonces, lo que",
        "start": 1813.2600000000002,
        "end": 1817.0600000000002
    },
    {
        "text": " estoy haciendo ahora es elegir un subespacio que tiene esta acá y lo solo no me importa,",
        "start": 1817.0600000000002,
        "end": 1825.18
    },
    {
        "text": " su subespacio contiene este, es invadible, eso hay que verlo con cuidado, pero este subespacio",
        "start": 1825.18,
        "end": 1831.8200000000002
    },
    {
        "text": " es lo que estoy construyendo acá, exactamente eso. Y que me permite elegir vectores acá",
        "start": 1831.82,
        "end": 1838.3799999999999
    },
    {
        "text": " dentro para completar la base y esos vectores no son vectores propios, ni de este, ni de este,",
        "start": 1838.3799999999999,
        "end": 1843.58
    },
    {
        "text": " ni de este. Exactamente eso. Y una última cosita que se cumple antes de, me faltan dos",
        "start": 1843.58,
        "end": 1857.3
    },
    {
        "text": " secúnple, pero son bastante razonables, esto que yo escribo acá en dos ranglones son",
        "start": 1857.3,
        "end": 1866.18
    },
    {
        "text": " hojas y hojas y hojas de demostraciones, ¿no? Por eso no las hacemos. Entonces, la idea",
        "start": 1866.18,
        "end": 1878.5
    },
    {
        "text": " es elegimos ml, vectores li en ese espacio generalizado para construir una base, una base",
        "start": 1878.5,
        "end": 1907.14
    },
    {
        "text": " del espacio ese generalizado, que tiene dimensiones. La idea de llor, además la construcción",
        "start": 1907.14,
        "end": 1930.8600000000001
    },
    {
        "text": " esa es elegirlo de manera propiada, que guarde una relación entre ellas, entre ellos,",
        "start": 1930.86,
        "end": 1935.6599999999999
    },
    {
        "text": " apropiar. Y otra cosa de aquí de rotar, ¿qué esto sí es fácil?",
        "start": 1935.66,
        "end": 1943.1000000000001
    },
    {
        "text": " No tar. Y si yo tarro.",
        "start": 1944.02,
        "end": 1967.58
    },
    {
        "text": " un vector propio generalizado de orden k o sea algo que está en su espacio acá, k,",
        "start": 1967.58,
        "end": 1978.4199999999998
    },
    {
        "text": " en el núcleo t-0 y a la k y le aplico a eso t-0 por i una vez, la pregunta es a dónde",
        "start": 1978.4199999999998,
        "end": 1988.22
    },
    {
        "text": " voy a parar. Entonces, si ves en ese lándo de k, en el su espacio propio generalizado",
        "start": 1988.22,
        "end": 1995.82
    },
    {
        "text": " de orden k eso implica naturalmente que t-0 nos lambda cero y a la aplicado kb, sea ese vector",
        "start": 1995.82,
        "end": 2008.06
    },
    {
        "text": " es cero o sea porque vea está en el núcleo de t-0 por i a la k esa es la definición.",
        "start": 2008.06,
        "end": 2013.7
    },
    {
        "text": " Y a esto lo puedo pensar así, lo puedo pensar como t-0 y a la potencia k-1 aplicado a t-0 por",
        "start": 2013.7,
        "end": 2031.76
    },
    {
        "text": " i a ver o sea le aplico primero t-0 por i una vez a ver y después le aplico las k-1 veces",
        "start": 2031.76,
        "end": 2042.22
    },
    {
        "text": " restantes t-0 por i y eso me da obviamente t-0 y a la k no esto acá es lo mismo que esto",
        "start": 2042.22,
        "end": 2053.2200000000003
    },
    {
        "text": " o sea que esto acá me da cero o sea que lo que estamos diciendo es que si le aplico",
        "start": 2053.2200000000003,
        "end": 2062.1
    },
    {
        "text": " t-0 por i a la potencia k-1 a este vector me da cero o sea que este vector en donde está",
        "start": 2062.1,
        "end": 2068.26
    },
    {
        "text": " en ese lándo de k-1 o sea si yo agarró a dar un vector acá en ese lándo de k-3 y le aplico",
        "start": 2068.26,
        "end": 2081.7000000000003
    },
    {
        "text": " t-0 por i una vez k o el nivel de abajo y lo que se puede ver además eso no lo voy a probar",
        "start": 2081.7000000000003,
        "end": 2090.42
    },
    {
        "text": " pero se puede ver es que si esto está en ese lándo de k-3 pero no está en ese lándo de k-2 o sea",
        "start": 2090.42,
        "end": 2096.6400000000003
    },
    {
        "text": " esto es un vector propio generalizado en 3 entonces esto está en ese lándo de k-2 pero no está en",
        "start": 2096.64,
        "end": 2101.2999999999997
    },
    {
        "text": " ese lándo de k-1 o sea esto es un vector propio generalizado en 2 o sea que si yo le aplico t-0 por i",
        "start": 2101.2999999999997,
        "end": 2107.8199999999997
    },
    {
        "text": " a vectores en una k pa k caigo a la k por inferior y si lo aplico otra vez k-1 a k por inferior y",
        "start": 2107.8199999999997,
        "end": 2113.7599999999998
    },
    {
        "text": " si lo aplico suciazmente suciaz vez k-2 acá bueno y además yo no lo voy a probar acá pero esto",
        "start": 2113.7599999999998,
        "end": 2122.48
    },
    {
        "text": " esto también se verifica además si ve esta en ese lándo de k pero no está en ese lándo de k-1 o sea",
        "start": 2122.48,
        "end": 2138.44
    },
    {
        "text": " está en ese lándo de k-1 este es el menos como conjunto o sea si un vector propio generalizado",
        "start": 2138.44,
        "end": 2145.52
    },
    {
        "text": " de orden k lo que le dije recién si yo le aplico t-0 por i una vez k-1 a la k-2 inferior",
        "start": 2145.52,
        "end": 2152.2400000000002
    },
    {
        "text": " o sea t-0 por i aplicado una vez a ve está en la k-1 inferior o sea en ese lándo de k-1",
        "start": 2152.24,
        "end": 2172.3999999999996
    },
    {
        "text": " menos es el lándo de k-2 el dibujito que le hice recién sucesiva aplicación de t-0 por i me",
        "start": 2172.3999999999996,
        "end": 2180.7999999999997
    },
    {
        "text": " baja en un vector de esta k pa a la k-1 inferior un vector de ese orden entre en uno de orden 2 si lo",
        "start": 2180.88,
        "end": 2188.42
    },
    {
        "text": " aplico nuevo en uno de orden 1 etcétera bueno quieren que pongamos un ejemplo concreto y así",
        "start": 2188.42,
        "end": 2202.26
    },
    {
        "text": " vemos que es claro cómo se construye la base apropiada el ejemplo concreto quiere decir que le",
        "start": 2202.26,
        "end": 2208.7400000000002
    },
    {
        "text": " voy a poner el número de estas dimensiones y nada más que eso insisto detrás de todo esto",
        "start": 2208.74,
        "end": 2225.02
    },
    {
        "text": " hay hojas y hojas y hojas de resultados técnicos para probar esto que le estoy escribiendo",
        "start": 2225.02,
        "end": 2229.58
    },
    {
        "text": " la idea lo que quiero que entienda la idea intuitiva que está por detrás la construcción",
        "start": 2229.58,
        "end": 2233.74
    },
    {
        "text": " entonces vamos a poner un ejemplo concreto",
        "start": 2233.74,
        "end": 2238.3799999999997
    },
    {
        "text": " yo estuve física ahí es un doctor a un física en Córdoba y a mí más que la demostración",
        "start": 2263.74,
        "end": 2283.74
    },
    {
        "text": " este dios ahí el épsil nosotros raíz de n y el queso yo cuanto hace un dibujito si un",
        "start": 2283.74,
        "end": 2289.3799999999997
    },
    {
        "text": " dibujito aclaro una idea ya está el resto este técnica pero la idea es que las cosas que",
        "start": 2289.38,
        "end": 2297.7000000000003
    },
    {
        "text": " se pueden visualizar así que a ver vamos a poner un ejemplo concreto vamos a suponer",
        "start": 2297.7000000000003,
        "end": 2306.02
    },
    {
        "text": " vamos a suponer lo siguiente vamos a suponer que la dimensión de ese lambda 0 de 1 o sea la",
        "start": 2310.34,
        "end": 2318.82
    },
    {
        "text": " dimensión de su espacio propio asoció la onda 0 supongamos que es 3 sí",
        "start": 2318.82,
        "end": 2326.2200000000003
    },
    {
        "text": " este espacio tiene dimensión 3 este acá que tenga dimensión 5",
        "start": 2326.22,
        "end": 2342.18
    },
    {
        "text": " y el último pongamos la dimensión 6",
        "start": 2342.18,
        "end": 2356.02
    },
    {
        "text": " para poner un ejemplo concreto es decir que su espacio propia asoció la onda 0 tiene dimensión",
        "start": 2363.18,
        "end": 2369.8599999999997
    },
    {
        "text": " 3 si yo lo generé se lo generé echado 2 o tiene dimensión 5 lo que dibujé acá que contiene",
        "start": 2369.86,
        "end": 2376.5
    },
    {
        "text": " esto y si veo la dimensión de 3 tiene dimensión 6 y su espacio potencia de té menos lambda 0 por",
        "start": 2376.5,
        "end": 2384.5
    },
    {
        "text": " y no me aportan a nuevo es decir que esa construcción se termina ahí entonces cuál es la multiplicidad",
        "start": 2384.5,
        "end": 2394.2200000000003
    },
    {
        "text": " geométrica lambda 0 cuál es la multiplicidad geométrica lambda 0 te curo con la dibuja acá es",
        "start": 2394.22,
        "end": 2405.3799999999997
    },
    {
        "text": " 3 porque es la dimensión acá es la dimensión de su espacio propio estos son los factores",
        "start": 2406.3799999999997,
        "end": 2411.14
    },
    {
        "text": " propios propiamente dicho los otros son los factores propios generalizados pero los factores propios",
        "start": 2411.14,
        "end": 2416.2999999999997
    },
    {
        "text": " propiamente dicho están acá la dimensión la multiplicidad geométrica lambda 0 es 3 y cuáles",
        "start": 2416.3,
        "end": 2423.54
    },
    {
        "text": " la multiplicidad geográfica bueno lo que los comentarios acá se prueba que la multiplicidad geográfica es la",
        "start": 2423.54,
        "end": 2430.42
    },
    {
        "text": " dimensión del espacio más grande a partir de que haya no por lo más nada o sea que la multiplicidad",
        "start": 2430.42,
        "end": 2434.6600000000003
    },
    {
        "text": " geográfica es la dimensión de este más grande es 6 entonces multiplicidad geométrica de lambda",
        "start": 2434.6600000000003,
        "end": 2443.46
    },
    {
        "text": " 0 es igual a 3 multiplicidad geográfica de lambda 0 es igual a 6 o sea que en principio",
        "start": 2443.46,
        "end": 2452.26
    },
    {
        "text": " lo tengo que agregar a 3 vectores de la base lambda 0 3 vectores más para formar una base de",
        "start": 2452.26,
        "end": 2457.14
    },
    {
        "text": " ese espacio ese subesparcio generalizado bien y acá viene la idea de la idea de llor",
        "start": 2457.14,
        "end": 2475.62
    },
    {
        "text": " empezamos de afuera para dentro de las cascaras de cebolla de esas que tengo ahí",
        "start": 2476.98,
        "end": 2481.02
    },
    {
        "text": " empezamos de afuera para dentro como entre este espacio que tiene dimensión 6 y este espacio que",
        "start": 2481.02,
        "end": 2490.5
    },
    {
        "text": " tiene dimensión 5 hay una dimensión extra vamos a elegir un vector acá podemos elegir tenemos",
        "start": 2490.5,
        "end": 2496.5
    },
    {
        "text": " una dimensión extra para elegir cosas acá acá acá o sea elegir un vector acá que nos está",
        "start": 2496.5,
        "end": 2500.38
    },
    {
        "text": " acá dentro está bien y solamente tengo una dimensión para digamos por elegir uno acá y",
        "start": 2500.38,
        "end": 2508.38
    },
    {
        "text": " no por elegir dos niñements independientes porque la diferencia entre este y este es una dimensión",
        "start": 2508.38,
        "end": 2511.94
    },
    {
        "text": " estamos entonces como la dimensión la dimensión de ese lambda 0 3 es igual a la dimensión de",
        "start": 2511.94,
        "end": 2528.1
    },
    {
        "text": " ese lambda 0 2 más 1 así tengo una dimensión de sobra ahí elegimos un vector",
        "start": 2528.1,
        "end": 2536.74
    },
    {
        "text": " un vector que le vamos a llamar ve uno que esté en ese lambda 0 3 pero que no esté en ese",
        "start": 2542.22,
        "end": 2551.5
    },
    {
        "text": " lambda 0 2 o sea que está en la cascara de cebolla y más de este vector de llamamos ve uno o sea",
        "start": 2551.5,
        "end": 2559.38
    },
    {
        "text": " que tengo el ve uno lo tengo acá",
        "start": 2559.38,
        "end": 2563.94
    },
    {
        "text": " bien qué hago ahora qué hago ahora supongo yo tengo un vector ahí que lo encontré qué",
        "start": 2563.94,
        "end": 2580.78
    },
    {
        "text": " hago ahora si yo este vector le aplico teme los lambda 0 por I a donde voy a parar voy a parar",
        "start": 2580.78,
        "end": 2586.9
    },
    {
        "text": " a la cascara de cebolla acá inferior a ese vector le vamos a llamar ve dos o sea segundo parte",
        "start": 2586.9,
        "end": 2595.02
    },
    {
        "text": " al vector que resulta de aplicarle teme los lambda 0 por I a este vector ve uno le vamos a",
        "start": 2596.86,
        "end": 2608.02
    },
    {
        "text": " llamar ve dos y ese vector por los resultados que les comenté recién si esto está en esta cascara",
        "start": 2608.02,
        "end": 2615.06
    },
    {
        "text": " este está en esta cascara o sea está es un vector generado de orden dos está en ese lambda",
        "start": 2615.06,
        "end": 2620.38
    },
    {
        "text": " 0 2 pero no está en ese lambda 0 1",
        "start": 2620.38,
        "end": 2625.06
    },
    {
        "text": " bien y qué hago ahora a este ve dos si le aplico teme los lambda 0 por I a donde vengo a parar",
        "start": 2635.14,
        "end": 2644.06
    },
    {
        "text": " al espacio acá abajo al espacio el vector es propio a ese vector le vamos a llamar ve tres",
        "start": 2644.06,
        "end": 2648.94
    },
    {
        "text": " ve tres se aplica el teme los lambda 0 por I a veros entonces T menos lambda 0 por I aplicado a",
        "start": 2648.94,
        "end": 2661.86
    },
    {
        "text": " ve dos a esto le llamó ve tres y esto es un es un vector propio propiamente dicho es un elemento",
        "start": 2661.86,
        "end": 2670.18
    },
    {
        "text": " de ese lambda 0 1 lo que llamamos ahí es el lambda 0 1",
        "start": 2670.18,
        "end": 2675.8199999999997
    },
    {
        "text": " cómo sigue la cosa les diga ahora sí en esto tiene dimensión 5 y esto tiene dimensión 3",
        "start": 2682.54,
        "end": 2692.8599999999997
    },
    {
        "text": " de acá exactamente me vengo acá como la diferencia de dimensiones entre ese lambda 0 2 y ese",
        "start": 2692.86,
        "end": 2704.86
    },
    {
        "text": " lambda 0 1 es 2 acá puedo todavía elegirme otro vector que esté acá y no está acá dentro",
        "start": 2704.86,
        "end": 2710.7000000000003
    },
    {
        "text": " que se alimienta independiente con esto por por el ejemplo estoy poniendo la diferencia",
        "start": 2710.7000000000003,
        "end": 2716.26
    },
    {
        "text": " dimensión esto tiene dimensión 3 y esto tiene dimensión 5 y acá elegir un vector bueno todavía",
        "start": 2716.26,
        "end": 2721.6600000000003
    },
    {
        "text": " me queda una dimensión extra para cubrir acá entonces elijo otro vector acá",
        "start": 2721.66,
        "end": 2725.2599999999998
    },
    {
        "text": " liamente independiente de este entonces cómo sigue la construcción elegimos en la caja de la",
        "start": 2725.2599999999998,
        "end": 2732.3399999999997
    },
    {
        "text": " fuera no elijo ya mandada porque la diferencia de la dimensión entre acá cada fuera y la",
        "start": 2732.3399999999997,
        "end": 2736.14
    },
    {
        "text": " adentro la 1 si fuera 2 seguiría el producimiento liguiendo acá",
        "start": 2736.14,
        "end": 2740.14
    },
    {
        "text": " entonces cómo sigue la cosa elegimos ahora",
        "start": 2741.02,
        "end": 2747.18
    },
    {
        "text": " cómo la dimensión de ese lambda 0 2 es la dimensión de ese lambda 0 1",
        "start": 2750.58,
        "end": 2761.9
    },
    {
        "text": " más 2 en este ejemplo concreto tenemos margen por el giro otro vector elegimos un vector que",
        "start": 2762.82,
        "end": 2772.82
    },
    {
        "text": " le vamos a llamar ve 4 que está en ese lambda 0 2 y no está en ese lambda 0 1 y que además es",
        "start": 2772.82,
        "end": 2785.5
    },
    {
        "text": " lineamente independiente con respecto al ve 1 pero al ve 2 está acá o sea elijo el ve 4 aquí",
        "start": 2785.5,
        "end": 2794.14
    },
    {
        "text": " adentro estamos lineamente independiente repito con este y ese con ese ve 4 que ahora si le",
        "start": 2794.14,
        "end": 2810.3
    },
    {
        "text": " aplico temenos la 0 por y vengo a parar acá abajo y ese vector le vamos a llamar ve 5",
        "start": 2810.3,
        "end": 2817.9
    },
    {
        "text": " paciencia que ya sale lo que estamos buscando",
        "start": 2825.1000000000004,
        "end": 2828.6200000000003
    },
    {
        "text": " ve 5 y ese ve 5 es un vector propio del lambda 1",
        "start": 2831.98,
        "end": 2837.34
    },
    {
        "text": " estamos y qué me queda qué me queda la dimensión del espacio de abajo este es 3 o sea que",
        "start": 2840.3,
        "end": 2860.82
    },
    {
        "text": " me queda acá tengo dos vectores que de nuevo sin probarlo se prueba que si estos dos vectores",
        "start": 2860.82,
        "end": 2869.1400000000003
    },
    {
        "text": " acá son el e y entonces la aplicación de temenos la 0 por y por y lo que me llegan a",
        "start": 2869.14,
        "end": 2874.8199999999997
    },
    {
        "text": " abajo también son el e y eso también se prueba entonces este vector acá abajo es lineamente",
        "start": 2874.8199999999997,
        "end": 2880.46
    },
    {
        "text": " independiente de este y me queda todavía una dimensión extra ahí para cubrir entonces el",
        "start": 2880.46,
        "end": 2885.7
    },
    {
        "text": " dijo acá finalmente un vector ve 6 acá adentro que es el yemente independiente de estos otros",
        "start": 2885.7,
        "end": 2892.3799999999997
    },
    {
        "text": " dos entonces finalmente elegimos",
        "start": 2892.3799999999997,
        "end": 2894.58
    },
    {
        "text": " como la dimensión de el lambda 0 1 es igual a 3 me queda margen por el elegir otro vector entonces",
        "start": 2900.7799999999997,
        "end": 2910.8199999999997
    },
    {
        "text": " elegimos finalmente",
        "start": 2910.82,
        "end": 2914.5800000000004
    },
    {
        "text": " ve 6 que está en ese lambda 0 y con eso tengo 6 vectores que nuevo la construcción está",
        "start": 2918.1800000000003,
        "end": 2932.78
    },
    {
        "text": " entre otra de las cosas que hay que probar es que esta construcción me va fabricando vectores",
        "start": 2932.78,
        "end": 2936.02
    },
    {
        "text": " llámentes independientes en un espacio de dimensión 6 o sea que eso me da una base del espacio",
        "start": 2936.02,
        "end": 2943.38
    },
    {
        "text": " este esa parte hay que probarlo obviamente yo no la voy a probar tampoco la construcción me dice",
        "start": 2943.38,
        "end": 2950.94
    },
    {
        "text": " que esta manera proceder me va generando vectores llámentes independientes y que por lo tanto",
        "start": 2950.94,
        "end": 2956.42
    },
    {
        "text": " tengo tantos vectores llámentes independientes como la dimensión del espacio en el que estoy",
        "start": 2956.42,
        "end": 2960.74
    },
    {
        "text": " trabajando por tanto tengo una base si de nuevo si quedan si quedan dimensiones por cubrir el",
        "start": 2960.74,
        "end": 2966.06
    },
    {
        "text": " procedimiento seguiría si yo acá tuviera otra dimensión por cubrir la construcción otro vector",
        "start": 2966.06,
        "end": 2970.2999999999997
    },
    {
        "text": " llámentes independientes de esto le aplico t y voy bajando esa es la reyla para para construir la base",
        "start": 2970.2999999999997,
        "end": 2976.74
    },
    {
        "text": " ahora por qué que ventaja tiene esta construcción esta construcción",
        "start": 2976.74,
        "end": 2983.54
    },
    {
        "text": " esta construcción proporciona",
        "start": 2983.54,
        "end": 2990.9
    },
    {
        "text": " en general",
        "start": 2999.38,
        "end": 3000.7
    },
    {
        "text": " tantos vectores como la multiplicidad gebraica del amdacero",
        "start": 3005.86,
        "end": 3009.38
    },
    {
        "text": " qué son el a y o sea son una base del espacio",
        "start": 3013.7,
        "end": 3020.74
    },
    {
        "text": " que forman una base del espacio de la última del último espacio de curato que contiene todos",
        "start": 3028.1,
        "end": 3033.94
    },
    {
        "text": " otros",
        "start": 3033.94,
        "end": 3034.94
    },
    {
        "text": " así que le habíamos llamado así esta construcción por proporciona",
        "start": 3041.86,
        "end": 3046.1
    },
    {
        "text": " m vectores llámentes independientes que fueron justamente una base del espacio más grande fíjemo",
        "start": 3046.1,
        "end": 3052.7000000000003
    },
    {
        "text": " veamos qué mirar en este caso esa base qué relación tiene los elementos de esa base y cómo se",
        "start": 3052.7000000000003,
        "end": 3060.54
    },
    {
        "text": " representa t en esa base asociado o sea la restricción de t a este subespacio en esa base",
        "start": 3060.54,
        "end": 3067.18
    },
    {
        "text": " recorremos como estoy olvidando todos los valores propios de todo el resto",
        "start": 3068.7799999999997,
        "end": 3072.06
    },
    {
        "text": " estamos entonces preguntas fíjense ahora qué interesante lo que pasa",
        "start": 3077.9,
        "end": 3085.7
    },
    {
        "text": " entonces con esto tenemos en el ejemplo tenemos un conjunto de vectores que le vamos a llamar",
        "start": 3085.7,
        "end": 3096.2599999999998
    },
    {
        "text": " ve uno ve dos ve tres hasta ve seis ve uno ve dos ve tres ve cuatro ve cinco y ve seis que son una base",
        "start": 3099.9399999999996,
        "end": 3109.22
    },
    {
        "text": " en este caso de su espacio es el amdacero de tres el que contiene los otros dos",
        "start": 3109.22,
        "end": 3114.62
    },
    {
        "text": " y esa base yo me podría decir bueno qué qué pinta tiene el operador té representado en esa base",
        "start": 3121.9399999999996,
        "end": 3130.66
    },
    {
        "text": " olvide monó el resto es como si tuviera restriciendo el operador té este subespacio",
        "start": 3131.4599999999996,
        "end": 3135.7799999999997
    },
    {
        "text": " y me olvidara del resto qué pinta tiene el operador té si lo es más trinco a una base v",
        "start": 3136.7400000000002,
        "end": 3142.1800000000003
    },
    {
        "text": " ese subespacio entonces tengo que aplicarle té a cada uno de los elementos de esta base y ver",
        "start": 3142.1800000000003,
        "end": 3147.94
    },
    {
        "text": " cómo se descompone como combinación y el elemento de base entonces veamos",
        "start": 3147.94,
        "end": 3152.1800000000003
    },
    {
        "text": " té menos lambra cero",
        "start": 3157.78,
        "end": 3159.38
    },
    {
        "text": " entonces veamos con toda la acción de té aplicado cada uno de estos vectores de la base pero en",
        "start": 3159.86,
        "end": 3166.78
    },
    {
        "text": " paz arranquemos por acá té menos lambra cero y aplicado ve uno que me da ve dos por construcción",
        "start": 3166.78,
        "end": 3175.94
    },
    {
        "text": " esto me da ve dos entonces esto me implica si yo desarmacar las cosas me implica que té aplicado",
        "start": 3175.94,
        "end": 3182.94
    },
    {
        "text": " un menos lambda cero por ve uno es igual a ve dos o sea lo que lo mismo te ha aplicado",
        "start": 3183.48,
        "end": 3189.2200000000003
    },
    {
        "text": " ve uno si lo paso por el otro lado al lambda cero por ve uno me queda esta relación",
        "start": 3189.2200000000003,
        "end": 3194.98
    },
    {
        "text": " repito esto es te ha aplicado ve uno menos lambda cero por ve uno igual a ve dos",
        "start": 3197.62,
        "end": 3202.2200000000003
    },
    {
        "text": " el lambda cero por ve uno lo paso por el otro lado entonces me queda te ha aplicado ve uno",
        "start": 3202.2200000000003,
        "end": 3206.04
    },
    {
        "text": " 1 es lambda 0 por 1 más b2. ¿Qué pasa con b2? Veamos que me da t menos lambda 0 por",
        "start": 3206.04,
        "end": 3214.16
    },
    {
        "text": " identidad aplicado a b2, eso por construcción era b3. T menos lambda 0 por diópico a b2 era",
        "start": 3214.16,
        "end": 3225.82
    },
    {
        "text": " b3, o sea esto es b3, de esta manera que desarmando las cosas me queda que t aplicado",
        "start": 3225.82,
        "end": 3232.94
    },
    {
        "text": " a b2 es lambda 0 por b2 más b3, sí por la manera en que yo construyendo las cosas. Y",
        "start": 3232.94,
        "end": 3248.0
    },
    {
        "text": " cuánto vale t aplicado a b3? ¿Cuánto vale t aplicado a b3? La nacer por b3 pues justamente",
        "start": 3248.0,
        "end": 3259.6
    },
    {
        "text": " es b3, sí un vector propio, ¿no? B3 sí es un vector propio, de esta manera que si yo",
        "start": 3259.6,
        "end": 3265.52
    },
    {
        "text": " a b3 le aplico t me queda t a b3 es igual a lambda 0 por b3, esto es porque b3 es vector",
        "start": 3265.52,
        "end": 3274.64
    },
    {
        "text": " propio asociado a lambda 0. Veamos por el vector propio de lambda 0. ¿Qué me pasa con el b4?",
        "start": 3274.64,
        "end": 3287.7799999999997
    },
    {
        "text": " T menos lambda 0 por identidad aplicado a b4, que me da t menos lambda 0 por identidad",
        "start": 3291.2999999999997,
        "end": 3302.52
    },
    {
        "text": " de b4, me da b5, o lo que lo mismo, t aplicado a b4 es lambda 0 por b4 más b5, que me da t aplicado",
        "start": 3302.52,
        "end": 3325.08
    },
    {
        "text": " a b5, t aplicado a b5 como b5 es vector propio, t aplicado a b5 es lambda 0 por b5, esto de nuevo",
        "start": 3325.08,
        "end": 3341.2
    },
    {
        "text": " porque b5 es vector propio de lambda 0. Y me queda el último, ¿qué me pasa con t aplicado a b6?",
        "start": 3341.2,
        "end": 3350.12
    },
    {
        "text": " Bueno, b6 es vector propio, sé que t aplicado a b6 es lambda 0 por b6 y igual a lambda 0 por b6",
        "start": 3350.12,
        "end": 3363.04
    },
    {
        "text": " pues b6 es vector propio asociado a lambda 0 y acá tengo todo lo que necesitaba para ver cómo se",
        "start": 3363.04,
        "end": 3374.0
    },
    {
        "text": " representa t en esa base construir que es la base de Jordan.",
        "start": 3374.0,
        "end": 3379.04
    },
    {
        "text": " ¡Sarul!",
        "start": 3379.04,
        "end": 3384.32
    },
    {
        "text": " Sí, claro, exactamente, exactamente, exactamente, aquí como si tuvieros considerando la",
        "start": 3384.32,
        "end": 3402.8
    },
    {
        "text": " restricción de t a esta subespacia, pero toda esta subespacia, toda esta construcción",
        "start": 3402.8,
        "end": 3407.2000000000003
    },
    {
        "text": " está asociada a un valor propio que tenía la particularidad que la subimensión sumulmilla",
        "start": 3407.2000000000003,
        "end": 3412.44
    },
    {
        "text": " geomética era menor que la multiplicidad geomética y eso lo hago con cada uno de eso y justamente",
        "start": 3412.44,
        "end": 3418.8
    },
    {
        "text": " termino de cubrir todo el espacio porque la dimensión de esto coincide con la multiplicidad",
        "start": 3418.8,
        "end": 3423.4
    },
    {
        "text": " geomética y la suma de las multiplicidades geométricas que me quedare en la dimensión",
        "start": 3423.4,
        "end": 3427.52
    },
    {
        "text": " del espacio total. Fíjense en esta parte cómo queda.",
        "start": 3427.52,
        "end": 3434.56
    },
    {
        "text": " Miren si no es linda la construcción.",
        "start": 3434.56,
        "end": 3437.16
    },
    {
        "text": " Yo voy a ver qué me da.",
        "start": 3437.16,
        "end": 3439.06
    },
    {
        "text": " T en esa base y como le decía el principio en realidad lo que estoy haciendo es la restricción",
        "start": 3439.06,
        "end": 3447.8
    },
    {
        "text": " de t a su espacio es lambda 0, ya vamos a ver cuando hablamos de su espacio invariante,",
        "start": 3447.8,
        "end": 3453.52
    },
    {
        "text": " es lambda 0 3.",
        "start": 3453.52,
        "end": 3456.8
    },
    {
        "text": " La restricción de t a esta subespacia es la base porque me estoy olvidando todo el resto",
        "start": 3456.8,
        "end": 3461.6000000000004
    },
    {
        "text": " de todo el resto, no?",
        "start": 3461.6000000000004,
        "end": 3462.6000000000004
    },
    {
        "text": " Yo estoy haciendo eso.",
        "start": 3462.6000000000004,
        "end": 3464.46
    },
    {
        "text": " Entonces cómo se calcula esto, esta matria asociada, bueno, aplico t al primer elemento",
        "start": 3464.46,
        "end": 3476.0800000000004
    },
    {
        "text": " tembe 1 y lo descompongo como comienzo ni en estos elementos.",
        "start": 3476.0800000000004,
        "end": 3479.1800000000003
    },
    {
        "text": " Qué aplico v1 es lambda 0 por v1 más v2 o sea escordenazón lambda 0 1 0 0 0 0 0.",
        "start": 3479.18,
        "end": 3488.66
    },
    {
        "text": " Es decir que templico v1 me da lambda 0 v1 más v2 lambda 0 1 0 0 0 0 0 0.",
        "start": 3488.66,
        "end": 3503.22
    },
    {
        "text": " Este ya fue.",
        "start": 3503.22,
        "end": 3505.4199999999996
    },
    {
        "text": " Te aplico v2, me da lambda 0 v2 más v3 o sea me da las coordenazón 0 lambda 0 1 0 0 0 0 0 lambda",
        "start": 3505.4199999999996,
        "end": 3519.5
    },
    {
        "text": " 0 1 0 0 0.",
        "start": 3519.5,
        "end": 3528.58
    },
    {
        "text": " Te ha aplicado v3, es lambda 0 por v3, coordenazón 0 0 lambda 0, etc.",
        "start": 3528.58,
        "end": 3533.8199999999997
    },
    {
        "text": " 0 0 lambda 0 0 0 0.",
        "start": 3533.8199999999997,
        "end": 3548.2999999999997
    },
    {
        "text": " Se sentí en lo que estoy haciendo.",
        "start": 3548.2999999999997,
        "end": 3550.58
    },
    {
        "text": " Te ha aplicado tu construido una matria asociada en esta base, o sea te ha aplicado v4, es",
        "start": 3550.58,
        "end": 3554.98
    },
    {
        "text": " lambda 0 por v4 más v5 las coordenazón lambda 0 que corresponde al lugar 4 y 1 la que corresponde",
        "start": 3554.98,
        "end": 3561.66
    },
    {
        "text": " al lugar 5 y además 0.",
        "start": 3561.66,
        "end": 3563.36
    },
    {
        "text": " O sea que acá me va a quedar.",
        "start": 3563.36,
        "end": 3567.06
    },
    {
        "text": " 0 0 0 lambda 0 1 0.",
        "start": 3567.06,
        "end": 3576.14
    },
    {
        "text": " Y finalmente te ha aplicado v5 lambda 0 por v5, se ha aplicado un lambda 0 en la diagonal",
        "start": 3576.14,
        "end": 3581.38
    },
    {
        "text": " y te ha aplicado v6 lambda 0 por v6.",
        "start": 3581.38,
        "end": 3583.98
    },
    {
        "text": " O sea que los últimos verán 0 0 0 0 0 lambda 0 0 y 0 0 0 0 lambda 0.",
        "start": 3583.98,
        "end": 3598.18
    },
    {
        "text": " Y eso es lo que se llama la forma de bloque de Jordan asociados al valor propio lambda",
        "start": 3598.18,
        "end": 3606.02
    },
    {
        "text": " 0.",
        "start": 3606.02,
        "end": 3607.02
    },
    {
        "text": " Fíjense que es algo que en la diagonal tiene todo lo que se repite al valor propio",
        "start": 3607.02,
        "end": 3612.06
    },
    {
        "text": " lambda 0 el que está en la valor propio que está considerando justamente.",
        "start": 3612.06,
        "end": 3616.94
    },
    {
        "text": " Y fuera de la diagonal hay unos y cero y después el resto es todo cero.",
        "start": 3616.94,
        "end": 3623.72
    },
    {
        "text": " Y esa es la forma de Jordan o una de las formas de Jordan de este depende del orden que",
        "start": 3623.72,
        "end": 3628.98
    },
    {
        "text": " todo me ha ido a los vectores.",
        "start": 3628.98,
        "end": 3632.62
    },
    {
        "text": " Fíjense lo siguiente, eso es lo que se llama el bloque de Jordan.",
        "start": 3632.62,
        "end": 3640.9
    },
    {
        "text": " Bloque ya lo definí la clase que viene que son los bloques, es esto, esencialmente.",
        "start": 3640.9,
        "end": 3647.3399999999997
    },
    {
        "text": " El bloque de Jordan asoció la lambda 0.",
        "start": 3647.34,
        "end": 3668.1000000000004
    },
    {
        "text": " Si uno es medio obsesivo, compulsivo, psicópata, molesta que acá ya algunos 1 y acá ya",
        "start": 3668.1000000000004,
        "end": 3675.6400000000003
    },
    {
        "text": " algunos 0.",
        "start": 3675.64,
        "end": 3676.64
    },
    {
        "text": " Sería lindo porque a veces hay uno y acá a veces hay cero.",
        "start": 3676.64,
        "end": 3680.56
    },
    {
        "text": " Fíjense que el bloque en realidad lo puedo pensar como lo puedo vivir en su bloque es",
        "start": 3680.56,
        "end": 3686.64
    },
    {
        "text": " como esto por ejemplo.",
        "start": 3686.64,
        "end": 3688.3199999999997
    },
    {
        "text": " Yo puedo pensar que esto es un subbloque, estos otros subbloques y estos otros subbloques",
        "start": 3688.3199999999997,
        "end": 3697.44
    },
    {
        "text": " donde acá eso subbloque tiene la particularidad exiguiente.",
        "start": 3697.44,
        "end": 3701.52
    },
    {
        "text": " El elemento le lleva una zonda 0 y todos los que están en la de Jordan a inferior son",
        "start": 3701.52,
        "end": 3704.9
    },
    {
        "text": " todos 1.",
        "start": 3704.9,
        "end": 3705.9
    },
    {
        "text": " Entonces acá tengo el de Jordan a inferior todos 1.",
        "start": 3705.9,
        "end": 3709.36
    },
    {
        "text": " Acá tengo la de Jordan a inferior todos 1.",
        "start": 3709.36,
        "end": 3711.68
    },
    {
        "text": " Bueno acá no tengo nada, pues el de Jordan a 0 y en el resto me quedan cero.",
        "start": 3711.68,
        "end": 3715.32
    },
    {
        "text": " O sea como que lo es participando en su bloque es que se van pegando y me van formando",
        "start": 3715.32,
        "end": 3720.52
    },
    {
        "text": " el bloque final de Jordan.",
        "start": 3720.52,
        "end": 3722.08
    },
    {
        "text": " O sea esto acá son los que se llaman los subbloques de Jordan.",
        "start": 3722.08,
        "end": 3731.16
    },
    {
        "text": " Subbloques de Jordan asociados al amda 0.",
        "start": 3731.16,
        "end": 3745.92
    },
    {
        "text": " Como la decía esto no es una matriz diagonal pero es algo que es fácil de manipular algebraicamente.",
        "start": 3745.92,
        "end": 3752.64
    },
    {
        "text": " Esa levantar.",
        "start": 3752.64,
        "end": 3753.92
    },
    {
        "text": " Sí.",
        "start": 3753.92,
        "end": 3754.92
    },
    {
        "text": " Se entiende la diferencia entre su bloque y bloque, lo subloque lo fabrico para que acá por",
        "start": 3754.92,
        "end": 3760.48
    },
    {
        "text": " definición todos los que está bajo un subbloque sean de la de Jordan a inferior a todos",
        "start": 3760.48,
        "end": 3764.82
    },
    {
        "text": " 1.",
        "start": 3764.82,
        "end": 3765.82
    },
    {
        "text": " O sea acá esto es un subbloque, esto es un bloque, es otro subbloque.",
        "start": 3765.82,
        "end": 3770.4
    },
    {
        "text": " Ahora fíjense el primero el primero el bloque que dibujé ahí el más grande con qué",
        "start": 3770.4,
        "end": 3777.58
    },
    {
        "text": " vectores está asociados.",
        "start": 3777.58,
        "end": 3781.76
    },
    {
        "text": " Con el 1, 2 y el 3 que justamente son los vectores de esta cadenita acá.",
        "start": 3781.76,
        "end": 3789.04
    },
    {
        "text": " Esta cadenita me da un bloque.",
        "start": 3789.04,
        "end": 3793.32
    },
    {
        "text": " Sí.",
        "start": 3793.32,
        "end": 3794.32
    },
    {
        "text": " El segundo está asociado con el 4 y el 5 que son esta cadenita acá.",
        "start": 3794.32,
        "end": 3799.76
    },
    {
        "text": " La cadenita acá me da el segundo bloque, subbloque y el último está asociado con",
        "start": 3799.76,
        "end": 3804.48
    },
    {
        "text": " esta acá que me da este último subbloque.",
        "start": 3804.48,
        "end": 3808.28
    },
    {
        "text": " Es decir tenemos tanto subbloques como cadenitas tenemos ahí.",
        "start": 3808.28,
        "end": 3816.0400000000004
    },
    {
        "text": " Dicho otra manera tenemos tanto subbloques cada cadena termino en un vector propio.",
        "start": 3816.0400000000004,
        "end": 3820.32
    },
    {
        "text": " O sea tenemos tanto subbloques como vectores propios en la base.",
        "start": 3820.32,
        "end": 3824.88
    },
    {
        "text": " Acá tengo 3 vectores propios en la base tengo una cadenita por cada vector propio.",
        "start": 3824.88,
        "end": 3829.0400000000004
    },
    {
        "text": " O sea que tengo el igual que le correspondería las vectores propios son estos.",
        "start": 3829.04,
        "end": 3833.52
    },
    {
        "text": " Esto acá es un vector propio, esto acá es un vector propio y esto acá es un vector",
        "start": 3833.52,
        "end": 3839.04
    },
    {
        "text": " propio.",
        "start": 3839.04,
        "end": 3840.04
    },
    {
        "text": " O sea que tengo tanto subbloques como vectores propios, como vectores propios niñamente",
        "start": 3840.04,
        "end": 3848.0
    },
    {
        "text": " independientes, o sea como la dimensión de este espacio.",
        "start": 3848.0,
        "end": 3854.0
    },
    {
        "text": " Y los tamaños de los subbloques con qué tienen que ver.",
        "start": 3854.0,
        "end": 3857.12
    },
    {
        "text": " Con los tamaños de las cadenitas estas, de las cadenas estas.",
        "start": 3857.12,
        "end": 3860.08
    },
    {
        "text": " Una cadena acá de quimolucra 3 vectores en la iteración me da un subbloque tamaño 3",
        "start": 3860.08,
        "end": 3866.48
    },
    {
        "text": " por 3.",
        "start": 3866.48,
        "end": 3867.48
    },
    {
        "text": " La quimolucra 2 iteraciones me da un subbloque tamaño 2 por 2.",
        "start": 3867.48,
        "end": 3873.04
    },
    {
        "text": " De quimolucra 1 iteración me da un subbloque tamaño 1.",
        "start": 3873.04,
        "end": 3878.48
    },
    {
        "text": " Eso es lo que hay que ver para ver cómo es la forma, cómo son los subbloques de",
        "start": 3878.48,
        "end": 3883.44
    },
    {
        "text": " llordan de un valor propio.",
        "start": 3883.44,
        "end": 3885.92
    },
    {
        "text": " Podrían ser por ejemplo, podrían ser diferente, podrían ser un bloque grande tamaño, no,",
        "start": 3885.92,
        "end": 3893.16
    },
    {
        "text": " bueno, podría ser diferente, podría tener más bloque un bloque tamaño 4, un bloque",
        "start": 3893.16,
        "end": 3898.12
    },
    {
        "text": " tamaño 2, podría tener un bloque tamaño 5, un bloque tamaño 1, depende de cómo es la",
        "start": 3898.12,
        "end": 3902.7200000000003
    },
    {
        "text": " construcción ésta.",
        "start": 3902.7200000000003,
        "end": 3903.7200000000003
    },
    {
        "text": " ¿Se entiende?",
        "start": 3903.7200000000003,
        "end": 3904.7200000000003
    },
    {
        "text": " Ahora él la practica.",
        "start": 3904.7200000000003,
        "end": 3905.7200000000003
    },
    {
        "text": " Sí.",
        "start": 3905.7200000000003,
        "end": 3906.7200000000003
    },
    {
        "text": " ¿Se lo ponemos de lado?",
        "start": 3906.7200000000003,
        "end": 3907.7200000000003
    },
    {
        "text": " No, sí, no, pero lo que pasa es que esto acá estoy pensando que se termina el calit",
        "start": 3907.7200000000003,
        "end": 3915.6800000000003
    },
    {
        "text": " iteración en 3, suponemos que se irá una más.",
        "start": 3915.68,
        "end": 3918.2
    },
    {
        "text": " Se podría tener o acá mismo, no más podría tener 2 bloques tamaño 3, un bloque lo",
        "start": 3918.2,
        "end": 3925.2
    },
    {
        "text": " fabricó así, por ejemplo acá tuviera esto de dimension 2, esto tuviera de dimension",
        "start": 3925.2,
        "end": 3929.2
    },
    {
        "text": " 2 extra, entonces tengo 2 acá, 2 acá y 2 acá.",
        "start": 3929.2,
        "end": 3933.9199999999996
    },
    {
        "text": " Eso me daría 2 bloques tamaño 3.",
        "start": 3933.9199999999996,
        "end": 3937.9199999999996
    },
    {
        "text": " Se me une el último con ese mismo, exactamente.",
        "start": 3937.9199999999996,
        "end": 3940.52
    },
    {
        "text": " ¿Cómo?",
        "start": 3940.52,
        "end": 3941.52
    },
    {
        "text": " Entonces para saber por qué uno april no sabe como es la estructura de uno sabe cuál",
        "start": 3941.52,
        "end": 3947.7599999999998
    },
    {
        "text": " es la dimensión de esta matriz, porque esta matriz tiene dimensión de coinciden con",
        "start": 3947.7599999999998,
        "end": 3951.68
    },
    {
        "text": " la multiplicidad geobraica, pero no sabe ni cuántos, bueno, cuántos subloques sí lo sabe",
        "start": 3951.68,
        "end": 3957.28
    },
    {
        "text": " porque me lo da la multiplicidad geométrica, pero ¿cómo que forma que esta manio tiene",
        "start": 3957.28,
        "end": 3962.36
    },
    {
        "text": " esos subloques?",
        "start": 3962.36,
        "end": 3963.36
    },
    {
        "text": " Hay que ver esto, se entendió.",
        "start": 3963.36,
        "end": 3967.2400000000002
    },
    {
        "text": " En la práctica, en la práctica, una arranca de abajo para arriba, es quiero decir, esto",
        "start": 3967.2400000000002,
        "end": 3979.7200000000003
    },
    {
        "text": " lo hice para construir el esquema este, una arranca con los vectores propios, recorremos",
        "start": 3979.7200000000003,
        "end": 3984.96
    },
    {
        "text": " que los vectores propios uno sabe como calcularlo, una base vectores propios o lo saben hacer,",
        "start": 3984.96,
        "end": 3989.92
    },
    {
        "text": " una arranca con una base vectores propios, yo tengo acá este vector propio de la base",
        "start": 3989.92,
        "end": 3995.2400000000002
    },
    {
        "text": " y me fico, ¿cuál será el V2 acata que si le aplico términos de la ansero por I llegó",
        "start": 3995.2400000000002,
        "end": 3999.28
    },
    {
        "text": " acá?",
        "start": 3999.28,
        "end": 4000.28
    },
    {
        "text": " Eso tengo que resolución sistemas de coaciones liñales, eso me da un V2 y después me",
        "start": 4000.28,
        "end": 4004.08
    },
    {
        "text": " preguntó ¿cuál es el V1 hasta que si le aplico términos de la ansero por I llegó acá?",
        "start": 4004.08,
        "end": 4008.28
    },
    {
        "text": " Eso es resolución de sistemas de cocciones liñales.",
        "start": 4008.28,
        "end": 4010.4
    },
    {
        "text": " Entonces de manera recurciva arranco con los vectores de la base y voy subiendo y así",
        "start": 4010.4,
        "end": 4015.02
    },
    {
        "text": " voy calculando este, este, este, este.",
        "start": 4015.02,
        "end": 4019.08
    },
    {
        "text": " Si obtengo esplicitamente una base de llorda, no sé, así en esta construcción sabemos",
        "start": 4019.08,
        "end": 4027.52
    },
    {
        "text": " cómo es la forma de llorda y cómo se obtiene una base asociada.",
        "start": 4027.52,
        "end": 4034.04
    },
    {
        "text": " Es mucho problema el práctico, se le da la forma de llorda, esa es una información",
        "start": 4034.04,
        "end": 4037.52
    },
    {
        "text": " valiosa y se le pide encontrar una base, que es el problema mucho más sencillo que decirle",
        "start": 4037.52,
        "end": 4042.24
    },
    {
        "text": " encuentran la forma de llorda, pero la forma de llorda en que es decir hacer esto.",
        "start": 4042.24,
        "end": 4048.72
    },
    {
        "text": " Vamos, por algo así sofamos su llorda.",
        "start": 4048.72,
        "end": 4055.72
    },
    {
        "text": " Tobio no termino la clase, pero en la clase que viene vamos a definir en general esto",
        "start": 4055.72,
        "end": 4063.8799999999997
    },
    {
        "text": " mismo, que son los bloques y son los subbloques.",
        "start": 4063.8799999999997,
        "end": 4066.08
    },
    {
        "text": " Lo que es hacer es la suela como dar de tamaño que acá estén los más chiquitos y acá",
        "start": 4066.08,
        "end": 4070.3599999999997
    },
    {
        "text": " estén los más grandes, pero es un capricho matemático.",
        "start": 4070.3599999999997,
        "end": 4073.68
    },
    {
        "text": " Es simplemente cambiales el nombre, cambiales el orden a los factores de acá, pero tanto",
        "start": 4073.68,
        "end": 4080.8399999999997
    },
    {
        "text": " es una convención.",
        "start": 4080.8399999999997,
        "end": 4085.2799999999997
    },
    {
        "text": " Preguntas estamos de tiempo, no me diven que no es ingeniosa la construcción de llordas,",
        "start": 4085.2799999999997,
        "end": 4101.76
    },
    {
        "text": " todo esto casi que debería terminar llordan acá, pero bueno vamos, tenemos una clase",
        "start": 4101.76,
        "end": 4105.2
    },
    {
        "text": " más, una clase media para hacer algunos comentarios más.",
        "start": 4105.2,
        "end": 4111.12
    },
    {
        "text": " Lo que quiero cerrar la clase de hoy, definiendo la noción de su espacio invariante, pues",
        "start": 4111.12,
        "end": 4115.84
    },
    {
        "text": " yo le dije al principio, este su espacio grande es invariante, entonces me puedo concentrar",
        "start": 4115.84,
        "end": 4121.4800000000005
    },
    {
        "text": " ahí, ¿qué quiere decir que es invariante?",
        "start": 4121.4800000000005,
        "end": 4123.08
    },
    {
        "text": " Quisiera que te aplico a los factores que están acá, no salgo ese espacio.",
        "start": 4123.08,
        "end": 4128.16
    },
    {
        "text": " Ahora construir una base, me puedo restringir primero ese sub espacio, tener una base y después",
        "start": 4128.16,
        "end": 4133.5199999999995
    },
    {
        "text": " seguir.",
        "start": 4133.5199999999995,
        "end": 4135.32
    },
    {
        "text": " Entonces vamos a definir, esto es muy bien, es la primera página del capítulo forma",
        "start": 4135.32,
        "end": 4141.12
    },
    {
        "text": " de lloran que estén el libro rojo.",
        "start": 4141.12,
        "end": 4146.28
    },
    {
        "text": " Definición.",
        "start": 4146.28,
        "end": 4156.5199999999995
    },
    {
        "text": " Tenemos usted, uno para el brillante de Benvenve, uno dice que un sub espacio, W obviamente",
        "start": 4156.52,
        "end": 4171.4400000000005
    },
    {
        "text": " un sub espacio del espacio en el que estamos trabajando, un sub espacio W es invariante,",
        "start": 4171.4400000000005,
        "end": 4185.400000000001
    },
    {
        "text": " bajo la acción de T, si aplicar de T a los factores su espacio me da factores en ese",
        "start": 4185.4,
        "end": 4197.12
    },
    {
        "text": " sub espacio, o sea sí, la imagen de T aplica a todos los factores de acá está conteniendo",
        "start": 4197.12,
        "end": 4203.96
    },
    {
        "text": " W, está en O sea sí, este T aplicado W está conteniendo W, esto acá son por definición",
        "start": 4203.96,
        "end": 4220.28
    },
    {
        "text": " que es que eso, ¿qué significa T aplicado W? Es el conjunto de todos los factores de",
        "start": 4220.28,
        "end": 4225.92
    },
    {
        "text": " la forma T aplicado algo en W, es la idea de esa imagen de una transformación.",
        "start": 4225.92,
        "end": 4234.56
    },
    {
        "text": " Sí, se entiende la idea, por ejemplo, quiere decir, yo tengo acá el espacio de Victoria",
        "start": 4234.56,
        "end": 4241.24
    },
    {
        "text": " al B y tengo el espacio de Victoria al B, considero acá un sub espacio que le llamamos",
        "start": 4241.24,
        "end": 4247.9
    },
    {
        "text": " W, lo pongo acá también y lo que significa es que si yo le aplico T a todos los elementos",
        "start": 4247.9,
        "end": 4254.08
    },
    {
        "text": " que están acá dentro, caigo acá dentro, eso quiere decir que sea invariante, o sea",
        "start": 4254.08,
        "end": 4261.32
    },
    {
        "text": " que la acción de T sobre las cosas que están acá no me sacan de ese sub espacio.",
        "start": 4261.32,
        "end": 4266.08
    },
    {
        "text": " Y la bien propósición, un par de resultados muy sencillos de probar que les comento ahora",
        "start": 4266.08,
        "end": 4276.16
    },
    {
        "text": " y con eso terminamos. Por ejemplo una pregunta, si yo considero el sub espacio es el",
        "start": 4276.16,
        "end": 4292.08
    },
    {
        "text": " anda cero, asociado un valor propio cualquiera, W es el anda y yo le aplico T a un vector",
        "start": 4292.08,
        "end": 4300.599999999999
    },
    {
        "text": " de ahí, que me da, me da el mismo vector multiplicado por landa, o sea que T aplicado",
        "start": 4300.6,
        "end": 4306.56
    },
    {
        "text": " ese anda, está contenido en ese anda, o sea que ese anda es un sub espacio invariante,",
        "start": 4306.56,
        "end": 4314.240000000001
    },
    {
        "text": " yo le aplico T al sub espacio propio y nunca me salgo ese sub espacio propio, me quedo",
        "start": 4314.240000000001,
        "end": 4318.360000000001
    },
    {
        "text": " ahí siempre. Por eso le pones o encaja acá la definición de invariante, por tiene que",
        "start": 4318.360000000001,
        "end": 4326.64
    },
    {
        "text": " ver con su sub espacio propio, más aún se puede ver que su espacio generalizado también",
        "start": 4326.64,
        "end": 4331.12
    },
    {
        "text": " son invariados. La proposición que voy a probar ahora es muy sencilla.",
        "start": 4331.12,
        "end": 4337.92
    },
    {
        "text": " Me dice, tengo T, V, V vamos a pensar que la dimensión de V finita, le voy a llamar",
        "start": 4337.92,
        "end": 4359.4
    },
    {
        "text": " N por comodidad, entonces y vamos a considerar que W es un sub espacio invariante. El resultado",
        "start": 4359.4,
        "end": 4382.36
    },
    {
        "text": " me dice que existe una base del espacio vectorial, tal que la matria sociedad tiene esa base",
        "start": 4382.36,
        "end": 4402.4
    },
    {
        "text": " vectorial, tiene la siguiente forma, tiene una forma de bloques de la siguiente manera,",
        "start": 4402.4,
        "end": 4419.799999999999
    },
    {
        "text": " hay sesor matrices cuadradas, esta V no necesariamente cuadrada y esta tampoco, pero",
        "start": 4419.8,
        "end": 4435.28
    },
    {
        "text": " importante que acá abajo tengo todos cero, este subbloque de este bloque que tengo ahí son todos",
        "start": 4435.28,
        "end": 4441.5599999999995
    },
    {
        "text": " elementos nubros. Y cómo es la idea? Bueno ya va a quedar claro cuáles son las dimensiones",
        "start": 4441.5599999999995,
        "end": 4457.08
    },
    {
        "text": " de estas matrices cuadradas, cuáles la idea, fíjense, supongamos que la dimensión de W",
        "start": 4457.08,
        "end": 4468.4
    },
    {
        "text": " es igual a M, le llamó M, a la dimensión de W a su espacio invariante. Entonces vamos a construir",
        "start": 4468.4,
        "end": 4477.12
    },
    {
        "text": " una base W de perdón de V, primero construir una base W y completando la plataforma una base de V,",
        "start": 4477.12,
        "end": 4483.36
    },
    {
        "text": " entonces consideramos.",
        "start": 4483.36,
        "end": 4485.639999999999
    },
    {
        "text": " La demostración es bien bien sencilla, consideramos una base del sub espacio invariante y le completamos",
        "start": 4513.36,
        "end": 4519.4
    },
    {
        "text": " tener una base del espacio V, entonces ahí queda lo siguiente, queda los primeros M",
        "start": 4519.4,
        "end": 4537.5199999999995
    },
    {
        "text": " de vectores son base de W y después les agregamos otros vectores acá hasta tener una base del",
        "start": 4537.52,
        "end": 4556.280000000001
    },
    {
        "text": " espacio más grande, el V, como tiene dimensiones n puse ahí nub, hasta tener envectores. Ahora bien,",
        "start": 4556.28,
        "end": 4567.88
    },
    {
        "text": " para ver la matria asociada T en esta base tengo que aplicar la T a cada uno de los vectores y",
        "start": 4567.88,
        "end": 4574.4
    },
    {
        "text": " ver cómo se descompone, como W es invariante, te he aplicado a cada uno de los primeros",
        "start": 4574.4,
        "end": 4589.2
    },
    {
        "text": " y vectores, si lo aplico T a V1 eso tiene que estar en W, o sea T en V1 va a ser combinación",
        "start": 4589.2,
        "end": 4594.42
    },
    {
        "text": " niña de los elementos de la base que están en W, porque es invariante no me salgo W, lo mismo",
        "start": 4594.42,
        "end": 4601.099999999999
    },
    {
        "text": " T en V2, los mismo T en V3 etcétera, o sea que para los primeros M vectores tenemos que",
        "start": 4601.1,
        "end": 4606.26
    },
    {
        "text": " T en V y es combinación lineal de la base W, de los elementos de la base W y esto es para",
        "start": 4606.26,
        "end": 4627.9800000000005
    },
    {
        "text": " todo y para los primeros S y uno, hasta M, o sea que para los primeros M vectores como",
        "start": 4627.98,
        "end": 4633.66
    },
    {
        "text": " son una base W, como ya la aplico T y te es invariante, te he aplicado con un todo el",
        "start": 4633.66,
        "end": 4638.9
    },
    {
        "text": " vectore, me da combinación niña de estos vectores y las otras componentes serán cero, las",
        "start": 4638.9,
        "end": 4643.139999999999
    },
    {
        "text": " coronadas serán cero, o sea T en V y es combinación niña de los elementos de la base W para",
        "start": 4643.139999999999,
        "end": 4647.78
    },
    {
        "text": " todo y de unos T M y entonces que pasa cuando le aplico T a los primeros elementos al",
        "start": 4647.78,
        "end": 4657.58
    },
    {
        "text": " V1 me va a quedar combinación niña de las primeras M vectores a ver qué estoy dibujando",
        "start": 4657.58,
        "end": 4665.9
    },
    {
        "text": " acá, los primeros M vectores las coronadas van a ser algunas serán no triviales o",
        "start": 4665.9,
        "end": 4672.74
    },
    {
        "text": " otras sí que es yo, pero lo que si está seguro que las últimas coronadas son todos cero,",
        "start": 4672.74,
        "end": 4676.98
    },
    {
        "text": " las coronadas N menos N últimas van a ser todos cero, está claro eso, si lo aplico T en V1",
        "start": 4676.98,
        "end": 4688.26
    },
    {
        "text": " va a ser combinación niña de estos y no de estos porque es invariante, todas las coronadas",
        "start": 4688.26,
        "end": 4694.7
    },
    {
        "text": " que ven acá van a ser todos cero, porque lo aplico T en V2 va a ser combinación niña de estos,",
        "start": 4694.7,
        "end": 4699.139999999999
    },
    {
        "text": " pero no de estos todas las que ven acá va a ser para hacer cero etc. Así hasta llegar al T",
        "start": 4699.14,
        "end": 4704.9800000000005
    },
    {
        "text": " en VM o sea acá tengo una matriz M por M que será lo que debe hacer pero acá seguro que tengo",
        "start": 4704.9800000000005,
        "end": 4712.02
    },
    {
        "text": " todos cero, ahora cuando le aplico T a los que siguen bueno eso es la combinación de todos en",
        "start": 4712.02,
        "end": 4719.34
    },
    {
        "text": " principio, yo que sé los que es un vectore acá con la aplico T podría tener coronadas en W,",
        "start": 4719.34,
        "end": 4724.02
    },
    {
        "text": " no lo sé, que es invariante que si yo le aplico a algún W y me quedo en W, los otros no sé,",
        "start": 4724.02,
        "end": 4729.700000000001
    },
    {
        "text": " entonces el resto tendremos acá una matriz que le vamos a llamar B, donde acá me quedan",
        "start": 4729.700000000001,
        "end": 4738.34
    },
    {
        "text": " N menos M filas y acá una matriz cuadrada que le vamos a llamar C que es una matriz cuadrada",
        "start": 4739.860000000001,
        "end": 4746.900000000001
    },
    {
        "text": " de tamaño N menos M por N menos M, se entendió, sí, no, T en cada uno de estos vectores,",
        "start": 4746.9,
        "end": 4765.58
    },
    {
        "text": " para cada uno de los primeros M vectores, TNV1, TNV2 hasta TNVM y eso es combinación niña de",
        "start": 4765.58,
        "end": 4774.219999999999
    },
    {
        "text": " los elementos de la base de W, estamos por justamente invariante, entonces TNV1 será algo por esto,",
        "start": 4774.22,
        "end": 4782.38
    },
    {
        "text": " más algo por esto, más algo por esto, y el resto será más cero, más cero, más cero, más cero,",
        "start": 4782.38,
        "end": 4785.62
    },
    {
        "text": " más cero, por eso acá bien todo cero, bien y una última cosita, un detalle minúsculo,",
        "start": 4785.62,
        "end": 4794.820000000001
    },
    {
        "text": " que se lo dego como ejercicio,",
        "start": 4794.82,
        "end": 4801.58
    },
    {
        "text": " o observación, absolutamente trivial, si el espacio B se escribe como suma directa de 2",
        "start": 4801.58,
        "end": 4830.0199999999995
    },
    {
        "text": " subespacios U y WB y además ese U y WB son invariantes para la transformación lineal,",
        "start": 4830.02,
        "end": 4846.540000000001
    },
    {
        "text": " entonces",
        "start": 4846.54,
        "end": 4859.9
    },
    {
        "text": " en el caso particular de que un espacio B se asuma directa de 2 subespacios y esos 2 subespacios",
        "start": 4876.54,
        "end": 4899.7
    },
    {
        "text": " sean invariantes como en el caso cuando diagonalizamos, recuerda que me queda suma directa de",
        "start": 4899.7,
        "end": 4905.22
    },
    {
        "text": " subespacios propios que son invariantes, entonces puedo fabricar una base de este espacio tal que la",
        "start": 4905.22,
        "end": 4913.860000000001
    },
    {
        "text": " forma de la matrix, la forma la matrix asociarte en esa base es esto, es una matrix cuadrada,",
        "start": 4913.860000000001,
        "end": 4920.06
    },
    {
        "text": " otra matrix cuadrada y acá todo cero, pregunta cómo elegiría esa base,",
        "start": 4920.06,
        "end": 4931.66
    },
    {
        "text": " fíjense lo siguiente, como B suma directa de esto yo puedo construir una base de B agarrando",
        "start": 4935.34,
        "end": 4941.740000000001
    },
    {
        "text": " una base de esto y una base de esto y tomándolo unión, propias suma directa, entonces consideramos",
        "start": 4941.740000000001,
        "end": 4947.820000000001
    },
    {
        "text": " una base de una base de forma B1, B2 hasta Bm ya escribe que es esto, consideramos una base",
        "start": 4947.82,
        "end": 4972.299999999999
    },
    {
        "text": " ordenada de la siguiente forma, B1, B2 hasta Bm donde esto, esto acá, ven esto acá es una base de U y",
        "start": 4972.3,
        "end": 4984.7
    },
    {
        "text": " la otra es una base exactamente y la otra es una base de W, sí, entonces si agar una base de U y una base",
        "start": 4984.7,
        "end": 4995.62
    },
    {
        "text": " de W y tomo la unión por ser suma directa tengo una base de B, ahora fíjense por Cru y B y",
        "start": 4995.62,
        "end": 5001.74
    },
    {
        "text": " W invariantes, con oye la aplico T a cada uno de estos me queda combinación y allá de esto y",
        "start": 5001.74,
        "end": 5006.62
    },
    {
        "text": " los otros cero, quiero que tengo acá y con oye la aplico T a estos por ser invariante me queda",
        "start": 5006.62,
        "end": 5012.42
    },
    {
        "text": " combinación y allá de estos y los otros cero, que es lo que tengo acá, entonces qué tamaño tiene esta",
        "start": 5012.42,
        "end": 5017.98
    },
    {
        "text": " matrizá? Esto tiene esta matriz tiene el tamaño tiene que ver con la dimensión de su espacio U,",
        "start": 5017.98,
        "end": 5031.66
    },
    {
        "text": " si esto es M, esto es la dimensión de U, dimensión de U por dimensión de U y qué tamaño tiene esta?",
        "start": 5031.66,
        "end": 5039.54
    },
    {
        "text": " bueno tiene el tamaño de la dimensión de W, dimensión de W fila por dimensión de W columnas,",
        "start": 5040.1,
        "end": 5048.34
    },
    {
        "text": " entonces en ese caso cuando suma directa hay una representación matricial que tiene se separen",
        "start": 5048.34,
        "end": 5055.62
    },
    {
        "text": " bloques y el resto son todos esos, bueno para musacán entonces la clase que viene seguimos con estas",
        "start": 5055.62,
        "end": 5063.0199999999995
    },
    {
        "text": " cosas de Jordan pues ya la idea, la intuición ya está me parece ya está claro",
        "start": 5063.02,
        "end": 5067.820000000001
    }
]