[
    {
        "text": " Bueno, muy bien. Vamos a comenzar, entonces la charla de hoy. Hoy vamos a ver la parte final del",
        "start": 0.0,
        "end": 27.240000000000002
    },
    {
        "text": " curso que es referido a cómo toma las decisiones los consumidores. ¿Qué estuvimos viendo hasta ahora?",
        "start": 27.24,
        "end": 34.4
    },
    {
        "text": " Bueno, recuerdan que estuvimos viendo al principio todos unos conceptos referidos a lo que es",
        "start": 34.4,
        "end": 40.12
    },
    {
        "text": " la racionalidad económica, el costo oportunidad. Después estuvimos saborando elementos que no",
        "start": 40.12,
        "end": 46.8
    },
    {
        "text": " definían la función de producción, la frontera de posibilidad de producción, la toma de decisiones",
        "start": 46.8,
        "end": 51.8
    },
    {
        "text": " de la empresa en un mercado competencia perfecta en un monopolio. Vimos también a unos conceptos",
        "start": 51.8,
        "end": 59.559999999999995
    },
    {
        "text": " de oligopolio. Entonces ahora vamos a ver del punto vista del demandante, del punto de vista del",
        "start": 59.559999999999995,
        "end": 65.39999999999999
    },
    {
        "text": " consumidor, cómo toma las decisiones. Entonces, vamos a ver estos conceptos que están acá,",
        "start": 65.39999999999999,
        "end": 72.96
    },
    {
        "text": " las preferencias, las cubas de indiferencia, la reticción presupuestaria, los elementos que",
        "start": 75.84,
        "end": 81.28
    },
    {
        "text": " vamos a conocer a las herramientas que nos van a ayudar para definir cómo decide el consumidor,",
        "start": 81.28,
        "end": 88.92
    },
    {
        "text": " cómo demandante de bienes, cómo optimista, eso, cómo optimiza, pero cual es la lección",
        "start": 88.92,
        "end": 96.0
    },
    {
        "text": " óptima del consumidor. Vamos a ver qué pasa cuando varié el ingreso y el precio sobre",
        "start": 96.0,
        "end": 106.64
    },
    {
        "text": " este óptimo del consumidor y vamos a derivar la cuba de demanda. Vamos a considerar también una",
        "start": 106.64,
        "end": 119.4
    },
    {
        "text": " vez que le apuremos la cuba de demanda individual del consumidor, la cuba de demanda de mercado y luego",
        "start": 119.4,
        "end": 125.84
    },
    {
        "text": " vamos a ver alguna aplicación también de lo que vimos ya anteriormente sobre el mercado referido",
        "start": 125.84,
        "end": 131.08
    },
    {
        "text": " a las distisidades. Bien, entonces, que se considera como partida, se parte de que se va a",
        "start": 131.08,
        "end": 140.96
    },
    {
        "text": " analizar la conducta de un consumidor cualquiera que se entiende que es representativo de la conducta",
        "start": 140.96,
        "end": 146.20000000000002
    },
    {
        "text": " de los consumidores en un mercado de competencia perfecto. Entonces, la decisión que tiene que tomar",
        "start": 146.20000000000002,
        "end": 153.12
    },
    {
        "text": " ese consumidor es cuántas unidades va a consumir el bien, cuántas cantidades del bien va a demandar.",
        "start": 153.12,
        "end": 158.68
    },
    {
        "text": " Entonces, ¿e hice el objetivo principal? ¿Qué elemento hay que considerar? Por un lado hay que",
        "start": 161.60000000000002,
        "end": 170.84
    },
    {
        "text": " considerar que el consumidor va a enfrentarse a una toma de decisiones de múltiples combinaciones",
        "start": 170.84,
        "end": 179.88000000000002
    },
    {
        "text": " de bienes, múltiples alternativas, va a tener que elegir aquella alternativa donde optimice su",
        "start": 179.88000000000002,
        "end": 187.04000000000002
    },
    {
        "text": " satisfacción, su utilidad, la utilidad que está dado por ese consumo de esos bienes.",
        "start": 187.04,
        "end": 192.76
    },
    {
        "text": " Y ese justamente es el objetivo del consumidor, el objetivo del consumidor va a hacer maximizar su",
        "start": 197.6,
        "end": 202.84
    },
    {
        "text": " utilidad, su satisfacción que le da esa elección de los bienes que va a demandar, pero claro,",
        "start": 202.84,
        "end": 212.79999999999998
    },
    {
        "text": " como ya vimos también al inicio del curso, esto no es ilimitado, esto no es una cosa que",
        "start": 212.8,
        "end": 220.92000000000002
    },
    {
        "text": " edificativa el consumidor lo puede elegir libremente, sino que se va a sujetar a ciertos límites,",
        "start": 220.92000000000002,
        "end": 227.56
    },
    {
        "text": " a ciertas restricciones que son justamente los que les pone la cota y esto va tardado por el",
        "start": 227.56,
        "end": 237.20000000000002
    },
    {
        "text": " su nivel de ingreso y por el precio de los bienes. O sea que en definitiva esto se puede",
        "start": 237.2,
        "end": 243.79999999999998
    },
    {
        "text": " sintetizar que el consumidor se va a enfrentar a un problema económico, tiene que tomar una",
        "start": 243.79999999999998,
        "end": 249.44
    },
    {
        "text": " decisión tratando de optimizar su satisfacción y asignando la mejor forma posible los recursos que",
        "start": 249.44,
        "end": 255.51999999999998
    },
    {
        "text": " dispone, enfrentándose a diferentes alternativas que son exclusentes, entonces recordemos que elegir",
        "start": 255.51999999999998,
        "end": 265.36
    },
    {
        "text": " optar por una decisión que tome el consumidor por una de las opciones que elija el consumidor,",
        "start": 265.88,
        "end": 271.40000000000003
    },
    {
        "text": " perdonen, implica renunciar a las demás, eso costo, tiene la elección y este es el costo",
        "start": 271.40000000000003,
        "end": 278.2
    },
    {
        "text": " oportunidad, o sea elegir una alternativa implica renunciar a las demás, se asume obviamente",
        "start": 278.2,
        "end": 285.40000000000003
    },
    {
        "text": " que el consumidor tiene un comportamiento racional, comportamento racional que está aquí su",
        "start": 285.40000000000003,
        "end": 292.6
    },
    {
        "text": " yasente, es decir va a tratar de optimizar, va a tratar de elegir la canasta que le dé la",
        "start": 292.6,
        "end": 297.44
    },
    {
        "text": " mayor satisfacción posible, ¿qué elementos juega para elegir esta mejor canasta? Bueno hay dos",
        "start": 297.44,
        "end": 307.6
    },
    {
        "text": " elementos claves, uno de ellos son los gustos y las preferencias, los gustos y las preferencias",
        "start": 307.6,
        "end": 312.32000000000005
    },
    {
        "text": " que tenga el consumidor, es un elemento que va a jugar y lo que vamos a empezar a analizar y el",
        "start": 312.32000000000005,
        "end": 318.64000000000004
    },
    {
        "text": " otro es la restricción que le impone los precios y el ingreso, justamente los elementos",
        "start": 318.64,
        "end": 325.91999999999996
    },
    {
        "text": " relevantes que vamos a analizar acá son las preferencias, los gustos de los consumidores y la",
        "start": 325.91999999999996,
        "end": 330.44
    },
    {
        "text": " restricción presupuestable, referido a las preferencias, se asume ciertos padrones de",
        "start": 330.44,
        "end": 340.8
    },
    {
        "text": " comportamiento y ciertos elementos que se asume que dispone el consumidor, por un lado el",
        "start": 340.8,
        "end": 348.12
    },
    {
        "text": " consumidor se asume que tiene un sistema referido a sus preferencias de forma tal que las",
        "start": 348.12,
        "end": 355.0
    },
    {
        "text": " puede ordenar, las puede ordenar de tal forma que pueda distinguir cuál prefiere de las combinaciones",
        "start": 355.0,
        "end": 367.68
    },
    {
        "text": " con respecto a otra, hay un montón de combinaciones y el consumidor se asume que dispone de",
        "start": 367.68,
        "end": 376.8
    },
    {
        "text": " ciertos elementos que permite ordenar de forma tal que pueda calificar las de ese sentido,",
        "start": 376.8,
        "end": 383.96000000000004
    },
    {
        "text": " decir estas preferencias a la otra o eventualmente si ambas son igualmente preferibles que son",
        "start": 383.96000000000004,
        "end": 389.96000000000004
    },
    {
        "text": " indiferentes, para eso estas preferencias tienen ciertas propiedades, en primer lugar son completas,",
        "start": 389.96000000000004,
        "end": 398.56
    },
    {
        "text": " es decir, están todas alternativas posibles, en ese orden que habéis el consumidor están todas",
        "start": 399.52,
        "end": 407.44
    },
    {
        "text": " alternativas, así se comparan y se ordenan la por preferencia de las canastas del mercado,",
        "start": 407.44,
        "end": 416.28
    },
    {
        "text": " por lo tanto, al tener todas las alternativas el consumidor siempre puede responder cuál prefiere a",
        "start": 418.28,
        "end": 423.96
    },
    {
        "text": " otra, la otra opedad que se asume de las preferencias que son transitivos, esto es analo a los que",
        "start": 423.96,
        "end": 431.56
    },
    {
        "text": " ustedes la conocen en las propiedades matemáticas, esta existencia, es decir, si hay una combinación de",
        "start": 431.56,
        "end": 438.79999999999995
    },
    {
        "text": " bienes, ¿a qué preferida la B y a su vez B es preferida la C, entonces ya también preferida a la C?",
        "start": 438.79999999999995,
        "end": 446.91999999999996
    },
    {
        "text": " Otra de las propiedades que se asume de los gustos y la preferencia es que el consumidor",
        "start": 446.92,
        "end": 455.08000000000004
    },
    {
        "text": " asume un principio de no es asiable, nunca es asiable, es decir, el consumidor siempre",
        "start": 455.08000000000004,
        "end": 462.8
    },
    {
        "text": " puede preferir más bienes que menos, entonces ante diferentes alternativas el consumidor va a",
        "start": 462.8,
        "end": 477.16
    },
    {
        "text": " elegir a que ya que tiene mejor composición, al menos más cantidades de uno de los bienes,",
        "start": 477.16,
        "end": 485.16
    },
    {
        "text": " ¿qué es la utilidad? La utilidad habíamos dicho que es la satisfacción que obtiene el consumidor",
        "start": 485.16,
        "end": 495.04
    },
    {
        "text": " cuando consume un bien o un servicio y entonces obviamente permite ordenar como decía recién,",
        "start": 495.04,
        "end": 506.52000000000004
    },
    {
        "text": " entonces a medida que va consumiendo, a medida que va agregando más cantidades y ese bienes",
        "start": 506.52000000000004,
        "end": 512.0400000000001
    },
    {
        "text": " el servicio le brinda mayor utilidad, o sea le utilidad va creciendo, o sea que en definitiva",
        "start": 512.04,
        "end": 519.5999999999999
    },
    {
        "text": " la utilidad es creciente a medida que consume más y como ya vimos también lo vamos a reflejar",
        "start": 519.5999999999999,
        "end": 529.0799999999999
    },
    {
        "text": " acá, se asume que cada vez que consume una mayor cantidad de un bien, si bien la utilidad va creciendo",
        "start": 529.0799999999999,
        "end": 535.7199999999999
    },
    {
        "text": " esa utilidad es de creciente, la satisfacción que le brinda una unidad additional es de creciente",
        "start": 535.72,
        "end": 542.48
    },
    {
        "text": " y eso como ya lo vimos es valido para la inmensa mayoría de los bienes que estamos analizando",
        "start": 542.48,
        "end": 548.6800000000001
    },
    {
        "text": " entonces la funció de utilidad tiene la verdad que es ordinal, es decir el valor de utilidad no",
        "start": 548.6800000000001,
        "end": 558.36
    },
    {
        "text": " tiene un significado de sí mismo, importa el orden, por ejemplo como está acá sin frente",
        "start": 558.36,
        "end": 564.6800000000001
    },
    {
        "text": " dos canastas, sin todos canastas cualquiera, uso va y sube, el valor que se asigna la utilidad",
        "start": 564.6800000000001,
        "end": 572.52
    },
    {
        "text": " de una de 500 y la otra es mil, lo único que se puede afirmar acá es que el consumidor",
        "start": 572.52,
        "end": 580.04
    },
    {
        "text": " prefiera la canasta B porque le brinda mayor utilidad, lo que no podemos afirmar es que",
        "start": 580.04,
        "end": 586.4
    },
    {
        "text": " esa utilidad es el doble, de ahí que esta calificación ordinal lo que permite es ordenar",
        "start": 586.4,
        "end": 595.52
    },
    {
        "text": " nada más, bueno y esto es lo que decíamos recién, la función de utilidad es creciente",
        "start": 595.52,
        "end": 601.48
    },
    {
        "text": " en función de las cantidades consumidas y esa utilidad que va generando es imaginarmente",
        "start": 601.48,
        "end": 610.64
    },
    {
        "text": " de creciente y es un poco lo que se refleja acá en estas gráficas, a medida que voy aumentando",
        "start": 610.64,
        "end": 619.88
    },
    {
        "text": " la cantidad consumida la utilidad va creciendo pero cada vez va creciendo menos, una taza de",
        "start": 619.88,
        "end": 628.84
    },
    {
        "text": " creciente y la utilidad marginal es de creciente como ustedes pueden ver acá.",
        "start": 628.84,
        "end": 633.1999999999999
    },
    {
        "text": " ¿Cómo se expresa, cómo se manifiesta la función de utilidad? La función de utilidad se manifiesta",
        "start": 633.2,
        "end": 644.36
    },
    {
        "text": " en lo que se conoce gráficamente como la curva de indiferencia. La curva de indiferencia",
        "start": 644.36,
        "end": 653.88
    },
    {
        "text": " son todas las combinaciones de los bienes canastas que le brinda al consumidor el mismo",
        "start": 653.88,
        "end": 664.32
    },
    {
        "text": " nivel de satisfacción, la misma utilidad. Como dice la palabra, desde punto de vista es",
        "start": 664.32,
        "end": 672.92
    },
    {
        "text": " indiferente consumir una canasta u otra, del punto de vista de la satisfacción que le brinda,",
        "start": 672.92,
        "end": 678.32
    },
    {
        "text": " obviamente una canasta va a tener más componentes de un bien y menos de y la otra al revés.",
        "start": 678.84,
        "end": 684.6800000000001
    },
    {
        "text": " Mathémáticamente sería el lugar geomético, los diferentes puntos del plano que representan",
        "start": 686.6800000000001,
        "end": 691.8000000000001
    },
    {
        "text": " canastas de bienes que al consumidor les indiferente consumir sea que le da la misma",
        "start": 691.8000000000001,
        "end": 699.08
    },
    {
        "text": " nivel de utilidad cuando los consumen. Bueno, se puede establecer un mapa de curva de",
        "start": 699.08,
        "end": 705.48
    },
    {
        "text": " indiferencia que no es ni más ni menos que un conjunto de curvas de indiferencia, que va",
        "start": 705.48,
        "end": 710.96
    },
    {
        "text": " obviamente describir la diferente preferencia que el consumidor tiene por la diferente",
        "start": 710.96,
        "end": 715.08
    },
    {
        "text": " si todas las combinaciones de los bienes, ese mapa de indiferencia es un mapa de ilusio,",
        "start": 715.08,
        "end": 720.2
    },
    {
        "text": " representa todos los infinitos niveles de utilidad que puede alcanzar el consumidor. Y es",
        "start": 720.2,
        "end": 726.9200000000001
    },
    {
        "text": " algo acá, ¿no? Como podemos ver, esta sería la curva de indiferencia que tiene esta",
        "start": 726.9200000000001,
        "end": 732.0
    },
    {
        "text": " característica que ahora vamos a preferirse a un poquito y a medida que el consumidor se está",
        "start": 732.0,
        "end": 741.88
    },
    {
        "text": " situando más alejado del origen, obviamente es una curva de indiferencia que tiene mayor cantidad",
        "start": 741.88,
        "end": 747.8
    },
    {
        "text": " de bienes por lo tanto una mayor utilidad. O sea, ¿quíes lo que estamos tratando de edificar acá?",
        "start": 747.8,
        "end": 756.32
    },
    {
        "text": " ¿Cómo toma la edición de consumidor? Ya vemos que va a simizar la utilidad, por lo tanto",
        "start": 757.0400000000001,
        "end": 761.8000000000001
    },
    {
        "text": " considerando los gustos y las preferencias y la utilidad más alta, es justamente la curva",
        "start": 761.8000000000001,
        "end": 770.08
    },
    {
        "text": " de indiferencia más alejada del origen. Sabemos que considerando este concepto, el consumidor va a",
        "start": 770.08,
        "end": 776.48
    },
    {
        "text": " tratar de alcanzar el nivel de utilidad de la curva de indiferencia más alejada posible de",
        "start": 776.48,
        "end": 784.4000000000001
    },
    {
        "text": " lo respecto a la origen. Como podemos ver, en este mapa de curva de indiferencia cada curva de",
        "start": 784.4,
        "end": 792.16
    },
    {
        "text": " indiferencia tiene un nivel de utilidad, cuanto más alejado lo supera y el definitiva el consumidor",
        "start": 792.16,
        "end": 802.16
    },
    {
        "text": " va a tratar de alcanzar el reitero esa curva de indiferencia que pueda lograr.",
        "start": 802.16,
        "end": 807.92
    },
    {
        "text": " Bueno, las curvas de indiferencia son de crecientes, competentes negativas, aquí se puede",
        "start": 807.92,
        "end": 817.8399999999999
    },
    {
        "text": " asociar a la curva de la propiedad de nuestra sociedad, se demuestra que si tuviera otro tipo",
        "start": 817.8399999999999,
        "end": 825.1999999999999
    },
    {
        "text": " de pendiente, justamente se violaría esta propiedad de preferir siempre más o bien a",
        "start": 825.1999999999999,
        "end": 833.64
    },
    {
        "text": " una a menos. Las curvas de indiferencia se pueden cortar, ahí también estaría violando",
        "start": 833.64,
        "end": 841.24
    },
    {
        "text": " las propiedades, supuesto que preferieron la cantidad más o menos. Son con bexas, acá podemos",
        "start": 841.24,
        "end": 852.1999999999999
    },
    {
        "text": " ver que es de creciente de izquierda derecha, en la canasta A, por ejemplo, vemos que el",
        "start": 852.1999999999999,
        "end": 858.0
    },
    {
        "text": " bien uno es mucho más abundante en la composición con respecto al bien dos. Y así si no vamos",
        "start": 858.0,
        "end": 867.48
    },
    {
        "text": " trasladando sobre la curva llegamos por el punto de donde esa rees, el que es la composición",
        "start": 867.48,
        "end": 874.56
    },
    {
        "text": " de esta canasta, el bien más abundante es el lo respecto al uno, pero ambas canastas todas,",
        "start": 874.56,
        "end": 880.52
    },
    {
        "text": " ya son equivalentes del punto de vista de la utilidad. ¿Qué otro elemento quiere decir esto?",
        "start": 880.52,
        "end": 899.68
    },
    {
        "text": " Bueno, acá en este caso, en el punto A, donde la canasta, donde el bien uno es abundante, ¿qué",
        "start": 899.68,
        "end": 907.56
    },
    {
        "text": " quiere decir esto que sea abundante? Además, el punto vista de que si consumen una unidad más",
        "start": 907.56,
        "end": 910.88
    },
    {
        "text": " de ese bien, al ser abundante, en la utilidad marginal y que de genera es relativamente baja.",
        "start": 910.88,
        "end": 917.0
    },
    {
        "text": " Mientras el bien escaso que es el dos, en este caso, comparativamente hablando, si consumen",
        "start": 917.0,
        "end": 923.2399999999999
    },
    {
        "text": " una más, una unidad más del bien dos, ahí sí, la satisfacción que le brinda el punto",
        "start": 923.2399999999999,
        "end": 927.56
    },
    {
        "text": " vista marginal al consumidor en este punto es mayor. Esto es porque en definitiva estamos",
        "start": 927.56,
        "end": 936.4399999999999
    },
    {
        "text": " analizando que si se corre de un punto A, la B o al C, obviamente si bien mantiene la utilidad,",
        "start": 936.44,
        "end": 943.96
    },
    {
        "text": " baja la cantidad de uno y aumenta el otro, por lo cual juega ahí el tema de la utilidad",
        "start": 943.96,
        "end": 953.9200000000001
    },
    {
        "text": " marginal. La utilidad marginal quiere genera aumentar la cantidad de otro y la utilidad",
        "start": 953.9200000000001,
        "end": 959.72
    },
    {
        "text": " que pierde por diminuir la cantidad del que va disminuyendo. Bueno, acá en dos culbas",
        "start": 959.72,
        "end": 969.6800000000001
    },
    {
        "text": " de diferencia que se cortan, ¿por qué no se puede cortar? Fíjense que acá A y B está",
        "start": 969.6800000000001,
        "end": 976.08
    },
    {
        "text": " viendo la ima animoniva de utilidad porque están sobre la ima cuba de diferencia, ¿verdad?",
        "start": 976.08,
        "end": 982.8000000000001
    },
    {
        "text": " No su vez, ahí C también tendrían el mismo nivel de utilidad. Bueno, obviamente acá se",
        "start": 982.8,
        "end": 992.8
    },
    {
        "text": " reopería la propiedad de transitiva, por lo tanto no es lógico que esto sea posible,",
        "start": 992.8,
        "end": 1001.64
    },
    {
        "text": " las plasjuve de diferencia no se pueden cortar. La utilidad que es mi idea de satisfacción",
        "start": 1001.64,
        "end": 1011.4399999999999
    },
    {
        "text": " por el consumo de mis servicios, es una medida abstracta y si bien que tiene un componentes",
        "start": 1011.44,
        "end": 1021.8000000000001
    },
    {
        "text": " subjetivo, ¿no? Y si bien hay una indicación, no es una medida exacta. En realidad lo que",
        "start": 1021.8000000000001,
        "end": 1034.1200000000001
    },
    {
        "text": " nos brida quería de consumidor es alternativa sobre cómo es el comportamiento de un consumidor",
        "start": 1034.1200000000001,
        "end": 1040.3200000000002
    },
    {
        "text": " tipo y cómo varería esa satisfacción, que esa utilidad ante cambio, tanto del ingreso",
        "start": 1040.32,
        "end": 1046.56
    },
    {
        "text": " del precio de los bienes o de los justos y las preferencias. No da respuesta exacta,",
        "start": 1046.56,
        "end": 1052.6799999999998
    },
    {
        "text": " este modelo, sino que reitero es una guía de comportamiento de un consumidor representativo",
        "start": 1052.6799999999998,
        "end": 1058.76
    },
    {
        "text": " y ante cambio sobre diferentes variables como cambia ese nivel de utilidad. Lo que sí",
        "start": 1058.76,
        "end": 1065.26
    },
    {
        "text": " nos permite de estrategia es determinar si el consumidor está mejor o peor, se aumentará",
        "start": 1065.26,
        "end": 1071.94
    },
    {
        "text": " o va a disminuir el consumo de ciertos bienes ante cambios en los precios de los bienes",
        "start": 1071.94,
        "end": 1077.94
    },
    {
        "text": " o bien el ingreso de un poder adquisitivo y también que valora más un bien que otro.",
        "start": 1077.94,
        "end": 1087.96
    },
    {
        "text": " Las preferencias pueden expresarse a una follona utilidad, la utilidad de función de",
        "start": 1087.96,
        "end": 1092.14
    },
    {
        "text": " las cantidades, esta función, así no es un valor numérico, sujetivo, a las diferentes",
        "start": 1092.14,
        "end": 1099.46
    },
    {
        "text": " combinaciones, a diferentes canastas de consumo, de tal forma que una canasta es preferible",
        "start": 1099.46,
        "end": 1104.8600000000001
    },
    {
        "text": " a la otra siempre que utilidad sea mayor.",
        "start": 1104.8600000000001,
        "end": 1112.66
    },
    {
        "text": " Las cubas de diferencia tienen el nivel de utilidad, por lo tanto la función que representa",
        "start": 1112.66,
        "end": 1123.94
    },
    {
        "text": " la fuerza de utilidad tiene el mismo valor en todos los puntos. Entonces, por ejemplo,",
        "start": 1123.94,
        "end": 1128.74
    },
    {
        "text": " si tenemos la canasta, say, b y c, sabemos que la utilidad que nos va a dar esas canastas",
        "start": 1128.74,
        "end": 1135.02
    },
    {
        "text": " va a ser igual, en este caso notado con la letra y. Entonces ahí podemos despejar",
        "start": 1135.02,
        "end": 1141.94
    },
    {
        "text": " la ecuación de la cuba de diferencia, partiendo por ejemplo si la función de utilidad",
        "start": 1141.94,
        "end": 1145.94
    },
    {
        "text": " es cuso uno por cuso dos, sabemos que esto tiene un valor fijo y por lo tanto despejando",
        "start": 1145.94,
        "end": 1151.8200000000002
    },
    {
        "text": " ahí en los que veía la cuba de diferencia.",
        "start": 1151.8200000000002,
        "end": 1157.8600000000001
    },
    {
        "text": " Esto lo obtiene en el final variando la canasta, o sea, trasladándonos sobre la cuba de",
        "start": 1157.8600000000001,
        "end": 1165.8200000000002
    },
    {
        "text": " definitiva, como yo decía, como varía la utilidad en función de que varía la cantidad,",
        "start": 1165.82,
        "end": 1174.1
    },
    {
        "text": " ¿no? No es el nivel de que las derivadas parciales, las derivadas parciales de la función",
        "start": 1174.1,
        "end": 1179.34
    },
    {
        "text": " de utilidad respecto al bien cuswis, asumiendo que lo demás se mantiene constante. Y esto",
        "start": 1179.34,
        "end": 1186.3799999999999
    },
    {
        "text": " es lo que yo les decía que es definitiva, es la cuba de diferencia lo que pierde al",
        "start": 1186.3799999999999,
        "end": 1193.02
    },
    {
        "text": " diminuir, un bien lo incrementa por el otro que adiciona, cuando digo pierde incrementa",
        "start": 1193.02,
        "end": 1201.3
    },
    {
        "text": " de la utilidad marginal, pero definitiva diferencial es cero, que se compensa.",
        "start": 1201.3,
        "end": 1218.02
    },
    {
        "text": " Cuando acá en el punto A, volvemos a considerar que es mucho más intensivo o la canasta",
        "start": 1218.02,
        "end": 1225.78
    },
    {
        "text": " tiene más bien el 1 que el 2. Entonces el consumidor está más dispuesto acá en este",
        "start": 1225.78,
        "end": 1235.3
    },
    {
        "text": " caso a desprenderse del bien que es más abundante del otro que es escaso. Entonces para",
        "start": 1235.3,
        "end": 1244.02
    },
    {
        "text": " mantener el nivel de utilidad estaría dispuesto a adentregar una cantidad mayor del bien",
        "start": 1244.02,
        "end": 1249.3
    },
    {
        "text": " 1, el bien más abundante para obtener una unidad del bien 2. Es decir, cuanto más intensivo",
        "start": 1249.3,
        "end": 1257.74
    },
    {
        "text": " es el consumo del bien que el consumidor va a estar más dispuesto a canjear, se comilla,",
        "start": 1257.74,
        "end": 1263.74
    },
    {
        "text": " más cantidad de ese bien por obtener más unidad del bien que es más escaso. Pero siempre",
        "start": 1263.74,
        "end": 1268.74
    },
    {
        "text": " sin cambiar el nivel de utilidad, ¿no? Me siguen hasta ahora.",
        "start": 1268.74,
        "end": 1277.74
    },
    {
        "text": " Y esto está dado por lo que recién mencionaba, definitiva la utilidad marginal del bien abundante",
        "start": 1277.74,
        "end": 1304.22
    },
    {
        "text": " es más reducida que la utilidad marginal del bien escaso. Por eso va cuando está situado",
        "start": 1304.22,
        "end": 1313.3
    },
    {
        "text": " en una canasta que tiene más abundante del bien que está dispuesto a dar más cantidad",
        "start": 1313.3,
        "end": 1316.94
    },
    {
        "text": " de ese bien para obtener una del escaso. Bueno, esto está asociado al tema de las valoraciones,",
        "start": 1316.94,
        "end": 1338.38
    },
    {
        "text": " ¿no? No olvidemos que, en definitiva, el consumidor va a consumir más del bien",
        "start": 1338.38,
        "end": 1346.06
    },
    {
        "text": " más barato con respecto al otro que es más caro en términos relativos. Entonces, ¿qué pasa?",
        "start": 1347.02,
        "end": 1355.34
    },
    {
        "text": " El precio relativo de ese bien va a depender de la variación marginal que haga sobre ese bien y",
        "start": 1355.34,
        "end": 1363.94
    },
    {
        "text": " esto a su vez está asociado a unante, ¿cuáles es caso ese se bien? Si hay escasez de un bien,",
        "start": 1363.94,
        "end": 1372.7
    },
    {
        "text": " ese se valora más, se tiene a valorar más, con respecto siempre de términos relativos,",
        "start": 1372.7,
        "end": 1378.82
    },
    {
        "text": " con respecto al que es más abundante. Entonces, vamos a ver lo que es la tasa marginal de",
        "start": 1378.82,
        "end": 1387.42
    },
    {
        "text": " utilición, la tasa marginal de utilición se acuerdan cuando vimos en presa, cuando vimos",
        "start": 1387.42,
        "end": 1394.66
    },
    {
        "text": " en presa nosotros vimos dos instrumentos que tienen esa analogía con esto que uno ya vimos acá,",
        "start": 1394.66,
        "end": 1401.14
    },
    {
        "text": " vimos la corba hizo cuanta, ¿sí acuerdan? Que era aquel que decía diferentes combinaciones",
        "start": 1401.14,
        "end": 1409.46
    },
    {
        "text": " de las factores capitales y trabajo para mantenimos el nivel de producto, que es muy similar a las",
        "start": 1409.46,
        "end": 1416.0200000000002
    },
    {
        "text": " cubas de diferencia y también vimos las cubas y socoostos, que era la restricción que tenía del",
        "start": 1416.0200000000002,
        "end": 1424.9
    },
    {
        "text": " uso de capital y trabajo con un montón de dinero. Bueno y ahí definimos la tasa marginal de",
        "start": 1424.9,
        "end": 1431.46
    },
    {
        "text": " función técnica, ¿no? ¿Cuánto intercambiaba cuantas unidades de capital intercambiaba una",
        "start": 1431.46,
        "end": 1437.74
    },
    {
        "text": " empresa para unidad más de trabajo? Por ejemplo, bueno acá vamos a ver algo similar,",
        "start": 1437.74,
        "end": 1441.46
    },
    {
        "text": " con sepualmente hablando, ¿no? Sí, en la que caso era para mantenir el nivel de producto,",
        "start": 1441.46,
        "end": 1448.7
    },
    {
        "text": " acá es para mantener el nivel de utilidad, o sea, decíamos acá ¿no? El consumidor acá en",
        "start": 1448.7,
        "end": 1457.42
    },
    {
        "text": " este caso está más dispuesto a cambiar más bien desde el bien 1 para obtener más del 2 y acá",
        "start": 1457.42,
        "end": 1463.9
    },
    {
        "text": " al revés, bueno eso se mide por la tasa marginal de disducción, ¿qué indica? La cantidad",
        "start": 1463.9,
        "end": 1471.8600000000001
    },
    {
        "text": " de bien 1 siempre que el bien 1 usted en el eje de las ordenadas, la cantidad de bien 1",
        "start": 1471.86,
        "end": 1480.86
    },
    {
        "text": " que el consumidor está dispuesto a intercambiar para obtener una unidad más del bien 2, siempre",
        "start": 1480.86,
        "end": 1488.34
    },
    {
        "text": " manteniendo al mismo nivel de utilidad, o sea ¿cuánto está dispuesto a renunciar a desprenderse",
        "start": 1488.34,
        "end": 1496.54
    },
    {
        "text": " el consumidor del bien más abundante, el bien 1 para incrementar una unidad del bien 2, sin alterar",
        "start": 1497.06,
        "end": 1504.8999999999999
    },
    {
        "text": " el nivel de satisfacción, más abundante en el caso del punto ojo ¿no? Eso es una versión",
        "start": 1504.8999999999999,
        "end": 1515.62
    },
    {
        "text": " subjetiva con esto que estamos diciendo cuando valora los bienes, de tal punto que si la tasa",
        "start": 1515.62,
        "end": 1527.5
    },
    {
        "text": " marginal de disducción vale 2, esto es el signo también, también tomamos el absoluto ¿no? ¿Qué",
        "start": 1527.5,
        "end": 1534.78
    },
    {
        "text": " está diciendo? Está diciendo que el consumo de 2 unidades del bien 1 al consumidor le brinda",
        "start": 1534.78,
        "end": 1542.9799999999998
    },
    {
        "text": " el mismo nivel de utilidad que una unidad del bien 2, escangea 2 unidades del bien 1,",
        "start": 1542.98,
        "end": 1551.06
    },
    {
        "text": " renuncia y obtiene una más del bien 2, por lo tanto a nivel de utilidad lo que está diciendo",
        "start": 1551.06,
        "end": 1559.74
    },
    {
        "text": " ahí que 2 unidades del bien 1 le brinda el nivel de satisfacción que el bien 2, por lo tanto",
        "start": 1559.74,
        "end": 1565.8600000000001
    },
    {
        "text": " está dispuesto a renunciar 2 unidades del bien 1 para consumir una más del 2, acá es un 2,",
        "start": 1565.86,
        "end": 1570.8999999999999
    },
    {
        "text": " manteniendo el nivel de utilidad constante, este es el concepto de tasa marginal de utilición,",
        "start": 1572.9799999999998,
        "end": 1577.6999999999998
    },
    {
        "text": " por ejemplo, partiendo del punto a pasando al b, el consumidor está dispuesto a renunciar 2,5",
        "start": 1583.6999999999998,
        "end": 1593.34
    },
    {
        "text": " unidades del bien 1 para obtener una unidad más del bien 2, la utilidad que la agrega esta",
        "start": 1593.34,
        "end": 1602.86
    },
    {
        "text": " unidad y sonal del bien 2 compensa, compensa la perrea utilidad de desprenderse 2 unidades del",
        "start": 1602.86,
        "end": 1613.5
    },
    {
        "text": " bien 1 los y medio, se entiende la idea, bueno y así anda lo que es, acá de C a D el concepto",
        "start": 1613.5,
        "end": 1627.62
    },
    {
        "text": " similar, lo único que observemos que como el bien 1 ya no es tan abundante, más bien ese escaso,",
        "start": 1627.62,
        "end": 1636.22
    },
    {
        "text": " acá está dispuesto a acanjear medio, medio unidad del bien 1 para obtener una unidad del bien 2 y ese es",
        "start": 1637.02,
        "end": 1645.8600000000001
    },
    {
        "text": " un poco la idea que estamos manejando acá, recordemos que la utilidad marginal es de creciente a",
        "start": 1645.8600000000001,
        "end": 1653.5
    },
    {
        "text": " medida que va consumiendo más unidades, bueno matemáticamente esto es el apeliente de la cuba en",
        "start": 1653.5,
        "end": 1664.02
    },
    {
        "text": " el punto, esta tasa más ejecución es de creciente, malo absoluto, acá en términos genéricos lo",
        "start": 1664.02,
        "end": 1677.42
    },
    {
        "text": " podemos plantear, despejamos de la función de utilidad, la ecuación de la cuba de",
        "start": 1677.42,
        "end": 1687.3
    },
    {
        "text": " indiferencia derivamos y obtenemos indifinitiva la pendiente, la tasa más ejecución,",
        "start": 1687.3,
        "end": 1693.1
    },
    {
        "text": " ¿qué canasta va elegir? va elegir la canasta obviamente hasta ahora solo anunciando la cuba",
        "start": 1699.82,
        "end": 1708.3
    },
    {
        "text": " indiferencia, aquella que esté la masa lejana en el origen, en general dado los conceptos que",
        "start": 1708.3,
        "end": 1715.02
    },
    {
        "text": " estamos analizando va a tener la canasta una composición de ambos bienes, no vamos a considerar",
        "start": 1715.02,
        "end": 1720.62
    },
    {
        "text": " canastas de un solo bien, ¿cuál es el otro componente clave acá que juega para el consumidor?",
        "start": 1720.62,
        "end": 1728.62
    },
    {
        "text": " hasta ahora estamos viendo el tema de los gustos y las preferencias,",
        "start": 1730.22,
        "end": 1738.5
    },
    {
        "text": " sabemos que el consumidor se va a situar en algún punto de esta cuba de indiferencia porque",
        "start": 1738.5,
        "end": 1745.82
    },
    {
        "text": " obviamente hay mejor dicho un montón de cuba de indiferencia, ¿no? va a estar de situarse en",
        "start": 1745.82,
        "end": 1753.74
    },
    {
        "text": " una de ellas, ¿cuál es el otro elemento que juega acá? el otro elemento acá ya son elementos del",
        "start": 1753.74,
        "end": 1760.9
    },
    {
        "text": " mercado, no son elementos subjetivos, es el ingreso y los precios de los bienes, el consumidor va",
        "start": 1760.9,
        "end": 1768.46
    },
    {
        "text": " a tener un ingreso que lo gasta todo, es decir, no estamos acá contemplando la posibilidad que el",
        "start": 1768.46,
        "end": 1777.5
    },
    {
        "text": " consumidor tenga un ingreso y el consumo sea mayor, por lo tanto acá se endeuda o que el",
        "start": 1777.5,
        "end": 1791.9
    },
    {
        "text": " ingreso sea mayor que el consumo, por lo cual acá haya ahorro, esto no lo estamos",
        "start": 1791.9,
        "end": 1798.14
    },
    {
        "text": " consiguiendo, por lo tanto si el consumidor gasta todo el ingreso que tiene en el consumo de bienes y",
        "start": 1798.14,
        "end": 1805.7
    },
    {
        "text": " como estamos analizando simplemente una canasta de dos bienes para simplificar, este ingreso se va",
        "start": 1805.7,
        "end": 1814.18
    },
    {
        "text": " a descomponer en un monto destinado al consumo del bien uno, este sería el monto destinado al",
        "start": 1814.18,
        "end": 1823.3400000000001
    },
    {
        "text": " bien uno, bastarado por la cantidad cus 1 por su precio, más el monto que destine al bien 2,",
        "start": 1823.3400000000001,
        "end": 1833.14
    },
    {
        "text": " el dinero que destina al bien 2, el precio está dado, del bien 1, el precio está dado al bien 2,",
        "start": 1834.0200000000002,
        "end": 1845.42
    },
    {
        "text": " el ingreso es conocido, por lo tanto lo que estamos tratando de que hay que despejar es que",
        "start": 1845.42,
        "end": 1851.1000000000001
    },
    {
        "text": " cantidad desba a consumir el consumidor, que cantidad va a desmandar, bueno la reta presupuestaria",
        "start": 1851.1000000000001,
        "end": 1860.5
    },
    {
        "text": " en definitiva ese esto que estamos analizando, es el límite a la capacidad de consumo de los",
        "start": 1860.5,
        "end": 1874.54
    },
    {
        "text": " consumidores, dado los precios de los diferentes bienes y servicios, muestra las diferentes combinaciones",
        "start": 1874.54,
        "end": 1882.66
    },
    {
        "text": " que el consumidor puede adquirir en función de los precios de los bienes y el su nivel de ingreso,",
        "start": 1882.66,
        "end": 1888.8600000000001
    },
    {
        "text": " por lo tanto acá despejamos cus 1,",
        "start": 1891.8600000000001,
        "end": 1894.94
    },
    {
        "text": " y nos queda la reta de presupuesto, que es algo como esto, esta es la reticción por",
        "start": 1894.94,
        "end": 1921.7
    },
    {
        "text": " su presupuestaria, acá se va a situar en algún punto el consumidor va a gastar todo el ingreso",
        "start": 1921.7,
        "end": 1927.5800000000002
    },
    {
        "text": " en ambos bienes, obviamente si tuviera situado acá estaría gastando todo el bien 1,",
        "start": 1927.5800000000002,
        "end": 1935.14
    },
    {
        "text": " si tuviera acá estaría gastando todo el bien 2, esta reticción por su presupuestaria,",
        "start": 1935.14,
        "end": 1941.3400000000001
    },
    {
        "text": " yo les mencioné que es muy similar al concepto de socostos que estuvimos viendo también a la",
        "start": 1941.3400000000001,
        "end": 1948.38
    },
    {
        "text": " fountra posea de producción lineal, si que el consumidor se va a situar en esa reta no se",
        "start": 1948.38,
        "end": 1955.94
    },
    {
        "text": " puede situar por afuera de esta reta, ya que ahí necesitaría más ingresos para comprar esa",
        "start": 1955.94,
        "end": 1961.98
    },
    {
        "text": " combinación y si se sitúa al interior estaría dejando de gastar cierto nivel de ingreso por lo",
        "start": 1961.98,
        "end": 1968.2600000000002
    },
    {
        "text": " tanto no es racional, entonces lo que indica esta ecuación, bueno como yo les mencioné es",
        "start": 1968.26,
        "end": 1981.26
    },
    {
        "text": " todas las combinaciones que el consumidor puede adquirir de los bienes gastando todo su ingreso",
        "start": 1981.26,
        "end": 1986.62
    },
    {
        "text": " y dado el precio de los bienes, despejamos, leje las ordenadas, nos queda en este caso la reta",
        "start": 1986.62,
        "end": 1997.34
    },
    {
        "text": " de presupuesto, lo que importa acá es la pendiente, la pendiente es el precio relativo,",
        "start": 1997.34,
        "end": 2004.82
    },
    {
        "text": " el precio relativo del bien 2 me dio en unidades del bien 1.",
        "start": 2004.82,
        "end": 2009.86
    },
    {
        "text": " ¿Cuál va a ser el punto óptimo del consumidor? ¿Cuál va a ser el punto óptimo del consumidor?",
        "start": 2027.34,
        "end": 2033.34
    },
    {
        "text": " va a ser justamente analogamente lo que vimos para el caso de la empresa, la demanda de factores,",
        "start": 2033.34,
        "end": 2041.1
    },
    {
        "text": " en aquel punto de la reta de presupuesto se haga tangente a una de las curas indiferencias.",
        "start": 2041.1,
        "end": 2050.62
    },
    {
        "text": " El consumidor va a tratar de situarse en la cura de las inferencias más alejadas al origen,",
        "start": 2050.62,
        "end": 2059.7799999999997
    },
    {
        "text": " pero eso en cuanto a sus gustos, su preferencia y obviamente tiene mayor utilidad, pero la",
        "start": 2059.7799999999997,
        "end": 2067.16
    },
    {
        "text": " retirición es lo que le va a imponer en definitiva el límite a esa aspiración. Bueno, el punto",
        "start": 2067.16,
        "end": 2072.2599999999998
    },
    {
        "text": " de intersección de todos los instrumentos es el punto óptimo donde maximiza el consumidor,",
        "start": 2072.2599999999998,
        "end": 2077.74
    },
    {
        "text": " punto de tangencia, es decir, donde siguen a la pendiente. Bueno, acá es un ejemplo,",
        "start": 2077.74,
        "end": 2089.2999999999997
    },
    {
        "text": " en el cual obviamente si gasta todo el singreso en uno de los bienes, el otro cero, en los extremos y",
        "start": 2089.2999999999997,
        "end": 2099.74
    },
    {
        "text": " en el medio de diferentes combinaciones que puede adquirir de los bienes esto que estamos viendo",
        "start": 2099.74,
        "end": 2105.8599999999997
    },
    {
        "text": " vestidos y alimentos. Matemáticamente esta reta es lo diferente es punto del plano que",
        "start": 2105.86,
        "end": 2122.46
    },
    {
        "text": " representa las canastas en donde el consumidor gasta todo su ingreso y nada más que eso en la demanda",
        "start": 2122.46,
        "end": 2130.54
    },
    {
        "text": " de los bienes. ¿Qué pasa? Así como ya le decía, en uno de los extremos, el consumidor",
        "start": 2130.54,
        "end": 2141.62
    },
    {
        "text": " gasta todo su ingreso en uno de los bienes, a medida que se va desplazando la agua en la reta,",
        "start": 2141.62,
        "end": 2146.7
    },
    {
        "text": " va a gastar menos de ese bien y más en el otro. Es decir, esta pendiente nos va a indicar",
        "start": 2146.7,
        "end": 2155.46
    },
    {
        "text": " en definitiva justamente el costo oportunidad, o sea, cuánto va a disminuir de cantidades de uno respecto",
        "start": 2155.46,
        "end": 2163.94
    },
    {
        "text": " al otro. Si bien, sobre esta reta se va a situar el consumidor y hay infinitas canastas que",
        "start": 2163.94,
        "end": 2184.66
    },
    {
        "text": " cumplen obviamente el consumidor gasta todo el ingreso en esa combinación de bienes,",
        "start": 2184.66,
        "end": 2191.8999999999996
    },
    {
        "text": " ¿cuál va a ser la que va a elegir aquella que optimiza, aquella donde tiene la mayor utilidad y",
        "start": 2191.8999999999996,
        "end": 2199.14
    },
    {
        "text": " como se ve adelante es donde se intersecta esta agencia con la curva indiferencia. ¿Por qué?",
        "start": 2199.14,
        "end": 2211.22
    },
    {
        "text": " Bueno, porque fíjense en que si el consumidor acá, por ejemplo, está curva indiferencia, corta",
        "start": 2211.7799999999997,
        "end": 2219.8199999999997
    },
    {
        "text": " también la reta de presupuesto en el punto B y D. Pero ¿qué pasa? No es un punto óptimo",
        "start": 2219.8199999999997,
        "end": 2229.9399999999996
    },
    {
        "text": " de esto porque con el mismo costo, con el mismo, con la misma reta de presupuesto, mismo costo entre",
        "start": 2229.9399999999996,
        "end": 2236.74
    },
    {
        "text": " uno y también el ingreso, digamos, podría obtener una canasta superior en el punto C. Ahí logra",
        "start": 2236.74,
        "end": 2246.02
    },
    {
        "text": " una mayor utilidad porque ese punto C está en la curva indiferencia más alejada, lo origen con",
        "start": 2246.02,
        "end": 2251.02
    },
    {
        "text": " respecto al anterior. No puede, por más que aspire alcanzar este punto E porque no le da su",
        "start": 2251.02,
        "end": 2258.4199999999996
    },
    {
        "text": " capacidad, su nivel de ingreso, por lo tanto, en definitiva el punto óptimo va a ser aquel donde el",
        "start": 2258.4199999999996,
        "end": 2264.3399999999997
    },
    {
        "text": " punto de tangencia entre ambas curvas y que es donde consigue las tangentes, la pendiente.",
        "start": 2264.34,
        "end": 2274.6600000000003
    },
    {
        "text": " Muy bien, ¿qué pasa si varía el ingreso? Bueno, obviamente si el ingreso varía, manteniendo",
        "start": 2276.9,
        "end": 2284.86
    },
    {
        "text": " coclante todos los demás, si el consumidor está sobre esta reta de presupuesto inicial,",
        "start": 2284.86,
        "end": 2293.7400000000002
    },
    {
        "text": " si el ingreso varía y los precios no, obviamente esto se va a desplazar.",
        "start": 2298.3,
        "end": 2301.98
    },
    {
        "text": " Supongamos que aumenta el ingreso, por lo tanto va a pasar una nueva reta de presupuesto.",
        "start": 2304.2200000000003,
        "end": 2309.9
    },
    {
        "text": " Esto que implica, implica que definitiva el consumidor va a acceder a un nivel superior, va a acceder",
        "start": 2310.62,
        "end": 2318.98
    },
    {
        "text": " a otra curva indiferencia, una curva indiferencia superior. No sabemos esto, que este dibujito ahí el",
        "start": 2318.98,
        "end": 2327.6600000000003
    },
    {
        "text": " punto de contacto puede estar ahí en cualquier otro, pero lo que si está claro que va a ser tangente a",
        "start": 2327.6600000000003,
        "end": 2333.9
    },
    {
        "text": " una coven diferencia superior, tiene mayor capacidad de adquirir bienes. Vise versa, si baja el",
        "start": 2333.9,
        "end": 2342.06
    },
    {
        "text": " ingreso, si partida modesta curva, partida modacada de esta reta y baja el ingreso, pasa al revés,",
        "start": 2342.06,
        "end": 2350.06
    },
    {
        "text": " el consumidor baja su nivel de utilidad, a que menos cantidad de bienes de esto es lo que estamos",
        "start": 2350.06,
        "end": 2356.26
    },
    {
        "text": " a realizar. Entonces, bien lo que está acá, si aumenta el ingreso pasamos a otra curva a otra",
        "start": 2356.26,
        "end": 2364.46
    },
    {
        "text": " reta de presupuesto paralela y si baja acá superior y acá inferior. Puedo ocurrir que varía",
        "start": 2364.46,
        "end": 2375.26
    },
    {
        "text": " algunos de los precios de los bienes, bueno, si varía el precio de uno de los bienes, cambia la",
        "start": 2375.26,
        "end": 2381.9
    },
    {
        "text": " pendiente. Entonces, ahí también al cambiar la pendiente, se mueve el punto de obtimo del",
        "start": 2381.9,
        "end": 2390.26
    },
    {
        "text": " consumidor. Se aumenta el precio de un bien, la reta presupuestaria a girar el origen y izquierda",
        "start": 2390.26,
        "end": 2398.26
    },
    {
        "text": " entono al otro bien de la covena del origen. Viene lo que pasó acá.",
        "start": 2398.26,
        "end": 2405.7000000000003
    },
    {
        "text": " Suba el precio, por lo tanto se puede adquirir menos cantidad de alimentos y la reta se corre",
        "start": 2413.5400000000004,
        "end": 2419.0600000000004
    },
    {
        "text": " acá, baja el precio, la reta se corre acá. Por supuesto que si los precios de los bienes",
        "start": 2419.06,
        "end": 2428.82
    },
    {
        "text": " se alteran ahí una proporción o suben o baja en la pendiente no cambia, ahí la reta no hay problema,",
        "start": 2428.82,
        "end": 2438.06
    },
    {
        "text": " digo, se corre paralelo. Bueno, entonces, ¿qué es lo que estamos viendo? Estamos viendo que el",
        "start": 2438.06,
        "end": 2447.74
    },
    {
        "text": " consumidor tiene que elegir, una canasta de bienes, a modo simplemente de simplificación,",
        "start": 2447.74,
        "end": 2452.8199999999997
    },
    {
        "text": " estamos tomando que eligen entre dos bienes y no más, estamos en una competencia perfecta,",
        "start": 2452.8199999999997,
        "end": 2457.22
    },
    {
        "text": " o sea, el consumidor toma dado el precio de los bienes, el ingreso también está dado,",
        "start": 2457.22,
        "end": 2463.1
    },
    {
        "text": " es una decisión racional que tiene que tomar, tratando de maximizar la utilidad y estas",
        "start": 2464.8999999999996,
        "end": 2473.3999999999996
    },
    {
        "text": " futuras, estas futuras de consumidor, las pueden ordenar, es creciente con las cantidades",
        "start": 2473.4,
        "end": 2479.76
    },
    {
        "text": " consumidas de utilidad y es más, imagino, realmente es creciente. Entonces, ¿dónde maximiza la",
        "start": 2479.76,
        "end": 2488.7200000000003
    },
    {
        "text": " utilidad del consumidor de esta canasta de los bienes subidos sujeto a la restricción que tiene",
        "start": 2488.7200000000003,
        "end": 2493.8
    },
    {
        "text": " de la reta de presupuesto? Bueno, esa canasta es, como yo les mencioné, una canasta que obviamente",
        "start": 2493.92,
        "end": 2505.1600000000003
    },
    {
        "text": " bastan en la reta de presupuesto y tiene que además suministrarle, brindarle al consumidor",
        "start": 2505.1600000000003,
        "end": 2513.6800000000003
    },
    {
        "text": " la mayor preferencia posible, indifinitiva, como yo de adelante, el punto C, el punto óptimo",
        "start": 2516.36,
        "end": 2523.36
    },
    {
        "text": " del consumidor es el punto de tangencia entre la reta de presupuesto y la cuba indiferencia.",
        "start": 2523.36,
        "end": 2527.44
    },
    {
        "text": " Situlas.",
        "start": 2528.4,
        "end": 2529.76
    },
    {
        "text": " Hablos.",
        "start": 2554.48,
        "end": 2555.48
    },
    {
        "text": " donde optimiza, el pueblo hay más razones, B y D, le es indiferente, es posible",
        "start": 2555.48,
        "end": 2562.68
    },
    {
        "text": " encontrar otra canasta que le cueste lo mismo pero que en definitiva le dio una mayor satisfacción",
        "start": 2562.68,
        "end": 2566.96
    },
    {
        "text": " y eso lo en cuenta en el punto C, es indifinitiva la canasta que le da la mayor satisfacción",
        "start": 2566.96,
        "end": 2573.4
    },
    {
        "text": " con la reticción presupuestal que tigue. Entonces, en definitiva lo que tenemos que hacer",
        "start": 2573.4,
        "end": 2578.76
    },
    {
        "text": " acá conceptualmente lo sabemos que es el punto de tangencia, lo que tenemos que hacer",
        "start": 2578.76,
        "end": 2584.32
    },
    {
        "text": " acá es enfrentados a una situación de este tipo, es igualar a las pendientes. Entonces",
        "start": 2584.32,
        "end": 2592.6000000000004
    },
    {
        "text": " sabemos que el apendiente de la transmajorititución es el apendiente de la cuba indifference",
        "start": 2592.6000000000004,
        "end": 2596.84
    },
    {
        "text": " en un punto, en este caso del tabelo sobre del tabelo, en este ejemplo, y el apendiente",
        "start": 2596.84,
        "end": 2602.0800000000004
    },
    {
        "text": " de la reticción presupuestaria es la relación de precios. Entonces, ese es el punto óptimo,",
        "start": 2602.0800000000004,
        "end": 2611.52
    },
    {
        "text": " si no se da esta igualdad, ahí hay un desequilibrio, ahí el consumidor se va a mover,",
        "start": 2611.52,
        "end": 2615.8
    },
    {
        "text": " porque siempre va a tener una posibilidad de conseguir una situación mejor, pero una",
        "start": 2615.8,
        "end": 2619.8
    },
    {
        "text": " vez que se esta vez se da igualdad, ahí no tiene ningún motivo para moverse. O sea,",
        "start": 2619.8,
        "end": 2631.24
    },
    {
        "text": " que en definitiva, hallándola derivada de la cuba indiferencia, de la reticción presupuesto,",
        "start": 2631.24,
        "end": 2638.84
    },
    {
        "text": " que igualamos y ahí tenemos el punto de equilibrio del consumidor.",
        "start": 2638.84,
        "end": 2646.28
    },
    {
        "text": " Preguntas? Bueno, le veamos simplemente que ocurre cuando ese equilibrio no está, ¿no?",
        "start": 2646.28,
        "end": 2656.44
    },
    {
        "text": " Y estas gráficas nos ayudan a eso, es decir, supongamos que el consumidor está en el",
        "start": 2656.44,
        "end": 2660.6800000000003
    },
    {
        "text": " punto B. En el punto B, vemos que el consumidor podría pasar a nuestra situación mejor, podría",
        "start": 2660.68,
        "end": 2672.44
    },
    {
        "text": " pasar a una mejor utilidad, a mejor bienestar justamente, porque accedería con los muy recursos",
        "start": 2672.44,
        "end": 2682.16
    },
    {
        "text": " a una cuba indiferencia mayor. ¿Qué pasa con la tasa más de reducción y la relación",
        "start": 2682.16,
        "end": 2686.3999999999996
    },
    {
        "text": " de precios? En este caso, la tasa más de reducción, o sea, la pendiente de la cuba",
        "start": 2686.4,
        "end": 2690.56
    },
    {
        "text": " indiferencia, es mayor a la relación de precios. En este caso, entonces el consumidor va",
        "start": 2690.56,
        "end": 2697.7200000000003
    },
    {
        "text": " a desprender, se del bien vestido y va a consumir más del bien alimentos.",
        "start": 2697.7200000000003,
        "end": 2701.76
    },
    {
        "text": " La otra gráfica, en un muestra un caso donde es al revés, es decir, la tasa más de",
        "start": 2707.28,
        "end": 2715.44
    },
    {
        "text": " reducción, en este caso es menor a la relación de precios. Estando en esta situación de va",
        "start": 2715.48,
        "end": 2723.2000000000003
    },
    {
        "text": " a diminuir el consumo de alimentos y va a aumentar el consumo de vestidos, porque así mejor",
        "start": 2723.2000000000003,
        "end": 2728.8
    },
    {
        "text": " a su utilidad, mejor a su bienestar este consumidor. Es decir, en este punto de, el bien",
        "start": 2728.8,
        "end": 2736.6
    },
    {
        "text": " nada, le resulta caro en relación a la relación subjetiva que tiene sobre la idea. Eso es",
        "start": 2736.6,
        "end": 2742.92
    },
    {
        "text": " conceptualmente el tema. Por lo tanto, enfrentamos la situación de ese equilibrio acá, lo que",
        "start": 2742.92,
        "end": 2749.72
    },
    {
        "text": " tenemos que converger es justamente a que se igualen las pendientes. Y tomando en cuenta",
        "start": 2749.72,
        "end": 2756.7999999999997
    },
    {
        "text": " esto, sabemos qué bien es el que el consumidor va a desprender si cual va a adquirir.",
        "start": 2756.7999999999997,
        "end": 2761.96
    },
    {
        "text": " Preguntas? Bueno, descomento nomás que esto, al igual que pasaba con el tema de la",
        "start": 2761.96,
        "end": 2773.32
    },
    {
        "text": " churitución de capital y trabajo, se puede medir también como la relación de actividades",
        "start": 2773.32,
        "end": 2780.2400000000002
    },
    {
        "text": " marginales, entre el biencar renuncia y el bien que adquiere. Preguntas? Bueno, entonces ahora",
        "start": 2780.24,
        "end": 2794.9599999999996
    },
    {
        "text": " que vimos el equilibrio del consumidor, vamos a ver qué pasa o cómo puede cambiar ese",
        "start": 2794.9599999999996,
        "end": 2802.3999999999996
    },
    {
        "text": " equilibrio del consumidor. Y vamos a ver básicamente dos elementos que varían o pueden",
        "start": 2802.4,
        "end": 2812.1600000000003
    },
    {
        "text": " hacer variar ese punto de equilibrio.",
        "start": 2812.16,
        "end": 2839.7599999999998
    },
    {
        "text": " Dos elementos que vamos a considerar es que pasa si varía el ingreso del consumidor.",
        "start": 2839.76,
        "end": 2849.84
    },
    {
        "text": " Nosotros, intuitivamente, ya sabemos que si aumenta el ingreso, obviamente aumenta el",
        "start": 2849.84,
        "end": 2862.0800000000004
    },
    {
        "text": " consumo porque este igualdad se mantiene, ¿verdad? Si minuyo el ingreso baja el consumo,",
        "start": 2862.08,
        "end": 2870.24
    },
    {
        "text": " lo que no sabemos es que pasa con los bienes. Recuerden que el ingreso es igual al",
        "start": 2870.24,
        "end": 2878.2
    },
    {
        "text": " monto que gastan en uno, el bien uno más el monto que gastan el bien dos, dado por las",
        "start": 2878.2,
        "end": 2883.16
    },
    {
        "text": " cantidades y los precios. Cuando aumenta el precio, el ingreso del consumidor, obviamente",
        "start": 2883.16,
        "end": 2889.0
    },
    {
        "text": " va a aumentar algo acá, ¿no? Va a aumentar algo, pero no sabemos bien cómo va a repercutir",
        "start": 2889.0,
        "end": 2895.52
    },
    {
        "text": " eso. Es decir, ¿a qué voy? Puedo aumentar las cantidades dos bienes o puede aumentar solo",
        "start": 2895.52,
        "end": 2902.84
    },
    {
        "text": " el número de minuille del otro. No sabemos. Bueno, eso es lo que analizamos con el efecto",
        "start": 2902.84,
        "end": 2910.64
    },
    {
        "text": " ingreso. Cuando el ingreso varía, me amaneciendo constante los precios, cambia el punto",
        "start": 2910.64,
        "end": 2918.88
    },
    {
        "text": " de equilibrio, cambia ese punto de equilibrio, va a atornarse, otros puntos de equilibrio donde",
        "start": 2918.88,
        "end": 2925.56
    },
    {
        "text": " se va a igualar también la reta de presupuesto, la reta de balance con una nueva cuba de diferencia,",
        "start": 2925.56,
        "end": 2931.2400000000002
    },
    {
        "text": " ya sabemos, lo que va a cambiar la composición. Sabemos que… Sabemos que… que se aumenta el",
        "start": 2931.24,
        "end": 2955.52
    },
    {
        "text": " ingreso. Hay que tomar una precaución acá, en serio, hay que estar a la ventana, ¿no?",
        "start": 2955.52,
        "end": 2973.8
    },
    {
        "text": " No sé, no tengo ni idea. Sí, cerramos.",
        "start": 2973.8,
        "end": 2983.1600000000003
    },
    {
        "text": " Bueno, gracias.",
        "start": 3003.8,
        "end": 3023.48
    },
    {
        "text": " Bueno, volvemos. Yo le decía, yo aumenta el ingreso, sé que va a aumentar el consumo,",
        "start": 3033.8,
        "end": 3045.6800000000003
    },
    {
        "text": " porque el consumidor gasta todo su ingreso. Lo que no sé cómo se va a desempeñar es",
        "start": 3045.6800000000003,
        "end": 3051.5600000000004
    },
    {
        "text": " incremento del ingreso, del consumo. Entonces acá tenemos que entrar a analizar algo que",
        "start": 3051.5600000000004,
        "end": 3058.1200000000003
    },
    {
        "text": " estuvimos viendo en forma intuitiva a sonar charlas anteriores, se aumenta el ingreso de",
        "start": 3058.12,
        "end": 3063.2799999999997
    },
    {
        "text": " el consumidor. Va a aumentar la cantidad de mandada a un bien, cualquiera. No, no necesariamente,",
        "start": 3063.2799999999997,
        "end": 3075.88
    },
    {
        "text": " ¿verdad? No necesariamente. Si se da esto, se aumenta el ingreso, se aumenta el ingreso y",
        "start": 3075.88,
        "end": 3086.2799999999997
    },
    {
        "text": " se verifica esto. Entonces, estamos que el cusufí, en este caso, es un bien normal.",
        "start": 3086.28,
        "end": 3092.7200000000003
    },
    {
        "text": " Aumente el ingreso el consumidor aumenta más su cantidad.",
        "start": 3100.52,
        "end": 3103.5600000000004
    },
    {
        "text": " Vise de verza también, ¿no? Si baja el ingreso y baja la cantidad de su bien normal también.",
        "start": 3105.76,
        "end": 3110.44
    },
    {
        "text": " Ahora, si el ingreso sube y baja la cantidad de cusufí, entonces este bien cusufí es lo que se",
        "start": 3110.44,
        "end": 3122.52
    },
    {
        "text": " conoce como un bien inferior. Sí, el consumidor tiene mayor capacidad de compra, tiene más ingreso,",
        "start": 3122.52,
        "end": 3134.76
    },
    {
        "text": " pero baja el consumo de determinado bien. Eso implica ya que su bien inferior. Hemos visto",
        "start": 3134.76,
        "end": 3143.48
    },
    {
        "text": " algunos ejemplos, acuerdas, definitiva, el consumidor consume determinado bien, que en su escala de",
        "start": 3143.48,
        "end": 3150.32
    },
    {
        "text": " valoración es un bien inferior que diminui su consumo directamente lo elimina cuando aumenta",
        "start": 3150.32,
        "end": 3156.0800000000004
    },
    {
        "text": " su capacidad de compra. Bueno, esto es lo que estamos realizando acá. Si el ingreso aumenta",
        "start": 3156.08,
        "end": 3165.56
    },
    {
        "text": " de minús, la cantidad de cada bien que va a desmandar es individuo, van a cambiar o pueden cambiar.",
        "start": 3165.56,
        "end": 3171.2799999999997
    },
    {
        "text": " Y la magnitud, el cambio va a depender de esto que estoy moviendo. Si tiene el mismo signo,",
        "start": 3174.12,
        "end": 3180.68
    },
    {
        "text": " es un bien normal, con la distinción que sí es un bien más vinculado de los bienes básicos,",
        "start": 3181.64,
        "end": 3191.08
    },
    {
        "text": " es un bien necesario. Esto es, aumenta el ingreso pero varió un poco el consumo, es un bien necesario.",
        "start": 3192.9199999999996,
        "end": 3202.44
    },
    {
        "text": " Mientras que se aumenta muchísimo, ahí es un bien que su escala, su bien delujo, un bien",
        "start": 3202.44,
        "end": 3210.36
    },
    {
        "text": " suntuario. Antes consumía penitas una vez al año, se da un gusto y compro algo que le gustaba,",
        "start": 3210.36,
        "end": 3218.36
    },
    {
        "text": " bueno, aumentó sin ingreso, ahora la frecuencia es cuatro veces al año, o sea que cuatro",
        "start": 3218.36,
        "end": 3222.8
    },
    {
        "text": " implicas su consumo. Y los otros que decíamos hoy responde ese tibio inverso es un bien inferior.",
        "start": 3222.8,
        "end": 3230.7200000000003
    },
    {
        "text": " Bueno, esto es lo que se refleja acá, entonces definitiva que lo concurren cuando varía el ingreso,",
        "start": 3230.7200000000003,
        "end": 3235.92
    },
    {
        "text": " en este caso, que estamos viendo, observen, aumenta el ingreso, el consumidor pasa a esta",
        "start": 3235.92,
        "end": 3246.52
    },
    {
        "text": " reita de presupuesto y toca, no, esta gente a una nueva cosa de indiferencia, una canasta superior,",
        "start": 3246.52,
        "end": 3252.12
    },
    {
        "text": " esta canasta B, en este caso, comparado la canasta con la canasta B, vemos que aumenta la cantidad",
        "start": 3252.12,
        "end": 3262.72
    },
    {
        "text": " de ambos bienes, ¿no? Lo ven, no. Aumenta la cantidad de ambos bienes, por lo tanto ambos bienes",
        "start": 3262.72,
        "end": 3275.9199999999996
    },
    {
        "text": " son normales. Hamentó el ingreso y aumentó la cantidad de compra. Lo poníamos, ver al revés,",
        "start": 3275.9199999999996,
        "end": 3285.64
    },
    {
        "text": " el partíamos de B y debajo el ingreso al consumidor, también reduce ambos bienes, también eso",
        "start": 3285.64,
        "end": 3292.12
    },
    {
        "text": " es normales. Lo ven, bueno, el efecto ingreso, que mide esto, cuantifica cuál fue la variación,",
        "start": 3292.12,
        "end": 3305.88
    },
    {
        "text": " de decir, a cuál es el consumo ahora, con respecto a lo que hubo antes, entonces por ejemplo,",
        "start": 3305.88,
        "end": 3309.92
    },
    {
        "text": " el efecto ingreso sobre el bien vestido es 35, de la 30, o sea que fue un efecto positivo de 5",
        "start": 3309.92,
        "end": 3317.52
    },
    {
        "text": " y con respecto al bienes analicamente podíamos decir que ahora es 30 y antes era 10, por lo tanto",
        "start": 3318.52,
        "end": 3324.7599999999998
    },
    {
        "text": " la diferencia es 20, también positiva. El efecto ingreso es, ¿cómo varía la cantidad de",
        "start": 3324.7599999999998,
        "end": 3333.7599999999998
    },
    {
        "text": " demandada en función de que varió el ingreso para cada uno de los bienes? En este caso también",
        "start": 3333.7599999999998,
        "end": 3342.68
    },
    {
        "text": " partimos de A y llegamos a la ganas Tabé ante un nuevo nivel de ingreso. ¿Qué pasa en este caso?",
        "start": 3342.68,
        "end": 3350.6
    },
    {
        "text": " Observen, el bien B aumenta, ¿no? Pasa de 30 o 50, o sea que incrementa un 20 unidades,",
        "start": 3350.6,
        "end": 3362.08
    },
    {
        "text": " por lo tanto es un bien normal, mientras que el biena disminuye, consumir a 20 y ahora consume 15,",
        "start": 3362.6,
        "end": 3373.2
    },
    {
        "text": " por lo tanto en este caso es un bien inferior, o sea que conceptualmente a nosotros basta que",
        "start": 3373.2,
        "end": 3380.08
    },
    {
        "text": " se dé este efecto inverso, o sea aumenta el ingreso y bajó la cantidad para que sea un bien inferior,",
        "start": 3380.08,
        "end": 3388.16
    },
    {
        "text": " con eso al caso. Si da positivo es un bien normal y hablando fino, habría que ver si es un bien",
        "start": 3388.16,
        "end": 3396.08
    },
    {
        "text": " sustuario o es un bien básico, pero en definitiva conceptualmente lo que nos importa es si el ingreso",
        "start": 3396.08,
        "end": 3402.96
    },
    {
        "text": " tiene un comportamiento en el impacto de la cantidad al revés y sumir inferior. Me siguen",
        "start": 3402.96,
        "end": 3411.92
    },
    {
        "text": " algo similar podemos calcular con lo que se conoce el efecto precio, esto es, hasta ahora que",
        "start": 3419.16,
        "end": 3427.2
    },
    {
        "text": " vimos, vimos variaba el ingreso pero no variaban los precios. ¿Cómo? Un bien necesario se asocia",
        "start": 3427.2,
        "end": 3439.12
    },
    {
        "text": " a un bien básico, ¿no? Sí, por ejemplo los alimentos, te supone que vos tenés ciertas canas",
        "start": 3439.12,
        "end": 3445.68
    },
    {
        "text": " tradementos, te aumenta el ingreso, podéis cambiar de la gama de calidad de alimentos pero",
        "start": 3445.68,
        "end": 3450.3999999999996
    },
    {
        "text": " podéis yo que se compensa más, no sé, más finas por lo que pero en realidad no vas a variar",
        "start": 3451.6,
        "end": 3459.64
    },
    {
        "text": " mucho tu cantidad, en la cantidad. Hay otros que son más básicos aún, porque vamos a hablar",
        "start": 3459.64,
        "end": 3467.3599999999997
    },
    {
        "text": " sal, ¿no? Sí, sí, sí. ¿Cómo se llama una sal marina con un perfecto, pero yo digo en general",
        "start": 3467.3599999999997,
        "end": 3472.72
    },
    {
        "text": " no vas a consumir jabón, yapú, detergentes, abujanes, abramineral, no sé, hay un montón de consumo",
        "start": 3473.04,
        "end": 3479.2
    },
    {
        "text": " de bienes que, que va a ser muy poco variantes en cuanto a la cantidad que vos consumís respecto",
        "start": 3479.2,
        "end": 3486.52
    },
    {
        "text": " al ingreso. También serían básicos necesarios, ¿no? Es un poco la que se ve por ahí, mientras que los",
        "start": 3486.52,
        "end": 3495.4399999999996
    },
    {
        "text": " otros delujos, un tuario son aquellos que sí, ya son más variables, me aumenta el consumo y",
        "start": 3495.4399999999996,
        "end": 3501.68
    },
    {
        "text": " me aumenta el ingreso y yo aumento el consumo de eso o al revés, me bajó el consumo y como me",
        "start": 3501.68,
        "end": 3506.3999999999996
    },
    {
        "text": " hagas, ¿no? Sí, bueno, el efecto precio vincula, ¿qué pasa con el cambio del punto de equilibrio?",
        "start": 3506.3999999999996,
        "end": 3518.9199999999996
    },
    {
        "text": " Que sabemos que es igual siempre el punto de tangencia ante la red de presupuesto y la cuba de",
        "start": 3518.9199999999996,
        "end": 3524.7599999999998
    },
    {
        "text": " diferencia, cuando cambia el precio de los bienes manteniendo o al menos uno los precios, ¿no?",
        "start": 3524.7599999999998,
        "end": 3530.0
    },
    {
        "text": " Cuando cambia el precio de uno y se mantiene constante el ingreso y el precio del otro bien.",
        "start": 3530.0,
        "end": 3535.8
    },
    {
        "text": " Se las menciono, no más, no lo vamos a ver que esto se descomponer, el efecto precio de",
        "start": 3539.0,
        "end": 3544.16
    },
    {
        "text": " efecto ingreso y el efecto de institución, no lo vamos a ver el líticamente. Entonces, ¿qué pasa cuando",
        "start": 3544.16,
        "end": 3558.2
    },
    {
        "text": " cambia el precio de un bien? Cambia un precio de un bien, en definitiva tiene la repercusión el",
        "start": 3558.2,
        "end": 3565.04
    },
    {
        "text": " ingreso real, ya ahí que aparece el efecto ingreso. Por ejemplo, si yo tengo un ingreso de 100 pesos y me",
        "start": 3565.04,
        "end": 3572.2
    },
    {
        "text": " sube el precio de un bien, el poder de compra me cae, me baja, tengo un efecto ingreso real negativo",
        "start": 3572.2,
        "end": 3579.7999999999997
    },
    {
        "text": " porque me sale más caro las cosas y al revés, yo tengo un ingreso de 100 y las cosas se abarataron,",
        "start": 3579.7999999999997,
        "end": 3586.3199999999997
    },
    {
        "text": " bueno, puedo comprar más. Entonces, esto es lo que me hide el efecto ingreso en este caso,",
        "start": 3586.32,
        "end": 3593.7200000000003
    },
    {
        "text": " referido al efecto precio y el efecto institución está aludiendo a que cuando variar el precio de un",
        "start": 3593.7200000000003,
        "end": 3602.8
    },
    {
        "text": " bien cambia el precio de los precios relativos, o sea, subrepriso de un bien, uno se encareza respecto",
        "start": 3602.8,
        "end": 3607.28
    },
    {
        "text": " al otro, entonces el consumidor va a tener a comprar el bien que se abará a tomar en términos",
        "start": 3607.28,
        "end": 3612.6400000000003
    },
    {
        "text": " relativos y ahí hace una institución del monto de dinero comprando más del que se abará todo.",
        "start": 3612.64,
        "end": 3619.44
    },
    {
        "text": " En suma, en suma, nosotros vamos a ver si la descomposición, entonces, partiendo de la canasta A,",
        "start": 3621.44,
        "end": 3631.56
    },
    {
        "text": " partiendo de la canasta A, ¿qué pasa con el nuevo punto de equilibrio que lo que estamos analizando",
        "start": 3631.56,
        "end": 3638.2799999999997
    },
    {
        "text": " cuando cambia el precio de un de los bienes? Entonces, sub el precio del biena, este que está",
        "start": 3638.28,
        "end": 3645.96
    },
    {
        "text": " alimento, ¿no? Entonces, sub el precio de un de los bienes, sabemos que hay un giro en la reta",
        "start": 3645.96,
        "end": 3651.52
    },
    {
        "text": " por su puestaria, en este caso pasa a esta reta acá con la amarilla mostasa y se logra un",
        "start": 3651.52,
        "end": 3659.48
    },
    {
        "text": " nuevo punto de equilibrio con una nueva cura de indiferencia en el punto C, reitero que esto",
        "start": 3659.48,
        "end": 3666.7200000000003
    },
    {
        "text": " es positivo, el punto de este puede estar en cualquier otro lado de la reta de presupuesto,",
        "start": 3666.72,
        "end": 3670.48
    },
    {
        "text": " pero en este caso está ahí. ¿Qué pasa? Comparado al punto A con el punto C. Bueno, lo que ocurre es",
        "start": 3670.48,
        "end": 3680.9199999999996
    },
    {
        "text": " que hay un cambio en la composición de los dos bienes, vestido y alimento, por ejemplo, sobre el",
        "start": 3680.9199999999996,
        "end": 3689.6
    },
    {
        "text": " bien vestido que se te ha que está acá, ante consumir a cuatro, perdón, ante consumir a tres y ahora",
        "start": 3689.6,
        "end": 3697.8399999999997
    },
    {
        "text": " consumir a cuatro, por lo tanto, hay un efecto de una unidad más, mientras que el efecto precio",
        "start": 3697.8399999999997,
        "end": 3708.52
    },
    {
        "text": " sobre el biena, ¿qué pasó? Antes era cuatro y ahora es, es uno, no, antes antes y medio,",
        "start": 3708.64,
        "end": 3720.28
    },
    {
        "text": " perdón, y ahora es uno, por lo tanto es dos y medio negativo. Entonces, ¿qué lo ocurrió",
        "start": 3720.28,
        "end": 3724.88
    },
    {
        "text": " acá? Subió el precio del bien A, subió el precio del bien, alimentos se redujo la cantidad de",
        "start": 3724.88,
        "end": 3732.88
    },
    {
        "text": " compra de alimentos y a su vez parte de esa reducción fue parte de esa reducción de dinero",
        "start": 3733.88,
        "end": 3742.0
    },
    {
        "text": " destinado alimento, ¿no? Fue a la compra de una unidad más de vestido. Ese es lo que se",
        "start": 3742.0,
        "end": 3747.52
    },
    {
        "text": " humilla con el efecto precio. ¿No ven? Estamos bien, está acá. Bueno, ¿qué importancia tiene",
        "start": 3747.52,
        "end": 3761.72
    },
    {
        "text": " el cambio de precio de un bien? Bueno, acá ya podemos sin enravándolo que estuimos viendo ya en",
        "start": 3761.72,
        "end": 3769.96
    },
    {
        "text": " algunos otras partes del curso, es decir, la demanda del bien va a estar en función del precio,",
        "start": 3769.96,
        "end": 3775.68
    },
    {
        "text": " lo decíamos, ¿no? La relación inversa. Entonces, ¿qué ocurre? Cuando cambia el precio del bien,",
        "start": 3775.68,
        "end": 3780.96
    },
    {
        "text": " el consumidor va cambiando diferentes puntos de equilibrio, es decir, si acanalizamos",
        "start": 3780.96,
        "end": 3788.08
    },
    {
        "text": " cómo va cambiando la reta de presupuestos, ¿no? A medida que va subiendo el precio del bien y acá va",
        "start": 3789.8399999999997,
        "end": 3797.3999999999996
    },
    {
        "text": " queriendo nuevos puntos de equilibrio, porque son otros nuevos puntos de tangencia ante la reta",
        "start": 3797.3999999999996,
        "end": 3802.0
    },
    {
        "text": " de presupuestos y la cuba de diferencia. Estos puntos, está acá, los ejes estamos tomando",
        "start": 3802.0,
        "end": 3809.2
    },
    {
        "text": " los dos bienes, pero si lo trasladamos al bien que está variando el precio, en definitiva me está",
        "start": 3809.2,
        "end": 3815.28
    },
    {
        "text": " diciendo que a la diferente es precio, esta es la cantidad que va a consumir, al precio de 60 va a",
        "start": 3815.28,
        "end": 3821.48
    },
    {
        "text": " consumir uno, al precio de 30 va a consumir dos y así sucesivamente que es lo que está acá reflejado.",
        "start": 3821.48,
        "end": 3827.48
    },
    {
        "text": " Por lo tanto, esto no es ni menos que la determinación de cómo se va la cuba de demanda del bien,",
        "start": 3828.2,
        "end": 3836.6
    },
    {
        "text": " en cuestión, en este caso el biena, esta relación entre las cantidades demandadas y el precio del biena",
        "start": 3836.6,
        "end": 3843.32
    },
    {
        "text": " no va a determinando la curva individual del precio, perdón, del biena, que coincide con los",
        "start": 3843.32,
        "end": 3850.88
    },
    {
        "text": " diferentes puntos de equilibrio, diferentes puntos de optimización, si ustedes quieren del",
        "start": 3850.88,
        "end": 3857.6400000000003
    },
    {
        "text": " consumidor cuando varía el precio del biena. Recordemos que cuando nos desplazamos sobre la",
        "start": 3857.6400000000003,
        "end": 3866.6400000000003
    },
    {
        "text": " curva de demanda es porque varió su precio, cuando varía otro factor la curva se desplaza.",
        "start": 3866.6400000000003,
        "end": 3872.92
    },
    {
        "text": " Quiero esto. Bueno, esta unión que está acá, esta curva que ve la carroja, es la curva que se",
        "start": 3872.92,
        "end": 3893.2000000000003
    },
    {
        "text": " conoce el precio consumo, que es conceptualmente esto, es no más ni menos que la curva que va a unir",
        "start": 3893.2000000000003,
        "end": 3900.16
    },
    {
        "text": " los diferentes puntos óptimos, por lo tanto es punto de equilibrio del consumidor ante",
        "start": 3900.2799999999997,
        "end": 3905.16
    },
    {
        "text": " cambios del precio del bien. Entonces, la forma que adopta esta curva nos da un indicador de",
        "start": 3905.16,
        "end": 3918.3999999999996
    },
    {
        "text": " qué tipo de bien estamos analizando y lo vamos a ver ahora. Recordemos que en nivel",
        "start": 3918.4,
        "end": 3937.7200000000003
    },
    {
        "text": " utilidad que se alcanza va a ir variando a medida que se va desplazando la curva de demanda,",
        "start": 3937.7200000000003,
        "end": 3942.36
    },
    {
        "text": " a menos el precio, mayor utilidad, se lleva una cuba de diferencias más alejada de",
        "start": 3943.36,
        "end": 3949.28
    },
    {
        "text": " origen, suba de poder de compra, lo que se ve en esta gráfica anterior.",
        "start": 3949.28,
        "end": 3953.6800000000003
    },
    {
        "text": " Y cada punto de la curva de demanda du bien corresponde a un punto óptimo, o sea,",
        "start": 3962.6800000000003,
        "end": 3968.1200000000003
    },
    {
        "text": " recordemos estos elementos que lo que se desprenden de la gráfica, que estuvimos viendo.",
        "start": 3968.68,
        "end": 3973.4
    },
    {
        "text": " Entonces,",
        "start": 3975.72,
        "end": 3976.64
    },
    {
        "text": " esta cuba de ingreso consumo nos va a indicar en infinitiva qué tipo de bienes, por ejemplo en",
        "start": 3981.56,
        "end": 3987.72
    },
    {
        "text": " este caso observen. El consumidor va teniendo el momento del ingreso, por lo tanto va variando su",
        "start": 3987.72,
        "end": 3995.04
    },
    {
        "text": " reta de presupuestos y va obteniendo un nivel de satisfacción mayor, haciendo tangento en la",
        "start": 3995.04,
        "end": 4000.92
    },
    {
        "text": " cuba de diferencia más alta, observe que la forma de esta curva, esto nos indica que",
        "start": 4000.92,
        "end": 4011.68
    },
    {
        "text": " este bien que estamos analizando su bien normal, la cantidad de demanda está totalmente",
        "start": 4015.88,
        "end": 4023.68
    },
    {
        "text": " alineada en el signo con la variación del ingreso.",
        "start": 4023.68,
        "end": 4026.16
    },
    {
        "text": " A mi mo precio, o sea que el precio no cambia, las cantidades de demanda de la biena varían",
        "start": 4029.7599999999998,
        "end": 4035.24
    },
    {
        "text": " con el ingreso sobre el consumidor, esto es en infinitiva la curva de demanda se desplaza a la",
        "start": 4035.24,
        "end": 4041.48
    },
    {
        "text": " derecha. Lo olvidemos que, como yo les dije, la curva de demanda, si hay una variación de",
        "start": 4041.48,
        "end": 4049.52
    },
    {
        "text": " precio, nos corremos sobre la curva y si varía otra cosa, la curva se desplaza, en este caso vemos",
        "start": 4049.52,
        "end": 4055.8
    },
    {
        "text": " que aumentó el ingreso y la curva se desplazó hacia la derecha de arriba, por lo tanto estamos hablando",
        "start": 4055.8,
        "end": 4060.8
    },
    {
        "text": " de que aumentó el consumo de ese bien.",
        "start": 4060.8,
        "end": 4062.6
    },
    {
        "text": " Acá estamos conserando solo el aumento del ingreso, no a los precios.",
        "start": 4071.0,
        "end": 4077.8
    },
    {
        "text": " El aumento del ingreso y el biena no ha cambiado. En realidad lo que estamos asociando es vinculando,",
        "start": 4079.52,
        "end": 4092.2
    },
    {
        "text": " yo sé que el nivel de ingreso varía el punto de equilibrio, si esta curva tiene una pendiente",
        "start": 4092.2,
        "end": 4097.64
    },
    {
        "text": " positiva, entonces estoy analizando lo que es un bien normal, eso es un poco la idea.",
        "start": 4097.64,
        "end": 4101.28
    },
    {
        "text": " Bueno, entonces cuando varía el ingreso y la curva de ingreso de consumo tiene",
        "start": 4109.52,
        "end": 4131.92
    },
    {
        "text": " pendiente positiva, acá estamos hablando de un bien normal, cobimos recién y viceversa.",
        "start": 4131.92,
        "end": 4136.4400000000005
    },
    {
        "text": " También se demuestra que la electricidad ingreso la demanda es positiva, cuando la variación del",
        "start": 4137.4,
        "end": 4144.24
    },
    {
        "text": " ingreso hace que un nuevo punto de equilibrio y los unimos y la curva de ingreso de consumo tiene",
        "start": 4144.24,
        "end": 4152.16
    },
    {
        "text": " una pendiente negativa, ahí estamos hablando de un bien inferior y la electricidad ingreso también",
        "start": 4152.16,
        "end": 4160.96
    },
    {
        "text": " refleja que es negativo.",
        "start": 4160.96,
        "end": 4162.839999999999
    },
    {
        "text": " Y esto se ve acá, pero esto acá vamos a ver cómo el cambio de demanda del bien cuando",
        "start": 4167.44,
        "end": 4178.0
    },
    {
        "text": " mende el precio del bien. ¿Qué es lo que puede alterar la demanda de siamos hoy?",
        "start": 4178.0,
        "end": 4186.08
    },
    {
        "text": " Cualquier otra cosa, bueno, la función de demanda es una función de demanda de A,",
        "start": 4186.08,
        "end": 4194.96
    },
    {
        "text": " eso es una función del precio de A, del precio de los otros bienes, del ingreso y de los",
        "start": 4196.76,
        "end": 4203.54
    },
    {
        "text": " justos. Entonces cuando varía el precio lo desplazamos sobre la curva con la ley de inversa,",
        "start": 4203.54,
        "end": 4213.28
    },
    {
        "text": " cuando varía cualquier otro tipo de variable la curva se desplaza y eso lo que estuvimos",
        "start": 4213.28,
        "end": 4219.2
    },
    {
        "text": " viendo en el caso anterior cuando varía el ingreso. ¿Qué pasa en este caso cuando cambia el",
        "start": 4219.2,
        "end": 4226.34
    },
    {
        "text": " precio de otro bien, el P suí, en este caso cambia el precio del bien B, ¿qué pasa con la demanda",
        "start": 4226.34,
        "end": 4232.54
    },
    {
        "text": " del bien A? Entonces acá nos lleva a pensar si los bienes estos están vinculados o no están vinculados,",
        "start": 4232.54,
        "end": 4242.679999999999
    },
    {
        "text": " porque puede variar el precio de un bien y no tener ningún impacto en la demanda del otro,",
        "start": 4243.28,
        "end": 4249.16
    },
    {
        "text": " entonces ese bien no tiene ningún efecto. Pero si cambia la cantidad de demanda, entonces ahí sí,",
        "start": 4249.16,
        "end": 4257.679999999999
    },
    {
        "text": " los bienes están vinculados y en realidad lo que tenemos que analizar siempre es",
        "start": 4257.679999999999,
        "end": 4265.16
    },
    {
        "text": " lo siguiente. Si aumenta el precio de un bien, sabemos por la ley de demanda que va a pasar con la",
        "start": 4273.84,
        "end": 4288.36
    },
    {
        "text": " cantidad de demanda de ese bien. Va a bajar, ¿verdad? Esto la ley general de demanda. Ahora,",
        "start": 4288.36,
        "end": 4300.28
    },
    {
        "text": " ¿qué pasa con la cantidad de demanda de otro bien, cualquier ajota? Si sube la cantidad de",
        "start": 4301.28,
        "end": 4310.84
    },
    {
        "text": " demanda, quiere decir, primera cosa que los bienes estos están vinculados, primero el elemento.",
        "start": 4310.84,
        "end": 4318.84
    },
    {
        "text": " Si baja la cantidad de demanda de un bien, porque subió su precio y a su vez, aumenta la cantidad",
        "start": 4320.92,
        "end": 4326.679999999999
    },
    {
        "text": " de demanda del otro, es porque la bienes y jota obviamente están vinculados, primero el elemento",
        "start": 4326.68,
        "end": 4332.0
    },
    {
        "text": " que van a encuentro. ¿Qué tipo de bienes son estos?",
        "start": 4332.0,
        "end": 4334.8
    },
    {
        "text": " Subió el precio un bien, bajó la demanda de uno y compró más del otro.",
        "start": 4343.8,
        "end": 4349.400000000001
    },
    {
        "text": " Sustitutos, ¿no? Los bienes y jota son bienes sustitutos.",
        "start": 4349.4,
        "end": 4357.4
    },
    {
        "text": " Casió típico de las cargas, subió la carne de pollo, por lo tanto, dejo de consumir carne de",
        "start": 4360.599999999999,
        "end": 4366.48
    },
    {
        "text": " pollo y compró más carne de sardo, porque carne para mí el polisado es igual.",
        "start": 4366.48,
        "end": 4370.48
    },
    {
        "text": " ¿Qué pasa? ¿Qué pasa? Si esto ocurre.",
        "start": 4370.48,
        "end": 4382.08
    },
    {
        "text": " Si, en realidad, sí, por esto, sí, sí está, sí, sí, ylando fino sí, pero está,",
        "start": 4382.08,
        "end": 4406.4
    },
    {
        "text": " pero no tenemos por qué vincularlos, pero ¿qué pasa si aumenta el precio de ese bien?",
        "start": 4406.4,
        "end": 4414.5199999999995
    },
    {
        "text": " Sabemos que baja la demanda de ese bien y cualquiera, pero ahora también baja la demanda del bien",
        "start": 4414.5199999999995,
        "end": 4421.04
    },
    {
        "text": " jota. Bueno, entonces en este caso los bienes, jota ahí son bienes complementarios, ¿no?",
        "start": 4421.04,
        "end": 4435.92
    },
    {
        "text": " Esto es, diminuyó la cantidad comprada a un bien, diminuyó la cantidad de demandada a un bien",
        "start": 4439.64,
        "end": 4446.84
    },
    {
        "text": " y a su vez, porque aumentó el precio, pero a su vez impactó también que bajó la demanda de",
        "start": 4446.84,
        "end": 4452.2
    },
    {
        "text": " otro bien cualquiera. Por supuesto, no lo dije que todavía están vinculados, ¿no? Porque sin",
        "start": 4452.2,
        "end": 4457.6
    },
    {
        "text": " impactar nada no tienen que ver, son bien independientes. Entonces, cuando ocurre esto,",
        "start": 4457.6,
        "end": 4462.84
    },
    {
        "text": " estos son bienes complementarios, ¿no? O viceversa, ¿no? Si baja el precio de un bien, compró más",
        "start": 4462.84,
        "end": 4471.56
    },
    {
        "text": " de ese bien y a su vez compró más del otro, también son bienes complementarios. Bueno,",
        "start": 4471.56,
        "end": 4478.120000000001
    },
    {
        "text": " esto es lo que vamos a reflejarlo acá, definitiva, conceptualmente esto es lo que yo quería transmitirle,",
        "start": 4478.120000000001,
        "end": 4483.56
    },
    {
        "text": " que internaliza en estos, es jugando, finalmente con, sencillamente digo con la demanda, ¿no?",
        "start": 4483.56,
        "end": 4489.68
    },
    {
        "text": " Suyo le presumien compro menos de ese bien, por lo tanto se impacta en el consumo del otro",
        "start": 4489.68,
        "end": 4494.96
    },
    {
        "text": " y todo que ver. Si van el mismo sentido del complementario y se va al revés, es un",
        "start": 4494.96,
        "end": 4500.8
    },
    {
        "text": " instituto. Entonces, ¿qué pasa en la cantidad de demandadas? La cura de demanda del biena cuando",
        "start": 4500.8,
        "end": 4509.32
    },
    {
        "text": " aumenta el precio del bien-b, cambia el precio del bien-b, por lo tanto de lo que se mueve acá",
        "start": 4509.32,
        "end": 4515.0
    },
    {
        "text": " es la reta de presupuesto sobre este eje y va a depender de qué tipo de bien estemos",
        "start": 4515.0,
        "end": 4522.64
    },
    {
        "text": " hablando. Si el bien-b, el bien-b, instituto de la, sus cantidades demandadas van a aumentar",
        "start": 4522.64,
        "end": 4529.64
    },
    {
        "text": " ante el aumento del precio del bien-b. O sea, suba el precio del bien-b, baja la cantidad",
        "start": 4529.64,
        "end": 4538.92
    },
    {
        "text": " de bien y a su vez suba la de A, suba bien su instituto. Como se observa acá, a un mismo",
        "start": 4538.92,
        "end": 4548.88
    },
    {
        "text": " precio, dado que varió el precio del vestido, la cura de demanda de bien-b, se trasladó",
        "start": 4548.88,
        "end": 4555.88
    },
    {
        "text": " a la derecha, aumenta la cantidad de demandada del bien-b, son bien-b, sustituto. Do bienes",
        "start": 4555.88,
        "end": 4564.88
    },
    {
        "text": " son sustitutos, si la subida del precio de uno de ellos provoca un aumento en la cantidad",
        "start": 4564.88,
        "end": 4571.72
    },
    {
        "text": " de demandada de lo tribice verso, lo que estuvimos viendo recién. Supongamos que para este",
        "start": 4571.72,
        "end": 4581.8
    },
    {
        "text": " consumidor ir al cine o alquilar películas, va, alquilar películas no hay más, pero se",
        "start": 4581.8,
        "end": 4590.4400000000005
    },
    {
        "text": " baja por internet, ahora pero bueno, supongamos que tiene un costo alquilar una película, bueno,",
        "start": 4590.4400000000005,
        "end": 4598.240000000001
    },
    {
        "text": " y eso instituto para él el aumento de uno de los bienes implica dejar de consumir",
        "start": 4598.24,
        "end": 4604.28
    },
    {
        "text": " ese bien y va a comprar más del otro. Conceptualmente lo que importa, bueno, y acá es el otro caso,",
        "start": 4604.28,
        "end": 4614.679999999999
    },
    {
        "text": " que pasa cuando sube el precio del bien-b, me cambia otra vez la reta del presupuesto,",
        "start": 4614.679999999999,
        "end": 4621.76
    },
    {
        "text": " que impacto tiene en la demanda del otro bien, del bien-a. Bueno, y acá es lo que vemos",
        "start": 4621.76,
        "end": 4628.52
    },
    {
        "text": " que en este caso, como el bienes complementario, la cantidad de demandada del bien-a también",
        "start": 4628.52,
        "end": 4635.8
    },
    {
        "text": " bajan, es decir, repetimos, sube el precio del bien-b, por lo tanto baja la cantidad de",
        "start": 4635.8,
        "end": 4642.76
    },
    {
        "text": " demandada del bien-b, que impacto tiene en la cantidad de demandada de la, en este caso",
        "start": 4642.76,
        "end": 4646.9800000000005
    },
    {
        "text": " baja, por lo tanto la curva de demanda se desplaza hacia el izquierdo, es decir, en este",
        "start": 4646.98,
        "end": 4653.419999999999
    },
    {
        "text": " caso se verifica esto porque los bienes están vinculados y son complementarios entre sí.",
        "start": 4653.419999999999,
        "end": 4658.66
    },
    {
        "text": " ¿Te entendió esto? Dos bienes son complementarios, y ante la suba del precio de uno de ellos,",
        "start": 4658.66,
        "end": 4667.459999999999
    },
    {
        "text": " impacta en una disminución en la cantidad de demandada del otro. Por ejemplo, la nasta",
        "start": 4667.459999999999,
        "end": 4674.86
    },
    {
        "text": " de la 6 del auto, es decir, sube significativamente el, o sube la nasta, el consumidor deja de consumir",
        "start": 4674.86,
        "end": 4684.099999999999
    },
    {
        "text": " nasta, por lo tanto usa menos el auto, por lo tanto usa menos aceite de la auto. Y si no",
        "start": 4684.099999999999,
        "end": 4695.66
    },
    {
        "text": " tienes nada que ver, si no tienes nada que ver, los bienes son independientes, o sea,",
        "start": 4695.66,
        "end": 4701.0599999999995
    },
    {
        "text": " si varí el precio de uno de ellos y no afecta la cantidad de demandada del otro, yo merece",
        "start": 4701.06,
        "end": 4706.740000000001
    },
    {
        "text": " independiente, cualquier combinación de bienes para consumir otro no tenga ningún impacto.",
        "start": 4706.740000000001,
        "end": 4710.620000000001
    },
    {
        "text": " Suvió el precio del pan, y bueno, que me alteró el consumo energial étrica, nada, bueno,",
        "start": 4714.620000000001,
        "end": 4720.580000000001
    },
    {
        "text": " son bienes de nada que ver. Bueno, esto es simplemente para redondir lo que estuvimos viendo,",
        "start": 4720.58,
        "end": 4731.94
    },
    {
        "text": " si la Cuba preció consumo, tiene pendiente negativa, los bienes son sustitutos y si la Cuba",
        "start": 4731.94,
        "end": 4737.62
    },
    {
        "text": " preció contigo, pendiente positiva son complementarios. Esto es lo que se ve acá, ¿no?",
        "start": 4737.62,
        "end": 4742.54
    },
    {
        "text": " La curva de demanda individual, que lo estuvo viendo, bueno, la suma de demanda individual me da",
        "start": 4742.54,
        "end": 4755.62
    },
    {
        "text": " la demanda agregada, la demanda del mercado, no es lo más ni menos que la suma de la demanda",
        "start": 4755.62,
        "end": 4760.42
    },
    {
        "text": " diferente a consumidores, un bien aqua alquí era, y ahí me da la demanda del mercado que se",
        "start": 4760.42,
        "end": 4765.76
    },
    {
        "text": " está demanda, esta curva roja que está ahí. La curva de demanda del mercado obviamente se va a",
        "start": 4765.76,
        "end": 4774.84
    },
    {
        "text": " desplazar la derecha cuanto más consumidor y entre la demanda y cuanto más demandante salga,",
        "start": 4774.84,
        "end": 4782.360000000001
    },
    {
        "text": " y también los factores que influyen en la demanda, eso igual que estuvimos viendo anteriormente,",
        "start": 4782.360000000001,
        "end": 4790.76
    },
    {
        "text": " que todos los factores que influyen en la demanda que son básicamente esto, el precio,",
        "start": 4790.76,
        "end": 4795.4400000000005
    },
    {
        "text": " el precio de los bienes, el ingreso de los gustos de los consumidores, elementos culturales,",
        "start": 4795.4400000000005,
        "end": 4804.04
    },
    {
        "text": " lo podemos asociar con los gustos eso lo menos. ¿Qué refleja esta curva de demanda del mercado?",
        "start": 4804.04,
        "end": 4810.4400000000005
    },
    {
        "text": " Bueno, eso es una función del precio, se supone que tanto el precio de otros bienes como",
        "start": 4810.4400000000005,
        "end": 4816.24
    },
    {
        "text": " el ingreso como los gustos, se van a mantener costantes, por lo tanto la función de demanda",
        "start": 4816.24,
        "end": 4820.88
    },
    {
        "text": " va a ser una relación indirecta del precio, hay una relación negativa, se aplica la demanda y,",
        "start": 4820.88,
        "end": 4828.5199999999995
    },
    {
        "text": " como hemos repetido varias veces, si varía el precio del bien que estamos anitando, hay un",
        "start": 4828.5199999999995,
        "end": 4833.04
    },
    {
        "text": " expresamiento sobre la curva, si varía otra cosa, el ingreso de los gustos, el precio de otros",
        "start": 4833.04,
        "end": 4837.24
    },
    {
        "text": " bienes, hay un expresamiento de la curva. Y por último lo que vamos a ver es si intenta recordar",
        "start": 4837.24,
        "end": 4844.44
    },
    {
        "text": " algo que ya vimos anteriormente cuando vimos el mercado, es decir, la elasticidad precio de la demanda,",
        "start": 4844.44,
        "end": 4850.44
    },
    {
        "text": " la elasticidad ingreso, la elasticidad cruzada, esto es. Hasta ahora estoy moviendo, bueno,",
        "start": 4850.44,
        "end": 4856.839999999999
    },
    {
        "text": " ¿qué pasa con este cambio del consumidor, qué pasa con este punto de esquilido del consumidor,",
        "start": 4856.839999999999,
        "end": 4863.679999999999
    },
    {
        "text": " si varía algunos elementos? Bueno, ¿cuánto va a cambiar? ¿Cuál es ese impacto que tiene el cambio",
        "start": 4863.679999999999,
        "end": 4873.839999999999
    },
    {
        "text": " de la cantidad demandada de un bien cuando varía su precio? Y esto lo mide la elasticidad precio",
        "start": 4873.84,
        "end": 4881.96
    },
    {
        "text": " de la demanda, la elasticidad directa de la demanda está midiendo, el impacto que tiene en la cantidad",
        "start": 4881.96,
        "end": 4889.0
    },
    {
        "text": " consumida de un bien respecto a una variación del precio. Definitiva era variación por",
        "start": 4889.0,
        "end": 4897.400000000001
    },
    {
        "text": " su actual de las cantidades mandadas sobre la pandemia de la pandemia de la demanda del precio.",
        "start": 4897.4,
        "end": 4901.96
    },
    {
        "text": " Siempre recordemos que cuando la elasticidad es cero es porque el bien no varía nada, es",
        "start": 4909.799999999999,
        "end": 4914.5199999999995
    },
    {
        "text": " inelástico, se estima considerar que una elasticidad entre cero y uno es un bien latidamente",
        "start": 4914.5199999999995,
        "end": 4921.759999999999
    },
    {
        "text": " elástico, cuanto más próximo a cero es más inelástico, sea mayor que uno se considera elástico,",
        "start": 4922.4800000000005,
        "end": 4930.76
    },
    {
        "text": " bastante latísimo. ¿Qué elementos juegan si hubieres más elástico que otro? Bueno,",
        "start": 4930.76,
        "end": 4939.88
    },
    {
        "text": " obviamente si hay si el bien tiene sustitutos cercanos, el bien es más elástico, esto es,",
        "start": 4939.88,
        "end": 4947.64
    },
    {
        "text": " que impacto puede tener lo que está un bien con la elasticidad cuando suba el precio de un bien,",
        "start": 4948.360000000001,
        "end": 4953.76
    },
    {
        "text": " bueno si el consumidor para él, tiene la posibilidad de comprar otro bien, que es sustituto,",
        "start": 4953.76,
        "end": 4959.88
    },
    {
        "text": " obviamente si suba el precio de un bien que está consumiendo, lo deja de consumir y va a comprar",
        "start": 4959.88,
        "end": 4964.56
    },
    {
        "text": " el otro que es sustituto, por lo tanto cuanto más sustituto más elástico es y cuanto menos",
        "start": 4964.56,
        "end": 4970.64
    },
    {
        "text": " sustitutos tenga obviamente más inelástico va a ser la demanda. Bueno acá viene a",
        "start": 4970.64,
        "end": 4977.64
    },
    {
        "text": " ejemplo simplemente lo que yo le decía cuando más aproxima cero es lo que se conoce en la",
        "start": 4977.64,
        "end": 4982.280000000001
    },
    {
        "text": " diamente de inelástico, más inelástico. La elasticidad ingreso es muy análogo, esto",
        "start": 4982.280000000001,
        "end": 4990.360000000001
    },
    {
        "text": " es lo que en vez de medir el impacto en la cadertidad demandada cuando varía el precio,",
        "start": 4990.360000000001,
        "end": 4994.240000000001
    },
    {
        "text": " lo que me dice el impacto en la cantidad de mandada cuando varía el ingreso.",
        "start": 4994.24,
        "end": 4997.719999999999
    },
    {
        "text": " Y por último está la elasticidad cruzada, perdón no lo menciono pero acá también",
        "start": 5008.5199999999995,
        "end": 5014.44
    },
    {
        "text": " podemos sacar, se viene normal, el bien inferior como estuvimos analizando, se da negativo,",
        "start": 5014.44,
        "end": 5018.599999999999
    },
    {
        "text": " se un bien inferior y la elasticidad cruzada que es este cuadrito que ya lo habíamos visto,",
        "start": 5018.6,
        "end": 5026.52
    },
    {
        "text": " definitiva, la elasticidad cruzada es lo que me dice el impacto en la cantidad de mandada",
        "start": 5026.52,
        "end": 5031.6
    },
    {
        "text": " un bien respecto a que varió el precio de otro bien. Entonces si esa elasticidad da positiva",
        "start": 5031.6,
        "end": 5038.280000000001
    },
    {
        "text": " son bien sustitutos y si da negativa son bien complementarias y obviamente si da cero porque",
        "start": 5038.280000000001,
        "end": 5045.320000000001
    },
    {
        "text": " no tiene ningún vínculo y lo que se conoce con bien es independiente. Mide la variación",
        "start": 5045.32,
        "end": 5054.4
    },
    {
        "text": " porcentual de la cantidad del bien demandado y sobe la variación porcentual del precio del bien jota.",
        "start": 5054.4,
        "end": 5079.36
    },
    {
        "text": " Bueno, acá hay algunas aplicaciones, esto es recolgado y con eso te miramos.",
        "start": 5079.36,
        "end": 5087.88
    }
]