[
    {
        "text": " Estamos trabajando en el contexto de espacios vectoriales con un producto interno de",
        "start": 0.0,
        "end": 21.38
    },
    {
        "text": " frío ahí y con operadores o sea transformaciones lineales de bNB.",
        "start": 21.38,
        "end": 28.04
    },
    {
        "text": " Y en particular nos habíamos concentrado en operadores autoaljuntos aquellos que coinciden con su",
        "start": 28.04,
        "end": 34.0
    },
    {
        "text": " transformada de junta. Entonces habíamos visto los siguientes resultados. En primer lugar que si",
        "start": 34.0,
        "end": 40.96
    },
    {
        "text": " yo tengo un operador autoaljunto, todos los valores propios son reales. Eso es obvio en el caso real",
        "start": 40.96,
        "end": 47.44
    },
    {
        "text": " porque la definición de valores propios me implica que los valores propios están en el cuerpo,",
        "start": 47.44,
        "end": 54.120000000000005
    },
    {
        "text": " por el caso complejo lo probamos. Si aún trabajando en el caso complejo si te autoaljunto,",
        "start": 54.12,
        "end": 59.44
    },
    {
        "text": " los valores propios son reales. Entonces vamos a ir anotando.",
        "start": 59.44,
        "end": 64.92
    },
    {
        "text": " Entonces en este caso todos los valores propios son reales.",
        "start": 73.4,
        "end": 77.36
    },
    {
        "text": " Y después vimos también que si yo trabaja en dimensión finita para que esté definido el poliniumio",
        "start": 84.12,
        "end": 94.2
    },
    {
        "text": " característico. Entonces todas las raíces características son reales y por lo tanto todas son valores",
        "start": 94.2,
        "end": 102.28
    },
    {
        "text": " propios. Entonces si la dimensión es finita",
        "start": 102.28,
        "end": 104.52000000000001
    },
    {
        "text": " y la dimensión es finita.",
        "start": 114.12,
        "end": 121.12
    },
    {
        "text": " Todas las raíces son reales y por lo tanto implica que todas las raíces son valores propios.",
        "start": 128.12,
        "end": 134.0
    },
    {
        "text": " Aunque cuando digamos eso es evidente si no trabaja en el caso complejo, pero si en el caso estamos",
        "start": 134.0,
        "end": 139.28
    },
    {
        "text": " seguro que todas las raíces el poliniumio característico son reales. Por lo tanto todas son valores propios",
        "start": 140.28,
        "end": 148.28
    },
    {
        "text": " y como el poliniumio característico tiene al menos una raíz, sabemos que existe al menos un valor",
        "start": 148.28,
        "end": 154.28
    },
    {
        "text": " propio. Estamos en el caso de que esta hace una raíz de orden N eso será el único valor",
        "start": 154.28,
        "end": 161.28
    },
    {
        "text": " propio pero si no puede haber más. Entonces esto implica en particular que existe al menos un valor",
        "start": 161.28,
        "end": 171.28
    },
    {
        "text": " propio. Este resultado lo vamos a hacer en un ratito. Existe al menos un valor propio de cualquier",
        "start": 171.28,
        "end": 178.28
    },
    {
        "text": " operador auto adjunto. Este resultado insisto, estamos trabajando con dimensión finita. Al final de la",
        "start": 178.28,
        "end": 189.28
    },
    {
        "text": " clase si nos queda tiempo vamos a ver un ejemplo que está en las notas de un operador auto adjunto",
        "start": 189.28,
        "end": 195.28
    },
    {
        "text": " en dimensión infinita que no tiene valores propios. Por lo tanto si estamos por lo pronto si estamos en dimensión",
        "start": 195.28,
        "end": 201.28
    },
    {
        "text": " finita se cumple esto. Y la última cosa que hemos visto es que si uno tiene más de un valor",
        "start": 201.28,
        "end": 210.28
    },
    {
        "text": " propio y considera los valores los los espacios propios característicos. Por ejemplo este es el",
        "start": 210.28,
        "end": 217.28
    },
    {
        "text": " lambda 1 y este es el es el lambda 2. Entonces este es ortobanala, este es conjunto ortobanala",
        "start": 217.28,
        "end": 226.28
    },
    {
        "text": " este. Quienes y que todo vector aquí es ortobanala todo vector aquí. Entonces vimos también que si",
        "start": 226.28,
        "end": 233.28
    },
    {
        "text": " lambda 1 y lambda 2 son valores propios distintos. Entonces su espacia asociado lambda 1 es",
        "start": 233.28,
        "end": 256.28
    },
    {
        "text": " ortobonal a su espacio asociado a lambda 2. Siempre trabajando con operadores auto adjunto. Esos son todos",
        "start": 256.28,
        "end": 263.28
    },
    {
        "text": " resultados que valen para los operadores auto adjunto. Bien. Y finalmente anunciamos lo que es el",
        "start": 263.28,
        "end": 282.28
    },
    {
        "text": " teore más espectral para operadores adjunto que me de dice que si yo tengo un operador auto adjunto en dimensión",
        "start": 282.28,
        "end": 290.28
    },
    {
        "text": " finita entonces existe una base hortónormal de valores propios. Eso es lo que vamos a probar en la clase de hoy. Entonces vamos a",
        "start": 290.28,
        "end": 298.28
    },
    {
        "text": " volver a escribir este resultado y lo vamos a probar. Si te haremos espectral para operadores auto adjunto.",
        "start": 298.28,
        "end": 309.28
    },
    {
        "text": " Más adelante vamos a ver resultados equivalentes para otro tipo de operadores. Vamos llamar teore más espectral para",
        "start": 309.28,
        "end": 316.28
    },
    {
        "text": " operadores unitarios o para lo que fuera. Por lo pronto estamos trabajando en este contexto. Teore más espectral para",
        "start": 316.28,
        "end": 323.28
    },
    {
        "text": " operadores auto adjunto. Bien. Lo copiamos y lo probamos.",
        "start": 323.28,
        "end": 338.28
    },
    {
        "text": " Bien. Entonces este es el resultado que vamos a probarlo. Hemos anunciado la clase pasada si ya cuarta.",
        "start": 383.28,
        "end": 409.28
    },
    {
        "text": " Estamos entonces tenemos un espacio vectorial con producto interno sobre acá. Acá puede ser los reales o los complejos.",
        "start": 409.28,
        "end": 428.28
    },
    {
        "text": " La dimensión de B finita le llamamos en la dimensión del espacio vectorial y teore un operador auto adjunto.",
        "start": 428.28,
        "end": 435.28
    },
    {
        "text": " Lo que me dice el teore más espectral es que existe una base hortónormal de B formada por vectores propios de T. Esto es en particular que T",
        "start": 435.28,
        "end": 442.28
    },
    {
        "text": " diagonalizable porque existe una base de vectores propios pero además existe una base hortónormal de vectores propios.",
        "start": 442.28,
        "end": 449.28
    },
    {
        "text": " Es diagonalizable y una base hortónormal de vectores propios. Y eso es lo que vamos a probar ahora. La demostración es bastante sencilla.",
        "start": 449.28,
        "end": 460.28
    },
    {
        "text": " Vamos a usar un problema que vimos la clase pasada y que lo vamos a retomar y es inducción sobre esto, sobre la dimensión del espacio.",
        "start": 460.28,
        "end": 470.28
    },
    {
        "text": " Estamos trabajando. Entonces la demostración es inducción en la dimensión.",
        "start": 470.28,
        "end": 490.28
    },
    {
        "text": " Induction en N, en que es la dimensión del espacio en el que estamos trabajando.",
        "start": 490.28,
        "end": 501.28
    },
    {
        "text": " Bueno, como la dimensión de B finita una observación que había escrito acá que ya borre me dice que existe al menos un valor propio.",
        "start": 501.28,
        "end": 511.28
    },
    {
        "text": " Lo que hayamos escrito es un ratito como repaso de la clase pasada. Entonces por ser la dimensión de B finita existe al menos un valor propio que sabemos que es real.",
        "start": 511.28,
        "end": 528.28
    },
    {
        "text": " Por ser finita y te autoadjunta obviamente. Por ser la dimensión finita y te autoadjunta.",
        "start": 528.28,
        "end": 535.28
    },
    {
        "text": " Te autoadjunta. Operador autoadjunta. Existe al menos un valor propio de T.",
        "start": 535.28,
        "end": 555.28
    },
    {
        "text": " La andacero. Que además sabemos que es real pero bueno, por lo menos existe uno.",
        "start": 555.28,
        "end": 562.28
    },
    {
        "text": " Le vamos a llamar la andacero, un valor que estamos seguro puede existir otro más o puede que no, pero sabemos que uno al menos existe.",
        "start": 562.28,
        "end": 571.28
    },
    {
        "text": " Entonces lo que vamos a hacer es lo siguiente. Yo voy a considerar el espacio de tutorial B y voy a considerar el subesparcio asociado a ese valor propio que yo sé que existe que le llamamos ese sublandacero.",
        "start": 571.28,
        "end": 586.28
    },
    {
        "text": " Bien, entonces como existe un valor propio de Andacero existe un vector B0, le vamos a llamar así de existir B0 y tinto B0.",
        "start": 586.28,
        "end": 606.28
    },
    {
        "text": " En el subesparcio propio de Andacero, este es un vector propio de Andacero, eso es lo que estoy diciendo.",
        "start": 606.28,
        "end": 613.28
    },
    {
        "text": " Existe un vector distinto de B0, tal que pertenece a ese subesparcio propio de socio de Andacero.",
        "start": 613.28,
        "end": 618.28
    },
    {
        "text": " Entonces como me interesa construir una base horto normal, lo primero que vamos a hacer es hacer el vector lo voy a normalizar, esto es lo voy a vivir por su norma, así tiene norma 1.",
        "start": 618.28,
        "end": 629.28
    },
    {
        "text": " Entonces voy a considerar este vector, le voy a llamar B0 al vector B0 divido por su norma.",
        "start": 629.28,
        "end": 642.28
    },
    {
        "text": " Entonces esto acá es un elemento de ese lambda 0 y tiene norma 1, ese vector B0 será algo que está por acá.",
        "start": 642.28,
        "end": 652.28
    },
    {
        "text": " Estamos a atacar, lo único que hemos usado es que sabemos que existe un valor propio, por lo tanto agarro un vector propio y lo normalizo y tengo un vector propio acá en el lambda 0 que tiene norma 1, esto es el primer paso.",
        "start": 659.28,
        "end": 678.28
    },
    {
        "text": " Entonces ahora sí vamos al paso inicial o paso base, que es considerar que la dimensión del espacio vectoria de 1 y después vamos al paso inductivo.",
        "start": 678.28,
        "end": 689.28
    },
    {
        "text": " Paso base, supongamos, consideremos que la dimensión del espacio en la que estamos trabajando es 1, paso base n es igual a 1.",
        "start": 689.28,
        "end": 701.28
    },
    {
        "text": " Si tengo un espacio de dimensión 1 y yo sé que existe un valor propio, o sea tengo un vector propio en ese espacio y es un espacio de dimensión 1.",
        "start": 701.28,
        "end": 713.28
    },
    {
        "text": " Por lo tanto ese vector propio normalizado en ese espacio de dimensión 1 será una base de ese espacio de dimensión 1, se entiende?",
        "start": 713.28,
        "end": 721.28
    },
    {
        "text": " Que estamos en dimensión 1 y tengo un vector propio y significa que todos los elementos de espacio son vectores propios, sacando el 0 pero el 0 está en acá.",
        "start": 721.28,
        "end": 730.28
    },
    {
        "text": " Cuando eres igual a 1, el conjunto formado por el vector 0 que es vector propio, normalizado es una base autónormal de B y está formada por vectores propios.",
        "start": 730.28,
        "end": 749.28
    },
    {
        "text": " Entonces en el paso inicial cuando yo estoy en dimensión 1 sé que existe una base autónormal de B formada por vectores propios, esa base es un vector propio dividido su honor.",
        "start": 749.28,
        "end": 772.28
    },
    {
        "text": " Se entendió en ese caso, estamos en dimensión 1 lo que estamos diciendo como existe, tengo un espacio de dimensión 1 y como existe al menos un valor propio, significa que tengo un sub espacio propio en un espacio de dimensión 1, este sub espacio propio es no trivial, por lo tanto diciendo que todos los vectores de ese espacio son vectores propios,",
        "start": 773.28,
        "end": 792.28
    },
    {
        "text": " espacio de dimensión 1 lo genero con un vector propio desde su espacio que es un vector de norma 1 y esto es una base autónormal del espacio que estoy concierto.",
        "start": 792.28,
        "end": 802.28
    },
    {
        "text": " Entonces ahí la firmación se culte y ahora vamos al paso inductivo que consiste en suponer que la firmación la hipótesis de válida para todo espacio dimensión en el 1 y vamos a ver que entonces valida por un espacio de dimensión 1.",
        "start": 802.28,
        "end": 821.28
    },
    {
        "text": " Entonces supongamos que la hipótesis que",
        "start": 821.28,
        "end": 831.28
    },
    {
        "text": " en realidad vamos a suponer que la hipótesis en el espacio inductivo supone que la hipótesis de válida para cualquier",
        "start": 852.28,
        "end": 869.28
    },
    {
        "text": " dimensión menor igual que en el 1. Entonces supongamos que la hipótesis vale para cualquier espacio vectorial de dimensión menor igual a gremeno 1 y veamos que valida para él.",
        "start": 869.28,
        "end": 879.28
    },
    {
        "text": " No, no la inducción normal. No digo, solo voy a precisar para de menos 1 pero le escribo así,",
        "start": 879.28,
        "end": 898.28
    },
    {
        "text": " podría ver lo escrito otra manera. Veamos para él.",
        "start": 898.28,
        "end": 908.28
    },
    {
        "text": " Entonces yo lo que sé lo que sé es lo que acabo de firmar acá que existe menos un valor propio por lo tanto existe un subespacio propio de ese lambda 0.",
        "start": 908.28,
        "end": 919.28
    },
    {
        "text": " Existe un vector propio no nulo, digamos, es un vector propio que soció la lambda 0. Entonces vamos a considerar",
        "start": 919.28,
        "end": 934.28
    },
    {
        "text": " un vector propio del espacio.",
        "start": 934.28,
        "end": 943.28
    },
    {
        "text": " Tengo acá un vector propio, el que elegía ahí de norma 1 y considero el espacio generado por ese vector propio.",
        "start": 943.28,
        "end": 953.28
    },
    {
        "text": " Este espacio tiene dimensión 1 y no necesariamente este es el lambda 0 porque si es el lambda 0 tuviese dimensión mayor que 1 eso no me genera todo ese lambda 0.",
        "start": 954.28,
        "end": 966.28
    },
    {
        "text": " Pero sí sé que eso es un subespacio de dimensión le vamos a llamar ese un subespacio de dimensión 1.",
        "start": 966.28,
        "end": 974.28
    },
    {
        "text": " Se te han dios que me lo genero con el Wb0 que tengo acá.",
        "start": 975.28,
        "end": 979.28
    },
    {
        "text": " Entonces este subespacio está contenido en B y obviamente dimensión de ese es igual a 1.",
        "start": 979.28,
        "end": 991.28
    },
    {
        "text": " Estamos en la prueba más sencilla posible. Agarro el vector aquel que tengo que sé que existe un vector propio norma 1, considero ese es un subespacio generado por ese vector propio.",
        "start": 992.28,
        "end": 1010.28
    },
    {
        "text": " Este es un subespacio vectorial. Repito no necesariamente coincide con ese lambda 0 pero no importa, ese lambda 0 puede ser más grande, pero no me importa.",
        "start": 1011.28,
        "end": 1021.28
    },
    {
        "text": " Lo que sí me importa es que se cumple que este espacio es invariante bajo la acción de este.",
        "start": 1021.28,
        "end": 1028.28
    },
    {
        "text": " Si yo le aplico T a cualquier vector propio, cualquier elemento acá, cualquier múltiplo de Wb0 como es un vector propio si obteniendo otro múltiplo de Wb0.",
        "start": 1028.28,
        "end": 1043.28
    },
    {
        "text": " O sea que si yo le aplico T a cualquier elemento que está acá dentro sigo teniendo un elemento que está ahí adentro.",
        "start": 1043.28,
        "end": 1049.28
    },
    {
        "text": " Entonces lo que es importante es que ese espacio es invariante bajo la acción de T.",
        "start": 1049.28,
        "end": 1057.28
    },
    {
        "text": " Ese es invariante bajo T.",
        "start": 1057.28,
        "end": 1061.28
    },
    {
        "text": " Bien, entonces regamos este dibujito. Yo ahora tengo un espacio de imensión 1 que le llamo ese, que es invariante bajo la acción de T.",
        "start": 1062.28,
        "end": 1081.28
    },
    {
        "text": " Lo que voy a considerar es su complemento ortogonal y complemento ortogonal de ese que le llamamos ese ortogonal.",
        "start": 1081.28,
        "end": 1092.28
    },
    {
        "text": " Bueno, se acuerdan el lemma que probamos la clase pasada que yo les dije esto lo vamos a usar, el jueves, el lemma me decía que si yo tengo un espacio invariante bajo la acción de T y T es auto al junto, entonces el complemento ortogonal también es invariante bajo la acción de T.",
        "start": 1092.28,
        "end": 1110.28
    },
    {
        "text": " Eso lo probamos la clase pasada. Entonces vimos la clase pasada que si ese invariante bajo T y T auto al junto,",
        "start": 1111.28,
        "end": 1120.28
    },
    {
        "text": " entonces ese ortogonal es invariante bajo T.",
        "start": 1121.28,
        "end": 1132.28
    },
    {
        "text": " Eso significa que si yo le aplico T a cualquier elemento de ese ortogonal me quedo ahí adentro.",
        "start": 1133.28,
        "end": 1145.28
    },
    {
        "text": " Estamos y eso es por el lemma de la clase pasada.",
        "start": 1146.28,
        "end": 1155.28
    },
    {
        "text": " Que lo probamos, es la sensibilidad de probar, lemma de clase pasada.",
        "start": 1155.28,
        "end": 1163.28
    },
    {
        "text": " Bien, entonces fíjense lo siguiente, acá se va a casa donde aparece el paso inductivo.",
        "start": 1164.28,
        "end": 1170.28
    },
    {
        "text": " Yo tengo ese que tiene dimension 1, tengo el complemento ortogonal, bien que tiene dimension N-1 y tengo definido cada uno de fin y uno de fin y uno de fin variante bajo.",
        "start": 1170.28,
        "end": 1185.28
    },
    {
        "text": " Entonces yo considero la restricción de T a este subespacio que supera va a ser auto al junto porque el T sobre todo del espacio cumple la propiedad auto al junto,",
        "start": 1186.28,
        "end": 1195.28
    },
    {
        "text": " entonces en particular lo va a cumplir el marrastrijo a este subespacio.",
        "start": 1195.28,
        "end": 1200.28
    },
    {
        "text": " Entonces vamos a considerar la restricción.",
        "start": 1200.28,
        "end": 1209.28
    },
    {
        "text": " Por lo tanto la restricción de T que la vamos a anotar así al subespacio S que no es otra cosa que el propio T pero solamente aplicado los victores que están aquí adentro,",
        "start": 1210.28,
        "end": 1219.28
    },
    {
        "text": " me olvido del resto.",
        "start": 1219.28,
        "end": 1221.28
    },
    {
        "text": " Este aplicado a ese ortogonal que es un operador que va a dir ese ortogonal a ese ortogonal que esto está bien definido porque es invariante.",
        "start": 1221.28,
        "end": 1231.28
    },
    {
        "text": " Este operador es auto al junto, pues es la restricción a este conjunto de un operador auto al junto.",
        "start": 1232.28,
        "end": 1246.28
    },
    {
        "text": " ¿Sentien de esto?",
        "start": 1246.28,
        "end": 1249.28
    },
    {
        "text": " Acá es un importante de dos cosas. Primero que ese ortogonal sea invariante bajo la acción de T o sea que yo le aplico T a toda cosa que está acá adentro,",
        "start": 1250.28,
        "end": 1260.28
    },
    {
        "text": " está aquí adentro, por lo tanto tiene sentido restringir definir el operador restricción de T al subespacio S que es un operador liñal que va a dar acá mismo y que cumple obviamente la definición de producto auto al junto",
        "start": 1260.28,
        "end": 1275.28
    },
    {
        "text": " porque si la definición de todo junto se cumple para todo V, se acuerna la definición de auto al junto, que es agarrar TmV con WV y ver que esto me da lo mismo que V entiendo W,",
        "start": 1275.28,
        "end": 1287.28
    },
    {
        "text": " si esto se cumple para todo para los victores que yo agarré V en particular se va a cumplir para todo para los victores que yo agarré en ese ortogonal.",
        "start": 1287.28,
        "end": 1295.28
    },
    {
        "text": " Por lo tanto la restricción está bien definida y es un operador auto al junto y está definida de un espacio de mención N-1, entonces ahí puedo aplicar la hipoteza inductiva,",
        "start": 1295.28,
        "end": 1305.28
    },
    {
        "text": " tengo un operador auto al junto, definí una espacio de mención N-1.",
        "start": 1305.28,
        "end": 1311.28
    },
    {
        "text": " Entonces, a la hipoteza inductiva me dice que puedo encontrar ahí una base ortorormal formada por vectores propios de este operador restricción.",
        "start": 1311.28,
        "end": 1320.28
    },
    {
        "text": " ¿Se entiende? Entonces, dimensión de ese ortogonal igual a N-1 y la restricción de T a ese ortogonal auto al junto",
        "start": 1320.28,
        "end": 1340.28
    },
    {
        "text": " y implica por hipoteza inductiva",
        "start": 1340.28,
        "end": 1360.28
    },
    {
        "text": " que existe una base ortorormal",
        "start": 1360.28,
        "end": 1382.28
    },
    {
        "text": " una base ortorormal acullos de elementos es un espacio de mención N-1, no te diciendo que existe una base ortorormal de este subespacio y a los elementos le vamos a llamar W-1, W-2 hasta WN-1",
        "start": 1382.28,
        "end": 1402.28
    },
    {
        "text": " que es como dijimos una base ortorormal de complemento ortogonal de ese formada por vectores propios de el operador auto al junto que estamos considerando que es la restricción a ese ortogonal de T",
        "start": 1402.28,
        "end": 1430.28
    },
    {
        "text": " y la restricción de T a ese ortogonal es un operador auto al junto que está definido en un espacio de dimension N-1 como estamos subiendo la hipoteza inductiva, valida existe una base ortorormal de ese subespacio formada por vectores propios de este operador auto al junto",
        "start": 1430.28,
        "end": 1458.28
    },
    {
        "text": " son los operadores propiedades, estamos son los factores cumple en que esto aplicado cualquier vector, me da un lambda por ese vector, o sea son los factores propios de T",
        "start": 1458.28,
        "end": 1469.28
    },
    {
        "text": " entonces son los factores propios de T, son los factores propios de T, restringidos que están acá dentro de este subespacio",
        "start": 1470.28,
        "end": 1485.28
    },
    {
        "text": " entonces existe una base de vectores propios de T, de este subespacio y menciono el M-1, ¿sí? entonces como termino la demostración?",
        "start": 1486.28,
        "end": 1496.28
    },
    {
        "text": " yo tengo una base acá del espacio S que es un vector propio de T y tengo una base de ese ortogonal que son todos los factores propios de T",
        "start": 1497.28,
        "end": 1510.28
    },
    {
        "text": " como se cumple que B es S más S ortogonal, esto se cumple siempre, si yo me quiero formar una base de B me basta con agarrar una base de S y una base de ese ortogonal",
        "start": 1510.28,
        "end": 1527.28
    },
    {
        "text": " entonces como B es S más S ortogonal implica entonces que si yo consiro el conjunto W0 que es este vector y todos esos W1, W2 hasta Wn1",
        "start": 1528.28,
        "end": 1542.28
    },
    {
        "text": " eso es una base de B, esto es la base de S, este está generado por este, por tanto eso es una base y esto es una base de ese ortogonal",
        "start": 1543.28,
        "end": 1561.28
    },
    {
        "text": " pero además todos estos son ortogonales entre S y porque justamente la hipoteciductiva me dice eso, estos son vectores propios y una base de ortogonal de vectores propios",
        "start": 1562.28,
        "end": 1573.28
    },
    {
        "text": " o sea que estos son ortogonales entre S y tienen norma 1, este tiene norma 1 y además es ortogonal a cada uno de estos porque este está en S y este está en ese ortogonal",
        "start": 1573.28,
        "end": 1583.28
    },
    {
        "text": " por lo tanto esto es una base ortogonal de vectores propios de T, entonces existe esto que es una base ortogonal de B",
        "start": 1584.28,
        "end": 1593.28
    },
    {
        "text": " formada por vectores propios de T",
        "start": 1595.28,
        "end": 1598.28
    },
    {
        "text": " porque este autoadjunta, ¿sí?",
        "start": 1598.28,
        "end": 1605.28
    },
    {
        "text": " exactamente exactamente, no, acá estamos este resultado es el turno espectras para operadores autoadjuntos, esto vale para operadores autoadjuntos",
        "start": 1605.28,
        "end": 1624.28
    },
    {
        "text": " si T nos fuese autoadjunta esto no tiene por qué ser ortogonal de esto y además aún si T nos fuese autoadjunta esto no tiene por qué ser un espacio invariante",
        "start": 1625.28,
        "end": 1635.28
    },
    {
        "text": " o sea ahí precisamos fuertemente que sea un operador autoadjunto",
        "start": 1635.28,
        "end": 1642.28
    },
    {
        "text": " por eso digo, el resultado este no es que se puede tener emanada sencilla acá son las generales porque estamos usando fuertemente que sea autoadjunto",
        "start": 1644.28,
        "end": 1652.28
    },
    {
        "text": " fíjense que yo lo podría haber hecho como surgieron aquí recién usando la inducción fuertemente",
        "start": 1655.28,
        "end": 1663.28
    },
    {
        "text": " simplemente considerando no al espacio generado por un elemento W0 sino al espacio generado una base ortonomal de su espacio asociado a la ambasero",
        "start": 1663.28,
        "end": 1674.28
    },
    {
        "text": " que puede ser uno o más, bueno podría verlo formulado otra manera pero así que había bien sencilla supongo que es valio por N-1 y producto es valio para ella",
        "start": 1675.28,
        "end": 1686.28
    },
    {
        "text": " volví en serio que dije que en barre la cancha no",
        "start": 1687.28,
        "end": 1690.28
    },
    {
        "text": " bueno estamos ese es el famoso teorema espectral para operadores autoadjuntos me dice que existe una base ortonomal formada por vectores propios de T",
        "start": 1691.28,
        "end": 1703.28
    },
    {
        "text": " ya vamos a ver algunas observaciones que se deducen de este resultado y que lo hacen justamente útil",
        "start": 1703.28,
        "end": 1711.28
    },
    {
        "text": " preguntas",
        "start": 1711.28,
        "end": 1713.28
    },
    {
        "text": " estoy medio dormido, veniendo en auto casi choque 2 veces en el camino",
        "start": 1726.28,
        "end": 1730.28
    },
    {
        "text": " bueno",
        "start": 1733.28,
        "end": 1735.28
    },
    {
        "text": " en fin",
        "start": 1738.28,
        "end": 1740.28
    },
    {
        "text": " y vamos a dar la recí prograta resultado que es bien sencilla me dice que si yo tengo una base ortonomal formada por vectores propios que además son reales entonces este autoadjunto",
        "start": 1741.28,
        "end": 1752.28
    },
    {
        "text": " eso es absolutamente trivial de probar pero lo vamos a escribir también",
        "start": 1752.28,
        "end": 1757.28
    },
    {
        "text": " bueno",
        "start": 1764.28,
        "end": 1765.28
    },
    {
        "text": " estamos, alguna pregunta",
        "start": 1766.28,
        "end": 1768.28
    },
    {
        "text": " vamos a ver la recí prograta de este resultado que me dice entonces",
        "start": 1775.28,
        "end": 1778.28
    },
    {
        "text": " bueno",
        "start": 1793.28,
        "end": 1795.28
    },
    {
        "text": " vamos a ver",
        "start": 1823.28,
        "end": 1825.28
    },
    {
        "text": " bueno",
        "start": 1853.28,
        "end": 1855.28
    },
    {
        "text": " bueno",
        "start": 1855.28,
        "end": 1857.28
    },
    {
        "text": " bueno",
        "start": 1857.28,
        "end": 1859.28
    },
    {
        "text": " bueno",
        "start": 1860.28,
        "end": 1861.28
    },
    {
        "text": " bien la versión recí prograta del teorema que hagamos a ver el siguiente",
        "start": 1876.28,
        "end": 1881.28
    },
    {
        "text": " yo tengo un espacio vectorial con product interno sobre el cuerpo K, dimensión finita y teuroperao lineal me dice que existe una base ortonomal de B",
        "start": 1882.28,
        "end": 1891.28
    },
    {
        "text": " formada por vectores propios de T y además las raíces del ponimo gratis y los reales, es decir los valores propios son todos reales con trabajo con los complejos",
        "start": 1891.28,
        "end": 1902.28
    },
    {
        "text": " estamos entonces te autoadjunto",
        "start": 1902.28,
        "end": 1905.28
    },
    {
        "text": " estamos russado que vale tanto para los complejos para como para los reales",
        "start": 1912.28,
        "end": 1921.28
    },
    {
        "text": " así que",
        "start": 1921.28,
        "end": 1924.28
    },
    {
        "text": " bien vamos a probar eso que es bien, es bien sencilla",
        "start": 1929.28,
        "end": 1932.28
    },
    {
        "text": " la demostración es es bien sencilla, yo tengo una base ortonomal formada por vectores propios",
        "start": 1932.28,
        "end": 1938.28
    },
    {
        "text": " le vamos a llamar a esa base ortonomal a los elementos le vamos a llamar V1, V2 hasta Vn",
        "start": 1938.28,
        "end": 1948.28
    },
    {
        "text": " esto es una base ortonomal de B formada por vectores propios de T",
        "start": 1955.28,
        "end": 1958.28
    },
    {
        "text": " entonces esto significa obviamente que si yo le aplico T a cualquier elemento de la base",
        "start": 1969.28,
        "end": 1978.28
    },
    {
        "text": " alí es inmolimento de la base eso será el valor propio que ya vemos lambda i por V subi",
        "start": 1978.28,
        "end": 1986.28
    },
    {
        "text": " y además los lambda i son reales",
        "start": 1986.28,
        "end": 1992.28
    },
    {
        "text": " eso es lo que estamos poniendo como hipote si existe una base ortonomal formada por vectores propios de T y las raíces",
        "start": 1993.28,
        "end": 2001.28
    },
    {
        "text": " el ponimo característico son reales, o sea los valores propios son reales",
        "start": 2001.28,
        "end": 2005.28
    },
    {
        "text": " entonces queremos ver ahora que con esto me alcanza para ver que T es autoadjunto",
        "start": 2005.28,
        "end": 2012.28
    },
    {
        "text": " entonces lo que vamos a hacer vamos a fijarnos cuándo nos da la materia asociada a T en la base en esa base ortonomal",
        "start": 2013.28,
        "end": 2022.28
    },
    {
        "text": " y vamos a ver qué propia T esta materia",
        "start": 2025.28,
        "end": 2029.28
    },
    {
        "text": " bien entonces como construyo la materia asociada esto, ¿qué me da la materia asociada?",
        "start": 2034.28,
        "end": 2039.28
    },
    {
        "text": " te aplicaba V1 me dará el valor propio lambda i por V1",
        "start": 2039.28,
        "end": 2043.28
    },
    {
        "text": " entonces cuando descompongo te aplicado V1 como combinación de la base y me va a quedar un lambda i a arriba",
        "start": 2043.28,
        "end": 2049.2799999999997
    },
    {
        "text": " un 0 aca y en 0 aca",
        "start": 2049.2799999999997,
        "end": 2052.2799999999997
    },
    {
        "text": " porque te aplicaba V1 es lambda i por V1 que es lambda i, la coordena primera, masero por la coordena que es la coordena de segunda, masero masero",
        "start": 2052.2799999999997,
        "end": 2061.2799999999997
    },
    {
        "text": " y te aplicado V2 será lambda por V2, lambda 2 por V2 que si lo escribo aca en coordena, será 0, lambda 2 hasta 0",
        "start": 2062.28,
        "end": 2071.28
    },
    {
        "text": " y finalmente te aplicado Vn será lambda n por Vn",
        "start": 2071.28,
        "end": 2075.28
    },
    {
        "text": " estos son los valores propios que pueden ser igual o no, tanto da lo ya me asi",
        "start": 2079.28,
        "end": 2083.28
    },
    {
        "text": " y lo que tenemos además es que todos estos valores propios que aparecen acá todos estos elementos de la diagonal",
        "start": 2083.28,
        "end": 2089.28
    },
    {
        "text": " son numeritos reales por hipótesis",
        "start": 2089.28,
        "end": 2093.28
    },
    {
        "text": " entonces observémoslo si entes estamos trabajando en el caso real, es decir si el cuerpo real, entonces esa matriz",
        "start": 2093.28,
        "end": 2107.28
    },
    {
        "text": " esa matriz cumple lo siguiente, si yo la transpongo me da lo mismo, esa matriz cumple que",
        "start": 2107.28,
        "end": 2115.28
    },
    {
        "text": " si la transpongo me da la misma matriz",
        "start": 2115.28,
        "end": 2122.28
    },
    {
        "text": " por lo tanto esta matriz es ymetrica",
        "start": 2122.28,
        "end": 2127.28
    },
    {
        "text": " y además tengo una base ortonormal de V",
        "start": 2132.28,
        "end": 2135.28
    },
    {
        "text": " entonces tengo que la matriz asociate en una base ortonormal es ymetrica, eso es equivalente a decir en el caso real que te es auto adjunta",
        "start": 2135.28,
        "end": 2149.28
    },
    {
        "text": " lo vimos hace un par de clases, entonces esta matriz en el caso real es ymetrica y la estoy escribiendo a tener una base ortonormal",
        "start": 2149.28,
        "end": 2157.28
    },
    {
        "text": " por lo tanto implica que te es auto adjunta",
        "start": 2157.28,
        "end": 2161.28
    },
    {
        "text": " y el caso complejo es completamente análogo, si yo estoy trabajando con los escalares complejos",
        "start": 2165.28,
        "end": 2175.28
    },
    {
        "text": " entonces ahí transponer y conjugar como todas estas andras son reales me da la misma matriz esta",
        "start": 2175.28,
        "end": 2183.28
    },
    {
        "text": " en el caso complejo se cumple que si yo conjugo y transpongo esto me da lo mismo que la matriz original",
        "start": 2183.28,
        "end": 2195.28
    },
    {
        "text": " eso es porque insisto porque los valores propios son reales",
        "start": 2195.28,
        "end": 2200.28
    },
    {
        "text": " entonces esta matriz es lo que se llama hermítica",
        "start": 2200.28,
        "end": 2207.28
    },
    {
        "text": " y es la representación matricial de T en una base ortonormal por lo tanto sabemos que su implica que te es auto adjunta",
        "start": 2211.28,
        "end": 2222.28
    },
    {
        "text": " y es una pavada esta demostración es simplemente ver que la representación matricial en esa base ortonormal que es trivial de calcular",
        "start": 2230.28,
        "end": 2242.28
    },
    {
        "text": " es ymetrica en el caso real y es hermítica en el caso complejo por lo tanto la matriz por lo tanto lo operador es este auto adjunta",
        "start": 2242.28,
        "end": 2250.28
    },
    {
        "text": " estamos bueno no sé si hay problemas hasta aquí preguntas",
        "start": 2250.28,
        "end": 2257.28
    },
    {
        "text": " me aburrió esto es que es cosa pesada",
        "start": 2257.28,
        "end": 2263.28
    },
    {
        "text": " lo peor es que tengo miedo de olvidarme algo y que quede ahí algún agujero sin rellenar",
        "start": 2263.28,
        "end": 2269.28
    },
    {
        "text": " pero por eso estoy chequeando que haya escrito todo",
        "start": 2269.28,
        "end": 2272.28
    },
    {
        "text": " estamos bueno lo que quería hacer ahora en lo que resta de clase ya no más teorema ya no más demostraciones",
        "start": 2273.28,
        "end": 2286.28
    },
    {
        "text": " lo que quería hacer primero una observación que se deduce del teorema espectral que la que justifica en parte la utilidad de este teorema",
        "start": 2286.28,
        "end": 2301.28
    },
    {
        "text": " y en segundo lugar un ejemplo que están las notas de que hay operadores auto adjuntos en espacio y mención infinita que no tienen valores propios",
        "start": 2301.28,
        "end": 2311.28
    },
    {
        "text": " eso para terminar de completar este algún comentario que me has hecho por ahí",
        "start": 2311.28,
        "end": 2316.28
    },
    {
        "text": " bueno",
        "start": 2316.28,
        "end": 2318.28
    },
    {
        "text": " bueno",
        "start": 2318.28,
        "end": 2320.28
    },
    {
        "text": " cuando se habla de dimensión infinita",
        "start": 2330.28,
        "end": 2333.28
    },
    {
        "text": " si importa si el impuesto es un medio",
        "start": 2333.28,
        "end": 2337.28
    },
    {
        "text": " no no no no no no no no no importa",
        "start": 2337.28,
        "end": 2340.28
    },
    {
        "text": " la espacial y mención infinita en general son las espacios de susenciones o los espacios de funciones",
        "start": 2340.28,
        "end": 2347.28
    },
    {
        "text": " contínos de este tipo de cosas",
        "start": 2347.28,
        "end": 2352.28
    },
    {
        "text": " ahí no importa no importa en cosas más",
        "start": 2352.28,
        "end": 2357.28
    },
    {
        "text": " más detalladas de espacio",
        "start": 2357.28,
        "end": 2363.28
    },
    {
        "text": " bueno entonces vamos a la observación importante que les quería hacer",
        "start": 2363.28,
        "end": 2368.28
    },
    {
        "text": " observación sobre el teorema espectral",
        "start": 2368.28,
        "end": 2375.28
    },
    {
        "text": " entonces vamos a considerar como siempre un operador auto adjuntos en un espacio con producto interno etc",
        "start": 2381.28,
        "end": 2389.28
    },
    {
        "text": " y vamos a considerar el conjunto de sus valores propios que son las raíces características",
        "start": 2390.28,
        "end": 2401.28
    },
    {
        "text": " les vamos a llamar lambda 1 lambda 2 hasta lambda acá supongamos que la dimensión de b de finita que les voy a llamar n",
        "start": 2401.28,
        "end": 2410.28
    },
    {
        "text": " entonces puede haber este un valor propio seguro hay uno pero puede haber hasta n valores propios distintos",
        "start": 2410.28,
        "end": 2417.28
    },
    {
        "text": " entonces le vamos a llamar a los valores propios de t le vamos a llamar lambda 1 lambda 2 hasta lambda acá",
        "start": 2417.28,
        "end": 2424.28
    },
    {
        "text": " estos son los valores propios de t",
        "start": 2424.28,
        "end": 2429.28
    },
    {
        "text": " son reales",
        "start": 2435.28,
        "end": 2438.28
    },
    {
        "text": " y son todas las raíces son todas las raíces el polimium caracterista",
        "start": 2438.28,
        "end": 2445.28
    },
    {
        "text": " entonces con esos valores propios yo voy al espacio b y me construyo ahí adentro los subespacios propios",
        "start": 2446.28,
        "end": 2454.28
    },
    {
        "text": " o sea tengo el espacio sobre lo que estoy trabajando y tengo los subespacios propios asociados a cada vector",
        "start": 2454.28,
        "end": 2464.28
    },
    {
        "text": " entonces tengo por ejemplo el es el lambda 1 el es el lambda 2",
        "start": 2464.28,
        "end": 2470.28
    },
    {
        "text": " y yo que se pongamos por acá el es el lambda 3",
        "start": 2471.28,
        "end": 2477.28
    },
    {
        "text": " bien",
        "start": 2481.28,
        "end": 2484.28
    },
    {
        "text": " el hecho es que este es un operador de autoarjunto me garantiza de que estos espacios este espacio y este son ortobonales entre así",
        "start": 2486.28,
        "end": 2496.28
    },
    {
        "text": " bien porque son subespacios propios asociados a diferentes valores propios o sea que los subespacios propios asociados a este a este a este a este",
        "start": 2497.28,
        "end": 2508.28
    },
    {
        "text": " y a este son todos los autobonales de apáres cada uno de ellos ortobonal al otro subespacio propio de este",
        "start": 2508.28,
        "end": 2514.28
    },
    {
        "text": " ortobonal a este, este, este, este, etc.",
        "start": 2515.28,
        "end": 2518.28
    },
    {
        "text": " entonces vamos a conseguir una base ortonomal formada por vectores propios",
        "start": 2518.28,
        "end": 2525.28
    },
    {
        "text": " vamos a elegir algunos una base en ese lambda 1, una base en ese lambda 2, etc",
        "start": 2525.28,
        "end": 2531.28
    },
    {
        "text": " y con eso tenemos una base en el espacio vectorial completo",
        "start": 2531.28,
        "end": 2535.28
    },
    {
        "text": " entonces vamos a considerar",
        "start": 2535.28,
        "end": 2538.28
    },
    {
        "text": " el tenemos que espectrarme asegura que eso existe vamos a considerar una base ortonomal de vectores propios",
        "start": 2539.28,
        "end": 2545.28
    },
    {
        "text": " una base ortonomal digo de B forma por vectores propios",
        "start": 2555.28,
        "end": 2561.28
    },
    {
        "text": " bien eso lo que me dice el termina espectral me garantiza que existe una base ortonomal formada por vectores propios",
        "start": 2569.28,
        "end": 2578.28
    },
    {
        "text": " entonces algunos vectores propios obviamente los delijo acá eso será una base ortonomal de ese subespacio",
        "start": 2578.28,
        "end": 2585.28
    },
    {
        "text": " es el lambda 1, otros los delijo acá eso es que será una base de el espacio ortonomal de ese lambda 2, etc",
        "start": 2585.28,
        "end": 2590.28
    },
    {
        "text": " otros por acá hasta así hasta completar todo su espacio propio",
        "start": 2590.28,
        "end": 2594.28
    },
    {
        "text": " entonces pensemos que los he ordenado tal manera es que los primeros no importa hasta donde llegan",
        "start": 2594.28,
        "end": 2600.28
    },
    {
        "text": " estos son una base ortonomal de ese lambda 1, estos son vectores propios de ese",
        "start": 2600.28,
        "end": 2608.28
    },
    {
        "text": " vectores propios de ese lambda 1 solamente para simplificar la escritura lo que viene",
        "start": 2608.28,
        "end": 2615.28
    },
    {
        "text": " pensemos que estos hasta por acá son vectores propios de la nada 1 los que siguen por acá serán vectores propios",
        "start": 2616.28,
        "end": 2622.28
    },
    {
        "text": " propios de ese lambda 2, etc. y a los últimos serán los vectores propios",
        "start": 2627.28,
        "end": 2633.28
    },
    {
        "text": " de ese lambda n, pero en ese lambda acá tengo acá valores propios distintos, los he ordenado",
        "start": 2634.28,
        "end": 2646.28
    },
    {
        "text": " opuesto los primeros que están en ese lambda 1, después en ese lambda 2 y pensemos que si esto los puedo",
        "start": 2646.28,
        "end": 2651.28
    },
    {
        "text": " ordenar de menor a mayor son números reales, los tengo ordenado ahí y los solo no acá para simplificar",
        "start": 2651.28,
        "end": 2656.28
    },
    {
        "text": " la escritura lo que viene, fíjense como le decía recién como esto es una base ortonomal de b",
        "start": 2656.28,
        "end": 2662.28
    },
    {
        "text": " estos son ortonormales entre pares y diéndome a 1, cada uno de estos conjuntos, esto acá es una base",
        "start": 2663.28,
        "end": 2671.28
    },
    {
        "text": " ortonomal de ese lambda 1, eso es una base ortonomal de ese lambda 2, lo que tengo acá es una base",
        "start": 2671.28,
        "end": 2676.28
    },
    {
        "text": " ortonomal de ese lambda acá. Entonces sabemos que de las propiedades de base ortonomales",
        "start": 2676.28,
        "end": 2683.28
    },
    {
        "text": " sabemos que fácil agarrar un vector cualquier ahora en el espacio vectorial y descomponerlo",
        "start": 2683.28,
        "end": 2688.28
    },
    {
        "text": " usando la base ortonomal. Entonces ahora me dan ustedes un vector cualquiera el espacio vectorial",
        "start": 2688.28,
        "end": 2695.28
    },
    {
        "text": " entonces da un vector cualquiera en el espacio vectorial por propiedades de las bases",
        "start": 2695.28,
        "end": 2707.28
    },
    {
        "text": " ortonomales tenemos lo siguiente, tenemos que al velo podemos escribir, se acuerdan como se",
        "start": 2707.28,
        "end": 2718.28
    },
    {
        "text": " descompone el ve como combinación y ya de los elementos de base ortonomal, tengo que tomar",
        "start": 2718.28,
        "end": 2725.28
    },
    {
        "text": " el producto interno de ve con cada uno de estos vectores multiplicarlo por el vector respectivo",
        "start": 2725.28,
        "end": 2731.28
    },
    {
        "text": " y hacer lo mismo con todos y sumar o sea será ve escalar ve uno por ve uno, más ve escalar",
        "start": 2732.28,
        "end": 2738.28
    },
    {
        "text": " ve dos por ve dos etcétera, entonces voy a grupar los sumandos así como los dividir",
        "start": 2738.28,
        "end": 2743.28
    },
    {
        "text": " acá, primero voy a hacer ve con cada uno los vectores que están acá en ese lambda 1, eso lo vamos",
        "start": 2743.28,
        "end": 2749.28
    },
    {
        "text": " a escribir así voy a hacer ve escalar ve subí, por ve subí donde esto tú sumando a ver si",
        "start": 2749.28,
        "end": 2757.28
    },
    {
        "text": " entiendes la notación, acá estoy sumando sobre todos los vectores que están en ese lambda",
        "start": 2757.28,
        "end": 2762.28
    },
    {
        "text": " 1, acá ese lambda 1 podría tener un solo vector si fuese a dimension 1 o más depende",
        "start": 2762.28,
        "end": 2768.28
    },
    {
        "text": " cual sea la dimensión de ese lambda 1 bien sumo sobre todo esos vectores que forman acá",
        "start": 2768.28,
        "end": 2774.28
    },
    {
        "text": " una base de ese lambda 1, después sigo ve escalar todos los que vienen acá que son vectores",
        "start": 2774.28,
        "end": 2780.28
    },
    {
        "text": " propios de ese lambda 2 o sea acá tendría más sumatoria ahora ve subí en ese lambda 2 no estoy",
        "start": 2780.28,
        "end": 2788.28
    },
    {
        "text": " seguro que esta sea la mejor notación pero no se me ocurrió otra sumo sobre todo los vectores",
        "start": 2788.28,
        "end": 2797.28
    },
    {
        "text": " que ahora están en ese lambda 2 las coordenadas que son ve escalar ve subí por el los vectores",
        "start": 2797.28,
        "end": 2802.28
    },
    {
        "text": " correspondientes y así sigo hasta el final hasta que me va a quedar las sumas sobre todo los vectores",
        "start": 2802.28,
        "end": 2808.28
    },
    {
        "text": " que están acá en ese lambda 1 acá se entiende esta notación este es ve,",
        "start": 2809.28,
        "end": 2828.28
    },
    {
        "text": " productos canar con cada uno de los elementos que son vectores propios de ese lambda 1 por los vectores correspondientes",
        "start": 2828.28,
        "end": 2834.28
    },
    {
        "text": " después lo mismo con ese lambda 2 después lo mismo con lo que están en ese lambda 1 eso",
        "start": 2834.28,
        "end": 2839.28
    },
    {
        "text": " es por propiedades la base de las normales y ahora le aplico tea todo eso quiero ver como se",
        "start": 2839.28,
        "end": 2845.28
    },
    {
        "text": " escribe tembe entonces cuando yo le explico tea todo eso miren qué lindo que es lo que queda",
        "start": 2845.28,
        "end": 2854.28
    },
    {
        "text": " obviamente vamos a usar acá la linealidad de te entonces cuando yo le aplico tea todo esto me va",
        "start": 2854.28,
        "end": 2862.28
    },
    {
        "text": " a quedar una suma de tea aplicada a estas coordenadas que salen para afuera y multiplicada por tea aplicado ve",
        "start": 2862.28,
        "end": 2868.28
    },
    {
        "text": " y acá los veis son elementos de ese lambda 1 y así cuando le aplique tea todos los elementos que están",
        "start": 2868.28,
        "end": 2873.28
    },
    {
        "text": " entre sumatorias que me va a dar lambda 1 por veis pues son todos vectores propios de correspondientes",
        "start": 2873.28,
        "end": 2879.28
    },
    {
        "text": " de lambda 1 los que vienen acá tea aplicados a esto como son todos vectores propios correspondientes",
        "start": 2879.28,
        "end": 2884.28
    },
    {
        "text": " de lambda 2 me va a dar lambda 2 por veis etcétera y lo te he aplicado esto me va a dar lambda",
        "start": 2884.28,
        "end": 2890.28
    },
    {
        "text": " acá por veis entonces cuando le aplico tea todas estas cosas todos los que están en la primera",
        "start": 2890.28,
        "end": 2896.28
    },
    {
        "text": " sumatoria la aplicación de tea me va a dar lambda y por esto el lambda y lo se pero el lambda 1 lo salco",
        "start": 2896.28,
        "end": 2902.28
    },
    {
        "text": " para afuera y me va a dar lambda 1 por esto mismo entonces me va a quedar lambda 1 por la sumatoria",
        "start": 2902.28,
        "end": 2910.28
    },
    {
        "text": " de todas estas cosas",
        "start": 2911.28,
        "end": 2914.28
    },
    {
        "text": " esta es la primera parte se entendió eso yo aplico tea todo esto me queda la sumatoria",
        "start": 2919.28,
        "end": 2925.28
    },
    {
        "text": " los escales salen para afuera y te aplico a veis tea aplicado a veis como veis son su espacios",
        "start": 2925.28,
        "end": 2930.28
    },
    {
        "text": " propio asociado lambda 1 son todos lambda 1 por el veico correspondiente o sea que cada uno",
        "start": 2930.28,
        "end": 2935.28
    },
    {
        "text": " está sumando hay un lambda y lambda 1 que lo puse acá para afuera y me queda esto mismo me queda",
        "start": 2935.28,
        "end": 2941.28
    },
    {
        "text": " lambda 1 por esto acá lo que sale para afuera es lambda 2 porque estos son vectores propios asociados",
        "start": 2941.28,
        "end": 2948.28
    },
    {
        "text": " a lambda 2",
        "start": 2948.28,
        "end": 2950.28
    },
    {
        "text": " ya van a ver por aquí estoy haciendo todo esto",
        "start": 2956.28,
        "end": 2960.28
    },
    {
        "text": " y acá me va a quedar tea aplicado a esto que son vectores propios a la lambda",
        "start": 2961.28,
        "end": 2967.28
    },
    {
        "text": " cada uno de ellos me va a dar lambda acá por el veico correspondiente, se ha con lambda",
        "start": 2967.28,
        "end": 2971.28
    },
    {
        "text": " acá para afuera",
        "start": 2971.28,
        "end": 2974.28
    },
    {
        "text": " bien",
        "start": 2983.28,
        "end": 2986.28
    },
    {
        "text": " y ahora viene la gran pregunta",
        "start": 2992.28,
        "end": 2996.28
    },
    {
        "text": " ¿qué es esto?",
        "start": 3001.28,
        "end": 3004.28
    },
    {
        "text": " yo les digo ustedes si a me que diablo es esto",
        "start": 3004.28,
        "end": 3011.28
    },
    {
        "text": " estoy haciendo que estoy haciendo ahí estoy considerando una base orto normal de su espacio",
        "start": 3014.28,
        "end": 3020.28
    },
    {
        "text": " es el lambda 1",
        "start": 3020.28,
        "end": 3023.28
    },
    {
        "text": " la base orto normal es el lambda 1 y estoy haciendo el producto interno de ve con cada uno de los elementos",
        "start": 3023.28,
        "end": 3028.28
    },
    {
        "text": " de esa base multiplicando por el elemento correspondiente y sumando",
        "start": 3028.28,
        "end": 3033.28
    },
    {
        "text": " eso es la proyección orto-gonal del vector b sobre su espacio es el lambda 1",
        "start": 3033.28,
        "end": 3040.28
    },
    {
        "text": " estamos esto es otra cosa que la proyección orto-gonal sobre su espacio es el lambda 1",
        "start": 3040.28,
        "end": 3047.28
    },
    {
        "text": " del vector b que estoy considerando",
        "start": 3047.28,
        "end": 3051.28
    },
    {
        "text": " y lo mismo esto esto será la proyección orto-gonal ahora sobre su espacio es el lambda 2",
        "start": 3051.28,
        "end": 3058.28
    },
    {
        "text": " del vector que estoy considerando y ahora lo que a mente esto será la proyección orto-gonal sobre el espacio es el lambda",
        "start": 3065.28,
        "end": 3075.28
    },
    {
        "text": " del vector que estoy considerando",
        "start": 3075.28,
        "end": 3082.28
    },
    {
        "text": " se entendió entonces fíjense que manera compacto describir las cosas",
        "start": 3086.28,
        "end": 3090.28
    },
    {
        "text": " te he aplicado a b me da lo mismo que el primer valor propio lambda 1 por la proyección de ve sobre su espacio",
        "start": 3090.28,
        "end": 3098.28
    },
    {
        "text": " propio asociado a esto es el lambda 1",
        "start": 3098.28,
        "end": 3100.28
    },
    {
        "text": " más lambda 2 por la proyección orto-gonal de ve sobre su espacio propio asociado a esto",
        "start": 3101.28,
        "end": 3105.28
    },
    {
        "text": " etcétera más lambda acá por la proyección orto-gonal de ve sobre su espacio propio este",
        "start": 3105.28,
        "end": 3109.28
    },
    {
        "text": " y esto vale para cualquier vector que yo considere",
        "start": 3109.28,
        "end": 3112.28
    },
    {
        "text": " esto vale para cualquier vector b",
        "start": 3112.28,
        "end": 3114.28
    },
    {
        "text": " esto vale para todo b del espacio vectorial en el que estoy trabajando",
        "start": 3117.28,
        "end": 3123.28
    },
    {
        "text": " por lo tanto estoy diciendo que esta transformación t la puedas escribir como la lambda 1 por esta proyección orto-gonal",
        "start": 3123.28,
        "end": 3129.28
    },
    {
        "text": " más lambda 2 por esta proyección orto-gonal, más lambda etcétera lambda acá por esta proyección orto-gonal",
        "start": 3129.28,
        "end": 3134.28
    },
    {
        "text": " entonces en conclusión",
        "start": 3134.28,
        "end": 3136.28
    },
    {
        "text": " en conclusión te lo podemos escribir",
        "start": 3143.28,
        "end": 3148.28
    },
    {
        "text": " el opinar te lo podemos escribir como el valor propio lambda 1 por la proyección orto-gonal sobre su espacio",
        "start": 3148.28,
        "end": 3156.28
    },
    {
        "text": " más el valor propio lambda 2 por la proyección orto-gonal sobre su lambda 2",
        "start": 3157.28,
        "end": 3162.28
    },
    {
        "text": " más así hasta terminar con todos los valores propios",
        "start": 3162.28,
        "end": 3167.28
    },
    {
        "text": " el lambda acá por la proyección orto-gonal sobre su lambda acá",
        "start": 3167.28,
        "end": 3171.28
    },
    {
        "text": " es decir a p hasta y lo podemos descomponer de esta manera como una combinación",
        "start": 3171.28,
        "end": 3175.28
    },
    {
        "text": " lineal de operadores de proyección sobre los subespacios propios respectivos",
        "start": 3175.28,
        "end": 3180.28
    },
    {
        "text": " son proyecciones multiplicadas por el valor propio correspondiente",
        "start": 3180.28,
        "end": 3185.28
    },
    {
        "text": " protección sobre su espacio propio por su valor propio correspondiente",
        "start": 3185.28,
        "end": 3189.28
    },
    {
        "text": " bien esto acá entonces bueno estos son proyecciones orto-gonales",
        "start": 3189.28,
        "end": 3194.28
    },
    {
        "text": " sobre los subespacios propios",
        "start": 3206.28,
        "end": 3209.28
    },
    {
        "text": " propios esto acá los lambda son los que se llaman el espectro del operador",
        "start": 3209.28,
        "end": 3216.28
    },
    {
        "text": " de ahí el nombre teorema espectral",
        "start": 3216.28,
        "end": 3219.28
    },
    {
        "text": " esto es lo que se llama el espectro",
        "start": 3219.28,
        "end": 3221.28
    },
    {
        "text": " el espectro del operador t",
        "start": 3224.28,
        "end": 3226.28
    },
    {
        "text": " y lo que estamos haciendo es descomponiendo t como combinación lineal de proyección orto-gonales",
        "start": 3226.28,
        "end": 3231.28
    },
    {
        "text": " y eso es lo que se llama la descomposición espectral de t",
        "start": 3231.28,
        "end": 3234.28
    },
    {
        "text": " esto sería la descomposición espectral de t",
        "start": 3234.28,
        "end": 3238.28
    },
    {
        "text": " y fíjense las propiedades",
        "start": 3238.28,
        "end": 3243.28
    },
    {
        "text": " lindas que se desprenen de la descomposición espectral",
        "start": 3243.28,
        "end": 3248.28
    },
    {
        "text": " que ya vamos a escribir ahora ¿no?",
        "start": 3248.28,
        "end": 3250.28
    },
    {
        "text": " estos subespacios propios por ser teotodos juntos son todos orto-gonales entre sí",
        "start": 3250.28,
        "end": 3255.28
    },
    {
        "text": " esto es tengo ser resultado",
        "start": 3255.28,
        "end": 3257.28
    },
    {
        "text": " a te lo puedes escribir como combinación",
        "start": 3257.28,
        "end": 3260.28
    },
    {
        "text": " y a te lo puedes escribir como combinación",
        "start": 3260.28,
        "end": 3263.28
    },
    {
        "text": " y a te lo puedes escribir como combinación",
        "start": 3263.28,
        "end": 3266.28
    },
    {
        "text": " y a te lo puedes escribir como combinación lineal de valores propios por las proyecciones",
        "start": 3266.28,
        "end": 3271.28
    },
    {
        "text": " los subespacios propios",
        "start": 3271.28,
        "end": 3274.28
    },
    {
        "text": " respetivos",
        "start": 3274.28,
        "end": 3278.28
    },
    {
        "text": " preguntas",
        "start": 3278.28,
        "end": 3281.28
    },
    {
        "text": " miren eso es el nombre justifica un poco el nombre de descomposición del que se llama teorema espectral",
        "start": 3281.28,
        "end": 3287.28
    },
    {
        "text": " porque eso es directamente el teorema espectral",
        "start": 3287.28,
        "end": 3291.28
    },
    {
        "text": " fíjense lo siguiente",
        "start": 3291.28,
        "end": 3296.28
    },
    {
        "text": " si yo escribo eso de manera compacta",
        "start": 3296.28,
        "end": 3301.28
    },
    {
        "text": " para evitar es para para compactar esta notación",
        "start": 3301.28,
        "end": 3306.28
    },
    {
        "text": " de manera compacta yo lo puedo escribir así",
        "start": 3306.28,
        "end": 3315.28
    },
    {
        "text": " te lo puedes escribir como una suma de los siguientes operadores de unos hasta acá",
        "start": 3315.28,
        "end": 3323.28
    },
    {
        "text": " de los operadores que son multiplicados por el escalar lambda y",
        "start": 3323.28,
        "end": 3327.28
    },
    {
        "text": " y multiplicar por la lambda y por la proyección autobonal sobre lambda y",
        "start": 3327.28,
        "end": 3333.28
    },
    {
        "text": " esta es la manera compacta de escribir la descomposición espectral",
        "start": 3333.28,
        "end": 3339.28
    },
    {
        "text": " y fíjense ahora lo que pasa",
        "start": 3339.28,
        "end": 3343.28
    },
    {
        "text": " que cosas tan lindas que se desprenen de ahí",
        "start": 3343.28,
        "end": 3348.28
    },
    {
        "text": " si yo quiero calcular por ejemplo ahora voy a empezar a construirme funciones de",
        "start": 3348.28,
        "end": 3354.28
    },
    {
        "text": " estos operadores líneas, suponemos que yo me quiero calcular el operador al cuadrado",
        "start": 3354.28,
        "end": 3357.28
    },
    {
        "text": " que es componer te consigo mismo, entonces suponemos que yo quiero calcular",
        "start": 3357.28,
        "end": 3364.28
    },
    {
        "text": " calculemos te cuadrado que no otra cosa que la composición de te consigo mismo",
        "start": 3364.28,
        "end": 3370.28
    },
    {
        "text": " no esta la definición elevara una potencia un operador",
        "start": 3370.28,
        "end": 3373.28
    },
    {
        "text": " entonces componer te consigo mismo, vamos a escribir",
        "start": 3373.28,
        "end": 3378.28
    },
    {
        "text": " te como lo tenemos escrito ahí con usados a descomposición",
        "start": 3378.28,
        "end": 3385.28
    },
    {
        "text": " igual desde 1 hasta acá",
        "start": 3385.28,
        "end": 3389.28
    },
    {
        "text": " lambda y p es lambda y",
        "start": 3389.28,
        "end": 3392.28
    },
    {
        "text": " y esto lo tenemos que componer con te que lo vamos a escribir así como la sumatoria",
        "start": 3392.28,
        "end": 3396.28
    },
    {
        "text": " para que no se mezclen los índices, j es de 1 hasta acá, lambda j por p es lambda j",
        "start": 3396.28,
        "end": 3403.28
    },
    {
        "text": " entonces cuando yo desarrollo todo esto me va a quedar la composición de cada uno",
        "start": 3403.28,
        "end": 3418.28
    },
    {
        "text": " estos sumandos en la primera suma con el sumando respectivo de la segunda",
        "start": 3418.28,
        "end": 3423.28
    },
    {
        "text": " y eso me va a dar composición de la forma proyecciones sobre un subespacio",
        "start": 3423.28,
        "end": 3428.28
    },
    {
        "text": " compuestas con proyecciones sobre otro subespacio sobre el mismo subespacio",
        "start": 3428.28,
        "end": 3432.28
    },
    {
        "text": " entonces cuando yo desarrollo todo esto me va a quedar por ejemplo la primer sumando",
        "start": 3432.28,
        "end": 3439.28
    },
    {
        "text": " acá y el primer sumando acá me va a quedar lambda 1 por lambda 1",
        "start": 3439.28,
        "end": 3442.28
    },
    {
        "text": " proyección autobranal de cilanda 1 compuesto con ese lambda proyección sobre cilanda 1",
        "start": 3442.28,
        "end": 3447.28
    },
    {
        "text": " después me va a quedar lambda 1 acá por lambda 2 acá",
        "start": 3447.28,
        "end": 3450.28
    },
    {
        "text": " proyección sobre cilanda 1 proyección por ese lambda 2",
        "start": 3450.28,
        "end": 3453.28
    },
    {
        "text": " entonces fiquen cero siguiente",
        "start": 3453.28,
        "end": 3457.28
    },
    {
        "text": " desarrollando y usando lo siguiente",
        "start": 3459.28,
        "end": 3464.28
    },
    {
        "text": " ¿qué me da?",
        "start": 3464.28,
        "end": 3467.28
    },
    {
        "text": " si yo hago",
        "start": 3467.28,
        "end": 3471.28
    },
    {
        "text": " la composición de la proyección autobona al solo un subespacio cilanda compuesta",
        "start": 3471.28,
        "end": 3477.28
    },
    {
        "text": " consigo misma",
        "start": 3477.28,
        "end": 3480.28
    },
    {
        "text": " yo agarro proyectos sobre ese lambda esto es el lambda",
        "start": 3481.28,
        "end": 3487.28
    },
    {
        "text": " claro yo agarro un vector cualquiera los proyectos sobre cilanda y ya estoy en ese lambda",
        "start": 3487.28,
        "end": 3492.28
    },
    {
        "text": " y luego lo proyecta sobre cilanda eso me va a dar lo mismo",
        "start": 3492.28,
        "end": 3495.28
    },
    {
        "text": " o sea proyectar potencias de proyección a solo un subespacio me da la misma cosa",
        "start": 3495.28,
        "end": 3500.28
    },
    {
        "text": " proyecta sobre cilanda y volver a proyecta sobre cilanda me da lo mismo que proyecta",
        "start": 3500.28,
        "end": 3504.28
    },
    {
        "text": " una única vez",
        "start": 3504.28,
        "end": 3508.28
    },
    {
        "text": " y por otra parte si yo estoy proyectando sobre un ese lambda y acá tengo un ese lambda",
        "start": 3508.28,
        "end": 3515.28
    },
    {
        "text": " tilde distinto y yo considero porque me van a aparecer acá",
        "start": 3515.28,
        "end": 3521.28
    },
    {
        "text": " composiciones de pc lambda con pc lambda el mismo subespacio y también composiciones",
        "start": 3521.28,
        "end": 3527.28
    },
    {
        "text": " de pc lambda con un pc lambda tilde distinto",
        "start": 3527.28,
        "end": 3534.28
    },
    {
        "text": " exactamente como estos son autobonales como estos son autobonales por ser autodajuntos",
        "start": 3534.28,
        "end": 3543.28
    },
    {
        "text": " si yo proyecto primero por ejemplo sobre el lambda sobre el lambda prima no importa",
        "start": 3543.28,
        "end": 3547.28
    },
    {
        "text": " lo orden pensemos que proyecto primero sobre este un vector verlo proyecto",
        "start": 3547.28,
        "end": 3551.28
    },
    {
        "text": " acá y este es autobonala este si esa proyección ahora lo hago sobre esto",
        "start": 3551.28,
        "end": 3555.28
    },
    {
        "text": " me va a quedar necesariamente en el vector nulo",
        "start": 3555.28,
        "end": 3559.28
    },
    {
        "text": " entonces la composición de proyección autobonales sobre diferentes espacios",
        "start": 3559.28,
        "end": 3562.28
    },
    {
        "text": " en un operador autodajuntos esto me da el operador nulo exactamente",
        "start": 3562.28,
        "end": 3568.28
    },
    {
        "text": " bien esto es obviamente cilanda desde distinto de lambda tilde",
        "start": 3568.28,
        "end": 3573.28
    },
    {
        "text": " entonces cuando yo descompongo toda esta suma las que involucren acá proyecciones",
        "start": 3573.28,
        "end": 3577.28
    },
    {
        "text": " sobre espacio distintos todos esos humanos se me van todos",
        "start": 3577.28,
        "end": 3582.28
    },
    {
        "text": " la como se llama esta operación la composición me da el nulo",
        "start": 3582.28,
        "end": 3590.28
    },
    {
        "text": " y yo tengo el mismo acá y el mismo segundo acá el mismo que tiene una única vez",
        "start": 3590.28,
        "end": 3595.28
    },
    {
        "text": " porque estoy proyeciendo dos veces sobre el mismo espacio",
        "start": 3595.28,
        "end": 3598.28
    },
    {
        "text": " entonces usando esto me va a quedar",
        "start": 3598.28,
        "end": 3603.28
    },
    {
        "text": " va a quedar que el operador tia cuadrado lo podemos escribir",
        "start": 3603.28,
        "end": 3610.28
    },
    {
        "text": " me va a quedar lambda uno por lambda uno o sea lambda uno el cuadrado",
        "start": 3610.28,
        "end": 3616.28
    },
    {
        "text": " estándar el cuadrado escribamos la proyección autobonada sobre ese lambda uno",
        "start": 3616.28,
        "end": 3622.28
    },
    {
        "text": " lo mismo con lo que corresponde a lambda dos y pesa lambda dos etc",
        "start": 3622.28,
        "end": 3627.28
    },
    {
        "text": " y todos los términos cruzados se me van a ir",
        "start": 3627.28,
        "end": 3629.28
    },
    {
        "text": " o sea que me va a quedar a esto me va a quedar esto",
        "start": 3629.28,
        "end": 3632.28
    },
    {
        "text": " me va a quedar que el operador tia el cuadrado",
        "start": 3632.28,
        "end": 3636.28
    },
    {
        "text": " es también una combinación lineal de las proyecciones solamente que ahora los coeficientes",
        "start": 3636.28,
        "end": 3642.28
    },
    {
        "text": " de la combinación lineal son los valores propios al cuadrado",
        "start": 3642.28,
        "end": 3646.28
    },
    {
        "text": " bien todos las otras cosas cruzadas se van al diablo",
        "start": 3646.28,
        "end": 3652.28
    },
    {
        "text": " y obviamente lo mismo pasa en general yo no calcula la potencia caeci",
        "start": 3652.28,
        "end": 3656.28
    },
    {
        "text": " cuando el operador la potencia era re-europerador",
        "start": 3656.28,
        "end": 3658.28
    },
    {
        "text": " en general si no tiene un operador auto adjunto",
        "start": 3658.28,
        "end": 3664.28
    },
    {
        "text": " tia la r digamos la potencia r me queda a una suma y desde uno hasta cae",
        "start": 3664.28,
        "end": 3672.28
    },
    {
        "text": " los valores propios elevados a la r por las proyecciones",
        "start": 3672.28,
        "end": 3676.28
    },
    {
        "text": " o sea que sé cómo descomponer potencias de t en términos las proyecciones",
        "start": 3676.28,
        "end": 3682.28
    },
    {
        "text": " que eso sale como consecuencia del tore más espectral",
        "start": 3682.28,
        "end": 3686.28
    },
    {
        "text": " o sea una combinación lineal donde ahora lo que estoy cambiando acá son los coeficientes",
        "start": 3686.28,
        "end": 3692.28
    },
    {
        "text": " son los valores propios a la potencia r",
        "start": 3692.28,
        "end": 3695.28
    },
    {
        "text": " el mismo ordenamiento que antes",
        "start": 3695.28,
        "end": 3697.28
    },
    {
        "text": " entonces la descomposión original de t involucra los valores propios",
        "start": 3697.28,
        "end": 3702.28
    },
    {
        "text": " si llego t cuadrado tengo que poner la misma combinación",
        "start": 3702.28,
        "end": 3705.28
    },
    {
        "text": " pero con los valores propios al cuadrado si llego t a la r tengo que poner la misma combinación",
        "start": 3705.28,
        "end": 3710.28
    },
    {
        "text": " y lo mismo se puede ver si llego a un polidónio cualquiera",
        "start": 3710.28,
        "end": 3713.28
    },
    {
        "text": " si llego a la potencia r me queda a una función polinómica de la andaí",
        "start": 3713.28,
        "end": 3720.28
    },
    {
        "text": " si llego a una función polinómica de la andaí acá",
        "start": 3720.28,
        "end": 3724.28
    },
    {
        "text": " si se construye la función polinómica de la operadora orte",
        "start": 3724.28,
        "end": 3728.28
    },
    {
        "text": " ahí vendrían las funciones polinómicas de los valores propios acá en la combinación lineal",
        "start": 3728.28,
        "end": 3733.28
    },
    {
        "text": " si tomás con el hidratomado de un vector que ya es el que está en el espacio",
        "start": 3734.28,
        "end": 3740.28
    },
    {
        "text": " si",
        "start": 3740.28,
        "end": 3741.28
    },
    {
        "text": " si la presentación nosotros no te te den de algunos",
        "start": 3741.28,
        "end": 3745.28
    },
    {
        "text": " si si es autodajunto si",
        "start": 3745.28,
        "end": 3747.28
    },
    {
        "text": " si si si si si por supuesto si es lo que estoy diciendo acá",
        "start": 3747.28,
        "end": 3754.28
    },
    {
        "text": " si yo proyecto solo un sub espacio",
        "start": 3754.28,
        "end": 3756.28
    },
    {
        "text": " no no no no lo que pasa que esta descomposición es valida para todo venctor B",
        "start": 3756.28,
        "end": 3762.28
    },
    {
        "text": " esta es una descomposición esta descomposición es para cualquier vector B",
        "start": 3762.28,
        "end": 3766.28
    },
    {
        "text": " si boca arrasa un vector que esté en un sub espacio propio",
        "start": 3766.28,
        "end": 3769.28
    },
    {
        "text": " por ejemplo en el ámbito de 1 me va a quedar solamente esta parte y todo el resto se me va a ir",
        "start": 3769.28,
        "end": 3774.28
    },
    {
        "text": " si",
        "start": 3774.28,
        "end": 3776.28
    },
    {
        "text": " son todos hortocos no vale si",
        "start": 3784.28,
        "end": 3786.28
    },
    {
        "text": " esta descomposición vale para vos estás agarrando el vector es particular",
        "start": 3786.28,
        "end": 3790.28
    },
    {
        "text": " lo que está aplicando teme para eso",
        "start": 3790.28,
        "end": 3792.28
    },
    {
        "text": " esta descomposición es esto es una igualdad entre operadores",
        "start": 3792.28,
        "end": 3795.28
    },
    {
        "text": " si vos ahora me das un vector que esté en ese ámbito de 1",
        "start": 3795.28,
        "end": 3800.28
    },
    {
        "text": " esto me va a dar ese vector y todo lo otro se me va a ir",
        "start": 3800.28,
        "end": 3803.28
    },
    {
        "text": " pero en el punto de todo esto no va a parecer a otro",
        "start": 3803.28,
        "end": 3806.28
    },
    {
        "text": " no no no no no no no lo que yo estoy diciendo es que esto suma directo",
        "start": 3806.28,
        "end": 3813.28
    },
    {
        "text": " yo estoy diciendo que ve suma directo a esto más esto",
        "start": 3813.28,
        "end": 3816.28
    },
    {
        "text": " a puede un vector que sea la suma de algo a cámara la suma de algo aca",
        "start": 3817.28,
        "end": 3821.28
    },
    {
        "text": " entonces solamente me va a quedar los humanos correspondientes",
        "start": 3821.28,
        "end": 3825.28
    },
    {
        "text": " estamos",
        "start": 3825.28,
        "end": 3826.28
    },
    {
        "text": " estoy exactamente",
        "start": 3826.28,
        "end": 3828.28
    },
    {
        "text": " es una igualdad de operadores",
        "start": 3828.28,
        "end": 3830.28
    },
    {
        "text": " y en general para concluir con esto si usted me da una función real cualquiera",
        "start": 3830.28,
        "end": 3836.28
    },
    {
        "text": " está una función real",
        "start": 3836.28,
        "end": 3838.28
    },
    {
        "text": " bien definido pensemos una función real de fíjese sobre todo",
        "start": 3847.28,
        "end": 3852.28
    },
    {
        "text": " da una función",
        "start": 3852.28,
        "end": 3853.28
    },
    {
        "text": " de los reales en los reales podemos definir lo siguiente",
        "start": 3853.28,
        "end": 3859.28
    },
    {
        "text": " del finismo en el caso que yo tengo un operador auto al junto y por lo tanto tengo una descomposición de este tipo",
        "start": 3864.28,
        "end": 3869.28
    },
    {
        "text": " yo puede definir la función aplicada t",
        "start": 3869.28,
        "end": 3873.28
    },
    {
        "text": " eso por definición va a ser un nuevo operador",
        "start": 3874.28,
        "end": 3878.28
    },
    {
        "text": " ahora a las funciones hasta que está definido sobre reales con esa función de fíjese",
        "start": 3878.28,
        "end": 3882.28
    },
    {
        "text": " ahora los funciones sobre operadores",
        "start": 3882.28,
        "end": 3884.28
    },
    {
        "text": " esa función me agarra un operador y que me hace",
        "start": 3884.28,
        "end": 3887.28
    },
    {
        "text": " yo acá tengo el auto al junto, tengo la descomposición aca",
        "start": 3887.28,
        "end": 3890.28
    },
    {
        "text": " lo que hago es hago la combinación de las proyecciones",
        "start": 3890.28,
        "end": 3894.28
    },
    {
        "text": " y los elementos que pongo acá es la función real aplicados a la onda ahí",
        "start": 3894.28,
        "end": 3898.28
    },
    {
        "text": " con esto podemos construir funciones aplicadas operadores",
        "start": 3899.28,
        "end": 3904.28
    },
    {
        "text": " la primera manera que acá tenemos la función t al cuadrado",
        "start": 3904.28,
        "end": 3907.28
    },
    {
        "text": " aquí al cuadrado aplicadas un operador acá tenemos la xr",
        "start": 3907.28,
        "end": 3910.28
    },
    {
        "text": " yo puedo agarrar cualquier función real y construir y definir la función aplicado un operador",
        "start": 3910.28,
        "end": 3917.28
    },
    {
        "text": " la siguiente manera hago la combinación lineal de las proyecciones",
        "start": 3917.28,
        "end": 3920.28
    },
    {
        "text": " y acá multiplico por la f aplicado los valores propios",
        "start": 3920.28,
        "end": 3923.28
    },
    {
        "text": " esto es ojo no confundir esta f con esta f real y esta la definición de f aplicado un operador",
        "start": 3924.28,
        "end": 3934.28
    },
    {
        "text": " esto lo que quiere decir esta es una función que me agarra",
        "start": 3934.28,
        "end": 3937.28
    },
    {
        "text": " operadores auto al juntos y me da otro operador auto al junto con ya descomposición",
        "start": 3937.28,
        "end": 3942.28
    },
    {
        "text": " es esto",
        "start": 3942.28,
        "end": 3943.28
    },
    {
        "text": " es una transformación de operador auto al juntos y no operador auto al junto",
        "start": 3943.28,
        "end": 3947.28
    },
    {
        "text": " en fin todas esas cosas son sumamente útiles",
        "start": 3947.28,
        "end": 3951.28
    },
    {
        "text": " no sé cómo andamos de hora",
        "start": 3951.28,
        "end": 3954.28
    },
    {
        "text": " a ver si queda tiempo para",
        "start": 3954.28,
        "end": 3958.28
    },
    {
        "text": " si da el tiempo",
        "start": 3958.28,
        "end": 3960.28
    },
    {
        "text": " claro porque fíjate que",
        "start": 3960.28,
        "end": 3966.28
    },
    {
        "text": " fíjate que la está descomponiendo",
        "start": 3966.28,
        "end": 3969.28
    },
    {
        "text": " exactamente, estos son numeritos multiplicados por las proyecciones",
        "start": 3969.28,
        "end": 3973.28
    },
    {
        "text": " y construir un nuevo operador auto al junto",
        "start": 3973.28,
        "end": 3976.28
    },
    {
        "text": " que es este",
        "start": 3976.28,
        "end": 3979.28
    },
    {
        "text": " combinación lineal de la proyección",
        "start": 3979.28,
        "end": 3982.28
    },
    {
        "text": " no combinación lineal de las proyecciones ortobonares",
        "start": 3982.28,
        "end": 3986.28
    },
    {
        "text": " multiplicadas por toco ficiante",
        "start": 3986.28,
        "end": 3989.28
    },
    {
        "text": " se te van noslando",
        "start": 3989.28,
        "end": 3991.28
    },
    {
        "text": " es aclamado",
        "start": 3991.28,
        "end": 3993.28
    },
    {
        "text": " si acaso",
        "start": 3993.28,
        "end": 3997.28
    },
    {
        "text": " que si acá estamos trabajando en el contexto de auto al juntos",
        "start": 3997.28,
        "end": 4002.28
    },
    {
        "text": " de estas cosas son todas reales",
        "start": 4002.28,
        "end": 4006.28
    },
    {
        "text": " bueno muy bien",
        "start": 4008.28,
        "end": 4010.28
    },
    {
        "text": " a ver",
        "start": 4010.28,
        "end": 4012.28
    },
    {
        "text": " vamos a hacer rápido el ejemplo",
        "start": 4012.28,
        "end": 4016.28
    },
    {
        "text": " rápido, rápido",
        "start": 4016.28,
        "end": 4018.28
    },
    {
        "text": " faltan en 2 minutos, en 10 o 5 minutos lo tenemos que hacer",
        "start": 4018.28,
        "end": 4022.28
    },
    {
        "text": " vemos un operador auto al junto de inicio infinita",
        "start": 4022.28,
        "end": 4025.28
    },
    {
        "text": " infinita que no tiene valores propios",
        "start": 4025.28,
        "end": 4027.28
    },
    {
        "text": " estos están las notas",
        "start": 4027.28,
        "end": 4029.28
    },
    {
        "text": " este comentario",
        "start": 4029.28,
        "end": 4032.28
    },
    {
        "text": " que justifica un poco el teore más espectro",
        "start": 4035.28,
        "end": 4039.28
    },
    {
        "text": " le importa si el teore más espectro",
        "start": 4039.28,
        "end": 4041.28
    },
    {
        "text": " a ver",
        "start": 4041.28,
        "end": 4044.28
    },
    {
        "text": " ejemplo pero auto al junto",
        "start": 4044.28,
        "end": 4047.28
    },
    {
        "text": " en inicio infinita que no tiene valores propios",
        "start": 4047.28,
        "end": 4050.28
    },
    {
        "text": " se acuerdan que todo lo que probamos",
        "start": 4050.28,
        "end": 4053.28
    },
    {
        "text": " o varios de todo lo que probamos",
        "start": 4053.28,
        "end": 4055.28
    },
    {
        "text": " son en inicio infinita",
        "start": 4055.28,
        "end": 4057.28
    },
    {
        "text": " esto es un ejemplo de un operador auto al junto",
        "start": 4057.28,
        "end": 4061.28
    },
    {
        "text": " auto al junto",
        "start": 4061.28,
        "end": 4065.28
    },
    {
        "text": " en inicio infinita",
        "start": 4065.28,
        "end": 4069.28
    },
    {
        "text": " que no tiene valores propios",
        "start": 4069.28,
        "end": 4075.28
    },
    {
        "text": " colocó a la casa de los cadetores de la estantería",
        "start": 4075.28,
        "end": 4079.28
    },
    {
        "text": " con uno quiere pasar las cosas de inicio infinita",
        "start": 4079.28,
        "end": 4083.28
    },
    {
        "text": " hay que pedir más condiciones para que los resultados que escribimos",
        "start": 4083.28,
        "end": 4087.28
    },
    {
        "text": " tengan alguna valida y hay que entender que significa",
        "start": 4087.28,
        "end": 4091.28
    },
    {
        "text": " tener una base en inicio infinita",
        "start": 4091.28,
        "end": 4093.28
    },
    {
        "text": " hacer las composiciones en términos de base",
        "start": 4093.28,
        "end": 4095.28
    },
    {
        "text": " hay que hacer las cosas con más cuidado",
        "start": 4095.28,
        "end": 4097.280000000001
    },
    {
        "text": " o pero auto al junto de inicio infinita que no tiene valores propios",
        "start": 4097.280000000001,
        "end": 4101.280000000001
    },
    {
        "text": " y hay que hacer las cosas con más cuidado",
        "start": 4101.280000000001,
        "end": 4105.280000000001
    },
    {
        "text": " hay que hacer las cosas con más cuidado",
        "start": 4105.28,
        "end": 4109.28
    },
    {
        "text": " el nivel de inicio infinita siempre hay al menos un valor propio",
        "start": 4109.28,
        "end": 4113.28
    },
    {
        "text": " el nivel de inicio infinita puede ser que no haya ninguno",
        "start": 4113.28,
        "end": 4117.28
    },
    {
        "text": " el ejemplo es el siguiente, uno considera",
        "start": 4117.28,
        "end": 4121.28
    },
    {
        "text": " el ejemplo que está en las notas como espacio vectorial",
        "start": 4121.28,
        "end": 4125.28
    },
    {
        "text": " consideramos las funciones continuas",
        "start": 4125.28,
        "end": 4127.28
    },
    {
        "text": " que están van de un intervalo a ver",
        "start": 4127.28,
        "end": 4131.28
    },
    {
        "text": " real en los complejos",
        "start": 4131.28,
        "end": 4133.28
    },
    {
        "text": " que van del intervalo a ver a los complejos",
        "start": 4133.28,
        "end": 4137.28
    },
    {
        "text": " y con F continuos",
        "start": 4137.28,
        "end": 4141.28
    },
    {
        "text": " bien, el intervalo a ver está en los reales",
        "start": 4141.28,
        "end": 4145.28
    },
    {
        "text": " es agarro una función que va a desintervalo los complejos",
        "start": 4145.28,
        "end": 4149.28
    },
    {
        "text": " continua y con eso me construyo este espacio vectorial",
        "start": 4149.28,
        "end": 4153.28
    },
    {
        "text": " que obviamente es un espacio vectorial",
        "start": 4153.28,
        "end": 4155.28
    },
    {
        "text": " y el cuerpo que estamos usando es el cuerpo de los complejos",
        "start": 4155.28,
        "end": 4159.28
    },
    {
        "text": " entonces el producto interno es el producto interno usual",
        "start": 4159.28,
        "end": 4163.28
    },
    {
        "text": " que uno usa este contexto",
        "start": 4163.28,
        "end": 4167.28
    },
    {
        "text": " que es agarrar dos funciones",
        "start": 4167.28,
        "end": 4175.28
    },
    {
        "text": " y hacerla continuas y hacerla siguiente integral",
        "start": 4175.28,
        "end": 4179.28
    },
    {
        "text": " entre a y b de F de x por la conjugada de g de x",
        "start": 4179.28,
        "end": 4183.28
    },
    {
        "text": " de x no porque la imagen de g está en los complejos",
        "start": 4183.28,
        "end": 4187.28
    },
    {
        "text": " y entonces hay un multiplico F de x por la conjugada de g",
        "start": 4187.28,
        "end": 4191.28
    },
    {
        "text": " y eso es un producto interno",
        "start": 4191.28,
        "end": 4193.28
    },
    {
        "text": " bien, esto está definido",
        "start": 4193.28,
        "end": 4197.28
    },
    {
        "text": " para todo F y g en el funciones de mi espacio de y como operador lineal",
        "start": 4197.28,
        "end": 4203.28
    },
    {
        "text": " vamos a los siguientes",
        "start": 4203.28,
        "end": 4207.28
    },
    {
        "text": " como operador lineal",
        "start": 4207.28,
        "end": 4211.28
    },
    {
        "text": " este espacio funciones me agarrara una función y me da una nueva función",
        "start": 4217.28,
        "end": 4221.28
    },
    {
        "text": " y esta definido la siguiente manera",
        "start": 4221.28,
        "end": 4225.28
    },
    {
        "text": " el operador te aplicó una función F",
        "start": 4225.28,
        "end": 4231.28
    },
    {
        "text": " que se ha continuo a sobre ese intervalo a ver",
        "start": 4231.28,
        "end": 4235.28
    },
    {
        "text": " va a ser una nueva función",
        "start": 4235.28,
        "end": 4238.28
    },
    {
        "text": " tal que nx",
        "start": 4238.28,
        "end": 4241.28
    },
    {
        "text": " el valor que toma es x por el valor de la función nx",
        "start": 4241.28,
        "end": 4245.28
    },
    {
        "text": " esto es para todo x nx",
        "start": 4245.28,
        "end": 4249.28
    },
    {
        "text": " o sea",
        "start": 4249.28,
        "end": 4251.28
    },
    {
        "text": " lo que me hace este operador me agarrara una función cualquiera",
        "start": 4251.28,
        "end": 4255.28
    },
    {
        "text": " y esa función me la multiplica por x",
        "start": 4255.28,
        "end": 4257.28
    },
    {
        "text": " entonces la función F aplica de x será x por la función nx",
        "start": 4257.28,
        "end": 4261.28
    },
    {
        "text": " eso es una función continua que está en este espacio",
        "start": 4261.28,
        "end": 4267.28
    },
    {
        "text": " entonces claramente esto es un operador lineal",
        "start": 4267.28,
        "end": 4271.28
    },
    {
        "text": " en F, en F lineal",
        "start": 4271.28,
        "end": 4275.28
    },
    {
        "text": " y lo que se cumple es lo siguiente",
        "start": 4275.28,
        "end": 4279.28
    },
    {
        "text": " vamos a ver qué autoadjunto",
        "start": 4279.28,
        "end": 4283.28
    },
    {
        "text": " estamos en un espacio de mención infinita y pero observamos lo siguiente",
        "start": 4283.28,
        "end": 4287.28
    },
    {
        "text": " si yo agarrara el producto interno de f con g",
        "start": 4287.28,
        "end": 4291.28
    },
    {
        "text": " es decir agarrara dos funciones",
        "start": 4291.28,
        "end": 4295.28
    },
    {
        "text": " F e g y a la f le aplico t",
        "start": 4295.28,
        "end": 4299.28
    },
    {
        "text": " aunque me da la integral de esta función",
        "start": 4299.28,
        "end": 4302.28
    },
    {
        "text": " E vale una nx que es lo que tengo acá",
        "start": 4302.28,
        "end": 4304.28
    },
    {
        "text": " es una integral de x por F e x",
        "start": 4304.28,
        "end": 4309.28
    },
    {
        "text": " ese esto que tengo acá",
        "start": 4309.28,
        "end": 4311.28
    },
    {
        "text": " multiplicada por g de x con jugada",
        "start": 4311.28,
        "end": 4315.28
    },
    {
        "text": " esa es el producto interno de esta nueva función con g",
        "start": 4315.28,
        "end": 4323.28
    },
    {
        "text": " y ahora como x es real porque aquí está en el intervalo a b",
        "start": 4323.28,
        "end": 4329.28
    },
    {
        "text": " esta x la podemos agrupar con este abajo del conjugado",
        "start": 4329.28,
        "end": 4332.28
    },
    {
        "text": " o sea que esto es lo mismo que a b f de x",
        "start": 4332.28,
        "end": 4337.28
    },
    {
        "text": " x de x con jugado",
        "start": 4337.28,
        "end": 4341.28
    },
    {
        "text": " interna donde hay x",
        "start": 4341.28,
        "end": 4344.28
    },
    {
        "text": " esto es porque insisto x está en a b",
        "start": 4344.28,
        "end": 4349.28
    },
    {
        "text": " bien y esto que es",
        "start": 4350.28,
        "end": 4355.28
    },
    {
        "text": " es el producto interno de la función f con esta otra función",
        "start": 4355.28,
        "end": 4361.28
    },
    {
        "text": " x de x",
        "start": 4361.28,
        "end": 4363.28
    },
    {
        "text": " puede estar otra función, otra cosa que t aplicado a g",
        "start": 4363.28,
        "end": 4367.28
    },
    {
        "text": " esto es la integral de f, el producto interno de f con la función",
        "start": 4370.28,
        "end": 4375.28
    },
    {
        "text": " t aplicada g que es x por g de x",
        "start": 4375.28,
        "end": 4378.28
    },
    {
        "text": " y esa que en definitiva estamos obligando que t de f",
        "start": 4378.28,
        "end": 4381.28
    },
    {
        "text": " producto interno con g es lo mismo que f con t de g",
        "start": 4381.28,
        "end": 4384.28
    },
    {
        "text": " para todas funciones f g por lo tanto",
        "start": 4384.28,
        "end": 4385.28
    },
    {
        "text": " para todas f g en el espacio vectorial",
        "start": 4385.28,
        "end": 4393.28
    },
    {
        "text": " por lo tanto t es autoadjunto",
        "start": 4393.28,
        "end": 4396.28
    },
    {
        "text": " o sea que efectivamente autoadjunto",
        "start": 4396.28,
        "end": 4400.28
    },
    {
        "text": " efectivamente tenemos aquí",
        "start": 4400.28,
        "end": 4402.28
    },
    {
        "text": " un operador autoadjunto definido sobre este espacio",
        "start": 4402.28,
        "end": 4406.28
    },
    {
        "text": " vectorial de dimensión infinita que además tiene este producto interno",
        "start": 4406.28,
        "end": 4413.28
    },
    {
        "text": " y lo que hay que ver es que ese operador autoadjunto no tiene valores propios",
        "start": 4413.28,
        "end": 4419.28
    },
    {
        "text": " y la prueba es muy sencilla es probar que tiene un valor propio y llega una contradicción",
        "start": 4419.28,
        "end": 4424.28
    },
    {
        "text": " es una línea lo que falta",
        "start": 4424.28,
        "end": 4426.28
    },
    {
        "text": " entonces veamos que t no tiene valores propios",
        "start": 4426.28,
        "end": 4430.28
    },
    {
        "text": " no, mira, mira lo que queda",
        "start": 4436.28,
        "end": 4441.28
    },
    {
        "text": " mira lo que queda, queda mucho más fácil que eso",
        "start": 4441.28,
        "end": 4445.28
    },
    {
        "text": " mira lo que queda, veamos que t no tiene valores propios",
        "start": 4445.28,
        "end": 4451.28
    },
    {
        "text": " que no tiene valores propios",
        "start": 4451.28,
        "end": 4454.28
    },
    {
        "text": " bueno, sabemos que si t es autoadjunto o sea va a le generar",
        "start": 4454.28,
        "end": 4462.28
    },
    {
        "text": " si hay un valor propio o el propio es real",
        "start": 4462.28,
        "end": 4464.28
    },
    {
        "text": " eso lo sabemos, si hay un valor propio es real",
        "start": 4464.28,
        "end": 4467.28
    },
    {
        "text": " entonces supongamos que hay uno",
        "start": 4467.28,
        "end": 4469.28
    },
    {
        "text": " si supongamos que hay un real que es valor propio",
        "start": 4469.28,
        "end": 4472.28
    },
    {
        "text": " veamos que t no tiene valores propios",
        "start": 4472.28,
        "end": 4474.28
    },
    {
        "text": " entonces supongamos por el absurdo",
        "start": 4474.28,
        "end": 4477.28
    },
    {
        "text": " estoy tratando de ir rápido para terminar de tiempo",
        "start": 4477.28,
        "end": 4479.28
    },
    {
        "text": " supongamos que existe el andasero real que es valor propio de té",
        "start": 4479.28,
        "end": 4486.28
    },
    {
        "text": " insisto, si t es autoadjunto vimos que lo valor propio, si es un valor propio de un autoadjunto es real",
        "start": 4486.28,
        "end": 4496.28
    },
    {
        "text": " entonces supongamos que tengo un valor propio de té que tiene ese número real",
        "start": 4496.28,
        "end": 4501.28
    },
    {
        "text": " entonces esto significa que existe una función f0, distinto de 0, distinto de la función nula",
        "start": 4501.28,
        "end": 4509.28
    },
    {
        "text": " tal que te aplicado esa f me da la andasero por f0",
        "start": 4509.28,
        "end": 4517.28
    },
    {
        "text": " te aplicas f0 me da la andasero por f0, es decir supongamos que existe un valor propio, la andasero",
        "start": 4517.28,
        "end": 4523.28
    },
    {
        "text": " si lo mismo que es decir que existe una función distinto de 0, es f0, tal que te aplicado f0 me da la andasero por f0",
        "start": 4523.28,
        "end": 4531.28
    },
    {
        "text": " estamos, ahora esta es una igualdad de funciones",
        "start": 4531.28,
        "end": 4535.28
    },
    {
        "text": " eso significa que para todo x se tiene que cumplir que t en f0 aplicado a x tiene que ser igual al andasero por f0 aplicado a x",
        "start": 4535.28,
        "end": 4548.28
    },
    {
        "text": " andasero es un número esto es para todo x en a b",
        "start": 4548.28,
        "end": 4559.28
    },
    {
        "text": " y por otra parte te aplicado f0 en x acá lo tenemos, te aplicado en f es multiplicar por x es x por f0 en x",
        "start": 4560.28,
        "end": 4569.28
    },
    {
        "text": " esto acá es x por f0 en x o sea que si hubiera una función f0 que jugas el papel de vector propios o sea la andasero",
        "start": 4569.28,
        "end": 4580.28
    },
    {
        "text": " se debería cumplir esta igualdad funcional para todo x eso implicaría entonces",
        "start": 4580.28,
        "end": 4587.28
    },
    {
        "text": " eso implicaría entonces agrupando las cosas que x menos lambda 0 por f0 de x debería ser igual para todo x y",
        "start": 4587.28,
        "end": 4600.28
    },
    {
        "text": " igual a 0 para todo x y 9",
        "start": 4600.28,
        "end": 4607.28
    },
    {
        "text": " lambda 0 es un numerito fijo que podrás traer en a b o no pero en el primero de los casos si estuviera",
        "start": 4607.28,
        "end": 4614.28
    },
    {
        "text": " habría una x solamente una x en lo cual esto me da 0 que es cuando la x vale lambda 0",
        "start": 4614.28,
        "end": 4620.28
    },
    {
        "text": " entonces cualquier x que sea distinto de lambda 0 esto me da distinto de lambda 0 y esto me tiene que dar 0",
        "start": 4620.28,
        "end": 4626.28
    },
    {
        "text": " para que se compre en la igualdad entonces ahí sacamos que f0 de x es igual a 0 para todo x distinto de lambda 0",
        "start": 4626.28,
        "end": 4638.28
    },
    {
        "text": " entonces tengo una función que o es 0 o es 0 en todas partes menos en lambda 0 que no se cuantó vale",
        "start": 4641.28,
        "end": 4647.28
    },
    {
        "text": " pero por continuidad porque estamos trabajando en un espacio funcionales continuas en lambda 0 si estuviera dentro de lo",
        "start": 4647.28,
        "end": 4654.28
    },
    {
        "text": " y lo mismo también de que vale a 0 entonces por continuidad por continuidad sacamos que f0 de x tiene que",
        "start": 4654.28,
        "end": 4666.28
    },
    {
        "text": " ser igual a 0 para todo x y 9 que es el dominio donde estamos trabajando y por lo tanto f0 necesariamente",
        "start": 4666.28,
        "end": 4675.28
    },
    {
        "text": " que ser la función nula y ahí es un absurdo porque si es un vector propio tiene que ser arrancamos",
        "start": 4675.28,
        "end": 4684.28
    },
    {
        "text": " suponiendo que f0 de distinto de la función nula y trabajando esto llegamos que f0 tiene que ser la función nula y",
        "start": 4684.28,
        "end": 4690.28
    },
    {
        "text": " esto es entonces un absurdo que sale de suponer que existe un vector propio asociado lambda 0 por lo tanto",
        "start": 4690.28,
        "end": 4701.28
    },
    {
        "text": " es un operador en un espacio de mención infinito un operador total junto que no tiene valores propios pero",
        "start": 4701.28,
        "end": 4707.28
    },
    {
        "text": " no me quedé esta última parte rápida pero quería terminar a tiempo si una pregunta",
        "start": 4707.28,
        "end": 4712.28
    },
    {
        "text": " no porque la estoy evaluando en x claro f0 de f aplicada a un x es por definición x por fdx",
        "start": 4718.28,
        "end": 4726.28
    },
    {
        "text": " no no no no no no no no no no no éstas éstas una función tdf es una función cuantos vale tf aplicado a x x por fdx",
        "start": 4726.28,
        "end": 4738.28
    },
    {
        "text": " es la definición es alta no no no no no no es la función antiguo barana",
        "start": 4738.28,
        "end": 4746.28
    }
]