[
    {
        "text": " Muy buenas noches, hoy vamos a terminar la parte de los determinantes antes de empezar con la parte geometría.",
        "start": 0.0,
        "end": 27.0
    },
    {
        "text": " Ok, la vez pasada vimos un montón de propiedades del determinante, varios métodos para calcularlo, determinantes de matricias, triangulares, vimos como se podría intercambiar columnas, a ser combinaciones inéales, etcétera, etcétera.",
        "start": 27.0,
        "end": 47.0
    },
    {
        "text": " Y también vimos el caso de determinantes nulos, hoy vamos a terminar con el problema del determinante de un producto.",
        "start": 47.0,
        "end": 58.0
    },
    {
        "text": " Entonces, acá hay que recordar una cosa importante, recordatorio, recordatorio es que en general el determinante de Amas B es distinto del determinante de Amas, el determinante de B.",
        "start": 58.0,
        "end": 81.0
    },
    {
        "text": " El general salvo si n es igual a 1 por supuesto, ok, es decir el determinante de Asuma, sabemos que en general no tiene nada que ver con las sumas de los determinantes.",
        "start": 81.0,
        "end": 95.0
    },
    {
        "text": " Y también vimos que el determinante de Lambda por A es igual a Lambda a la N y a la N es importante por el determinante A.",
        "start": 95.0,
        "end": 107.0
    },
    {
        "text": " Ok, ahora el teorema que queremos demostrar es, lo que queremos hacer es relacionar el determinante con el producto de matricias y el teorema que queremos demostrar es ser siguiente, teorema, de Binecochi,",
        "start": 107.0,
        "end": 127.0
    },
    {
        "text": " queriese lo siguiente que es super sencillo, para todas matricias cuadradas tenemos que el determinante del producto de matricias y es igual el producto de los determinantes.",
        "start": 127.0,
        "end": 148.0
    },
    {
        "text": " Y acá esto es un producto de matricias que es una cosa que sabemos que es complicada para calcular y acá solo es un producto de números, nada más.",
        "start": 148.0,
        "end": 160.0
    },
    {
        "text": " Ok, entonces es lo que quiero demostrar ahora para terminar esta parte. Ok, este por supuesto no es un resultado fácil, sabemos que el determinante tiene una definición muy complicada por inducción sobre N.",
        "start": 160.0,
        "end": 181.0
    },
    {
        "text": " Y también vimos que el producto no tiene una definición trillal, entonces no se puede esperar que por alguna magia negra vamos a conseguir demostrar directamente el resultado.",
        "start": 181.0,
        "end": 195.0
    },
    {
        "text": " Lo que vamos a hacer es que vamos a demostrar el resultado paso a paso, es decir, con hipotecis intermedia sobre A y B y con hipotecis más y más generales. Ok, entonces voy a usar cuatro problemas, primero el lema,",
        "start": 195.0,
        "end": 215.0
    },
    {
        "text": " ya sabéis lo que es un lema, un lema es un resultado preliminar, en general es un resultado que demuestra una parte del diorema que queremos demostrar, es decir, lo voy a hacer paso a paso.",
        "start": 216.0,
        "end": 232.0
    },
    {
        "text": " Y primero el lema dice lo siguiente es que si es un matriz elemental, entonces el determinante de A y compre la formula para toda la matriz B.",
        "start": 232.0,
        "end": 259.0
    },
    {
        "text": " Cuadrada por supuesto y de mismo tamaño. Ok, es decir, el lema dice el teoreman pero solo en un caso particular, en el caso particular donde A es un matriz elemental.",
        "start": 263.0,
        "end": 279.0
    },
    {
        "text": " Ok, es decir, voy a empezar con una demostración del teorema en caso superparticular el caso donde mi matriz A es elemental. Ok, demostración.",
        "start": 279.0,
        "end": 293.0
    },
    {
        "text": " ¿Qué vamos a hacer? Hay muchas matrices elementales o no? Sí, pero cuantos tipos de matrices elementales, 3 tipos, entonces vamos a distinguir los 3 tipos, 3 casos.",
        "start": 294.0,
        "end": 312.0
    },
    {
        "text": " El primer caso es caso 1, es por ejemplo intercambio. Supongo que A es igual a la matriz elemental que me intercambia 2 filas. Ok.",
        "start": 313.0,
        "end": 334.0
    },
    {
        "text": " Y esto nos podemos recordar que esta matriz, esta matriz, es aplicar la transformación de la elemental correspondiente a la identidad.",
        "start": 334.0,
        "end": 353.0
    },
    {
        "text": " Entonces, la transformación intercambiar ambas filas aplicada a la matriz identidad. Ok.",
        "start": 353.0,
        "end": 362.0
    },
    {
        "text": " El primer caso, que se pueden decir sobre su determinante. Exactamente, el determinante de A es igual a que, el determinante de I y acá cambia el signo. Ok.",
        "start": 363.0,
        "end": 383.0
    },
    {
        "text": " Entonces, es menos 1, es menos el determinante de I, es decir, es menos 1. Ok. Pero ¿qué podemos decir ahora sobre la matriz A B? A B es la matriz elemental.",
        "start": 383.0,
        "end": 402.0
    },
    {
        "text": " J y que intercambia y J multiplica A por B. Pero ¿qué significa? Multiplicar B por una matriz elemental. Significa aplicar la transformación elemental correspondiente.",
        "start": 403.0,
        "end": 416.0
    },
    {
        "text": " Entonces, su determinante es el determinante de A B, es igual a que, el determinante de B con un cambio de signo.",
        "start": 416.0,
        "end": 439.0
    },
    {
        "text": " Ok. En este caso particular, solo consideramos este caso particular. Luego, que se deduce, el determinante de A B es igual al determinante de A por el determinante de B.",
        "start": 439.0,
        "end": 467.0
    },
    {
        "text": " Es igual a menos 1 por el determinante de B, es decir, el determinante de A por el determinante de B. La formula se cumple en este caso particular. Ok. Ahora, tenemos que tratar los otros dos casos y son muy similares.",
        "start": 467.0,
        "end": 488.0
    },
    {
        "text": " Segundo caso, caso número 2, caso donde A es la matriz E, multiplicar la fila, el tema de la fila elemental asociada a la operación elemental, multiplicar la fila E por un número alpha.",
        "start": 488.0,
        "end": 516.0
    },
    {
        "text": " Con alpha distinto de Cero para preservar a los detitos. Ok.",
        "start": 516.0,
        "end": 524.0
    },
    {
        "text": " Ahora, para los sabimos que estaba triste, aplicar la misma transformación elemental a la matriz identidad. Entonces, que se puede decir sobre el determinante, ¿qué es el determinante de A?",
        "start": 524.0,
        "end": 544.0
    },
    {
        "text": " ¿Qué pasa si yo multiplico la fila E por alpha, que va a pasar con el determinante? Se va a multiplicar por alpha. Entonces, será alpha por el determinante de la identidad. Es decir, alpha. Ahora, de mismo modo, la matriz A B es esta transformación elemental multiplicada por B. Es decir, es su mismo que aplicar la transformación elemental.",
        "start": 544.0,
        "end": 571.0
    },
    {
        "text": " Multiplicar Y por alpha, aplicar D y transformación elemental a B. Ok. Entonces, el determinante de A B es igual a que el determinante de A, multiplicado por alpha.",
        "start": 571.0,
        "end": 583.0
    },
    {
        "text": " Ok. Luego, tenemos a igual de A a la escena. Tenemos que el determinante de A B es igual a alpha por B, es igual al determinante de A por el determinante de A, porque el determinante de A es alpha.",
        "start": 583.0,
        "end": 607.0
    },
    {
        "text": " Ok. No hay problemas, no es este caso. último caso. A esta transformación, sumarle a la fila E, la fila J multiplicada por alpha. Ok.",
        "start": 607.0,
        "end": 631.0
    },
    {
        "text": " Y esto es lo mismo que aplicar la transformación elemental correspondiente a la matriz identidad. Entonces, se puede determinar el determinante de A, el determinante de A es el determinante de I, es decir, Uno.",
        "start": 631.0,
        "end": 651.0
    },
    {
        "text": " Y no se cambia, ya sabemos que esta transformación elemental no cambia el determinante. Entonces, es el determinante de I a la N, es igual a Uno.",
        "start": 651.0,
        "end": 663.0
    },
    {
        "text": " Además, la matriz A B es igual a la D y transformación elemental y más alpha J multiplicada por B, ok. Porque A es igual a E está.",
        "start": 663.0,
        "end": 679.0
    },
    {
        "text": " Y esta matriz es aplicar la transformación elemental correspondiente a la matriz B. Luego, el determinante de A B es igual a Q, es el mismo que el determinante de B.",
        "start": 679.0,
        "end": 696.0
    },
    {
        "text": " Ok. El determinante de A esto es igual el determinante de B, pero esto es igual al productor del determinante de A por el determinante de B, porque sabemos que esta es igual a Uno.",
        "start": 697.0,
        "end": 710.0
    },
    {
        "text": " Entonces, para concluir, en los tres casos, logramos demostrar que esta cosa era igual a esta cosa.",
        "start": 711.0,
        "end": 722.0
    },
    {
        "text": " Y la razón es muy sencilla, es porque las fórmulas eran super-sencillas, porque este era o bien igual a Uno o bien igual a alpha.",
        "start": 723.0,
        "end": 734.0
    },
    {
        "text": " Y esto nos ha ayudado mucho para demostrar la fórmula del producto.",
        "start": 734.0,
        "end": 740.0
    },
    {
        "text": " Ok. Sí. No hable de nada de inversión ahora. B puede ser cualquiera, es muy importante porque vamos a ver después, ¿por qué?",
        "start": 741.0,
        "end": 754.0
    },
    {
        "text": " Incluso cuando B no es inversión, B funciona, porque esta propiedad funciona.",
        "start": 754.0,
        "end": 759.0
    },
    {
        "text": " Siempre tenemos transformación elemental aplicada por cualquier matriz del buen tamaño, eso mismo que aplicar la transformación elemental a la matriz. Y esto lo depende de B.",
        "start": 759.0,
        "end": 773.0
    },
    {
        "text": " Ok. Entonces, si logramos demostrar el teorema, en el caso particular donde la matriz por la izquierda es una matriz elemental. Es un caso particular.",
        "start": 773.0,
        "end": 786.0
    },
    {
        "text": " Y esta razón porque se llama un lema porque está contenido en el teorema, pero todavía no tenemos el teorema, entonces estamos haciendo una investigación y las pruebas se acumulan poco y poco.",
        "start": 786.0,
        "end": 799.0
    },
    {
        "text": " Ok. Queremos demostrar que todos los a y ves son culpables, no lo podemos hacer ahora, pero ya demostramos que las matrices elementales son culpables.",
        "start": 799.0,
        "end": 809.0
    },
    {
        "text": " Ok. Ahora vamos a extender resultado. Lema 2, vamos a demostrar que lema se extiende a todas las mantrisas invertibles.",
        "start": 809.0,
        "end": 822.0
    },
    {
        "text": " Lema 2, si A es invertible, entonces el teorema se cumple, el determinante de producto es igual al producto de los determinantes para toda la matriz B.",
        "start": 822.0,
        "end": 851.0
    },
    {
        "text": " Y esta puede ser invertible o no invertible, no importa. Ahora no estamos analizando B, B siempre es cualquiera, es sobre la matriz A que se hace la investigación.",
        "start": 851.0,
        "end": 865.0
    },
    {
        "text": " Ok. Demostración. ¿Cómo A es invertible? ¿Se pueden escompo de algún producto de matrices elementales? Vamos a usar la decomposition como producto de matrices elementales.",
        "start": 865.0,
        "end": 885.0
    },
    {
        "text": " Entonces, ¿Cómo A es invertible? ¿Existen matrices elementales?",
        "start": 885.0,
        "end": 897.0
    },
    {
        "text": " E1, E2 hasta EK, tan es que A sea el producto.",
        "start": 897.0,
        "end": 917.0
    },
    {
        "text": " Sabimos en las clases sobre las matrices elementales que cada matriz invertible es un producto finito de matrices elementales.",
        "start": 917.0,
        "end": 928.0
    },
    {
        "text": " Y ahora vamos a usar el lema anterior de modo repetido. Entonces, tenemos que.",
        "start": 928.0,
        "end": 939.0
    },
    {
        "text": " El determinante de A es igual al determinante de este producto.",
        "start": 939.0,
        "end": 951.0
    },
    {
        "text": " Ok. Acá no escribi nada. Pero ahora yo puedo aplicar el lema observando que esta es elemental y el resto no me importa.",
        "start": 951.0,
        "end": 966.0
    },
    {
        "text": " Entonces, aplicando una vez el lema, yo obtengo que es igual al determinante de, voy a escribir así,",
        "start": 966.0,
        "end": 977.0
    },
    {
        "text": " es el determinante de E1 por el determinante de lo que queda.",
        "start": 977.0,
        "end": 990.0
    },
    {
        "text": " Acá yo aplico el lema usando esta con matriz A y esta con matriz B. ¿Cómo? E1, E1. E1, yo la uso en este lema como si fuera.",
        "start": 990.0,
        "end": 1005.0
    },
    {
        "text": " Y ahora tiene que estar elemental y ves cualquiera. Pero supongo que repetía la operación. Este es por el lema 1.",
        "start": 1005.0,
        "end": 1020.0
    },
    {
        "text": " Hasta obtener que es igual al producto de E1 por E2, el determinante de E2 por el determinante de E1.",
        "start": 1021.0,
        "end": 1031.0
    },
    {
        "text": " Yo hago la misma cosa con E2 y después con E3, etcétera, hasta E1. Y obtengo este producto.",
        "start": 1033.0,
        "end": 1041.0
    },
    {
        "text": " Aplicando el lema, yo aplico el lema de hecho lo aplico menos 1 veces. De E1 hasta E1 cada vez tomando esta matriz elemental como una matriz A.",
        "start": 1042.0,
        "end": 1057.0
    },
    {
        "text": " Ok. Ahora tengo esto. Voy a hacerlo mismo con la matriz A.",
        "start": 1058.0,
        "end": 1063.0
    },
    {
        "text": " Ok. Entonces, descomcucimos el determinante de A. Ahora vamos a descomponer el determinante de A.",
        "start": 1071.0,
        "end": 1085.0
    },
    {
        "text": " Además tenemos que determinante de A. Es igual al determinante de E1, E2 hasta E subca por B.",
        "start": 1085.0,
        "end": 1103.0
    },
    {
        "text": " No digo nada, eso escribe la formula lo que significa A.",
        "start": 1104.0,
        "end": 1110.0
    },
    {
        "text": " Y yo puedo también aplicar el lema y lo voy a aplicar a menos cabezes.",
        "start": 1110.0,
        "end": 1115.0
    },
    {
        "text": " Digo que esto es lo mismo que E1 por el determinante de lo que queda.",
        "start": 1115.0,
        "end": 1122.0
    },
    {
        "text": " Y yo puedo enterrar el procedimiento hasta obtener la formula E1 por E2 por E1 por B.",
        "start": 1122.0,
        "end": 1141.0
    },
    {
        "text": " Y acá aplique el lema E1 cada vez.",
        "start": 1142.0,
        "end": 1148.0
    },
    {
        "text": " Y qué se observa? Esto es el determinante de A por lo anterior.",
        "start": 1154.0,
        "end": 1162.0
    },
    {
        "text": " Ok. Entienen que acá aplique el lema C-1 veces.",
        "start": 1163.0,
        "end": 1169.0
    },
    {
        "text": " Y acá lo aplique cada vez. Y esta parte por la izquierda es el determinante de A.",
        "start": 1170.0,
        "end": 1183.0
    },
    {
        "text": " Entonces esto es el producto de A por el determinante de A por el determinante de A.",
        "start": 1183.0,
        "end": 1189.0
    },
    {
        "text": " Ok. Entonces al gobierno se habíamos que esta formula se cumplía para las matrices elementales.",
        "start": 1190.0,
        "end": 1201.0
    },
    {
        "text": " Ahora por la inducción obtuvimos que se cumple para todos los productos finitos de matrices elementales.",
        "start": 1201.0,
        "end": 1208.0
    },
    {
        "text": " Pero es lo mismo que todas esas matrices invertibles.",
        "start": 1208.0,
        "end": 1211.0
    },
    {
        "text": " Entonces ya tenemos la formula de producto para todas esas matrices invertibles.",
        "start": 1211.0,
        "end": 1216.0
    },
    {
        "text": " Lo que nos queda es ver lo que pase con las matrices no invertibles.",
        "start": 1217.0,
        "end": 1222.0
    },
    {
        "text": " Ustedes también se cumple. Ok. Es el lema 3.",
        "start": 1222.0,
        "end": 1228.0
    },
    {
        "text": " Lema 3.",
        "start": 1228.0,
        "end": 1230.0
    },
    {
        "text": " Si A no es invertible, entonces su determinante es 0.",
        "start": 1246.0,
        "end": 1258.0
    },
    {
        "text": " Es lo que voy a demostrar. Es igual a 0. Disculpa.",
        "start": 1259.0,
        "end": 1264.0
    },
    {
        "text": " Voy a mostrar que todas esas matrices no invertibles tienen un determinante nulo.",
        "start": 1264.0,
        "end": 1270.0
    },
    {
        "text": " Esta muy bueno porque ya tendremos el resultado que nos importa.",
        "start": 1271.0,
        "end": 1275.0
    },
    {
        "text": " Cuando es invertible su determinante es un producto de matrices elementales.",
        "start": 1275.0,
        "end": 1281.0
    },
    {
        "text": " Entonces no puede ser muy bien.",
        "start": 1281.0,
        "end": 1285.0
    },
    {
        "text": " Porque el determinante de una matrices elementales o bien 1 o bien 1 o bien alfano nulo.",
        "start": 1286.0,
        "end": 1291.0
    },
    {
        "text": " Si su algún producto de tales cosas voy a tener algo nulo.",
        "start": 1291.0,
        "end": 1294.0
    },
    {
        "text": " Porque no hay ningún cero.",
        "start": 1294.0,
        "end": 1296.0
    },
    {
        "text": " Entonces ya sea para hacer esto que las matrices no envenible.",
        "start": 1296.0,
        "end": 1301.0
    },
    {
        "text": " Es un producto de matrices elementales.",
        "start": 1301.0,
        "end": 1304.0
    },
    {
        "text": " Es un producto de matrices elementales.",
        "start": 1304.0,
        "end": 1308.0
    },
    {
        "text": " Es un producto de tales cosas voy a tener algo nulo.",
        "start": 1309.0,
        "end": 1313.0
    },
    {
        "text": " Porque no hay ningún cero.",
        "start": 1313.0,
        "end": 1315.0
    },
    {
        "text": " Entonces ya sea para hacer esto que las matrices no invertibles.",
        "start": 1315.0,
        "end": 1320.0
    },
    {
        "text": " Invertibles tienen un determinante nulo.",
        "start": 1320.0,
        "end": 1323.0
    },
    {
        "text": " Lo que me queda es demostrar que las matrices invertibles no invertibles.",
        "start": 1323.0,
        "end": 1328.0
    },
    {
        "text": " Disculpa, tienen un determinante nulo.",
        "start": 1328.0,
        "end": 1332.0
    },
    {
        "text": " Ok. Vamos a escariarizar.",
        "start": 1332.0,
        "end": 1335.0
    },
    {
        "text": " La demostración es la siguiente.",
        "start": 1335.0,
        "end": 1338.0
    },
    {
        "text": " Ok.",
        "start": 1338.0,
        "end": 1339.0
    },
    {
        "text": " Escribamos...",
        "start": 1342.0,
        "end": 1344.0
    },
    {
        "text": " ...aprima en la forma.",
        "start": 1347.0,
        "end": 1349.0
    },
    {
        "text": " Ya sabemos que aprima...",
        "start": 1352.0,
        "end": 1354.0
    },
    {
        "text": " ...no, ah, en la forma.",
        "start": 1354.0,
        "end": 1356.0
    },
    {
        "text": " Ah, no, disculpa.",
        "start": 1356.0,
        "end": 1359.0
    },
    {
        "text": " No lo voy a hacer así.",
        "start": 1359.0,
        "end": 1361.0
    },
    {
        "text": " Yo voy a escararizar a.",
        "start": 1362.0,
        "end": 1365.0
    },
    {
        "text": " Entonces escararizar consisten multiplicar por matrices elementales.",
        "start": 1367.0,
        "end": 1372.0
    },
    {
        "text": " Ok.",
        "start": 1372.0,
        "end": 1374.0
    },
    {
        "text": " Por...",
        "start": 1374.0,
        "end": 1375.0
    },
    {
        "text": " Escaraización.",
        "start": 1378.0,
        "end": 1379.0
    },
    {
        "text": " Entonces muy voy a tomar una forma de escararizarla.",
        "start": 1382.0,
        "end": 1385.0
    },
    {
        "text": " Sea, aprima, una forma escararizada.",
        "start": 1385.0,
        "end": 1391.0
    },
    {
        "text": " Dehá.",
        "start": 1396.0,
        "end": 1397.0
    },
    {
        "text": " Y sean...",
        "start": 1397.0,
        "end": 1400.0
    },
    {
        "text": " ...e 1, e 2, e ca.",
        "start": 1401.0,
        "end": 1405.0
    },
    {
        "text": " Matrices elementales.",
        "start": 1405.0,
        "end": 1407.0
    },
    {
        "text": " Tal es que cuando yo aplico que a, prima, es igual a, yo, parto de a,",
        "start": 1407.0,
        "end": 1422.0
    },
    {
        "text": " aplico la primera transformación elemental, la segunda transformación elemental,",
        "start": 1422.0,
        "end": 1428.0
    },
    {
        "text": " la última transformación elemental.",
        "start": 1428.0,
        "end": 1431.0
    },
    {
        "text": " Esto es el resumen del proceso de la escaralización.",
        "start": 1431.0,
        "end": 1435.0
    },
    {
        "text": " Parto de a, aplico las buenas transformaciones elementales acá representadas por matrices elementales",
        "start": 1436.0,
        "end": 1443.0
    },
    {
        "text": " y obtengo la matrices reducida.",
        "start": 1443.0,
        "end": 1445.0
    },
    {
        "text": " No, este es resumen.",
        "start": 1445.0,
        "end": 1447.0
    },
    {
        "text": " Solo necesito la forma este es resumen.",
        "start": 1447.0,
        "end": 1450.0
    },
    {
        "text": " Pero esto quiere decir, también tenemos que...",
        "start": 1450.0,
        "end": 1455.0
    },
    {
        "text": " ...a,",
        "start": 1460.0,
        "end": 1461.0
    },
    {
        "text": " ...es igual, a,",
        "start": 1462.0,
        "end": 1464.0
    },
    {
        "text": " ...e 1 menos 1 o yo pongo, esas matrices son todas invratibles.",
        "start": 1464.0,
        "end": 1469.0
    },
    {
        "text": " Entonces puedo invertir.",
        "start": 1469.0,
        "end": 1471.0
    },
    {
        "text": " Es igual a, e 1, de hecho, lo voy a inscribir directamente así.",
        "start": 1471.0,
        "end": 1476.0
    },
    {
        "text": " Es e 1, e ca.",
        "start": 1476.0,
        "end": 1479.0
    },
    {
        "text": " Hasta e 2, e 1.",
        "start": 1480.0,
        "end": 1483.0
    },
    {
        "text": " El todo a la menos 1, por a prima.",
        "start": 1483.0,
        "end": 1487.0
    },
    {
        "text": " Ok.",
        "start": 1487.0,
        "end": 1489.0
    },
    {
        "text": " Escribir esto.",
        "start": 1491.0,
        "end": 1493.0
    },
    {
        "text": " Es equivalente a esto.",
        "start": 1493.0,
        "end": 1495.0
    },
    {
        "text": " Pues esta matriz, es invertible.",
        "start": 1495.0,
        "end": 1499.0
    },
    {
        "text": " De e 1 hasta e ca, son matrices universibles cuyo producto es invertible.",
        "start": 1500.0,
        "end": 1504.0
    },
    {
        "text": " Ok.",
        "start": 1505.0,
        "end": 1506.0
    },
    {
        "text": " Pero ¿cuál es la forma escaralizada?",
        "start": 1506.0,
        "end": 1509.0
    },
    {
        "text": " A prima es una matrices escaralizada.",
        "start": 1509.0,
        "end": 1511.0
    },
    {
        "text": " ¿Cuál es su rango?",
        "start": 1511.0,
        "end": 1513.0
    },
    {
        "text": " Es menor que n.",
        "start": 1515.0,
        "end": 1517.0
    },
    {
        "text": " Entonces, a prima, tiene...",
        "start": 1518.0,
        "end": 1521.0
    },
    {
        "text": " ...como...",
        "start": 1524.0,
        "end": 1526.0
    },
    {
        "text": " ...a prima tiene...",
        "start": 1527.0,
        "end": 1529.0
    },
    {
        "text": " ...meno que n escalones.",
        "start": 1529.0,
        "end": 1532.0
    },
    {
        "text": " ¿Qué se puede ir al circo como es una matrices cuadrada?",
        "start": 1535.0,
        "end": 1539.0
    },
    {
        "text": " ¿Cuál será su última fila?",
        "start": 1539.0,
        "end": 1541.0
    },
    {
        "text": " Cero.",
        "start": 1541.0,
        "end": 1542.0
    },
    {
        "text": " Cero.",
        "start": 1542.0,
        "end": 1543.0
    },
    {
        "text": " Entonces su determinante es cero.",
        "start": 1543.0,
        "end": 1546.0
    },
    {
        "text": " Es como.",
        "start": 1547.0,
        "end": 1549.0
    },
    {
        "text": " El determinante es prima.",
        "start": 1550.0,
        "end": 1552.0
    },
    {
        "text": " Es igual a cero.",
        "start": 1552.0,
        "end": 1553.0
    },
    {
        "text": " Luego aplicando al lemán anterior.",
        "start": 1553.0,
        "end": 1556.0
    },
    {
        "text": " Luego el determinante de al.",
        "start": 1560.0,
        "end": 1563.0
    },
    {
        "text": " Esto es una matrices invertible.",
        "start": 1563.0,
        "end": 1566.0
    },
    {
        "text": " Entonces es igual al producto de este determinante.",
        "start": 1566.0,
        "end": 1570.0
    },
    {
        "text": " No sé cuál es, no me importa.",
        "start": 1570.0,
        "end": 1573.0
    },
    {
        "text": " Esto es una matrices invertible.",
        "start": 1575.0,
        "end": 1577.0
    },
    {
        "text": " Por el determinante de a prima.",
        "start": 1577.0,
        "end": 1580.0
    },
    {
        "text": " Y es decir, es igual a que cero.",
        "start": 1580.0,
        "end": 1583.0
    },
    {
        "text": " Ya está.",
        "start": 1583.0,
        "end": 1584.0
    },
    {
        "text": " Y esto es una matrices invertible.",
        "start": 1585.0,
        "end": 1587.0
    },
    {
        "text": " Ok.",
        "start": 1591.0,
        "end": 1592.0
    },
    {
        "text": " Ahora sabemos que las matrices no invertibles tienen determinante nulo.",
        "start": 1592.0,
        "end": 1597.0
    },
    {
        "text": " Es decir, las matrices escaralizadas cuadradas que no tienen rango n,",
        "start": 1598.0,
        "end": 1604.0
    },
    {
        "text": " necesariamente tienen la última fila nula.",
        "start": 1604.0,
        "end": 1607.0
    },
    {
        "text": " Determinante es igual a cero.",
        "start": 1607.0,
        "end": 1609.0
    },
    {
        "text": " Y después, a través de las transformaciones elementales,",
        "start": 1609.0,
        "end": 1613.0
    },
    {
        "text": " esta propiedad se propaga.",
        "start": 1613.0,
        "end": 1615.0
    },
    {
        "text": " Ok.",
        "start": 1615.0,
        "end": 1616.0
    },
    {
        "text": " De a prima forma de cerizada, hasta atrás a.",
        "start": 1616.0,
        "end": 1621.0
    },
    {
        "text": " Ok.",
        "start": 1622.0,
        "end": 1623.0
    },
    {
        "text": " Tenemos el lemán 3.",
        "start": 1623.0,
        "end": 1624.0
    },
    {
        "text": " Y el último lemán es un lemán técnico.",
        "start": 1624.0,
        "end": 1627.0
    },
    {
        "text": " Que va a decir que si una matrices es no invertible,",
        "start": 1628.0,
        "end": 1633.0
    },
    {
        "text": " entonces cualquier producto le es a matrices por otra matrices,",
        "start": 1633.0,
        "end": 1637.0
    },
    {
        "text": " a un poco de pie.",
        "start": 1637.0,
        "end": 1638.0
    },
    {
        "text": " Ok.",
        "start": 1658.0,
        "end": 1660.0
    },
    {
        "text": " Básmate.",
        "start": 1668.0,
        "end": 1669.0
    },
    {
        "text": " De ahí está.",
        "start": 1677.0,
        "end": 1678.0
    },
    {
        "text": " entonces, a b tampoco es invertible y para toda matriz b",
        "start": 1678.0,
        "end": 1697.68
    },
    {
        "text": " ok ahora hay que demostrarlo lo vamos a demostrar por el absurdo por el absurdo",
        "start": 1697.68,
        "end": 1717.8400000000001
    },
    {
        "text": " supongamos vamos a superar que esta no es invertible pero que a b es",
        "start": 1717.84,
        "end": 1727.4399999999998
    },
    {
        "text": " invertible",
        "start": 1727.4399999999998,
        "end": 1729.76
    },
    {
        "text": " ok bueno super las que el producto es invertible y voy a intentar construir una",
        "start": 1738.3999999999999,
        "end": 1744.84
    },
    {
        "text": " contradicción ahora necesito ver mis apuntes porque es el caso donde un pequeño",
        "start": 1744.84,
        "end": 1752.6399999999999
    },
    {
        "text": " pequeña construcción ok sea y ahora es la matriz que sale de nada yo voy a",
        "start": 1752.6399999999999,
        "end": 1761.02
    },
    {
        "text": " considerar esta matriz sea la matriz a prima igual a b por la inversa de",
        "start": 1761.02,
        "end": 1768.6799999999998
    },
    {
        "text": " b tengo el derecho construir esta matriz porque por el pozo es el",
        "start": 1768.68,
        "end": 1774.3600000000001
    },
    {
        "text": " si yo sé que a b es invertible y como es invertible yo puedo escribir a b",
        "start": 1774.3600000000001,
        "end": 1778.6000000000001
    },
    {
        "text": " el todo a la menos 1 no sé lo que es ahí bien entonces no puedo desarrollar esta",
        "start": 1778.6000000000001,
        "end": 1783.1200000000001
    },
    {
        "text": " formula pero yo sé que a b tiene una inversa y yo la puedo multiplicar por b",
        "start": 1783.1200000000001,
        "end": 1787.64
    },
    {
        "text": " todas son matricios de tamaño n por n se pueden hacer todos los productos",
        "start": 1787.64,
        "end": 1791.72
    },
    {
        "text": " ok ahora se observa que",
        "start": 1792.68,
        "end": 1795.32
    },
    {
        "text": " si yo multiplico a por a prima a por a prima es igual a que es igual a a por b por a b",
        "start": 1800.68,
        "end": 1811.2
    },
    {
        "text": " a la menos 1 pero las parancias se lo cuentan es lo mismo que a b por a b a la",
        "start": 1811.2,
        "end": 1818.6200000000001
    },
    {
        "text": " menos 1 y es igual a que es igual a identidad y que quiere decir esto que a prima",
        "start": 1818.62,
        "end": 1827.7399999999998
    },
    {
        "text": " esta inversa lea ok luego a prima es la inversa de a lo que quiere decir que y",
        "start": 1827.7399999999998,
        "end": 1844.58
    },
    {
        "text": " a es invertible que tengo su inversa y esto es una contradicción porque supuse que no",
        "start": 1844.58,
        "end": 1852.58
    },
    {
        "text": " era invertible contradicción",
        "start": 1852.58,
        "end": 1856.1399999999999
    },
    {
        "text": " ok entienden el arrasonamiento yo quería demostrar de hecho supuse dos cosas",
        "start": 1864.54,
        "end": 1871.54
    },
    {
        "text": " supuse que no es invertible mi hipótesis y también supuse la negación de mi conclusión",
        "start": 1872.5,
        "end": 1879.54
    },
    {
        "text": " supuse que si no es invertible pero pero por un lado a b lo es y obtuve una contradicción",
        "start": 1880.6599999999999,
        "end": 1889.94
    },
    {
        "text": " entonces no es posible tener a la vez a no invertible y a b invertible o de mismo modo",
        "start": 1890.98,
        "end": 1900.8999999999999
    },
    {
        "text": " pueden ver que demostré que si a b es invertible entonces a es invertible por contra el recíproco si",
        "start": 1900.9,
        "end": 1909.0600000000002
    },
    {
        "text": " a no es invertible entonces a b no es invertible ok acá el truco consiste en decir yo supongo que el",
        "start": 1909.0600000000002,
        "end": 1921.0600000000002
    },
    {
        "text": " producto es invertible puedo escribir esta matriz no sé cómo se descompone o ni siquiera si se",
        "start": 1921.0600000000002,
        "end": 1926.9
    },
    {
        "text": " puede es componer pero supuse formar esta matriz y observo que esta matriz este producto esta",
        "start": 1926.9,
        "end": 1932.5400000000002
    },
    {
        "text": " inversa de a ok entonces ahora ponemos demostrar el teorema en el caso general demostración del",
        "start": 1932.5400000000002,
        "end": 1944.8600000000001
    },
    {
        "text": " teorema de cochevine",
        "start": 1944.8600000000001,
        "end": 1946.38
    },
    {
        "text": " por supuesto que si a b es invertible esto implica que b también es invertible se puede",
        "start": 1957.8600000000001,
        "end": 1965.4
    },
    {
        "text": " demostrar por transposición porque si a b es invertible la transpuesta de a b es invertible pero la",
        "start": 1965.4,
        "end": 1974.0600000000002
    },
    {
        "text": " transpuesta de a b es el transpuesta de a ee por la transpuesta de a ee aplicando este leema la",
        "start": 1974.0600000000002,
        "end": 1979.14
    },
    {
        "text": " transpuesta de a ee es invertible entonces b es invertible pasé por la transpuesta para intergar",
        "start": 1979.14,
        "end": 1985.9
    },
    {
        "text": " las cosas",
        "start": 1985.9,
        "end": 1988.7
    },
    {
        "text": " pero solo voy a usar este leema y tienes razón también yo podría concluir que b también es",
        "start": 1994.42,
        "end": 2001.64
    },
    {
        "text": " invertible pero nosotros matemáticos somos superesosos solo ponemos lo que necesitamos ahora al",
        "start": 2001.64,
        "end": 2012.16
    },
    {
        "text": " día de hoy",
        "start": 2012.16,
        "end": 2014.68
    },
    {
        "text": " ok ahora yo podría demostrar el teorema de cochevine",
        "start": 2017.2,
        "end": 2022.44
    },
    {
        "text": " entonces demostración del teorema",
        "start": 2022.44,
        "end": 2026.2
    },
    {
        "text": " de b de coche",
        "start": 2031.64,
        "end": 2035.3200000000002
    },
    {
        "text": " es muy divertido para mí porque no en francés no usamos los mismos nombres para los teoremas",
        "start": 2042.76,
        "end": 2049.04
    },
    {
        "text": " en francia este teorema que aparentemente fue demostrado por los franceses se llama teorema",
        "start": 2049.04,
        "end": 2057.56
    },
    {
        "text": " el producto no tiene nombres y es un dándome en un rupe que descubrí que era el teorema de bineco",
        "start": 2057.56,
        "end": 2064.0
    },
    {
        "text": " así aprendiz cosas ok ahora sean a ee 2 matrices cuadralas cuelas quiera",
        "start": 2064.0,
        "end": 2079.2
    },
    {
        "text": " ok y que voy a hacer voy a diseñar dos casos el caso donde es invertible y el caso donde",
        "start": 2079.2,
        "end": 2092.16
    },
    {
        "text": " alo es invertible ok caso uno entonces se distinguen dos casos",
        "start": 2092.16,
        "end": 2098.08
    },
    {
        "text": " primer caso",
        "start": 2103.52,
        "end": 2104.6
    },
    {
        "text": " a desinvertible",
        "start": 2107.0,
        "end": 2108.24
    },
    {
        "text": " entonces el determinante de producto es igual a que",
        "start": 2111.72,
        "end": 2115.24
    },
    {
        "text": " es igual a que no sé si todavía lo puse es el lema dos el lema dos dice que si es",
        "start": 2115.24,
        "end": 2125.4799999999996
    },
    {
        "text": " invertible ya desapareció lema dos el lema dos dice si hay sin divertimiento es el determinante",
        "start": 2125.4799999999996,
        "end": 2132.24
    },
    {
        "text": " de producto es igual el producto es el determinante ya está por el lema dos",
        "start": 2132.24,
        "end": 2138.56
    },
    {
        "text": " ahora casudos",
        "start": 2141.56,
        "end": 2142.9599999999996
    },
    {
        "text": " no es invertible",
        "start": 2147.24,
        "end": 2149.0
    },
    {
        "text": " ok entonces",
        "start": 2154.04,
        "end": 2155.9599999999996
    },
    {
        "text": " tenemos que el determinante de a es igual a que es igual a cero por el lema tres",
        "start": 2155.96,
        "end": 2166.28
    },
    {
        "text": " pero por el lema cuatro que se puede lucir el producto a ver tampoco es",
        "start": 2171.08,
        "end": 2176.52
    },
    {
        "text": " invertible por el lema cuatro luego si ha veno es invertible que se puede lucir",
        "start": 2177.04,
        "end": 2192.96
    },
    {
        "text": " sobre su determinante es tu lo también",
        "start": 2192.96,
        "end": 2195.7200000000003
    },
    {
        "text": " por el lema tres de vuelta que se concluye la formular el producto se cumple porque el",
        "start": 2201.8,
        "end": 2212.54
    },
    {
        "text": " determinante de a es igual a cero entonces por lo tanto tenemos que el determinante de a",
        "start": 2212.54,
        "end": 2222.54
    },
    {
        "text": " que es igual a cero es igual a cero por el determinante de ve y esto es igual el determinante de",
        "start": 2222.54,
        "end": 2228.86
    },
    {
        "text": " a por el determinante de ve ya está",
        "start": 2228.86,
        "end": 2230.66
    },
    {
        "text": " es decir es un caso de generado",
        "start": 2236.2599999999998,
        "end": 2238.18
    },
    {
        "text": " la forma de producto cuando a o ve de hecho no es invertible sólo dice cero es igual a cero por cero",
        "start": 2239.06,
        "end": 2249.02
    },
    {
        "text": " por algo ok cuando no es invertible sólo dice cero es igual a cero por algo algo que ya sabemos",
        "start": 2249.02,
        "end": 2257.66
    },
    {
        "text": " desdea la antigüela",
        "start": 2257.66,
        "end": 2259.98
    },
    {
        "text": " ok ahora esto termina la proibada del teorema de koshi bine y por supuesto en la teoría esta",
        "start": 2259.98,
        "end": 2275.62
    },
    {
        "text": " formula es super útil para calcular determinantes cuando tiene un producto una matrix definida por",
        "start": 2275.62,
        "end": 2284.46
    },
    {
        "text": " producto en lugar de calcular un determinante complicado pueden descomponerla en sus factores",
        "start": 2284.46,
        "end": 2291.1
    },
    {
        "text": " ok ahora voy a terminar con un pequeño tema que es el tema de las matrices determinantes y",
        "start": 2292.38,
        "end": 2302.34
    },
    {
        "text": " matrices inversas",
        "start": 2302.34,
        "end": 2302.94
    },
    {
        "text": " entonces el teorema es super fácil",
        "start": 2315.46,
        "end": 2319.26
    },
    {
        "text": " teorema es el determinante y matrices nivelazo",
        "start": 2323.26,
        "end": 2326.86
    },
    {
        "text": " el teorema dice que para toda la matrices",
        "start": 2326.86,
        "end": 2344.7000000000003
    },
    {
        "text": " entonces para toda la matrices",
        "start": 2344.7,
        "end": 2347.8199999999997
    },
    {
        "text": " cuadrada como siempre porque cuando se trata el determinante sólo consideramos las matrices",
        "start": 2352.8199999999997,
        "end": 2359.66
    },
    {
        "text": " cuadradas tenemos que a es invertible sí y sólo sí su determinante no es solo",
        "start": 2359.66,
        "end": 2374.98
    },
    {
        "text": " es decir era el tema del capítulo de los determinantes es decir mostrar que este número que se",
        "start": 2374.98,
        "end": 2382.8999999999996
    },
    {
        "text": " llama el determinante es la medida del carácter invertible ok calcular un determinante permite",
        "start": 2382.9,
        "end": 2393.3
    },
    {
        "text": " verificar si una matrices es invertible o no ok además además",
        "start": 2393.3,
        "end": 2401.14
    },
    {
        "text": " cuál es el determinante de la inversa es la inversa del determinante",
        "start": 2401.14,
        "end": 2409.94
    },
    {
        "text": " cuando es invertible",
        "start": 2414.7,
        "end": 2416.1
    },
    {
        "text": " ok ahora hay que verificar demostrar esto y esto es trivial",
        "start": 2416.1,
        "end": 2430.22
    },
    {
        "text": " porque la demostración es obvia si a es invertible",
        "start": 2433.9,
        "end": 2440.58
    },
    {
        "text": " vimos que a el determinante de a es el producto de los determinantes de sus transformaciones",
        "start": 2440.86,
        "end": 2453.06
    },
    {
        "text": " eleventales ya sabemos que existen transformaciones elementales que permiten descomponer a pero esto no",
        "start": 2453.06,
        "end": 2463.62
    },
    {
        "text": " es nulo etcétera esto no es nulo producto de números todos los nulos obtengo un número nulo",
        "start": 2463.62,
        "end": 2470.34
    },
    {
        "text": " ok entonces las matrices invertibles tienen un determinante nulo y las matrices no",
        "start": 2470.34,
        "end": 2477.9
    },
    {
        "text": " universibles si a no es invertible tenemos que a es igual a cero por el le matrés",
        "start": 2477.9,
        "end": 2488.1800000000003
    },
    {
        "text": " sabemos que una triste no es invertible tiene determinante nulo entonces una matrices",
        "start": 2488.18,
        "end": 2499.5
    },
    {
        "text": " es invertible sí solo sí su determinante no es nulo ok y por supuesto esta formula es obvia",
        "start": 2499.5,
        "end": 2507.18
    },
    {
        "text": " además además cuando hay sinibraciones",
        "start": 2507.8999999999996,
        "end": 2514.7799999999997
    },
    {
        "text": " tenemos que el determinante de a por el determinante de a la menos 1 es igual usando la",
        "start": 2520.8599999999997,
        "end": 2528.8999999999996
    },
    {
        "text": " formula le producto es a por a la menos 1 y el determinante de todo ok esto es el determinante de",
        "start": 2528.9,
        "end": 2537.38
    },
    {
        "text": " la identidad y esto es igual a 1 luego el determinante de a la menos 1 es igual a 1 sobre el",
        "start": 2537.38,
        "end": 2549.42
    },
    {
        "text": " determinante de a y esto está ok me equivoque o no porque en general siempre me equivoco",
        "start": 2549.42,
        "end": 2561.58
    },
    {
        "text": " ya lo saben ok muy bien terminamos el problema de la relación entre el determinante y la matrices",
        "start": 2561.58,
        "end": 2575.7400000000002
    },
    {
        "text": " inversa pero ahora vamos a ver la noción de cofactores vamos a ver que existe una",
        "start": 2575.74,
        "end": 2589.3999999999996
    },
    {
        "text": " formula de magia negra que permite calcular la inversa mediante determinantes y no la voy a demostrar",
        "start": 2589.3999999999996,
        "end": 2598.5
    },
    {
        "text": " porque en la práctica nunca las vamos a usar pero es importante acá todo esto son las cosas",
        "start": 2598.5,
        "end": 2604.4599999999996
    },
    {
        "text": " muy importantes que tienen que saber si no nunca se van a sobrevivir en este mundo difícil lo que",
        "start": 2604.46,
        "end": 2611.94
    },
    {
        "text": " voy a mostrar ahora es cultura general",
        "start": 2611.94,
        "end": 2613.94
    },
    {
        "text": " ok ahora es una formula que ducono perfectamente entonces",
        "start": 2634.46,
        "end": 2649.98
    },
    {
        "text": " entonces cofactores definición",
        "start": 2649.98,
        "end": 2661.1
    },
    {
        "text": " Dala una matriz una matriz a determinó en el poro de una matriz cuadrada se llama cofactor",
        "start": 2661.1,
        "end": 2683.62
    },
    {
        "text": " de a en la posición y y j el número",
        "start": 2683.62,
        "end": 2700.66
    },
    {
        "text": " se su hijo está y esto es el número cofactor es número que está definido como menos 1 por",
        "start": 2700.66,
        "end": 2718.3799999999997
    },
    {
        "text": " imas j es decir es el signo de la entrada ya saben que en una matriz cada entra tiene un signo",
        "start": 2718.3799999999997,
        "end": 2725.8999999999996
    },
    {
        "text": " por la matriz al determinante de la matriz adjunta ok y y estos números forman una matriz",
        "start": 2725.9,
        "end": 2746.98
    },
    {
        "text": " se subí j donde y está entre y uno y n j está entre uno y n y estos números forman una matriz",
        "start": 2746.98,
        "end": 2769.46
    },
    {
        "text": " escrita la escribo cof de a y es la matriz de los cofactores",
        "start": 2776.98,
        "end": 2787.54
    },
    {
        "text": " entonces cómo se calcula la matriz los cofactores hay que ser un todo determinante es una computación",
        "start": 2787.54,
        "end": 2805.1
    },
    {
        "text": " horrible es decir soparto de mi matriz para cada entra su calculo el determinante de la matriz",
        "start": 2805.1,
        "end": 2813.18
    },
    {
        "text": " adjunta correspondiente y después multiplico por el buen signo no esto va a venir al final",
        "start": 2813.18,
        "end": 2823.22
    },
    {
        "text": " acá es la matriz de los cofactores ok acá observar que para cada matriz para calcular la",
        "start": 2823.22,
        "end": 2835.4599999999996
    },
    {
        "text": " matriz de cofactores tengo que calcular n cuadrado determinantes de tamaño n menos 1 ok entonces es",
        "start": 2835.4599999999996,
        "end": 2846.14
    },
    {
        "text": " un ejercicio horrible es un super determinante y el teorema el teorema que no voy a demostrar teorema para toda",
        "start": 2846.14,
        "end": 2857.2999999999997
    },
    {
        "text": " la matriz cuadrada para toda la matriz cuadrada a tenemos que y acá a matriz cuadrada a la fórmula de",
        "start": 2857.3,
        "end": 2886.38
    },
    {
        "text": " maja negra dice que si yo hago el producto de a por la transpuesta de sus matriz de cofactores y acá",
        "start": 2886.38,
        "end": 2893.7000000000003
    },
    {
        "text": " aparece la transpuesta obtengo la matriz un múltiples la matriz identilada y el factor es el",
        "start": 2893.7000000000003,
        "end": 2902.6600000000003
    },
    {
        "text": " determinante es una fórmula de maja negra a por la transpuesta de la matriz de los cofactores me da la",
        "start": 2902.66,
        "end": 2925.3399999999997
    },
    {
        "text": " identidad a menos de este factor en el caso donde el determinante no es nulo se puede usar esta",
        "start": 2925.34,
        "end": 2933.7400000000002
    },
    {
        "text": " fórmula para calcular la inversa entonces en particular cuando a es invertible es decir cuando",
        "start": 2933.7400000000002,
        "end": 2951.7400000000002
    },
    {
        "text": " el determinante de a es igual es de cinto de cero tenemos que la matriz inversa es la transpuesta de",
        "start": 2951.74,
        "end": 2966.74
    },
    {
        "text": " la matriz de los cofactores al menos de un coeficiente que uno sobre el determinante de a",
        "start": 2966.74,
        "end": 2972.66
    },
    {
        "text": " la otra entonces tenemos una fórmula directa que nos calculara en inversa si no entiendo si si acá es",
        "start": 2972.66,
        "end": 2991.8999999999996
    },
    {
        "text": " la matriz de todos los determinantes de todas esas matrices adjuntas y hay que poder una transforzición y",
        "start": 2991.8999999999996,
        "end": 2997.8199999999997
    },
    {
        "text": " después hay que en cada casilla hay que poner tener el cuenta de sigo entonces es una fórmula",
        "start": 2997.82,
        "end": 3003.42
    },
    {
        "text": " horrible porque esta matriz de cofactores necesita calcular n cuadrado determinantes de tamaño n-1 y",
        "start": 3003.42,
        "end": 3012.6200000000003
    },
    {
        "text": " sabemos que para calcular un determinante de tamaño n-1 necesitamos hacer n factorial por n-1",
        "start": 3012.6200000000003,
        "end": 3019.78
    },
    {
        "text": " multiplicaciones entonces tenemos algo como n cuadrado por n-1 por n-1 factorial por n-2 es horrible",
        "start": 3019.78,
        "end": 3030.9
    },
    {
        "text": " es un número ok entonces en la práctica esta fórmula no se debe para nada",
        "start": 3031.94,
        "end": 3039.34
    },
    {
        "text": " sabe que en eva hay gente que dice ah pero ahí esta fórmula para calcular la inversa se puede",
        "start": 3040.34,
        "end": 3046.5400000000004
    },
    {
        "text": " usar esta fórmula en el caso dimension 2 se puede usar esta fórmula en el caso dimension 3 ya en",
        "start": 3046.54,
        "end": 3054.14
    },
    {
        "text": " la dimensión 4 es demasiado cuentas entonces en la práctica por favor no usen esta fórmula para",
        "start": 3054.14,
        "end": 3061.82
    },
    {
        "text": " calcular la matriz universa pero para cosas de teoría a veces está bien tener esta fórmula que",
        "start": 3061.82,
        "end": 3069.46
    },
    {
        "text": " puede asularnos ok entonces esta fórmula esencialmente un interés teórico que dice que dice gente",
        "start": 3069.46,
        "end": 3080.38
    },
    {
        "text": " tuvimos que aplicar un algoritmo complicado de escarriización para obtener la inversa pero",
        "start": 3080.38,
        "end": 3086.5
    },
    {
        "text": " de hecho existe una fórmula directa que me calcula la inversa cuando es indivatible esta buena",
        "start": 3086.5,
        "end": 3092.02
    },
    {
        "text": " nauticia tenemos una fórmula explícita para calcular la inversa era la buena nauticia la mala",
        "start": 3092.02,
        "end": 3098.62
    },
    {
        "text": " nauticia es que se necesitan mucho más cuentas que aplicamos el oricino pero tenemos una fórmula para",
        "start": 3098.62,
        "end": 3109.62
    },
    {
        "text": " la gente a mí por ejemplo me encantan las fórmulas directas entonces me encanta esta fórmula pero en",
        "start": 3109.62,
        "end": 3116.66
    },
    {
        "text": " la práctica nunca la usaría ni siquiera la programaría en la computadora porque yo sé que se van",
        "start": 3116.66,
        "end": 3124.7
    },
    {
        "text": " a usar mucho más cuentas con esta fórmula mejor es mucho mejor usar el algoritmo que ya vimos",
        "start": 3124.7,
        "end": 3132.8199999999997
    },
    {
        "text": " para invertir matrices ok y esto termina el capítulo sobre los determinantes no tengo nada más que",
        "start": 3132.8199999999997,
        "end": 3141.74
    },
    {
        "text": " desierto sobre los determinantes y vamos a empezar con la parte geometría tienen consultas preguntas",
        "start": 3141.74,
        "end": 3149.06
    },
    {
        "text": " sobre los determinantes a lo que hice es decir ok yo multiplico esto por a la menos 1 ok si",
        "start": 3149.06,
        "end": 3168.98
    },
    {
        "text": " es indivatible yo puedo multiplicar esto para a la menos 1 yo obtengo que cofactor de la",
        "start": 3168.98,
        "end": 3175.2599999999998
    },
    {
        "text": " transfuesta es igual a menos 1 por esta matriz pero este es un coeficiente de eso lo puedo poner por la",
        "start": 3175.26,
        "end": 3182.26
    },
    {
        "text": " izquierda y obtengo que cofactor de la transfuesta es igual a determinante de la por a la menos 1 y después",
        "start": 3182.26,
        "end": 3191.0200000000004
    },
    {
        "text": " tengo lo obtengo lo que quiero ok entonces esto termina el estudio de los determinantes la morra",
        "start": 3191.0200000000004,
        "end": 3201.5800000000004
    },
    {
        "text": " leja es que cuando tiene que calcular los determinantes es una noción muy interesante para estimar si",
        "start": 3201.58,
        "end": 3209.8199999999997
    },
    {
        "text": " una matriz es invertible o no es un número que permite determinar no sólo si una matriz es",
        "start": 3209.8199999999997,
        "end": 3216.2999999999997
    },
    {
        "text": " invertible o no pero también permite calcular de modo abstracto su inverso pero en la práctica nunca",
        "start": 3216.2999999999997,
        "end": 3223.2999999999997
    },
    {
        "text": " se usa pero a veces en algunas aplicaciones veremos que a veces esta fórmula puede ser interesante",
        "start": 3223.2999999999997,
        "end": 3230.2999999999997
    },
    {
        "text": " en la mayoría de los casos no hay que usarla ok ahora vamos a hablar del espacio",
        "start": 3231.58,
        "end": 3240.46
    },
    {
        "text": " nuevo capítulo rectas y planos en el espacio",
        "start": 3261.58,
        "end": 3277.2999999999997
    },
    {
        "text": " ok voy a empezar con la noción de eneuplas el espacio",
        "start": 3277.3,
        "end": 3296.82
    },
    {
        "text": " R a la n de las nuplas ok definición",
        "start": 3296.82,
        "end": 3310.86
    },
    {
        "text": " dado un número entero se llama eneuplas de nuplas de nuplas de nuplas de reales",
        "start": 3310.86,
        "end": 3339.94
    },
    {
        "text": " toda la sucesión finita",
        "start": 3339.94,
        "end": 3343.7000000000003
    },
    {
        "text": " x1 xn con donde x1 y xn pertenecen a R ok es una nuplas es una generalización de la noción",
        "start": 3343.7,
        "end": 3372.66
    },
    {
        "text": " de par una nuplas que es sólo es un número real una dos uplas es un par de reales una tres uplas es",
        "start": 3372.66,
        "end": 3384.8599999999997
    },
    {
        "text": " una terna de reales una 4 uplas es una 4 uplas etc etc etc ok entonces no hay nada que hacer y la",
        "start": 3384.8599999999997,
        "end": 3397.62
    },
    {
        "text": " pequeña observación y se escribe R a la n el conjunto de las nuplas",
        "start": 3397.62,
        "end": 3410.18
    },
    {
        "text": " es decir es el pronto cartesiano de R por R por R por R nimes ok en lugar de tener pares",
        "start": 3410.18,
        "end": 3431.5
    },
    {
        "text": " voy a tener tres uplas cuatro uplas que cinco uplas etc etc ok de hecho de donde salesta",
        "start": 3431.5,
        "end": 3441.06
    },
    {
        "text": " palabra uplas no existe en la real Academia española es una palabra matemática que sólo viene",
        "start": 3441.06,
        "end": 3449.42
    },
    {
        "text": " del sufico de uplas de cuadro uplas ok imagínalemente porque tenemos una palabra para para para para",
        "start": 3449.42,
        "end": 3459.82
    },
    {
        "text": " terna cuadro uplas y después no tenemos entonces esos matemáticos inventaron tenemos una 42 uplas",
        "start": 3459.82,
        "end": 3466.1800000000003
    },
    {
        "text": " ok 42 componentes y por supuesto este se llama la primera componente segunda componente etc etc",
        "start": 3466.1800000000003,
        "end": 3474.3
    },
    {
        "text": " ultima o n es y más componente ok y que se puede observar este espacio a qué parece un",
        "start": 3474.3,
        "end": 3484.1000000000004
    },
    {
        "text": " espacio que sabimos con otra notación es una espacio de soluciones las soluciones eran",
        "start": 3484.1,
        "end": 3490.62
    },
    {
        "text": " en nuplas pero también las filas las matrices filas son en nuplas y también las matrices columnas",
        "start": 3490.62,
        "end": 3498.2999999999997
    },
    {
        "text": " también son nuplas entonces voy a usar la misma estructura mis basuma ok entonces",
        "start": 3498.2999999999997,
        "end": 3504.7
    },
    {
        "text": " la observación es que el espacio era a la n tiene la misma estructura",
        "start": 3504.7,
        "end": 3516.3799999999997
    },
    {
        "text": " la misma estructura que el espacio el espacio de las matrices columnas",
        "start": 3516.38,
        "end": 3535.02
    },
    {
        "text": " es decir el tamaño 1 por n o de las matrices filas",
        "start": 3535.02,
        "end": 3549.42
    },
    {
        "text": " de tamaño n por 1 ok entonces voy a usar la misma notión de suma y la misma notión de producto",
        "start": 3549.42,
        "end": 3567.06
    },
    {
        "text": " por un número ok entonces como para las matrices vamos a definir una notión de suma y una",
        "start": 3567.06,
        "end": 3575.66
    },
    {
        "text": " notión de producto que sea identica",
        "start": 3575.66,
        "end": 3577.66
    },
    {
        "text": " es puede definir muchas cosas primero la cosa es la suma la suma la suma de dos nuplas",
        "start": 3605.66,
        "end": 3631.74
    },
    {
        "text": " es igual yo hago la suma componente por componente",
        "start": 3631.74,
        "end": 3641.22
    },
    {
        "text": " ok se puede definir la nuplanula",
        "start": 3641.22,
        "end": 3650.5
    },
    {
        "text": " que voy a escribir vector nulo es 0 0 n veces",
        "start": 3650.5,
        "end": 3663.46
    },
    {
        "text": " acá pueden ver que no hay nada original sólo es otra notación cuando yo tengo una",
        "start": 3663.46,
        "end": 3671.9
    },
    {
        "text": " matricina no sé si es una fila o una columna yo la chamo una n upla ok la opuesta la opuesta",
        "start": 3671.9,
        "end": 3685.62
    },
    {
        "text": " es igual a menos aquí su uno menos aquí se le ok yo puedo hacer el producto de un número",
        "start": 3688.82,
        "end": 3698.26
    },
    {
        "text": " por una nupla",
        "start": 3698.26,
        "end": 3699.34
    },
    {
        "text": " la mda por una nupla que es disculpa por esta horrible falta de imaginación ahora estamos",
        "start": 3699.34,
        "end": 3726.7000000000003
    },
    {
        "text": " haciendo cosas que acá no hay ningún uso de ningún neurono acá pueden apagar el cerebro sólo",
        "start": 3726.7,
        "end": 3736.4199999999996
    },
    {
        "text": " hay que copiar el mundo automático porque no hay no hay nada nuevo ok tenemos la estructura de las nuplas",
        "start": 3736.4199999999996,
        "end": 3750.58
    },
    {
        "text": " ok tenemos todas estas cosas y hay que ver las propiedades que cumplen y son las propiedades",
        "start": 3751.14,
        "end": 3757.98
    },
    {
        "text": " que chavimos entonces voy a escribirle de vuelta",
        "start": 3757.98,
        "end": 3761.26
    },
    {
        "text": " ok ahora propiedades",
        "start": 3787.98,
        "end": 3798.34
    },
    {
        "text": " hay que ver propiedades y es culpa voy a escribir cosas no originales",
        "start": 3798.34,
        "end": 3813.46
    },
    {
        "text": " propiedades las nuplas la suma de nuplas entonces para todos",
        "start": 3817.98,
        "end": 3824.46
    },
    {
        "text": " ub i2 v n n la suma de asociativa es commutativa",
        "start": 3824.46,
        "end": 3843.02
    },
    {
        "text": " 0 es neutro la nupla nula es neutra acá en serio no escribo nada el nuevo 0 u más su opuesta es igual a su",
        "start": 3843.02,
        "end": 3864.9
    },
    {
        "text": " opuesta más u y esto es igual al vector nulo acá lo que estoy diciendo es que es un buen espacio de",
        "start": 3864.9,
        "end": 3876.3
    },
    {
        "text": " vectores con enecomponentes ok 0 por u es igual a que al vector nulo 1 por u es igual a u menos 1 por",
        "start": 3876.3,
        "end": 3893.0800000000004
    },
    {
        "text": " u es igual a menos u y me faltan las dos cosas que lambda mu por u es igual a lambda por mu por u y al",
        "start": 3893.08,
        "end": 3907.46
    },
    {
        "text": " final tenemos que lambda más mu por u se puede desarrollar y lambda por u más v es igual a lambda",
        "start": 3907.46,
        "end": 3920.56
    },
    {
        "text": " por u más lambda por v son cosas que sabemos ok y de hecho porque recuerda todas estas propiedades",
        "start": 3920.56,
        "end": 3929.32
    },
    {
        "text": " porque sé dice que area la n es un espacio vectorial y después de primer parcial para los que",
        "start": 3929.32,
        "end": 3941.36
    },
    {
        "text": " ibas que habrán sobrevivido veremos la definición formal de espacio vectorial pero como yo quiero que",
        "start": 3941.36,
        "end": 3949.6
    },
    {
        "text": " todos ven vean la definición de espacio vectorial la la lo he un poquito antes del parcial ok esto se dice",
        "start": 3949.6,
        "end": 3961.1600000000003
    },
    {
        "text": " que era la n es un espacio vectorial y cada vez que algo es elemento de un espacio vectorial se",
        "start": 3961.16,
        "end": 3978.24
    },
    {
        "text": " puede chamar un vector es una lefición rara en matemática en matemática se llama un vector cualquier",
        "start": 3978.24,
        "end": 3985.72
    },
    {
        "text": " elemento de un espacio vectorial o sea no tenemos una lefición de lo que es un vectoro tenemos la",
        "start": 3985.72,
        "end": 3991.7599999999998
    },
    {
        "text": " defición de lo que es un espacio vectorial y cuando un objeto en matemática tiene su tarjeta de",
        "start": 3991.7599999999998,
        "end": 4000.52
    },
    {
        "text": " miembro de un espacio vectorial tengo mi documento ahora te puede chamar te puede chamar a vector ok",
        "start": 4000.52,
        "end": 4009.04
    },
    {
        "text": " esto y rara n no sólo es un espacio vectorial pero cuántas dimensiones tiene n por definición y es el",
        "start": 4009.04,
        "end": 4021.44
    },
    {
        "text": " espacio con n dimensiones esto es el espacio con n dimensiones ok desgraciadamente desgraciadamente tenemos",
        "start": 4021.44,
        "end": 4032.2799999999997
    },
    {
        "text": " que hacer ahora una resección grande disculpa nuestra culpa milla es un problema de preso puesto",
        "start": 4032.28,
        "end": 4038.28
    },
    {
        "text": " voy a restemixir a un espacio más pequeño me encantaría hacer geometría en real",
        "start": 4043.96,
        "end": 4054.8
    },
    {
        "text": " a la n pero pero debido a problemas de preso puesto la facultad sólo nos dio salones con tres dimensiones",
        "start": 4054.8,
        "end": 4069.6400000000003
    },
    {
        "text": " y nos dio acceso a sólo a espacios de dimension tres entonces debido a esta limitación para",
        "start": 4072.44,
        "end": 4080.2000000000003
    },
    {
        "text": " hipupuestal vamos a restringernos a la espacio de dimensión real de tres",
        "start": 4080.2,
        "end": 4086.64
    },
    {
        "text": " y así sólo vamos a hablar de cosas de dimensión 0 que se shaman los puntos de dimensión 1 que se",
        "start": 4091.7999999999997,
        "end": 4100.84
    },
    {
        "text": " shaman las rectas y de dimensión 2 que se shaman los planos pero me hubiera encantado hablarles",
        "start": 4100.84,
        "end": 4109.0
    },
    {
        "text": " de puntos de planos de volúmenes de hiper volúmenes de hiper hiper volúmenes y todo esto porque por",
        "start": 4109.0,
        "end": 4118.16
    },
    {
        "text": " supuesto la geometría de úquides ahora se las sabemos hacer en cualquier dimensión pero debido a",
        "start": 4118.16,
        "end": 4127.28
    },
    {
        "text": " problemas de preso puesto sólo vamos a estudiar en dimensión 3 entonces es un buen ejercicio",
        "start": 4127.28,
        "end": 4132.28
    },
    {
        "text": " conceptual esto mar todo lo que vamos a hacer acá y ver cómo se podría adaptar en un espacio con",
        "start": 4132.28,
        "end": 4139.5199999999995
    },
    {
        "text": " dimensión mayor y esto les debido a que desgraciamente vivimos en un espacio físico muy medio",
        "start": 4139.5199999999995,
        "end": 4149.16
    },
    {
        "text": " cree que sólo tiene tres dimensiones pero la malte matica soporta mucho más dimensiones el",
        "start": 4149.16,
        "end": 4156.12
    },
    {
        "text": " problema es debido a cómo hacer figuras cuando tenemos pocas dimensiones pero el raso de",
        "start": 4156.12,
        "end": 4162.24
    },
    {
        "text": " mi virtud se puede extender a mucho más dimensiones y esa razón porque los físicos a veces consideran",
        "start": 4162.24,
        "end": 4167.96
    },
    {
        "text": " más dimensiones porque la más de mágica lo permite ok ahora vamos a adoptar un punto de vista",
        "start": 4167.96,
        "end": 4176.28
    },
    {
        "text": " tengo que explicar mi punto de vista en espacio re3",
        "start": 4178.04,
        "end": 4181.599999999999
    },
    {
        "text": " el punto de vista es el siguiente el problema es hacer geometría en el espacio ambiente este el",
        "start": 4186.12,
        "end": 4213.72
    },
    {
        "text": " espacio de este salón de hecho una extensión de este salón porque necesito rectas infinitas",
        "start": 4213.72,
        "end": 4219.240000000001
    },
    {
        "text": " planos infinitos entonces necesito extender un poquito este salón que es terriblemente fisito",
        "start": 4219.240000000001,
        "end": 4226.280000000001
    },
    {
        "text": " ok otra limitación presupuestal me hubiera gustado tener salones infinitos ok pero no podemos el",
        "start": 4226.280000000001,
        "end": 4235.88
    },
    {
        "text": " espacio de re3 entonces tenemos un espacio y sabemos intuitivamente que este espacio físico tiene",
        "start": 4235.88,
        "end": 4241.76
    },
    {
        "text": " tres dimensiones de espacio que significa esto que cuando queremos identificar el punto en la",
        "start": 4241.76,
        "end": 4248.16
    },
    {
        "text": " espacio necesitamos tres coordinadas es decir tenemos sistemas de coordinadas el problema es que el",
        "start": 4248.16,
        "end": 4255.92
    },
    {
        "text": " espacio físico no está bien definido de modo matemático ni siquiera estamos seguro que es",
        "start": 4255.92,
        "end": 4262.8
    },
    {
        "text": " realmente con tres dimensiones porque los físicos te dicen a pero no es tan derecho es",
        "start": 4262.8,
        "end": 4270.4400000000005
    },
    {
        "text": " curvado hay curvas en la física moderna entonces vamos a trabajar en un espacio ideal que es una",
        "start": 4270.44,
        "end": 4277.96
    },
    {
        "text": " idealización del espacio físico donde vamos a tener rectas realmente rectas y planos realmente",
        "start": 4277.96,
        "end": 4284.12
    },
    {
        "text": " planos pero no corresponde a la espacio físico real entonces ojo la geometría que vamos a hacer es una",
        "start": 4284.12,
        "end": 4291.08
    },
    {
        "text": " idealización es una aproximación y cómo nos sabemos definir lo que es el espacio sabemos que",
        "start": 4291.08,
        "end": 4299.48
    },
    {
        "text": " a través de cualquier sistema de coordinadas podemos transformar cualquier punto en una",
        "start": 4299.48,
        "end": 4305.48
    },
    {
        "text": " terna es decir en una tres supla pero de modo matemático las tres suplas están super bien definidas",
        "start": 4305.48,
        "end": 4312.12
    },
    {
        "text": " entonces vamos a decir que a partir de ahora nuestro espacio de dimension 3 es real de 3 ok entonces",
        "start": 4312.12,
        "end": 4320.48
    },
    {
        "text": " a través de un sistema fijado de coordinadas",
        "start": 4320.48,
        "end": 4335.4
    },
    {
        "text": " se identifica el espacio ambiente",
        "start": 4335.4,
        "end": 4347.679999999999
    },
    {
        "text": " con r3 es decir a partir de ahora mi espacio es r3 punto",
        "start": 4354.2,
        "end": 4361.599999999999
    },
    {
        "text": " por supuesto para hacer esto necesito un sistema de coordinadas acá hay que decir cosas de metodología",
        "start": 4362.6,
        "end": 4373.280000000001
    },
    {
        "text": " no sé si ya hubo gente acá en el liceo hicieron geometría de geometría de euclides pierden los",
        "start": 4373.280000000001,
        "end": 4381.8
    },
    {
        "text": " acciones de euclides es decir por entre dos puntos por dos puntos pasa una única recta si yo",
        "start": 4381.8,
        "end": 4389.4400000000005
    },
    {
        "text": " tengo dos rectas o bien son paralelas o bien tienen una única intersección etc etc etc esto es el",
        "start": 4389.44,
        "end": 4395.5599999999995
    },
    {
        "text": " punto de vista antiguo donde se acishomatizaba la geometría a partir de la noción de punto la noción",
        "start": 4395.5599999999995,
        "end": 4403.48
    },
    {
        "text": " de vector etc etc etc esto viene de un tiempo donde los objetos geometricos en la antigua tenía",
        "start": 4403.48,
        "end": 4413.919999999999
    },
    {
        "text": " una definición mucho mejor que la noción de número pero en el siglo 19 las cosas cambiaron",
        "start": 4413.92,
        "end": 4422.0
    },
    {
        "text": " obtuvimos una perfecta definición de la noción de número real que sabieron en cálculo integral",
        "start": 4422.0,
        "end": 4429.12
    },
    {
        "text": " y diferencial en una variable sabieron los acciones de r la definición los acciones se cumplen los",
        "start": 4429.12,
        "end": 4435.68
    },
    {
        "text": " números reales a partir del siglo 19 obtuvimos una definición mucho mejor los números que los objetos",
        "start": 4435.68,
        "end": 4442.96
    },
    {
        "text": " geometricos entonces cambiamos de punto de vista ahora usamos los números para definir los objetos",
        "start": 4442.96,
        "end": 4449.72
    },
    {
        "text": " geometricos y es lo que estoy haciendo acá digo no sé lo que es un punto de una recta de cual",
        "start": 4449.72,
        "end": 4455.2
    },
    {
        "text": " hay algo pero yo sé lo que es un número real yo sé lo que es una n u plau por definición un",
        "start": 4455.2,
        "end": 4460.96
    },
    {
        "text": " punto de espacio es una alternada de números punto entonces un cambio radical de punto de vista",
        "start": 4460.96,
        "end": 4467.2
    },
    {
        "text": " que es el punto de vista al jebraico es decir hacer geometría es ahora parte del álgebra por supuesto",
        "start": 4467.76,
        "end": 4475.96
    },
    {
        "text": " como siempre voy a seguir representando mis rectas por cosas así mis planos por planos etc etc etc",
        "start": 4475.96,
        "end": 4482.2
    },
    {
        "text": " pero hay un cambio de punto de vista que es radical ahora entonces la otra observación es que",
        "start": 4482.2,
        "end": 4491.72
    },
    {
        "text": " este conjunto real a tres conjunto de ternas de reales puede representar dos tipos de objetos",
        "start": 4492.68,
        "end": 4499.4400000000005
    },
    {
        "text": " pueden representar puntos o bien vectores y esto solo va a depender el contexto de lo que queremos",
        "start": 4499.4400000000005,
        "end": 4507.4800000000005
    },
    {
        "text": " ver porque ahora como trabajamos en un espacio de sistema de coordinadas fijado siempre tenemos",
        "start": 4507.4800000000005,
        "end": 4516.08
    },
    {
        "text": " un origen entonces un punto o bien el vector que va de origen al punto es lo mismo para nosotros",
        "start": 4516.08,
        "end": 4524.32
    },
    {
        "text": " entonces van a ver que voy a hacer cosas horrible voy a identificar la noción de punto con el",
        "start": 4525.92,
        "end": 4531.76
    },
    {
        "text": " luce de vector y en el viseo ya saben que está arremal pero ahora hay un cambio de punto de vista",
        "start": 4531.76,
        "end": 4538.6
    },
    {
        "text": " entonces la cosa importante es que cada la observación es que cada tres suplas",
        "start": 4539.120000000001,
        "end": 4546.72
    },
    {
        "text": " puede representar",
        "start": 4550.08,
        "end": 4551.4400000000005
    },
    {
        "text": " o bien un punto",
        "start": 4555.84,
        "end": 4557.120000000001
    },
    {
        "text": " que voy a escribir a con letras fachúsculas o bien un vector",
        "start": 4561.8,
        "end": 4567.320000000001
    },
    {
        "text": " un nr3",
        "start": 4569.6,
        "end": 4572.6
    },
    {
        "text": " a",
        "start": 4572.6,
        "end": 4573.6
    },
    {
        "text": " yo podría poner flechas porque no pongo yo flechas la única razón es que soy presos",
        "start": 4573.6,
        "end": 4581.120000000001
    },
    {
        "text": " yo podría poner flechas y algunos días voy a poner flechas o no no poner flechas o que entienden",
        "start": 4581.120000000001,
        "end": 4589.320000000001
    },
    {
        "text": " la idea es decir cada tres suplas depende el función del contexto voy a decir a esta la voy",
        "start": 4589.320000000001,
        "end": 4595.120000000001
    },
    {
        "text": " a considerar como si fuera un punto y la otra como si fuera un vector pero al final todos tienen",
        "start": 4595.12,
        "end": 4600.4
    },
    {
        "text": " tres coordinadas",
        "start": 4600.4,
        "end": 4601.4
    },
    {
        "text": " ok y la otra cosa es que la operación es sus suales corresponde a las operaciones que ya vimos",
        "start": 4604.599999999999,
        "end": 4613.44
    },
    {
        "text": " acá es realmente un cambio de punto de vista radical por ejemplo en el libro azul hacen",
        "start": 4625.64,
        "end": 4639.28
    },
    {
        "text": " todo el construcción en los objetos las ternas a partir de los objetos geometricos esto es el",
        "start": 4639.28,
        "end": 4646.32
    },
    {
        "text": " punto de vista de la edad antigua y fue el punto de vista dominante hasta el fin del silencio",
        "start": 4646.32,
        "end": 4652.68
    },
    {
        "text": " 18 pero a partir de hoy decidiremos que no ahora los numeros están mucho mejor definidos entonces",
        "start": 4652.68,
        "end": 4662.320000000001
    },
    {
        "text": " vamos a usar los numeros para reconstruir los objetos geometricos",
        "start": 4662.320000000001,
        "end": 4665.84
    },
    {
        "text": " ok y además las operaciones",
        "start": 4669.16,
        "end": 4675.72
    },
    {
        "text": " sobre el espacio que ya vimos sea el tres corresponden a las operaciones",
        "start": 4675.72,
        "end": 4688.400000000001
    },
    {
        "text": " geometricas que ya conocen",
        "start": 4692.8,
        "end": 4695.6
    },
    {
        "text": " sobre los puntos y los vectores",
        "start": 4699.280000000001,
        "end": 4703.92
    },
    {
        "text": " y vamos a ver ejemplos por ejemplo la suma puede representar la suma de los vectores",
        "start": 4706.72,
        "end": 4717.2
    },
    {
        "text": " y es la suma entre ternas entre tres suplas el vector nulo es el vector nulo",
        "start": 4723.2,
        "end": 4732.52
    },
    {
        "text": " ahora para mí el vector nulo es la ternasero 0 0 mucho más sencillo",
        "start": 4733.52,
        "end": 4739.52
    },
    {
        "text": " ok el vector opuesto es el vector opuesto geometrico pero también es el vector opuesto como",
        "start": 4739.52,
        "end": 4750.120000000001
    },
    {
        "text": " terno y ya saben en el geometría multiplicar un vector por un número y eso mismo que multiplicar",
        "start": 4750.12,
        "end": 4762.08
    },
    {
        "text": " a sus tres componentes por el mismo número es decir es el producto externo de las ternas",
        "start": 4762.08,
        "end": 4767.84
    },
    {
        "text": " y al final hay otra operación que ya vimos en el geometría una operación que",
        "start": 4767.84,
        "end": 4775.5199999999995
    },
    {
        "text": " ya vimos es añadir a un punto a un vector 1 esa transasión acá esa transasión de a",
        "start": 4775.52,
        "end": 4785.4800000000005
    },
    {
        "text": " según un vector 1 este es un punto este es un vector y resulta lo es que es un punto",
        "start": 4785.4800000000005,
        "end": 4795.96
    },
    {
        "text": " pero corresponde a la misma operación que esta no cambia la operación solo es otro punto de vista",
        "start": 4795.96,
        "end": 4806.92
    },
    {
        "text": " cuando yo hago una suma yo puedo de bien ver mi suma como una suma de los vectores o bien como",
        "start": 4806.92,
        "end": 4813.84
    },
    {
        "text": " la suma de un punto y un vector lo que me hace a transasión ok y me da otro punto",
        "start": 4813.84,
        "end": 4821.2
    },
    {
        "text": " aquí lo que queda al final es un punto que puede llamar a B por ejemplo es decir vector",
        "start": 4821.2,
        "end": 4831.48
    },
    {
        "text": " más vector igual a vector punto más vector igual a punto pero la operación intima que hay",
        "start": 4831.48,
        "end": 4838.44
    },
    {
        "text": " dentro es idéntica es una suma ok es decir las cuentas son las mismas son es un cambio de",
        "start": 4838.44,
        "end": 4845.5199999999995
    },
    {
        "text": " punto de vista es decir o bien yo les he sido sumar dos vectores esto yo hago para el",
        "start": 4845.52,
        "end": 4854.160000000001
    },
    {
        "text": " programa para obtengo un ve y acá un más ve punto de vista suma de vector otro punto de vista",
        "start": 4854.160000000001,
        "end": 4862.84
    },
    {
        "text": " tengo un punto a tengo un vector y esto me construcción ve un punto ve ve que es igual a",
        "start": 4862.84,
        "end": 4873.240000000001
    },
    {
        "text": " a más su por supuesto cuando se hacen las cuentas son idénticas sólo es un cambio de punto de",
        "start": 4873.24,
        "end": 4882.5199999999995
    },
    {
        "text": " vista y también hay otra operación que es la resta entre dos puntos si yo hago la resta",
        "start": 4882.5199999999995,
        "end": 4890.24
    },
    {
        "text": " entre dos puntos que voy a obtener yo un vector",
        "start": 4890.24,
        "end": 4893.24
    },
    {
        "text": " B menos a también a veces lo escribire y para mí será sinónimo también se escribe el vector",
        "start": 4893.24,
        "end": 4906.5599999999995
    },
    {
        "text": " a B es decir cuando escribire vector a B para mí es un sinónimo para B menos a sí de hecho a más",
        "start": 4906.5599999999995,
        "end": 4920.12
    },
    {
        "text": " B sí pero no tiene sentido geometrico a más B el problema es que se refiere a la origen",
        "start": 4920.12,
        "end": 4928.44
    },
    {
        "text": " lo puedes ver como a más el vector origen a stabby las otras operaciones no mencionan el origen",
        "start": 4928.44,
        "end": 4937.5599999999995
    },
    {
        "text": " pero esto esto y acuerdo que a más B ahora si conseguís hacer cosas con a más B no te va no te",
        "start": 4937.5599999999995,
        "end": 4945.76
    },
    {
        "text": " va a ponercero en tu prueba pero las cosas que tienen sentido geometrico son suma de",
        "start": 4945.76,
        "end": 4955.04
    },
    {
        "text": " vectores hasta no se refiere a la origen el vector nulo no se refiere a la origen porque es un",
        "start": 4955.04,
        "end": 4962.8
    },
    {
        "text": " vector el opuesto es decir cambiar el sentido la dirección del sentido del vector",
        "start": 4962.8,
        "end": 4970.52
    },
    {
        "text": " multipliezo de un vector por un número acá es a trastación trastación del punto A según el",
        "start": 4970.52,
        "end": 4980.320000000001
    },
    {
        "text": " vector y acá es construcción de un vector a partir de dos puntos son las operaciones fundamentales",
        "start": 4980.320000000001,
        "end": 4986.72
    },
    {
        "text": " que vamos a usar pero la cosa interesante es que esta operación no es nada otro que la resta",
        "start": 4986.72,
        "end": 4992.6
    },
    {
        "text": " entre dos vectores o puntos ok entonces es el punto de vista entonces a veces me va a",
        "start": 4993.160000000001,
        "end": 5001.88
    },
    {
        "text": " ver que en este en mi clase como estoy muy desorganizado a veces voy a escribir esto a veces voy a",
        "start": 5001.88,
        "end": 5009.280000000001
    },
    {
        "text": " escribir esto tienen que considerar que estas dos cosas son sinónimos ok y será mi punto de vista",
        "start": 5009.280000000001,
        "end": 5018.160000000001
    },
    {
        "text": " a partir de ahora ok y pienso que esto lo para hoy muchas gracias",
        "start": 5018.16,
        "end": 5026.12
    }
]