[
    {
        "text": " There.",
        "start": 0.0,
        "end": 5.0
    },
    {
        "text": " Okay.",
        "start": 5.0,
        "end": 7.0
    },
    {
        "text": " So it's 6.06 and we are already 41 in the room.",
        "start": 7.0,
        "end": 14.0
    },
    {
        "text": " So I think it's a good time to start.",
        "start": 14.0,
        "end": 22.0
    },
    {
        "text": " So Abe, thank you very, very much to the part of this class and to share not only your knowledge, your specific knowledge and the industry, but also I would love to for you to share also your experience, your vision, maybe even specific experiences that you live anecdotes.",
        "start": 22.0,
        "end": 51.0
    },
    {
        "text": " That that happened with you with either with your while with that America, so don't be shy on on also on on putting a little bit of spice from from your real life and real experience.",
        "start": 51.0,
        "end": 67.0
    },
    {
        "text": " And also I would like to thank all the guys that were okay with having a guest that was speaking English of course because it's absolutely not the the most regular thing to do have.",
        "start": 68.0,
        "end": 84.0
    },
    {
        "text": " And that's exactly why I think that it's quite interesting to to to have these kind of of things happening in in in the university.",
        "start": 84.0,
        "end": 95.0
    },
    {
        "text": " So without further delay, I would let you a introduce yourself and then we can start the thing from questions, okay.",
        "start": 96.0,
        "end": 109.0
    },
    {
        "text": " Perfect, thank you for the introduction and again, it's great to virtually meet everyone.",
        "start": 109.0,
        "end": 119.0
    },
    {
        "text": " Well, I'll just quickly start with where where my passion for software began, you know, I believe all of you are a like in the engineering program, right, like that's everyone here is in that within that section, the university, okay.",
        "start": 119.0,
        "end": 143.0
    },
    {
        "text": " So for me, I did not study engineering or or computer science actually in university and I studied business in university, but I before a study in university, I was passionate about software and building things and I taught myself the world of of software.",
        "start": 143.0,
        "end": 171.0
    },
    {
        "text": " And the world of building apps and and building servers and and all of those those things that I'm sure you all are familiar with.",
        "start": 171.0,
        "end": 186.0
    },
    {
        "text": " And I guess I I share that as my starting point because the business of software and that side of things was not actually something that in my mind even existed as an idea until I was maybe a little bit later in my in my journey.",
        "start": 186.0,
        "end": 208.0
    },
    {
        "text": " Because for me at the start, just the idea of building something being able to have a picture in your mind and write code to create that picture and when I say picture, I mean, metaphorically, was so attractive.",
        "start": 208.0,
        "end": 229.0
    },
    {
        "text": " And then I realized sometimes you build things in software and it gets used by no one.",
        "start": 229.0,
        "end": 239.0
    },
    {
        "text": " And that's not very fun, not very interesting.",
        "start": 239.0,
        "end": 242.0
    },
    {
        "text": " And sometimes you build things and it gets gets used by thousands of people.",
        "start": 242.0,
        "end": 250.0
    },
    {
        "text": " And why that is often has to do with the business context or certain macro economic conditions or maybe it's just like for example, I was one of the first people to build an app in the app store.",
        "start": 250.0,
        "end": 269.0
    },
    {
        "text": " And the app was horrible, I promise you, it was a game that came out in iOS 3. And it got a lot of users only because there were only like a thousand other apps at the time.",
        "start": 269.0,
        "end": 282.0
    },
    {
        "text": " But my point is that way of thinking, thinking about what to build and why to build it, how to prioritize it.",
        "start": 282.0,
        "end": 293.0
    },
    {
        "text": " And the economic implications are of software to me was actually very quickly became more interesting to me than the software itself.",
        "start": 293.0,
        "end": 306.0
    },
    {
        "text": " And I also said I've never been a very good software engineer. And so I became more interested in what I what we would maybe say the product or the business side of it.",
        "start": 306.0,
        "end": 319.0
    },
    {
        "text": " That being said, I've been unique because I really can kind of speak both languages.",
        "start": 319.0,
        "end": 328.0
    },
    {
        "text": " And my my introduction to a hero guy and to collaborating with team members in South America was through a software agency or software factory.",
        "start": 328.0,
        "end": 346.0
    },
    {
        "text": " And we're going to come back to that term. I don't like the term software factory. And I'll tell you why later. So we'll come back to that. But my introduction to that was through an agency in multiple day and also with many offices in the US called root root strap.",
        "start": 346.0,
        "end": 370.0
    },
    {
        "text": " And this was many years ago. And I as a product manager manager and managing a project for a client in the US, I believe there was a few, but one of them was like universal music and others.",
        "start": 370.0,
        "end": 387.0
    },
    {
        "text": " And I would every day meet with the software team based in Montevideo. And I loved, but I mean virtually meet not and I loved working with the team there. And I was so impressed with the quality of not just engineering, but communication, character, teamwork.",
        "start": 387.0,
        "end": 415.0
    },
    {
        "text": " And of course, it's like the same time zone almost as the US. And so it became so clear to me through my work at root strap that, you know, I say South America, but specifically, you're a guy was a very special and attractive place to work with engineers and and partner with various.",
        "start": 415.0,
        "end": 444.0
    },
    {
        "text": " And so that was my introduction to to Iruguay and since then I actually really left the like software agency or software factory world. And I started an advertising technology company.",
        "start": 444.0,
        "end": 473.0
    },
    {
        "text": " And I worked with a few engineers in Iruguay to start help to help bring that to life initially. And then we ended up growing the company, open office in New York, I sold the company.",
        "start": 473.0,
        "end": 493.0
    },
    {
        "text": " And basically now I'm doing the same thing again, I'm starting another company. And the difference this time with the company I I work on today is we have full time team members in Latin America.",
        "start": 493.0,
        "end": 512.0
    },
    {
        "text": " And in the US, whereas before before the pandemic, I think there was a little bit more stigma or a little bit it was I think harder to have this idea that you're going to have a global team. And so I felt like, oh, I have to hire in the US. And I can maybe have some people help from from Iruguay or help from my software factory contacts were today at entry.",
        "start": 512.0,
        "end": 541.0
    },
    {
        "text": " My company we we have team members in Buenos Aires in Montevideo, etc, etc. So I really I think come to love building a global team, especially an especially hiring within Iruguay specifically.",
        "start": 542.0,
        "end": 568.0
    },
    {
        "text": " So I guess there's maybe a few few other things to share and then I'll hand it back to you all I was lucky enough to speak at kuti kuti last year, which was wonderful and I've I've visited Montevideo in Iruguay now three, four times.",
        "start": 568.0,
        "end": 597.0
    },
    {
        "text": " And I love I love going there I love the culture I love the beach and the coast.",
        "start": 597.0,
        "end": 607.0
    },
    {
        "text": " And yeah, I'm happy to kind of share share more about my my work and what what I do today, but I really don't want to talk your your your ears off and I want to let this be an open discussion.",
        "start": 607.0,
        "end": 626.0
    },
    {
        "text": " But overall like my my work experience has spanned from software factory working for other people startups.",
        "start": 626.0,
        "end": 638.0
    },
    {
        "text": " Founding my own software come stuff where startups selling it like I've kind of gone through all parts of that.",
        "start": 638.0,
        "end": 648.0
    },
    {
        "text": " I'm happy to share my perspective and my my thoughts with you all.",
        "start": 648.0,
        "end": 658.0
    },
    {
        "text": " Also, by the way guys remember that you can type any questions or comments that you have or of course you can open the neck on or raise your hand really be free for that.",
        "start": 658.0,
        "end": 672.0
    },
    {
        "text": " And if you want me to repeat something, if I'm speaking quickly and you want me to repeat, don't please don't be just ask.",
        "start": 672.0,
        "end": 685.0
    },
    {
        "text": " Yeah, I think we are good, but absolutely.",
        "start": 685.0,
        "end": 690.0
    },
    {
        "text": " Okay, so you already introduced yourself and also regarding your relation with your why and how it came to be.",
        "start": 690.0,
        "end": 700.0
    },
    {
        "text": " Another one of the questions that I that I had here, oh sorry Bruno.",
        "start": 700.0,
        "end": 706.0
    },
    {
        "text": " Go ahead.",
        "start": 706.0,
        "end": 708.0
    },
    {
        "text": " I just wanted to ask when comparing you to why like when choosing when we're where to expand your global team and where to hire engineers and whatnot.",
        "start": 708.0,
        "end": 721.0
    },
    {
        "text": " What makes you know why like a more attractive proposition regarding other countries that might actually like have the cheaper cost of living such as Argentina or Colombia or whatnot.",
        "start": 721.0,
        "end": 734.0
    },
    {
        "text": " That's an excellent question.",
        "start": 734.0,
        "end": 737.0
    },
    {
        "text": " So, so I would say, for a moment looking away from South South America, so just maybe comparing.",
        "start": 737.0,
        "end": 749.0
    },
    {
        "text": " I think that's an excellent question.",
        "start": 749.0,
        "end": 759.0
    },
    {
        "text": " Here are why to say this is actually a very real example.",
        "start": 759.0,
        "end": 763.0
    },
    {
        "text": " To pull, maybe Poland, one of the companies I'm involved with used to have their engineers in Eastern Europe.",
        "start": 763.0,
        "end": 766.0
    },
    {
        "text": " And they moved them to the air, why.",
        "start": 766.0,
        "end": 771.0
    },
    {
        "text": " There's a few reasons. The first is the time zone is so nice to be able to collaborate even with one or two time out one or two hour time difference versus six seven eight.",
        "start": 771.0,
        "end": 786.0
    },
    {
        "text": " The quality of communication.",
        "start": 786.0,
        "end": 792.0
    },
    {
        "text": " And then it's time to be so much stronger working with people in your why compared to certain other European countries and of course look no matter what there are exceptions to this and I'm speaking in in general terms.",
        "start": 792.0,
        "end": 810.0
    },
    {
        "text": " And comparing Bruno to other countries in South America, you know, and in the world, but but in South America, right there are cheaper places. We all know this.",
        "start": 810.0,
        "end": 823.0
    },
    {
        "text": " But there's not another country from our from our perspective that has the stability.",
        "start": 823.0,
        "end": 833.0
    },
    {
        "text": " The business environment that is understandable for foreign entities like, you know, in in in Argentina or Columbia or other places, the rules and how to enforce certain rules are.",
        "start": 833.0,
        "end": 860.0
    },
    {
        "text": " And it's very much much more difficult.",
        "start": 860.0,
        "end": 865.0
    },
    {
        "text": " So, I would say that's the lens.",
        "start": 865.0,
        "end": 870.0
    },
    {
        "text": " We look at it, I'd also say culturally like.",
        "start": 870.0,
        "end": 874.0
    },
    {
        "text": " I was just talking to someone about this a few weeks ago, like it's hard to to put into perfect words, but there is in my opinion, something that I think people in your why.",
        "start": 874.0,
        "end": 889.0
    },
    {
        "text": " I have in their approach to solving problems and to collaborating. I think that is that is more attractive and and more productive compared to other certain other regions.",
        "start": 889.0,
        "end": 909.0
    },
    {
        "text": " And, and dependent, you know, some businesses will pay or understand this and have no problem paying 20% more for say 80% more stability and peace of mind.",
        "start": 909.0,
        "end": 927.0
    },
    {
        "text": " Does that answer your question?",
        "start": 927.0,
        "end": 929.0
    },
    {
        "text": " Yeah, that makes a lot of sense.",
        "start": 929.0,
        "end": 932.0
    },
    {
        "text": " Also, if it's not that able or other American based companies that they only do business with your way as.",
        "start": 932.0,
        "end": 946.0
    },
    {
        "text": " Even already said already he also hires a couple of folks from Argentina or Columbia or Brazil.",
        "start": 946.0,
        "end": 954.0
    },
    {
        "text": " But I think it's it's it's good to to understand our kind of unique value proposition as a whole country.",
        "start": 954.0,
        "end": 965.0
    },
    {
        "text": " I'm talking.",
        "start": 965.0,
        "end": 968.0
    },
    {
        "text": " Hi, it's kind of a related question, but I want to know how do you see your why and talent compared to other countries is South America.",
        "start": 968.0,
        "end": 979.0
    },
    {
        "text": " Just yeah, from your perspective, how do you see that?",
        "start": 979.0,
        "end": 985.0
    },
    {
        "text": " Yeah, so maybe one way to answer that.",
        "start": 985.0,
        "end": 989.0
    },
    {
        "text": " And also to expand on my answer to Bruno's question is.",
        "start": 989.0,
        "end": 997.0
    },
    {
        "text": " What do I look for in.",
        "start": 997.0,
        "end": 1001.0
    },
    {
        "text": " In the talent evaluation process and what do I love from certain people we've worked with in.",
        "start": 1001.0,
        "end": 1012.0
    },
    {
        "text": " And one of those things is.",
        "start": 1012.0,
        "end": 1022.0
    },
    {
        "text": " Look, most engineers can can you give you can give them a Trello or a.",
        "start": 1022.0,
        "end": 1031.0
    },
    {
        "text": " level. But what makes I think some of the talent from Irwin",
        "start": 1031.0,
        "end": 1041.44
    },
    {
        "text": " better, and I would encourage you all also to aspire to get to",
        "start": 1041.44,
        "end": 1046.96
    },
    {
        "text": " this point, is to be able to think holistically about the",
        "start": 1046.96,
        "end": 1053.08
    },
    {
        "text": " product you are working on for the client or for the business.",
        "start": 1053.08,
        "end": 1057.24
    },
    {
        "text": " And and take a step back from the code, take a step back from the",
        "start": 1058.2,
        "end": 1068.32
    },
    {
        "text": " ticket that was assigned to you. And actually think why? And",
        "start": 1068.32,
        "end": 1074.64
    },
    {
        "text": " what are if I just do this as it's been put out what type of",
        "start": 1074.64,
        "end": 1079.24
    },
    {
        "text": " issues may I run into? Then be able to communicate that to",
        "start": 1079.24,
        "end": 1085.16
    },
    {
        "text": " whomever it is that you're working with. Those are the things",
        "start": 1085.5600000000002,
        "end": 1088.88
    },
    {
        "text": " that take some, you know, maybe a team member from good to",
        "start": 1089.8000000000002,
        "end": 1097.64
    },
    {
        "text": " great. And those are the things that make it attractive to",
        "start": 1097.64,
        "end": 1102.72
    },
    {
        "text": " higher from Irwin, thinking knowing that we think or I think",
        "start": 1103.16,
        "end": 1108.68
    },
    {
        "text": " will be a higher chance that someone is like that. Not just",
        "start": 1109.24,
        "end": 1114.0800000000002
    },
    {
        "text": " being a, I don't know if this translates well, but like a",
        "start": 1114.08,
        "end": 1119.56
    },
    {
        "text": " mindless sheep. I don't know if there's a, yeah. And really",
        "start": 1119.56,
        "end": 1126.3999999999999
    },
    {
        "text": " being able to, to, yeah, to think about what you're actually",
        "start": 1127.84,
        "end": 1132.3999999999999
    },
    {
        "text": " building and ask questions and engage with that. I was a",
        "start": 1132.3999999999999,
        "end": 1135.28
    },
    {
        "text": " think that that goes back to the culture, cultural aspect.",
        "start": 1135.28,
        "end": 1139.08
    },
    {
        "text": " Because in, in, of course, as you said, in general, we don't have",
        "start": 1139.32,
        "end": 1143.72
    },
    {
        "text": " much problem in raising our hands and say, Hey, sorry, but I don't",
        "start": 1143.72,
        "end": 1148.04
    },
    {
        "text": " agree with that because yeah, yeah, yeah, yeah, yeah, and why don't",
        "start": 1148.04,
        "end": 1150.8799999999999
    },
    {
        "text": " we blah, blah, blah, blah, and be more proactive. So it's not",
        "start": 1150.8799999999999,
        "end": 1154.72
    },
    {
        "text": " necessarily of the technical aspects that might differentiate us",
        "start": 1154.72,
        "end": 1160.08
    },
    {
        "text": " but all these other kind of soft aspects.",
        "start": 1160.08,
        "end": 1163.72
    },
    {
        "text": " Exactly.",
        "start": 1164.72,
        "end": 1167.4
    },
    {
        "text": " Great. Okay. Thank you for your answer.",
        "start": 1169.6000000000001,
        "end": 1172.84
    },
    {
        "text": " Thank you, I will continue with a couple of questions that I have",
        "start": 1173.96,
        "end": 1178.28
    },
    {
        "text": " here, but please guys feel free to, to continue asking whenever",
        "start": 1178.28,
        "end": 1182.28
    },
    {
        "text": " you want. I wonder, how would you describe the importance of IT",
        "start": 1182.28,
        "end": 1189.1200000000001
    },
    {
        "text": " outsourcing to the US? Why it is so important that the US",
        "start": 1189.12,
        "end": 1194.56
    },
    {
        "text": " outsources IT in general?",
        "start": 1195.2399999999998,
        "end": 1197.84
    },
    {
        "text": " Well, and also if you want to, to comment something on the, maybe",
        "start": 1199.4399999999998,
        "end": 1202.9599999999998
    },
    {
        "text": " the current situation, but that's, that's not necessarily.",
        "start": 1202.9599999999998,
        "end": 1205.9199999999998
    },
    {
        "text": " So",
        "start": 1206.52,
        "end": 1207.2399999999998
    },
    {
        "text": " because of course, you guys also have great talent. As a country,",
        "start": 1209.04,
        "end": 1214.3999999999999
    },
    {
        "text": " but why you need to do this, right? Yeah. So I think",
        "start": 1214.4399999999998,
        "end": 1218.6
    },
    {
        "text": " we do obviously we do have great talent. I think it's a, the",
        "start": 1219.8,
        "end": 1227.9599999999998
    },
    {
        "text": " reality is we have more demand than we do supply. And a good",
        "start": 1227.9599999999998,
        "end": 1238.76
    },
    {
        "text": " amount of the supply goes to a big technology companies like",
        "start": 1238.76,
        "end": 1245.9199999999998
    },
    {
        "text": " Google or Facebook, which are hard to compete with with",
        "start": 1246.8000000000002,
        "end": 1255.1200000000001
    },
    {
        "text": " compensation, but also the type of people that want to work at",
        "start": 1255.96,
        "end": 1261.76
    },
    {
        "text": " Google are probably not always a good fit to work at a smaller",
        "start": 1261.76,
        "end": 1267.88
    },
    {
        "text": " company. It's a very different, it's not better or worse,",
        "start": 1267.88,
        "end": 1272.3600000000001
    },
    {
        "text": " it's just a different mindset. But I think, so I think, you",
        "start": 1272.36,
        "end": 1282.9199999999998
    },
    {
        "text": " know, there's again, a, a, a lack of, there's a lot of demand",
        "start": 1282.9199999999998,
        "end": 1288.8
    },
    {
        "text": " and not enough supply. That's part, part one, I think part two",
        "start": 1289.28,
        "end": 1294.76
    },
    {
        "text": " is the good supply very quickly gets sometimes snapped up. And it",
        "start": 1295.16,
        "end": 1303.36
    },
    {
        "text": " can be really hard to compete on the price of those engineers.",
        "start": 1303.36,
        "end": 1311.12
    },
    {
        "text": " Yeah, I don't know. And then I'd say, I think the other thing",
        "start": 1316.0,
        "end": 1320.12
    },
    {
        "text": " we need to think about is when we say IT outsourcing or, or, which",
        "start": 1320.12,
        "end": 1325.8
    },
    {
        "text": " or, or, or, or near short development, or these terms, what",
        "start": 1326.7199999999998,
        "end": 1332.9599999999998
    },
    {
        "text": " that means to the, to a US company, completely changes to",
        "start": 1332.9599999999998,
        "end": 1340.4399999999998
    },
    {
        "text": " paste, depending on the type of company, completely like, like",
        "start": 1340.4399999999998,
        "end": 1345.32
    },
    {
        "text": " for a, a, maybe like, mid stage, startup, or, or medium size",
        "start": 1345.96,
        "end": 1355.9199999999998
    },
    {
        "text": " company that is in technology, that looks very different than",
        "start": 1355.9199999999998,
        "end": 1360.6
    },
    {
        "text": " maybe a old shoe company that needs to redesign their website. And",
        "start": 1361.56,
        "end": 1367.52
    },
    {
        "text": " so I think that's another I'd say is, is well, let's be careful",
        "start": 1367.52,
        "end": 1372.48
    },
    {
        "text": " to, to acknowledge and understand that those things take many",
        "start": 1373.0,
        "end": 1379.32
    },
    {
        "text": " different shapes.",
        "start": 1379.32,
        "end": 1381.2
    },
    {
        "text": " Yeah, that's a good point. And I think that in general, what we see",
        "start": 1384.64,
        "end": 1388.76
    },
    {
        "text": " down here is other IT firms or tech firms, asking for our services,",
        "start": 1389.08,
        "end": 1398.2
    },
    {
        "text": " is not that common to have like, and clients or final clients,",
        "start": 1398.2,
        "end": 1402.92
    },
    {
        "text": " knocking our door.",
        "start": 1404.0800000000002,
        "end": 1405.52
    },
    {
        "text": " And I would say I think that you could get there at some point.",
        "start": 1408.52,
        "end": 1412.1200000000001
    },
    {
        "text": " But that's maybe a separate conversation. I think also the",
        "start": 1415.04,
        "end": 1422.32
    },
    {
        "text": " macro economic kind of things in the US.",
        "start": 1422.32,
        "end": 1426.3600000000001
    },
    {
        "text": " It's interesting. I, I, I'm not an economic expert of, but what I",
        "start": 1427.36,
        "end": 1434.56
    },
    {
        "text": " will say is from my perspective, for the time being, the overall US",
        "start": 1434.56,
        "end": 1441.52
    },
    {
        "text": " economy is actually very strong right now. However, I do, there is a",
        "start": 1441.52,
        "end": 1448.08
    },
    {
        "text": " what I would call a software correction.",
        "start": 1448.08,
        "end": 1450.84
    },
    {
        "text": " Meaning, I think there was a lot of software companies and",
        "start": 1451.84,
        "end": 1460.04
    },
    {
        "text": " technology companies that were overvalued. They were hiring too",
        "start": 1460.04,
        "end": 1466.24
    },
    {
        "text": " much. And there's this big correction. And I'm sure you're",
        "start": 1466.24,
        "end": 1472.24
    },
    {
        "text": " feeling that in, in, in your way. Now that being said, I do",
        "start": 1472.24,
        "end": 1478.24
    },
    {
        "text": " believe the overall US economy right now is, is quite strong,",
        "start": 1478.24,
        "end": 1483.1200000000001
    },
    {
        "text": " especially compared to, I think, the European or other segments",
        "start": 1483.36,
        "end": 1488.48
    },
    {
        "text": " of the global economy. And, and I think this as much as it might",
        "start": 1488.48,
        "end": 1495.8
    },
    {
        "text": " hurt, I really believe the software correction is a, is a very",
        "start": 1495.84,
        "end": 1501.64
    },
    {
        "text": " necessary thing. And it's actually really healthy thing, because",
        "start": 1501.64,
        "end": 1507.96
    },
    {
        "text": " it was not sustainable or rational. The way it was before.",
        "start": 1508.1200000000001,
        "end": 1513.52
    },
    {
        "text": " Yeah, I think that, especially during and after the pandemic, it",
        "start": 1514.4,
        "end": 1519.92
    },
    {
        "text": " kind of went to a hype mode. And maybe now it, the, the, the",
        "start": 1519.92,
        "end": 1526.2
    },
    {
        "text": " balloon was pinched a bit of it.",
        "start": 1526.2,
        "end": 1528.44
    },
    {
        "text": " Yeah.",
        "start": 1529.44,
        "end": 1530.44
    },
    {
        "text": " Quoting go ahead.",
        "start": 1532.44,
        "end": 1534.44
    },
    {
        "text": " Yeah, maybe this is like a question for like an economic",
        "start": 1535.44,
        "end": 1539.64
    },
    {
        "text": " person, but I think it's related to this because talking about",
        "start": 1539.64,
        "end": 1543.3200000000002
    },
    {
        "text": " the macro economic situation of the United States, like the FED",
        "start": 1543.3200000000002,
        "end": 1548.1200000000001
    },
    {
        "text": " keeping the interest rates up. And what it means to start",
        "start": 1548.1200000000001,
        "end": 1553.44
    },
    {
        "text": " with, and we're going to, how do you see that? And how it",
        "start": 1553.44,
        "end": 1558.24
    },
    {
        "text": " affects us?",
        "start": 1558.24,
        "end": 1559.04
    },
    {
        "text": " Yeah, that's a great, great question. So, I mean, overall, like,",
        "start": 1561.8,
        "end": 1570.64
    },
    {
        "text": " and if I'm, this is going too far, down a direction for,",
        "start": 1570.68,
        "end": 1575.88
    },
    {
        "text": " Professor, feel free to help me out. Overall, right? Like, when,",
        "start": 1576.0,
        "end": 1580.56
    },
    {
        "text": " when the interest rates are low, when we say interest rates,",
        "start": 1580.56,
        "end": 1588.36
    },
    {
        "text": " what that really means is the risk free rate, right? That's",
        "start": 1588.52,
        "end": 1591.9199999999998
    },
    {
        "text": " effectively, whatever that the US treasury bonds are at, it's,",
        "start": 1591.9199999999998,
        "end": 1597.72
    },
    {
        "text": " the US government is saying we will, let's say interest rates",
        "start": 1597.96,
        "end": 1601.0
    },
    {
        "text": " are 3%, the government is saying, if you give us money, we will",
        "start": 1601.0,
        "end": 1606.04
    },
    {
        "text": " give you 3%, effectively for zero risk. The only risk is the US",
        "start": 1606.04,
        "end": 1611.6399999999999
    },
    {
        "text": " defaults on its debt, which has never happened. And so it's",
        "start": 1612.04,
        "end": 1616.96
    },
    {
        "text": " considered as minimal risk as possible. So let's say you have",
        "start": 1616.96,
        "end": 1621.72
    },
    {
        "text": " interest rates at 0%, or 1%, and that is the risk free rate. All",
        "start": 1621.76,
        "end": 1630.04
    },
    {
        "text": " the sudden, a 5% return is like looks really good. And so what",
        "start": 1630.04,
        "end": 1639.28
    },
    {
        "text": " that means is a venture capital fund or a private equity fund",
        "start": 1639.28,
        "end": 1644.6399999999999
    },
    {
        "text": " that is investing in software companies can look even better",
        "start": 1644.76,
        "end": 1651.48
    },
    {
        "text": " compared to the risk free rate. And so for them to justify",
        "start": 1651.6,
        "end": 1658.2
    },
    {
        "text": " their their returns, they can invest at higher evaluations, they",
        "start": 1658.6000000000001,
        "end": 1665.0800000000002
    },
    {
        "text": " can invest in more money with more money. Now, what happened",
        "start": 1665.0800000000002,
        "end": 1669.92
    },
    {
        "text": " is right, the interest rate shut up to, I don't know, I don't",
        "start": 1669.92,
        "end": 1675.96
    },
    {
        "text": " know, I can call it somewhere roughly 5% and all the sudden",
        "start": 1675.96,
        "end": 1682.56
    },
    {
        "text": " to justify a high risk, you know, like a venture capital",
        "start": 1682.6,
        "end": 1688.32
    },
    {
        "text": " portfolio, you know, delivering 7 or 8% returns is not enough.",
        "start": 1688.32,
        "end": 1694.48
    },
    {
        "text": " You need to deliver 20% or more, because as a reminder, and this",
        "start": 1695.52,
        "end": 1700.52
    },
    {
        "text": " is again, a separate topic, vent vent, we could do a separate",
        "start": 1700.52,
        "end": 1704.56
    },
    {
        "text": " call on the economic. Yeah, venture capital, but like the VC",
        "start": 1704.56,
        "end": 1710.76
    },
    {
        "text": " firms that invest in software, they have their own investors.",
        "start": 1711.04,
        "end": 1717.48
    },
    {
        "text": " And so they need to justify what they're doing to their",
        "start": 1718.0,
        "end": 1720.96
    },
    {
        "text": " investors. And those investors are like big institutions, like",
        "start": 1720.96,
        "end": 1725.8799999999999
    },
    {
        "text": " like a university, private university endowment or a foreign",
        "start": 1726.2,
        "end": 1731.92
    },
    {
        "text": " government. And they don't have any liquidity when they invest",
        "start": 1731.92,
        "end": 1736.6
    },
    {
        "text": " in a fund, they're giving the money for 10 years. And then they",
        "start": 1736.6,
        "end": 1741.1999999999998
    },
    {
        "text": " wait 10 years. So if I'm going to wait 10 years and lose my",
        "start": 1741.1999999999998,
        "end": 1746.12
    },
    {
        "text": " access to money, you better be beating the risk free rate by a",
        "start": 1746.12,
        "end": 1751.28
    },
    {
        "text": " hell of a lot more. And so that's how the global picture of",
        "start": 1751.28,
        "end": 1755.6799999999998
    },
    {
        "text": " these interest rates causes a ripple effect, a downstream",
        "start": 1755.6799999999998,
        "end": 1761.4399999999998
    },
    {
        "text": " effect on the money going to technology startups.",
        "start": 1761.56,
        "end": 1768.64
    },
    {
        "text": " I hope that wasn't like. Yeah, I think it was a short but",
        "start": 1771.04,
        "end": 1776.76
    },
    {
        "text": " overall answer. Thank you.",
        "start": 1776.76,
        "end": 1780.3200000000002
    },
    {
        "text": " Okay, we'll put it on another question. What would you say",
        "start": 1783.56,
        "end": 1789.4
    },
    {
        "text": " US firms are looking for when partnering with a near",
        "start": 1789.4,
        "end": 1793.96
    },
    {
        "text": " short team?",
        "start": 1793.96,
        "end": 1794.88
    },
    {
        "text": " Yeah. So I'm going to say something maybe a little bit",
        "start": 1796.3600000000001,
        "end": 1799.2
    },
    {
        "text": " controversial. Okay. So so you know, obviously this is my",
        "start": 1799.2,
        "end": 1805.0
    },
    {
        "text": " opinion. But I really think most like savvy, most technology",
        "start": 1805.0,
        "end": 1810.8000000000002
    },
    {
        "text": " firms in the US when they're looking for a firms in Uruguay, they",
        "start": 1810.8000000000002,
        "end": 1816.96
    },
    {
        "text": " don't want to hear IT firm. I acknowledge that that is a sure",
        "start": 1816.96,
        "end": 1823.8400000000001
    },
    {
        "text": " that's a description. But but in the US, like when when you IT",
        "start": 1823.8400000000001,
        "end": 1828.44
    },
    {
        "text": " firm or or even the term software factory, it creates this",
        "start": 1828.44,
        "end": 1833.16
    },
    {
        "text": " image that is not attractive to a US company. And I've talked to",
        "start": 1833.2,
        "end": 1843.04
    },
    {
        "text": " other like Asians, you know, companies in Uruguay about this",
        "start": 1843.04,
        "end": 1845.68
    },
    {
        "text": " like really, I think removing the idea, the term software",
        "start": 1845.68,
        "end": 1850.44
    },
    {
        "text": " factory and for even IT, even the term IT is will help a lot in",
        "start": 1850.44,
        "end": 1862.2
    },
    {
        "text": " terms of marketing and talking about yourself. I think a better",
        "start": 1862.2,
        "end": 1865.8
    },
    {
        "text": " way to talk about it is talking about the developers and",
        "start": 1865.8,
        "end": 1872.0800000000002
    },
    {
        "text": " talking about the talent and processes and maybe saying",
        "start": 1872.08,
        "end": 1879.1999999999998
    },
    {
        "text": " you know, we're hiring a.",
        "start": 1879.1999999999998,
        "end": 1880.8799999999999
    },
    {
        "text": " A sought you know software agency is is I think fine and",
        "start": 1885.6,
        "end": 1889.1599999999999
    },
    {
        "text": " probably a better term. But I know when I talk with others and",
        "start": 1889.1599999999999,
        "end": 1893.1599999999999
    },
    {
        "text": " I hear. IT firm or even or even the word outsourced. Even the",
        "start": 1893.96,
        "end": 1901.8799999999999
    },
    {
        "text": " word outsourced creates. Yeah, and I agree it's a it's a",
        "start": 1901.88,
        "end": 1906.4
    },
    {
        "text": " correct description. Yeah, exactly. I think that and please",
        "start": 1906.4,
        "end": 1910.48
    },
    {
        "text": " correct me. But I think that even though it's like all these",
        "start": 1910.48,
        "end": 1913.64
    },
    {
        "text": " terms are like technically correct, they they they are",
        "start": 1913.64,
        "end": 1919.1200000000001
    },
    {
        "text": " interpretive in the mind of the potential buyer of the",
        "start": 1919.68,
        "end": 1924.6000000000001
    },
    {
        "text": " prospect interpreted as oh like lower quality, huge factor.",
        "start": 1924.6000000000001,
        "end": 1931.5200000000002
    },
    {
        "text": " Exactly. Huge software factory and maybe even resembles them to",
        "start": 1931.52,
        "end": 1938.08
    },
    {
        "text": " other parts of the world that we actually want to actively be",
        "start": 1938.08,
        "end": 1941.4
    },
    {
        "text": " differentiated. Exactly. That's exactly right. Great. Now",
        "start": 1941.4,
        "end": 1947.72
    },
    {
        "text": " yeah, go ahead. Hi. Yeah, I actually was going to ask you",
        "start": 1947.72,
        "end": 1952.48
    },
    {
        "text": " because you mentioned it earlier that you didn't want to go",
        "start": 1952.48,
        "end": 1955.68
    },
    {
        "text": " to the software factory and I was wondering I just can understand",
        "start": 1955.68,
        "end": 1962.16
    },
    {
        "text": " quite right why because this is a term that we usually use.",
        "start": 1962.16,
        "end": 1966.3200000000002
    },
    {
        "text": " Is it like it's demoting like in a humanitarian way like",
        "start": 1967.3200000000002,
        "end": 1971.96
    },
    {
        "text": " factory with people that develops over? Yeah, that's that's part",
        "start": 1972.3600000000001,
        "end": 1976.92
    },
    {
        "text": " of it, right? The other yes, part of it is there's a negative",
        "start": 1976.92,
        "end": 1982.44
    },
    {
        "text": " connotation or reaction to people working in a factory. It's",
        "start": 1983.0800000000002,
        "end": 1988.64
    },
    {
        "text": " an emotional reaction. And then also I my product is unique. I",
        "start": 1988.64,
        "end": 1994.8400000000001
    },
    {
        "text": " don't want it to come out of a factory is the other right",
        "start": 1994.8400000000001,
        "end": 1998.04
    },
    {
        "text": " like yeah, and and so I think that's and I know it's really",
        "start": 1998.04,
        "end": 2005.28
    },
    {
        "text": " common to use this term in your why and I understand why, but",
        "start": 2005.28,
        "end": 2009.8
    },
    {
        "text": " I really really really strongly believe that if every software",
        "start": 2010.08,
        "end": 2015.96
    },
    {
        "text": " agency in EURY removed this term, their business will increase.",
        "start": 2015.96,
        "end": 2019.8
    },
    {
        "text": " We might do we might do better better. Yeah, no, it's I have",
        "start": 2020.44,
        "end": 2027.3999999999999
    },
    {
        "text": " another question and I don't know if that one need to it's kind",
        "start": 2027.3999999999999,
        "end": 2032.2
    },
    {
        "text": " of a personal question and I don't know if it's the right time",
        "start": 2032.2,
        "end": 2036.76
    },
    {
        "text": " to ask. And in terms of your personal development, did you",
        "start": 2036.76,
        "end": 2046.12
    },
    {
        "text": " have like years ago some determined goals that lead you the way",
        "start": 2046.12,
        "end": 2051.08
    },
    {
        "text": " the place you are right now and did you make like a specific",
        "start": 2051.6,
        "end": 2055.44
    },
    {
        "text": " career plan or maybe your experience was leading you itself to",
        "start": 2055.44,
        "end": 2062.16
    },
    {
        "text": " place you are right now. I just want like to know we don't have",
        "start": 2062.16,
        "end": 2067.92
    },
    {
        "text": " much opportunities to have this kind of conversation with CEOs",
        "start": 2068.16,
        "end": 2073.3599999999997
    },
    {
        "text": " and stuff. So that's interesting to know the path on what they",
        "start": 2073.3599999999997,
        "end": 2078.3999999999996
    },
    {
        "text": " did actually to reach this point.",
        "start": 2078.3999999999996,
        "end": 2080.7599999999998
    },
    {
        "text": " Yeah, I it's an excellent question. The short answer is no, I",
        "start": 2082.24,
        "end": 2090.0
    },
    {
        "text": " don't think I was like super intentional and I like, okay, I'm going",
        "start": 2090.56,
        "end": 2093.92
    },
    {
        "text": " to do this for two years and this for four or whatever. I think",
        "start": 2093.92,
        "end": 2101.2
    },
    {
        "text": " the reality is my my North Star, what I've always been going to is",
        "start": 2101.2,
        "end": 2107.84
    },
    {
        "text": " just been I want to build things that solve problems that are",
        "start": 2107.84,
        "end": 2113.52
    },
    {
        "text": " interesting to me. And I want to do that in a way that is",
        "start": 2113.52,
        "end": 2116.72
    },
    {
        "text": " economically advantageous, right? Like that can support itself.",
        "start": 2116.72,
        "end": 2121.4399999999996
    },
    {
        "text": " And I think naturally my skill sets over time both through software",
        "start": 2123.4399999999996,
        "end": 2129.9199999999996
    },
    {
        "text": " and then other things have led me to this. But I think what I've",
        "start": 2129.9199999999996,
        "end": 2134.64
    },
    {
        "text": " always just my goal has always been to to identify and solve",
        "start": 2134.64,
        "end": 2140.3999999999996
    },
    {
        "text": " problems. And I've been fortunate that I think other people have",
        "start": 2140.4,
        "end": 2146.96
    },
    {
        "text": " identified have had have had given the opportunities and identified",
        "start": 2146.96,
        "end": 2152.7200000000003
    },
    {
        "text": " me as someone they can invest in and so I've definitely been helped by",
        "start": 2153.84,
        "end": 2159.6800000000003
    },
    {
        "text": " other people a lot.",
        "start": 2159.6800000000003,
        "end": 2163.52
    },
    {
        "text": " So, you know, that being said, my like my my story and experience is unique.",
        "start": 2164.4,
        "end": 2172.96
    },
    {
        "text": " I think you could talk to someone else that is just as interesting",
        "start": 2172.96,
        "end": 2178.64
    },
    {
        "text": " if not more. And they might say, yeah, my plan was this, this, and this.",
        "start": 2178.64,
        "end": 2184.56
    },
    {
        "text": " So I don't think there's one there's not one way.",
        "start": 2184.56,
        "end": 2186.88
    },
    {
        "text": " Okay. Thank you.",
        "start": 2187.12,
        "end": 2189.92
    },
    {
        "text": " Oh, well, I have another question.",
        "start": 2189.92,
        "end": 2191.92
    },
    {
        "text": " When building a startup, which I buy, would you give us?",
        "start": 2195.44,
        "end": 2200.96
    },
    {
        "text": " For example, like some key things to do and when even in times of like",
        "start": 2201.6800000000003,
        "end": 2208.48
    },
    {
        "text": " presenting a business plan. Yeah.",
        "start": 2208.56,
        "end": 2212.4
    },
    {
        "text": " Yeah. So I see every business and every startup as a thesis, like a science",
        "start": 2212.4,
        "end": 2223.36
    },
    {
        "text": " experiment. And your job is to effectively validate or invalidate",
        "start": 2224.64,
        "end": 2230.0
    },
    {
        "text": " that hypothesis as efficiently, both in terms of money and time as possible.",
        "start": 2231.12,
        "end": 2237.84
    },
    {
        "text": " And so, for example, I think a lot of them, the talented young engineers,",
        "start": 2238.88,
        "end": 2246.56
    },
    {
        "text": " their first instinct is to actually start building.",
        "start": 2248.2400000000002,
        "end": 2252.08
    },
    {
        "text": " And that's actually the wrong instinct because what you have is your thesis.",
        "start": 2253.36,
        "end": 2261.68
    },
    {
        "text": " You know, I believe that X group of people will buy or respond or do",
        "start": 2261.68,
        "end": 2268.3199999999997
    },
    {
        "text": " why based on this potential thing.",
        "start": 2270.48,
        "end": 2273.44
    },
    {
        "text": " And I think the most important thing is to go out and do your best to understand",
        "start": 2274.48,
        "end": 2279.8399999999997
    },
    {
        "text": " those people and how they would, they might react to your thing.",
        "start": 2281.04,
        "end": 2289.3599999999997
    },
    {
        "text": " And now look, there's obviously many different philosophies on this.",
        "start": 2289.36,
        "end": 2293.44
    },
    {
        "text": " Right. Some people would say, oh, if you asked people, if Henry Ford asked people if they wanted,",
        "start": 2293.44,
        "end": 2300.96
    },
    {
        "text": " what they wanted, they would just say a faster horse. Right. That's like a very classic kind of",
        "start": 2300.96,
        "end": 2307.2000000000003
    },
    {
        "text": " counter argument. Well, a car is a faster horse would be my response to that. So,",
        "start": 2307.2000000000003,
        "end": 2313.6800000000003
    },
    {
        "text": " I guess that's my way of saying like, understand the people you think are your building for.",
        "start": 2314.48,
        "end": 2323.12
    },
    {
        "text": " And maybe you realize I'm either building the wrong thing or I'm building the right thing for",
        "start": 2323.12,
        "end": 2330.0
    },
    {
        "text": " the wrong group of people. So do that before you start trying to build. The second piece of advice I",
        "start": 2330.0,
        "end": 2341.6
    },
    {
        "text": " would have is revenue. So sales revenue, do you use the term turnover?",
        "start": 2341.6,
        "end": 2350.56
    },
    {
        "text": " Not on rate. Sales and revenue are the number one way",
        "start": 2352.7999999999997,
        "end": 2362.48
    },
    {
        "text": " to measure how effectively did you solve the problem you wanted to solve. Like,",
        "start": 2362.72,
        "end": 2371.6
    },
    {
        "text": " it's easy for someone to say, yeah, this looks great. But when you say, okay, we'll give me $100",
        "start": 2372.8,
        "end": 2379.52
    },
    {
        "text": " for it. It gets real, really fast. Or even $2.",
        "start": 2379.52,
        "end": 2384.16
    },
    {
        "text": " Or right. So I think the faster you can get yourself to that point where you're asking,",
        "start": 2384.8799999999997,
        "end": 2393.6
    },
    {
        "text": " even if you're not like, even if the product isn't 100% there, you will learn a lot more and get",
        "start": 2393.6,
        "end": 2400.3199999999997
    },
    {
        "text": " a lot more insight by forcing yourself to have that conversation. And also, let me maybe,",
        "start": 2400.3199999999997,
        "end": 2405.6
    },
    {
        "text": " this is an appropriate time, hopefully, for me to add. I would encourage everyone to",
        "start": 2406.3199999999997,
        "end": 2412.96
    },
    {
        "text": " encourage everyone to think about how does Iruguay build more product-based software companies?",
        "start": 2414.3199999999997,
        "end": 2424.08
    },
    {
        "text": " Or startups with IP? For example, I would encourage everyone to think about how",
        "start": 2424.08,
        "end": 2432.08
    },
    {
        "text": " does Iruguay build more product-based software companies? Or startups with IP? For example,",
        "start": 2432.16,
        "end": 2444.16
    },
    {
        "text": " Atlassian, which owns Jira and many others, they're based in Australia. It was an Australian group",
        "start": 2444.72,
        "end": 2451.68
    },
    {
        "text": " of developers that did that. There are many other examples. And so I think for Iruguay to",
        "start": 2452.56,
        "end": 2460.16
    },
    {
        "text": " really remain excellent and competitive in the world. In the long run, it's very important that",
        "start": 2462.24,
        "end": 2469.2
    },
    {
        "text": " it's not just software agencies, but some software agencies and some Atlassians or software solutions as well.",
        "start": 2469.2,
        "end": 2478.4
    },
    {
        "text": " Yeah, and also, by the way, afterwards, I will put a link to Abe's talk last year at the",
        "start": 2480.48,
        "end": 2488.7999999999997
    },
    {
        "text": " Coody Business Forum that revolves around those topics, right?",
        "start": 2488.8,
        "end": 2494.1600000000003
    },
    {
        "text": " Okay, any other questions for now? Justine, guys, we have around 10 more minutes because",
        "start": 2501.6000000000004,
        "end": 2509.76
    },
    {
        "text": " Abe has another things to do, so we will go up until 7 p.m. our time.",
        "start": 2509.76,
        "end": 2515.76
    },
    {
        "text": " It's believe it or not. It's my, the reason I have to go earlier is my mother's birthday.",
        "start": 2517.6000000000004,
        "end": 2522.96
    },
    {
        "text": " Otherwise, that's important. That's why I'm on a tighter schedule.",
        "start": 2523.5200000000004,
        "end": 2528.5600000000004
    },
    {
        "text": " Absolutely important. Yeah. Okay, so actually you're already answered one of the other questions",
        "start": 2528.5600000000004,
        "end": 2534.96
    },
    {
        "text": " it was about your suggestions to your website industry in general, which is not correct me if I",
        "start": 2535.84,
        "end": 2541.92
    },
    {
        "text": " wrong, roughly tried not only to continue doing services, but also add IP and try to",
        "start": 2541.92,
        "end": 2550.96
    },
    {
        "text": " to scale above hiring more and more people.",
        "start": 2552.7200000000003,
        "end": 2556.32
    },
    {
        "text": " I have another question. How would you describe how your way as a country is seen in the",
        "start": 2556.4,
        "end": 2571.28
    },
    {
        "text": " overall mentality of an American example? Do you think we have some kind of kind of",
        "start": 2571.28,
        "end": 2578.4
    },
    {
        "text": " brand recognition or not yet there? What's our take on that? Yeah, I think.",
        "start": 2578.4,
        "end": 2586.32
    },
    {
        "text": " Well, do you mean within overall or within software in particular?",
        "start": 2588.4,
        "end": 2592.1600000000003
    },
    {
        "text": " Whatever, like maybe maybe with a software or with an intek. I think so.",
        "start": 2593.52,
        "end": 2600.1600000000003
    },
    {
        "text": " I mean, if you say your way to to a friend of yours that is.",
        "start": 2600.16,
        "end": 2606.48
    },
    {
        "text": " Yeah, I think this is the sad, super sad on it, honest truth. So I think for most people in the US,",
        "start": 2608.72,
        "end": 2616.16
    },
    {
        "text": " which overall, this is also because people in the US don't know where anything is.",
        "start": 2616.16,
        "end": 2621.3599999999997
    },
    {
        "text": " A lot of them wouldn't be able to find your why on Mac. It's like the right, which is just the",
        "start": 2622.3999999999996,
        "end": 2628.16
    },
    {
        "text": " reality. Now within technology, I think when I first started working with people in Uruguay,",
        "start": 2628.16,
        "end": 2636.56
    },
    {
        "text": " I would say the brand recognition within software was maybe one out of 10.",
        "start": 2636.56,
        "end": 2641.8399999999997
    },
    {
        "text": " People were like, oh, why? People would ask why Uruguay? Why is that? Right? I think now,",
        "start": 2643.04,
        "end": 2649.2
    },
    {
        "text": " actually, it's especially with the pandemic, normalizing some of the",
        "start": 2649.2799999999997,
        "end": 2655.68
    },
    {
        "text": " global teams. It has garnered a started to get a better or more more known reputation. Maybe it went",
        "start": 2656.8799999999997,
        "end": 2667.4399999999996
    },
    {
        "text": " from like one out of 10 in terms of its brand awareness to I don't know maybe a four or five.",
        "start": 2667.4399999999996,
        "end": 2677.8399999999997
    },
    {
        "text": " So it's achievable. That's a lot. Maybe I don't know. Yeah, it's kind of subjective,",
        "start": 2677.92,
        "end": 2684.7200000000003
    },
    {
        "text": " right? But in what period when you say when you start working with us down here, it's like",
        "start": 2684.7200000000003,
        "end": 2692.32
    },
    {
        "text": " 10 years, or less than that? Or five years, say five years. I don't know, five, six years. I guess,",
        "start": 2692.32,
        "end": 2698.1600000000003
    },
    {
        "text": " you know, look, it's maybe five is too much, but I guess my point is it is without a doubt",
        "start": 2698.16,
        "end": 2706.56
    },
    {
        "text": " accelerating in terms of its awareness. But you're right, it has a long way to go still.",
        "start": 2707.2,
        "end": 2713.7599999999998
    },
    {
        "text": " It's not like, I think East, for example, like parts of Eastern Europe, I think maybe you're still",
        "start": 2715.68,
        "end": 2723.12
    },
    {
        "text": " more commonly thought of as a place to work with developers. But that's changing. I do really think",
        "start": 2723.12,
        "end": 2738.3199999999997
    },
    {
        "text": " that's changing. There's also a lot more software tools now, right? Like for hiring and",
        "start": 2738.96,
        "end": 2744.4
    },
    {
        "text": " companies like remote.com or DEL, D-E-E-L.com, like different systems to help manage",
        "start": 2744.4,
        "end": 2752.64
    },
    {
        "text": " teams globally. So I think that's helped accelerate a lot. Yeah.",
        "start": 2753.92,
        "end": 2762.2400000000002
    },
    {
        "text": " Awesome. Okay, so we are nearing the end of this class. So you're ready. Oh, Emilio, go ahead.",
        "start": 2763.2,
        "end": 2775.4399999999996
    },
    {
        "text": " Yeah, one last question. It's about how you conform these global teams because to my understanding,",
        "start": 2775.4399999999996,
        "end": 2783.3599999999997
    },
    {
        "text": " the people can work like in I'm going to say the prohibited work in software factories here in",
        "start": 2783.3599999999997,
        "end": 2789.52
    },
    {
        "text": " New York. And like, there you have a team already. And when you outsource, you're paying like",
        "start": 2790.16,
        "end": 2796.24
    },
    {
        "text": " another company which with all the developers and stuff. But you could also hire the developer",
        "start": 2796.96,
        "end": 2804.16
    },
    {
        "text": " like more directly, right? And in that sense, like what are some common channels, let's say,",
        "start": 2804.16,
        "end": 2811.44
    },
    {
        "text": " for you to get to developers apart from your contacts, like LinkedIn or other websites?",
        "start": 2811.44,
        "end": 2817.52
    },
    {
        "text": " Yeah. So you're spot on, right? Like that, like that, that, you know, when an agency is in between,",
        "start": 2817.52,
        "end": 2829.92
    },
    {
        "text": " there's a middle entity, right? A middle person or middle entity. And it is depending on many",
        "start": 2830.64,
        "end": 2840.0
    },
    {
        "text": " circumstances, it can be more efficient just to go direct. Now, this also goes back to what I said",
        "start": 2840.0,
        "end": 2847.12
    },
    {
        "text": " where every company is different, right? Like if you're less, if the company is less technical,",
        "start": 2847.12,
        "end": 2851.44
    },
    {
        "text": " they want to hire an agency to help with project management and many things. But",
        "start": 2851.44,
        "end": 2856.0
    },
    {
        "text": " for us, for hiring, when we think about hiring direct. So I think there's a few things. Maybe we do",
        "start": 2858.64,
        "end": 2867.52
    },
    {
        "text": " have a few recruiting partners in the region. And that's been really helpful. And like,",
        "start": 2867.52,
        "end": 2876.16
    },
    {
        "text": " those are relationships we've built with recruiting firms based in Latin America.",
        "start": 2876.16,
        "end": 2883.6
    },
    {
        "text": " We also look at if there's a type of technology or a project that we see like a developer",
        "start": 2886.3999999999996,
        "end": 2896.3999999999996
    },
    {
        "text": " has been working on, we'll reach out. And like, you know, say this was really interesting. Let's",
        "start": 2897.36,
        "end": 2906.08
    },
    {
        "text": " let's have a conversation. I think I think I'm the other thing is I'm a little bit different than",
        "start": 2906.08,
        "end": 2917.6
    },
    {
        "text": " a lot of people because I think I'm more comfortable operating in the region because I have done it",
        "start": 2917.6,
        "end": 2924.2400000000002
    },
    {
        "text": " more. I think for someone that hasn't a LinkedIn message is just not going to achieve anything",
        "start": 2924.24,
        "end": 2936.7999999999997
    },
    {
        "text": " because they're just going to see it as, you know, they're not going to look at it through",
        "start": 2937.7599999999998,
        "end": 2942.64
    },
    {
        "text": " the right lens. But I think companies in the US and hiring managers in the US really appreciate",
        "start": 2942.64,
        "end": 2952.4799999999996
    },
    {
        "text": " a few things like one is a very thoughtful, really, really well-written email that also,",
        "start": 2953.28,
        "end": 2961.84
    },
    {
        "text": " maybe even you include, you take a weekend and you build something that has to do with that company",
        "start": 2962.48,
        "end": 2971.12
    },
    {
        "text": " or product. Like that level of attention really resonates. And then I'm sure it's the same",
        "start": 2972.08,
        "end": 2979.36
    },
    {
        "text": " perhaps in any hiring environment. But I think we, in terms of like the channels,",
        "start": 2980.32,
        "end": 2991.52
    },
    {
        "text": " you know, I think we rely on referrals, we rely on recruiting partners. And of course, if someone",
        "start": 2992.6400000000003,
        "end": 2999.92
    },
    {
        "text": " proactively, I think really impresses us, it's a great signal. Okay. Thank you.",
        "start": 2999.92,
        "end": 3008.6400000000003
    },
    {
        "text": " Quaking question.",
        "start": 3009.84,
        "end": 3011.04
    },
    {
        "text": " It's more or less a question, but related to companies, where do American companies look for",
        "start": 3013.28,
        "end": 3019.1200000000003
    },
    {
        "text": " like outside companies like it's going to meetings, the best thing or where it's that",
        "start": 3019.1200000000003,
        "end": 3027.1200000000003
    },
    {
        "text": " yeah, they meet happen. So sorry, you mean, can you yeah, re-ask the question?",
        "start": 3027.92,
        "end": 3036.0
    },
    {
        "text": " Yeah, when like American companies, when one thing, when looking for hiring outside of the US,",
        "start": 3036.64,
        "end": 3042.8
    },
    {
        "text": " if they want it, if they want to hire like a company, not not just a person, but a company,",
        "start": 3043.52,
        "end": 3050.0
    },
    {
        "text": " because for example, the American company, it's not like tech related or something like that.",
        "start": 3050.0,
        "end": 3054.72
    },
    {
        "text": " Where do, where does the company goes in order to find somewhere another company that fixed?",
        "start": 3055.84,
        "end": 3062.08
    },
    {
        "text": " Yeah. So it depends, which I know is not the answer you're looking for. I think if it's a big",
        "start": 3062.72,
        "end": 3074.72
    },
    {
        "text": " company, like a huge company, they're going to have an RFP process, which stands for request,",
        "start": 3075.68,
        "end": 3084.48
    },
    {
        "text": " for proposal, and they're going to solicit bids, basically, from global, from",
        "start": 3084.48,
        "end": 3093.68
    },
    {
        "text": " all the big players, and they're going to see who puts the best proposal together. But that's",
        "start": 3095.68,
        "end": 3102.0
    },
    {
        "text": " like for example, someone like Budweiser saying, we want to hire an agency to, I don't know, do",
        "start": 3102.0,
        "end": 3108.64
    },
    {
        "text": " some project. They're going to have contacts at all the big agencies, and they're going to say,",
        "start": 3108.64,
        "end": 3113.8399999999997
    },
    {
        "text": " all right, win, win us. Now, of course, as you get to smaller businesses, medium and other sizes,",
        "start": 3113.8399999999997,
        "end": 3121.92
    },
    {
        "text": " there are businesses that might post a project on Upwork, right? Now, that's a much smaller scale,",
        "start": 3122.64,
        "end": 3131.2
    },
    {
        "text": " but that does happen. Similarly, I think referrals are like, I'll give an example, hello, hello.",
        "start": 3131.2799999999997,
        "end": 3140.0
    },
    {
        "text": " I'm going to give them a shout out. They're an agency in Montevideo. They do primarily design work.",
        "start": 3140.0,
        "end": 3148.48
    },
    {
        "text": " I'm good colleagues with their team. I've sent them a ton of referrals, because they focus a lot",
        "start": 3150.24,
        "end": 3160.72
    },
    {
        "text": " just on design, and it's really hard to find really, really excellent design, let alone an",
        "start": 3160.72,
        "end": 3167.52
    },
    {
        "text": " Irregoi anywhere. I don't know, they've probably closed. I don't know the exact number, but",
        "start": 3167.52,
        "end": 3173.2
    },
    {
        "text": " hundreds and hundreds of thousands of dollars, because the referrals come, like it's a trust,",
        "start": 3174.08,
        "end": 3182.08
    },
    {
        "text": " there's a trust element. Now, I don't do it because I don't get any commission. I just do it because",
        "start": 3182.08,
        "end": 3188.3199999999997
    },
    {
        "text": " I know they're going to do a good job. I trust that they will perform. That's a bit of a",
        "start": 3188.32,
        "end": 3197.04
    },
    {
        "text": " convoluted answer. Forgive me. I think that sometimes they use directories like clutch, for example,",
        "start": 3197.04,
        "end": 3205.92
    },
    {
        "text": " some people might use that, or even go to certain events, meetups, or try to show some on",
        "start": 3205.92,
        "end": 3210.8
    },
    {
        "text": " industry or vertical. I do think clutch is used often to, okay, someone mentioned this agency. Let",
        "start": 3211.44,
        "end": 3220.0800000000004
    },
    {
        "text": " me do a little bit of like a phone. You check the Yelp before you go to the restaurant.",
        "start": 3220.0800000000004,
        "end": 3228.48
    },
    {
        "text": " I do think the industry is moving more towards like team augmentation versus I'm going to hire",
        "start": 3229.12,
        "end": 3250.32
    },
    {
        "text": " I'm going to start up and go into higher an agency for a project. I think we're seeing more and more",
        "start": 3251.04,
        "end": 3258.2400000000002
    },
    {
        "text": " companies in the US want to have a team that they can insert inside of their team versus just",
        "start": 3258.2400000000002,
        "end": 3268.1600000000003
    },
    {
        "text": " some black box where they just give things and say figure it out.",
        "start": 3268.6400000000003,
        "end": 3272.32
    },
    {
        "text": " Yeah, but as you already said, they need some to be some kind of thick savvy in order to at least",
        "start": 3272.88,
        "end": 3280.56
    },
    {
        "text": " manage that augmented team, right? That's right. Even to do the betting process.",
        "start": 3280.56,
        "end": 3287.84
    },
    {
        "text": " Yep, absolutely. I can go a few minutes over. I can go to like yeah,",
        "start": 3290.1600000000003,
        "end": 3294.48
    },
    {
        "text": " awesome. Thank you. You know that's any other questions guys?",
        "start": 3296.0,
        "end": 3300.1600000000003
    },
    {
        "text": " Let me check my list of questions. Also, just to get because up to now you were very",
        "start": 3303.1200000000003,
        "end": 3312.88
    },
    {
        "text": " gentle and rosy with your wife. But what would be the cons of that we might have as an industry,",
        "start": 3314.0,
        "end": 3322.0
    },
    {
        "text": " I don't know, maybe we might be small country or the price. What could be?",
        "start": 3322.0,
        "end": 3328.56
    },
    {
        "text": " I think it's a good question.",
        "start": 3328.88,
        "end": 3333.2
    },
    {
        "text": " I mean, one of the cons is definitely more expensive compared to other.",
        "start": 3337.2,
        "end": 3343.36
    },
    {
        "text": " Now, of course, as we discussed, some of that can be offset, but that's one con.",
        "start": 3345.04,
        "end": 3349.36
    },
    {
        "text": " This is not a con, but maybe just like an encouragement.",
        "start": 3350.1600000000003,
        "end": 3356.48
    },
    {
        "text": " Like the more I think people can engineers can not just be engineers and not just",
        "start": 3356.48,
        "end": 3365.6
    },
    {
        "text": " but like really understand a full project and like the business impact of that",
        "start": 3366.56,
        "end": 3371.6800000000003
    },
    {
        "text": " more valuable you are. Maybe other cons is like,",
        "start": 3372.24,
        "end": 3378.96
    },
    {
        "text": " you know, I think the more, the more young people and like yourselves in Ergo, I can",
        "start": 3389.12,
        "end": 3396.3999999999996
    },
    {
        "text": " get familiar with the the various cultural phenomenon in the US. Like it helps, but I'm also like",
        "start": 3396.4,
        "end": 3410.56
    },
    {
        "text": " it's not your obligation, like in my opinion, but that's the reality of it.",
        "start": 3410.56,
        "end": 3415.92
    },
    {
        "text": " Yeah, but also the the the the the nearer you are to the culture, the better the communication will be.",
        "start": 3417.76,
        "end": 3424.4
    },
    {
        "text": " And in this kind of projects communication is absolutely key.",
        "start": 3424.96,
        "end": 3428.32
    },
    {
        "text": " Yes, absolutely.",
        "start": 3430.0,
        "end": 3431.36
    },
    {
        "text": " Okay, and you already mentioned a couple of suggestions when when one of the folks asked,",
        "start": 3434.08,
        "end": 3441.36
    },
    {
        "text": " especially when when when founding a new company, but do have any other",
        "start": 3441.36,
        "end": 3448.2400000000002
    },
    {
        "text": " suggestion to these folks that asked you or said at the beginning of this talk, they are",
        "start": 3448.3999999999996,
        "end": 3455.7599999999998
    },
    {
        "text": " roughly halfway through their engineering career, hopefully a little bit more, but probably",
        "start": 3456.4799999999996,
        "end": 3463.12
    },
    {
        "text": " on average, halfway around it. So do you have any other suggestions for them or for that matter,",
        "start": 3463.68,
        "end": 3469.9199999999996
    },
    {
        "text": " any other final thoughts about our IT industry?",
        "start": 3469.9199999999996,
        "end": 3473.4399999999996
    },
    {
        "text": " When you're building a product or or your whether it's for a client or for yourself or for a new",
        "start": 3474.4,
        "end": 3483.52
    },
    {
        "text": " company, start with the problem and the customer, not the technology, like I eat when I hear,",
        "start": 3483.52,
        "end": 3492.2400000000002
    },
    {
        "text": " I want to build something with AI. Why? I want to build something with computer vision. Okay,",
        "start": 3492.2400000000002,
        "end": 3500.96
    },
    {
        "text": " like if you when you start like and maybe there's an application for those, but when you start with",
        "start": 3501.84,
        "end": 3506.56
    },
    {
        "text": " the technology and work and then work from that, I think to the problem or the customer, it's always a",
        "start": 3506.56,
        "end": 3513.12
    },
    {
        "text": " bad business and a bad product. So that would be maybe the other thing I would add and and",
        "start": 3513.12,
        "end": 3523.92
    },
    {
        "text": " I think think oh, think globally. Like what I mean by this is yeah, like don't limit yourself to",
        "start": 3524.88,
        "end": 3533.6
    },
    {
        "text": " building a new startup that is only specifically for LATAM. Of course you can do this and that's",
        "start": 3533.6,
        "end": 3541.52
    },
    {
        "text": " great and that's at your fingertips, but look at Atlassian. Again, the company I mentioned in",
        "start": 3541.52,
        "end": 3546.88
    },
    {
        "text": " Australia or do you know the company Typeform? Yeah, yeah. So Typeform is a great company started and",
        "start": 3546.88,
        "end": 3556.6400000000003
    },
    {
        "text": " I think it's Portugal. I need to double check this, but like these are Typeform is like a very",
        "start": 3558.1600000000003,
        "end": 3564.32
    },
    {
        "text": " popular form builder. It's an incredible business, incredible product. They didn't think I want to",
        "start": 3564.32,
        "end": 3572.0
    },
    {
        "text": " build a good form tool for Portugal or for you know, these are we're going to build this",
        "start": 3572.0,
        "end": 3579.68
    },
    {
        "text": " for the world and I think that's an important thing to not limit yourself to. Yeah, and also I",
        "start": 3580.4,
        "end": 3586.32
    },
    {
        "text": " think that a couple of the policies that we are having here you what also go in that direction,",
        "start": 3586.32,
        "end": 3594.32
    },
    {
        "text": " actually one of them is called test Europe. We're just trying to see our own internal",
        "start": 3595.28,
        "end": 3602.0800000000004
    },
    {
        "text": " market just as a test bed in order for leverage and jump into bigger and broader market subtlwits.",
        "start": 3603.28,
        "end": 3612.6400000000003
    },
    {
        "text": " I love it. All right, I have to run. We're good. I'm all for being wonderful",
        "start": 3613.2799999999997,
        "end": 3626.08
    },
    {
        "text": " participants and thank you Abe. If there are questions follow up questions, maybe you can send to",
        "start": 3627.44,
        "end": 3637.7599999999998
    },
    {
        "text": " I can channel them. Yeah, and then you can channel back to me. Yeah, yeah, yeah, I believe that",
        "start": 3638.1600000000003,
        "end": 3643.28
    },
    {
        "text": " excellent. Thank you. Thank you. Again, Abe, thank you all guys.",
        "start": 3644.2400000000002,
        "end": 3647.28
    },
    {
        "text": " I'll go right in weekend. Thank you. Thank you, everyone. Thank you very much.",
        "start": 3648.1600000000003,
        "end": 3652.6400000000003
    }
]