[
    {
        "text": " ¡Buenas tardes! Hoy vamos a seguir con el tema de la norma y del producto de escarar.",
        "start": 0.0,
        "end": 25.48
    },
    {
        "text": " Voy a recordar las definiciones porque fue un poquito rápido la vez pasada.",
        "start": 25.48,
        "end": 30.48
    },
    {
        "text": " Ok, entonces primera cosa que hay que refierta es la norma.",
        "start": 30.48,
        "end": 34.480000000000004
    },
    {
        "text": " Y dado un vector U, la norma de un vector U en R3 es el número.",
        "start": 34.48,
        "end": 50.48
    },
    {
        "text": " Es el número que se escribe U entre dos barras, algo como un doble valor absoluto.",
        "start": 54.48,
        "end": 63.48
    },
    {
        "text": " Definido por y la norma de un es igual a la distancia donde hay veces son puntos, son puntos del espacio,",
        "start": 63.48,
        "end": 85.47999999999999
    },
    {
        "text": " tal es que el vector U es igual al vector A.",
        "start": 85.48,
        "end": 95.48
    },
    {
        "text": " Ok, y yo recuerdo que el vector A es para mí está la más que la distancia entre B y A.",
        "start": 95.48,
        "end": 104.48
    },
    {
        "text": " Ok, esta definición. Entonces la cosa importante es que yo puedo elegir varios puntos ahí que funcionan,",
        "start": 104.48,
        "end": 113.48
    },
    {
        "text": " pero si yo muevo mis puntos o mantengo el mismo vector y se mantiene la distancia,",
        "start": 113.48,
        "end": 119.48
    },
    {
        "text": " entonces no importa los puntos que elegí para calcularlo.",
        "start": 119.48,
        "end": 122.48
    },
    {
        "text": " Ok, y esto se llama la norma y en particular hay propiedades.",
        "start": 122.48,
        "end": 128.48000000000002
    },
    {
        "text": " Entonces la idea y la observación es que la definición no depende de A y de B.",
        "start": 128.48000000000002,
        "end": 141.48000000000002
    },
    {
        "text": " Solo depende de que el vector A B se e igual a U.",
        "start": 143.48,
        "end": 148.48
    },
    {
        "text": " Ok, entonces la norma es la distancia y las propiedades es la norma, la norma vimos que las propiedades.",
        "start": 148.48,
        "end": 155.48
    },
    {
        "text": " La primera cosa es que la norma siempre es número positivo o nulo, porque es una distancia claro.",
        "start": 155.48,
        "end": 168.48
    },
    {
        "text": " Entonces una norma siempre es algo positivo, no hay problemas y la norma es igual a 0, si y solo si.",
        "start": 169.48,
        "end": 181.48
    },
    {
        "text": " El vector U es el vector nulo, el único vector que tiene norma nula es el vector nulo,",
        "start": 181.48,
        "end": 188.48
    },
    {
        "text": " por supuesto distancia 0.",
        "start": 188.48,
        "end": 191.48
    },
    {
        "text": " Injustivamente la norma de un vector es lo que ustedes se llama la longitud o bien su tamaño.",
        "start": 191.48,
        "end": 198.48
    },
    {
        "text": " Ok, y es algo positivo o nulo, es decir el vector nulo tiene norma nula y todos los otros factores tienen una norma estrictamente positivo.",
        "start": 198.48,
        "end": 209.48
    },
    {
        "text": " Ok, según la propiedad que sabemos que la norma de lambda por U es igual al valor absoluto de lambda por la norma nula y acá ojo,",
        "start": 210.48,
        "end": 224.48
    },
    {
        "text": " es un producto de número por un vector, pero de este punto es un producto de dos números reales, esto es un número real positivo o nulo.",
        "start": 224.48,
        "end": 236.48
    },
    {
        "text": " Ok, esto es fácil y la tercera propiedad que es la desigualdad triangular, que es la norma de U más V, es en general menor que la norma de U más a normal V.",
        "start": 236.48,
        "end": 250.48
    },
    {
        "text": " Y esto se puede ver fácilmente si yo tengo U acá por ejemplo y V acá por ejemplo el vector U más V está acá y solo aquí mirar la figura para ver que esta distancia es menor que esta distancia más esta distancia.",
        "start": 251.48,
        "end": 274.48
    },
    {
        "text": " A veces son iguales, pueden ser iguales, cuando son iguales, cuando los tres puntos son andireados y este punto entre este y este.",
        "start": 274.48,
        "end": 285.48
    },
    {
        "text": " Ok, son las propiedades de la norma y sabemos que un verasor de definición, un verasor es un vector U tal que,",
        "start": 286.48,
        "end": 303.48
    },
    {
        "text": " su norma sea igual a U.",
        "start": 303.48,
        "end": 310.48
    },
    {
        "text": " Lo yo personalmente nunca uso esta terminología porque nunca la aprendí, entonces voy a llamar esto vector unitario, es decir, vector que tiene longitud 1.",
        "start": 311.48,
        "end": 324.48
    },
    {
        "text": " Y la observación es que cualquier vector nulo se puede transformar en un verasor, hay que dividir por su tamaño y la observación es si U es un vector Nulo.",
        "start": 324.48,
        "end": 347.48
    },
    {
        "text": " Si U es un vector Nulo, entonces en general no es un verasor pero si se o divido por su norma, entonces el vector que yo voy a escribir así, 1 sobre norma de U,",
        "start": 347.48,
        "end": 366.48
    },
    {
        "text": " producto por un escarad en un vector U es un verasor, esto se escribe así, a veces yo voy a escribir U dividido por la norma de U pero esta mal,",
        "start": 366.48,
        "end": 386.48
    },
    {
        "text": " porque lo que definimos era el producto de un vector por un escarad, no la división, pero a veces yo confieso que cuando yo hago geometría en la U escoridad y solo en mi cuarto en la U escoridad que hay nadie que me mira a veces yo escribo esto así.",
        "start": 386.48,
        "end": 406.48
    },
    {
        "text": " Pero esta mal, ahora vamos a ver algo más general que se llama el producto escalar y hay que explicar muchas cosas sobre el producto escalar.",
        "start": 406.48,
        "end": 426.48
    },
    {
        "text": " Definición, el producto escalar de dos vectores, 1 y v, N R n 3, es el número,",
        "start": 426.48,
        "end": 455.48
    },
    {
        "text": " U punto v se escribe así, o bien se escribe U como v entre cosas picantes, no sé cómo se dice, o bien se escribe U con picante barra v,",
        "start": 455.48,
        "end": 477.48
    },
    {
        "text": " esta notación se usa el matimática, esta notación también matimática y está en física.",
        "start": 477.48,
        "end": 487.48
    },
    {
        "text": " Dependiendo de los libros, pero significa una misma cosa, es un número definido por el producto escalar, es por definición, el producto de la norma de U por la norma de V,",
        "start": 487.48,
        "end": 507.48
    },
    {
        "text": " por el coseno de Teta, donde Teta es el angulo entre U y V.",
        "start": 507.48,
        "end": 521.48
    },
    {
        "text": " Esta definición no es precisamente precisa porque este angulo no está definido cuando uno de los dos vectores es nulo, para medir un angulo entre dos vectores se necesita que sean nulos, pero que pasa cuando uno de los dos vectores es nulo?",
        "start": 521.48,
        "end": 543.48
    },
    {
        "text": " Este producto es nulo, entonces no se necesita el Teta, es decir, cuando uno de los dos vectores es nulo, el angulo puede ser cualquier cosa, no nos importa porque este producto va a ser nulo y el producto escalar es nulo.",
        "start": 543.48,
        "end": 562.48
    },
    {
        "text": " Es decir, cuando uno o V es nulo, tenemos que el producto escalar siempre es nulo, es un producto, ya sabemos que cuando hacemos el producto de algo por 0, me da 0.",
        "start": 562.48,
        "end": 582.48
    },
    {
        "text": " Entonces hay que dar mucho, muchas intuiciones sobre el producto escalar.",
        "start": 583.48,
        "end": 591.48
    },
    {
        "text": " Intuiciones sobre el producto escalar.",
        "start": 595.48,
        "end": 599.48
    },
    {
        "text": " Hay que hacer una figura, que mide esto. Primera cosa, vamos a hacer un poquito de física, saben que en física los números tienen dimensiones, no existe dos tres, existen metros, segundos, kilógramos, o que?",
        "start": 612.48,
        "end": 632.48
    },
    {
        "text": " Es decir, cada número tiene una unidad, acá un vector se expresa el metro naturalmente, entonces esto es metro o centímetro, es una unidad de distancia, acá distancia por distancia es distancia cuadrado y el coseno es algo sin unidad, unidad.",
        "start": 632.48,
        "end": 652.48
    },
    {
        "text": " Entonces esto mide algo como una superficie, pero acá yo no lo podré mostrar la superficie, pero intuitivamente si U y V se expresa en metros, esto será en metros cuadrados.",
        "start": 652.48,
        "end": 669.48
    },
    {
        "text": " Después hay que ver lo que significa geometricamente, entonces voy a hacer un vector U, acá un vector V y yo considero una recta, acá.",
        "start": 670.48,
        "end": 688.48
    },
    {
        "text": " Como se mide el producto escalar consiste en proyectar V sobre U de modo orthogonal.",
        "start": 688.48,
        "end": 697.48
    },
    {
        "text": " Ok, y este vector que voy a llamar V prima, que empieza acá, de hecho este vector V prima, su nujitud es igual a la longitud de V por el coseno de Teta.",
        "start": 697.48,
        "end": 723.48
    },
    {
        "text": " Es una propiedad usual de los triángulos, es decir, entonces el producto escalar de U por V, que es U por V por el coseno de Teta, también es igual a producto esto es igual a la normal V prima.",
        "start": 723.48,
        "end": 744.48
    },
    {
        "text": " Es decir, es igual a la normal V prima, ese producto de esta distancia y de esta distancia donde hice la projección de orthogonal.",
        "start": 745.48,
        "end": 758.48
    },
    {
        "text": " Ok, pero la cosa rara es que yo hubiera podido hacerlo mismo intercambiando mis dos vectores, entonces otra cosa posible es en lugar de proyectar V sobre el EG definido por U, yo puedo proyectar U sobre el EG definido por V, obtengo esto.",
        "start": 759.48,
        "end": 784.48
    },
    {
        "text": " Y acá, obtengo un nuevo vector que voy a llamar U prima, y eso mismo, también es igual a U prima por normal V, es igual.",
        "start": 785.48,
        "end": 802.48
    },
    {
        "text": " Es decir, yo puedo elegir con el vector, voy a proyectar sobre el EG definido por el otro vector.",
        "start": 802.48,
        "end": 809.48
    },
    {
        "text": " Tengo dos opciones, obiene yo proyecto V sobre el EG definido por el vector U, obtengo el vector V prima, acá quizás yo debería escribir esto de mismo modo, esta cosa, es U prima.",
        "start": 809.48,
        "end": 828.48
    },
    {
        "text": " Obiene yo puedo proyectar U sobre el EG definido por V, acá si yo proyecto el vector U, ortogonalmente sobre el EG definido por V, obtengo este vector U prima, y el producto de esta cadar es el producto de la norma D por la norma de U prima.",
        "start": 828.48,
        "end": 851.48
    },
    {
        "text": " Y ahora son dos distancias en el mismo EG, ese producto de dos distancias sobre el mismo EG.",
        "start": 851.48,
        "end": 858.48
    },
    {
        "text": " Acá si quieren, pueden también hacer este dibujo, no, pero no lo voy a hacer, esta idea, esta intuición del producto de escalar.",
        "start": 859.48,
        "end": 872.48
    },
    {
        "text": " Esto que hay que ir en particular, cuando se anula el producto de escalar, cuando el coce no es igual a cero, y cuando es igual a cero, ¿cuándo son?",
        "start": 873.48,
        "end": 886.48
    },
    {
        "text": " ¿De qué que cuando son?",
        "start": 886.48,
        "end": 890.48
    },
    {
        "text": " Perpe a mi curar, vamos a decir ortogonales, es decir el producto de escalar, hay tres posibilidades para anular un producto de escalar, o bien U estulo y chasta, o bien V estulo y chasta.",
        "start": 891.48,
        "end": 907.48
    },
    {
        "text": " O bien, el coce no es un ru, es decir tenemos un angulo derecho, son ortogonales. Entonces el producto de escalar mide la ortogonalidad, y después esto que vamos a usar para definir la nocio de ortogonalidad.",
        "start": 908.48,
        "end": 921.48
    },
    {
        "text": " Antes de hacer esto, voy a dar las propiedades del producto de escalar, propiedades, primero la propiedad, el producto de escalar es con mutación.",
        "start": 922.48,
        "end": 939.48
    },
    {
        "text": " Es decir, no me importa, acá es la suerte, tenemos un producto, acá es una cosa rara porque es un producto que toma dos vectores y me construye un número, renuncié la cantidad de información.",
        "start": 940.48,
        "end": 954.48
    },
    {
        "text": " Es decir, un poquito de lo puesto del producto de matriz, las matrices teníamos una matriz, otra matriz y obtuvimos una matriz, ahora dos vectores si se obtiene un número.",
        "start": 954.48,
        "end": 964.48
    },
    {
        "text": " U por D igual a B punto, ok, dos, cómo se funciona con el producto con número, acá es complicado porque tengo punto que se usa a la vez para el producto con un número y el producto de escalar.",
        "start": 964.48,
        "end": 982.48
    },
    {
        "text": " ¿Qué pasa si yo hago el producto de lambda U? Y si voy a sacar lambda U, escalar B, esto es igual a lo mismo que U, escalar lambda B y esto mismo que lambda U escalar B.",
        "start": 983.48,
        "end": 1001.48
    },
    {
        "text": " Aquí hay que entender que los tres tipos de producto, acá es producto de un vector por un número, acá es un producto de escalar, acá es un producto de escalar, acá es un producto de escalar, y acá es un producto de dos números.",
        "start": 1001.48,
        "end": 1022.48
    },
    {
        "text": " Y no hay valor absoluto en este caso, es muy interesante, es decir, pueden usar esta propiedad que sabemos para las matrices, el producto de matrices, pero ahora en caso distinto que es el producto de escalar, después vamos a hacer el vínculo entre el producto de matrices y el producto de escalar, porque hay un vínculo.",
        "start": 1022.48,
        "end": 1047.48
    },
    {
        "text": " Y también tenemos que es, porque ya sabemos que esta cosa se llama un producto y en matemática, cuando algo se llama un producto, la única razón posible es porque es distributiva respecto a una suma.",
        "start": 1048.48,
        "end": 1063.48
    },
    {
        "text": " Entonces tenemos que U1 más U2, producto de escalar B es igual a la suma de los productos escalar.",
        "start": 1065.48,
        "end": 1073.48
    },
    {
        "text": " Y por supuesto, cómo el producto de escalar es commutativo, funcione también por la derecha.",
        "start": 1077.48,
        "end": 1082.48
    },
    {
        "text": " Entonces, la buena noticia de lilla es que ese calcula con el producto de escalar usando las reglas algebraicas clásicas.",
        "start": 1082.48,
        "end": 1102.48
    },
    {
        "text": " Como nosotros matemáticos somos perezosos, tenemos un montón de objetos distintos que tienen las mismas reglas de cálculo. Esto es para, porque a nosotros no nos gusta aprender nuevas reglas de cálculo, ya sabemos todo desde la primaria.",
        "start": 1103.48,
        "end": 1121.48
    },
    {
        "text": " Entonces, solo construimos nuevos objetos, pero lo que tienen las reglas de cálculo antigua, es un truco de los matemáticos.",
        "start": 1121.48,
        "end": 1132.48
    },
    {
        "text": " Entonces, todas estas reglas que sabieron funcionan también para los números, los vectores, producto y matrices, producto escalar, y también no vamos a ver para el producto de escalar después.",
        "start": 1133.48,
        "end": 1144.48
    },
    {
        "text": " Ahora, hay que dar una definición, ahora definición, yo puedo definir cuando dos vectores son ortogonales, y ahora esa nueva definición, dos vectores son ortogonales cuando tienen un producto de escalar de uno, será la definición.",
        "start": 1147.48,
        "end": 1160.48
    },
    {
        "text": " Definición, dos vectores, o y ve son ortogonales, cuando son ortogonales, cuando hay que dar la definición.",
        "start": 1162.48,
        "end": 1177.48
    },
    {
        "text": " U escalar, V, es igual a C, esta definición.",
        "start": 1193.48,
        "end": 1199.48
    },
    {
        "text": " En particular, que pasa con el vector nulo, es ortogonal a todo otro vector, y también es colineal a todo otro vector.",
        "start": 1199.48,
        "end": 1211.48
    },
    {
        "text": " En general, cuando dos vectores son ortogonales, no son colineales, pero sí cuando se transforma en un nulo, el vector nulo es a la vez ortogonal y colineal a todo otro vector.",
        "start": 1212.48,
        "end": 1225.48
    },
    {
        "text": " Ok, esta definición, ahora vamos a ver lo que pasa, vamos a explicar por qué todo esto está buena definición de la noción de ángulo y de distancia, y vamos a pasar ver lo que pasa en una base ortogonal.",
        "start": 1226.48,
        "end": 1240.48
    },
    {
        "text": " Expresión, en una base ortogonal.",
        "start": 1240.48,
        "end": 1247.48
    },
    {
        "text": " Y esto es importante.",
        "start": 1248.48,
        "end": 1254.48
    },
    {
        "text": " Ok, ya tengo que recordar que hasta ahora habíamos hecho una identificación entre el espacio ambiente y el R3.",
        "start": 1254.48,
        "end": 1269.48
    },
    {
        "text": " Y para esto necesitamos una referencia, una base, un sistema de coronadas.",
        "start": 1270.48,
        "end": 1280.48
    },
    {
        "text": " Entonces ahora voy a explicar el sistema de coronadas.",
        "start": 1280.48,
        "end": 1283.48
    },
    {
        "text": " Entonces, el espacio físico o ambiente sea identificado.",
        "start": 1283.48,
        "end": 1296.48
    },
    {
        "text": " A, el espacio R3, ha identificado con R3 a través de un sistema de coronadas.",
        "start": 1300.48,
        "end": 1313.48
    },
    {
        "text": " De un sistema de coronadas y como se construye un sistema de coronadas en el espacio, hay que partir de un punto que es el origen o el general es escribo y después hay que tomar tres vectores, no colineales en tres.",
        "start": 1314.48,
        "end": 1337.48
    },
    {
        "text": " Y J y K.",
        "start": 1338.48,
        "end": 1343.48
    },
    {
        "text": " Acá son vectores del espacio ambiente.",
        "start": 1343.48,
        "end": 1346.48
    },
    {
        "text": " Ok, es mi sistema de coronadas.",
        "start": 1346.48,
        "end": 1351.48
    },
    {
        "text": " Entonces ahora se supone que el sistema de coronadas y este sistema es O y J K es ortodormal.",
        "start": 1352.48,
        "end": 1377.48
    },
    {
        "text": " Es decir, tengo que precisar lo que significa.",
        "start": 1378.48,
        "end": 1383.48
    },
    {
        "text": " Significa dos cosas.",
        "start": 1383.48,
        "end": 1386.48
    },
    {
        "text": " En ortodormal hay dos palabras.",
        "start": 1386.48,
        "end": 1389.48
    },
    {
        "text": " Hay horto y normal.",
        "start": 1389.48,
        "end": 1392.48
    },
    {
        "text": " Este dice que los vectores y J y K son ortogonales apareces.",
        "start": 1392.48,
        "end": 1398.48
    },
    {
        "text": " Y esto dice que todos tienen norma 1. Son vectores.",
        "start": 1399.48,
        "end": 1405.48
    },
    {
        "text": " Ok, entonces son dos propiedades.",
        "start": 1405.48,
        "end": 1408.48
    },
    {
        "text": " Es decir.",
        "start": 1408.48,
        "end": 1410.48
    },
    {
        "text": " Y ahora tengo que dar las dos propiedades.",
        "start": 1429.48,
        "end": 1433.48
    },
    {
        "text": " La primera propiedad es que la norma de I tiene que ser igual a la norma de J que tiene que ser igual a la norma de K.",
        "start": 1433.48,
        "end": 1442.48
    },
    {
        "text": " Es decir, son normales, son veresores.",
        "start": 1442.48,
        "end": 1446.48
    },
    {
        "text": " Y también es que los tres vectores tienen que ser ortogonales apareces.",
        "start": 1446.48,
        "end": 1451.48
    },
    {
        "text": " Es decir, el producto de vectorial de I por J es igual el producto de vectorial de I por J.",
        "start": 1451.48,
        "end": 1457.48
    },
    {
        "text": " Es igual el producto de J por K y todo esto es igual a C.",
        "start": 1458.48,
        "end": 1463.48
    },
    {
        "text": " Es decir, acá son veresores y acá son ortogonales apareces.",
        "start": 1463.48,
        "end": 1472.48
    },
    {
        "text": " Son ortogonales 2 a 2.",
        "start": 1472.48,
        "end": 1479.48
    },
    {
        "text": " Ok.",
        "start": 1479.48,
        "end": 1482.48
    },
    {
        "text": " Esto es una un sistema de coronada, orto normal.",
        "start": 1483.48,
        "end": 1488.48
    },
    {
        "text": " Y ahora podemos determinar cómo se cuentan hacer cuentas con el producto escalado.",
        "start": 1488.48,
        "end": 1499.48
    },
    {
        "text": " Ok, entonces el teorema es el siguiente.",
        "start": 1499.48,
        "end": 1505.48
    },
    {
        "text": " El teorema es decir, proposición o en una base orto normal,",
        "start": 1505.48,
        "end": 1520.48
    },
    {
        "text": " lo que llamó la base, el sistema de coronalaste es todo esto y la base es esto.",
        "start": 1520.48,
        "end": 1527.48
    },
    {
        "text": " Porque derecho no nos importa de lo origen, no hay ninguna condición sobre el ojo izquierdo, puede ser cualquier.",
        "start": 1527.48,
        "end": 1533.48
    },
    {
        "text": " En una base orto normal para todo, 1 igual a 1, 2, 3 y igual a 1, 2, 3.",
        "start": 1533.48,
        "end": 1552.48
    },
    {
        "text": " Tenemos que...",
        "start": 1552.48,
        "end": 1557.48
    },
    {
        "text": " La norma...",
        "start": 1558.48,
        "end": 1561.48
    },
    {
        "text": " acá, ¿por qué voy a comenzar?",
        "start": 1561.48,
        "end": 1564.48
    },
    {
        "text": " El producto es calar de U por V, tiene una forma super sencilla que es esta.",
        "start": 1564.48,
        "end": 1572.48
    },
    {
        "text": " Es 1 por V1 más U2 por V2 más U3 por V3.",
        "start": 1572.48,
        "end": 1581.48
    },
    {
        "text": " No puede ser más sencilla, hay una base orto normal.",
        "start": 1582.48,
        "end": 1587.48
    },
    {
        "text": " Y esto es la formula que permite calcular y para que esto siempre le vamos a trabajar en tales bases,",
        "start": 1587.48,
        "end": 1594.48
    },
    {
        "text": " porque acá tenemos una formula que calcula super facilmente el producto escalado.",
        "start": 1594.48,
        "end": 1602.48
    },
    {
        "text": " Segunda cosa, acá la norma alegú es nada otro que la raíz cuadrada de U es calar U.",
        "start": 1603.48,
        "end": 1618.48
    },
    {
        "text": " ¿Por qué?",
        "start": 1618.48,
        "end": 1623.48
    },
    {
        "text": " ¿Cuál es el ángulo entre U y U?",
        "start": 1623.48,
        "end": 1627.48
    },
    {
        "text": " ¿Cual es el coceno de 0?",
        "start": 1628.48,
        "end": 1631.48
    },
    {
        "text": " 1, entonces el producto es calar de U por U es la norma de U por la norma de U por 1, es decir, la norma cuadrado.",
        "start": 1631.48,
        "end": 1639.48
    },
    {
        "text": " Entonces la norma de U está raíz cuadrada de U es calar U.",
        "start": 1639.48,
        "end": 1645.48
    },
    {
        "text": " Entonces la norma también se puede definir a partir del producto escalada.",
        "start": 1645.48,
        "end": 1649.48
    },
    {
        "text": " La cosa más general es el producto es calar.",
        "start": 1649.48,
        "end": 1652.48
    },
    {
        "text": " Entonces lo que se obtiene es la raíz cuadrada y ahora tenemos la formula es U1 cuadrado,",
        "start": 1652.48,
        "end": 1659.48
    },
    {
        "text": " más U2 cuadrado, más U3 cuadrado.",
        "start": 1659.48,
        "end": 1664.48
    },
    {
        "text": " ¿Ya está?",
        "start": 1664.48,
        "end": 1666.48
    },
    {
        "text": " ¿Sos dos formulas que ya conocen?",
        "start": 1666.48,
        "end": 1670.48
    },
    {
        "text": " ¿Ok? ¿Y es esto?",
        "start": 1670.48,
        "end": 1673.48
    },
    {
        "text": " Hay que demostrarlo, lo voy a hacer.",
        "start": 1674.48,
        "end": 1678.48
    },
    {
        "text": " Esto es fácil.",
        "start": 1680.48,
        "end": 1683.48
    },
    {
        "text": " Sí, tengo un borrador de mostración.",
        "start": 1683.48,
        "end": 1687.48
    },
    {
        "text": " ¿Qué tenemos?",
        "start": 1703.48,
        "end": 1708.48
    },
    {
        "text": " U se les compone entre es componentes, es decir, el vector U por construcción es U1 por el primer vector de base,",
        "start": 1708.48,
        "end": 1720.48
    },
    {
        "text": " más U2 por el segundo vector de base, más U3 por el tercer vector de base, esa significa eso.",
        "start": 1720.48,
        "end": 1728.48
    },
    {
        "text": " De los vectores, es decir, decir que U1, U2 y 3 es lo mismo que en el espacio ambiente,",
        "start": 1729.48,
        "end": 1739.48
    },
    {
        "text": " U está sumare 1 por el primer vector de base, por más U2 por el segundo vector de base,",
        "start": 1739.48,
        "end": 1747.48
    },
    {
        "text": " más y por supuesto me equivo, U3 por el tercer vector de base.",
        "start": 1747.48,
        "end": 1751.48
    },
    {
        "text": " ¿Y lo mismo para B?",
        "start": 1751.48,
        "end": 1754.48
    },
    {
        "text": " Yo voy a sacar la flecha acá, acá es B1 por Y, más V2 por J, más U3 por K.",
        "start": 1755.48,
        "end": 1770.48
    },
    {
        "text": " ¿Ya está?",
        "start": 1770.48,
        "end": 1771.48
    },
    {
        "text": " Ahora, podríamos hacer las cuentas.",
        "start": 1771.48,
        "end": 1774.48
    },
    {
        "text": " Cuentas, ¿cuál es el producto de escadre U1 por V?",
        "start": 1774.48,
        "end": 1777.48
    },
    {
        "text": " Esto por esto.",
        "start": 1777.48,
        "end": 1779.48
    },
    {
        "text": " Por K, ¿no me equivo qué?",
        "start": 1779.48,
        "end": 1806.48
    },
    {
        "text": " Ahora, ¿qué vamos a hacer? ¿Cómo es un producto?",
        "start": 1807.48,
        "end": 1810.48
    },
    {
        "text": " Podemos desarrollar. ¿Cuántos términos, cuántos sumandos vamos a obtener?",
        "start": 1810.48,
        "end": 1815.48
    },
    {
        "text": " 3 por 3 es decir, 9. Hay que hacerlo.",
        "start": 1817.48,
        "end": 1823.48
    },
    {
        "text": " Ok, 1, 1 por V1 por Y es cada R, acá uso todas las propiedades.",
        "start": 1824.48,
        "end": 1837.48
    },
    {
        "text": " ¿Ok? Este por este, 1 por Y es cada V1 por Y, me va a dar 1 por V1 por el producto de escadre Y por Y.",
        "start": 1837.48,
        "end": 1851.48
    },
    {
        "text": " Y yo alguno mismo. Y acá la buena cosa es que yo veo que ustedes van a describir todo.",
        "start": 1852.48,
        "end": 1859.48
    },
    {
        "text": " Es horrible, ¿no? 1 por V2 y escarjo, ¿tá? Es decir, este término con este término.",
        "start": 1859.48,
        "end": 1870.48
    },
    {
        "text": " ¿Más? Es una matriz que estoy haciendo.",
        "start": 1870.48,
        "end": 1873.48
    },
    {
        "text": " 1 por V3 y escarar, acá.",
        "start": 1873.48,
        "end": 1879.48
    },
    {
        "text": " 1 por V1, J es cada R y, más 1 por V2, J es cada R, más 1 por V3, J por K.",
        "start": 1880.48,
        "end": 1901.48
    },
    {
        "text": " ¿Más? Hasta casi. Me falta una cosa. U3 V1 K por Y, más U3 por V2 K por J, más U3 por V3 K más K por K. ¿Ok? ¿Están de acuerdo?",
        "start": 1902.48,
        "end": 1925.48
    },
    {
        "text": " Y se, el desarrollo. Ahora me quedan nueve términos. ¿Nos vamos a morir o no?",
        "start": 1926.48,
        "end": 1933.48
    },
    {
        "text": " No, no nos vamos a morir. Hay menos hoy, no. ¿Y qué se observa?",
        "start": 1933.48,
        "end": 1940.48
    },
    {
        "text": " Es que no es la mayoría de estos términos mulos, porque los lectores y puta, gav son orzugonares 2 a 2. Es decir, esta cosa.",
        "start": 1940.48,
        "end": 1951.48
    },
    {
        "text": " Esta cosa. Esta cosa.",
        "start": 1952.48,
        "end": 1956.48
    },
    {
        "text": " Esta cosa. Esta cosa. Esta cosa.",
        "start": 1956.48,
        "end": 1959.48
    },
    {
        "text": " Esta cosa. Esta cosa. Esta cosa.",
        "start": 1959.48,
        "end": 1962.48
    },
    {
        "text": " Es que la...",
        "start": 1962.48,
        "end": 1964.48
    },
    {
        "text": " Los númenos, los tidamos son los términos secundarias. ¿Qué vendría a ser el producto de U con V? ¿Cómo?",
        "start": 1965.48,
        "end": 1971.48
    },
    {
        "text": " ¿Qué vendría a ser el término de U con V? Es producto de sí. ¿Qué vendría a ser? ¿Tienu número?",
        "start": 1971.48,
        "end": 1977.48
    },
    {
        "text": " Es número. Es número. Es número. Es número 2 que dar.",
        "start": 1977.48,
        "end": 1982.48
    },
    {
        "text": " Es número 2 que dar siempre es número. Acá es una suave número.",
        "start": 1982.48,
        "end": 1986.48
    },
    {
        "text": " Y desarrollé todo. ¿Ok? ¿Y qué vale I es que dar I?",
        "start": 1986.48,
        "end": 1991.48
    },
    {
        "text": " Es la normal I acuadrado y que es la normal I?",
        "start": 1991.48,
        "end": 1996.48
    },
    {
        "text": " Es todo vale I. Es decir, este número vale I.",
        "start": 1996.48,
        "end": 2001.48
    },
    {
        "text": " Este número vale I y este número vale I. Luego, después de esta matanza global, lo que me queda es 1 por V1,",
        "start": 2001.48,
        "end": 2013.48
    },
    {
        "text": " más U2 por V2, más U3 por V3 y ya está. ¿Ok?",
        "start": 2013.48,
        "end": 2022.48
    },
    {
        "text": " Tenemos a forma. ¿Por qué 1?",
        "start": 2025.48,
        "end": 2028.48
    },
    {
        "text": " ¿Por qué I tiene norma? Tiene norma 1. Y si tiene norma 1, el producto es que de el vector con sí mismo vale 1.",
        "start": 2029.48,
        "end": 2040.48
    },
    {
        "text": " ¿Por qué la norma vale 1? La norma vale 1 y el coste no vale 1. ¿Ya está?",
        "start": 2040.48,
        "end": 2045.48
    },
    {
        "text": " ¿Ok?",
        "start": 2045.48,
        "end": 2047.48
    },
    {
        "text": " Entonces, tenemos el producto vectorial y la demostración de la segunda igualdad es obvia,",
        "start": 2047.48,
        "end": 2062.48
    },
    {
        "text": " porque sí es y para demostrar 2, hay que observar que U es car U, es igual al producto de U por el producto de U,",
        "start": 2063.48,
        "end": 2079.48
    },
    {
        "text": " por el coseno de 0, porque el ángulo entre U y U es 0 y esto vale U cuadrado por 1.",
        "start": 2079.48,
        "end": 2090.48
    },
    {
        "text": " ¿Ok? De esto, yo diré un coque, si U es car U vale el cuadrado de la norma, luego la norma está raíz cuadrado de U es car R U.",
        "start": 2091.48,
        "end": 2102.48
    },
    {
        "text": " Y esto funciona porque sabemos que U es car... sí mismo siempre es positivo o nulo.",
        "start": 2104.48,
        "end": 2109.48
    },
    {
        "text": " Entonces acá no tenemos problema, no hay ningún gatito que se va a morir acá.",
        "start": 2110.48,
        "end": 2116.48
    },
    {
        "text": " No hay riesgo, porque U es car... el mismo vector. Ojo, a veces estos productos escadarres son negativos, cuando son negativos, los productos escadarres.",
        "start": 2117.48,
        "end": 2127.48
    },
    {
        "text": " Cuando el coseno de... de Teta, porque cuando miran esta expresión, esto es positivo, esto es positivo, nulo,",
        "start": 2128.48,
        "end": 2136.48
    },
    {
        "text": " la única cosa que puede ser negativa es el coseno y cuando el coseno es negativo, cuando el ángulo es más orque 90, es así, un ángulo así.",
        "start": 2136.48,
        "end": 2149.48
    },
    {
        "text": " Esto me va a dar, es decir, el producto es car en general será positivo, positivo, positivo, positivo, a 0, negativo, negativo, negativo, negativo, negativo.",
        "start": 2150.48,
        "end": 2160.48
    },
    {
        "text": " Ok, entonces, le vamos a la leja, y si cuando están trabajando en un sistema de coordinadoras orzo normal, la expresión del producto es carar es completamente sencilla.",
        "start": 2161.48,
        "end": 2174.48
    },
    {
        "text": " Es decir, si yo subtengo dos rectores, yo hago primera componente por primera componente, segunda componente con segunda componente, tercera componente con tercera componente y ya está.",
        "start": 2175.48,
        "end": 2186.48
    },
    {
        "text": " Y esa razón, porque es el punto de vista moderno, es mucho más fácil para hacer cuentas.",
        "start": 2187.48,
        "end": 2192.48
    },
    {
        "text": " Ok, y hay que terminar este producto de escalar. Ok, obtenemos todo esto y...",
        "start": 2195.48,
        "end": 2204.48
    },
    {
        "text": " Ok, ojo, por supuesto, esto solo funciona en un base orzo normal, es la mala noticia del día.",
        "start": 2205.48,
        "end": 2216.48
    },
    {
        "text": " Si no están en un base orzo normal, hay que hacer todas esas cuentas, eso horrible en general.",
        "start": 2217.48,
        "end": 2222.48
    },
    {
        "text": " Pero si están en un base orzo normal, pueden usar esta fórmula, esto calcula fácilmente los productos escalaras.",
        "start": 2222.48,
        "end": 2231.48
    },
    {
        "text": " Ok, y pero la buena noticia del día es que como los matemáticos siempre son perezosos, por esta razón siempre trabajar en un base orzo normal, para simplificar las cuentas.",
        "start": 2232.48,
        "end": 2244.48
    },
    {
        "text": " Y esa razón, porque tenemos este fetichismo sobre las bases ortodormales.",
        "start": 2246.48,
        "end": 2251.48
    },
    {
        "text": " Esta razón, porque en el geometría preferimos tener ángulos derechos, porque esto lo simplifica mucho el calculo de producto de escalar, que contiene a la de la idea de distancia y la idea de ángulo.",
        "start": 2252.48,
        "end": 2263.48
    },
    {
        "text": " Entonces, es la moral deja que voy a dar.",
        "start": 2264.48,
        "end": 2268.48
    },
    {
        "text": " Moraleja de la norma y del producto de escalar, es el punto de vista moderno.",
        "start": 2270.48,
        "end": 2275.48
    },
    {
        "text": " Ojo, después vamos a hacer sensificio.",
        "start": 2282.48,
        "end": 2292.48
    },
    {
        "text": " Antes su amoraleja.",
        "start": 2293.48,
        "end": 2297.48
    },
    {
        "text": " Moraleja, la moral deja es que cuando se consideran productos escardares, productos escardares normas, distancias,",
        "start": 2297.48,
        "end": 2321.48
    },
    {
        "text": " y ángulos siempre se trabajan en una base orzo normal.",
        "start": 2322.48,
        "end": 2335.48
    },
    {
        "text": " Ok, muy importante.",
        "start": 2336.48,
        "end": 2344.48
    },
    {
        "text": " Y, de hecho, en particular, la moral deja, este marco, en este marco, en este marco.",
        "start": 2344.48,
        "end": 2358.48
    },
    {
        "text": " ¿Qué tenemos?",
        "start": 2359.48,
        "end": 2360.48
    },
    {
        "text": " Tenemos que el producto escardar de U por V tiene esta forma super sencillo, 1, más por V1, más U2 por V2, más U3 por V3.",
        "start": 2360.48,
        "end": 2372.48
    },
    {
        "text": " No puede ser más sencillo, como forma.",
        "start": 2373.48,
        "end": 2376.48
    },
    {
        "text": " Ok, y pueden observar que es algo que, es algo que ya conocemos, es un producto de los patrises.",
        "start": 2377.48,
        "end": 2386.48
    },
    {
        "text": " Es el producto de U como fila por V como columna.",
        "start": 2386.48,
        "end": 2391.48
    },
    {
        "text": " Es decir, de hecho, pueden verlo como el producto.",
        "start": 2391.48,
        "end": 2395.48
    },
    {
        "text": " Esto es igual, el producto de los patrises, 1, 2, 3 por los patrises, V1, V2, V3.",
        "start": 2395.48,
        "end": 2409.48
    },
    {
        "text": " ¿Puede ver que esto es un producto de los patrises?",
        "start": 2412.48,
        "end": 2415.48
    },
    {
        "text": " Es decir, es otro que el producto de los patrises, vector U como fila y vector U como columna.",
        "start": 2415.48,
        "end": 2422.48
    },
    {
        "text": " Es decir, es algo que...",
        "start": 2422.48,
        "end": 2423.48
    },
    {
        "text": " Es un entraso.",
        "start": 2423.48,
        "end": 2424.48
    },
    {
        "text": " Exactamente, esto lo hay en una entrada, es decir, un número.",
        "start": 2424.48,
        "end": 2426.48
    },
    {
        "text": " Entonces, de hecho, el producto escar es algo que sabimos, es un producto de patrises.",
        "start": 2433.48,
        "end": 2438.48
    },
    {
        "text": " Es un caso particular de producto de patrises, donde hacemos el producto de una matriz fila por una matriz columna.",
        "start": 2438.48,
        "end": 2446.48
    },
    {
        "text": " Y lo que nos queda es una matriz 1 por 1, es decir, un único número.",
        "start": 2447.48,
        "end": 2450.48
    },
    {
        "text": " Y a partir de esta fórmula, que de hecho, lo que hay que memorizar es esto.",
        "start": 2454.48,
        "end": 2460.48
    },
    {
        "text": " Es decir, es U como fila por V como columna.",
        "start": 2460.48,
        "end": 2464.48
    },
    {
        "text": " Obien V como fila por U como columna.",
        "start": 2464.48,
        "end": 2468.48
    },
    {
        "text": " Ok.",
        "start": 2469.48,
        "end": 2471.48
    },
    {
        "text": " En una de estas una fórmula super sencisha, que es esa con lo sen.",
        "start": 2471.48,
        "end": 2475.48
    },
    {
        "text": " Y a partir de esto, yo puedo deduciar todo el resto.",
        "start": 2475.48,
        "end": 2478.48
    },
    {
        "text": " Y a partir de esto, se deduce.",
        "start": 2478.48,
        "end": 2480.48
    },
    {
        "text": " Del producto de escadar.",
        "start": 2485.48,
        "end": 2487.48
    },
    {
        "text": " Se deduce.",
        "start": 2492.48,
        "end": 2493.48
    },
    {
        "text": " La norma.",
        "start": 2494.48,
        "end": 2496.48
    },
    {
        "text": " La norma U.",
        "start": 2499.48,
        "end": 2502.48
    },
    {
        "text": " Las normas.",
        "start": 2505.48,
        "end": 2507.48
    },
    {
        "text": " La norma U por definición es la raíz cuadrada de U es cada U.",
        "start": 2507.48,
        "end": 2511.48
    },
    {
        "text": " Es decir, la raíz cuadrada de U1 a la cuadrada por U2 cuadrado por U3 cuadrado.",
        "start": 2511.48,
        "end": 2519.48
    },
    {
        "text": " También se deduce en las distancias.",
        "start": 2520.48,
        "end": 2523.48
    },
    {
        "text": " El producto escalar contiene la información de norma y también la información de la distancia.",
        "start": 2524.48,
        "end": 2528.48
    },
    {
        "text": " La distancia entre ahí va.",
        "start": 2528.48,
        "end": 2531.48
    },
    {
        "text": " Es decir, acá tenemos la norma.",
        "start": 2531.48,
        "end": 2533.48
    },
    {
        "text": " Las normas.",
        "start": 2533.48,
        "end": 2535.48
    },
    {
        "text": " Las distancias.",
        "start": 2535.48,
        "end": 2537.48
    },
    {
        "text": " La distancia de A.",
        "start": 2540.48,
        "end": 2542.48
    },
    {
        "text": " Es decir, ¿uala que?",
        "start": 2542.48,
        "end": 2543.48
    },
    {
        "text": " Esa norma del vetorave por definición.",
        "start": 2543.48,
        "end": 2546.48
    },
    {
        "text": " Y acá solo tengo, es decir, esa norma de B menos A.",
        "start": 2549.48,
        "end": 2553.48
    },
    {
        "text": " Es decir, esta raíz cuadrada de B1 menos A1 cuadrado, más B2 menos A2 cuadrado,",
        "start": 2556.48,
        "end": 2565.48
    },
    {
        "text": " más B3 menos A3 cuadrado.",
        "start": 2565.48,
        "end": 2568.48
    },
    {
        "text": " Ya está.",
        "start": 2568.48,
        "end": 2569.48
    },
    {
        "text": " Y también se pueden anunciarlos ángulos.",
        "start": 2572.48,
        "end": 2575.48
    },
    {
        "text": " Y los ángulos, es decir, el ángulo, el coseno de Teta por construcción,",
        "start": 2576.48,
        "end": 2588.48
    },
    {
        "text": " es el producto escar de U por V sobre el producto de las normas.",
        "start": 2588.48,
        "end": 2596.48
    },
    {
        "text": " Y si yo tomo el arcoceno, voy a obtener el ángulo.",
        "start": 2596.48,
        "end": 2605.48
    },
    {
        "text": " ¿Dónde?",
        "start": 2605.48,
        "end": 2608.48
    },
    {
        "text": " Acá ojo, acá hay un riesgo de matanza de catitos, entonces, ¿dónde U y V no son nulos?",
        "start": 2608.48,
        "end": 2618.48
    },
    {
        "text": " Y Teta, y Teta es el ángulo.",
        "start": 2618.48,
        "end": 2623.48
    },
    {
        "text": " Entre U y V.",
        "start": 2627.48,
        "end": 2630.48
    },
    {
        "text": " Puede ver que la cosa, el nuevo punto de vista de la geometría,",
        "start": 2634.48,
        "end": 2637.48
    },
    {
        "text": " dice que el concepto central no es ni la distancia ni el ángulo,",
        "start": 2637.48,
        "end": 2643.48
    },
    {
        "text": " el concepto central es el producto escar de U.",
        "start": 2643.48,
        "end": 2647.48
    },
    {
        "text": " Y a partir de este concepto central que tiene la fórmula super cinciza,",
        "start": 2647.48,
        "end": 2651.48
    },
    {
        "text": " yo puedo reducir la normal de un vector, la distancia entre dos puntos,",
        "start": 2651.48,
        "end": 2656.48
    },
    {
        "text": " y el ángulo entre dos vectores no nulos.",
        "start": 2656.48,
        "end": 2660.48
    },
    {
        "text": " ¿Por qué este punto de vista es súper interesante?",
        "start": 2660.48,
        "end": 2664.48
    },
    {
        "text": " Acá, ¿qué depende la dimensión 3 en esta fórmula de producto escar de U?",
        "start": 2664.48,
        "end": 2671.48
    },
    {
        "text": " ¿Qué pasa si yo paso salgo la dimensión 3 y que voy a la dimensión 4, que va a pasar?",
        "start": 2671.48,
        "end": 2678.48
    },
    {
        "text": " Yo voy a ir a dir U 3 por U 4 por V 4.",
        "start": 2679.48,
        "end": 2683.48
    },
    {
        "text": " Acá tendré una entrada más, acá hay una entrada más acá.",
        "start": 2683.48,
        "end": 2687.48
    },
    {
        "text": " No cambian nada, la fórmula del producto escar de la fórmula funciona para cualquiera dimensión.",
        "start": 2687.48,
        "end": 2694.48
    },
    {
        "text": " Luego, usando estas fórmulas, se le luce la noción de norma en dimensión 42,",
        "start": 2694.48,
        "end": 2701.48
    },
    {
        "text": " la noción de distancia en dimensión 42, y la noción de ángulo en dimensión 42.",
        "start": 2701.48,
        "end": 2709.48
    },
    {
        "text": " Ya está.",
        "start": 2709.48,
        "end": 2710.48
    },
    {
        "text": " ¿Por qué la dimensión la dicta es la otra dimensión 3, que es el mismo concepto de dicta?",
        "start": 2710.48,
        "end": 2717.48
    },
    {
        "text": " No sabemos, no importa, no, no, porque no tenemos un mundo geométrico,",
        "start": 2717.48,
        "end": 2722.48
    },
    {
        "text": " pero es el modo más natural para extender el concepto.",
        "start": 2722.48,
        "end": 2728.48
    },
    {
        "text": " ¿Sabes que si estás en un plano, si estás en un plano acá te vas a desaparecer a tercera corrinada?",
        "start": 2729.48,
        "end": 2736.48
    },
    {
        "text": " Si estás en espacio, tendrás a tercera corrinada.",
        "start": 2736.48,
        "end": 2739.48
    },
    {
        "text": " Lo más natural es decir si tengo cuatro dimensiones, hay que añadir una cuerda corrinada.",
        "start": 2739.48,
        "end": 2744.48
    },
    {
        "text": " Porque no tenemos espacio físico de dimensión 4, no tiene sentido físicamente.",
        "start": 2744.48,
        "end": 2749.48
    },
    {
        "text": " Pero para los físicos, cuando intentan estudiar los espacios de dimensión en las mayores,",
        "start": 2749.48,
        "end": 2755.48
    },
    {
        "text": " lo hacen esta suposición, pero supuesto, es lo más natural.",
        "start": 2755.48,
        "end": 2760.48
    },
    {
        "text": " Es lo más natural.",
        "start": 2760.48,
        "end": 2761.48
    },
    {
        "text": " No pensamos que el universo se ha tan complicado para cambiar la realidad cuando se pasa de la dimensión 3 a dimensión 4.",
        "start": 2761.48,
        "end": 2768.48
    },
    {
        "text": " Es lo más natural.",
        "start": 2768.48,
        "end": 2770.48
    },
    {
        "text": " Esto muestra que incluso cuando no tenemos a nuestra disposición de una espacio dimensión 5, 6, 17,",
        "start": 2770.48,
        "end": 2779.48
    },
    {
        "text": " sin embargo, podemos definir un concepto de distancia, un concepto de producto de escalar, concepto de norma,",
        "start": 2779.48,
        "end": 2785.48
    },
    {
        "text": " que cumplen las mismas propiedades.",
        "start": 2785.48,
        "end": 2788.48
    },
    {
        "text": " Y para mí es la magia, es la cosa mágica, es magia negra.",
        "start": 2788.48,
        "end": 2793.48
    },
    {
        "text": " Ahora tenemos ángulos, distancias, normas, productos de escalares, en espacios de dimensión, ¿cuál es que era?",
        "start": 2793.48,
        "end": 2801.48
    },
    {
        "text": " Es una cosa nueva, que se inventó en el siglo XIX.",
        "start": 2801.48,
        "end": 2806.48
    },
    {
        "text": " El cambio de punto de vista se hizo en el siglo XIX, es decir, mucho antes de la ciencia ficción y los espacios en la cuarta dimensión.",
        "start": 2806.48,
        "end": 2814.48
    },
    {
        "text": " Los más llamados discurrieron este punto de vista, y fueron, ¡ah! pero esta fórmula permiten reconstruir todo el resto,",
        "start": 2814.48,
        "end": 2821.48
    },
    {
        "text": " y además se extiende a las dimensiones mayores.",
        "start": 2821.48,
        "end": 2825.48
    },
    {
        "text": " Entonces para mí, esta cosa maravillosa, no sé cuál es un espacio de dimensión 4, pero si tengo un espacio en sentido de espacio,",
        "start": 2826.48,
        "end": 2835.48
    },
    {
        "text": " con dimensiones en sentido de espacio, entonces esto es casi seguro que si existe un espacio de dimensión 4, tiene esta distancia.",
        "start": 2835.48,
        "end": 2846.48
    },
    {
        "text": " No hay ninguna razón filosófica, porque cuando pasamos de 2 a 3, solo añadimos una coronalada,",
        "start": 2846.48,
        "end": 2852.48
    },
    {
        "text": " y porque sería otra cosa como cuando pasamos de 3 a 4.",
        "start": 2853.48,
        "end": 2856.48
    },
    {
        "text": " Ojo, los físicos a veces solo es cosa de cultura general.",
        "start": 2856.48,
        "end": 2862.48
    },
    {
        "text": " A veces integran el tiempo como una dimensión extra, y en este caso cambia la fórmula, y lo que aparece acá es que solo aparece un menos.",
        "start": 2862.48,
        "end": 2871.48
    },
    {
        "text": " El tiempo cuenta de modo negativo, lo que hace que se rajan a veces es un número imaginario.",
        "start": 2871.48,
        "end": 2880.48
    },
    {
        "text": " Y esto se llamaba la dimensión de la distancia espacial temporal, y es el comienzo de la geometría que es la base de la teoría de Einstein.",
        "start": 2882.48,
        "end": 2894.48
    },
    {
        "text": " La teoría de Einstein, la relatividad.",
        "start": 2894.48,
        "end": 2898.48
    },
    {
        "text": " La relatividad, de hecho, añade una cuarta coronalada, pero acá con un menos.",
        "start": 2898.48,
        "end": 2903.48
    },
    {
        "text": " Esa misma fórmula, cuando un menos, acá supongo T1 de 2.",
        "start": 2903.48,
        "end": 2908.48
    },
    {
        "text": " Ahora tengo vectores con cuatro dimensiones.",
        "start": 2908.48,
        "end": 2912.48
    },
    {
        "text": " Dos, tres de espacio, una de tiempo, y lo que hace Einstein dice, hay que hacer un menos.",
        "start": 2912.48,
        "end": 2917.48
    },
    {
        "text": " Y por supuesto hay que convertir distancias en segundos, metros en segundos, y se necesita un factor de conversión, y el factor de conversión es la velocidad de la luz.",
        "start": 2917.48,
        "end": 2928.48
    },
    {
        "text": " Es decir, la norma en dimensión cuatro, si yo integro el tiempo, yo debería poner más, menos, se cuadrado, el factor de conversión, se es la velocidad de luz.",
        "start": 2929.48,
        "end": 2942.48
    },
    {
        "text": " Por T1, por...",
        "start": 2942.48,
        "end": 2946.48
    },
    {
        "text": " Teprima, el primer tiempo, el segundo tiempo, porque tenemos dos vectores.",
        "start": 2946.48,
        "end": 2951.48
    },
    {
        "text": " ¿Entienden?",
        "start": 2951.48,
        "end": 2953.48
    },
    {
        "text": " Pero no se necesitan acá.",
        "start": 2953.48,
        "end": 2955.48
    },
    {
        "text": " Son no lo escribo, porque no es parte por nada de programa.",
        "start": 2955.48,
        "end": 2959.48
    },
    {
        "text": " El programa solo consta de la dimensión tres.",
        "start": 2959.48,
        "end": 2963.48
    },
    {
        "text": " Pero es importante para la cultura general que sepan, que los matemáticos se trabajan con mucho más dimensiones de espacio, que también saben integrar el tiempo de modo negativo.",
        "start": 2963.48,
        "end": 2973.48
    },
    {
        "text": " Ok, entonces pueden ver cuál es la interesa matemática de estas cosas de geometría, porque si ese trabajo previnar, no nunca hubiera sido posible formular la teoría de la reactividad.",
        "start": 2973.48,
        "end": 2991.48
    },
    {
        "text": " La teoría de la reactividad ya se basaba en la idea que ya teníamos una idea de cómo funciona, la nutura distancia en muchas dimensiones de espacio.",
        "start": 2991.48,
        "end": 3001.48
    },
    {
        "text": " Y la otra idea que consistía en dieciera, pero cuando se trae el tiempo hay que poner un menos, vino no le Einstein, vino de Lorenz, 20 años de Einstein.",
        "start": 3001.48,
        "end": 3012.48
    },
    {
        "text": " Lorenz lo vio como un fenómeno raro matemático y es Einstein que dio la interpretación física de esto.",
        "start": 3012.48,
        "end": 3020.48
    },
    {
        "text": " Ok, esto era para la cultura general.",
        "start": 3020.48,
        "end": 3024.48
    },
    {
        "text": " La idea es que la idea de la luz constante en el universo, pero es el factor que te permite transformar unidades de tiempo en unidades de distancia.",
        "start": 3025.48,
        "end": 3038.48
    },
    {
        "text": " Es decir, ¿cuál es el equivalente de un segundo en unidades de tiempo? Es un segundo luz, es decir, 300 mil kilómetros.",
        "start": 3039.48,
        "end": 3052.48
    },
    {
        "text": " Lo que muestra que nosotros nos muedamos mucho, nos movemos mucho más en el tiempo que en el espacio, porque pasar avanzar de un segundo del tiempo, yo lo hago así, un segundo.",
        "start": 3052.48,
        "end": 3067.48
    },
    {
        "text": " 2, 3, 4, superfacil. Ahora, yo quiero avanzar de 300 mil kilómetros, tengo que trabajar. Nosotros somos casi inmóviles de modo espacial.",
        "start": 3067.48,
        "end": 3083.48
    },
    {
        "text": " Solo nos muedamos en el tiempo y somos enraïstados en nuestra pequeña tierrita, pero es la vida.",
        "start": 3084.48,
        "end": 3093.48
    },
    {
        "text": " Sobos seres más de tiempo que el espacio. Ok, después de toda esta filosofía vamos a hablar de cosas en el programa, es decir, de producto vectorial.",
        "start": 3093.48,
        "end": 3106.48
    },
    {
        "text": " Ok, pero ahora ya tenemos todas esas nuciones de distancia y ángulos, es decir, tenemos los ingredientes fundamentales de la geometría.",
        "start": 3113.48,
        "end": 3140.48
    },
    {
        "text": " Pero nos falta uno y es el producto vectorial que no lo sube dar y algo vamos a tener una decepción.",
        "start": 3140.48,
        "end": 3147.48
    },
    {
        "text": " Porque hicimos sueños y después voy a bajar a tierra, producto vectorial.",
        "start": 3148.48,
        "end": 3155.48
    },
    {
        "text": " El producto vectorial tengo que introducir dos nuevas nuciones, que es la nación de sentido horario y anti horario.",
        "start": 3155.48,
        "end": 3172.48
    },
    {
        "text": " Cuando yo tengo tres vectores no colineales 2 a 2. Ok, y tres vectores que forman diremos una base hortónormal, será más sencillo.",
        "start": 3173.48,
        "end": 3188.48
    },
    {
        "text": " Ok, sea y jica, una base suficiente hortónormal, pero no se necesita.",
        "start": 3189.48,
        "end": 3202.48
    },
    {
        "text": " Hay dos formas de ser que se aconsecen en física, no se si se habieron eso en física, pero el formar cuando tienen y jica,",
        "start": 3205.48,
        "end": 3215.48
    },
    {
        "text": " esto me forma un plano. Ok, y a veces el vector K está por encima y a veces está por debajo.",
        "start": 3219.48,
        "end": 3232.48
    },
    {
        "text": " Esto se llama el sentido Hijo Taká, cuando yo tengo acá el punto 0 está por atrás, esto se llama es el sentido anti horario.",
        "start": 3233.48,
        "end": 3258.48
    },
    {
        "text": " Pero en Malimadica se llama el sentido positivo, es una convención.",
        "start": 3259.48,
        "end": 3266.48
    },
    {
        "text": " Y otro sentido es que cuando yo tengo y jica por encima por debajo, es decir, lo que consiste en intercambiar y jica.",
        "start": 3266.48,
        "end": 3276.48
    },
    {
        "text": " Tengo y acá, jica y caca. Es decir, acá lo que yo hago es pasar por el otro lado, en si el intercambiar j y, y caca está en la otra dirección.",
        "start": 3277.48,
        "end": 3292.48
    },
    {
        "text": " Y esto, acá tenemos en esta dirección, es el sentido horario.",
        "start": 3293.48,
        "end": 3299.48
    },
    {
        "text": " Y esto es algo que existe solo la inimensión 3, que es una particularidad del inimensión 3, tiene una orientación.",
        "start": 3304.48,
        "end": 3313.48
    },
    {
        "text": " El sentido horario o negativo. Ok, esta convención, es decir, los matemáticos como a los matemáticos es gusta el molestar a la gente,",
        "start": 3314.48,
        "end": 3328.48
    },
    {
        "text": " decidieron que la convención de la hora era la convención negativa y después se ligieron la convención opuesta.",
        "start": 3328.48,
        "end": 3335.48
    },
    {
        "text": " Yo, de hecho, en Suiza se pueden comprar reloges a revés, que son reloges para matemáticos.",
        "start": 3335.48,
        "end": 3347.48
    },
    {
        "text": " Ok, que muestran la hora, pero en el sentido positivo, es decir, son reloges así.",
        "start": 3348.48,
        "end": 3356.48
    },
    {
        "text": " 12, 3, 6, 9, 1, 2, 4, 5, 7, 8, 9 y es 11. Se pueden comprar en Suiza.",
        "start": 3356.48,
        "end": 3368.48
    },
    {
        "text": " Reloges de matemáticos. Yo tengo un amigo que tenía una así y él tenía que ver en el sentido horario de los matemáticos,",
        "start": 3369.48,
        "end": 3379.48
    },
    {
        "text": " es decir, el sentido positivo y es el sentido positivo para los matemáticos.",
        "start": 3379.48,
        "end": 3384.48
    },
    {
        "text": " Ok, ahora vamos a suponer que solo vamos a trabajar con bases ordos normales positivas, es decir, sentido antiorario.",
        "start": 3384.48,
        "end": 3395.48
    },
    {
        "text": " ¿Qué es el sentido del abril de la mano del hecho de la...?",
        "start": 3399.48,
        "end": 3404.48
    },
    {
        "text": " Sí, esa es mi marrela, es la misma convención.",
        "start": 3404.48,
        "end": 3408.48
    },
    {
        "text": " Los físicos también trabajan en sentido horario, antiorario, positivo.",
        "start": 3408.48,
        "end": 3413.48
    },
    {
        "text": " Para mí la hora normal es esta.",
        "start": 3413.48,
        "end": 3418.48
    },
    {
        "text": " Entonces cada vez que yo le digo la hora, yo tengo que hacer una cinturilla, si no va a funcionar.",
        "start": 3418.48,
        "end": 3427.48
    },
    {
        "text": " No entiendo.",
        "start": 3428.48,
        "end": 3430.48
    },
    {
        "text": " Proceba al revés.",
        "start": 3430.48,
        "end": 3433.48
    },
    {
        "text": " Ok, ahora, entonces esto permite definir el producto vectorial.",
        "start": 3436.48,
        "end": 3441.48
    },
    {
        "text": " Definición.",
        "start": 3441.48,
        "end": 3444.48
    },
    {
        "text": " El producto vectorial.",
        "start": 3446.48,
        "end": 3449.48
    },
    {
        "text": " De dos vectores.",
        "start": 3450.48,
        "end": 3454.48
    },
    {
        "text": " U i b n r e 3.",
        "start": 3454.48,
        "end": 3458.48
    },
    {
        "text": " Está refiido. Es el vector.",
        "start": 3458.48,
        "end": 3463.48
    },
    {
        "text": " Esto es un producto que me construye un vector.",
        "start": 3463.48,
        "end": 3467.48
    },
    {
        "text": " U vectorial b se esfílias y un b.",
        "start": 3467.48,
        "end": 3473.48
    },
    {
        "text": " U vectorial b se esfílias y un b arreves.",
        "start": 3474.48,
        "end": 3479.48
    },
    {
        "text": " Se llama U vectorial b.",
        "start": 3479.48,
        "end": 3482.48
    },
    {
        "text": " Definido por...",
        "start": 3484.48,
        "end": 3487.48
    },
    {
        "text": " Y acá la definición es bastante complicada.",
        "start": 3490.48,
        "end": 3493.48
    },
    {
        "text": " Y después vamos a ver una carriestización de cuentas que será mucho más sencilla.",
        "start": 3493.48,
        "end": 3498.48
    },
    {
        "text": " El definido...",
        "start": 3499.48,
        "end": 3501.48
    },
    {
        "text": " Entonces tengo que definir su longitud y voy a empezar con su longitud.",
        "start": 3503.48,
        "end": 3509.48
    },
    {
        "text": " Con esa norma. Por definición la norma de U vectorial b es la norma de U por la norma de B por el seno del angular.",
        "start": 3509.48,
        "end": 3527.48
    },
    {
        "text": " Aparece el seno donde teta es el angular entre U i b.",
        "start": 3527.48,
        "end": 3539.48
    },
    {
        "text": " Y como siempre pueden ver que...",
        "start": 3539.48,
        "end": 3542.48
    },
    {
        "text": " ¿Qué pasa cuando uno de los dos vectores es nulo?",
        "start": 3542.48,
        "end": 3546.48
    },
    {
        "text": " El producto vectorial también será nulo, entonces esto tendremos problemas.",
        "start": 3546.48,
        "end": 3551.48
    },
    {
        "text": " Según la cosa.",
        "start": 3552.48,
        "end": 3555.48
    },
    {
        "text": " El producto vectorial por construcción es ortogonal a la vez a U y a B.",
        "start": 3557.48,
        "end": 3563.48
    },
    {
        "text": " Es decir, tenemos que U vectorial b es car U, es igual a U vectorial b es car B es igual a 0.",
        "start": 3563.48,
        "end": 3576.48
    },
    {
        "text": " Es decir, el vector U vectorial b es ortogonal a U i a B.",
        "start": 3576.48,
        "end": 3586.48
    },
    {
        "text": " Es decir, si U i b me define un plano, el producto vectorial está en la recta perpendicular.",
        "start": 3586.48,
        "end": 3597.48
    },
    {
        "text": " Ahora, pero esto no es suficiente porque si yo tengo, esto se me da la definición.",
        "start": 3602.48,
        "end": 3609.48
    },
    {
        "text": " Es decir, si yo tengo, ¿qué voy a hacer? Una figura acá.",
        "start": 3609.48,
        "end": 3616.48
    },
    {
        "text": " Yo tengo acá, mi vector U. Acá, mi vector D.",
        "start": 3616.48,
        "end": 3623.48
    },
    {
        "text": " Yo sé que mi vector es ortogonal a la vez a U y a B.",
        "start": 3623.48,
        "end": 3628.48
    },
    {
        "text": " Entonces, está o bien acá o bien acha.",
        "start": 3628.48,
        "end": 3633.48
    },
    {
        "text": " Y doce.",
        "start": 3633.48,
        "end": 3635.48
    },
    {
        "text": " Tengo su norma, tengo su dirección, me falta en qué sentido y el último es que la terna U, B y U vectorial b es positivo siempre.",
        "start": 3635.48,
        "end": 3655.48
    },
    {
        "text": " Es decir, si U está a C, B está a C, U vectorial b es a C.",
        "start": 3655.48,
        "end": 3662.48
    },
    {
        "text": " Sentido raro, anti-orrario, positivo, sentido positivo.",
        "start": 3664.48,
        "end": 3669.48
    },
    {
        "text": " Pero si yo intercambio U i b, U vectorial b se va a ir acha.",
        "start": 3669.48,
        "end": 3675.48
    },
    {
        "text": " Esto es la definición geometrica de U vectorial b.",
        "start": 3675.48,
        "end": 3682.48
    },
    {
        "text": " ¿Y qué pasa? Ahora, hay muchos cosas que no son claras.",
        "start": 3683.48,
        "end": 3689.48
    },
    {
        "text": " ¿Qué pasa? Acá yo habré el plano por U i b y ¿qué pasa cuando U i b es un corineales?",
        "start": 3689.48,
        "end": 3696.48
    },
    {
        "text": " Este plano sólo está definido cuando U i b no son corineales, pero ¿qué pasa cuando son corineales?",
        "start": 3698.48,
        "end": 3703.48
    },
    {
        "text": " La cosa es que cuando son corineales, teta el ángulo es cero, o bien p, pero ambos casos también puede ser p, pero ambos casos el cero va a cero.",
        "start": 3704.48,
        "end": 3716.48
    },
    {
        "text": " Entonces, ese producto vectorial desaparece.",
        "start": 3716.48,
        "end": 3719.48
    },
    {
        "text": " ¿Y qué hay cuando si es un p, pero que podría ser un p, pero que podría ser un p, eh?",
        "start": 3719.48,
        "end": 3723.48
    },
    {
        "text": " ¿Productora normal y un? ¿Producto a caler el otro?",
        "start": 3723.48,
        "end": 3726.48
    },
    {
        "text": " No, no, acá esto es el producto de reales. Acá es el producto de escarad de esto.",
        "start": 3726.48,
        "end": 3732.48
    },
    {
        "text": " Esto es, esto digo que este vector es hortodonalau, porque si vuelas cero, y este vector es hortodonalau, porque si vuelas cero.",
        "start": 3732.48,
        "end": 3740.48
    },
    {
        "text": " Eso que yo digo, esto mismo, U vectorial b es hortodonal, U i a b a la vez.",
        "start": 3740.48,
        "end": 3746.48
    },
    {
        "text": " Esta definición de producto es vectorial.",
        "start": 3746.48,
        "end": 3750.48
    },
    {
        "text": " Ok, y tenemos que terminar con las propiedades de producto vectorial. Ok, propiedades.",
        "start": 3750.48,
        "end": 3758.48
    },
    {
        "text": " ¿Propiedades?",
        "start": 3759.48,
        "end": 3764.48
    },
    {
        "text": " ¿Propiedades?",
        "start": 3764.48,
        "end": 3767.48
    },
    {
        "text": " ¿Propiedades?",
        "start": 3782.48,
        "end": 3785.48
    },
    {
        "text": " ¿Propiedades?",
        "start": 3786.48,
        "end": 3788.48
    },
    {
        "text": " Primero a cosa es que ¿cuál es la significación de la norma de producto vectorial?",
        "start": 3788.48,
        "end": 3797.48
    },
    {
        "text": " La norma del producto vectorial, acá es un producto de distancias, es un área.",
        "start": 3797.48,
        "end": 3803.48
    },
    {
        "text": " Es el doble del área del triángulo formado por U ibe.",
        "start": 3803.48,
        "end": 3809.48
    },
    {
        "text": " Esa interpretación, uno, la norma del producto vectorial, es el doble del área del triángulo formado por U ibe.",
        "start": 3810.48,
        "end": 3838.48
    },
    {
        "text": " Es decir, en la figura acá, este triángulo, su área es la norma de U vectorial b divido por 2.",
        "start": 3839.48,
        "end": 3852.48
    },
    {
        "text": " En el particular, cuando ambos vectores son coliniales, ¿qué pasa?",
        "start": 3856.48,
        "end": 3860.48
    },
    {
        "text": " El triángulo está degenerado, su área es 0 y el producto vectorial tiene normas de error, entonces es nulo.",
        "start": 3861.48,
        "end": 3869.48
    },
    {
        "text": " Entonces, el producto vectorial, en término de norma, mide el área del triángulo, a menos de un factor 2.",
        "start": 3872.48,
        "end": 3881.48
    },
    {
        "text": " Según la cosa, es que 2 es el producto vectorial, es nulo, y acá es un vector nulo, porque el producto vectorial es el vector nulo cuando la norma va a ser 0.",
        "start": 3881.48,
        "end": 3910.48
    },
    {
        "text": " Cuando son coliniales, es decir, es un sí solo sí, sí solo sí, U ibe son coliniales.",
        "start": 3911.48,
        "end": 3920.48
    },
    {
        "text": " Entonces, es muy interesante porque el producto es que me mide si dos vectores son nordubuales o no, mientras el producto vectorial me mide si son coliniales o no.",
        "start": 3923.48,
        "end": 3934.48
    },
    {
        "text": " Y 3, el producto vectorial, y ahora vamos a ver vectorial, es anticonmutativo, y acá la cosa importante es antici, ¿vo a explicar?",
        "start": 3935.48,
        "end": 3962.48
    },
    {
        "text": " No es commutativo, pero cuando eso intercambio U ibe tengo que cambiar el signo, es decir, U vectorial B es igual a menos vectorial.",
        "start": 3963.48,
        "end": 3978.48
    },
    {
        "text": "",
        "start": 3978.48,
        "end": 3979.48
    },
    {
        "text": " Y no es una operación asociativa, de hecho, voy a hablar directamente de pero por otro lado se portabien.",
        "start": 4009.48,
        "end": 4022.48
    },
    {
        "text": " Es decir, lambda U vectorial B es igual a U vectorial lambda B y es igual a lambda U vectorial B, es decir, respecto al producto por un escar, se portabien.",
        "start": 4023.48,
        "end": 4042.48
    },
    {
        "text": " ¿Cómo para las matrices si los productos escar ares, es decir, los números se pueden viajar al dentro del producto vectorial? ¿Cómo para el producto de matrices?",
        "start": 4043.48,
        "end": 4053.48
    },
    {
        "text": " Y por supuesto, ¿por qué se llama un producto? ¿Por qué es distributiva? ¿Cómo siempre?",
        "start": 4053.48,
        "end": 4062.48
    },
    {
        "text": " Si no, nosotros matemáticos no podemos llamar a este producto, es una terminología reservada.",
        "start": 4063.48,
        "end": 4070.48
    },
    {
        "text": " Es decir, podríamos hacer cuentas. Ok, 5 es que U1 más U2 vectorial B es igual a U1 más U1 vectorial B,",
        "start": 4074.48,
        "end": 4091.48
    },
    {
        "text": " más U2 vectorial B y funciona el mismo modo por otro lado. U vectorial B1 más V2 es igual a U vectorial B1 más U vectorial B2, es decir, se pueden desorrochar las expresiones.",
        "start": 4092.48,
        "end": 4112.48
    },
    {
        "text": " Manteniendo el orden, es decir, si U está por la izquierda IB, por la derecha, tengo que mantener U por la izquierda IB por la derecha. ¿Cómo para las matrices?",
        "start": 4113.48,
        "end": 4126.48
    },
    {
        "text": " Ya vimos que tuvimos un problema de connotatividad con las matrices. Ok, y esto es la razón porque se llama un producto.",
        "start": 4126.48,
        "end": 4135.48
    },
    {
        "text": " Y ahora, de hecho, no es una operación asociativa. Ojo, observación, ojo, ojo. Esta operación no es asociativa.",
        "start": 4142.48,
        "end": 4160.48
    },
    {
        "text": " Es decir, U vectorial B vectorial W en general existinto de U vectorial B, el todo vectorial W. Ojo, es decir, cuando tienen productos vectoriales, no tienen derecho a sacar las paréntesis.",
        "start": 4161.48,
        "end": 4182.48
    },
    {
        "text": " La primera vez que vemos una operación no es asociativa. Pero tenemos esta siguiente propiedad y esta propiedad que nunca me morizo porque nunca la necesito es una propiedad de cultura general.",
        "start": 4183.48,
        "end": 4196.48
    },
    {
        "text": " Esta propiedad verifica la propiedad rara siguiente que es que U vectorial B vectorial W, más, ahora yo hago un ciclo.",
        "start": 4197.48,
        "end": 4210.48
    },
    {
        "text": " B vectorial W vectorial U hago el otro ciclo, más, W vectorial U vectorial B. Puede ver cómo hice el ciclo. Esto es igual a ese vectoro, siempre.",
        "start": 4210.48,
        "end": 4233.48
    },
    {
        "text": " En la práctica, casi nunca necesite de estar regla. Es decir, las reglas anteriores son mucho más importantes.",
        "start": 4234.48,
        "end": 4244.48
    },
    {
        "text": " Ok, y se pueden deducir un montón de cosas, pero no sé si yo voy a hablar de eso lo esto. Ok, el particular lo que se obtiene es que no, no lo importa.",
        "start": 4245.48,
        "end": 4260.48
    },
    {
        "text": " La cosa que es importante es la expresión, es una base de orto normal positiva. Esto es importante.",
        "start": 4261.48,
        "end": 4268.48
    },
    {
        "text": " Es una base de orto normal positiva.",
        "start": 4268.48,
        "end": 4291.48
    },
    {
        "text": " Y vamos a concluirlo de esta cosa. Ok, entonces tenemos la siguiente formula.",
        "start": 4298.48,
        "end": 4321.48
    },
    {
        "text": " Si la proposición, si la terna y j, es una base de orto normal positiva.",
        "start": 4321.48,
        "end": 4341.48
    },
    {
        "text": " Entonces, para todos U y V en N y R3, tengo la formula siguiente. El producto vectorial de U y V tiene tres componentes que voy a escribir en columna para cambiar.",
        "start": 4341.48,
        "end": 4362.48
    },
    {
        "text": " La primera componente, acá, hay que ver lo que pasa.",
        "start": 4363.48,
        "end": 4369.48
    },
    {
        "text": " Yo forgo una matriz siguiente. U, 1, U, 2, U, 2, U, 3, V1, V2, V3. Y la idea es que la primera coordenada de este producto vectorial es el determinante de la matriz que queda.",
        "start": 4370.48,
        "end": 4391.48
    },
    {
        "text": " Es decir, es U2 por V3 menos U3 por V2.",
        "start": 4392.48,
        "end": 4410.48
    },
    {
        "text": " Y después, que hago yo? Yo hago el ciclo. Es la única forma que me moricia en mi vida para el producto vectorial.",
        "start": 4411.48,
        "end": 4419.48
    },
    {
        "text": " Y esta es el determinante. Entonces me usa poca energía de cerebro. Y después, si yo quiero pasar, entonces 2 más 1, me hace que, el siguiente de 2.",
        "start": 4419.48,
        "end": 4431.48
    },
    {
        "text": " ¿Cuál es el siguiente de 2? 3, U3. ¿Cuál es el siguiente de 3? Es 1. Hacemos el ciclo. U3, U1, menos U1, U3, V1, disculpa.",
        "start": 4432.48,
        "end": 4445.48
    },
    {
        "text": " Por V3 y después ciclo, 2, 3, V1, 3, U1, V2, menos 3, U1, V2, 2, 3, V1. Hasta.",
        "start": 4446.48,
        "end": 4461.48
    },
    {
        "text": " Esa sí que yo me morriso las cosas. Me su tengo poco espacio en mi cerebro de generado.",
        "start": 4462.48,
        "end": 4469.48
    },
    {
        "text": " Entonces, tengo mucho de trucos para memorizar las cosas rápido. Es decir, la única formula es estáqueda. Y después hago el ciclo.",
        "start": 4469.48,
        "end": 4479.48
    },
    {
        "text": " Véngmelo, 2, 3, U1, 3, U1, 2, 3, U1, 2, 3, U1. Hago el ciclo. 1, 2, 3, U1, 2, 3, U1, 2, 3.",
        "start": 4479.48,
        "end": 4488.48
    },
    {
        "text": " Ok, y esto es la formula que calcula el producto vectorial. Y por supuesto, es una formula sencilla, ¿sí?",
        "start": 4488.48,
        "end": 4499.48
    },
    {
        "text": " El producto vectorial tiene un problema para el producto vectorial.",
        "start": 4500.48,
        "end": 4504.48
    },
    {
        "text": " De R3 es la cosa que quería decir antes para concluir. Por supuesto, acá es un problema. El producto vectorial solo existe en la dimensión 3.",
        "start": 4504.48,
        "end": 4514.48
    },
    {
        "text": " De hecho, existen otros productos vectoriales, pero involucran más vectores. Existe un producto vectorial en la dimensión 4, pero necesitamos tener 3 vectores.",
        "start": 4516.48,
        "end": 4528.48
    },
    {
        "text": " Para usar la formula del determinante. Y en dimensión 17, sólo ponemos hacer el producto vectorial de 16 vectores.",
        "start": 4529.48,
        "end": 4535.48
    },
    {
        "text": " No, porque el ciclo te lo hace directamente. De hecho, lo que pasa es que usas lo que se llama la comatriz.",
        "start": 4541.48,
        "end": 4547.48
    },
    {
        "text": " Los cofactores.",
        "start": 4548.48,
        "end": 4549.48
    },
    {
        "text": " El decir, cuando yo quiero calcular esta componente, yo hago este determinante con el ciclo, pero viene automáticamente con el ciclo.",
        "start": 4550.48,
        "end": 4561.48
    },
    {
        "text": " Esto dice básicamente que las coronadas y 1, 2 y 3 son iguales. Entonces, si yo tengo una formula que depende las coronadas 1, 2 y 3, sólo hay que hacer el ciclo para obtener las otras coronadas.",
        "start": 4562.48,
        "end": 4575.48
    },
    {
        "text": " Es mejor que memorizar las problemas de permutaciones de cino. Pienso que esta formula es más segura.",
        "start": 4576.48,
        "end": 4582.48
    },
    {
        "text": " Es decir, la idea es que el producto vectorial, una operación que no cambia nada, es reemplazar y por j, reemplazar j por k y k por y. Es una rotación.",
        "start": 4585.48,
        "end": 4595.48
    },
    {
        "text": " Esto no cambia nada.",
        "start": 4596.48,
        "end": 4598.48
    },
    {
        "text": " Ok, entonces tenemos esta formula y tenemos que concluir un poquito, tenemos esta formula. Quizás lo vamos a demostrar.",
        "start": 4599.48,
        "end": 4612.48
    },
    {
        "text": " Yo puedo que le demostrarlo, ¿no?",
        "start": 4613.48,
        "end": 4615.48
    },
    {
        "text": " Ok, vamos a demostrarlo. No cuesta mucho.",
        "start": 4617.48,
        "end": 4622.48
    },
    {
        "text": " Ok, será mucho más técnico. No sé si lo voy a hacer. Tienes o qué no, no. Porque les voy a confesar porque no lo voy a demostrar.",
        "start": 4629.48,
        "end": 4648.48
    },
    {
        "text": " Primero, la cosa es la misma técnica como anteriormente. Es decir, hay que descomponer un como demostración. La demostración es hay que hacer descomponer un, es igual a un o un por el vector y más u 2 por el vector j, más u 3 por el vector k.",
        "start": 4649.48,
        "end": 4670.48
    },
    {
        "text": " Ve eso mismo con los v.",
        "start": 4671.48,
        "end": 4673.48
    },
    {
        "text": " Y después hay que hacer el producto vectorial, desarrollar todo y hay que calcular lo que es y j y k.",
        "start": 4678.48,
        "end": 4685.48
    },
    {
        "text": " Y a que hay que memorizar, hay que usar, que y observa que cuesta el producto vectorial de y con y.",
        "start": 4685.48,
        "end": 4692.48
    },
    {
        "text": " ¿No? ¿Es cero porque son colinales? Un vector su producto de escalar con sí mismo siempre es nulo.",
        "start": 4693.48,
        "end": 4704.48
    },
    {
        "text": " Entonces, es su mismo que j por j y es su mismo que k por k.",
        "start": 4704.48,
        "end": 4711.48
    },
    {
        "text": " Producto de vectorial por k y esto es el vector nulo. Y después las otras reglas es que y por j me la k.",
        "start": 4711.48,
        "end": 4722.48
    },
    {
        "text": " J por k me da y y k por y, esto es el ciclo, me da j y a raíz es j por y, me da menos k, esta al revés.",
        "start": 4723.48,
        "end": 4741.48
    },
    {
        "text": " Y lo mismo k por j me da menos y y por k me da menos j, ok, acá voy a revés.",
        "start": 4742.48,
        "end": 4759.48
    },
    {
        "text": " Acá pueden desarrollar, van a obtener nueve términos y como saben calcular todos sus paredes de productos vectoriales de los vectores de base,",
        "start": 4760.48,
        "end": 4773.48
    },
    {
        "text": " todo se va a simplificar y se va a obtener esta fórmula. Es decir, lo que van a obtener es esto por el vector y,",
        "start": 4773.48,
        "end": 4781.48
    },
    {
        "text": " más esto por el vector j, más esto por el vector k. Es lo que va a obtener. Eje así, yo después, haceras cuentas.",
        "start": 4781.48,
        "end": 4791.48
    },
    {
        "text": " ¿Els tienen la recorrenada en mi encotejada?",
        "start": 4792.48,
        "end": 4801.48
    },
    {
        "text": " Sí. Acá hay que tomar esta expresión. Producto de vectorial esta expresión va a obtener nueve términos,",
        "start": 4801.48,
        "end": 4813.48
    },
    {
        "text": " van a obtener uno por ve uno por y vectorial y esto desaparece, toda la diagonal vale desaparecer y van a obtener una matriz antísimétrica,",
        "start": 4813.48,
        "end": 4825.48
    },
    {
        "text": " más uno y por ve dos cotas, es decir, uno ve dos por y por cotas, es decir, uno ve dos k y el uno ve dos k ya está acá, etc., etc., y van a obtener la fórmula que viene acá.",
        "start": 4825.48,
        "end": 4841.48
    },
    {
        "text": " Eje asesión, que ya la han las cosas. Ok. Ahora, vamos a ver las aplicaciones a la geometría.",
        "start": 4841.48,
        "end": 4855.48
    },
    {
        "text": " Entonces, lo que hay que memorizar hoy es decir, tenemos dos herramientas y el producto vectorial vamos a ver que tiene muchas aplicaciones a la geometría.",
        "start": 4855.48,
        "end": 4866.48
    },
    {
        "text": " Y, no sé qué, qué hora es, 50 y 4, quizá voy a hacer las aplicaciones a la geometría la próxima vez. Ok. Muchas gracias.",
        "start": 4866.48,
        "end": 4877.48
    }
]