[
    {
        "text": " Bueno, esta es la demostración del otro día, está tal cual la hicimos nosotros, es parecida",
        "start": 0.0,
        "end": 10.56
    },
    {
        "text": " a la que está el libro, el otro día ya la habíamos cambiado un poquito a la del libro",
        "start": 10.56,
        "end": 15.16
    },
    {
        "text": " para hacer la masoa, a ver más fácil de comprender y en un momento se nos dio vuelta",
        "start": 15.16,
        "end": 21.48
    },
    {
        "text": " en su víndice, está la foto en el Eva del Pizarron, Marquian Rojo en el momento que se nos",
        "start": 21.48,
        "end": 26.88
    },
    {
        "text": " dio vuelta en su víndice en el Eva y acá le escribí todo bien, lo que les propongo",
        "start": 26.88,
        "end": 35.92
    },
    {
        "text": " es para arrancar, en vez de esa lación el Pizarron si les parece, mientras yo voy armando",
        "start": 35.92,
        "end": 42.6
    },
    {
        "text": " las cosas, le vamos a lescendo, es la misma construcción del otro día y la corregimos a ver",
        "start": 42.6,
        "end": 48.28
    },
    {
        "text": " si hay algún etaje, si se entiende, si nos entiende, el lema decía que si tienes una",
        "start": 48.28,
        "end": 53.599999999999994
    },
    {
        "text": " matriz con diagonal dominante entonces es invertible, está bueno el resultado realmente",
        "start": 53.6,
        "end": 59.72
    },
    {
        "text": " matemáticamente está bueno y la definición de diagonal dominante que pregunta a lesandra",
        "start": 59.72,
        "end": 64.08
    },
    {
        "text": " es la que comenzamos poniendo en la demostración, si existe un vector de coordinadas positivas",
        "start": 64.08,
        "end": 72.36
    },
    {
        "text": " de su uno de su edad de suene, todas positivas tal que si vos haces el producto de ese vector",
        "start": 72.36,
        "end": 82.12
    },
    {
        "text": " digamos, vos miras una columna de la matriz B, mira te paras en una columna, la miras",
        "start": 82.12,
        "end": 87.36
    },
    {
        "text": " multiplicarse el jota jota de esa columna, la columna jota no, el jota jota de esa columna",
        "start": 87.36,
        "end": 93.08000000000001
    },
    {
        "text": " en norma porque son todos los elementos complejos y estamos comparando entonces para comparar",
        "start": 93.08000000000001,
        "end": 97.84
    },
    {
        "text": " le tomamos la norma, lo multiplicarse el jota jota de esa columna en norma por el de su",
        "start": 97.84,
        "end": 104.08000000000001
    },
    {
        "text": " jota y ese valor te da mayor que la suma de todos los demás con el mismo procedimiento,",
        "start": 104.08000000000001,
        "end": 109.96000000000001
    },
    {
        "text": " o sea mayor que de suí por la norma de ver suijota pero eso para todas las columnas,",
        "start": 109.96,
        "end": 117.0
    },
    {
        "text": " dice ahí para todo jota igual uno de dos enes, ¿no? Eso que tenga diagonal dominante,",
        "start": 117.0,
        "end": 126.32
    },
    {
        "text": " los dichos de la manera en los términos de la diagonal le ganan el resto, en norma, está",
        "start": 126.32,
        "end": 132.04
    },
    {
        "text": " bien, es lo mismo, es lo que lo dijimos en clase, es lo mismo que tomar el D esa columna",
        "start": 132.04,
        "end": 141.92
    },
    {
        "text": " o ese vector de coordenadas positivas, lo tomas como si fuera una matriz diagonal y",
        "start": 141.92,
        "end": 148.23999999999998
    },
    {
        "text": " consideras de por B, entonces lo que hiciste es les pusiste el peso a cada fila en B,",
        "start": 148.23999999999998,
        "end": 156.12
    },
    {
        "text": " lo verdad porque el D está multiplicando digamos el D1 a toda la primera fila, el D2 a toda",
        "start": 156.12,
        "end": 163.04
    },
    {
        "text": " la segunda fila, el Dn toda la última fila, entonces cuando vos haces este procedimiento",
        "start": 163.04,
        "end": 171.04
    },
    {
        "text": " de por B lo que te haces siendo eso, el D1 a toda la primera fila, el D2 a toda la fila,",
        "start": 171.04,
        "end": 177.28
    },
    {
        "text": " entonces es como antes de multiplicar es como una suma ponderada, vos haces una suma",
        "start": 177.28,
        "end": 184.88
    },
    {
        "text": " ponderada y decir que el término de jota jota le ganan los demás, el módulo, de",
        "start": 184.88,
        "end": 190.68
    },
    {
        "text": " apuedes multiplicar lo que te haces siendo en mirar la columna sin ponderar, mirar la columna,",
        "start": 190.68,
        "end": 195.07999999999998
    },
    {
        "text": " ya multiplicado, mirar la columna, decir el término de jota jota le ganan los demás,",
        "start": 195.07999999999998,
        "end": 199.0
    },
    {
        "text": " eso y lo que tenemos que acordarnos de D1 a dominante, está bien, es fuerte el resultado,",
        "start": 199.0,
        "end": 203.48
    },
    {
        "text": " con esta condición sencilla resulta que es invertible, le decía Santiago antes, cuando venimos",
        "start": 203.48,
        "end": 210.16
    },
    {
        "text": " caminando que tuve a punto a no venir porque está la bosta hecha pedazo, pero vamos a",
        "start": 210.16,
        "end": 216.92
    },
    {
        "text": " hacer todo lo posible, porque no me quiero atrazar, realmente estamos disfrutando, yo estoy",
        "start": 216.92,
        "end": 222.35999999999999
    },
    {
        "text": " disfrutando mucho del curso y quiero que avance el máximo posible, bueno entonces ¿qué",
        "start": 222.35999999999999,
        "end": 226.68
    },
    {
        "text": " dijimos en clase? Queremos probar que C igual D por B es invertible, con lo cual",
        "start": 226.68,
        "end": 233.8
    },
    {
        "text": " buscente el panente sí, también lo vimos en la clase pasada, eso implica que B es invertible,",
        "start": 233.8,
        "end": 238.56
    },
    {
        "text": " ¿ok? ¿Por qué? Bueno, sabemos por muchísimas razones, pero bueno, por ejemplo porque",
        "start": 238.56,
        "end": 243.6
    },
    {
        "text": " el determinante D es el determinante D por el determinante D y si el determinante D es",
        "start": 243.6,
        "end": 249.48
    },
    {
        "text": " el distinto de 0, los otros tienen el distinto de 0 y por lo tanto son... Por ejemplo,",
        "start": 249.48,
        "end": 255.44
    },
    {
        "text": " que es un argumento distinto al que es la clase pasada, pero hay mil argumentos posible.",
        "start": 255.44,
        "end": 259.6
    },
    {
        "text": " Bueno, ahora bien, dice, recordemos que una matriz es invertible, si solamente si su",
        "start": 259.6,
        "end": 263.8
    },
    {
        "text": " respuesta lo es, por ejemplo por ejemplo eso, porque una matriz invertible si solamente",
        "start": 263.8,
        "end": 270.0
    },
    {
        "text": " si la matriz es la otra respuesta, es que es un argumento de tanto posible, determinante,",
        "start": 270.0,
        "end": 274.52000000000004
    },
    {
        "text": " ese mismo determinante, otra vez lo mismo. Entonces vamos a probar en realidad que C T es",
        "start": 274.52000000000004,
        "end": 279.8
    },
    {
        "text": " invertible, ¿ok? Y acá lo puse en el erito y esto hablaremos por absurdo, o sea que vamos",
        "start": 279.8,
        "end": 286.52
    },
    {
        "text": " a suponer que C T no es invertible, vamos a llevar una contradicción, asumamos C T que",
        "start": 286.52,
        "end": 292.04
    },
    {
        "text": " no es invertible, ¿ok? Entonces implica que la transformación lineal que va a ser N,",
        "start": 292.04,
        "end": 299.84000000000003
    },
    {
        "text": " N, T tiene núcleo, ¿por qué implica eso que tiene núcleo? Porque como es cuadrada va a",
        "start": 299.84000000000003,
        "end": 306.52000000000004
    },
    {
        "text": " ser N, N, S, si no tuviera núcleo ya te queda invertible, pues el tema de las dimensiones,",
        "start": 306.52000000000004,
        "end": 312.52000000000004
    },
    {
        "text": " núcleo 0 e imagen todo va a ser, ¿ok? Por el tema de las dimensiones, o sea, te queda",
        "start": 312.52000000000004,
        "end": 317.8
    },
    {
        "text": " inevitablemente bisectivo, ¿ok? Porque es cuadrada ¿no? Es una transformación de las",
        "start": 317.8,
        "end": 323.12
    },
    {
        "text": " mismas dimensiones de dominio con mí. Bueno, entonces quiere decir que hay alguien en el núcleo,",
        "start": 323.12,
        "end": 328.44
    },
    {
        "text": " un vector X que tal que C T por X es 0, un vector X no nulo ¿no? Porque está en el núcleo",
        "start": 328.44,
        "end": 334.28000000000003
    },
    {
        "text": " no trivial. Bueno y decir que C T por X es 0, lo mismo que decir, o sea, toma la respuesta",
        "start": 334.28000000000003,
        "end": 341.08000000000004
    },
    {
        "text": " del producto, C T por X igual el vector nulo, toma todo la respuesta, el transporte",
        "start": 341.08000000000004,
        "end": 346.96000000000004
    },
    {
        "text": " nulo es el nulo y del otro lado que te queda, transporta de X por C, o sea, por la",
        "start": 346.96,
        "end": 353.59999999999997
    },
    {
        "text": " transporta de la respuesta, es el transporte, o sea, te vuelve a ser C ¿no verdad? Y",
        "start": 353.59999999999997,
        "end": 360.47999999999996
    },
    {
        "text": " ahí fue que cuando pusimos el producto hubiese que abrirlo, creo que lo puse bien, lo que",
        "start": 360.47999999999996,
        "end": 366.4
    },
    {
        "text": " está escrito ahí es el producto, X transporta por C, se no dio vuelta a la hilajota, ¿ok?",
        "start": 366.4,
        "end": 372.56
    },
    {
        "text": " Entonces a ver si está bien, vos tenés X transporta que es un vector horizontal, coordenadas",
        "start": 372.56,
        "end": 377.72
    },
    {
        "text": " X 1, Q 2, X n, lo multiplicas y te queda multiplicada por una columna de la otra ¿no?",
        "start": 377.72,
        "end": 385.96
    },
    {
        "text": " Entonces, se su 1 j, se su 2 j, se su por cada columna y la habíamos escrito a través,",
        "start": 385.96,
        "end": 392.6
    },
    {
        "text": " ese fue el error ¿ok? Y bueno, ese error no llevó a mantenerlo al final y no dio mal",
        "start": 392.6,
        "end": 397.92
    },
    {
        "text": " la desigualdad. Quiero decir, no queda un cambiado de los coeficientes hasta el final,",
        "start": 397.92,
        "end": 402.72
    },
    {
        "text": " acá lo escribí todo bien. Bueno, entonces tenemos esa que eso es igual a 0 porque el resultado",
        "start": 402.72,
        "end": 409.28000000000003
    },
    {
        "text": " es el vector nulo para todo j, para todas las columnas, esto es lo mismo, para la primera",
        "start": 409.28000000000003,
        "end": 414.36
    },
    {
        "text": " columna, la segunda columna, toda la columna, toda la columna. Ahora bien, dice, el vector",
        "start": 414.36,
        "end": 419.40000000000003
    },
    {
        "text": " X, el vector X no es nulo, eso es un vector que está en sea la n, tiene todas coordenadas",
        "start": 419.4,
        "end": 428.76
    },
    {
        "text": " complejas, no es nulo. Entonces, lo otro igual, y si lo mismo la clase pasada, miras las",
        "start": 428.76,
        "end": 434.64
    },
    {
        "text": " normas de esas coordenadas, las normas son todos números reales, mayor y igual que",
        "start": 434.64,
        "end": 440.79999999999995
    },
    {
        "text": " serios y la puedes comparar. Si a ver, quién es más grande, cuál es la norma más grande",
        "start": 440.79999999999995,
        "end": 445.15999999999997
    },
    {
        "text": " está coordenada, y le puse X, Y, después la segunda, X, Y, Y, Y, y así hasta X, Y, Y,",
        "start": 445.24,
        "end": 451.92
    },
    {
        "text": " Y, y que vendría esa la más chiquita. Pero como el vector no es nulo, la norma más",
        "start": 451.92,
        "end": 456.64000000000004
    },
    {
        "text": " llora es mayor que 0, cierto, porque si la norma más llora fuera 0, son todos 0 y sería",
        "start": 456.64000000000004,
        "end": 462.28000000000003
    },
    {
        "text": " lo que es el vector número. Bueno, eso es fundamental que la norma más llora, o sea,",
        "start": 462.28000000000003,
        "end": 466.64000000000004
    },
    {
        "text": " X, Y, la norma de X, Y, Y, Y, y más llora que 0. Bueno, ahora bien, recordemos la",
        "start": 466.64000000000004,
        "end": 472.68
    },
    {
        "text": " cuestión que tenemos dos reglones arriba, esa cuestión sítica decía que la suma de X, Y",
        "start": 472.68,
        "end": 477.68
    },
    {
        "text": " por C, Y, J, E, C, para todo J, ¿no verdad? Y entonces lo específico para Y, y su 1,",
        "start": 477.68,
        "end": 484.84000000000003
    },
    {
        "text": " en vez de tomar J cualquiera, tomo Y, y su 1, el que la norma de X y su 1 es la más",
        "start": 484.84000000000003,
        "end": 490.08
    },
    {
        "text": " grande posible. Y entonces su tituyo, y ya se paro, pongo por un lado, X y su 1 por C,",
        "start": 490.08,
        "end": 498.0
    },
    {
        "text": " Y su 1 y su 1, y del otro lado ahí me faltó el menos ¿no? Nos faltó el menos a yubrises,",
        "start": 498.0,
        "end": 506.56
    },
    {
        "text": " lo cual no nos va a generar ningún problema después, pero lo voy a corregir en la versión",
        "start": 506.56,
        "end": 511.24
    },
    {
        "text": " de la deliva, esto sería con menos. Como en seguida, tomo la norma no va a tener",
        "start": 511.24,
        "end": 518.48
    },
    {
        "text": " ningún problema, pero falta un menos ahí ¿no? Se dan cuenta lo que dice, se parece, puse",
        "start": 518.48,
        "end": 523.32
    },
    {
        "text": " el que su y su 1 por C su y su 1 y su 1 igual a la suma de los restantes ¿ok? Bueno",
        "start": 523.32,
        "end": 532.24
    },
    {
        "text": " bien, entonces tomamos la norma a la izquierda y a la derecha, pero la norma del de la",
        "start": 532.24,
        "end": 539.0
    },
    {
        "text": " izquierda es el producto de las normas, eso lo sabemos y la norma del de la derecha que",
        "start": 539.0,
        "end": 547.6400000000001
    },
    {
        "text": " todavía ahí en ese momento falta el menos, pero después como uso el atrangulares,",
        "start": 547.6400000000001,
        "end": 552.8000000000001
    },
    {
        "text": " el menor igual que la suma de las normas y la suma de las normas, el suma del producto",
        "start": 552.8,
        "end": 557.5999999999999
    },
    {
        "text": " es a dos normas ¿no? ¿no? ¿no? porque estaba dentro de ese producto de las normas, ahí",
        "start": 557.5999999999999,
        "end": 560.88
    },
    {
        "text": " saben que el menos no nos ha complicado para nada porque se va en ese instante y esto",
        "start": 560.88,
        "end": 567.0
    },
    {
        "text": " es el último menor igual, ¿cuál es? Cambié la norma de X y por la norma de X y su",
        "start": 567.0,
        "end": 574.28
    },
    {
        "text": " 1, que es la coordenada que tenía norma mayor ¿no? Se dan cuenta, entonces como los",
        "start": 574.28,
        "end": 579.7199999999999
    },
    {
        "text": " son todos números positivos porque estoy tomando norma, puedo hacerlo y te queda menor",
        "start": 579.72,
        "end": 583.28
    },
    {
        "text": " igual ¿no? Entonces miren la punta izquierda y la punta derecha, la norma de X y su",
        "start": 583.28,
        "end": 590.28
    },
    {
        "text": " 1 termina siendo menor igual que la suma de las normas, todo multiplicado de X y su 1,",
        "start": 590.28,
        "end": 596.96
    },
    {
        "text": " la norma de X y su 1 por la norma de todos los demás muchachos, es su y y su 1.",
        "start": 596.96,
        "end": 601.76
    },
    {
        "text": " ¿Aye? Sí, para decir que acabar que tenga un unir lo que era norma en el producto,",
        "start": 601.76,
        "end": 610.46
    },
    {
        "text": " si va la propera norma ¿no? ¿sí? ¿eso os vale en este caso igual o?",
        "start": 610.46,
        "end": 615.64
    },
    {
        "text": " Siempre, siempre, siempre, siempre, cuando estamos en los complejos, la norma de X y",
        "start": 615.64,
        "end": 625.08
    },
    {
        "text": " de U por V es la norma de U por la norma de V. ¿Pero? ¿no? No, claro, a ver, dejame",
        "start": 625.08,
        "end": 643.4000000000001
    },
    {
        "text": " empezar, si estoy metiendo la pata en algo, se acorran eso, yo lo es exactamente, si ponemos",
        "start": 643.4,
        "end": 656.88
    },
    {
        "text": " U como les notaban el R con angulotita, el R sumo, el R sumo y al otro al V lo llamo",
        "start": 656.88,
        "end": 667.28
    },
    {
        "text": " el R sub V con la catita sub y la catita sub V. Entonces, el producto, de esta manera,",
        "start": 667.28,
        "end": 674.28
    },
    {
        "text": " si hace R sub por R sub V con la suma, con la suma y la suma, pero cuál es la norma",
        "start": 674.28,
        "end": 688.3199999999999
    },
    {
        "text": " acá, es esta, R sub por R sub V que es el producto de la norma, siempre el producto",
        "start": 688.32,
        "end": 696.1600000000001
    },
    {
        "text": " es más fácil con esta notación y la suma más fácil con la otra notación.",
        "start": 696.1600000000001,
        "end": 699.48
    },
    {
        "text": " ¿Y el angulotita subo a la mitad de la notación? Creo que no.",
        "start": 699.48,
        "end": 705.5600000000001
    },
    {
        "text": " El angulotita no puede estar más fácil con la notación. El angulotita, vamos a hacerlo,",
        "start": 705.56,
        "end": 712.56
    },
    {
        "text": " ¿verdad? El angulotita me parece que es la suma, la suma, no quiero entrar en la",
        "start": 712.56,
        "end": 727.04
    },
    {
        "text": " seta cuenta, pero es la suma, si, es la suma. Yo no sé cómo lo vi en ustedes, complejos",
        "start": 727.04,
        "end": 734.76
    },
    {
        "text": " en cálculo 1 o cálculo 2, pero si quieren suba alguna notación o alguna... También",
        "start": 734.76,
        "end": 745.3199999999999
    },
    {
        "text": " puede ser que le hayan cambiado la notación, en vez de hacer así, lo llaman así en los",
        "start": 745.3199999999999,
        "end": 749.0
    },
    {
        "text": " complejos, esto es lo más habitual.",
        "start": 749.0,
        "end": 753.16
    },
    {
        "text": " Bueno, dicho esto y repasado esto siempre es importante, ¿qué no? ¿Qué pones",
        "start": 753.16,
        "end": 764.3199999999999
    },
    {
        "text": " las dudas? Bueno, ¿qué pasó? Al final de cuenta tengo el término del izquierdo, tengo",
        "start": 764.3199999999999,
        "end": 769.8399999999999
    },
    {
        "text": " el término de la derecha y los dos términos están todos multiplicados por la norma de",
        "start": 769.8399999999999,
        "end": 774.3199999999999
    },
    {
        "text": " XI, ¿qué hace un ratito? Advertimos, que era mayor que ser esa norma, para que advertimos",
        "start": 774.3199999999999,
        "end": 781.88
    },
    {
        "text": " porque voy a dividir todo entre la norma de XI y XI y entonces nos queda exactamente",
        "start": 781.88,
        "end": 786.68
    },
    {
        "text": " que la norma de XI, XI y XI es menor igual, ¿no? Fijo acá, divido todo, que la suma de",
        "start": 786.68,
        "end": 794.6
    },
    {
        "text": " las normas de XI y XI con XI, o sea, estás comparando en la matricé el coeficiente del",
        "start": 794.6,
        "end": 805.08
    },
    {
        "text": " medio, digamos, el coeficiente XI y XI con todos los demás, se interió exactamente al",
        "start": 805.08,
        "end": 809.08
    },
    {
        "text": " revés. Ahora para llegar a la contradición, ¿no? Porque nosotros sabíamos que vet era",
        "start": 809.08,
        "end": 816.24
    },
    {
        "text": " de diagonal dominante y yo les dije que vez de diagonal dominante quiere decir esto,",
        "start": 816.24,
        "end": 821.36
    },
    {
        "text": " pero también se puede ver después de multiplicar por D, se puede ver comparando en las columnas",
        "start": 821.36,
        "end": 827.0
    },
    {
        "text": " de C y ese exactamente al revés, no que nos quedó acá. Y lo que hago en este reclocito",
        "start": 827.0,
        "end": 832.2
    },
    {
        "text": " es desarmar, digo bueno, como sé, es igual a D por B se tiene que C su I su I su I, I su I",
        "start": 832.2,
        "end": 838.5200000000001
    },
    {
        "text": " su I, no es D su I su I o por B su I su I su I y su I, y en tanto que C su I y su I es",
        "start": 838.52,
        "end": 844.56
    },
    {
        "text": " D su I por B su I y su I, ¿no? Recordando que los elementos son todos positivos, la desigualdad",
        "start": 844.56,
        "end": 851.6
    },
    {
        "text": " os se describe de esta manera, o sea, desarmar, ¿qué quiere decir cada uno? Y como los",
        "start": 851.6,
        "end": 857.1999999999999
    },
    {
        "text": " des son positivos los puedo sacar para afuera. Y si miras lo que te quedó en 3, de punta",
        "start": 857.1999999999999,
        "end": 861.4399999999999
    },
    {
        "text": " apunta a los del izquierda y la derecha de 3, es exactamente lo contrario a uno, es exactamente",
        "start": 861.4399999999999,
        "end": 867.88
    },
    {
        "text": " lo contrario a uno. Entonces, eso es una contradición. ¿Cuál es la contradición?",
        "start": 867.88,
        "end": 873.2
    },
    {
        "text": " Lo que estaba en itálico, haber asumido que C T no es invertible. Bueno, si C T es",
        "start": 873.2,
        "end": 879.76
    },
    {
        "text": " falso que C T no es invertible, quiere decir que C T es invertible. Por lo tanto C es",
        "start": 879.76,
        "end": 885.34
    },
    {
        "text": " invertible, por lo tanto B es invertible y ahí se se rolle de arena, ¿no? En la demostración",
        "start": 885.34,
        "end": 891.88
    },
    {
        "text": " de Eva le voy a cambiar, le voy a poner los signos menos que me nos faltaron, pero",
        "start": 891.88,
        "end": 895.12
    },
    {
        "text": " quizás sabemos que no nos cambian nada porque después se toma en oro. Bueno, chicos,",
        "start": 895.12,
        "end": 899.92
    },
    {
        "text": " esto era para corregir el detallecito de la que nos quedó en la demostración del clase",
        "start": 899.92,
        "end": 904.64
    },
    {
        "text": " pasada para los de Hopen Fing también, no tienen la hoja porque no viene, pero tienen el",
        "start": 904.64,
        "end": 911.04
    },
    {
        "text": " PDF en Eva. Ok, este es el lema que dice que toda matriz de adonante es invertible y",
        "start": 911.04,
        "end": 919.2
    },
    {
        "text": " acabamos de sacar un primer coroleal. Voy a escribir igual el lema acá para que quede.",
        "start": 919.2,
        "end": 932.44
    },
    {
        "text": " El ingом!",
        "start": 949.72,
        "end": 954.12
    },
    {
        "text": " A ver.",
        "start": 970.24,
        "end": 973.6
    },
    {
        "text": " Corori Status",
        "start": 974.6400000000001,
        "end": 976.9200000000001
    },
    {
        "text": " de la sision 1,3. Si tenemos una matriz a cuadrada con diagonal dominante",
        "start": 979.2,
        "end": 1007.72
    },
    {
        "text": " y dice el libro negativa, o sea lo que estamos diciendo en este caso es que a su y es menor",
        "start": 1007.72,
        "end": 1020.1600000000001
    },
    {
        "text": " que cero, porque queda muy raro estoy de diagonal dominante negativa, entonces lo aclaro",
        "start": 1020.1600000000001,
        "end": 1029.4
    },
    {
        "text": " en la hipótesis para que quede bien explicado, diagonal dominante negativa es que es de diagonal",
        "start": 1029.4,
        "end": 1036.0
    },
    {
        "text": " dominante pero además todos sus términos son negativos. Entonces los valores propios",
        "start": 1036.0,
        "end": 1047.24
    },
    {
        "text": " de A, los valores propios de A son valores propios complejos, todavía no es crimilatési",
        "start": 1047.24,
        "end": 1059.56
    },
    {
        "text": " sino lo valor de propios complejos, lo que voy a decir en la tesis es algo relativos",
        "start": 1059.56,
        "end": 1067.24
    },
    {
        "text": " o valores propios complejos, al ser número complejos tienen cada uno de sus valores propios,",
        "start": 1067.24,
        "end": 1074.8
    },
    {
        "text": " tiene una parte real y una parte compleja, bueno entonces dice que valores propios de A tienen",
        "start": 1074.8,
        "end": 1084.52
    },
    {
        "text": " de real negativo. En medio mágico no, sigue siendo medio mágico, a mí me encantan este",
        "start": 1084.52,
        "end": 1110.8799999999999
    },
    {
        "text": " tipo de resultados, tendrás que ver la diagonal dominante negativa con los valores propios,",
        "start": 1110.88,
        "end": 1122.3200000000002
    },
    {
        "text": " en medio mágico me encantan este tipo de resultados, ahí cuando uno se maravilla y lo más",
        "start": 1122.3200000000002,
        "end": 1129.8000000000002
    },
    {
        "text": " interesante después como conecta a todo con un modelo real como este modelo de Antif que",
        "start": 1129.8000000000002,
        "end": 1135.88
    },
    {
        "text": " estamos analizando y desarrollando. Bueno, entonces vamos a la demostración, tenemos",
        "start": 1135.88,
        "end": 1148.88
    },
    {
        "text": " el ando valor propio de A, tomamos uno cualquiera y bueno ahora matrisa como siempre le la notamos",
        "start": 1148.88,
        "end": 1164.68
    },
    {
        "text": " con los elementos a su hijota, matrisa cual era, ¿dónde? Entonces analicemos, supongamos,",
        "start": 1164.68,
        "end": 1182.04
    },
    {
        "text": " analicemos, supongamos que la parte real del anda es positiva a un ula. En este caso, en este",
        "start": 1182.04,
        "end": 1206.1599999999999
    },
    {
        "text": " caso yo lo que afirmo es que el módulo de A su i menos landa es mayor igual que el valor",
        "start": 1206.16,
        "end": 1217.4
    },
    {
        "text": " absoluto de A su i. Escribo despacito, no, no, no, no, no, no, no, no, no, no, no, este",
        "start": 1217.4,
        "end": 1229.76
    },
    {
        "text": " también tan medio seco. A ver, vamos a dibujarlo, a ver si estamos de acuerdo. Digimos primero",
        "start": 1229.76,
        "end": 1241.52
    },
    {
        "text": " que nada, a ver, hubo que ser, que los A su i son números reales negativos, acá, no se",
        "start": 1241.52,
        "end": 1248.24
    },
    {
        "text": " le ha me conocido que es negativa a la diagonal, está diciendo un montón de cosas, está",
        "start": 1248.24,
        "end": 1251.72
    },
    {
        "text": " diciendo que son reales y negativos. Bueno, entonces por acá está la su i, no, no, no, no,",
        "start": 1251.72,
        "end": 1257.24
    },
    {
        "text": " no, tomo uno cualquiera, una su i por acá, en la su i. Y entonces tomo ahora un vector",
        "start": 1257.24,
        "end": 1266.96
    },
    {
        "text": " landa donde la parte real sea positiva a un ula, empecemos con un dibujo positivo, no,",
        "start": 1266.96,
        "end": 1273.44
    },
    {
        "text": " entonces la parte real positiva a un ula es algo así, este es el landa y este es la",
        "start": 1273.44,
        "end": 1280.76
    },
    {
        "text": " parte real del landa. ¿Cierto?",
        "start": 1280.76,
        "end": 1284.28
    },
    {
        "text": " No me lo primero, porque todos los ponen que a, o sea, llevo una de las dos miradinos y",
        "start": 1284.28,
        "end": 1291.56
    },
    {
        "text": " por el cambio, pero va a estar compremos dos en el día, así, una parte de los a todos,",
        "start": 1291.56,
        "end": 1296.0
    },
    {
        "text": " es que hay una postura de la verdad. Ah, no, buena pregunta, no, sí, sí, lo que lo dije",
        "start": 1296.0,
        "end": 1301.8400000000001
    },
    {
        "text": " me sé en cremín pero va a ir en la pregunta. Cuando digo esto estoy afirmando dos cosas,",
        "start": 1301.84,
        "end": 1306.52
    },
    {
        "text": " primero que son reales y es más negativo, ¿de estoy diciendo? No, no, no, no, no, no,",
        "start": 1306.52,
        "end": 1312.84
    },
    {
        "text": " están en la hipótesis de diagonal dominante negativa, quiere decir que todos los elementos",
        "start": 1312.84,
        "end": 1318.6399999999999
    },
    {
        "text": " de diagonal son reales y negativos. Cuando ponen menor que cero, si módulo ni nada es",
        "start": 1318.6399999999999,
        "end": 1324.4399999999998
    },
    {
        "text": " porque puedes comparar con cero, se acuerdan lo que dijimos, cuando comparamos entre sí,",
        "start": 1324.4399999999998,
        "end": 1330.24
    },
    {
        "text": " estamos ya en los reales. Por eso tenemos que, si queremos comparar, metemos módulo,",
        "start": 1330.24,
        "end": 1334.88
    },
    {
        "text": " valoros eluto o bueno, en este caso ya sabemos que son negativos. Entonces, ¿qué pasa?",
        "start": 1334.88,
        "end": 1340.64
    },
    {
        "text": " ¿Qué pasa con a su I menos lambda? Te queda acá, ¿no? Esa es el vector a su I menos lambda.",
        "start": 1340.64,
        "end": 1353.24
    },
    {
        "text": " Este vector, el módulo es más grande que el A su I siempre que la parte real sea positiva",
        "start": 1353.24,
        "end": 1361.8
    },
    {
        "text": " y si la parte real es cero, la ver, ¿no? En general, ¿no? Tampongo otro rojo, otro posible",
        "start": 1361.8,
        "end": 1374.48
    },
    {
        "text": " lambda rojo, lo dibujo el lambda, también les amo el lambda, ponen el que tiene parte real.",
        "start": 1374.48,
        "end": 1379.92
    },
    {
        "text": " Cero, si este sería otro lambda posible, ¿cómo queda la su I menos lambda?",
        "start": 1379.92,
        "end": 1390.52
    },
    {
        "text": " Nevuelta, el módulo es mayor que a su I, ¿cuál es el único caso en que queda igual?",
        "start": 1395.04,
        "end": 1400.8000000000002
    },
    {
        "text": " O sea que lambda sea cero, cero, cero, cero, que lambda sea cero, el vector sea cero,",
        "start": 1400.8,
        "end": 1409.68
    },
    {
        "text": " cero, cero, cero, cero. ¿Y en ese caso puede suceder?",
        "start": 1409.68,
        "end": 1414.96
    },
    {
        "text": " ¿No podemos dar el projecimiento? Y por qué no puedes ser cero, muy bien.",
        "start": 1414.96,
        "end": 1422.8799999999999
    },
    {
        "text": " ¿Por qué es invertible? Porque es invertible, por eso es bucimo y todo acá.",
        "start": 1422.8799999999999,
        "end": 1428.1599999999999
    },
    {
        "text": " Si tiene diagonal dominante, es invertible, es invertible, entonces no tiene valor propioser.",
        "start": 1428.88,
        "end": 1435.48
    },
    {
        "text": " Lo pueden poner, lo escribimos en el cuaderno. Entonces el único caso que me daría exactamente igual,",
        "start": 1435.48,
        "end": 1441.4
    },
    {
        "text": " es ese, o sea que puedo poner siempre que es mayor estricto en realidad, ¿no?",
        "start": 1444.76,
        "end": 1449.2
    },
    {
        "text": " No sé si me sirve, pero bueno, digo esto siempre más.",
        "start": 1451.0,
        "end": 1453.0400000000002
    },
    {
        "text": " Bueno, sí vamos.",
        "start": 1459.16,
        "end": 1460.96
    },
    {
        "text": " Esto implica, yo lo escribo a ver si ustedes lo vean, que a menos lambda, por I, su N,",
        "start": 1469.2,
        "end": 1485.72
    },
    {
        "text": " tiene diagonal dominante.",
        "start": 1485.72,
        "end": 1489.04
    },
    {
        "text": " Hoy tengo ganas que escriban ustedes.",
        "start": 1499.04,
        "end": 1500.84
    },
    {
        "text": " Son dos pasos, más de una es, son dos ahí para llegar a la conclusión. ¿Quién quién me lo dice?",
        "start": 1502.1200000000001,
        "end": 1506.28
    },
    {
        "text": " O sea, en este entonces hay dos pasos.",
        "start": 1515.72,
        "end": 1533.76
    },
    {
        "text": " O sea, que los haz su química no tan para esa ser tan menos tan de desvia, no va a ser la definición de diagonal dominante.",
        "start": 1534.76,
        "end": 1543.8799999999999
    },
    {
        "text": " O sea, cuando vos te paras en una columna cualquiera, solo delitar en una diagonal,",
        "start": 1543.8799999999999,
        "end": 1550.28
    },
    {
        "text": " del que lo ponen el diagonal y todos los otros quedan normales.",
        "start": 1550.28,
        "end": 1552.92
    },
    {
        "text": " ¿Qué hay en igualitos que antes?",
        "start": 1552.92,
        "end": 1554.52
    },
    {
        "text": " En la paro será la definición y la sale.",
        "start": 1554.52,
        "end": 1556.32
    },
    {
        "text": " Claro. Este lo tenés que comparar lo que dijo Martínez, ¿no?",
        "start": 1556.32,
        "end": 1560.8799999999999
    },
    {
        "text": " Este lo tenés que comparar con el resto de cada columna, pero el resto de cada columna no se vieron modificados.",
        "start": 1560.88,
        "end": 1566.5600000000002
    },
    {
        "text": " Entonces sí, este es mayor igual que este y este le ganan los demás de la columna,",
        "start": 1566.5600000000002,
        "end": 1572.3600000000001
    },
    {
        "text": " porque acá decía que tenía diagonal dominante, ¿no?",
        "start": 1572.3600000000001,
        "end": 1575.88
    },
    {
        "text": " Entonces va a suceder eso.",
        "start": 1575.88,
        "end": 1578.44
    },
    {
        "text": " Ojo, alguien me puede decir, pero para diagonal dominante que multiplicar por las ponderaciones,",
        "start": 1578.44,
        "end": 1584.3200000000002
    },
    {
        "text": " podemos poner las ponderaciones que no cabe, quiero decir, hagan la cuenta por favor.",
        "start": 1584.3200000000002,
        "end": 1589.44
    },
    {
        "text": " Este ponga las ponderaciones y ese exactamente lo mismo que dijo Martín, se multiplican por los de su I,",
        "start": 1590.0,
        "end": 1599.4
    },
    {
        "text": " blah, blah, blah, etcétera, ¿ok?",
        "start": 1599.4,
        "end": 1602.24
    },
    {
        "text": " Los mismos coordenados del vector de su I sirve para la matriz a menos landa y entidad.",
        "start": 1602.24,
        "end": 1609.6000000000001
    },
    {
        "text": " Esto mismo que pongo en verde, o quiero decir, lo estoy dejando por gusto, lo que dijo Martín,",
        "start": 1609.6000000000001,
        "end": 1616.8400000000001
    },
    {
        "text": " está perfecto, esto es lo voy a poner como ejercicio de práctico.",
        "start": 1616.84,
        "end": 1620.8
    },
    {
        "text": " Por eso quiero que lo completen ustedes.",
        "start": 1624.0,
        "end": 1627.28
    },
    {
        "text": " Es hacer la cuentita y exactamente el concepto que dijo Martín.",
        "start": 1629.28,
        "end": 1633.0
    },
    {
        "text": " Ah bueno, entonces esa a menos landa y entidad tiene diagonal dominante,",
        "start": 1633.0,
        "end": 1638.24
    },
    {
        "text": " en particular es invertible.",
        "start": 1638.24,
        "end": 1642.36
    },
    {
        "text": " Y entonces Mateo, puede ser que es invertible esa a menos.",
        "start": 1646.84,
        "end": 1663.28
    },
    {
        "text": " Por eso quiero que se haga una contradición, supongamos que la parte real es positiva en Ula",
        "start": 1663.28,
        "end": 1667.6399999999999
    },
    {
        "text": " y quiero llegar al absurdo porque quiero probar lo contrario.",
        "start": 1667.6399999999999,
        "end": 1671.4399999999998
    },
    {
        "text": " ¿Por qué no es invertible?",
        "start": 1671.4399999999998,
        "end": 1675.3999999999999
    },
    {
        "text": " Claro, claro porque landa era valor propio, esa es absurdo, absurdo porque quién era landa,",
        "start": 1675.4,
        "end": 1684.72
    },
    {
        "text": " el valor propio.",
        "start": 1684.72,
        "end": 1686.4
    },
    {
        "text": " Entonces absurdo pues landa es valor propio.",
        "start": 1686.4,
        "end": 1691.44
    },
    {
        "text": " De a.",
        "start": 1691.44,
        "end": 1694.48
    },
    {
        "text": " ¿Cierto?",
        "start": 1694.48,
        "end": 1696.48
    },
    {
        "text": " Entonces es absurdo y si es absurdo lo que está mal es haber tomado que la parte real",
        "start": 1696.48,
        "end": 1701.42
    },
    {
        "text": " de landa es positiva en Ula.",
        "start": 1701.42,
        "end": 1703.9
    },
    {
        "text": " Conclusión la parte real de landa de cada landa, entonces la parte real de landa, como",
        "start": 1703.9,
        "end": 1715.22
    },
    {
        "text": " decía acá es negativa.",
        "start": 1715.22,
        "end": 1736.66
    },
    {
        "text": " A mí me maravilla en este tipo de resultados, ¿cómo se van conectando, cómo se van pegando",
        "start": 1736.66,
        "end": 1741.66
    },
    {
        "text": " el as?",
        "start": 1741.66,
        "end": 1743.78
    },
    {
        "text": " Que todo lo que vamos sabiendo es todo matemática muy sencilla que se va sumando, se va conectando",
        "start": 1743.78,
        "end": 1749.58
    },
    {
        "text": " y sermos.",
        "start": 1749.58,
        "end": 1751.3799999999999
    },
    {
        "text": " Bueno para la clase de hoy, este hubiera entendido más pero me quedó contento si hacemos",
        "start": 1751.3799999999999,
        "end": 1761.34
    },
    {
        "text": " el teorema de la decisión 1.4 y la reinterpretación de Leon Tief porque nosotros estamos ahora siendo",
        "start": 1761.34,
        "end": 1768.02
    },
    {
        "text": " matemática, planteamos un problema de economía, la clase pasada, lo empezamos a analizar, estamos",
        "start": 1768.02,
        "end": 1776.08
    },
    {
        "text": " desarrollando la matemática y sobre el final de la clase pretendo retomar el problema",
        "start": 1776.08,
        "end": 1782.06
    },
    {
        "text": " de economía con la matemática que hicimos, a ver si se pueden entender mejor que lo que",
        "start": 1782.06,
        "end": 1785.94
    },
    {
        "text": " teníamos antes.",
        "start": 1785.94,
        "end": 1787.7
    },
    {
        "text": " Y después la clase siguiente vamos a rematar con un par de conceptos nuevos que aparecen,",
        "start": 1787.7,
        "end": 1795.78
    },
    {
        "text": " M, matrix etcétera y bueno y con eso terminamos la parte del modelo de Leon Tief.",
        "start": 1795.78,
        "end": 1802.62
    },
    {
        "text": " Obviamente el práctico 5 va a ser todo relativo a este modelo.",
        "start": 1802.62,
        "end": 1807.06
    },
    {
        "text": " Yo sé el teorema dice lo siguiente.",
        "start": 1807.06,
        "end": 1810.66
    },
    {
        "text": " Antes de pasar el teorema estamos bien con el coroelario que va a dar alguna duda por",
        "start": 1810.66,
        "end": 1818.02
    },
    {
        "text": " supuesto que el leve de hacer este ejercicio pero es lo que no se explico Martin y quiero",
        "start": 1818.02,
        "end": 1821.94
    },
    {
        "text": " que los críban bien con detalle en el práctico.",
        "start": 1821.94,
        "end": 1840.3400000000001
    },
    {
        "text": " Entonces aparecen el teorema de la sección 1.4.",
        "start": 1840.3400000000001,
        "end": 1849.46
    },
    {
        "text": " Que es una equivalencia también es muy bonita lo que propone la demostración y dice así",
        "start": 1849.46,
        "end": 1863.14
    },
    {
        "text": " tenemos una matrix cuadrada de vuelta en los complejos tal que los términos de la diagonal",
        "start": 1863.14,
        "end": 1874.9
    },
    {
        "text": " son positivos y los otros términos no negativos, no positivo, pero en el igual que sea.",
        "start": 1874.9,
        "end": 1901.66
    },
    {
        "text": " Acá no acá tengo que escribir así.",
        "start": 1901.66,
        "end": 1909.66
    },
    {
        "text": " Mejor así porque esto es para fuera de la biobola.",
        "start": 1909.66,
        "end": 1915.0600000000002
    },
    {
        "text": " Entonces el teorema dice que son equivalentes.",
        "start": 1915.06,
        "end": 1923.06
    },
    {
        "text": " Estados afirmaciones.",
        "start": 1923.06,
        "end": 1933.6599999999999
    },
    {
        "text": " Para todo vector y mayor igual que 0 es sistema BX igual y tiene una única solución",
        "start": 1933.66,
        "end": 1956.9
    },
    {
        "text": " BX igual que 0.",
        "start": 1956.9,
        "end": 1961.9
    },
    {
        "text": " Antes de escribir la parte BX equivalente a la A leamos juntos la parte A porque dice un",
        "start": 1961.9,
        "end": 1967.94
    },
    {
        "text": " montón de cosas que quiero que quede bien claro.",
        "start": 1967.94,
        "end": 1972.94
    },
    {
        "text": " Primero que nada esto ya lo claramos en la clase pasada pero vale la pena reiterar.",
        "start": 1972.94,
        "end": 1992.98
    },
    {
        "text": " ¿Qué quiero decir cuando pongo B y mayor igual que 0 o X y mayor igual que 0 si estoy",
        "start": 1992.98,
        "end": 1996.78
    },
    {
        "text": " hablando de vectores?",
        "start": 1996.78,
        "end": 1998.78
    },
    {
        "text": " En un abuso del lenguaje que no estamos acostumbrando pero ¿qué quiere decir ese abuso del",
        "start": 1998.78,
        "end": 2002.82
    },
    {
        "text": " lenguaje?",
        "start": 2002.82,
        "end": 2008.82
    },
    {
        "text": " Que todas las entradas son por ejemplo mayor igual que 0 al total de X. Ahí estamos diciendo",
        "start": 2008.82,
        "end": 2013.54
    },
    {
        "text": " en particular que son reales y que son todos no negativas.",
        "start": 2013.54,
        "end": 2019.86
    },
    {
        "text": " Lo mismo con el I o sea decir y mayor igual que 0 que mayor igual ya te está diciendo",
        "start": 2019.86,
        "end": 2023.54
    },
    {
        "text": " que es un montón de cosas. Bien.",
        "start": 2023.54,
        "end": 2031.98
    },
    {
        "text": " Los que vinieron en el martes o lo que vinieron en OpenFing, esto es el cierre del modelo de",
        "start": 2031.98,
        "end": 2037.18
    },
    {
        "text": " Leon Tiff cuando planteamos el modelo de Leon Tiff. Teníamos esta ecuación, este problema",
        "start": 2037.18,
        "end": 2042.18
    },
    {
        "text": " reaparece acá.",
        "start": 2042.18,
        "end": 2045.34
    },
    {
        "text": " Estamos llegando de la vuelta para meternos de vuelta en Leon Tiff.",
        "start": 2045.34,
        "end": 2051.2599999999998
    },
    {
        "text": " Yojo antes de pasar la parte de disculpen que ponga tanto peso en esto pero realmente",
        "start": 2051.26,
        "end": 2056.1400000000003
    },
    {
        "text": " dice muchas cosas, esta parte de A.",
        "start": 2056.1400000000003,
        "end": 2058.26
    },
    {
        "text": " Acá dice para todo vector y mayor igual que 0 le encontrás la solución X y mayor",
        "start": 2058.26,
        "end": 2064.5800000000004
    },
    {
        "text": " igual que 0.",
        "start": 2064.5800000000004,
        "end": 2068.34
    },
    {
        "text": " Exactamente.",
        "start": 2068.34,
        "end": 2070.34
    },
    {
        "text": " No, es única y es mayor igual que 0. Es única y además es mayor igual que 0 está",
        "start": 2070.34,
        "end": 2074.98
    },
    {
        "text": " buena la pregunta.",
        "start": 2074.98,
        "end": 2076.3
    },
    {
        "text": " Si en una única solución vamos a ponerlo como que quede bien claro.",
        "start": 2076.3,
        "end": 2081.7000000000003
    },
    {
        "text": " X y en una única solución X y además X es mayor igual que 0.",
        "start": 2081.7000000000003,
        "end": 2089.86
    },
    {
        "text": " O sea la única verifica eso.",
        "start": 2089.86,
        "end": 2094.5
    },
    {
        "text": " Y la parte B es que B tiene diagonal dominante.",
        "start": 2094.5,
        "end": 2108.6600000000003
    },
    {
        "text": " Entonces a ver, ahora vamos a la demostración pero dos cosas, primero que la fuerza del concepto",
        "start": 2108.6600000000003,
        "end": 2117.9
    },
    {
        "text": " de diagonal dominante es equivalente a toda esta afirmación, estremendo.",
        "start": 2117.9,
        "end": 2123.5
    },
    {
        "text": " Y lo segundo es, por eso definimos diagonal dominante.",
        "start": 2123.5,
        "end": 2128.02
    },
    {
        "text": " La matemática que empezamos a ser y armar se aplica directamente en lo que va a ser",
        "start": 2128.02,
        "end": 2133.9
    },
    {
        "text": " Leon Tiff.",
        "start": 2133.9,
        "end": 2136.6600000000003
    },
    {
        "text": " Lo que fue Leon Tiff y lo que vamos a reintimentar.",
        "start": 2136.6600000000003,
        "end": 2139.9
    },
    {
        "text": " Bueno, entonces vamos a empezar con B implica.",
        "start": 2139.9,
        "end": 2143.34
    },
    {
        "text": " Con equivalencia tengo que probar implica B e implica.",
        "start": 2143.34,
        "end": 2150.34
    },
    {
        "text": " O sea la hipótesis de B implica es que tengo una matriz diagonal dominante.",
        "start": 2150.34,
        "end": 2159.34
    },
    {
        "text": " Entonces a B tiene diagonal dominante.",
        "start": 2159.34,
        "end": 2175.34
    },
    {
        "text": " Y supongamos que de su uno o de su dos son esos coeficientes, lo que son todos positivos",
        "start": 2175.34,
        "end": 2187.42
    },
    {
        "text": " recuerden esos coeficientes, tal que.",
        "start": 2187.42,
        "end": 2190.6200000000003
    },
    {
        "text": " Y voy a escribir ahora la condición de diagonal dominante.",
        "start": 2190.6200000000003,
        "end": 2193.7400000000002
    },
    {
        "text": " Entonces a ver si la escribo bien, de su j, por vez su j, no es mayor que menos la suma",
        "start": 2193.74,
        "end": 2206.14
    },
    {
        "text": " con el distinto de j, de de su y, por vez su yj.",
        "start": 2206.14,
        "end": 2212.62
    },
    {
        "text": " Y esto para todo j, entre uno y viene.",
        "start": 2212.62,
        "end": 2217.66
    },
    {
        "text": " Yo digo que los escribí bien, por quién me lo explica, por qué está bien escrito",
        "start": 2217.66,
        "end": 2220.74
    },
    {
        "text": " así.",
        "start": 2220.74,
        "end": 2224.74
    },
    {
        "text": " Sí, exactamente, porque en este caso lo que estoy diciendo que la matriz B, en realidad",
        "start": 2224.74,
        "end": 2235.02
    },
    {
        "text": " después de poner esto, después de escribir estas condiciones en la hipótesis podría",
        "start": 2235.02,
        "end": 2239.8599999999997
    },
    {
        "text": " volver acá y sacar la C por en el edad reno.",
        "start": 2239.8599999999997,
        "end": 2243.06
    },
    {
        "text": " Está correcto, pero aquí decir, pero ya que tenemos que la información que son todos",
        "start": 2243.06,
        "end": 2246.2999999999997
    },
    {
        "text": " mayores o menos igual que cero, son dos reales.",
        "start": 2246.3,
        "end": 2249.5
    },
    {
        "text": " Pero además, estos son negativos, por lo menos no son positivos, entonces cuando le",
        "start": 2249.5,
        "end": 2255.1800000000003
    },
    {
        "text": " tomás el valor absoluto, es de amigo que poner un menos adelante, de los de los ves",
        "start": 2255.1800000000003,
        "end": 2260.98
    },
    {
        "text": " suijotas, se entiende?",
        "start": 2260.98,
        "end": 2262.86
    },
    {
        "text": " Y los de eso son todos positivos.",
        "start": 2262.86,
        "end": 2265.78
    },
    {
        "text": " Y en este caso no pones el valor absoluto porque los de la diagonal y son todos positivos.",
        "start": 2265.78,
        "end": 2271.42
    },
    {
        "text": " ¿Tabien?",
        "start": 2271.42,
        "end": 2273.42
    },
    {
        "text": " Bueno, eso es que tenga entonces de una alumina, y está bien escrito a partir de todos",
        "start": 2274.42,
        "end": 2279.58
    },
    {
        "text": " los datos iniciales.",
        "start": 2279.58,
        "end": 2283.3
    },
    {
        "text": " Un detalle más, yo sé que estoy diciendo el ento, pero justamente en el modelo Elian",
        "start": 2283.3,
        "end": 2287.08
    },
    {
        "text": " Tef, de León Tef, todos nuestros números son reales.",
        "start": 2287.08,
        "end": 2291.98
    },
    {
        "text": " Por eso no está mal colocar estas condiciones positivos, negativos, etc.",
        "start": 2291.98,
        "end": 2296.42
    },
    {
        "text": " Todo la interpretación de la economía son números reales, eran producion, bueno,",
        "start": 2296.42,
        "end": 2306.3
    },
    {
        "text": " el costo de unidades de las otras productos para producir una unidad del j, del pesujota,",
        "start": 2306.3,
        "end": 2315.94
    },
    {
        "text": " son todos números reales.",
        "start": 2315.94,
        "end": 2318.06
    },
    {
        "text": " ¿Y de hijo te entreguales cero?",
        "start": 2318.06,
        "end": 2321.9
    },
    {
        "text": " ¿Dejón que es para tener un amarillo complexo como...?",
        "start": 2321.9,
        "end": 2326.3
    },
    {
        "text": " Es lo que yo decía, recién que después de tener este dato, puede volver a caer y",
        "start": 2326.3,
        "end": 2330.7000000000003
    },
    {
        "text": " cambiar las sípones de R, ¿sí sí?",
        "start": 2330.7000000000003,
        "end": 2332.7000000000003
    },
    {
        "text": " ¿De acuerdo?",
        "start": 2332.7000000000003,
        "end": 2334.7000000000003
    },
    {
        "text": " Bueno, muy bien, entonces vamos muy bien.",
        "start": 2334.7000000000003,
        "end": 2341.7400000000002
    },
    {
        "text": " Tenemos esta desigualdad por el lema que probamos la clase pasada con ese rancito, yo",
        "start": 2341.7400000000002,
        "end": 2348.5
    },
    {
        "text": " lo corregimos sabemos que si tiene diagonal dominante, ves invertible.",
        "start": 2348.5,
        "end": 2353.3
    },
    {
        "text": " Entonces por el lema, si tiene, y ahora dominante ves invertible.",
        "start": 2353.3,
        "end": 2363.54
    },
    {
        "text": " En particular la ecuación BX igual y tiene solución única.",
        "start": 2363.54,
        "end": 2377.7000000000003
    },
    {
        "text": " Es justamente X igual y Vía a la menos 1 por I.",
        "start": 2377.7,
        "end": 2385.9399999999996
    },
    {
        "text": " Así que tiene solución única, está.",
        "start": 2385.9399999999996,
        "end": 2388.3399999999997
    },
    {
        "text": " El punto la clave es que quiero probar que es mayor igual que cero, que todas sus coordenadas",
        "start": 2388.3399999999997,
        "end": 2393.18
    },
    {
        "text": " son mayores igual que cero.",
        "start": 2393.18,
        "end": 2396.98
    },
    {
        "text": " Entonces a esa solución, que ya la tenemos ahí, la escribo X1, X2, Xn, un detalle, chicos,",
        "start": 2396.98,
        "end": 2413.16
    },
    {
        "text": " el I está dado, ¿sí?",
        "start": 2413.16,
        "end": 2414.36
    },
    {
        "text": " Para todo el eventualidad o encuentro una solución X.",
        "start": 2414.36,
        "end": 2418.86
    },
    {
        "text": " Al decir que el I es mayor igual que cero son todos coeficiente reales positivos o nulos.",
        "start": 2418.86,
        "end": 2425.54
    },
    {
        "text": " Como dijeron ustedes recién que lo reforzó la matribe real de coeficiente reales.",
        "start": 2425.54,
        "end": 2434.7799999999997
    },
    {
        "text": " Por lo tanto su inversa los coeficiente donde están los reales también porque vos que",
        "start": 2434.7799999999997,
        "end": 2440.2
    },
    {
        "text": " sabes calcular la inversa, sabes que existe el inversa, ya probamos que existe.",
        "start": 2440.2,
        "end": 2445.5
    },
    {
        "text": " Sabes que los coeficiente de vesos reales, por ejemplo con el método de los determinantes,",
        "start": 2445.5,
        "end": 2449.22
    },
    {
        "text": " sabes calcular la inversa, entonces son todos reales.",
        "start": 2449.22,
        "end": 2451.98
    },
    {
        "text": " ¿Por qué voy a esto a incidir que en todos reales? Porque me lo estoy moviendo en el mundo",
        "start": 2451.98,
        "end": 2454.5
    },
    {
        "text": " real. Por lo tanto estas coordenadas como son todas reales o sea que no está tan",
        "start": 2454.5,
        "end": 2462.26
    },
    {
        "text": " loco o pensar que puedo comparar con cero.",
        "start": 2462.26,
        "end": 2465.14
    },
    {
        "text": " Además voy a probar que son positivas o cero, pero ya puedo decir que son números reales",
        "start": 2465.14,
        "end": 2471.58
    },
    {
        "text": " ¿no verdad?",
        "start": 2471.58,
        "end": 2473.1
    },
    {
        "text": " Igual que hicimos en la demostración del M, los voy a ordenar, son números reales,",
        "start": 2473.1,
        "end": 2477.94
    },
    {
        "text": " las coordenadas las comparo entre sí y las coordenadas.",
        "start": 2477.94,
        "end": 2481.7400000000002
    },
    {
        "text": " Entonces ordenamos x, y su 1, y y y y y y y y y y y y y y y y y y y y y y y y y y y",
        "start": 2481.74,
        "end": 2494.3399999999997
    },
    {
        "text": " y y y y y y y y y se me hache, hache su 1, hache su 2, hache su s para que no se confundan",
        "start": 2494.3399999999997,
        "end": 2503.3399999999997
    },
    {
        "text": " en su vínice que vienen después.",
        "start": 2503.3399999999997,
        "end": 2506.54
    },
    {
        "text": " De esta manera yo no sé, quisiera que fueran todos positivos, pero por ahora no lo sé",
        "start": 2506.54,
        "end": 2514.1
    },
    {
        "text": " positivo o nulos. Entonces digo que en algún momento en el momento S hasta acá son los",
        "start": 2514.1,
        "end": 2521.2599999999998
    },
    {
        "text": " positivos enulos y después siguen los coeficientes que son negativos enulos.",
        "start": 2521.2599999999998,
        "end": 2533.54
    },
    {
        "text": " En total son n, en un momento se parte de la cosa ¿no?",
        "start": 2533.54,
        "end": 2538.6
    },
    {
        "text": " ¿Tá los positivos en el motivo?",
        "start": 2538.6,
        "end": 2541.46
    },
    {
        "text": " Pero acá úrises, por favor pongan en el medio todo el analistísimo porque alguien puede",
        "start": 2541.46,
        "end": 2549.06
    },
    {
        "text": " si se corta la transmisión a idiope en fin o le cortan, le editen y sacan eso que dijimos",
        "start": 2549.06,
        "end": 2554.18
    },
    {
        "text": " recién, juntos sacan el clase, van a decir, profía, ¿usted quién le dijo que puedan",
        "start": 2554.18,
        "end": 2559.98
    },
    {
        "text": " al comparar a un numerito? ¿Si esto es un tos complejo?",
        "start": 2559.98,
        "end": 2562.66
    },
    {
        "text": " Entonces es muy importante, es muy importante el analistísimo recién, todos estos numeritos",
        "start": 2562.66,
        "end": 2567.98
    },
    {
        "text": " son reales por todo lo que dijimos ¿no? pero escribanlo por favor. Son de esos detalles",
        "start": 2567.98,
        "end": 2577.54
    },
    {
        "text": " que nos aparecen en el libro y que está bueno que observan los juntos ¿no?",
        "start": 2577.54,
        "end": 2582.34
    },
    {
        "text": " Sí, ese mas uno, hay va, H sube, ese mas uno, acá H sube en el ultimo. ¿Qué",
        "start": 2582.34,
        "end": 2593.9
    },
    {
        "text": " lo que queremos nosotros probar? ¿Qué son todos positivos? ¿Qué lo que quiero",
        "start": 2593.9,
        "end": 2598.5
    },
    {
        "text": " probar? ¿Qué es SN? ¿Qué no se me parten en el medio? ¿Qué? El mayor igual que",
        "start": 2598.5,
        "end": 2604.1800000000003
    },
    {
        "text": " se lo aparece acá. ¿Cierto? Vamos a hacerla cuenta y vamos a probar que una desigualdad",
        "start": 2604.1800000000003,
        "end": 2610.58
    },
    {
        "text": " que lo va a aparecer, solo puede suceder si es SN o sea no hay nadie de este lado ¿no?",
        "start": 2610.58,
        "end": 2616.46
    },
    {
        "text": " ¿Qué hemos ver eso? Bueno, sigo la amostración por acá. A ver, voy a usar el hecho que",
        "start": 2616.46,
        "end": 2634.7
    },
    {
        "text": " V por X me da ahí, entonces hago el producto V por X y me da ahí. Entonces ¿qué quiere",
        "start": 2634.7,
        "end": 2641.54
    },
    {
        "text": " decir? Que ahí suy es igual a la sumatoria de V suy j, bueno, acá V suy H j por X H j.",
        "start": 2641.54,
        "end": 2663.46
    },
    {
        "text": " Ahora lo voy a escribir mejor pero a ver, viene el pizarro, digo, quiero decir, ahora",
        "start": 2663.46,
        "end": 2674.94
    },
    {
        "text": " termino de escribir un montón de cosas acá, pero en principio lo que escribir no está",
        "start": 2674.94,
        "end": 2678.7400000000002
    },
    {
        "text": " mal, solo lo que lo voy a escribir con más de talle y separadito. ¿Qué puse acá?",
        "start": 2678.7400000000002,
        "end": 2684.5
    },
    {
        "text": " ¿Qué? V suy H j por X su H j, a ver si la puse bien, sí, fila por columna, fila por",
        "start": 2684.5,
        "end": 2696.54
    },
    {
        "text": " el vector columna X, solo que me está desordenado porque yo tome el orden en este, pero no importa",
        "start": 2696.54,
        "end": 2703.42
    },
    {
        "text": " eso, ¿no? Yo no estoy diciendo el primero por el primero, más el segundo por el segundo,",
        "start": 2703.42,
        "end": 2708.38
    },
    {
        "text": " más el tercer. Tome el orden que me da esto acá, pero expuse todos, ¿tando de acuerdo? Bueno,",
        "start": 2708.38,
        "end": 2714.02
    },
    {
        "text": " dicho esto, ahora voy a poner dos partes, acá están todos, si yo pongo desde J y igual",
        "start": 2714.02,
        "end": 2721.46
    },
    {
        "text": " 1 hasta n están todos. ¿No está ordenadito? Primero con primero, está el tercero con el",
        "start": 2721.46,
        "end": 2727.18
    },
    {
        "text": " tercero, más el quinto con el quinto, más el primero con el primero, porque están según",
        "start": 2727.18,
        "end": 2733.2599999999998
    },
    {
        "text": " este orden, sí se la cuenta de eso, ese estácito, Sara, me está siguiendo, ¿segura?",
        "start": 2733.2599999999998,
        "end": 2740.78
    },
    {
        "text": " Sí, lo que digo es esto, viste que cuando se es en general, cuando multipliamos una matriz",
        "start": 2740.78,
        "end": 2749.5
    },
    {
        "text": " por un vector, hace es, bueno arrastra una fila y lo multiplicas por el vector después",
        "start": 2749.5,
        "end": 2754.94
    },
    {
        "text": " de otra es, cuando agarras la fila agarras de primero por el primero, más el segundo por el",
        "start": 2754.94,
        "end": 2759.6600000000003
    },
    {
        "text": " segundo, más el tercer por el tercer, y el orden hace así, pero acá este vector agarramos",
        "start": 2759.6600000000003,
        "end": 2766.98
    },
    {
        "text": " si lo ordenamos según quienes es el más grande, como que lo desordenamos en los coeficientes",
        "start": 2766.98,
        "end": 2772.26
    },
    {
        "text": " y ese producto está escrito en este orden, o sea poner que el más grande es el quinto,",
        "start": 2772.26,
        "end": 2778.26
    },
    {
        "text": " después viene el tercero, después viene el primero, voy así, ¿no verdad? Entonces lo",
        "start": 2778.26,
        "end": 2782.22
    },
    {
        "text": " que pusiste es el quinto por el quinto, agarraste la fila, quinto por quinto, después",
        "start": 2782.22,
        "end": 2787.94
    },
    {
        "text": " tercero con tercero, después primero con primero, después cuarto con cuarto, porque",
        "start": 2787.94,
        "end": 2791.66
    },
    {
        "text": " está siguiendo este orden, pero es lo mismo al final porque sumamos todo, ¿no verdad?",
        "start": 2791.66,
        "end": 2796.46
    },
    {
        "text": " ¿Cierto? ¿Me siguieron hasta acá? O se me perdió alguna, es importante, ¿nacho?",
        "start": 2796.46,
        "end": 2801.3999999999996
    },
    {
        "text": " ¿Me decidiste? ¿Qué vi? ¿Sí? ¿Está deo? ¿Está deo y mateo tiene la misma letra, la misma",
        "start": 2801.3999999999996,
        "end": 2809.24
    },
    {
        "text": " boca, el mismo lugar, se cambia la T y una letra sobre. Bueno, pero entonces esta suma",
        "start": 2809.24,
        "end": 2819.2999999999997
    },
    {
        "text": " que hay tantoditos, los voy a partir en 2, en esta parte y en esta parte 2 sumandos,",
        "start": 2819.3,
        "end": 2826.3
    },
    {
        "text": " en 2 suena de sumandos, ¿eh? ¿Aca? ¿Más? ¿Aca? ¿Ves, V, H y J, X y H y J? Pero",
        "start": 2826.3,
        "end": 2835.26
    },
    {
        "text": " pongo que los que corresponden en esta parte y después lo que corresponden en esta parte,",
        "start": 2835.26,
        "end": 2840.6200000000003
    },
    {
        "text": " está bien, entonces ponemos de J igual 1 hasta S y de J igual S más 1 hasta N. ¿Se",
        "start": 2840.62,
        "end": 2853.42
    },
    {
        "text": " entendió? ¿Tú ando todo, pero los puses separados ahora? Bueno, esto me da y suí y esto lo",
        "start": 2853.42,
        "end": 2867.5
    },
    {
        "text": " puede hacer para todo y no, ¿verdad? Te digo el 1 hasta N. Ahora esta ecuación cita",
        "start": 2867.5,
        "end": 2873.38
    },
    {
        "text": " que viene de acá ¿no? Lo que estoy aprovechándose esto, esa ecuación cita la multiplico todo",
        "start": 2873.38,
        "end": 2878.34
    },
    {
        "text": " por esto, esa por de Sui, es cualquiera, un y cualquiera, ¿no? Ahora, esa por de Sui,",
        "start": 2878.34,
        "end": 2886.26
    },
    {
        "text": " entonces como me queda, Sui por Sui igual, sumatoria, el J igual 1 hasta S de Sui por",
        "start": 2886.26,
        "end": 2898.34
    },
    {
        "text": " Sui, H y J, X y H y J más, perdón, Sui por Sui, H y J y esto lo voy a hacer desde",
        "start": 2898.34,
        "end": 2916.7000000000003
    },
    {
        "text": " igual S más 1 hasta N, o sea, aquí lo decir, lo puedo hacer para todos, pero solamente lo",
        "start": 2916.7000000000003,
        "end": 2921.6600000000003
    },
    {
        "text": " voy a hacer igual S más 1, S más 2 hasta N, lo es último, es verdad siempre, pero",
        "start": 2921.66,
        "end": 2932.3399999999997
    },
    {
        "text": " aprovecho lo último, y hago la suma de todos estos, o sea, tengo esta igualdad para igual",
        "start": 2932.3399999999997,
        "end": 2941.54
    },
    {
        "text": " S más 1, tengo esta igualdad para E, S más 2, tengo esta igualdad para E igual N, hago",
        "start": 2941.54,
        "end": 2947.8199999999997
    },
    {
        "text": " la suma de todos, entonces que te queda la sumatoria desde E igual S más 1 hasta N,",
        "start": 2947.82,
        "end": 2955.7400000000002
    },
    {
        "text": " el S igual a la sumatoria, desde E igual S más 1 hasta N, de la sumatoria,",
        "start": 2955.74,
        "end": 2972.18
    },
    {
        "text": " dejó de igual 1 hasta S, el S e,",
        "start": 2972.18,
        "end": 2975.8999999999996
    },
    {
        "text": " voy,",
        "start": 2975.94,
        "end": 2979.78
    },
    {
        "text": " Bueno, vamos bien.",
        "start": 2979.78,
        "end": 3006.5400000000004
    },
    {
        "text": " Santiago, te veo con caritas de preocupado.",
        "start": 3006.54,
        "end": 3015.54
    },
    {
        "text": " ¿Por qué? ¿Cómo te había visto esta vez?",
        "start": 3015.54,
        "end": 3023.54
    },
    {
        "text": " Yo de esta ecuación vale para todos los sí, pero yo tome desde ese más 1 hasta n, use esos",
        "start": 3023.54,
        "end": 3032.14
    },
    {
        "text": " sí, y lo sumé. Sué, esta ecuación sí te la sumé para todos esos casos. A ver, esto",
        "start": 3032.14,
        "end": 3040.06
    },
    {
        "text": " que parece tan complicado si lo pensamos ahora un ratito junto es una papa. De su y por",
        "start": 3040.06,
        "end": 3046.22
    },
    {
        "text": " y su y tenemos información de todos estos muchachos. Los des son todos positivos. Los",
        "start": 3046.22,
        "end": 3052.14
    },
    {
        "text": " I son todos positivos o sea que está a primer suma, ¿cuánto da? Los des son positivos",
        "start": 3052.14,
        "end": 3061.18
    },
    {
        "text": " y los I suizo, mayores igual que 0. ¿Cuánto da?",
        "start": 3061.18,
        "end": 3064.18
    },
    {
        "text": " mayor igual que 0. También, eso es una papa. Y ahora vamos a analizar y a poquito el primer",
        "start": 3064.18,
        "end": 3071.46
    },
    {
        "text": " sumando también es bastante sencillo y el segundo hay que convertir un poquito. Entonces",
        "start": 3071.46,
        "end": 3077.06
    },
    {
        "text": " el segundo sumando, veamos, esto será mayores que 0, ¿no? Acá a ver, grises, miren bien.",
        "start": 3077.06,
        "end": 3087.94
    },
    {
        "text": " Vé su y H j.",
        "start": 3087.94,
        "end": 3088.94
    },
    {
        "text": " Vé su y H j j j j. ¿Ve su y H j j?",
        "start": 3088.94,
        "end": 3108.18
    },
    {
        "text": " ¿Ve su y H j j?",
        "start": 3108.18,
        "end": 3109.66
    },
    {
        "text": " Hay un detalle, por querer hacer lo más delicada la demostración, más suave que la que",
        "start": 3109.66,
        "end": 3114.7400000000002
    },
    {
        "text": " en el libro aparece un detalle ahí. ¿Sí?",
        "start": 3114.74,
        "end": 3116.74
    },
    {
        "text": " ¿En el terciedo puede usar que el preciso más que 0?",
        "start": 3116.74,
        "end": 3121.5
    },
    {
        "text": " Los I son dados son hipótesis. ¿No está probando de para no de apravé?",
        "start": 3121.5,
        "end": 3128.7799999999997
    },
    {
        "text": " No, no está bien, pero ahí va, está bien, está bueno la pregunta, pero igual fíjate",
        "start": 3128.7799999999997,
        "end": 3134.66
    },
    {
        "text": " lo que dice. Ve y implicar que tengo que probar, que si ve tiene diagonal dominante para todos",
        "start": 3134.66,
        "end": 3141.22
    },
    {
        "text": " el vector y mayor igual que 0, se verifica tal cosa. O sea que vos tenés la hipótesis",
        "start": 3141.22,
        "end": 3147.66
    },
    {
        "text": " de A es, dame un vector y mayor igual que 0 que tengo que probar esto, o sea que eso",
        "start": 3147.66,
        "end": 3153.8199999999997
    },
    {
        "text": " está bueno la pregunta.",
        "start": 3153.8199999999997,
        "end": 3156.22
    },
    {
        "text": " A ver, tanto en el lemma, como en este teorema el libro hace una cosa distinta y ahora en",
        "start": 3156.22,
        "end": 3165.9399999999996
    },
    {
        "text": " este momento nos complica haber cambiado, les explico qué lo que hace. Vieron cuando",
        "start": 3165.9399999999996,
        "end": 3170.8599999999997
    },
    {
        "text": " eso les reordené acá y le dije bueno acá están. El libro dice podemos asumir que XI",
        "start": 3170.86,
        "end": 3179.1
    },
    {
        "text": " es mayor igual que XII, que es mayor igual que XIII, que es mayor igual que XN y es verdad,",
        "start": 3179.1,
        "end": 3183.9
    },
    {
        "text": " tiene razón que podemos asumir eso. Lo que pasa que escribiré su implica entender, por",
        "start": 3183.9,
        "end": 3193.6200000000003
    },
    {
        "text": " decir, para, ¿Quién te dijo que el XI que existe de las soluciones mayor igual que no",
        "start": 3193.6200000000003,
        "end": 3198.26
    },
    {
        "text": " sé qué? Eso quiere decir que acá les cambiaste el orden a los X, eso quiere decir que",
        "start": 3198.26,
        "end": 3205.46
    },
    {
        "text": " acá les cambiaste el orden a las filas. ¿Y quién te dijo que fue esto? Lo que pasa es",
        "start": 3205.46,
        "end": 3212.26
    },
    {
        "text": " que si esta matriz inicial tiene la hipótesis que tiene en este caso, digamos, la dominante,",
        "start": 3212.26,
        "end": 3219.46
    },
    {
        "text": " vos las reordenás como quieras y resulta que también puedes probar que tiene una dominante.",
        "start": 3219.46,
        "end": 3226.26
    },
    {
        "text": " Es un poquitito, no como quieras, cambiando las filas. A mí no me gustaba mucho esa demostración,",
        "start": 3226.26,
        "end": 3237.5400000000004
    },
    {
        "text": " tanto en el lema se las cambié, acá también, acá también, pero acá nos complica un poquitito,",
        "start": 3237.5400000000004,
        "end": 3246.98
    },
    {
        "text": " y acá fíjense, nos complica en el momento de partir, este momento que se partió.",
        "start": 3246.98,
        "end": 3253.98
    },
    {
        "text": " Sí, les explico por qué. Acá yo lo que tendría que decir en este momento, tiene arreglo,",
        "start": 3276.98,
        "end": 3284.9
    },
    {
        "text": " por supuesto, pero hay que tener mucho cuidado con esta demostración. La XI sujota,",
        "start": 3284.9,
        "end": 3291.58
    },
    {
        "text": " que estamos usando acá, a ver, el HI sujota, j, va desde 1 a t a s. Entonces, estas son",
        "start": 3291.58,
        "end": 3300.38
    },
    {
        "text": " acá, en este tramo, son todas mayores iguales que 0, esto está muy bien, no hay ningún problema.",
        "start": 3300.38,
        "end": 3305.38
    },
    {
        "text": " Es de hacer la mayor quesero, y lo otro que iba a firmar y es correcto, pero vamos a tener que hacer un cambio para eso,",
        "start": 3307.38,
        "end": 3314.9
    },
    {
        "text": " es que las V suy sujota son menores y va a usar esta parte, que las V suy sujota son menores iguales que 0,",
        "start": 3314.9,
        "end": 3323.42
    },
    {
        "text": " cuando son estos menores igual que 0.",
        "start": 3323.42,
        "end": 3326.1
    },
    {
        "text": " Atención, porque eso tengo que tener el cuidado, porque fíjense como está la suma escrita.",
        "start": 3327.1,
        "end": 3337.1
    },
    {
        "text": " La j va de 1 a t a s y la I va desde ese más 1 a t a n, entonces uno dice, bueno,",
        "start": 3337.1,
        "end": 3342.7
    },
    {
        "text": " la j va de 1 a t a s y la I no coinciden la j con la I, es exactamente lo que está pasando acá,",
        "start": 3342.7,
        "end": 3348.3399999999997
    },
    {
        "text": " pero como nosotros reordenamos para no tener que hacer toda la otra argumentación,",
        "start": 3348.3399999999997,
        "end": 3353.74
    },
    {
        "text": " resulta que le cambiamos el orden y entonces en vez de decir V suy sujota dice V suy ha chejota y",
        "start": 3353.74,
        "end": 3360.3399999999997
    },
    {
        "text": " perfectamente la chejota en algún momento podría ser igual ahí. Entonces, ¿cómo se cambia eso?",
        "start": 3360.3399999999997,
        "end": 3366.3399999999997
    },
    {
        "text": " Así se cambia. Obien se admite lo que está escrito en el libro,",
        "start": 3366.3399999999997,
        "end": 3371.22
    },
    {
        "text": " obien se cambia en este momento de esta manera, dice sí, cuando tomo la suma que está perfecta,",
        "start": 3371.22,
        "end": 3378.5
    },
    {
        "text": " la suma sí, el, esto está bien y acá también está perfecto en general, pero en vez de tomar desde",
        "start": 3378.5,
        "end": 3392.06
    },
    {
        "text": " de I es ese más 1 hasta N, tomo en este momento lo cambio acá, lo pongo en verde para que se",
        "start": 3392.06,
        "end": 3400.1
    },
    {
        "text": " no te cambio, desde I igual, no va a ser correlativo, con I perteneciente,",
        "start": 3400.1,
        "end": 3409.74
    },
    {
        "text": " ayúdenme para ver si H suese más 1, H suese más 2, H suese más 0, o sea en vez de colocar",
        "start": 3409.74,
        "end": 3426.66
    },
    {
        "text": " esta hipótesis, es más 0, es más 0, gracias, H sueno, gracias Santiago. En vez de ser correlativo,",
        "start": 3426.66,
        "end": 3437.22
    },
    {
        "text": " es más 1, es más 2 hasta N, yo le permite que sea justamente N-sec casos, N-sec casos,",
        "start": 3437.22,
        "end": 3444.2999999999997
    },
    {
        "text": " ¿qué casos? Justamente en los casos, estos que están acá y por lo tanto, lo que estoy logrando",
        "start": 3444.2999999999997,
        "end": 3450.2999999999997
    },
    {
        "text": " es que como el H sujota va desde 1 hasta E, la primer variable no se toca con la segunda variable,",
        "start": 3450.2999999999997,
        "end": 3459.4599999999996
    },
    {
        "text": " estoy tomando en cuenta la reordenación, entonces aquí chicos le cambio, solo me di cuenta ahora,",
        "start": 3460.46,
        "end": 3470.54
    },
    {
        "text": " cuando preparé la clase, no me ha ido de cuenta que mi reordenación afectaba esta parte,",
        "start": 3470.54,
        "end": 3475.06
    },
    {
        "text": " entonces aquí sería, en vez de poner desde M-sec más 1 hasta N, la suma, la pongo en verde para",
        "start": 3475.06,
        "end": 3486.7
    },
    {
        "text": " que se entienda con I, perteneciente, al conjunto, este conjunto lo puedo llamar de una manera H",
        "start": 3486.7,
        "end": 3493.54
    },
    {
        "text": " grande así, así no tengo que andar escribíéndolo.",
        "start": 3493.54,
        "end": 3495.8999999999996
    },
    {
        "text": " Pauza para que se entienda, por favor, pregúnteme.",
        "start": 3495.9,
        "end": 3514.02
    },
    {
        "text": " Facundo, sé que marí un poquito pero se entendió el cambio, tiene razón, hay que tomar tiempo.",
        "start": 3525.9,
        "end": 3544.34
    },
    {
        "text": " Esta parte no cambia nada, porque sí es siendo el mismo argumento, positivo y mayor igual que",
        "start": 3544.34,
        "end": 3556.7000000000003
    },
    {
        "text": " ser, que es otro positivo, la mochila que sea, le pongo así no verdad.",
        "start": 3556.7,
        "end": 3561.98
    },
    {
        "text": " ¿Aca no cambia nada?",
        "start": 3561.98,
        "end": 3567.2599999999998
    },
    {
        "text": " No, sí porque sin dejar, aunque sea, H sujese más 1, no sin poder que H sujese más 1,",
        "start": 3567.2599999999998,
        "end": 3573.14
    },
    {
        "text": " sin dejar, sin hacer más 1, sin hacer más 1.",
        "start": 3573.14,
        "end": 3575.9399999999996
    },
    {
        "text": " No, no, porque en este orden, sí, sí, porque yo para no poner eso de admitir que entonces",
        "start": 3575.9399999999996,
        "end": 3583.3399999999997
    },
    {
        "text": " se puede hacer todo, a preferir y ordenarlo, pero no me he dado cuenta que acá también hay que",
        "start": 3583.34,
        "end": 3589.02
    },
    {
        "text": " que...",
        "start": 3589.02,
        "end": 3590.02
    },
    {
        "text": " Claro, y ¿quién está suma en vez de poner todos seguiditos, tengo que poner los que consideré acá",
        "start": 3590.02,
        "end": 3597.02
    },
    {
        "text": " en el orden, ahí va, para poder argumentar esto, ¿no?",
        "start": 3597.02,
        "end": 3603.42
    },
    {
        "text": " Este es menor igual que ser lo se entiende, ahora estoy usando que las dos coordenadas no",
        "start": 3603.42,
        "end": 3608.3
    },
    {
        "text": " y j no se en igual, y ¿por qué no se en igual?",
        "start": 3608.3,
        "end": 3611.98
    },
    {
        "text": " Porque 1 está desde H su, 1 hasta H su S y la primera está desde H su más 1 hasta",
        "start": 3611.98,
        "end": 3620.6600000000003
    },
    {
        "text": " H su N, entonces no se tocan la coordenada, caen todas en esta situación, se entendió.",
        "start": 3620.6600000000003,
        "end": 3627.0600000000004
    },
    {
        "text": " ¿Ales Sandra?",
        "start": 3627.0600000000004,
        "end": 3631.26
    },
    {
        "text": " Bien, bien, ¿debe?",
        "start": 3631.26,
        "end": 3636.34
    },
    {
        "text": " Ah, ah, pero entonces ¿qué vamos a obtener?",
        "start": 3636.34,
        "end": 3638.38
    },
    {
        "text": " Yo les dije que hay que analizar un poquito ese segundo sumando, ¿no?",
        "start": 3638.38,
        "end": 3642.46
    },
    {
        "text": " Vamos teniendo algo medio raro, esto es mayor igual que 0 y este es menor, este es menor",
        "start": 3642.46,
        "end": 3648.54
    },
    {
        "text": " igual que 0, porque todos son sumando positivos multiplicados por negativo, o sea que es menor",
        "start": 3648.54,
        "end": 3654.6200000000003
    },
    {
        "text": " igual que 0.",
        "start": 3654.6200000000003,
        "end": 3656.7000000000003
    },
    {
        "text": " Entonces, ¿cómo viene la mano?",
        "start": 3656.7000000000003,
        "end": 3658.34
    },
    {
        "text": " Me he complicada, viene la mano.",
        "start": 3658.34,
        "end": 3660.7400000000002
    },
    {
        "text": " Vamos a analizar ahora esto, esto es humano.",
        "start": 3660.7400000000002,
        "end": 3665.06
    },
    {
        "text": " ¿Qué es sumando?",
        "start": 3665.06,
        "end": 3666.54
    },
    {
        "text": " Lo vamos a reordenar un poquito.",
        "start": 3666.54,
        "end": 3672.82
    },
    {
        "text": " Para analizarlo lo pongo por acá, la sumatoria de la sumatoria, es J igual es 1 hasta N,",
        "start": 3672.82,
        "end": 3683.42
    },
    {
        "text": " es de su H su j, de X su H su j, con I perteneciente H, ahora lo escribo.",
        "start": 3683.42,
        "end": 3705.14
    },
    {
        "text": " Como la sumatoria, es de J igual es 1 hasta N, con la sumatoria de I perteneciente H,",
        "start": 3705.14,
        "end": 3716.8199999999997
    },
    {
        "text": " de D su I, por B su H, por X su H su j.",
        "start": 3716.8199999999997,
        "end": 3730.2599999999998
    },
    {
        "text": " Sinceramente no le hice nada más que cambiar el orden de la suma, no hice nada, solamente",
        "start": 3730.26,
        "end": 3735.78
    },
    {
        "text": " cambié el orden de la suma y en el, al final lo puse factor común y X su H su j, un detalle",
        "start": 3735.78,
        "end": 3743.0200000000004
    },
    {
        "text": " más, yo tengo derecho a cambiar el orden de la suma, porque son sumas finitas, ¿no?",
        "start": 3743.0200000000004,
        "end": 3747.0200000000004
    },
    {
        "text": " ¿no?",
        "start": 3747.0200000000004,
        "end": 3748.0200000000004
    },
    {
        "text": " El problema de cambiar el orden de la suma es cuando estamos en series, series dobles, ahí",
        "start": 3748.0200000000004,
        "end": 3753.82
    },
    {
        "text": " voy a cambiar el orden de la suma y hay que tener criterios de convergencia que te permitan",
        "start": 3753.82,
        "end": 3758.0600000000004
    },
    {
        "text": " cambiar la suma, pero acá son dos sumas finitas, ¿vamos sumas así? Así, así, o sea, por",
        "start": 3759.06,
        "end": 3764.2599999999998
    },
    {
        "text": " filas los términos, por el que lo tenés armado es un cuadradito, en un rey tangulo, los",
        "start": 3764.2599999999998,
        "end": 3770.2599999999998
    },
    {
        "text": " sumas así o los sumas por colunas, lo mismo, lo cambia de orden de la suma, solo que",
        "start": 3770.2599999999998,
        "end": 3775.88
    },
    {
        "text": " al reordenarlo de esta manera, como la X su H depende de J, o sea la X su j y la J",
        "start": 3775.88,
        "end": 3783.18
    },
    {
        "text": " quedó afuera, la posa carre factor común, por eso le cambie a mejor, ahora de su y por",
        "start": 3783.18,
        "end": 3790.18
    },
    {
        "text": " ver su y su j, ahora dice, con I en H, sí, gracias, muchas gracias, porque por algo no",
        "start": 3790.18,
        "end": 3806.8599999999997
    },
    {
        "text": " me estaba dando acá, bien, este...",
        "start": 3806.8599999999997,
        "end": 3811.7799999999997
    },
    {
        "text": " Ahí va, esto a la vez lo voy a poner así, menor igual, menor igual que la sumatoria",
        "start": 3820.18,
        "end": 3835.18
    },
    {
        "text": " desde J de igual, ese más 1 hasta N, entonces acá grises, estoy poniendo de su y por",
        "start": 3835.18,
        "end": 3843.04
    },
    {
        "text": " su y H j, variando y en H, en vez de poner esa suma voy a poner los todos, o sea, todo",
        "start": 3843.04,
        "end": 3851.12
    },
    {
        "text": " lo sumando, la suma desde I y 1 hasta N, desde su y por vez su y j, acá desde H j, por",
        "start": 3851.12,
        "end": 3871.12
    },
    {
        "text": " X su H j, ¿quién me argumenta este menor igual? Está bien, está, lo acabo de chequear,",
        "start": 3871.12,
        "end": 3893.64
    },
    {
        "text": " ni a mí lo que por la reordenación y estas cosas, ¿quién me argumenta este menor igual?",
        "start": 3893.64,
        "end": 3905.96
    },
    {
        "text": " Mardín, en la zona que estoy, son todos negativos, entonces es muy bien, primer detalle nada",
        "start": 3905.96,
        "end": 3918.06
    },
    {
        "text": " trivial, estos tipos que están acá fuerzas negativos y qué dice yo, le aumenté sumando",
        "start": 3918.06,
        "end": 3922.94
    },
    {
        "text": " acá dentro y esos sumando que aumenté como son, los de esos positivos, eso no, no vienen",
        "start": 3922.94,
        "end": 3930.94
    },
    {
        "text": " a complicar el panorama, ¿por qué? Exactamente, le agregué los otros, los que cumplen esta",
        "start": 3930.94,
        "end": 3943.62
    },
    {
        "text": " condición, porque justamente el primer índice es ahí, acá estaban todos los de H, ahora puse",
        "start": 3943.62,
        "end": 3952.2999999999997
    },
    {
        "text": " los demás, o sea puse esta zona y en esta zona digamos no se toca con la otra zona, acá",
        "start": 3952.2999999999997,
        "end": 3961.62
    },
    {
        "text": " está desde ese más 1 hasta N y ahora lo que acabo de agregar son los que corresponden a esta",
        "start": 3961.62,
        "end": 3967.68
    },
    {
        "text": " zona, zona de sub índice, no estoy mencionando zonas, aunque estoy tocando acá el vector",
        "start": 3967.68,
        "end": 3973.46
    },
    {
        "text": " X, estoy hablando de las zonas, o sea acá estaban considerados solamente, los B, Su y H,",
        "start": 3973.46,
        "end": 3980.98
    },
    {
        "text": " J, con Y en H y ahora acabo de agregar todos los que faltaban, o sea lo que corresponden",
        "start": 3980.98,
        "end": 3990.14
    },
    {
        "text": " a esta parte, pero lo que corresponden a esta parte no tiene nada que ver con ese más 1",
        "start": 3990.14,
        "end": 3995.78
    },
    {
        "text": " N, entonces agregaste con sub índice distintos, o sea todos los que agregaste verificaban",
        "start": 3995.78,
        "end": 4002.14
    },
    {
        "text": " esta situación, bueno entonces esta parte eran negativos o menos igual que 0 por positivos",
        "start": 4002.14,
        "end": 4008.8599999999997
    },
    {
        "text": " los que agregue, ¿no? los que agregue estoy hablando, los que agregue menos igual que 0 por",
        "start": 4008.8599999999997,
        "end": 4014.06
    },
    {
        "text": " positivo por menor que 0, entonces agregue algo positivo al final de cuenta, ¿se dan cuenta?",
        "start": 4014.06,
        "end": 4022.18
    },
    {
        "text": " entonces esta desigualdad es correcta, pero por favor escribo en algo porque si no está",
        "start": 4022.18,
        "end": 4025.7
    },
    {
        "text": " bravo de recordarlo después, buenísimo.",
        "start": 4025.7,
        "end": 4036.9399999999996
    },
    {
        "text": " Están escribiendo, tomar el tiempo y si tienen preguntas, ¿sara? alguien que tenga una",
        "start": 4055.7,
        "end": 4067.7799999999997
    },
    {
        "text": " duda me lo pregunta allá así.",
        "start": 4067.78,
        "end": 4092.38
    },
    {
        "text": " ¿sí? ¿Vos tenías un montón de sumando? pero la agregaste algunos, o sea cuando",
        "start": 4092.38,
        "end": 4098.46
    },
    {
        "text": " el I estaba en esta familia de sub índices que corresponde a esta zona, a la zona de sub índice,",
        "start": 4098.46,
        "end": 4103.46
    },
    {
        "text": " perdón estoy señalando mal, a esta zona de sub índice ya estaban acá incluidos, ahora",
        "start": 4103.46,
        "end": 4109.62
    },
    {
        "text": " pusiste más sumando, en que corresponden a que zona de sub índice, a la zona de esta",
        "start": 4109.62,
        "end": 4115.54
    },
    {
        "text": " zona, entonces cuando gustas en esta primera zona de sub índice, la j, del H sub j va en",
        "start": 4116.0199999999995,
        "end": 4125.62
    },
    {
        "text": " todo caso entre 1 y N, entre 1 y S, disculpame, entre 1 y S, entonces quiere decir que no",
        "start": 4125.62,
        "end": 4134.5
    },
    {
        "text": " va a coincidir el primer sub índice que agregaste, la I estaba en H, ¿sí? agregaste los",
        "start": 4134.5,
        "end": 4144.78
    },
    {
        "text": " dos, a ver, suía chijota que agregaste, el primer sub índice, esto ya estaban considerados,",
        "start": 4144.78,
        "end": 4151.78
    },
    {
        "text": " quiere decir que considerates lo que, en esta zona de sub índice, pero justamente la",
        "start": 4151.78,
        "end": 4157.2
    },
    {
        "text": " chijota del segundo sub índice de B, era desde ese mas uno está en E, en esta zona,",
        "start": 4157.2,
        "end": 4163.74
    },
    {
        "text": " en la otra zona, que quiere decir que los sub índices nunca fueron igual, los que agregaste",
        "start": 4163.74,
        "end": 4169.94
    },
    {
        "text": " son, tienen los dos sub índices, es ese el punto y por lo tanto son todos los dos",
        "start": 4169.94,
        "end": 4177.86
    },
    {
        "text": " sub índices que agregaste, subí a chijota que agregaste, son todos menos y igual que",
        "start": 4177.86,
        "end": 4182.62
    },
    {
        "text": " 0, pues si agregaste menos y igual que 0, ¿cómo agregando la cosa? ¿Por qué como dijo",
        "start": 4182.62,
        "end": 4187.179999999999
    },
    {
        "text": " Martín, estos son todos negativos? Entonces, pues tenías negativo por positivo, te queda",
        "start": 4187.179999999999,
        "end": 4192.66
    },
    {
        "text": " negativo, el asumante de caso negativo, a 0 no verdad, por negativo agregaste cosas",
        "start": 4192.66,
        "end": 4198.74
    },
    {
        "text": " positivas, ¿sabes? ¿Se entendió? Bueno, bien y ya terminamos porque fíjense, por favor",
        "start": 4198.74,
        "end": 4213.58
    },
    {
        "text": " pasen este sumando para acá, pasen todo este con el menos, lo pasan para este lado, que",
        "start": 4213.58,
        "end": 4220.9
    },
    {
        "text": " te queda, que el asuma de los de su jota, los de su híbe su hijota es mayor que 0, tomando",
        "start": 4220.9,
        "end": 4228.219999999999
    },
    {
        "text": " todos, ¿no? acá están el de la diagonal digamos y todos los demás separados. Si lo pasamos",
        "start": 4228.219999999999,
        "end": 4235.94
    },
    {
        "text": " acá, el asuma de todos te da mayor que 0, quiere decir que acá están todos ordenados",
        "start": 4235.94,
        "end": 4242.82
    },
    {
        "text": " de una manera u otra, están todos, entonces esto es mayor que 0, pero si esto es mayor",
        "start": 4242.82,
        "end": 4250.82
    },
    {
        "text": " que 0 y esto es menor igual que 0, como dijo Martín, estos son menores igual que 0,",
        "start": 4250.82,
        "end": 4257.82
    },
    {
        "text": " entonces esto en total es menor igual que 0.",
        "start": 4257.82,
        "end": 4264.82
    },
    {
        "text": " Entonces, los xxj en esta zona tiene que ser 0, quiere decir que el 0 está para acá,",
        "start": 4287.82,
        "end": 4309.82
    },
    {
        "text": " sí, exactamente, esa conclusión que dijo Santiago, ¿la vieron?",
        "start": 4310.82,
        "end": 4316.82
    },
    {
        "text": " porque si alguno de estos xxj fuera menor estricto que 0, entonces esta suma te daba en total",
        "start": 4330.82,
        "end": 4338.46
    },
    {
        "text": " negativa, negativa negativa, pero si esta suma negativa y esta es menor igual que 0,",
        "start": 4338.46,
        "end": 4345.46
    },
    {
        "text": " la suma total es negativa negativa, que no podía ser porque era mayor igual que 0, lo repito",
        "start": 4345.46,
        "end": 4352.74
    },
    {
        "text": " una vez más, Santiago sacó la conclusión, entonces esto tiene que ser todos cero, si",
        "start": 4352.74,
        "end": 4357.9800000000005
    },
    {
        "text": " hubiera 1, son todos menores igual que 0, ¿sabemos verdad? Porque estamos en esta zona, si hubiera",
        "start": 4357.9800000000005,
        "end": 4362.66
    },
    {
        "text": " 1 que fuera negativo, negativo multiplicado por algo que es positivo, esta parte es positiva,",
        "start": 4362.66,
        "end": 4366.66
    },
    {
        "text": " está, entonces a ver es positiva, sí es positiva, es lo que dijimos acá, en la suma esta",
        "start": 4366.66,
        "end": 4382.66
    },
    {
        "text": " de suy, vesuíjota desde 1 hasta n, como lo puse desde igual 1 hasta n, esta es positiva,",
        "start": 4383.66,
        "end": 4391.66
    },
    {
        "text": " positiva, tanto los sacodra acá en la conclusión, ¿ok? Estas positivas positivas, se huviera",
        "start": 4391.66,
        "end": 4401.66
    },
    {
        "text": " alguno negativo negativo, o sea realmente negativo multiplicado por algo realmente positivo,",
        "start": 4401.66,
        "end": 4405.66
    },
    {
        "text": " te queda que esa parte es negativa, todos los demás son menores igual que 0, pero tienes",
        "start": 4405.66,
        "end": 4411.66
    },
    {
        "text": " un negativo, entonces esto sería negativo negativo así que daría, pero si es un negativo",
        "start": 4411.66,
        "end": 4418.42
    },
    {
        "text": " sumado con otro que son menores igual que 0, te da negativo esta suma y no puede ser porque",
        "start": 4418.42,
        "end": 4424.18
    },
    {
        "text": " esto suma era mayor igual que 0, ¿cuál es la única posibilidad que todos estos sean cero?",
        "start": 4424.18,
        "end": 4429.7
    },
    {
        "text": " quiere decir que esto tendría que estar acá y por lo tanto es igual n, ¿se va a dar",
        "start": 4429.7,
        "end": 4437.3
    },
    {
        "text": " un negativo sumado? Sí, pero puede ser, no, te queda negativo o cero, no porque estos son",
        "start": 4438.3,
        "end": 4447.3
    },
    {
        "text": " menores igual que 0, sí menores igual que 0, cabe la posibilidad que es 0, ¿se entendió? Bien,",
        "start": 4447.3,
        "end": 4466.38
    },
    {
        "text": " quiere decir que hemos probado que es igual n, o sea que es que es más igual que 0, esto",
        "start": 4467.3,
        "end": 4486.860000000001
    },
    {
        "text": " es bien implicada, bien implicada y vamos a implicar, quiero terminarlo antes que termine la",
        "start": 4486.860000000001,
        "end": 4495.9400000000005
    },
    {
        "text": " clase, así que voy a purar un poquito el paso para la implica B, es similar un poquito",
        "start": 4495.94,
        "end": 4501.5
    },
    {
        "text": " más sencillo, probablemente que implica, que implica.",
        "start": 4501.5,
        "end": 4503.94
    },
    {
        "text": " Ah, implicabe, lo vamos a hacer un poco más rápido, ahora tenemos que, sí, sí,",
        "start": 4503.94,
        "end": 4528.179999999999
    },
    {
        "text": " ¿sí, exactamente? En lo que un equipo de 0, el otro tiene que ser 0, pues sino es",
        "start": 4533.94,
        "end": 4547.74
    },
    {
        "text": " exactamente. Bueno, vamos a hacer rápido que implica B, la hipótesis, fíjese la hipótesis,",
        "start": 4547.74,
        "end": 4554.7
    },
    {
        "text": " volviciado al recalquier, pero quiero reforzar lo antes de empezar la demostración, la hipótesis",
        "start": 4554.7,
        "end": 4559.099999999999
    },
    {
        "text": " se dice que para todo vector es fortísima el hipótesis, que cualquier vector, damos un vector",
        "start": 4559.1,
        "end": 4564.54
    },
    {
        "text": " cualquiera de coordenada mayor igual que 0, el sistema tiene una única solución, eso lo",
        "start": 4564.54,
        "end": 4569.42
    },
    {
        "text": " sabemos, porque ahora, bueno, y así, ahora es parte del hipótesis que tiene una única",
        "start": 4569.42,
        "end": 4576.46
    },
    {
        "text": " solución, pero además las soluciones es aquí mayor igual que 0, es fortísima la condición,",
        "start": 4576.46,
        "end": 4583.18
    },
    {
        "text": " pero resultaba que era equivalente a de una dominante, eso es lo que estamos probando, bueno,",
        "start": 4583.18,
        "end": 4586.900000000001
    },
    {
        "text": " tomemos el hipótesis que tenemos, es muy fuerte, entonces para todo y mayor que 0 en particular,",
        "start": 4587.46,
        "end": 4593.66
    },
    {
        "text": " si es para todo y mayor igual que 0, puedo tomar un hip mayor que 0, existe un X mayor igual que 0,",
        "start": 4593.66,
        "end": 4600.379999999999
    },
    {
        "text": " tal que BX es igual, eso es la hipótesis, entonces ves un jota por X j, lo que voy a hacer es",
        "start": 4601.379999999999,
        "end": 4612.379999999999
    },
    {
        "text": " escribir eso mismo, es mayor igual que la suma de los BX y J por X j desde J igual 1,",
        "start": 4612.38,
        "end": 4623.9400000000005
    },
    {
        "text": " hasta N, es de J igual no hasta N, y culpa,",
        "start": 4623.9400000000005,
        "end": 4630.38
    },
    {
        "text": " este es mayor igual que me lo explica J, puse un, esta bien, este es que me lo explica",
        "start": 4630.38,
        "end": 4642.900000000001
    },
    {
        "text": " rapidito, este es mayor igual, este es bastante obvio, este muchacho es uno de los sumandos",
        "start": 4642.900000000001,
        "end": 4650.34
    },
    {
        "text": " de acá, acá están todos, todos los demás aportan con B su hijota, menor igual que 0 y recuerden",
        "start": 4650.34,
        "end": 4659.78
    },
    {
        "text": " que ya tenemos que es parte del hipótesis que el X es mayor igual que 0, entonces todo",
        "start": 4659.78,
        "end": 4665.179999999999
    },
    {
        "text": " y lo demás va aportando en todo caso sumando negativos, por tanto este muchacho es igual es obvio,",
        "start": 4665.179999999999,
        "end": 4670.0599999999995
    },
    {
        "text": " tal, este muchacho es igual es obvio, bueno pero esto, si mire esto es justamente cuando multiplique",
        "start": 4670.0599999999995,
        "end": 4678.78
    },
    {
        "text": " la fila a ver si digo bien, quiero decirlo bien,",
        "start": 4678.78,
        "end": 4683.62
    },
    {
        "text": " lo escribí somal, es que me deje llevar por lo que o sea, es igual 1 hasta N, lo mismo,",
        "start": 4689.78,
        "end": 4708.179999999999
    },
    {
        "text": " la misma consideración, solo que la que varía es la coordenada ahí, las j estas fija,",
        "start": 4708.179999999999,
        "end": 4713.3
    },
    {
        "text": " esto vale para cualquier j, pero en esta ecuación cita la j esta fija, veis su j j, por",
        "start": 4713.3,
        "end": 4722.96
    },
    {
        "text": " que el argumento es el mismo, lo que estoy haciendo es sumando B su hijota, por aquí su j,",
        "start": 4722.96,
        "end": 4728.9800000000005
    },
    {
        "text": " aquí j, pero B su hijota justamente con coordenada diferente, cuando le va sumando en todo caso",
        "start": 4728.9800000000005,
        "end": 4735.54
    },
    {
        "text": " de crece en la suma es más chica que el primero que tenías, eso está perfecto, ahora sí,",
        "start": 4735.54,
        "end": 4741.38
    },
    {
        "text": " cuando sumo B su otra vez, si yo quiero esto me da, yo quiero que esto me da I sui,",
        "start": 4741.9400000000005,
        "end": 4756.42
    },
    {
        "text": " no estoy escribiendo mal de hoy, no?",
        "start": 4756.42,
        "end": 4759.42
    },
    {
        "text": " estaba bien escrito hoy ¿no? B sui 1 por aquí sui 1, B sui, claro está bien escrito hoy,",
        "start": 4759.42,
        "end": 4775.62
    },
    {
        "text": " con coorden igual 1 hasta, el mismo argumento perdón, B sui 1 por aquí sui 1, B sui 2 por aquí 2,",
        "start": 4775.62,
        "end": 4785.38
    },
    {
        "text": " así papá fila, la fila de B sui, por aquí j, me da y sui estaba perfecto como estaba",
        "start": 4785.38,
        "end": 4791.78
    },
    {
        "text": " hoy, y como lo vimos en un argumento esto es porque B por aquí se sigua ahí, ahora",
        "start": 4791.78,
        "end": 4801.86
    },
    {
        "text": " Eli no tome cualquier I, tome un I positivo, todas sus coordenadas son positivas en particular",
        "start": 4801.86,
        "end": 4810.22
    },
    {
        "text": " y sui es positivo y por qué tanto lío para esto de positivo, bueno sí que, porque",
        "start": 4810.22,
        "end": 4817.780000000001
    },
    {
        "text": " resulta que mira como te quedó, que la este término es mayor igual que este y este mayor",
        "start": 4817.780000000001,
        "end": 4823.9400000000005
    },
    {
        "text": " que 0, porque a yo arranqué con uno positivo, porque la verlo permitía la hipótesis, entonces",
        "start": 4823.9400000000005,
        "end": 4829.740000000001
    },
    {
        "text": " este número es positivo, entonces ve su j, j por x, j es mayor que 0, pero si ve su j,",
        "start": 4829.740000000001,
        "end": 4837.5
    },
    {
        "text": " y la hipótesis es por aquí j es mayor que 0, tanto aquí j es mayor que 0 como ve su j,",
        "start": 4837.5,
        "end": 4841.46
    },
    {
        "text": " j es mayor que 0, lo 2 es mayor, o sea recuerden que ya teníamos la hipótesis y que son",
        "start": 4841.46,
        "end": 4845.66
    },
    {
        "text": " mayores igual, ¿no verdad? perdón, ve sui es mayor que 0 y el aquí j es mayor igual",
        "start": 4845.66,
        "end": 4852.06
    },
    {
        "text": " que 0, bueno ahora tenés la, agregás que aquí j es positivo, porque si no te daría",
        "start": 4852.06,
        "end": 4857.58
    },
    {
        "text": " 0 acá, o sea que conclusión, aquí j es mayor que 0 para todo j, porque esto le hicimos",
        "start": 4857.58,
        "end": 4866.06
    },
    {
        "text": " para un j, pero para cualquiera, tremendo esto, porque fíjense lo que estamos diciendo,",
        "start": 4866.06,
        "end": 4874.22
    },
    {
        "text": " la conclusión en principio es que el x es mayor igual que 0, pero haciendo una cuenta mínima",
        "start": 4874.22,
        "end": 4880.46
    },
    {
        "text": " porque como dice que lo podés hacer para cualquier vector y tomo un íb positivo y termino",
        "start": 4880.46,
        "end": 4884.9400000000005
    },
    {
        "text": " probando que la coordenada tiene que ser positiva realmente, ok, bueno, pero surge de la",
        "start": 4884.9400000000005,
        "end": 4891.56
    },
    {
        "text": " demostración, o sea que lo que estamos diciendo acá que el x es mayor que 0, o sea el x j",
        "start": 4891.56,
        "end": 4900.4800000000005
    },
    {
        "text": " es mayor, en particular, sigo para acá, en particular, ve su j, j por x j es mayor que",
        "start": 4900.4800000000005,
        "end": 4915.92
    },
    {
        "text": " la suma con ir distintos de j, de vez suijota por x y y a ver si esto no está en acuerdo,",
        "start": 4915.92,
        "end": 4932.92
    },
    {
        "text": " esto es mayor que 0, esto es mayor que 0, esto es menor igual que 0 y esto es mayor que",
        "start": 4932.92,
        "end": 4938.4
    },
    {
        "text": " 0, entonces esto te da un número positivo y estos sumandos son todos menores iguales",
        "start": 4938.4,
        "end": 4947.16
    },
    {
        "text": " que 0, lo vieron, la suma de sumandos menores iguales que 0 es menor igual que 0, este",
        "start": 4947.16,
        "end": 4952.839999999999
    },
    {
        "text": " número es menor igual que 0 en total y este es mayor que 0, entonces esto es mayor estricto,",
        "start": 4952.839999999999,
        "end": 4959.32
    },
    {
        "text": " ¿viene esto? Bueno, ahora bien, pensemos juntos, voy a poner una afirmación, B, T es",
        "start": 4959.32,
        "end": 4974.759999999999
    },
    {
        "text": " de diagonal dominante, o tiene diagonal dominante, con esto casi que cierra la demostración,",
        "start": 4974.76,
        "end": 4989.360000000001
    },
    {
        "text": " pero quién se anima de acá para acá, explicándome por qué, porque nos puse primero que nada",
        "start": 4989.360000000001,
        "end": 4994.8
    },
    {
        "text": " primer pista, porque nos puse B, puse B, la transporta y segundo, ¿quién es el vector",
        "start": 4994.8,
        "end": 5001.72
    },
    {
        "text": " de ese de la definición de diagonal dominante acá? Son preguntas sugerencias para pensar,",
        "start": 5001.72,
        "end": 5011.88
    },
    {
        "text": " ¿quién es el que va ponderando acá? El x, el x el que viene a ayudar a la ponderación,",
        "start": 5017.280000000001,
        "end": 5023.16
    },
    {
        "text": " bien, dicho eso, estamos mirando por columnas que es así la definición de diagonal dominante",
        "start": 5023.72,
        "end": 5030.639999999999
    },
    {
        "text": " por fila, entonces está transpuesta, exactamente, miramos filas, ¿no? Porque a ver cómo quedó",
        "start": 5030.639999999999,
        "end": 5037.76
    },
    {
        "text": " por las dudas, estamos moviendo el A, si estamos moviendo el A, estamos moviendo B sub 2, J, B sub 3, J, B sub 4, J,",
        "start": 5037.76,
        "end": 5047.04
    },
    {
        "text": " está, ¿no? Estamos moviendo están moviendo al с normal ásten Ronnie, es posible que algún",
        "start": 5048.04,
        "end": 5058.04
    },
    {
        "text": " plotting gorilla este con la cuna y va, no tenemos la Scr, la tenemos para la ponouredmagiaющina.",
        "start": 5058.04,
        "end": 5066.68
    },
    {
        "text": " ¿Tenemos la jota fíqueta?",
        "start": 5066.68,
        "end": 5072.68
    },
    {
        "text": " Sí, no, el que cuando puse y distinto de jota se supone que estoy moviendo...",
        "start": 5072.68,
        "end": 5078.68
    },
    {
        "text": " La ahí, entonces lo que yo anote tendría que haber puesto jota distinto ahí y a ver si está bien.",
        "start": 5078.68,
        "end": 5088.68
    },
    {
        "text": " Acá está moviendo la jota, a ver si está bien.",
        "start": 5088.68,
        "end": 5092.68
    },
    {
        "text": " Ves su jota jota por el que jota, es mayor que cero, sí señor.",
        "start": 5092.68,
        "end": 5096.68
    },
    {
        "text": " Acá estoy moviendo, con jota distinto de ahí, ves su hijota, es menor igual que cero, si señor por hipote.",
        "start": 5096.68,
        "end": 5103.68
    },
    {
        "text": " Y acá que estoy poniendo.",
        "start": 5103.68,
        "end": 5108.68
    },
    {
        "text": " Acá tendría que poner el que jota.",
        "start": 5108.68,
        "end": 5112.68
    },
    {
        "text": " Y es mayor que cero, sí, correcto.",
        "start": 5112.68,
        "end": 5115.68
    },
    {
        "text": " Y ahora que estoy moviendo, ves su, estoy moviendo, estoy dejando el hífijo, entonces estoy moviendo, estoy moviendo por fin, correcto.",
        "start": 5115.68,
        "end": 5127.68
    },
    {
        "text": " Sí, me pregunto porque no saqué la conclusión directa de la otra manera, ¿no?",
        "start": 5133.68,
        "end": 5137.68
    },
    {
        "text": " Porque el libro no se lo hacía, entonces se ve este tiende de verdad, me nominante, pero ahora me pregunto si no sale directamente por la otra manera.",
        "start": 5137.68,
        "end": 5144.68
    },
    {
        "text": " Lo voy a pensar después, pero voy a seguir por las dudas la demostración del libro para no hacer un error.",
        "start": 5144.68,
        "end": 5150.68
    },
    {
        "text": " Ahora me pregunto por qué no la otra demostración, la que habíamos incorrectamente puesto que era correcta.",
        "start": 5150.68,
        "end": 5156.68
    },
    {
        "text": " Pero bueno, fíjense que bonito este final, miren lo que prueba del tipo, yo me voy a salir de la demostración y miren lo que es esto, es una maravilla.",
        "start": 5156.68,
        "end": 5165.68
    },
    {
        "text": " Al punto que cuando la preparé la clase se le mostré a Marco Pérez, yo me voy a ser bonito esto, si le pregunte si alguna vez había visto esta demostración, este tipo de demostración.",
        "start": 5165.68,
        "end": 5174.68
    },
    {
        "text": " Yo digo que acá es terminado la demostración, fíjense lo que pasó, tenemos una matriz B o digamos, una condicion A y una condición B.",
        "start": 5174.68,
        "end": 5183.68
    },
    {
        "text": " Entonces, ¿qué probamos? ¿Qué B? ¿Le hicimos juntos hace un rato? ¿Qué B implica? ¿Cierto?",
        "start": 5183.68,
        "end": 5191.68
    },
    {
        "text": " Y ahora que probamos, ¿Qué A implica B? ¿Pero para quién?",
        "start": 5191.68,
        "end": 5197.68
    },
    {
        "text": " Ajá. Entonces, ¿qué vas a hacer? B trampuesta tiene de una dominante. Entonces, B trampuesta implica A, pero para quién?",
        "start": 5197.68,
        "end": 5211.68
    },
    {
        "text": " Para la condición esta, pero para la B trampuesta, o sea todo lo mismo, pero para B trampuesta.",
        "start": 5211.68,
        "end": 5218.68
    },
    {
        "text": " Entonces, haces esta misma argumentación y te vas a quién.",
        "start": 5218.68,
        "end": 5224.68
    },
    {
        "text": " ¿No te lo hagas? Es una maravilla. Se termino la demostración. ¿Centen Dios? ¿Por qué voy a decir?",
        "start": 5224.68,
        "end": 5233.68
    },
    {
        "text": " Yo tengo que B implica A y que A implica B, pero para la traspuesta. Abarba, entonces agarrar la traspuesta implica A para su traspuesta.",
        "start": 5233.68,
        "end": 5241.68
    },
    {
        "text": " Entonces, esta es el potes y para la traspuesta implica que es su traspuesta que B vale el traspuesta.",
        "start": 5241.68,
        "end": 5247.68
    },
    {
        "text": " A mí me cantó. Por lo tanto, por eso quería dejarlo así. Ahora igual me pregunto si el otro que a mi más crito estaba bien.",
        "start": 5247.68,
        "end": 5254.68
    },
    {
        "text": " Creo que sí. Y con eso sacábamos B directo. Entonces, con este esquemita B tiene de una dominante.",
        "start": 5254.68,
        "end": 5263.68
    },
    {
        "text": " Ojo, pero esto es todo esto que está acá, todo esta razonamiento que hicimos juntos.",
        "start": 5271.68,
        "end": 5277.68
    },
    {
        "text": " Tupongo así para que quede clasarlo a pongo un rojo. Es este esquemita acá.",
        "start": 5277.68,
        "end": 5285.68
    },
    {
        "text": " Bueno chicos, a veces nos entreberamos un poquito con los subíndices, pero es la matemática es maravillosa.",
        "start": 5285.68,
        "end": 5294.68
    },
    {
        "text": " La idea de la terminar la clase hoy no pudimos con la sección 1 o 5, si pueden lean la, es muy cortita.",
        "start": 5294.68,
        "end": 5301.68
    },
    {
        "text": " Vamos a arrancar la clase que viene con la sección 1 o 5, que es la reinterpretación del León Tief con toda la matemática que hicimos juntos.",
        "start": 5301.68,
        "end": 5307.68
    },
    {
        "text": " De hecho, capaz que la clase del martes empiezo, resumiendo los resultados, tomándolo que era León Tief, el encar de León Tief que hicimos juntos,",
        "start": 5307.68,
        "end": 5316.68
    },
    {
        "text": " algún resumen cortito de todos los resultados que tenemos ahora y entonces repasamos el León Tief como lo podemos plantear ahora.",
        "start": 5316.68,
        "end": 5323.68
    },
    {
        "text": " Y ahí nos vamos a... al partito de los demás más que tienen matemáticas y terminamos la aplicación.",
        "start": 5323.68,
        "end": 5330.68
    }
]