[
    {
        "text": " Cuando vieron con ella sin ningún problema, al día de hoy vamos a estar comenzando.",
        "start": 0.0,
        "end": 20.8
    },
    {
        "text": " Al día de hoy vamos a comenzar este cuarto tema, cuarto item que forma parte de la propuesta",
        "start": 30.0,
        "end": 54.68
    },
    {
        "text": " para este primer bloque temático que recibe la economía de escritorio. En este caso vamos",
        "start": 54.68,
        "end": 60.92
    },
    {
        "text": " a estar iniciando una presentación de un instrumento de escritorio que forma parte también",
        "start": 60.92,
        "end": 66.64
    },
    {
        "text": " de los instrumentos de escritorio de la Contabilidad Nacional, que tiene como objetivo registrar",
        "start": 66.64,
        "end": 71.72
    },
    {
        "text": " todas las transacciones que se dan entre un país y el resto del mundo, que se denomina",
        "start": 71.72,
        "end": 77.68
    },
    {
        "text": " la balanza de Pados. Por tanto, ya estamos planteando el objetivo principal, cuál es el fenómeno,",
        "start": 77.68,
        "end": 86.04
    },
    {
        "text": " los fenómenos económicos que va a describir este instrumento denominado balanza de Pados,",
        "start": 86.04,
        "end": 92.48
    },
    {
        "text": " tiene que ver con un registro, un instrumento contable de registro, de todas las transacciones",
        "start": 92.48,
        "end": 99.0
    },
    {
        "text": " que se verifican en cierto periodo de tiempo entre Uruguay y el resto del mundo, entre el resto",
        "start": 99.0,
        "end": 104.44000000000001
    },
    {
        "text": " del mundo y Uruguay y subrayo todas las transacciones económicas que se den entre Uruguay",
        "start": 104.44,
        "end": 111.52
    },
    {
        "text": " y el mundo como vamos a ir reconociendo, más allá de algunas que quizás son las primeras",
        "start": 111.52,
        "end": 117.67999999999999
    },
    {
        "text": " que se nos vienen la cabeza, que ahora vamos a presentar.",
        "start": 117.67999999999999,
        "end": 123.12
    },
    {
        "text": " Bien, algunos comentarios, algunos comentarios más bien, dos comentarios que hacen a la metodología",
        "start": 123.12,
        "end": 131.88
    },
    {
        "text": " de compilación de este instrumento descriptivo, el lanzado de Pados, es un instrumento contable",
        "start": 131.88,
        "end": 138.07999999999998
    },
    {
        "text": " de registración de transacciones, ¿verdad? Por lo tanto va a verificar o va a utilizar un criterio",
        "start": 138.07999999999998,
        "end": 151.07999999999998
    },
    {
        "text": " de registración que se denomina Partida Doble. El criterio de la Partida Doble como criterio",
        "start": 151.07999999999998,
        "end": 155.48
    },
    {
        "text": " contable implica que toda transacción implicará una doble registración, por lo lado tendremos",
        "start": 155.48,
        "end": 160.76
    },
    {
        "text": " un crédito, por ejemplo, cuando Uruguay vende carne al mundo, por un lado, en el auge perfecto,",
        "start": 161.48,
        "end": 168.0
    },
    {
        "text": " es una actividad de venta, de bienes, de marcancias al mundo, pero esto diremos que implica",
        "start": 168.0,
        "end": 175.0
    },
    {
        "text": " una doble registración por este famoso criterio de la Partida Doble, por un lado la balance",
        "start": 175.0,
        "end": 179.07999999999998
    },
    {
        "text": " de Pados registrarán la salida de la marcancia de Uruguay, la salida de esa carne de Uruguay",
        "start": 179.07999999999998,
        "end": 184.76
    },
    {
        "text": " y por otro la contraparte financiera que quizás es un ingreso de divisas, un ingreso de",
        "start": 184.76,
        "end": 189.2
    },
    {
        "text": " dólares. Por lo tanto, aparecen, acá estamos visualizando claramente la doble registración,",
        "start": 189.2,
        "end": 194.48
    },
    {
        "text": " este ejemplo de venta de marcancias al mundo, ¿verdad? La salida por un lado de la marcancia",
        "start": 194.48,
        "end": 200.11999999999998
    },
    {
        "text": " y por otro lado el ingreso del dinero, una doble registración. El otro aspecto que hace",
        "start": 200.11999999999998,
        "end": 208.95999999999998
    },
    {
        "text": " más a la lectura de las variables involucradas en la balance de Pados, los ruros, involucrados",
        "start": 208.95999999999998,
        "end": 213.51999999999998
    },
    {
        "text": " y los resultados, tiene que ver con que las variables son variables de flujo y no de",
        "start": 213.51999999999998,
        "end": 218.67999999999998
    },
    {
        "text": " flujo. Esto es de veráncer advertidas, interpretadas como variaciones en ese periodo de tiempo,",
        "start": 218.68,
        "end": 225.44
    },
    {
        "text": " no son volúmenes, stocks, no son cantidad de algo, cantidad de marcancias que salieron",
        "start": 225.44,
        "end": 232.32
    },
    {
        "text": " sino la variación de las marcancias que se exportaron en ese periodo, variables de flujo",
        "start": 232.32,
        "end": 238.0
    },
    {
        "text": " y no variables de stocks. Por lo tanto, dos cuestiones metodológicas,",
        "start": 238.0,
        "end": 243.0
    },
    {
        "text": " la balance de Pados respetará el criterio contable de la Partida Doble, esto es y esto",
        "start": 243.0,
        "end": 247.64000000000001
    },
    {
        "text": " guardamos para el final para advertir que quizás no siempre la contablemente la balance",
        "start": 247.64,
        "end": 252.95999999999998
    },
    {
        "text": " de Pados Sierra y presentaremos hacia el final de la presentación, como es que se soluciona",
        "start": 252.95999999999998,
        "end": 258.91999999999996
    },
    {
        "text": " es inconveniente de que no cierre contablemente, esto es que el total de débitos no se",
        "start": 258.91999999999996,
        "end": 262.76
    },
    {
        "text": " igual, total de créditos por ese criterio de la Partida Doble, ¿verdad? Y el otro",
        "start": 262.76,
        "end": 266.71999999999997
    },
    {
        "text": " aspecto tiene que ver con la lectura de las variables que todas serán advertidas como",
        "start": 266.71999999999997,
        "end": 271.2
    },
    {
        "text": " variables de flujo y no de stocks, por lo tanto, corresponden a variaciones, a cambios",
        "start": 271.2,
        "end": 277.8
    },
    {
        "text": " en ese periodo de tiempo. ¿Cuál es el organismo que se encarga de reproducir, de relevar",
        "start": 277.8,
        "end": 284.2
    },
    {
        "text": " información, de sistematizar información y de producir, compilar esta balanza de Pau",
        "start": 284.2,
        "end": 289.8
    },
    {
        "text": " Ya no es el Instituto Nacional de Estadística, Ya no es el INE, como hasta ahora lo era",
        "start": 289.8,
        "end": 295.44
    },
    {
        "text": " para los indicadores del Mercado de Laboral, la verdad a través de la encuesta continuo",
        "start": 295.44,
        "end": 299.03999999999996
    },
    {
        "text": " a variar, la tasa de desempleo, la tasa de ocupación, la tasa de actividad, todo",
        "start": 299.04,
        "end": 304.44
    },
    {
        "text": " hace produce a partir de información que completan las categorías de población, que surge",
        "start": 304.44,
        "end": 310.68
    },
    {
        "text": " en información de la encuesta continuo a variar, y era el Instituto Nacional de Estadística",
        "start": 310.68,
        "end": 314.44
    },
    {
        "text": " quien producía mensualmente esa información, ¿verdad? Lo mismo el INE producían de información",
        "start": 314.44,
        "end": 320.12
    },
    {
        "text": " que tenía que ver con indicadores de precios, el IPC, no a través de la encuesta continuo,",
        "start": 320.12,
        "end": 325.12
    },
    {
        "text": " a través de una metodología distinta, de formar una canasta representativa del consumo",
        "start": 325.12,
        "end": 330.76
    },
    {
        "text": " de un hogar y mensualmente relevar precios de los productos y a través del valor de la canasta,",
        "start": 330.76,
        "end": 336.96
    },
    {
        "text": " ir construyendo la serie del índice de precios de consumo, pero era el INE quien producía",
        "start": 336.96,
        "end": 341.84000000000003
    },
    {
        "text": " esos datos. Y por último, como vieron la clase anterior con María, los indicadores de salario,",
        "start": 341.84000000000003,
        "end": 350.84000000000003
    },
    {
        "text": " tanto el índice medio de salarios como el índice salio real, los construye, los produce,",
        "start": 350.84,
        "end": 356.23999999999995
    },
    {
        "text": " el Instituto Nacional de Estadística. En este caso, la balanza de pavos no la produce,",
        "start": 356.23999999999995,
        "end": 361.64
    },
    {
        "text": " el Instituto Nacional de Estadística, sino que es el mismo banco central de Uruguay, la",
        "start": 361.64,
        "end": 366.88
    },
    {
        "text": " autoridad monetaria, el Banco Central de Uruguay, el BCU, este ente autónomo que todos",
        "start": 366.88,
        "end": 371.35999999999996
    },
    {
        "text": " conocemos, ¿verdad? Que tiene sita en la calle Uruguay y Florida, ¿verdad? Es edificio.",
        "start": 371.35999999999996,
        "end": 377.4
    },
    {
        "text": " Bueno, la autoridad monetaria, además de ser un organismo como ente público que tiene sus",
        "start": 377.4,
        "end": 383.79999999999995
    },
    {
        "text": " competencias principales, bueno, tiene el monopolio de la creación de dinero, ¿verdad? Es",
        "start": 383.79999999999995,
        "end": 390.03999999999996
    },
    {
        "text": " quien dirige, planifica la política monetaria, la política de precios, ¿verdad? Tiene",
        "start": 390.03999999999996,
        "end": 395.76
    },
    {
        "text": " el objetivo de controlar la inflación, entre otros actividades, produce este instrumento",
        "start": 395.76,
        "end": 400.79999999999995
    },
    {
        "text": " de escribito, ¿qué se publica trimestralmente? Lo vamos a estar viendo publicado trimestralmente,",
        "start": 400.8,
        "end": 407.64
    },
    {
        "text": " sin perjuicio de que esta información de la balanza de pavos, si abrimos un diario, vamos a la página",
        "start": 407.64,
        "end": 412.76
    },
    {
        "text": " donde aparecen todos esos números, ¿verdad? Que hacen a los cuestiones de escribito, ¿aparecerá",
        "start": 412.76,
        "end": 417.96000000000004
    },
    {
        "text": " por ahí la balanza de pavos? ¿Cómo va a hacer la presentación del tema? Va a ser una",
        "start": 417.96000000000004,
        "end": 423.88
    },
    {
        "text": " presentación bastante general, bastante por arriba, tratando de que el alumno comprenda qué",
        "start": 423.88,
        "end": 431.24
    },
    {
        "text": " información encontramos en la balanza de pavos, si quiera información relativamente aspecto de",
        "start": 431.24,
        "end": 437.28
    },
    {
        "text": " las transacciones entre Uruguay y el mundo, ¿a qué parte de la balanza de pavos tengo que ir?",
        "start": 437.28,
        "end": 441.71999999999997
    },
    {
        "text": " ¿Y cómo leó los grandes resultados, los principales saldos, que al final presentaremos que tiene que",
        "start": 441.71999999999997,
        "end": 447.56
    },
    {
        "text": " ver con los saldos parciales, ¿verdad? De la balanza de pavos, ¿cómo se interpretan? ¿Cómo se",
        "start": 447.56,
        "end": 451.88
    },
    {
        "text": " interpretan esa información? ¿Por qué es importante monitorear esa información? Más allá de que,",
        "start": 451.88,
        "end": 457.88
    },
    {
        "text": " como todas las presentaciones en descripción, son objetivas, son cuentativas, ¿verdad? No hacemos",
        "start": 457.88,
        "end": 462.36
    },
    {
        "text": " juicios de valor ni establecemos relaciones de causalidad o consecuencias, pero vamos a comentar también",
        "start": 462.36,
        "end": 467.84
    },
    {
        "text": " qué utilidad tiene esta información que está comprendida dentro de la balanza de pavos. Comentarios",
        "start": 467.84,
        "end": 475.52
    },
    {
        "text": " de la presentación, y los invito a meternos de lleno en la misma, en la balanza de pavos. Y estas",
        "start": 475.52,
        "end": 483.71999999999997
    },
    {
        "text": " dos flechas están tratando que hay dos grandes partes que forman este instrumento de",
        "start": 483.71999999999997,
        "end": 489.59999999999997
    },
    {
        "text": " scriptivo, balanza de pavos, dos grandes cuentas, por un lado la cuenta corriente, y por otro",
        "start": 489.59999999999997,
        "end": 500.2
    },
    {
        "text": " lado la cuenta capital y financiera. Dos grandes cuentas forman parte de la balanza de pavos,",
        "start": 500.2,
        "end": 514.0
    },
    {
        "text": " la cuenta corriente, y por otro lado la cuenta capital y financiera. Estos son los nombres.",
        "start": 514.0,
        "end": 519.96
    },
    {
        "text": " Esta llave no es una llave, pero bueno, se parece, a una llave.",
        "start": 519.96,
        "end": 533.6
    },
    {
        "text": " Abra la pregunta de qué es lo que encontramos en la cuenta corriente de la balanza de pavos. ¿Qué",
        "start": 533.6,
        "end": 542.12
    },
    {
        "text": " tipo de transacciones vamos a encontrar en esta primera parte, en esta primera cuenta que es la",
        "start": 542.12,
        "end": 549.4000000000001
    },
    {
        "text": " cuenta corriente de la balanza de pavos? Luego presentaremos la misma pregunta para la cuenta capital y financiera.",
        "start": 549.4,
        "end": 556.36
    },
    {
        "text": " Entonces, este paréntesis, este paréntesis no, esta llave abre la pregunta de qué tipo de transacciones",
        "start": 556.36,
        "end": 565.16
    },
    {
        "text": " encontramos en la balanza de pavos. Por un lado, aquellas transacciones que tienen que ver con",
        "start": 565.16,
        "end": 574.1999999999999
    },
    {
        "text": " la con el movimiento de bienes y servicios entre Uruguay y el mundo, esto es cuando una gente",
        "start": 574.2,
        "end": 585.84
    },
    {
        "text": " económico-residente vende productos, vende bienes o presta algún servicio, vende algún servicio",
        "start": 585.84,
        "end": 592.9200000000001
    },
    {
        "text": " al mundo, esa transacción bastar registrada en la cuenta corriente, tanto así como si",
        "start": 592.9200000000001,
        "end": 600.2
    },
    {
        "text": " alguna gente económico-residente le compra, aún no residente le compramos al resto del mundo,",
        "start": 600.2,
        "end": 605.6800000000001
    },
    {
        "text": " algún bien o algún servicio. Por lo tanto, tendremos rubros que guardan relación con el movimiento",
        "start": 605.6800000000001,
        "end": 613.6400000000001
    },
    {
        "text": " de bienes y servicios. Salida de bienes, salida entre comillas de servicios, venta, de bienes y venta",
        "start": 613.6400000000001,
        "end": 621.2
    },
    {
        "text": " de servicios y compra de bienes, compra de servicios. En un sentido y en otro siempre, ¿verdad? En un",
        "start": 621.2,
        "end": 627.6800000000001
    },
    {
        "text": " sentido y de vuelta. Ya que hablamos del movimiento de bienes y servicios, dentro de la cuenta",
        "start": 627.68,
        "end": 638.12
    },
    {
        "text": " corriente plantemos la denominación que adquieren los principales rubros de la cuenta corriente.",
        "start": 638.12,
        "end": 647.1999999999999
    },
    {
        "text": " Está bien, ¿no? Deciérdesemos, dentro de la cuenta corriente encontramos rubros que tienen",
        "start": 647.1999999999999,
        "end": 652.56
    },
    {
        "text": " que ver con el movimiento de bienes y servicios, con compra y con venta perfecto, ¿cómo se llaman?",
        "start": 652.56,
        "end": 657.3599999999999
    },
    {
        "text": " ¿Cómo le llamamos a esos rubros? Y ahí vamos a presentar los más importantes, los principales.",
        "start": 657.3599999999999,
        "end": 663.04
    },
    {
        "text": " ¿A qué el rubro que registra la sal tanto la salida como la entrada de bienes se denomina mercancías?",
        "start": 663.04,
        "end": 670.56
    },
    {
        "text": " Mercancías.",
        "start": 672.7199999999999,
        "end": 673.8399999999999
    },
    {
        "text": " El ruro se denomina mercancía, ¿verdad? Salida de bienes o ingreso de bienes.",
        "start": 673.84,
        "end": 686.32
    },
    {
        "text": " Exportación de bienes, esto es venta comercialización hacia afuera, venta de bienes de Uruguay",
        "start": 686.32,
        "end": 693.0400000000001
    },
    {
        "text": " al mundo, exportaciones y compra de bienes de Uruguay al mundo. Dando lugar, como estamos diciendo,",
        "start": 693.0400000000001,
        "end": 699.2
    },
    {
        "text": " a las exportaciones de bienes y las importaciones de bienes. Ya sea, en un sentido o en otro.",
        "start": 699.2,
        "end": 708.8000000000001
    },
    {
        "text": " Un comentario aclaratorio también de la alcance de la presentación, ¿a dónde vamos a ir en",
        "start": 711.6,
        "end": 717.5200000000001
    },
    {
        "text": " este curso aquí en ingeniería con la presentación de balance de pago? Vamos a presentarlo como dijimos,",
        "start": 717.5200000000001,
        "end": 722.0
    },
    {
        "text": " es un rato en términos muy generales, no me voy a meter en aspectos que tienen que ver cómo se",
        "start": 722.0,
        "end": 727.2800000000001
    },
    {
        "text": " registra, ¿no? Si una exportación corresponde a un crédito o un débito, cosa que corresponde a un",
        "start": 727.28,
        "end": 732.56
    },
    {
        "text": " crédito, ¿eh? Y si una importación de bienes corresponde a un débito, como lo corresponde,",
        "start": 732.56,
        "end": 738.24
    },
    {
        "text": " no nos vamos a meter en la técnica de registro, no nos interesa que ustedes aprendan, porque",
        "start": 738.24,
        "end": 744.4
    },
    {
        "text": " a más requeriríamos obviamente un poco más de tiempo, que ustedes aprendan la técnica de registro,",
        "start": 744.4,
        "end": 748.64
    },
    {
        "text": " sino simplemente reconocer la información que está ahí adentro y cómo se lee los resultados,",
        "start": 748.64,
        "end": 753.52
    },
    {
        "text": " con eso nos basta, ustedes nos van a trabajar, es un poco lo que hablamos de que sabemos que nos",
        "start": 753.52,
        "end": 758.4
    },
    {
        "text": " formamos economistas, ¿verdad? Simplemente con esto basta. Son presentaciones un poco más generales,",
        "start": 758.4,
        "end": 764.0
    },
    {
        "text": " bien el primer ruro que registra el movimiento de bienes en particular se denomina marcancias,",
        "start": 764.0,
        "end": 770.0
    },
    {
        "text": " se han hacia afuera y se han hacia adentro y abiertan el nombre que puse, hablen exportaciones o",
        "start": 770.0,
        "end": 774.92
    },
    {
        "text": " importaciones de bienes, ¿eh? Si estamos hablando de que hay una gente reciente, una empresa",
        "start": 774.92,
        "end": 780.0
    },
    {
        "text": " urbaya que le vende marcancias al mundo, bueno perfecto se estará configurando lo que conocemos",
        "start": 780.0,
        "end": 785.4
    },
    {
        "text": " con el nombre de una exportación de bienes y si la adquisición es de marcancias de bienes,",
        "start": 785.4,
        "end": 791.4
    },
    {
        "text": " que Uruguay le compra el mundo, por ejemplo, ¿qué le compramos al mundo en términos de bienes?",
        "start": 791.4,
        "end": 798.0
    },
    {
        "text": " ¿Qué cuál es el principal rubro de importación o uno de los principales, quizás fue el principal?",
        "start": 800.0,
        "end": 805.36
    },
    {
        "text": " Bien, alguien hablaba de ropa, ¿no? Vestimentas, ¿eh? Compramos muchas",
        "start": 806.36,
        "end": 810.64
    },
    {
        "text": " vestimentas y nosotros hacemos un ejercicio de ver las etiquetas de toda nuestra ropa, es",
        "start": 810.64,
        "end": 815.44
    },
    {
        "text": " probable que veamos China, que veamos Vietnam, que veamos Singapore, que veamos mal hacia o no.",
        "start": 815.44,
        "end": 819.6
    },
    {
        "text": " Crudo, ¿eh? O no, crudo. Automobiles, bienes de capital, maquinaria, tecnología,",
        "start": 820.76,
        "end": 831.0
    },
    {
        "text": " pero ya más a nivel de aparatos, verdad, tecnología de aparatos, importamos todo eso o no.",
        "start": 831.0,
        "end": 837.2
    },
    {
        "text": " Sí, es más, la piseras de estas, ¿no? Si yo miro lo origen, he hecho en Japón,",
        "start": 839.8,
        "end": 845.36
    },
    {
        "text": " es importado de Japón, yo pensé que era China, ¿no? Mira, es de mejor calidad.",
        "start": 846.84,
        "end": 850.6
    },
    {
        "text": " Bueno, siempre se dice, ¿no? Es como un prejuicio bastante feo,",
        "start": 852.36,
        "end": 859.56
    },
    {
        "text": " yo decir que los chinos de baja calidad, ¿no? Sí, es verdad, pero este que uno tiende a decir",
        "start": 859.56,
        "end": 866.16
    },
    {
        "text": " que como que los chinos es baratija, baratija de, ¿no? Parlantes.",
        "start": 866.16,
        "end": 873.88
    },
    {
        "text": " ¿Qué era verdad ese? De qué? ¿De qué era donde se ve más encerre? Los chinos y los japoneses.",
        "start": 873.88,
        "end": 880.4
    },
    {
        "text": " Bueno, no sé, no importa, claro también por si hay uno de origen China, capaz que me dice,",
        "start": 881.88,
        "end": 885.8399999999999
    },
    {
        "text": " mira Mateo, ellos tengo origen China y es un poco feo, lo que decís que los chinos de baja calidad.",
        "start": 885.84,
        "end": 890.12
    },
    {
        "text": " Mira, esta persona, dice esa persona, ¿no? Y soy China, ¿no? Bueno, ¿qué importamos?",
        "start": 891.52,
        "end": 899.48
    },
    {
        "text": " ¿Y importamos de todo, verdad? Y entre los de bienes ya que estamos, ya que estamos hablando,",
        "start": 899.48,
        "end": 904.76
    },
    {
        "text": " ¿cuáles son los principales productos bienes, mercancidas que exportamos?",
        "start": 904.76,
        "end": 909.5600000000001
    },
    {
        "text": " Comida. Un poquito más de color a esto de la comida.",
        "start": 910.56,
        "end": 916.9599999999999
    },
    {
        "text": " Sopa.",
        "start": 916.9599999999999,
        "end": 919.4
    },
    {
        "text": " Ah, no, pues comida, sopa, dije, bueno, ahora exportamos sopa. No, capaz que sí, ahí está,",
        "start": 919.4,
        "end": 926.5999999999999
    },
    {
        "text": " soja, ¿verdad? Por ejemplo, es un ruro que en los últimos 15 años ha explotado, ¿no?",
        "start": 926.5999999999999,
        "end": 931.52
    },
    {
        "text": " En términos de, si miramos el puerto, en los portos granelero, más bien, tanto el de",
        "start": 931.52,
        "end": 935.92
    },
    {
        "text": " Montevideo, vamos a ver que salen granos como enfermos, ¿no? ¿Qué otra cosa exportamos?",
        "start": 935.92,
        "end": 940.5999999999999
    },
    {
        "text": " Ganado en pie, o sea, cada tanto parece en alguna exportación de ganado en pie,",
        "start": 944.0799999999999,
        "end": 948.7199999999999
    },
    {
        "text": " ¿verdad? Acá en el puerto Montevideo vemos algún barco cargando, o terneros o bejas,",
        "start": 948.7199999999999,
        "end": 955.24
    },
    {
        "text": " ¿no? Que se el viento pega para donde estás vos, ahí como una lora, ¿no? A pipí medio fuerte,",
        "start": 955.24,
        "end": 960.64
    },
    {
        "text": " ¿no? Nos vamos cuenta seguida que hay un barco cargando los que trabajamos cerca de",
        "start": 960.64,
        "end": 965.64
    },
    {
        "text": " la ciudad vieja. ¿Qué otra cosa? Carne, también, carne, lácteos, ¿no? Bueno, estaría bueno,",
        "start": 965.64,
        "end": 975.56
    },
    {
        "text": " ¿no? Que nos foguíamos con los principales productos que exportamos y hay uno que nos",
        "start": 975.56,
        "end": 980.16
    },
    {
        "text": " estamos olvidando, que es uno de los de las joyas productivas de Uruguay, el último",
        "start": 980.16,
        "end": 985.6
    },
    {
        "text": " tiempo, ¿no? No, no, madera, chips de madera para producción de zebelosa, ¿no? chips de madera",
        "start": 985.6,
        "end": 999.9200000000001
    },
    {
        "text": " para producción de zebelosa o madera directamente, ¿qué ver con qué régimen se produce? Y los principales",
        "start": 999.9200000000001,
        "end": 1005.5600000000001
    },
    {
        "text": " destinos de exportación, ¿cuáles son? Brasil, están en el top 3, top 5, ¿eh? China,",
        "start": 1005.56,
        "end": 1017.0
    },
    {
        "text": " China también aparece ahí en el top 5 de los principales productos de exportación, principales",
        "start": 1017.0,
        "end": 1021.56
    },
    {
        "text": " destinos, Estados Unidos, zona franca no va a palmira, ¿no? Ha estado en el top, en el principal",
        "start": 1021.56,
        "end": 1035.12
    },
    {
        "text": " destino de exportación de nuestros productos, ¿no? ¿no? A palmira, ¿no? Terminal de una palmira, ¿no? ¿qué",
        "start": 1035.12,
        "end": 1045.8
    },
    {
        "text": " pasó? ¿Qué le dije a un chiste, algo, dije algo malo? ¿Qué exportamos a una palmira?",
        "start": 1045.8,
        "end": 1050.6799999999998
    },
    {
        "text": " ¿No sabías? Pues, ¿no? Sí, una palmira es uno de los principales destino exportación,",
        "start": 1050.6799999999998,
        "end": 1056.1599999999999
    },
    {
        "text": " ¿no? Tengamos presente que una palmira es una zona tributaria, no Uruguay, ¿no? Es decir,",
        "start": 1056.1599999999999,
        "end": 1060.12
    },
    {
        "text": " ya cuando una ingresa de la área de zona franca, ¿no? A palmira está entre comillas, ¿no? Porque lo",
        "start": 1060.12,
        "end": 1065.52
    },
    {
        "text": " digo tributariamente, saliendo del país, por lo tanto el camión que traspasa la frontera de zona",
        "start": 1065.52,
        "end": 1069.9199999999998
    },
    {
        "text": " franca, está saliendo del país y hay un puesto de frontera que va a registrar esa mercancía que",
        "start": 1069.9199999999998,
        "end": 1074.84
    },
    {
        "text": " se está exportando, ¿verdad? Sí, ¿súena raro, ¿no? ¿no? ¿súena raro? Es decir, como que es",
        "start": 1074.84,
        "end": 1081.1599999999999
    },
    {
        "text": " no a palmira, ¿no? No el pueblo no va a palmira, ¿no? La ciudad, sino que la área de zona franca,",
        "start": 1081.1599999999999,
        "end": 1086.6
    },
    {
        "text": " ¿verdad? Claro que sí, claro que sí. Bien, bueno, ¿ta? jugamos un poco con los destinos y los",
        "start": 1086.6,
        "end": 1093.0
    },
    {
        "text": " productos, ¿verdad? ¿dónde puedo sacar esta información? El destino de la exportación y la",
        "start": 1093.0,
        "end": 1098.56
    },
    {
        "text": " balanza de pago no, no lo voy a encontrar el destino. En la base de pago lo que voy a encontrar",
        "start": 1098.56,
        "end": 1102.84
    },
    {
        "text": " de última es en mercancías, en cuanto variaron, crecieron o cayeron las exportaciones o las",
        "start": 1102.84,
        "end": 1109.8
    },
    {
        "text": " importaciones, pero no los destinos. Bien, ¿cuáles son los ruros? ¿Cuáles son los ruros? Ahora que",
        "start": 1109.8,
        "end": 1117.6
    },
    {
        "text": " registran transacciones que hacen al movimiento de servicios ya no debienes, debienes tenemos",
        "start": 1117.6,
        "end": 1125.8799999999999
    },
    {
        "text": " mercancías, bien, acá tenemos transportes, seguros, ¿no? Todo lo que tiene que ver con el comarse",
        "start": 1125.8799999999999,
        "end": 1136.28
    },
    {
        "text": " internacional de mercancías, servicios que están directamente vinculados al comercio exterior",
        "start": 1136.28,
        "end": 1144.36
    },
    {
        "text": " de bienes, cuando una vaca sale no se van a dando, ¿verdad? Se van a un barco. Hay que ver quién está",
        "start": 1144.36,
        "end": 1154.8799999999999
    },
    {
        "text": " prestando ese servicio de la naviera, ¿qué naviera está prestando ese servicio de transporte de",
        "start": 1154.8799999999999,
        "end": 1158.8
    },
    {
        "text": " flea internacional? Porque si es una naviera uruguaya o está a las residentes, una empresa uruguaya,",
        "start": 1158.8,
        "end": 1164.28
    },
    {
        "text": " por ejemplo, un camión cuando saca marcaría para Brasil del Actio, si sale de con a proel",
        "start": 1164.28,
        "end": 1170.44
    },
    {
        "text": " invento o policía por nadie, pero bueno, si sale de la empresa de la acta, un camión de la empresa",
        "start": 1170.44,
        "end": 1176.24
    },
    {
        "text": " Carlos Patron que va hacia Porto Alegre, bueno, Carlos Patron es una empresa uruguaya ¿verdad?",
        "start": 1176.24,
        "end": 1181.52
    },
    {
        "text": " Entonces, la empresa en Porto Alegre está pagando el Actio, pero está pagando la factura del transporte",
        "start": 1181.52,
        "end": 1188.8
    },
    {
        "text": " también. Entonces, en el caso de ser una empresa uruguaya que presta ese servicio de transporte",
        "start": 1188.8,
        "end": 1193.96
    },
    {
        "text": " internacional, en ese caso se está configurando una exportación de servicios de transporte internacional,",
        "start": 1193.96,
        "end": 1200.2
    },
    {
        "text": " o no de logística, carga, descarga, transporte, o no, es una transacción que se da entre una empresa",
        "start": 1200.2,
        "end": 1208.04
    },
    {
        "text": " residente, Carlos Patron invento, que es una empresa de transporte internacional uruguaya, y un",
        "start": 1208.04,
        "end": 1213.6399999999999
    },
    {
        "text": " residente que es yo, no sé, alguien en Porto Alegre que es yo, el mayorista que compra los",
        "start": 1213.64,
        "end": 1221.16
    },
    {
        "text": " lácteos para distribuirlo en toda la ciudad, sea lo que sea. Pero entonces se configuran, en ese caso,",
        "start": 1221.16,
        "end": 1227.88
    },
    {
        "text": " la comercialización de un transporte, una exportación de servicios,",
        "start": 1227.88,
        "end": 1232.5600000000002
    },
    {
        "text": " sí, sí. Otra cosa, seguros, esa vaca que va en el barco va asegurada, sí, seguro porque se",
        "start": 1232.56,
        "end": 1242.6
    },
    {
        "text": " puede morir en el viaje, el barco se puede hundir, verdad, o el cargamento, el container se puede",
        "start": 1242.6,
        "end": 1246.72
    },
    {
        "text": " caer del barco, golpear, o no, es más común de lo que uno cree, o el camión tiene una accidente y",
        "start": 1246.72,
        "end": 1252.12
    },
    {
        "text": " perder toda la carga mitad de camino, o no, hay seguros involucrados en el comercio internacional,",
        "start": 1252.12,
        "end": 1256.72
    },
    {
        "text": " en el caso de que sean prestados por una empresa residente, no, con un no-residente estar",
        "start": 1256.72,
        "end": 1261.6399999999999
    },
    {
        "text": " involucrados a agentes, no del mismo país, ¿verdad? En ese caso, estará configurando una",
        "start": 1261.64,
        "end": 1268.96
    },
    {
        "text": " comercialización también de servicios ahora de seguros. ¿Qué puede ser tanto exportación como",
        "start": 1268.96,
        "end": 1274.48
    },
    {
        "text": " importación de servicios? La importación de servicios, por ejemplo, se han capado como",
        "start": 1274.48,
        "end": 1281.3200000000002
    },
    {
        "text": " importadora del crudo, no solamente le paga al gobierno, venezolano, le paga, creo que ya no",
        "start": 1281.3200000000002,
        "end": 1290.24
    },
    {
        "text": " compramos más a Venezuela, le paga por el crudo, por la carga, sino hay que contratar una empresa",
        "start": 1290.24,
        "end": 1295.8
    },
    {
        "text": " de transporte, un barco tan que o no, que vaya a la boya petrolera, hay que contratar servicios",
        "start": 1295.8,
        "end": 1301.42
    },
    {
        "text": " para que baje en el crudo, que hay que ver si es una empresa no-residente, bueno, en capa",
        "start": 1301.42,
        "end": 1308.68
    },
    {
        "text": " está contratando, uno residente estamos importando un servicio de logística, que es yo como se",
        "start": 1308.68,
        "end": 1313.64
    },
    {
        "text": " llama eso de desembarco de crudo y el seguro también, hay que ver quién está involucrado, ¿verdad?",
        "start": 1313.64,
        "end": 1321.0800000000002
    },
    {
        "text": " No sé si va quedando claro el tema este de la comercialización de servicios, ahora relacionados",
        "start": 1321.0800000000002,
        "end": 1326.72
    },
    {
        "text": " al comercio de bien, va quedando un poco claro, cuando se configura una exportación de servicios y",
        "start": 1326.72,
        "end": 1331.96
    },
    {
        "text": " cuando se configura una importación de servicios, por eso que últimamente, y esto como que es casi,",
        "start": 1331.96,
        "end": 1338.92
    },
    {
        "text": " yo ves ese sábado así, parezco viejo, no, cosa que no lo soy pero bueno, a veces sí, porque claro,",
        "start": 1338.92,
        "end": 1346.3600000000001
    },
    {
        "text": " ya hace tiempo, se apuesta a Uruguay como un polo de ofrecimiento, de servicios de",
        "start": 1348.5600000000002,
        "end": 1357.48
    },
    {
        "text": " cómo es que se llama ahora, de logística, suena lindo, en qué área trabajas, logística internacional,",
        "start": 1357.48,
        "end": 1366.68
    },
    {
        "text": " claro, no hay otra época, trabajo en calos patron, ¿qué es yo? No soy camionero, ahora el",
        "start": 1366.68,
        "end": 1372.6000000000001
    },
    {
        "text": " camino puede decir, trabajo en logística, en depósito, transporte o no, está bien dicho, en la",
        "start": 1372.6000000000001,
        "end": 1380.0800000000002
    },
    {
        "text": " área, la logística es como todo, ¿no? Es más ¿eh? Lo que es la movilidad, movilidad, pero también",
        "start": 1380.0800000000002,
        "end": 1387.3200000000002
    },
    {
        "text": " depósito, carga, descarga, transporte o no, ayúdenme a ustedes que son, logística es como más que",
        "start": 1387.3200000000002,
        "end": 1394.3200000000002
    },
    {
        "text": " transporte, es también el depósito, es también la descarga, la estiva, el puerto, no, muchas cosas,",
        "start": 1394.8,
        "end": 1402.76
    },
    {
        "text": " hay que gustar la parada logística, ¿qué trabajas logística?",
        "start": 1408.24,
        "end": 1414.1599999999999
    },
    {
        "text": " es como recheta, bueno, me siento bien, bueno, bueno, no me quiero redir mucho por el",
        "start": 1414.16,
        "end": 1423.3600000000001
    },
    {
        "text": " astímulo de boca, pero bueno, ¿pa quedando claro, Urises? Bien, hay algún otro por ahí, otro",
        "start": 1423.3600000000001,
        "end": 1429.3200000000002
    },
    {
        "text": " servir, otros transportes, ¿verdad? En la cuenta corriente también, pero estoy presentándolo",
        "start": 1429.3200000000002,
        "end": 1434.48
    },
    {
        "text": " los principales rublos, los principales, hay muchos, los principales, los más como importantes,",
        "start": 1434.48,
        "end": 1442.24
    },
    {
        "text": " aparece uno ahí, que también hace el movimiento de servicios, que se llama viajes,",
        "start": 1443.2,
        "end": 1454.36
    },
    {
        "text": " alguien podrá decir, ¿qué significa viajes? ¿qué significa viajes? ¿qué tipo de transacción",
        "start": 1454.36,
        "end": 1470.88
    },
    {
        "text": " vinculada la conversación de servicios? ¿qué tipo de transacción involucra? ¿qué por ejemplo,",
        "start": 1472.4,
        "end": 1478.36
    },
    {
        "text": " qué estamos hablando acá? Viajes, que son los viajes de la maracanciano, esos son los transportes",
        "start": 1478.36,
        "end": 1484.72
    },
    {
        "text": " internacionales, verdad, de carga, ¿qué tipo de servicios? Turísticos, servicios turísticos,",
        "start": 1484.72,
        "end": 1496.6
    },
    {
        "text": " cuando un argentino viene a Uruguay por motivos de placer con su familia, cruza la frontera,",
        "start": 1496.6,
        "end": 1505.3999999999999
    },
    {
        "text": " verdad, el puente general San Martín viene con la familia y se va a pidiar, polis a pasar una",
        "start": 1505.3999999999999,
        "end": 1513.9599999999998
    },
    {
        "text": " semana, verdad, los nene van a la playa, se comen un par de chocolates, ese gasto que",
        "start": 1513.9599999999998,
        "end": 1523.0
    },
    {
        "text": " realizan, comprando esos dos chocolates en la playa, corresponderán a una exportación de",
        "start": 1523.0,
        "end": 1530.0
    },
    {
        "text": " servicios turísticos, se está configurando una transacción entre Uruguay y el mundo, se está",
        "start": 1530.0,
        "end": 1535.0
    },
    {
        "text": " configurando una transacción entre una gente residente y uno residente, en la cual el residente",
        "start": 1535.0,
        "end": 1540.96
    },
    {
        "text": " le está prestando un servicio, a uno residente por placer, verdad, un servicio turístico, esta",
        "start": 1540.96,
        "end": 1549.76
    },
    {
        "text": " exportación de servicios no solo incluye los servicios relacionados al comarcio internacional,",
        "start": 1549.76,
        "end": 1558.0
    },
    {
        "text": " sino también los servicios turísticos, yo no pregunte acá cuáles son los principales rubros",
        "start": 1558.0,
        "end": 1565.24
    },
    {
        "text": " de exportación de servicios, hablé de él empuje que se le viene dando, verdad, el crecimiento",
        "start": 1565.24,
        "end": 1572.0
    },
    {
        "text": " que Uruguay viene teniendo en términos de servicio logístico, transporte, seguros, verdad,",
        "start": 1572.0,
        "end": 1576.08
    },
    {
        "text": " ciertamente, pero no perdamos de vista para un país como nuestro además, que quiere",
        "start": 1576.08,
        "end": 1584.6
    },
    {
        "text": " continuar potenciando el tema del turismo, como potencial ingreso de divisas, bien, estos",
        "start": 1584.6,
        "end": 1590.52
    },
    {
        "text": " servicios aquí en exportados, tanto como exportados como cuando nosotros nos vamos al mundo a",
        "start": 1590.52,
        "end": 1596.72
    },
    {
        "text": " pasear y gastamos en el mundo la balanza de pago se está registrando en ese caso una importación",
        "start": 1596.72,
        "end": 1603.96
    },
    {
        "text": " de servicios turísticos, en cambio la balanza de pago, cuando el NN se convio el pancho en la",
        "start": 1603.96,
        "end": 1609.4
    },
    {
        "text": " pasiva, está registrando una exportación de servicios turísticos, un pancho, ¿no? Le cae el dato",
        "start": 1609.4,
        "end": 1618.52
    },
    {
        "text": " al presidente del Banco Central, le dicen, che, mira que en la pasiva acaban de comer un pancho y",
        "start": 1618.52,
        "end": 1624.64
    },
    {
        "text": " hablaban como medio gringo, entonces él manda un mail, verdad, un tweet al personal de la balanza de",
        "start": 1624.64,
        "end": 1631.32
    },
    {
        "text": " pago y le dice, va pancho, tic, anotan, pancho, muy bien, muy bien, muy bien, está claro",
        "start": 1631.32,
        "end": 1641.9199999999998
    },
    {
        "text": " lo que estamos presentando, brises, es un ruro raro que a veces lo perdemos de vista y yo al",
        "start": 1641.9199999999998,
        "end": 1646.76
    },
    {
        "text": " principio de la presentación les decía, hay algunas transacciones que son las primeras que se nos",
        "start": 1646.76,
        "end": 1652.36
    },
    {
        "text": " viene en la cabeza, que el YLE vende productos al mundo, verdad, el comercio exterior, las importaciones",
        "start": 1652.36,
        "end": 1659.28
    },
    {
        "text": " de crudo, ese tipo de comercio, no, quizá nos costaba un poco más reconocer el tema de servicios,",
        "start": 1659.28,
        "end": 1664.76
    },
    {
        "text": " pero Huawei también comercializa servicios, también exportamos y importamos servicios y no solamente",
        "start": 1664.76,
        "end": 1671.12
    },
    {
        "text": " aquellos que están vinculados al comercio, sino de los servicios turísticos, sí, aparecen por ahí",
        "start": 1671.12,
        "end": 1680.24
    },
    {
        "text": " y podemos ver de las exportaciones totales de las exportaciones totales ahora en una suma",
        "start": 1681.24,
        "end": 1689.68
    },
    {
        "text": " vertical, ¿verdad? AExport de bienes, más de expor de servicios, tenemos las exportatales,",
        "start": 1689.68,
        "end": 1693.64
    },
    {
        "text": " ¿cuánto qué parte corresponde a bienes, qué parte corresponde a servicios? Claro que sí,",
        "start": 1693.64,
        "end": 1698.28
    },
    {
        "text": " lo vamos a encontrar en la balanza de pago, tanto así como import, ¿no?",
        "start": 1698.28,
        "end": 1703.48
    },
    {
        "text": " Tenemos datos trimestrales, podemos conocer la evolución, ¿verdad? ¿Y esto? Para que sirve,",
        "start": 1703.48,
        "end": 1714.4
    },
    {
        "text": " bueno, para conocer la realidad ¿verdad? ¿Cómo estamos últimamente en los respectos",
        "start": 1714.4,
        "end": 1720.72
    },
    {
        "text": " últimos años en términos del comercio de bienes y servicios? ¿A qué nos surgió la duda del",
        "start": 1720.72,
        "end": 1725.52
    },
    {
        "text": " polutanto? La voy a decir yo, ¿cómo sabe el Banco Central? ¿Cuántos panchos se comió el",
        "start": 1725.52,
        "end": 1732.72
    },
    {
        "text": " nén en la playa? Me iba a preguntar. Sí, preguntaba, preguntaba, preguntaba, preguntaba",
        "start": 1732.72,
        "end": 1741.24
    },
    {
        "text": " tranquilo, ¿por qué es? Es una pregunta bastante esperable, ¿verdad? Yo me he probado",
        "start": 1741.24,
        "end": 1746.24
    },
    {
        "text": " con el tema de los panchos, de los choclos, ¿cómo sabe cuántos choclos? Vagar, alemando",
        "start": 1746.24,
        "end": 1752.44
    },
    {
        "text": " a un tweet, diciendo pancho, va a ver, computar un pancho, ¿cómo sabe dónde sale esta información?",
        "start": 1752.44,
        "end": 1758.0
    },
    {
        "text": " El Banco Central para compilar la balance de pados recoge información de miles de lados,",
        "start": 1758.0,
        "end": 1762.64
    },
    {
        "text": " de un lote de lados. La información relativa al comercio de mercancías, ¿de dónde lo",
        "start": 1762.64,
        "end": 1771.64
    },
    {
        "text": " saca el Banco Central? ¿A quién se lo pide? A la dirección de la aduana ¿verdad? A la dirección",
        "start": 1771.64,
        "end": 1778.32
    },
    {
        "text": " de la aduana. La dirección de la aduana es como organismo público ¿verdad? Tiene como competencias,",
        "start": 1778.32,
        "end": 1783.64
    },
    {
        "text": " el misterio economía, ahora tiene como competencia el registro de todo el comercio salida y",
        "start": 1783.64,
        "end": 1789.64
    },
    {
        "text": " entra a exportación de importación de bienes. En todo el expuesto de frontera tenemos una",
        "start": 1789.64,
        "end": 1794.0
    },
    {
        "text": " oficina aduana, un departamento aduana a la oficina, en la cual reportaremos si estamos",
        "start": 1794.0,
        "end": 1799.0
    },
    {
        "text": " vendiendo, nos sacando el marcaría del mundo o estamos ingresando el marcaría del marco.",
        "start": 1799.0,
        "end": 1802.92
    },
    {
        "text": " Clarito. Los servicios relacionados al comercio exterior ¿verdad? No sé, ¿de",
        "start": 1802.92,
        "end": 1810.5400000000002
    },
    {
        "text": " que se hayan comprociéndole? Pues las propias carpetas de comercio aparecen, ¿no?",
        "start": 1810.54,
        "end": 1814.5
    },
    {
        "text": " Las guías aparecen también las información relativa al transporte, ¿quién lo está",
        "start": 1814.5,
        "end": 1818.04
    },
    {
        "text": " prestando? ¿Qué empresa lo está prestando? La compañía de Seúre en Buluquerá eso",
        "start": 1818.04,
        "end": 1821.74
    },
    {
        "text": " está, esa información también está en las mismas carpetas de comercio de bienes. Pero",
        "start": 1821.74,
        "end": 1828.1
    },
    {
        "text": " la más complicada es de imaginarse el tema de viaje, los servicios turísticos. ¿Cuánto",
        "start": 1828.1,
        "end": 1834.22
    },
    {
        "text": " gasto fue el último trimestre, el gasto por conceptos de viajes, ¿verdad? De exportación",
        "start": 1834.22,
        "end": 1843.9
    },
    {
        "text": " de servicios turísticos ¿cómo saber ese dato? ¿Cuánto gastaron los turistas en Uruguay?",
        "start": 1843.9,
        "end": 1848.1000000000001
    },
    {
        "text": " Sí. ¿Se puede calcular por la venta de divisas? ¿Qué son divisas? ¿Monedas? No, no",
        "start": 1848.1000000000001,
        "end": 1859.02
    },
    {
        "text": " es una divisa, la moneda nacional. Las divisas son aquellas monedas que tienen poder de cancelación",
        "start": 1859.02,
        "end": 1863.7
    },
    {
        "text": " internacional. El peso de Uruguay no lo es. ¿Tamos acuerdo? Bien, reformulemos entonces",
        "start": 1863.7,
        "end": 1870.3400000000001
    },
    {
        "text": " el comentario. ¿Cómo sería a partir de la venta de pesos en los cambios? Fuerze, por",
        "start": 1870.3400000000001,
        "end": 1877.6200000000001
    },
    {
        "text": " favor, por favor. Bien, bien. Le pregunto todos los trimestres, le pregunto a los cambios, ¿no?",
        "start": 1877.6200000000001,
        "end": 1887.02
    },
    {
        "text": " A ver, a ver si te estoy entendiendo. Todos los meses le preguntaría a los cambios, ¿cuántos",
        "start": 1887.02,
        "end": 1893.22
    },
    {
        "text": " pesos Uruguayos vendieron? ¿Cuántos dólares compraron? ¿Por qué se parte de la base",
        "start": 1893.22,
        "end": 1901.3
    },
    {
        "text": " que todos los dólares que haya comprado un cambio corresponde a gastos de turistas",
        "start": 1901.3,
        "end": 1905.82
    },
    {
        "text": " que querían pesos para comer panchos? ¿Ella dice que es probable que romper a Chanchita",
        "start": 1905.82,
        "end": 1917.22
    },
    {
        "text": " y dijo, tengo los 100 billetes y $100, lo voy a vender para hacerme de peso para comprarme",
        "start": 1917.22,
        "end": 1921.6200000000001
    },
    {
        "text": " un par zapato y ella no está, no es turista. Entonces ese dato podría estar sesgado, contaminado",
        "start": 1921.62,
        "end": 1929.86
    },
    {
        "text": " de otros motivos por los cuales la gente cambia dinero, es más, no todo el turista trae",
        "start": 1929.86,
        "end": 1937.4199999999998
    },
    {
        "text": " dólares y lo cambian un cambio. ¿No? El pago con tarjeta. ¿No? En la duana, por ejemplo,",
        "start": 1937.4199999999998,
        "end": 1951.26
    },
    {
        "text": " en la duana, en el puesto de frontera, cuando sale, el aduanero le pregunta la familia,",
        "start": 1951.26,
        "end": 1956.7
    },
    {
        "text": " ¿Quién manda acá? Y el padre dice, bueno, yo, yo soy el padre, la madre, la madre",
        "start": 1956.7,
        "end": 1961.78
    },
    {
        "text": " dice, mando yo, soy el adulto. Y señora, ¿cuánto vas todo? ¿Cuánto, el aduanero",
        "start": 1961.78,
        "end": 1968.58
    },
    {
        "text": " le pregunta, no? ¿Cómo sería? ¿Cuántos panchos? Lo mira a los niños y le dice, ¿cuántos",
        "start": 1968.58,
        "end": 1975.86
    },
    {
        "text": " panchos te comisten? ¿Cuántos chuclos? ¿Cuántas maquilitas? Y el NM mira a Balpiso,",
        "start": 1975.86,
        "end": 1984.34
    },
    {
        "text": " yo. ¿Qué dije? Que era, que ocía el super y compré cosas, ¿cómo saber esto? ¿Cómo",
        "start": 1984.34,
        "end": 1993.08
    },
    {
        "text": " hará el banco central? A través las tarjetas, a ver. Tampoco, ¿no? Porque muchas",
        "start": 1993.08,
        "end": 2003.02
    },
    {
        "text": " compras son efectivos, estamos en la misma, ¿verdad? Le podríamos preguntar a MasterCard,",
        "start": 2003.02,
        "end": 2007.82
    },
    {
        "text": " a Visa. ¿Cuántas? ¿Qué sería parte de una suma? ¿Qué sería parte de una suma?",
        "start": 2007.82,
        "end": 2015.42
    },
    {
        "text": " ¿Pero suma? ¿Pero es de factores? Una parte que me voy a comprar en otra fiesta de eso",
        "start": 2015.42,
        "end": 2019.94
    },
    {
        "text": " de él. ¿Y la otra parte? ¿Y la otra parte de la gestoria? No sé, eso ocurre, ¿cómo",
        "start": 2019.94,
        "end": 2027.9
    },
    {
        "text": " podríamos hacer para salvar este problema, para conocer todos los trimestres? ¿Cuánto",
        "start": 2027.9,
        "end": 2032.26
    },
    {
        "text": " corresponde el gasto de los turistas en el fue? Es probable que nunca los sepamos con",
        "start": 2032.26,
        "end": 2038.86
    },
    {
        "text": " certeza. Es más, no lo vamos a saber nunca con certeza. ¿Cuánto fue? Exactamente el gasto",
        "start": 2038.86,
        "end": 2046.54
    },
    {
        "text": " por concepto de turismo, ¿no? De los turistas en Uruguay en un trimestre. No lo vamos a",
        "start": 2046.54,
        "end": 2051.18
    },
    {
        "text": " saber nunca, pero sí, nos podemos aproximar a ese dato a través de una estimación.",
        "start": 2051.18,
        "end": 2057.62
    },
    {
        "text": " ¿Ves más o menos cuánto gasta cada turista? ¿Sabes cuántos ingresaron? ¿Por qué",
        "start": 2057.62,
        "end": 2068.46
    },
    {
        "text": " ese dato sí lo tenemos de qué oficina? Dirección nacional de migración cuando salgan del",
        "start": 2068.46,
        "end": 2075.74
    },
    {
        "text": " país no vayan a Duana para hacer el trámite de la salida persona vayan a la dirección",
        "start": 2075.74,
        "end": 2079.3399999999997
    },
    {
        "text": " de migración, Ministerio del Interior, ya no es economía. Son dos cosas distintas, ¿no?",
        "start": 2079.3399999999997,
        "end": 2084.74
    },
    {
        "text": " Duana, aduana, tiene la competencia de las mercancías, pero las personas somos, ¿no?",
        "start": 2084.74,
        "end": 2090.8599999999997
    },
    {
        "text": " La dirección nacional de migración, migración sí sabe cuánto ingresaron y cuánto salimos. ¿Morra?",
        "start": 2090.8599999999997,
        "end": 2097.9799999999996
    },
    {
        "text": " Y punto, no sabe más nada. ¿Cómo sabe en el mundo de las personas? ¿Pero cómo conocer",
        "start": 2097.9799999999996,
        "end": 2102.7
    },
    {
        "text": " el perfil de gasto? A través de que sabíamos cuántas personas exactamente hay en el mes",
        "start": 2102.7,
        "end": 2111.4199999999996
    },
    {
        "text": " de julio de socularse en Uruguay, no? La hacemos a través de que de una encuesta aleatoriamente",
        "start": 2111.42,
        "end": 2119.02
    },
    {
        "text": " tomemos casos aleatoriamente, no de forma asesgada, solamente paro autos en la frontera, ¿no?",
        "start": 2119.02,
        "end": 2127.7000000000003
    },
    {
        "text": " En paro de inepuente freventos por tu sué, solamente autos que degan matrículas argentinas,",
        "start": 2127.7000000000003,
        "end": 2132.9
    },
    {
        "text": " no, no. A aleatoriamente, si sé que no son residentes, le hago una encuesta. Le doy un papel",
        "start": 2132.9,
        "end": 2139.14
    },
    {
        "text": " que se yo, y soy el Ministerio de Turismo que está haciendo esa encuesta, ¿eh? Yo soy",
        "start": 2139.14,
        "end": 2143.2999999999997
    },
    {
        "text": " funcionario del Ministerio de Turismo. Le digo que tal si señora sí, perfecto, se anima",
        "start": 2143.2999999999997,
        "end": 2148.3399999999997
    },
    {
        "text": " a contar una encuesta así, perfecto, ¿no? A ver, origen, ¿de qué país son? Argentina,",
        "start": 2148.3399999999997,
        "end": 2153.62
    },
    {
        "text": " Tik, pone, ¿no? Tik, motivo del viaje, placer trabajo, congreso, no, no, ocio, destino,",
        "start": 2153.62,
        "end": 2162.8599999999997
    },
    {
        "text": " cuántos integrantes, cuatro, ¿eh? Tik, cuatro, destino de su viaje, correo ociánico,",
        "start": 2162.86,
        "end": 2169.1800000000003
    },
    {
        "text": " correo ortermal, correo orjo, así, ¿no? Tanto, tanto, tanto, correo ociánico, punta",
        "start": 2169.1800000000003,
        "end": 2173.86
    },
    {
        "text": " del este, ¿eh? Bueno, y ahí se les va preguntando muchas cosas, ¿verdad? Y aparece una",
        "start": 2173.86,
        "end": 2180.2200000000003
    },
    {
        "text": " de la pregunta clave, ¿eh? Hay algo así como, ¿cuánto estima, ¿cuánto tiempo? ¿cuánto",
        "start": 2180.2200000000003,
        "end": 2185.5
    },
    {
        "text": " tiempo estima permanecer en su viaje? Y más o menos una familia cuando se va de viaje,",
        "start": 2185.5,
        "end": 2191.34
    },
    {
        "text": " o menos sabe, ¿verdad? va a estar en una semana o no. Hasta muchas veces tiene contratado",
        "start": 2191.34,
        "end": 2195.1400000000003
    },
    {
        "text": " ya una equilero o un hotel, va por un fin de semana o no. Sí, más o menos. Son muy",
        "start": 2195.1400000000003,
        "end": 2200.98
    },
    {
        "text": " poco lo que dicen, ¿vo y no sé cuando vuelvo? Bueno, es raro, un viaje así, te vayas a Buenos",
        "start": 2200.98,
        "end": 2206.6400000000003
    },
    {
        "text": " Aires a ver un recital y te pregunta, ¿no? ¿Un pariente tuya una amiga, a che cuando vuelves?",
        "start": 2206.6400000000003,
        "end": 2212.1800000000003
    },
    {
        "text": " No sé, ¿no? Voy por el fin de semana, me explico, ¿go sabes? Y también sabes cuánto",
        "start": 2212.1800000000003,
        "end": 2218.06
    },
    {
        "text": " estima gastar por día. Estima gastar. Nunca vas a haceras saber exactamente, bueno,",
        "start": 2218.06,
        "end": 2226.18
    },
    {
        "text": " lo sabemos, pero sí sabes cuánta plata lleva a vos. Sí, mira, llegó 100 dólares, más o",
        "start": 2226.18,
        "end": 2230.94
    },
    {
        "text": " menos, no, no sé, invento. Estima gastar 50 por día, en dos días. ¿O usted el tanto?",
        "start": 2230.94,
        "end": 2235.86
    },
    {
        "text": " más o menos, ¿sabes? A alguien decía, cuando alguien viene, va a un cambio, ¿sabe más o",
        "start": 2235.86,
        "end": 2240.38
    },
    {
        "text": " menos cuánto gasta? ¿Cuánto va a gastar? ¿Cuánto estima gastar por día? Entonces",
        "start": 2240.38,
        "end": 2245.38
    },
    {
        "text": " que tenemos gasto estimado diario, tiempo de permanencia, origen, destino, ¿verdad?",
        "start": 2245.38,
        "end": 2250.62
    },
    {
        "text": " Y son esas estadísticas que el Ministerio de Turismo cada tanto nos informan, ¿verdad?",
        "start": 2250.62,
        "end": 2257.62
    },
    {
        "text": " De qué nos dicen. Ingresaron al país 2,344,573 turistas, bueno, es un dato estimado. El",
        "start": 2257.62,
        "end": 2267.26
    },
    {
        "text": " gasto correspondió a 3 millones, no sé, me explico, los que más gastan son los turistas",
        "start": 2267.26,
        "end": 2274.26
    },
    {
        "text": " mexicanos. El tiempo promedio de permanencia en Uruguay es de 5 días con 68, de dónde salen",
        "start": 2274.26,
        "end": 2281.38
    },
    {
        "text": " esos datos, de estimaciones como no sé si fuiste tú. A alguien que hablaba de datos estimados,",
        "start": 2281.38,
        "end": 2287.38
    },
    {
        "text": " aproximarnos al dato, bueno, alguien había dicho, aproximarnos al dato, no lo vamos a saber",
        "start": 2287.38,
        "end": 2291.98
    },
    {
        "text": " nunca, pero sí a través de un dato estimado. Y el banco se entra ese nutreza de información",
        "start": 2291.98,
        "end": 2296.38
    },
    {
        "text": " del Ministerio de Turismo y es la que incorpora en sus cuentas en particular de viajes.",
        "start": 2296.38,
        "end": 2301.94
    },
    {
        "text": " No lo íbamos a saber nunca, ni el más ingeniero de los ochos, pasará 8 días, noche, sin",
        "start": 2302.94,
        "end": 2311.94
    },
    {
        "text": " dormir, tratando de darse cuenta cómo puede medir exactamente el gasto de los turistas en Uruguay,",
        "start": 2311.94,
        "end": 2316.66
    },
    {
        "text": " no lo van a encontrar. Exacto nunca, lo que sí podemos corregir y mejorar son las estimaciones,",
        "start": 2316.66,
        "end": 2323.58
    },
    {
        "text": " para acercarnos más al verdadero dato que nunca lo vamos a conocer, pero que la estimación sea",
        "start": 2323.58,
        "end": 2330.18
    },
    {
        "text": " más como decir que tenga un error, no, minimicemos el error exactamente. Y ahí sí, los estadísticos",
        "start": 2330.18,
        "end": 2338.3399999999997
    },
    {
        "text": " verán si las técnicas de colecta de información que sean de formalatoria no encuestemos solamente",
        "start": 2338.3399999999997,
        "end": 2347.7
    },
    {
        "text": " en el aeropuerto, me explico, porque el perfil que viene para el aeropuerto es un perfil particular,",
        "start": 2347.7,
        "end": 2352.62
    },
    {
        "text": " no es lo mismo que el que viene en auto, ¿verdad? O viene en barco, o viene en tren, o viene, no en tren,",
        "start": 2352.62,
        "end": 2358.8999999999996
    },
    {
        "text": " no hay, no, tren como que no habría todavía, o caminando o en bicicleta o a través del puente",
        "start": 2358.9,
        "end": 2365.6600000000003
    },
    {
        "text": " mahuá, que se llunche turista capaz que cruza en bicicleta o no, hay turistas de bicicleta o no,",
        "start": 2365.6600000000003,
        "end": 2372.46
    },
    {
        "text": " ¿qué no los veo por ahí con la banderita? ¿Están viendo?",
        "start": 2372.46,
        "end": 2378.9
    },
    {
        "text": " ¿Qué declaro entonces la pregunta tuya de dónde sería información? La plantilla yo. ¿Qué otra",
        "start": 2378.9,
        "end": 2390.06
    },
    {
        "text": " cosa registra la cuenta corriente de la balanza de apagos? ¿Qué otra cosa encontramos? ¿Qué otro",
        "start": 2390.06,
        "end": 2394.3
    },
    {
        "text": " tipo de transacción? Aquellas que tienen que ver con la remuneración, factores productivos,",
        "start": 2394.3,
        "end": 2406.62
    },
    {
        "text": " la remuneración, retribución, el pago, el cobre, el pago, a factores de la producción,",
        "start": 2408.9,
        "end": 2415.98
    },
    {
        "text": " a factores productivos, ¿y esto? ¿Cómo es? A ver, ya no va a ser tan intuitivo como el comarcio",
        "start": 2415.98,
        "end": 2424.7000000000003
    },
    {
        "text": " de bienes, si yo les preguntaba qué tipo de transacciones tiene Uruguay con el mundo,",
        "start": 2424.7000000000003,
        "end": 2429.1800000000003
    },
    {
        "text": " era muy probable que lo primero que se desocurra es a Uruguay exporta, a Uruguay importa y dentro de",
        "start": 2429.1800000000003,
        "end": 2434.7000000000003
    },
    {
        "text": " ellos los bienes. ¿Cómo es esto de la remuneración a factores de la producción primero? ¿Qué son",
        "start": 2434.7,
        "end": 2441.58
    },
    {
        "text": " los factores productivos? ¿Cuáles son los principales factores productivos? ¿Qué son los factores",
        "start": 2441.58,
        "end": 2446.62
    },
    {
        "text": " de la producción, los factores productivos? ¿Aquellos quisieron economía o algo? Bien, por ejemplo,",
        "start": 2446.62,
        "end": 2454.2599999999998
    },
    {
        "text": " los recursos naturales, la mano de obra, el factor productivo trabajo, el capital, las instalaciones,",
        "start": 2454.2599999999998,
        "end": 2461.8199999999997
    },
    {
        "text": " todos esos son factores de la producción en síntesis y en palabras muy simples, ¿verdad?",
        "start": 2461.82,
        "end": 2466.38
    },
    {
        "text": " Son aquellas cosas que necesitamos para producir. Yo no puedo producir un virus servicio,",
        "start": 2466.38,
        "end": 2472.38
    },
    {
        "text": " sino tengo capital, no tengo maquinaria, no tengo dinero, no tengo trabajadores o, por lo menos,",
        "start": 2472.38,
        "end": 2479.34
    },
    {
        "text": " un trabajador que sea que... No, recursos naturales, si es que lo necesita, ¿verdad? Si,",
        "start": 2479.34,
        "end": 2486.7000000000003
    },
    {
        "text": " ya es algún tipo de producción pecuaria. Entonces, los factores de la producción son el trabajo,",
        "start": 2486.7,
        "end": 2491.62
    },
    {
        "text": " el capital, los más importantes. Acá vamos a registrar a los trabajadores, vamos a registrar a las",
        "start": 2491.62,
        "end": 2499.8199999999997
    },
    {
        "text": " inversiones al capital, no, vamos a registrar la remuneración que reciben los factores de la producción.",
        "start": 2499.8199999999997,
        "end": 2506.3799999999997
    },
    {
        "text": " Es decir, que si un Uruguayo, por ejemplo, invierte capital en una compañía, acá en Uruguay,",
        "start": 2507.58,
        "end": 2514.2999999999997
    },
    {
        "text": " esa inversión, ¿verdad? Esé capital, invertido por el Uruguayo aquí en Uruguay, que pone una empresa,",
        "start": 2514.3,
        "end": 2520.0600000000004
    },
    {
        "text": " va a estar registrado en la balanza de pagos o no. El salario que yo recibo por mi trabajo aquí en",
        "start": 2520.0600000000004,
        "end": 2528.0600000000004
    },
    {
        "text": " la Universidad de República, yo soy Uruguayo, ¿verdad? El salario que recibo estará registrado en la",
        "start": 2528.0600000000004,
        "end": 2534.1800000000003
    },
    {
        "text": " balanza de pagos como remuneración del factor productivo trabajo.",
        "start": 2534.1800000000003,
        "end": 2536.78
    },
    {
        "text": " Bien, el compañero dice a ver, no todo, que registra salario sí, que registra remuneración al capital",
        "start": 2536.78,
        "end": 2550.5
    },
    {
        "text": " también, pero tiene que involucrar una transacción entre un residente y un no-residente. Por lo tanto,",
        "start": 2550.5,
        "end": 2556.26
    },
    {
        "text": " si a mí me contrata una organización uruguay, a Universidad de República y me pago un sueldo dentro",
        "start": 2556.26,
        "end": 2561.94
    },
    {
        "text": " del trato internacional, es una transacción entre residentes, no va a estar registrado en la balanza de",
        "start": 2561.94,
        "end": 2567.06
    },
    {
        "text": " pagos, estos salarios no están registrados en la balanza de pagos. Lo mismo que si un argentino trabaja",
        "start": 2567.06,
        "end": 2574.42
    },
    {
        "text": " en Brasil, ese salario que reciba en no-vas estar registrado acá, tiene que involucrar un Uruguayo,",
        "start": 2574.42,
        "end": 2580.7400000000002
    },
    {
        "text": " verdad, y el resto del mundo. Residentes y no-residentes. En cambio, soy yo fuera extranjero y viniera",
        "start": 2580.7400000000002,
        "end": 2590.34
    },
    {
        "text": " a trabajar uruguay y recibe un sueldo. Si yo soy un no-residente e ingreso capital invierto en",
        "start": 2590.34,
        "end": 2599.82
    },
    {
        "text": " uruguay, la inversión que realiza en uruguay como no-residente no va a estar registrado en la cuenta",
        "start": 2599.82,
        "end": 2606.9
    },
    {
        "text": " corriente, pero si la remuneración, la retribución que recibe ese capital, si son fondos propios,",
        "start": 2606.9,
        "end": 2615.1000000000004
    },
    {
        "text": " ¿cómo que no hombre recibe la remuneración de capital? Si son fondos aportados por la",
        "start": 2615.1,
        "end": 2620.7
    },
    {
        "text": " versiónista, ¿cómo se llama la retribución que recibe el capital? Renta ganancia, utilidades o no.",
        "start": 2620.7,
        "end": 2629.7
    },
    {
        "text": " Por tanto, lo que va a estar registrado en la cuenta corriente es la ganancia, utilidades de empresas,",
        "start": 2629.7,
        "end": 2637.58
    },
    {
        "text": " no-residentes, extranjeras, prosificidades, no de todas, solamente las extranjeras, no las empresas",
        "start": 2637.58,
        "end": 2644.8199999999997
    },
    {
        "text": " uruguayas, lo que ganen las empresas uruguayas no va a estar registrado acá, acá va a estar registrado",
        "start": 2644.82,
        "end": 2651.06
    },
    {
        "text": " la utilidad que reciben los capitales que invertieron en uruguay de origen no-residente, no-residentes,",
        "start": 2651.06,
        "end": 2658.1400000000003
    },
    {
        "text": " ¿verdad? Bien, lo mismo, lo mismo, en ese caso Uruguay registrará un cobro de una remuneración al",
        "start": 2658.1400000000003,
        "end": 2667.42
    },
    {
        "text": " mundo. Capitales uruguayos en el mundo están cobrando en la remuneración, Uruguay como país",
        "start": 2667.42,
        "end": 2673.54
    },
    {
        "text": " registrará en su cuenta corriente una retribución al exterior cobrada.",
        "start": 2673.54,
        "end": 2676.9
    },
    {
        "text": " ¿Cómo se denomina el rubro renta de la inversión?",
        "start": 2679.9,
        "end": 2684.3
    },
    {
        "text": " Renta de la inversión.",
        "start": 2687.5,
        "end": 2689.58
    },
    {
        "text": " Dependiendo del sentido tendremos rentas que le cobramos al exterior, por ejemplo,",
        "start": 2693.42,
        "end": 2700.3
    },
    {
        "text": " una empresa uruguaya se instala en Madrid, obtiene una utilidad, esa utilidad,",
        "start": 2700.3,
        "end": 2708.1000000000004
    },
    {
        "text": " verdad, se computa como que es cobrada por Uruguay, siempre juicio de que pueda reinvertirse en",
        "start": 2708.1000000000004,
        "end": 2714.78
    },
    {
        "text": " Madrid, ¿verdad? Pero es como que el país está cobrando una renta por un factor productivo",
        "start": 2714.78,
        "end": 2720.02
    },
    {
        "text": " residente que está desarrollándose en el exterior. Lo mismo, si es un trabajador,",
        "start": 2720.02,
        "end": 2725.38
    },
    {
        "text": " pero en este caso si hablamos de trabajador, hablamos de remuneración, ¿verdad?",
        "start": 2725.38,
        "end": 2730.38
    },
    {
        "text": " Y si el capital es aportado por terceros, estamos hablando de préstamos de crédito internacional,",
        "start": 2732.38,
        "end": 2739.1400000000003
    },
    {
        "text": " ¿verdad? préstamos, crédito internacional. Si el capital es aportado por tercero, por ejemplo,",
        "start": 2739.1400000000003,
        "end": 2745.3
    },
    {
        "text": " Uruguay recibe un crédito. Esa inversión, esa capital que ingresa no va a estar registrado en",
        "start": 2745.3,
        "end": 2752.94
    },
    {
        "text": " la cuenta corriente. Lo que sí va a estar registrado es la remuneración que recibe ese capital",
        "start": 2752.94,
        "end": 2758.1
    },
    {
        "text": " prestado. ¿Cómo se llama lo que pagamos intereses? Acaba estar registrado en ese caso si estamos",
        "start": 2758.1,
        "end": 2767.86
    },
    {
        "text": " no computando los intereses pagados por la duda de la externa contraída, rentas que Uruguay",
        "start": 2767.86,
        "end": 2774.26
    },
    {
        "text": " le paga al mundo, al exterior, rentas que le pagamos al exterior, intereses de deuda.",
        "start": 2774.26,
        "end": 2780.46
    },
    {
        "text": " Pero no hay intereses de deuda cobrados y ahí la respuesta es no. Uruguay es deudor,",
        "start": 2780.46,
        "end": 2788.02
    },
    {
        "text": " ¿verdad? Internacional no es acredor internacional. Está claro lo que digo, ¿qué significa?",
        "start": 2788.02,
        "end": 2794.18
    },
    {
        "text": " Uruguay no le ha prestado a nadie, más bien. Uruguay le pide, le debemos al mundo.",
        "start": 2794.18,
        "end": 2798.78
    },
    {
        "text": " Sí, hay otros países que sí que son acredores internacionales, otros países. Nosotros no tenemos",
        "start": 2800.78,
        "end": 2806.5
    },
    {
        "text": " el gusto, ¿verdad? Si fuéramos serías rentas cobradas, claro que sí. Pero con el endeudamiento",
        "start": 2806.5,
        "end": 2812.86
    },
    {
        "text": " con el que tenemos, ¿verdad? De los volúmenes que tenemos somos deudores por un buen tiempo,",
        "start": 2812.86,
        "end": 2817.94
    },
    {
        "text": " ¿no? Yo creo que los nietos, nuestros capas que seguirán viendo la duda externa, ¿no?",
        "start": 2817.94,
        "end": 2826.14
    },
    {
        "text": " ¿Qué no siempre la tuvimos, ¿no? Que a veces uno cree o repite, pero siempre hubo deuda,",
        "start": 2826.14,
        "end": 2832.26
    },
    {
        "text": " no siempre hubo deuda, ¿no? Y digo, ¿y ahí hay cifras relativas? Es decir, respecto a la",
        "start": 2832.26,
        "end": 2838.7400000000002
    },
    {
        "text": " producción hay porcentajes. Cuando yo era chico tenía la edu ustedes, estudiaba la deuda sobre",
        "start": 2838.7400000000002,
        "end": 2846.9
    },
    {
        "text": " la producción total uruguay era un 40%, ¿no? Hemos tocado casi el 100%, es decir, de toda la",
        "start": 2846.9,
        "end": 2857.6600000000003
    },
    {
        "text": " producción del país de un año, deberíamos dedicar a la pagar la deuda para cancelar endeudamiento.",
        "start": 2857.66,
        "end": 2862.54
    },
    {
        "text": " Son volúmenes importantes. Bueno, digo porque a veces uno dice bueno, pero de última,",
        "start": 2862.54,
        "end": 2868.94
    },
    {
        "text": " pidamos, ¿no? Como solución fácil, pidamos, crédito, endeudemos, ¿no? ¿Por qué barato contra el",
        "start": 2868.94,
        "end": 2874.18
    },
    {
        "text": " crédito? A ver, ¿wait? Ya tenemos deuda, ¿no? Digo, alguien la va a tener que pagar después,",
        "start": 2874.18,
        "end": 2879.22
    },
    {
        "text": " ¿no? Digo, si es que uno tiene un relativo sentimiento solidaria internacional, pues yo puedo",
        "start": 2879.22,
        "end": 2886.5
    },
    {
        "text": " decir, con la mentaliago vista, bueno, a lo que quiero, me patino todo y le dijo el clavo",
        "start": 2886.5,
        "end": 2890.34
    },
    {
        "text": " de los que viven después, que se arreglen, bueno, no está bien, pensar así, ¿no? Deocados,",
        "start": 2890.34,
        "end": 2897.3
    },
    {
        "text": " cada uno que pienso lo que quiera, pero no es el ideal, ¿no? Eso es muy egoísta, no?",
        "start": 2897.3,
        "end": 2902.1
    },
    {
        "text": " Es decir, bueno, los del futuro que se arreglen, porque con ese criterio contaminemos todos los ríos,",
        "start": 2902.1,
        "end": 2907.26
    },
    {
        "text": " ¿no? ¿Gotemos todos los recursos naturales y bueno que se arreglen? No, no está bueno,",
        "start": 2907.26,
        "end": 2912.1
    },
    {
        "text": " no está decirlo. ¿no? Bueno, bien, renta la inversión, este",
        "start": 2912.1,
        "end": 2923.7799999999997
    },
    {
        "text": " ruro es como un poco raro, ¿no? Porque se configura la transacción entre Uruguay y el mundo",
        "start": 2923.7799999999997,
        "end": 2928.86
    },
    {
        "text": " cuando la empresa viene, está a sus capitales en Uruguay y repito, el capital, la inversión",
        "start": 2928.86,
        "end": 2934.8199999999997
    },
    {
        "text": " no se registra aquí, se registra la remuneración esa inversión, la retribución esa inversión,",
        "start": 2934.8199999999997,
        "end": 2940.2599999999998
    },
    {
        "text": " la renta de esa inversión, las utilidades como decía alguien por ahí, la ganancia de esos",
        "start": 2940.26,
        "end": 2945.6600000000003
    },
    {
        "text": " capitales. Cuando Uruguay contrauda internacional con un organismo multilateral de crédito,",
        "start": 2945.6600000000003,
        "end": 2954.2200000000003
    },
    {
        "text": " la deuda, el endeudamiento está acá, no, acaba el servicio de la deuda, acaba lo que",
        "start": 2954.2200000000003,
        "end": 2960.2200000000003
    },
    {
        "text": " pagamos por de intereses por esa deuda, ¿no? Si miramos a economías como la nuestra, como",
        "start": 2960.22,
        "end": 2971.9399999999996
    },
    {
        "text": " Uruguay estoy hablando, ¿qué les parece en términos de… Hablamos de eso, por lo",
        "start": 2971.9399999999996,
        "end": 2978.58
    },
    {
        "text": " que un poco jugamos con los datos, a ver qué les parece a priori, ¿cómo será estas",
        "start": 2978.58,
        "end": 2984.2999999999997
    },
    {
        "text": " rentas que cobramos al mundo respecto a las rentas que pagamos? Es fuerte, como que",
        "start": 2984.3,
        "end": 2995.1800000000003
    },
    {
        "text": " cobraríamos muchos menores rentas de las que pagamos, ¿por qué? ¿En qué está pensando?",
        "start": 2995.1800000000003,
        "end": 3002.34
    },
    {
        "text": " Acá está registrado el mundo de la deuda. Bueno, entonces, un poco lo que hablamos,",
        "start": 3002.34,
        "end": 3015.7400000000002
    },
    {
        "text": " ¿no? De la gran deuda externa que tenemos, por lo tanto, es de suponer que pagamos muy altos",
        "start": 3015.7400000000002,
        "end": 3021.34
    },
    {
        "text": " intereses, ¿no? Que estaría bueno averiguar cuánto pagamos por mes de intereses de la",
        "start": 3021.34,
        "end": 3027.1800000000003
    },
    {
        "text": " externa. Y es probable que se sorprendan, ¿qué significa sorprendarse? Que digan, wow,",
        "start": 3027.18,
        "end": 3036.8999999999996
    },
    {
        "text": " con esos intereses de la deuda construimos, como vieron que a veces en Uruguay se estila",
        "start": 3036.8999999999996,
        "end": 3040.58
    },
    {
        "text": " decir, construimos cuatro escuelas, cinco pitales y van a encontrar cosas que por mes podríamos",
        "start": 3040.58,
        "end": 3046.02
    },
    {
        "text": " construir todo eso, solo por los intereses que pagamos, a más Uruguay, a un rado históricamente,",
        "start": 3046.02,
        "end": 3052.66
    },
    {
        "text": " todo eso es un buen gesto, ¿verdad? Es decir, la sumíste la deuda en el pasado, la venís",
        "start": 3052.66,
        "end": 3056.94
    },
    {
        "text": " asumiendo, honrá la honrá, la honrá la que significa acete cargo. Por otro país, se han",
        "start": 3056.94,
        "end": 3061.46
    },
    {
        "text": " declarado el default, ¿verdad? Es decir, no pagan deuda, no? Van carro, tan sesación de",
        "start": 3061.46,
        "end": 3065.98
    },
    {
        "text": " pagos, no pago nada, suarte en pila, ¿no? Good bye, go home y llame como ustedes, ¿no?",
        "start": 3065.98,
        "end": 3073.42
    },
    {
        "text": " Ya, ya, ya que estamos. ¿O decías de la deuda que está ahora mismo? Sí, por ejemplo.",
        "start": 3073.42,
        "end": 3080.7000000000003
    },
    {
        "text": " Bueno, hoy en día está bien la pregunta, si la, a ver, el compañero dice, adentremos en",
        "start": 3080.7000000000003,
        "end": 3092.3
    },
    {
        "text": " el tema de este deuda, ¿verdad? ¿Cómo está compuesta la deuda pública o privada pública?",
        "start": 3092.3,
        "end": 3097.26
    },
    {
        "text": " La, la, la, la externa. Bueno, principalmente la, la deuda Uruguay, principalmente está",
        "start": 3097.26,
        "end": 3104.42
    },
    {
        "text": " contraída con, con, con acredores privados, ¿verdad? privados que o institucionales no con",
        "start": 3104.42,
        "end": 3111.0200000000004
    },
    {
        "text": " organismos multilaterales de crédito. Y por último, dentro de la cuenta corriente de la",
        "start": 3111.0200000000004,
        "end": 3115.1400000000003
    },
    {
        "text": " balanza, a pagos encontramos en palabras comunes, esas transacciones en las cuales hay una",
        "start": 3115.1400000000003,
        "end": 3122.0200000000004
    },
    {
        "text": " partida y no contra partida, esto es, esa salida, por ejemplo, de marcancias al mundo,",
        "start": 3122.02,
        "end": 3127.6
    },
    {
        "text": " toma, te da transfero, ¿eh? A cambio de que, de nada, ¿qué se está configurando? ¿Cómo",
        "start": 3127.6,
        "end": 3135.2
    },
    {
        "text": " le llamamos en la jerga de ese tipo de las donaciones, ¿verdad? Bien, o, de donaciones en palabras",
        "start": 3135.2,
        "end": 3140.34
    },
    {
        "text": " comunes, ¿eh? Las donaciones, palabras comunes, ¿eh? ¿Cómo se llama el ruro? Ahora sí, el nombre",
        "start": 3140.34,
        "end": 3150.14
    },
    {
        "text": " prolegito, transferencias, transferencias, referencias corrientes, transferencias corrientes,",
        "start": 3150.14,
        "end": 3165.7599999999998
    },
    {
        "text": " a ver, en síntesis y de obvienza en síllito, donaciones, principalmente donaciones, donaciones",
        "start": 3165.7599999999998,
        "end": 3176.02
    },
    {
        "text": " que enviamos al mundo de naciones que recibimos, sean públicas oficiales, no, no, privadas,",
        "start": 3176.02,
        "end": 3183.2599999999998
    },
    {
        "text": " por ejemplo, Uruguay ha donado algo, alguna vez nos donaron algo, se te ocurre algo, barcos,",
        "start": 3183.2599999999998,
        "end": 3194.3
    },
    {
        "text": " quién está leando, barcos, nos han donado esos barcos de guerra, son donados, nunca se",
        "start": 3194.3,
        "end": 3203.46
    },
    {
        "text": " compravan, decir que en alguna época nos donaron algún gobierno alemán, que es yo, francés,",
        "start": 3203.46,
        "end": 3210.62
    },
    {
        "text": " no sé dónde que origen, tiene esos barcos, de verdad, un poco, ¿conocés es un caso en particular?",
        "start": 3210.62,
        "end": 3215.2200000000003
    },
    {
        "text": " ¿No se le da un avión? Ah, que donaron un avión, bueno, ¿eh?",
        "start": 3215.2200000000003,
        "end": 3221.58
    },
    {
        "text": " ¿No se le da un avión? Ah, es un ejemplo, ¿eh?",
        "start": 3221.58,
        "end": 3225.46
    },
    {
        "text": " Donamos cascos, ¿cómo sería Don Arcascos?",
        "start": 3225.46,
        "end": 3230.22
    },
    {
        "text": " Pero se cobra por eso, claro, se cobra, no se unirás pagas por eso, se corandole, se corra",
        "start": 3230.22,
        "end": 3239.7799999999997
    },
    {
        "text": " muy bien, ¿no? Sí, se corra muy bien, ¿no? Eso no es un servicio, no es amor al proj,",
        "start": 3239.7799999999997,
        "end": 3246.14
    },
    {
        "text": " ¿no? Eso es por plata, claro, los cascos se son por plata, lo que sí a veces y está",
        "start": 3246.14,
        "end": 3251.94
    },
    {
        "text": " un poco relacionado a esas situaciones de catástrofe, que aparece por ahí, no uruguay",
        "start": 3251.94,
        "end": 3256.14
    },
    {
        "text": " a Donado, UPAZ, ¿de suena? Ah, está, las potabilizadoras, ¿qué significa una",
        "start": 3256.14,
        "end": 3262.7799999999997
    },
    {
        "text": " gupa? La unidad potabilizadora de agua, ¿conocen? ¿vieron alguna vez? ¿Cómo funciona",
        "start": 3262.7799999999997,
        "end": 3269.1
    },
    {
        "text": " alguna? ¿Lavieron de lejos? ¿Capaz que hay en diséjano? Mi pueblo hay una, ¿no? ¿Saben",
        "start": 3269.1,
        "end": 3278.9
    },
    {
        "text": " de que se trata de, tienen la imagen de aodas visto, son como ese contenedor verde, ¿no?",
        "start": 3278.9,
        "end": 3283.74
    },
    {
        "text": " ¿Cómo ese container verde, donde hay unos canos a tomas, a un río que se yo entra agua",
        "start": 3283.74,
        "end": 3288.62
    },
    {
        "text": " sucia y sale agua para la canilla, bueno, para tomar agua, potabilizá agua, son unidades",
        "start": 3288.62,
        "end": 3295.3399999999997
    },
    {
        "text": " de potabilizadoras de agua, ¿no? Según día pueden acceder, seguramente aquellos que",
        "start": 3295.34,
        "end": 3301.1800000000003
    },
    {
        "text": " estudien hidráulicas, sanitaria, sospechos que lo van a estudiar eso, porque, ¿no? Primero",
        "start": 3301.1800000000003,
        "end": 3308.82
    },
    {
        "text": " que son unidades que fueron inventadas en Uruguay, ¿no? Tengo entendido, me puedo estar",
        "start": 3308.82,
        "end": 3315.54
    },
    {
        "text": " equivocando, pero tengo entendido por el cuerpo de ingenieros del ejército, sin ingenieros",
        "start": 3315.54,
        "end": 3321.46
    },
    {
        "text": " del ejército, inventaron esa. ¿Qué no sé cómo funciona? Yo lo he visto, sí cómo funcionar,",
        "start": 3321.46,
        "end": 3328.7
    },
    {
        "text": " no entiendo mucho, ¿no? Pero veo como que pasan cosas, si se mueve, veniván, y se remueve,",
        "start": 3328.7,
        "end": 3334.58
    },
    {
        "text": " veniz pasan de una o otra, y no sé cómo es que al rato así le prende la canilla y tomás",
        "start": 3334.58,
        "end": 3340.5
    },
    {
        "text": " agua al mat, tomás palmate, y la toma desde el río de la plata, ¿eh? Yo la miro, por",
        "start": 3340.5,
        "end": 3346.7400000000002
    },
    {
        "text": " ejemplo, ahí en la playa charrúa dejo en la casa, ahí uno se está bañando, ahí la",
        "start": 3346.74,
        "end": 3351.02
    },
    {
        "text": " upa está a 200 metros y la toma de agua, ahí está ahí, y entra agua y después de tu casa",
        "start": 3351.02,
        "end": 3357.22
    },
    {
        "text": " te bañase esa agua de la upa, tomás agua, ¿no? Yo estoy hablando como canario, como si fuera",
        "start": 3357.22,
        "end": 3362.8199999999997
    },
    {
        "text": " un descubrimiento americano y que, ¿qué pasa? Que usted me llama teo a dar, tenemos clarísimo",
        "start": 3362.8199999999997,
        "end": 3367.58
    },
    {
        "text": " de que se trata, ¿no? Upas, unidades, totalizadas, bueno, ¿qué, ¿qué donamos? Muchas veces,",
        "start": 3367.58,
        "end": 3373.8599999999997
    },
    {
        "text": " ¿no? Es algo que tenemos para donar, que es un inventor guay, ¿no? ¿no? Un invento",
        "start": 3373.86,
        "end": 3380.58
    },
    {
        "text": " hay un guay, unas upas, ¿han vuelo? Hay muchos pueblos en el guay, pueblos y ciudades,",
        "start": 3380.58,
        "end": 3390.58
    },
    {
        "text": " ¿no? Pues cuando la casa es una ciudad, no es un pueblo, 13 mil personas, pero que tienen,",
        "start": 3390.58,
        "end": 3394.78
    },
    {
        "text": " pero muchos pueblos, ¿no? Que tienen, en vez de tener obviamente agua por red desde",
        "start": 3394.78,
        "end": 3401.38
    },
    {
        "text": " agua corriente, es verdad, se abastecen de algún pozo y tienen una upa, una unidad potalizadora",
        "start": 3401.38,
        "end": 3408.1800000000003
    },
    {
        "text": " de agua, ¿qué es? Dicintos tamaños, ¿verdad? Depende de lo que le callan, pero las necesidades,",
        "start": 3408.1800000000003,
        "end": 3412.46
    },
    {
        "text": " ¿qué querías comentar? Y que enviamos las transferencias que recibimos y las transferencias",
        "start": 3412.46,
        "end": 3419.78
    },
    {
        "text": " que enviamos, las transferencias corrientes que recibimos y las transferencias corrientes",
        "start": 3419.78,
        "end": 3424.98
    },
    {
        "text": " que enviamos en un sentido y en otro, todas las transferencias van en un sentido o en",
        "start": 3424.98,
        "end": 3430.26
    },
    {
        "text": " otro, ¿eh? Está bueno en la aclaración, pues ya ves, es pongo ejemplos de un sentido",
        "start": 3430.26,
        "end": 3434.86
    },
    {
        "text": " solo, pero siempre para fuera y para dentro, para fuera y para dentro de pendiente. Bien,",
        "start": 3434.86,
        "end": 3441.42
    },
    {
        "text": " como síntesis entonces, cuenta corriente, primer, gran parte de este instrumento de",
        "start": 3441.42,
        "end": 3449.38
    },
    {
        "text": " escribido balance de pados, que decíamos, tiene como objetivo registrar todas las transacciones",
        "start": 3449.38,
        "end": 3454.62
    },
    {
        "text": " que se dan entre el guay y el mundo, entre el mundo y el guay en un periodo de tiempo determinado,",
        "start": 3454.62,
        "end": 3459.26
    },
    {
        "text": " en un trimestre. Ahora, se compila trimestralmente pero se puede presentar información para el año,",
        "start": 3459.26,
        "end": 3465.02
    },
    {
        "text": " también, ¿no? Agradando todos los trimestre, estamos a acuerdo. Dentro de esta primera parte,",
        "start": 3465.02,
        "end": 3472.94
    },
    {
        "text": " que es la cuenta corriente tenemos, transacciones que hacen el movimiento de beneficios a la renta,",
        "start": 3472.94,
        "end": 3480.5
    },
    {
        "text": " a la remuneración de factores productivos y las donaciones, las transferencias corrientes,",
        "start": 3480.5,
        "end": 3484.18
    },
    {
        "text": " ¿cuáles son los principales ruros que vamos a encontrar? Los tenemos en esta columna,",
        "start": 3485.98,
        "end": 3490.1
    },
    {
        "text": " el ruro, mercancías, que se encarga de registrar el comercio de bienes, ventas y compras,",
        "start": 3490.1,
        "end": 3497.86
    },
    {
        "text": " export e import de bienes y luego estos ruros, transportes, seguro, no? Viajes que se encargan",
        "start": 3497.86,
        "end": 3508.94
    },
    {
        "text": " de registrar la comercialización de servicios, sean exportados o importados. El agregado es el total,",
        "start": 3508.94,
        "end": 3518.02
    },
    {
        "text": " ¿no? Las exporto tales se están formadas por las expo de bienes, más expo de servicios y lo mismo",
        "start": 3518.02,
        "end": 3523.6200000000003
    },
    {
        "text": " para las importaciones. Yo puedo conocer en cuanto crecieron, en cuanto variaron las expo en un",
        "start": 3523.62,
        "end": 3530.1
    },
    {
        "text": " periodo, en cuanto variaron las import, bien. Por otro lado, registramos la renta de la inversión,",
        "start": 3530.1,
        "end": 3536.2999999999997
    },
    {
        "text": " el ruro se denomina la renta de la inversión, la remuneración de factores productivos, salarios,",
        "start": 3536.2999999999997,
        "end": 3540.74
    },
    {
        "text": " intereses de deuda, utilidades de empresa, como decía Stubber, ganancia de empresas, siempre",
        "start": 3540.74,
        "end": 3548.7
    },
    {
        "text": " cuando sea una extranjera de noruguay o una uruguaya extranjera como alguien de acá decía, ¿verdad?",
        "start": 3548.7,
        "end": 3554.3399999999997
    },
    {
        "text": " No la ganancia de las empresas uruguayas en noruguay. ¿Tamos acuerdo? Bien. Tendremos rentas cobradas,",
        "start": 3555.46,
        "end": 3563.18
    },
    {
        "text": " rentas pagadas, dependiendo de si el factor productivo residente en el exterior o no",
        "start": 3563.18,
        "end": 3568.56
    },
    {
        "text": " residente aquí. Y por último, la cuenta corriente, por ahora que presentamos esta primera parte,",
        "start": 3568.56,
        "end": 3574.58
    },
    {
        "text": " la cuenta corriente registra las donaciones, principalmente las donaciones, verdad, las transferencias",
        "start": 3574.58,
        "end": 3580.8199999999997
    },
    {
        "text": " corrientes recibidas, cuenviadas, dependiendo de si entran, o si sale. ¿Cómo conseguimos?",
        "start": 3580.8199999999997,
        "end": 3591.34
    },
    {
        "text": " Ah, bueno, te quedaste con aquello de la contrapartida, de la doble registración para una transacción,",
        "start": 3591.34,
        "end": 3599.62
    },
    {
        "text": " cuando es comercial claramente la vaca sale y entran divisas, ¿verdad? Compáñate, se acaba",
        "start": 3599.62,
        "end": 3604.06
    },
    {
        "text": " a ver, sale una upa y no entra nada, bueno, simple, contablemente se crea un artificio, ¿verdad?",
        "start": 3604.06,
        "end": 3611.74
    },
    {
        "text": " Que compensa esa transacción la misma, ¿verdad? Dejala, pre. Sí, ¿por qué no nos metemos en la",
        "start": 3611.74,
        "end": 3620.7799999999997
    },
    {
        "text": " metodología de registración más allá de titulares, algún titular general como para safar, pero",
        "start": 3620.7799999999997,
        "end": 3626.66
    },
    {
        "text": " no quiero... Bueno, continuamos. Una lectura que podemos hacer de la balanza de paos, es justamente",
        "start": 3626.66,
        "end": 3636.7
    },
    {
        "text": " esta, ¿verdad? Es decir, preguntarnos por ejemplo, ¿cuánto fue la variación de la sex por",
        "start": 3636.7,
        "end": 3642.7799999999997
    },
    {
        "text": " ¿en cuánto variaron las rentas que cobramos? ¿Cuáles son los créditos a rentas pagadas? ¿Cuánto",
        "start": 3642.7799999999997,
        "end": 3649.8599999999997
    },
    {
        "text": " son... ¿No? ¿Cuánto importamos? Otra lectura... Otra lectura posible es ya no preguntarnos",
        "start": 3649.86,
        "end": 3669.5
    },
    {
        "text": " en cuánto variaron las ex por, en cuánto variaron las impor, sino directamente preguntarnos ¿cuál es la",
        "start": 3669.5,
        "end": 3678.1
    },
    {
        "text": " diferencia en el periodo en el trimestre, cuál fue la diferencia matemática entre ex por",
        "start": 3678.1,
        "end": 3684.14
    },
    {
        "text": " e impor? Esto es ¿cuál es el saldo de la balanza comercial? El neto, el saldo de la diferencia,",
        "start": 3684.14,
        "end": 3698.58
    },
    {
        "text": " en este caso, de ex por e impor corresponde al denominado saldo de la balanza comercial.",
        "start": 3698.58,
        "end": 3707.34
    },
    {
        "text": " El lectura a través de saldos no lo termine de presentar, la segunda lectura posible.",
        "start": 3708.54,
        "end": 3712.7799999999997
    },
    {
        "text": " Una es preguntarnos por separado y otra es directamente la diferencia. A ver, exportamos,",
        "start": 3712.7799999999997,
        "end": 3719.02
    },
    {
        "text": " las exportaciones aumentaron 15, bien, las impor aumentaron 10, perfecto en el periodo,",
        "start": 3719.02,
        "end": 3724.62
    },
    {
        "text": " el saldo de la balanza comercial fue de 5, 15 menos de 10, de 5, o puede pasar que el saldo",
        "start": 3724.62,
        "end": 3734.42
    },
    {
        "text": " de la balanza comercial sea negativo. Esto es las exportaciones aumentaron en 20, las importaciones",
        "start": 3734.42,
        "end": 3741.5
    },
    {
        "text": " aumentaron en 30, el saldo de la balanza comercial da negativo, es de menor a cero, porque en el",
        "start": 3741.5,
        "end": 3751.66
    },
    {
        "text": " universo de resultados esta diferencia puede ser positivo, negativo, neutro, no hay otra",
        "start": 3751.66,
        "end": 3755.8199999999997
    },
    {
        "text": " posibilidad. En el caso de que el saldo de la balanza comercial sea positivo, esto significa",
        "start": 3755.8199999999997,
        "end": 3764.8199999999997
    },
    {
        "text": " que exportamos por encima de lo que importamos, estamos frente a lo que se conoce con el nombre",
        "start": 3764.8199999999997,
        "end": 3770.54
    },
    {
        "text": " de un superávit en balanza comercial. Si el resultado es negativo, esto es exportamos",
        "start": 3770.54,
        "end": 3783.9
    },
    {
        "text": " menos, ¿no? Compramos bien decisiones por encima de los que vendemos en un periodo, estamos",
        "start": 3783.9,
        "end": 3790.98
    },
    {
        "text": " frente a un deficit comercial con el resto del mundo, la balanza comercial es de visitaria,",
        "start": 3790.98,
        "end": 3798.06
    },
    {
        "text": " es negativa, es de visitaria, importamos más de lo que exportamos, ¿no? O la balanza comercial",
        "start": 3798.06,
        "end": 3804.2999999999997
    },
    {
        "text": " está equilibrada en el caso de que nos dé cero, exportamos exactamente por el mismo valor de lo que",
        "start": 3804.2999999999997,
        "end": 3811.54
    },
    {
        "text": " importamos, en ese caso estamos frente a un equilibrio comercial con el mundo, de export, de",
        "start": 3811.54,
        "end": 3816.42
    },
    {
        "text": " perdón de bienes y de servicios. Son las denominaciones que recibo verdad, este saldo, que seguramente",
        "start": 3816.42,
        "end": 3824.66
    },
    {
        "text": " lo habrán escuchado antes, el saldo de la balanza comercial o no, en geografía de cuarto",
        "start": 3824.66,
        "end": 3831.46
    },
    {
        "text": " delicero, que los profesores geografía les encanta hablar de todo esto. En vez de hablar",
        "start": 3831.46,
        "end": 3835.8199999999997
    },
    {
        "text": " de la penillanura, hablan de... No? Suavemente ondulado, por ejemplo, ¿no? Está quedando",
        "start": 3835.8199999999997,
        "end": 3847.62
    },
    {
        "text": " claro lo que estamos diciendo. En términos descriptivos digo, el resultado en un trimestre",
        "start": 3847.62,
        "end": 3853.3799999999997
    },
    {
        "text": " puede ser positivo, favorable, la balanza comercial puede ser de visitaria o no. Bueno, a ver,",
        "start": 3853.38,
        "end": 3864.02
    },
    {
        "text": " matemáticamente la probabilidad de que es cero, justo cero, y probabiliticamente yo creo",
        "start": 3864.02,
        "end": 3870.9
    },
    {
        "text": " que la probabilidad es casi cero, claro, decir de infinidad de casos trimestrales, la probabilidad",
        "start": 3870.9,
        "end": 3878.9
    },
    {
        "text": " que sean exactamente los mismos, pero bueno, próxima cero, ¿verdad? El compañero dice haber,",
        "start": 3878.9,
        "end": 3884.34
    },
    {
        "text": " ¿no? El equilibrio es cuando da cero exactamente y bueno, cuando da 30 millones de dólares también,",
        "start": 3884.34,
        "end": 3890.3
    },
    {
        "text": " acá sí, clíurada. Me explico, hay que ver también qué es lo normal entre muchas comillas, ¿no?",
        "start": 3890.3,
        "end": 3896.26
    },
    {
        "text": " Un rued presenta un superávit o un déficit comercial con el mundo. ¿Pepa? Sí, déficit por todos lados.",
        "start": 3897.86,
        "end": 3907.6600000000003
    },
    {
        "text": " Le comentan los muchachos que me dijeron cuando van a comentar y repetirlo. Déficit déficit,",
        "start": 3908.9,
        "end": 3913.1800000000003
    },
    {
        "text": " ¿pa? Pues eso me es mi épade, ¿eh? ¿Por qué déficit? ¿Pase uno? ¿Para qué él dijo de",
        "start": 3913.1800000000003,
        "end": 3921.14
    },
    {
        "text": " edificio? Vamos a ver qué. En los últimos trimestres, en el último año, en los últimos años,",
        "start": 3921.14,
        "end": 3929.82
    },
    {
        "text": " en los últimos años, tú y me vas, ¿eh? ¿Cómo que te suena? ¿Alguna época de superávit?",
        "start": 3929.82,
        "end": 3938.46
    },
    {
        "text": " ¿Ustedes? ¿Durante la segunda guerra mundial que",
        "start": 3941.26,
        "end": 3947.42
    },
    {
        "text": " no vendemos carne todos los meses, vendemos carne. Los friuríticos exportan carne todos los meses,",
        "start": 3949.1000000000004,
        "end": 3955.34
    },
    {
        "text": " no solamente la segunda guerra mundial, ¿tá? ¿Qué portábamos con nevistres y vos del",
        "start": 3955.34,
        "end": 3960.86
    },
    {
        "text": " anglo de frevento? Mañana me encuentro con un amigo brasileiro, me dice, ¿eh? ¿Qué valencia",
        "start": 3960.86,
        "end": 3971.1000000000004
    },
    {
        "text": " comercial tiene? ¿Tain? ¿Cómo se idea? ¿Tiene? ¿Tiene? ¿Tain? ¿Tain? ¿Qué tain de",
        "start": 3971.1000000000004,
        "end": 3978.7400000000002
    },
    {
        "text": " balanza comercial? No son balanza comerciales de visitingar, ¿eh? ¿Eh? El recién dice mucho",
        "start": 3979.18,
        "end": 3987.18
    },
    {
        "text": " el nee, ¿eh? ¿E? ¿E? ¿E? ¿Y el que dice el tenmeo? ¿Eh? ¿Eh? ¿Elas dos cosas? No",
        "start": 3987.18,
        "end": 3992.22
    },
    {
        "text": " habrá sí le dicen, ¿eh? ¿Eh? ¿Termina diciendo, ¿eh? Por todos lados. ¿Eh? ¿Está bien?",
        "start": 3992.22,
        "end": 3998.02
    },
    {
        "text": " ¿Y la respuesta de donde estudiantes? Yo estuve en ingeniería. No, no, no, no. Posa es que",
        "start": 3998.02,
        "end": 4002.8999999999996
    },
    {
        "text": " ese tema no, no. Andará a favor de la economía y capaz que saben. ¿Eh? ¿Eh? ¿Eh? ¿Qué",
        "start": 4002.8999999999996,
        "end": 4008.4599999999996
    },
    {
        "text": " ¿Cómo estamos con países en términos de comercio exterior?",
        "start": 4008.46,
        "end": 4012.46
    },
    {
        "text": " Bueno, espera que el fin de semana entra la página de Uruguay 21 y me fijó.",
        "start": 4012.46,
        "end": 4017.46
    },
    {
        "text": " Entra la avanza de paz y luego me fijó.",
        "start": 4017.46,
        "end": 4020.46
    },
    {
        "text": " A ver, ¿y bueno?",
        "start": 4024.46,
        "end": 4026.46
    },
    {
        "text": " Esquilibrio o deficito superado?",
        "start": 4028.46,
        "end": 4031.46
    },
    {
        "text": " Claro, prácticamente ser.",
        "start": 4032.46,
        "end": 4034.46
    },
    {
        "text": " Esquilibrio comercial.",
        "start": 4034.46,
        "end": 4037.46
    },
    {
        "text": " Clilibrio comercial con el mundo, ¿no? exportamos.",
        "start": 4037.46,
        "end": 4040.46
    },
    {
        "text": " En el caso de que tengamos un déficit cosa que no estoy respondiendo.",
        "start": 4042.46,
        "end": 4045.46
    },
    {
        "text": " Me gustó esa de que la segunda guerra mundial y después la segunda guerra mundial, no, después siempre déficit.",
        "start": 4046.46,
        "end": 4051.46
    },
    {
        "text": " En el caso de que tuvieramos déficit, es malo.",
        "start": 4053.46,
        "end": 4056.46
    },
    {
        "text": " Y un déficit comercial que depende de la cantidad de ver, ¿de qué estamos hablando y se la compañiera?",
        "start": 4056.46,
        "end": 4069.46
    },
    {
        "text": " Es malo, sí, un déficit comercial no está bueno.",
        "start": 4071.46,
        "end": 4075.46
    },
    {
        "text": " Es decir, estamos del horno. Como países estaríamos en el horno si los números muestran un déficit.",
        "start": 4075.46,
        "end": 4080.46
    },
    {
        "text": " O en el horno más o menos en el horno, ¿verdad?",
        "start": 4080.46,
        "end": 4083.46
    },
    {
        "text": " Parecieron cosas raras, ¿no? ¿Con qué pagar la deuda? ¿Qué deuda?",
        "start": 4087.46,
        "end": 4092.46
    },
    {
        "text": " Yo me lo entengo más sencillo, no sé, a ver si queréis te invitamos también a que estés plasios un poco más.",
        "start": 4094.46,
        "end": 4099.46
    },
    {
        "text": " Es malo, es un sinto más negativo de un país. Mañana me encuentro con un argentino, me dice, ¿y usted cómo están?",
        "start": 4099.46,
        "end": 4106.46
    },
    {
        "text": " En nosotros tenemos una balanza comercial super habitaria. Bueno, no, pues habla así.",
        "start": 4106.46,
        "end": 4112.46
    },
    {
        "text": " Es como más porteño, ¿este? Y es como más de kilmes, ¿no?",
        "start": 4112.46,
        "end": 4119.46
    },
    {
        "text": " Más de Buenos Aires, bueno, capital, no tanto provincia ni interior, ¿no?",
        "start": 4119.46,
        "end": 4124.46
    },
    {
        "text": " Ahí está, no dice que super habitable, y no se le decimos, ¡pá! Mirad, yo entre internet y caer,",
        "start": 4127.46,
        "end": 4131.46
    },
    {
        "text": " y hay un déficit comercial. Usted está en el horno. No solamente son nuestros,",
        "start": 4131.46,
        "end": 4138.46
    },
    {
        "text": " porque es bien, típico porteño, que lo primero que va a decir que punta este nuestro todo de eso,",
        "start": 4138.46,
        "end": 4142.46
    },
    {
        "text": " o a otra vez, bueno, va a decir, ¿cómo es que se llama esto? ¿Qué les parece?",
        "start": 4142.46,
        "end": 4150.46
    },
    {
        "text": " En descritiva, uno no debería de entrarse, ¿verdad? En esta parte de las preguntas.",
        "start": 4150.46,
        "end": 4156.46
    },
    {
        "text": " Pero vamos a jugar un poco, ya que se acerca a noche, ¿no está al jabrador?",
        "start": 4156.46,
        "end": 4161.46
    },
    {
        "text": " Es malo. Es malo, dijo el guría acá. ¿Cómo que depende?",
        "start": 4161.46,
        "end": 4169.46
    },
    {
        "text": " ¡Júate la! Eso viene con todo el público. ¡Depélimo!",
        "start": 4169.46,
        "end": 4173.46
    },
    {
        "text": " Camino, ¿qué no se la juega?",
        "start": 4173.46,
        "end": 4176.46
    },
    {
        "text": " En el siguiente y presta más o vais a tener el nombre, ¿qué viene entonces? ¿Se comprueba bien? ¿Y te da de eso?",
        "start": 4177.46,
        "end": 4183.46
    },
    {
        "text": " A mí si me dicen que el UI viene los últimos 10 años con déficit comercial, yo digo, barbaro, bien.",
        "start": 4183.46,
        "end": 4192.46
    },
    {
        "text": " ¿Cómo crece el UI, ¿eh? Compra más crudo, compra más motos y unbo, están importando más autos,",
        "start": 4192.46,
        "end": 4199.46
    },
    {
        "text": " más celulares, más bienes de capital, ¿pá? ¿Cuál es? Es muy alta la inversión, sí,",
        "start": 4199.46,
        "end": 4204.46
    },
    {
        "text": " mira, tenemos de importaciones, tenemos bienes de capital, maquinarias, muchísimo.",
        "start": 4204.46,
        "end": 4209.46
    },
    {
        "text": " Ah, barbaro, ¿cómo está creciéndose país? Estamos mirando lo mismo, ¿no? Un déficit comercial.",
        "start": 4209.46,
        "end": 4216.46
    },
    {
        "text": " Y miren cómo lo esté leyendo yo.",
        "start": 4216.46,
        "end": 4220.46
    },
    {
        "text": " Mira, ¿cómo? ¿Estes jugando, ¿no? Esajeando un poco.",
        "start": 4220.46,
        "end": 4224.46
    },
    {
        "text": " Pero puede ser síntoma de crecimiento, ¿no?",
        "start": 4224.46,
        "end": 4228.46
    },
    {
        "text": " Desplosiones en crecimiento, explosiones en las inversiones.",
        "start": 4228.46,
        "end": 4233.46
    },
    {
        "text": " ¿O no?",
        "start": 4233.46,
        "end": 4236.46
    },
    {
        "text": " ¿A qué le llama balance económico interno?",
        "start": 4236.46,
        "end": 4245.46
    },
    {
        "text": " ¿Fuerte, perdón?",
        "start": 4245.46,
        "end": 4250.46
    },
    {
        "text": " ¿Villamos en general un con qué pagar?",
        "start": 4250.46,
        "end": 4253.46
    },
    {
        "text": " Bien, nuevamente aparece el tema de con qué pagar ese déficit.",
        "start": 4253.46,
        "end": 4259.46
    },
    {
        "text": " Pero a priori el déficit y cortemos ese famoso prejuicio, estudiemos bien, ¿qué estamos comprando?",
        "start": 4259.46,
        "end": 4266.46
    },
    {
        "text": " ¿Qué estamos vendiendo? Porque no todo déficit comercial es malo.",
        "start": 4266.46,
        "end": 4270.46
    },
    {
        "text": " Es más, puede ser síntoma de crecimiento. Es más, en los momentos de un Uruguay,",
        "start": 4270.46,
        "end": 4275.46
    },
    {
        "text": " más crecia, más déficit comercial tenia.",
        "start": 4275.46,
        "end": 4279.46
    },
    {
        "text": " No. No tiene razón nunca, un contador.",
        "start": 4280.46,
        "end": 4284.46
    },
    {
        "text": " Digo, directamente no tiene razón, pero no tiene...",
        "start": 4284.46,
        "end": 4288.46
    },
    {
        "text": " Porque no tiene razón, no razóna. Por eso.",
        "start": 4288.46,
        "end": 4291.46
    },
    {
        "text": " Bueno. ¿Y qué va que te dices que te preocupa a Inicia?",
        "start": 4291.46,
        "end": 4295.46
    },
    {
        "text": " Bueno, pero es malo que un país sea...",
        "start": 4295.46,
        "end": 4299.46
    },
    {
        "text": " No, no es malo que un país sea.",
        "start": 4299.46,
        "end": 4301.46
    },
    {
        "text": " Pero yo he visto que pregunté si era malo, bueno, ¿no?",
        "start": 4301.46,
        "end": 4303.46
    },
    {
        "text": " Es decir, ¿qué juicio... ¿Qué juicio... tiraríamos, ¿no?",
        "start": 4303.46,
        "end": 4307.46
    },
    {
        "text": " Hay otras cosas que es poder o no poder.",
        "start": 4307.46,
        "end": 4310.46
    },
    {
        "text": " Porque yo puedo querer tener industria de la vestimentación.",
        "start": 4310.46,
        "end": 4315.46
    },
    {
        "text": " Y ¿qué haces por eso?",
        "start": 4315.46,
        "end": 4317.46
    },
    {
        "text": " ¿Qué es lo que es lo que es el futuro también?",
        "start": 4317.46,
        "end": 4319.46
    },
    {
        "text": " ¿Y lo que es el futuro también?",
        "start": 4319.46,
        "end": 4321.46
    },
    {
        "text": " ¿Qué es lo que es el futuro también?",
        "start": 4321.46,
        "end": 4325.46
    },
    {
        "text": " ¿Y lo que es el futuro también?",
        "start": 4325.46,
        "end": 4327.46
    },
    {
        "text": " ¿Y lo que es el futuro también?",
        "start": 4327.46,
        "end": 4330.46
    },
    {
        "text": " ¿Hay otra cosa que es poder o no poder?",
        "start": 4330.46,
        "end": 4333.46
    },
    {
        "text": " Porque yo puedo querer tener industria de la vestimenta.",
        "start": 4334.46,
        "end": 4338.46
    },
    {
        "text": " ¿A verlo, menta, lo que es?",
        "start": 4338.46,
        "end": 4340.46
    },
    {
        "text": " Pero quizás es... no es competitiva.",
        "start": 4340.46,
        "end": 4343.46
    },
    {
        "text": " Entonces, miren todas las otras preguntas y a ver para la respuesta de eso.",
        "start": 4343.46,
        "end": 4349.46
    },
    {
        "text": " Sí, tenía razón el contador.",
        "start": 4349.46,
        "end": 4351.46
    },
    {
        "text": " Es malo, bueno, para para...",
        "start": 4351.46,
        "end": 4354.46
    },
    {
        "text": " Wait, wait, ¿cómo se dice en inglés?",
        "start": 4354.46,
        "end": 4357.46
    },
    {
        "text": " Para para...",
        "start": 4357.46,
        "end": 4359.46
    },
    {
        "text": " ¿Analicemos?",
        "start": 4360.46,
        "end": 4362.46
    },
    {
        "text": " ¿Qué estamos comprando, qué estamos vendiendo?",
        "start": 4362.46,
        "end": 4365.46
    },
    {
        "text": " ¿Cómo viene siendo los últimos años, verdad?",
        "start": 4365.46,
        "end": 4369.46
    },
    {
        "text": " A ver, es cierto lo que dicen por ahí.",
        "start": 4369.46,
        "end": 4372.46
    },
    {
        "text": " No podemos tener un déficit comercial de por vida.",
        "start": 4372.46,
        "end": 4375.46
    },
    {
        "text": " Hay que ver porque esa diferencia que Uruguay le está comprando al mundo.",
        "start": 4375.46,
        "end": 4380.46
    },
    {
        "text": " Enplica que tiene que pagarle al mundo,",
        "start": 4380.46,
        "end": 4382.46
    },
    {
        "text": " más de lo que le cobra al mundo.",
        "start": 4382.46,
        "end": 4384.46
    },
    {
        "text": " Por algún lado hay que pagarlo.",
        "start": 4384.46,
        "end": 4386.46
    },
    {
        "text": " Y está bien lo que decía en ustedes.",
        "start": 4387.46,
        "end": 4389.46
    },
    {
        "text": " Pero quizás no la quiero complicar todavía.",
        "start": 4389.46,
        "end": 4393.46
    },
    {
        "text": " Punto sus pensivos quizás.",
        "start": 4395.46,
        "end": 4397.46
    },
    {
        "text": " Y seguimos con la lectura de saldos parciales.",
        "start": 4397.46,
        "end": 4400.46
    },
    {
        "text": " Yo puedo analizar las rentas que le cobramos al mundo,",
        "start": 4402.46,
        "end": 4405.46
    },
    {
        "text": " la renta que le pagamos por separado.",
        "start": 4405.46,
        "end": 4407.46
    },
    {
        "text": " O predos puedo preguntarme cuál es el neto de la remuneración",
        "start": 4407.46,
        "end": 4410.46
    },
    {
        "text": " a factores productivos, de las rentas.",
        "start": 4410.46,
        "end": 4413.46
    },
    {
        "text": " Bien, el segundo saldo parcial corresponde al conocido como Rx,",
        "start": 4413.46,
        "end": 4418.46
    },
    {
        "text": " el Rx, la remuneración neta de factores productivos con el exterior.",
        "start": 4418.46,
        "end": 4425.46
    },
    {
        "text": " Correspondirá la diferencia entre las rentas que le cobramos al mundo",
        "start": 4427.46,
        "end": 4431.46
    },
    {
        "text": " menos las rentas que le pagamos al exterior.",
        "start": 4431.46,
        "end": 4435.46
    },
    {
        "text": " Una diferencia matemática, Urises, el menos.",
        "start": 4438.46,
        "end": 4441.46
    },
    {
        "text": " Y como toda diferencia también puede ser positivo, negativo, neutro.",
        "start": 4444.46,
        "end": 4448.46
    },
    {
        "text": " Aunque habíamos anticipado que para países como el nuestro",
        "start": 4450.46,
        "end": 4454.46
    },
    {
        "text": " este resultado vamos a esperar que en general sea negativo.",
        "start": 4454.46,
        "end": 4460.46
    },
    {
        "text": " ¿Por qué?",
        "start": 4460.46,
        "end": 4461.46
    },
    {
        "text": " Que era lo que estaba pensando y mucho como renta pagada fuerte.",
        "start": 4464.46,
        "end": 4469.46
    },
    {
        "text": " Los intereses de las deudas, ¿accuardan?",
        "start": 4469.46,
        "end": 4472.46
    },
    {
        "text": " Pero esto que estoy diciendo cuidado no significa que en Uruguay",
        "start": 4472.46,
        "end": 4476.46
    },
    {
        "text": " siempre tendremos una rejeque negativo, ¿no?",
        "start": 4476.46,
        "end": 4480.46
    },
    {
        "text": " ¿Cabas que algún día pasa el positivo? No pasa nada.",
        "start": 4480.46,
        "end": 4483.46
    },
    {
        "text": " Me explico, ¿no es que necesariamente el Rx debe ser negativo o va a ser negativo?",
        "start": 4483.46,
        "end": 4488.46
    },
    {
        "text": " ¿No? ¿Cuidado con esto último que dije, ¿verdad?",
        "start": 4488.46,
        "end": 4491.46
    },
    {
        "text": " Pero puede ser positivo también, si, teóricamente puede ser positivo.",
        "start": 4491.46,
        "end": 4494.46
    },
    {
        "text": " Es una diferencia entre algo y algo.",
        "start": 4494.46,
        "end": 4496.46
    },
    {
        "text": " Bien, y por último, en esta lectura de saldo parciales,",
        "start": 4497.46,
        "end": 4501.46
    },
    {
        "text": " podemos también calcular el neto, la diferencia entre transferencias.",
        "start": 4501.46,
        "end": 4506.46
    },
    {
        "text": " Esto es preguntarnos, ¿cuáles son las transferencias netas corrientes?",
        "start": 4506.46,
        "end": 4513.46
    },
    {
        "text": " Las transferencias netas corrientes.",
        "start": 4513.46,
        "end": 4516.46
    },
    {
        "text": " Esto es el neto de las donaciones, ¿verdad?",
        "start": 4516.46,
        "end": 4519.46
    },
    {
        "text": " Resididas menos enviadas, transferencias corrientes recibidas,",
        "start": 4519.46,
        "end": 4523.46
    },
    {
        "text": " menos transferencias corrientes enviadas.",
        "start": 4523.46,
        "end": 4526.46
    },
    {
        "text": " ¿Qué esto puede ser también positivo, negativo o neutro?",
        "start": 4526.46,
        "end": 4532.46
    },
    {
        "text": " Y van a hacer cifras menores, ¿verdad?",
        "start": 4532.46,
        "end": 4535.46
    },
    {
        "text": " Uruguay no es un receptor de grandes volúmenes de donaciones.",
        "start": 4535.46,
        "end": 4541.46
    },
    {
        "text": " Si recibimos medicamentos, algún equipamiento médico,",
        "start": 4541.46,
        "end": 4546.46
    },
    {
        "text": " la embajada de Japón, ¿no? ¿verdad?",
        "start": 4546.46,
        "end": 4550.46
    },
    {
        "text": " Equipamiento para la escuela sustentada,",
        "start": 4550.46,
        "end": 4553.46
    },
    {
        "text": " lo que ha habido en el marco del proyecto global,",
        "start": 4553.46,
        "end": 4556.46
    },
    {
        "text": " el cambio climático de eso, o no, aparecen por ahí.",
        "start": 4556.46,
        "end": 4560.46
    },
    {
        "text": " El gobierno de España, dona equipamiento, ¿verdad?",
        "start": 4560.46,
        "end": 4563.46
    },
    {
        "text": " Para construir un centro de estudios para el tratamiento de aguas.",
        "start": 4563.46,
        "end": 4568.46
    },
    {
        "text": " Donaciones que se realizan.",
        "start": 4572.46,
        "end": 4575.46
    },
    {
        "text": " Si es franmenores.",
        "start": 4578.46,
        "end": 4580.46
    },
    {
        "text": " Por tanto, de la cuenta corriente establecemos tres grandes saldos parciales.",
        "start": 4580.46,
        "end": 4585.46
    },
    {
        "text": " El saldo de la balanza comercial.",
        "start": 4585.46,
        "end": 4589.46
    },
    {
        "text": " ¿Qué corresponde al neto de expo de import?",
        "start": 4589.46,
        "end": 4593.46
    },
    {
        "text": " El RX, la remunación neta de factores productivos con exterior,",
        "start": 4593.46,
        "end": 4598.46
    },
    {
        "text": " ¿qué corresponde a las rentas cobradas menos las rentas pagadas?",
        "start": 4598.46,
        "end": 4602.46
    },
    {
        "text": " Y al neto de las transferencias.",
        "start": 4602.46,
        "end": 4606.46
    },
    {
        "text": " Yo puedo ahora agregar estos tres saldos",
        "start": 4606.46,
        "end": 4610.46
    },
    {
        "text": " y preguntarme ahora cuál es el saldo de toda la cuenta corriente.",
        "start": 4610.46,
        "end": 4617.46
    },
    {
        "text": " Agregar en términos de edición, ¿verdad?",
        "start": 4617.46,
        "end": 4620.46
    },
    {
        "text": " Por lo tanto, podré plantear, ¿puedo plantear el saldo de la cuenta corriente?",
        "start": 4620.46,
        "end": 4626.46
    },
    {
        "text": " Y este saldo de toda la cuenta corriente será el saldo de la balanza comercial,",
        "start": 4626.46,
        "end": 4634.46
    },
    {
        "text": " más el RX, más las transferencias netas corrientes.",
        "start": 4634.46,
        "end": 4640.46
    },
    {
        "text": " Ahí al final dice transferencias netas corrientes, me quedo medio chiquituba.",
        "start": 4640.46,
        "end": 4645.46
    },
    {
        "text": " Miren cómo vamos levantando la mirada ahora decimos,",
        "start": 4648.46,
        "end": 4651.46
    },
    {
        "text": " el saldo de la cuenta corriente de la balanza de pagos será la suma del saldo de la balanza comercial,",
        "start": 4651.46,
        "end": 4660.46
    },
    {
        "text": " más el RX, más las transferencias netas corrientes.",
        "start": 4660.46,
        "end": 4664.46
    },
    {
        "text": " No necesariamente tener un déficit comercial con el mundo",
        "start": 4664.46,
        "end": 4670.46
    },
    {
        "text": " ahora que tengamos un saldo de la cuenta corriente de visitario.",
        "start": 4670.46,
        "end": 4675.46
    },
    {
        "text": " Miren lo que acabo de decir, no necesariamente, en términos teóricos,",
        "start": 4675.46,
        "end": 4681.46
    },
    {
        "text": " tener un déficit comercial con el mundo,",
        "start": 4681.46,
        "end": 4685.46
    },
    {
        "text": " no necesariamente hará que tengamos un déficit en cuenta corriente,",
        "start": 4686.46,
        "end": 4691.46
    },
    {
        "text": " en la balanza de pagos, porque el saldo de la cuenta corriente puede ser hasta superabitario,",
        "start": 4691.46,
        "end": 4697.46
    },
    {
        "text": " siempre y cuando que debería estar pasando con estos dos componentes.",
        "start": 4699.46,
        "end": 4702.46
    },
    {
        "text": " Su mao sean positivos, ¿verdad?",
        "start": 4702.46,
        "end": 4705.46
    },
    {
        "text": " Vamos a suponer como dice la ficha por ahí, que por simplecía las transferencias de esta corriente son cero.",
        "start": 4705.46,
        "end": 4709.46
    },
    {
        "text": " Bien, este debe ser positivo, ¿verdad?",
        "start": 4710.46,
        "end": 4712.46
    },
    {
        "text": " La RX.",
        "start": 4712.46,
        "end": 4713.46
    },
    {
        "text": " Positivo es más grande, está bien, teoricamente, ¿no?",
        "start": 4713.46,
        "end": 4716.46
    },
    {
        "text": " Estamos jugando con números, por ejemplo, que es ellos, más 70, menos 20,",
        "start": 4716.46,
        "end": 4723.46
    },
    {
        "text": " más 50 o no, más 0.",
        "start": 4723.46,
        "end": 4727.46
    },
    {
        "text": " En este caso, si miramos un trimestre tenemos, ¿no?",
        "start": 4729.46,
        "end": 4733.46
    },
    {
        "text": " El periodista irá, bien, la economía Uruguay ha presentado un déficit comercial con el mundo,",
        "start": 4733.46,
        "end": 4737.46
    },
    {
        "text": " ¿verdad? El valor de la sim por creció más de lo que creció en la SXPOR,",
        "start": 4738.46,
        "end": 4742.46
    },
    {
        "text": " ese déficit, ¿no?",
        "start": 4742.46,
        "end": 4744.46
    },
    {
        "text": " Fue compensado con una remuneración neta de factores productivos exterior superabitario,",
        "start": 4744.46,
        "end": 4749.46
    },
    {
        "text": " que hizo que o explicó que el saldo de la cuenta corriente en ese periodo sea superabitario.",
        "start": 4749.46,
        "end": 4754.46
    },
    {
        "text": " Por tanto, un déficit comercial, en este caso, no hay ningún problema.",
        "start": 4754.46,
        "end": 4758.46
    },
    {
        "text": " Bien, en países como Uruguay donde ya salís con un negativo,",
        "start": 4762.46,
        "end": 4766.46
    },
    {
        "text": " de las rentas, donde está, esto no importa, con un negativo de las rentas, de 70,",
        "start": 4767.46,
        "end": 4773.46
    },
    {
        "text": " si todavía tenés un déficit comercial y las transferencias corrientes son cero,",
        "start": 4773.46,
        "end": 4778.46
    },
    {
        "text": " vamos a darle chiquita G, ¡ah bueno, acá se complicó!",
        "start": 4778.46,
        "end": 4782.46
    },
    {
        "text": " Vamos, vamos a hacer con menos chancho, esto está siendo...",
        "start": 4782.46,
        "end": 4784.46
    },
    {
        "text": " Ah bueno, acá se complicó, tengo menos 90,",
        "start": 4786.46,
        "end": 4789.46
    },
    {
        "text": " acá sí el déficit comercial es complicado, porque profundiza junto con el déficit de las rentas,",
        "start": 4790.46,
        "end": 4797.46
    },
    {
        "text": " profundiza un déficit en cuenta corriente, alguien hablaba, ¡ah bueno, pero el déficit comercial",
        "start": 4797.46,
        "end": 4804.46
    },
    {
        "text": " no es malo siempre y cuando tenga financiamiento se pueda financiar,",
        "start": 4804.46,
        "end": 4807.46
    },
    {
        "text": " acá no lo están financiando las rentas,",
        "start": 4807.46,
        "end": 4810.46
    },
    {
        "text": " por lo tanto habrá que ver qué pasa con la cuenta capital y financiera que no presente nada todavía.",
        "start": 4810.46,
        "end": 4818.46
    },
    {
        "text": " Estoy adelantando, ¿verdad?",
        "start": 4818.46,
        "end": 4820.46
    },
    {
        "text": " Pero esta situación, eso es tenible, ¿sí?",
        "start": 4822.46,
        "end": 4827.46
    },
    {
        "text": " Me adelanto, para la clase que viene, mientras en la cuenta capital,",
        "start": 4828.46,
        "end": 4832.46
    },
    {
        "text": " yo tengo ingreso de capital, ¿es suficiente que compensen este déficit, verdad?",
        "start": 4832.46,
        "end": 4837.46
    },
    {
        "text": " Porque si por cuenta capital, me ingresan capitales que no presenten mucho todavía,",
        "start": 4837.46,
        "end": 4842.46
    },
    {
        "text": " son titulares para la clase que viene, me ingresan capitales,",
        "start": 4842.46,
        "end": 4846.46
    },
    {
        "text": " espero que no compensan este déficit,",
        "start": 4846.46,
        "end": 4850.46
    },
    {
        "text": " en ese periodo del país perderá la diferencia, la diferencia en resarros.",
        "start": 4850.46,
        "end": 4855.46
    },
    {
        "text": " Estoy adelantando a cosas que hemos hablado la clase que viene, ¿verdad?",
        "start": 4856.46,
        "end": 4859.46
    },
    {
        "text": " A temas que vamos a estar presentando la sesión próxima.",
        "start": 4859.46,
        "end": 4863.46
    },
    {
        "text": " Urices, quiero dejar acá, no me quiero meter en cuenta capital por un tema de tiempo,",
        "start": 4864.46,
        "end": 4869.46
    },
    {
        "text": " a ver, antes de irnos, de la cuenta corriente estamos como cerrando la presentación, ¿verdad?",
        "start": 4869.46,
        "end": 4875.46
    },
    {
        "text": " No hemos hecho presentación de la cuenta capital, yo les invito a mirar la ficha,",
        "start": 4875.46,
        "end": 4879.46
    },
    {
        "text": " porque vamos a volver a tener clase en nosotros, el miércoles recién próximo,",
        "start": 4879.46,
        "end": 4884.46
    },
    {
        "text": " porque el viernes, por razones obvia, ¿verdad?",
        "start": 4884.46,
        "end": 4887.46
    },
    {
        "text": " Tenemos fecha patria de la declaratoria de independencia, ¿no?",
        "start": 4887.46,
        "end": 4891.46
    },
    {
        "text": " Bueno, por tanto, nos vamos a volver a ver el miércoles que viene",
        "start": 4893.46,
        "end": 4897.46
    },
    {
        "text": " y cerraremos balanza de pao, si nos adentraremos en indicadores de la actividad económica",
        "start": 4897.46,
        "end": 4902.46
    },
    {
        "text": " y ahí, medio que iremos cerrando el curso.",
        "start": 4902.46,
        "end": 4905.46
    }
]