[
    {
        "text": " Y ya empiezó mientras borro preguntándoles de conos, por lo menos recuerdan de galuno,",
        "start": 0.0,
        "end": 7.68
    },
    {
        "text": " gal 2 algo de práctico, de teórico, lo que me digan está bien.",
        "start": 7.68,
        "end": 11.96
    },
    {
        "text": " Conos, conos.",
        "start": 11.96,
        "end": 17.16
    },
    {
        "text": " No sé, la Paki vino en algo, sí seguro que vieron en cincenio en Calculo 3 el cono, el conotípico,",
        "start": 17.16,
        "end": 28.64
    },
    {
        "text": " no es la de cuasión del cono, eso sí, ¿no verdad? Pero eso es el Calculo 3, o el Calculo 2,",
        "start": 28.64,
        "end": 34.32
    },
    {
        "text": " capaz que también, no sé, pero por ejemplo, en ejercicio de baldos, nada, nada.",
        "start": 34.32,
        "end": 46.96
    },
    {
        "text": " ¿No? No, no, no, no, no, que se recuerden así en un práctico, algo, sí, no es, ¿no?",
        "start": 46.96,
        "end": 57.96
    },
    {
        "text": " En Calculo 3, la cortado, así, la área, o cortazas así con plano, que te queda",
        "start": 58.52,
        "end": 64.24
    },
    {
        "text": " y calcula el interior, el calculado de volumen, esa cosa, ¿no?",
        "start": 64.24,
        "end": 71.04
    },
    {
        "text": " O le ponen al cono como derrotación y le buscan.",
        "start": 71.04,
        "end": 75.04
    },
    {
        "text": " Entonces, la clase de hoy, conos.",
        "start": 75.04,
        "end": 94.68
    },
    {
        "text": " Lo que estamos empezando es el capítulo 3, que son la clase hoy y espero que 2 más y nada",
        "start": 94.68,
        "end": 111.64000000000001
    },
    {
        "text": " más, porque quiero dejar espacio para grafos y el capítulo 3 lo que tiene es el tenemos",
        "start": 111.64000000000001,
        "end": 117.48
    },
    {
        "text": " de Perron Frobenius, pero el tema de Perron Frobenius, digamos que necesita una previa que",
        "start": 117.48,
        "end": 128.52
    },
    {
        "text": " esto está aparte de iconos, por lo menos en la presentación del libro. Hay otras formas",
        "start": 128.52,
        "end": 133.12
    },
    {
        "text": " de demostrar Perron Frobenius, pero a mí me quiero seguir el libro porque es el libro",
        "start": 133.12,
        "end": 136.92000000000002
    },
    {
        "text": " de referencia, más me gustó la línea de trabajo. De hecho, el libro mismo dice que lo que",
        "start": 136.92000000000002,
        "end": 144.0
    },
    {
        "text": " propone con este estudio de iconos es como una generalización del famoso Perron Frobenius,",
        "start": 144.0,
        "end": 148.8
    },
    {
        "text": " una versión un poquito más general, pero que nosotros la podemos entender. Entonces,",
        "start": 148.8,
        "end": 156.56
    },
    {
        "text": " que vamos a hacer la de esa manera. Entonces, que es un cono, empecemos con ese tema. Bueno,",
        "start": 156.56,
        "end": 173.96
    },
    {
        "text": " ahí está, primero que nada antes de empezar con eso, yo le voy a escribir el tema de Perron",
        "start": 173.96,
        "end": 180.24
    },
    {
        "text": " Frobenius, pero simplemente como este es el objetivo del capítulo, el famoso Perron Frobenius.",
        "start": 180.24,
        "end": 189.68
    },
    {
        "text": " Por ahí leí que había un tercer autor posible al judicatario del tema, pero no me acuerdo.",
        "start": 194.88,
        "end": 200.0
    },
    {
        "text": " Entonces, si tienes una matrizada, de hecho, R, los que tienen R, entra en los negativas,",
        "start": 200.72,
        "end": 213.96
    },
    {
        "text": " o sea que todas las entradas son cero o positivas. Alexandra, la que ¿cómo estás usted?",
        "start": 213.96,
        "end": 224.76000000000002
    },
    {
        "text": " Entonces, lo que dice el tema del Perron Frobenius, el famoso tema, es mío con lo que",
        "start": 231.36,
        "end": 240.68
    },
    {
        "text": " tiene que ver, es que el tema del Perron es que tiene que ver, pero lo podemos entender, ya es",
        "start": 240.68,
        "end": 251.36
    },
    {
        "text": " valor propio, de A, primero, y a ver si les suena conocido y acepta un vector propio, bueno,",
        "start": 251.36,
        "end": 269.4
    },
    {
        "text": " si es valor propio, acepta un vector propio, obvio, hasta acá no dije nada nuevo,",
        "start": 269.4,
        "end": 275.79999999999995
    },
    {
        "text": " de entradas, de coordenadas, de entradas o coordenadas, como quieran ponerle, no negativos.",
        "start": 279.08,
        "end": 285.47999999999996
    },
    {
        "text": " De vuelta aparece un teorema en donde la parte sustancial es el final este, ¿no?",
        "start": 286.76,
        "end": 295.28
    },
    {
        "text": " Se acuerdan el otro que habíamos visto, un teorema que decía que hemos discutido,",
        "start": 295.28,
        "end": 301.32
    },
    {
        "text": " incluso la última clase apareció, porque Michael ha preguntado cuando terminó la clase y",
        "start": 301.32,
        "end": 309.11999999999995
    },
    {
        "text": " Santiago y recordamos que varias veces en Ignacio, en Hacho pregunta lo mismo, o destaca lo mismo,",
        "start": 309.11999999999995,
        "end": 315.84
    },
    {
        "text": " mejor dicho, aquel teorema que sí, que si la matriz de comparación tiene día un",
        "start": 315.84,
        "end": 322.0
    },
    {
        "text": " aluminante, entonces existe una solución de la ecuación BX igual y donde E tiene entradas",
        "start": 322.0,
        "end": 329.68
    },
    {
        "text": " mayor y igual que 0, B es una matriz de comparación con sus hipótesis, etcétera, donde la X,",
        "start": 329.68,
        "end": 336.12
    },
    {
        "text": " entonces siempre se ha antiguo y se no, a ver, B, B o Nacho, decía B es una aluminante,",
        "start": 336.12,
        "end": 342.24
    },
    {
        "text": " es invertible y por lo tanto tiene solución, pero lo distinto era que el X era mayor y igual",
        "start": 344.24,
        "end": 349.8
    },
    {
        "text": " que sea, ¿de acuerdo? Bueno, esta es la misma, acá lo distinto es que el vector propio tiene",
        "start": 349.8,
        "end": 356.52000000000004
    },
    {
        "text": " el trazo negativo, ¿no? Y eso tiene un montón de aplicaciones, en teoría de la FOD de un montón",
        "start": 356.52000000000004,
        "end": 362.0
    },
    {
        "text": " de la F, así como vimos aplicaciones de economía de aquellos resultados de un aluminante. Este es el",
        "start": 362.0,
        "end": 368.76
    },
    {
        "text": " famoso teorema que usaron en su origen, los de Google para el país rank y todo eso, ¿no?",
        "start": 368.76,
        "end": 373.68
    },
    {
        "text": " El teorema de Perron proven. Esta es una versión, ahora la hipótesis, ya lo hemos dicho muchas",
        "start": 373.68,
        "end": 381.52
    },
    {
        "text": " veces, apareció también en el, cuando yo coloque aquel ejercicio extra en el práctico 2,",
        "start": 381.52,
        "end": 387.96000000000004
    },
    {
        "text": " creo que fue y que Nico dijo no, el paper que yo leí era que tenía atrás no negativa,",
        "start": 387.96000000000004,
        "end": 394.2
    },
    {
        "text": " o en traspositiva, algo así, la matriz, entonces lo que pasa es que en los modelos económicos,",
        "start": 394.2,
        "end": 401.72
    },
    {
        "text": " en los modelos reales, de poblaciónal, biológicos, incluso también podemos pesar de",
        "start": 401.72,
        "end": 407.12
    },
    {
        "text": " de page rank, todo eso, porque vamos a mirarlos enlace que tienen, que, ¿dónde fue esta alguna vez?",
        "start": 407.12,
        "end": 414.04
    },
    {
        "text": " Entonces, son positivos, o bien la enteoria de grafos, vas a pensar en grafos,",
        "start": 414.04,
        "end": 421.28000000000003
    },
    {
        "text": " Aristas que están conectadas, porque si no están conectadas con todo el resto del grafón,",
        "start": 421.28000000000003,
        "end": 427.0
    },
    {
        "text": " o entonces son otros grafos, o puedes pensar que los grafos que están usando se conectan.",
        "start": 427.0,
        "end": 432.0
    },
    {
        "text": " Entonces, esta proposición en traspositiva, o en traspositiva, hay una versión con perrofrogón",
        "start": 432.0,
        "end": 441.04
    },
    {
        "text": " y con en traspositiva y otra versión con en traspositiva, se adapta perfectamente a la",
        "start": 441.04,
        "end": 449.2
    },
    {
        "text": " vida real. Ahora que pasa, y acá yo lo estoy diciendo todo esto, no solamente para",
        "start": 449.2,
        "end": 454.76
    },
    {
        "text": " ese introducional al capítulo, sino por el que quiere introducir conos. Ahora que pasa,",
        "start": 454.76,
        "end": 459.59999999999997
    },
    {
        "text": " y acá aparece los conos. Si vos tenés una matriz que tienen trabas non negativas,",
        "start": 459.59999999999997,
        "end": 470.76
    },
    {
        "text": " yo digo que esto es equivalente, que la matriz tenga trabas non negativa, que este conjunto,",
        "start": 475.03999999999996,
        "end": 481.96
    },
    {
        "text": " que es el cono canónico, para algeo alinial, canónico, canónico de cálculo 3, etcétera,",
        "start": 482.84,
        "end": 495.15999999999997
    },
    {
        "text": " de la imagen que estoy disamble, esos conos de cálculo 3 y cálculo 2 también serán conos",
        "start": 495.15999999999997,
        "end": 499.47999999999996
    },
    {
        "text": " aquí, pero este es el cono canónico de algeo alinial, son los vectores de RN, piensen en el",
        "start": 499.47999999999996,
        "end": 509.2
    },
    {
        "text": " R2 o en el R3, donde todas sus coordenadas son positivas y se acuerdan en no negativas,",
        "start": 509.2,
        "end": 515.04
    },
    {
        "text": " te culpa, se acuerdan esta notación, no tengo nada porque, bueno, por lo repaso,",
        "start": 515.04,
        "end": 520.88
    },
    {
        "text": " el X1 mayor va alquecero, el X2 mayor va alquecero, el Xn mayor va alquecero,",
        "start": 520.88,
        "end": 525.48
    },
    {
        "text": " es un cono lineal, entonces fíjense que la matriz es no negativa, si solamente si este",
        "start": 525.48,
        "end": 534.16
    },
    {
        "text": " cono, el cono clásico anónico de algeo alinial, de vectores no negativos, así se llama,",
        "start": 534.16,
        "end": 541.36
    },
    {
        "text": " ¿Qué pasa cuando vos haces aporca?",
        "start": 548.0799999999999,
        "end": 552.12
    },
    {
        "text": " Ah, a esa entra, cuando se es aporca que pasa, con esta de entrada negativa,",
        "start": 552.12,
        "end": 564.92
    },
    {
        "text": " ¿Qué pasa?",
        "start": 564.92,
        "end": 573.04
    },
    {
        "text": " ¿Claro?",
        "start": 573.04,
        "end": 576.04
    },
    {
        "text": " Entonces, ahora recíproco, si vos tienes una matriz que multiplicas por cualquier",
        "start": 576.04,
        "end": 585.52
    },
    {
        "text": " vector de entrada en no negativa, si te queda vector de entrada en no negativa,",
        "start": 585.52,
        "end": 588.8
    },
    {
        "text": " tanto de acuerdo que la matriz de entrada en no negativa, porque si tuviera alguna",
        "start": 588.8,
        "end": 593.8
    },
    {
        "text": " negativa, estoy seguro que ustedes ya van a imaginar cómo ubican un vector cito para",
        "start": 593.8,
        "end": 600.8
    },
    {
        "text": " aprovechar esa negativa y que el resultado de negativo, se dan cuenta, esa hay que ser",
        "start": 600.8,
        "end": 607.52
    },
    {
        "text": " un poquito más de cuenta, ¿no? Pero imagínense una matriz que tiene una entrada no negativa,",
        "start": 607.52,
        "end": 614.0
    },
    {
        "text": " entonces se agarran, seguros que van a encontrar un vector donde todo positivo, o en el",
        "start": 614.0,
        "end": 619.76
    },
    {
        "text": " positivo, incluso, donde le ponen en esa coordenada justo, si es la yesima, digamos, ponen",
        "start": 619.76,
        "end": 626.0
    },
    {
        "text": " el que está en la matriz, en la primer fila, en el lugar y esim, digo, en la primer",
        "start": 626.0,
        "end": 630.72
    },
    {
        "text": " fila no importa, es para imaginarlo, ¿no? Entonces, agarran un vector que en la coordenada",
        "start": 630.72,
        "end": 635.36
    },
    {
        "text": " y esim, así anormemente grande y en las otras, toseros y querer, y el producto te va",
        "start": 635.36,
        "end": 642.28
    },
    {
        "text": " a quedar algo que no es mayor igual que ser, ¿cierto? Entonces, si vos realmente siempre",
        "start": 642.28,
        "end": 648.8
    },
    {
        "text": " te quedas adentro, es porque esto es un cicio y lo sí, ¿no? Esto podría ser un ejercicio,",
        "start": 648.8,
        "end": 655.76
    },
    {
        "text": " ¿no? Para que le pongo ejercicio, pero aquí, un arma, el practico, pero ya tengo como",
        "start": 655.76,
        "end": 658.2
    },
    {
        "text": " siete, voy a poner este también. En el practico 8, ¿no? El ejercicio practico 8,",
        "start": 658.2,
        "end": 665.64
    },
    {
        "text": " acabo de decidir ponerlo, va a ser el ejercicio 1, digo sobre todo para lo que no está en el",
        "start": 665.64,
        "end": 671.56
    },
    {
        "text": " clase, esa es la razón por las cuales se estudian los conos, ¿no? Y ahora voy a dar la",
        "start": 671.56,
        "end": 681.92
    },
    {
        "text": " definición de cono general, pero yo les pregunto este conjunto, que es el cono canónico,",
        "start": 681.92,
        "end": 689.16
    },
    {
        "text": " el cono prototípico que nos va a dar la definición general. Primero, primer condición, agarrados",
        "start": 689.16,
        "end": 697.7199999999999
    },
    {
        "text": " vectores acá, se va, agarrados vectores acá, sumálos, ¿qué pasa? Perfecto, muy bien,",
        "start": 697.72,
        "end": 710.28
    },
    {
        "text": " Nico, agarrar a un vectore acá es multiplicado por una alfa mayor igual que cero. Bien, agarrar",
        "start": 710.28,
        "end": 718.9200000000001
    },
    {
        "text": " una sucesión de puntos acá, una sucesión de puntos, de vectores, o mirar los puntos",
        "start": 718.92,
        "end": 728.56
    },
    {
        "text": " extremos, que converge, digamos, en el red, ¿no? Una sucesión convergente, ¿qué pasa",
        "start": 728.56,
        "end": 733.68
    },
    {
        "text": " con el límite? Es un poquito más difícil, pero usted es buena. Es una sucesión de puntos,",
        "start": 733.68,
        "end": 742.0
    },
    {
        "text": " todos recorden más que cero, ¿qué converge? ¿Qué converge? ¿Vos tenés el hipótesis",
        "start": 742.0,
        "end": 745.24
    },
    {
        "text": " que converge? El límite donde está. ¿Por qué? Si la sucesión de puntos de reen",
        "start": 745.24,
        "end": 756.28
    },
    {
        "text": " converge, cada coordenada converge a su coordenada, correspondiente, ¿no? ¿no? ¿verdad?",
        "start": 756.28,
        "end": 762.4
    },
    {
        "text": " Pero cómo son todas las coordenadas, ponerle la primera coordenada, ¿cómo son todas",
        "start": 762.4,
        "end": 765.2
    },
    {
        "text": " en la sucesión? Estaba mayor igual que cero, la primera coordenada. Entonces, el límite,",
        "start": 765.2,
        "end": 773.2
    },
    {
        "text": " que estás en los reales ahora, el límite es mayor igual que cero. Tienes la segunda coordenada,",
        "start": 773.2,
        "end": 779.32
    },
    {
        "text": " tienes una sucesión de puntos, de vectores, todas las segundas coordenadas son todas",
        "start": 779.32,
        "end": 783.7
    },
    {
        "text": " mayor igual que cero, pues están todas en C, ¿verdad? El límite es mayor igual que cero.",
        "start": 783.7,
        "end": 789.36
    },
    {
        "text": " Entonces quiere decir que el límite de puntos, de una sucesión converge, eso es como",
        "start": 789.36,
        "end": 794.0
    },
    {
        "text": " se dice en tu pollojía, Alexandra. Cerrado, es un conjunto, es un conjunto. Entonces,",
        "start": 794.0,
        "end": 800.12
    },
    {
        "text": " tenés, cerrado por la suma, cerrado por el producto con escalares mayores igual que cero,",
        "start": 800.12,
        "end": 808.24
    },
    {
        "text": " y cerrado, cerrado topológicamente, ¿no? Es un conjunto cerrado. Esas son las tres cosas",
        "start": 808.24,
        "end": 813.64
    },
    {
        "text": " para que sea un cono. Ahora voy a escribir la definición. Pero este cono prototípico,",
        "start": 813.64,
        "end": 818.96
    },
    {
        "text": " en realidad, tiene dos propiedades más que tienen apellidos en la definición que viene",
        "start": 818.96,
        "end": 826.04
    },
    {
        "text": " ahora el cono tiene apellido, sólido y propio. Y este, verifica todas, con cono sólido",
        "start": 826.04,
        "end": 833.7199999999999
    },
    {
        "text": " y propio. Sólido es que tiene interior, interior que es lo mismo que en el cálculo 2,",
        "start": 833.7199999999999,
        "end": 842.12
    },
    {
        "text": " en el cálculo 3, que es el interior. Un punto es interior, a un conjunto cuando que.",
        "start": 842.12,
        "end": 847.5999999999999
    },
    {
        "text": " Esa es exactamente la definición de un cono se ha solido al casa, que sea un punto",
        "start": 847.6,
        "end": 858.6800000000001
    },
    {
        "text": " interior. Claro, si hay un punto interior, hay infinito puntos interior, esto a la abuela",
        "start": 858.6800000000001,
        "end": 863.08
    },
    {
        "text": " está dentro. Muy bien. Entonces, eso que es un, este solido. Tás clarísimo,",
        "start": 863.08,
        "end": 868.6800000000001
    },
    {
        "text": " además corresponde al concepto solido que tiene, que tiene que no es solida la frontera,",
        "start": 868.6800000000001,
        "end": 874.32
    },
    {
        "text": " no es la cacar. Y además es propio, ese es el otro pellido que vamos a definir ahora.",
        "start": 874.32,
        "end": 880.72
    },
    {
        "text": " Propio es, si voto más cá, por un lado y menos cá, por otro. Imagina el cono que",
        "start": 880.72,
        "end": 887.6
    },
    {
        "text": " quieras, el de cálculo 3, este, la imagen que tenga el cono. Tienes un cono y tenés",
        "start": 887.6,
        "end": 895.6
    },
    {
        "text": " el opuesto, ¿no verdad? Menos cá. ¿Qué pasa con la intercisión?",
        "start": 895.6,
        "end": 898.6
    },
    {
        "text": " No, no es el de ser. Solo el electro nublo. Eso que sea propio. Cuando el cono y su opuesto",
        "start": 898.6,
        "end": 907.4
    },
    {
        "text": " solo se tocan en el nublo. Y este lo tiene todas. Bueno, vamos a poner esas definiciones,",
        "start": 907.4,
        "end": 913.64
    },
    {
        "text": " vamos a poner la definición de cono, solido y propio. Son definiciones generales, pero",
        "start": 913.64,
        "end": 918.9200000000001
    },
    {
        "text": " este es nuestro ejemplo prototípico, ¿no? Un ejemplo se dice prototípico, cuando",
        "start": 918.9200000000001,
        "end": 924.32
    },
    {
        "text": " es el que te modela el concepto posterior, eso digo en general en matemática. No",
        "start": 924.32,
        "end": 929.36
    },
    {
        "text": " suele las mantener esto. En matemática los ejemplos prototípicos son esenciales. ¿Por",
        "start": 929.36,
        "end": 936.5200000000001
    },
    {
        "text": " qué? Porque son lo que te permiten pensar la matemática en ejemplos y tener el modelo",
        "start": 936.5200000000001,
        "end": 942.5600000000001
    },
    {
        "text": " para saber si va a seguir, no siempre existen modelos prototípicos, pero encontrar modelos",
        "start": 942.5600000000001,
        "end": 946.9200000000001
    },
    {
        "text": " prototípicos es muy importante para poder desarrollar una teoría. Encontrar ejemplos,",
        "start": 946.9200000000001,
        "end": 953.32
    },
    {
        "text": " es importante, pero ejemplo prototípico, masa. Entonces, definición. Estamos en el reine,",
        "start": 953.32,
        "end": 978.8000000000001
    },
    {
        "text": " vamos a trabajar en el reine, porque de hecho toda esta teoría nos va a interesar en el",
        "start": 978.8,
        "end": 984.56
    },
    {
        "text": " reine. Y tenemos K, ves el espacio historial, K adentro de B, un conjunto. Pongámele",
        "start": 984.56,
        "end": 1000.52
    },
    {
        "text": " no vacío, porque no tiene sentido pensar en lo vacío. ¿Tres condiciones? ¿Qué",
        "start": 1000.52,
        "end": 1008.16
    },
    {
        "text": " casi ha cerrado en el reine? O sea, que contiene su frontera, por ejemplo, esa es una forma",
        "start": 1008.16,
        "end": 1019.92
    },
    {
        "text": " de si que he cerrado, o que el límite de todas sus sesiones de puntos de K que converge",
        "start": 1019.92,
        "end": 1024.84
    },
    {
        "text": " está dentro de K. Dos, este, K ha cerrado por la suma, o sea, que K más K, que más,",
        "start": 1024.84,
        "end": 1033.84
    },
    {
        "text": " es el más del espacio historial, el más de reine, está incluido en K, tres, que alpha",
        "start": 1033.84,
        "end": 1044.1599999999999
    },
    {
        "text": " por K, este, este incluido en K, para todo alpha, mayor igual que 0, alpha perteneciente",
        "start": 1044.16,
        "end": 1056.24
    },
    {
        "text": " de N, ¿no? Los incluidos son amplios, si quieren le pongo la barra de amplio para que nadie",
        "start": 1056.24,
        "end": 1061.8400000000001
    },
    {
        "text": " diga en inclusión estricta, sí, incluido amplio. O esas son las tres condiciones para que",
        "start": 1061.8400000000001,
        "end": 1069.76
    },
    {
        "text": " este un colo. Entonces, acá tenemos definición de colo, y ahora le vamos a poner los",
        "start": 1069.76,
        "end": 1078.64
    },
    {
        "text": " apellidos, vamos a poner sólido, o sea, con o de apellido sólido, si, casero, no es vacío,",
        "start": 1078.64,
        "end": 1096.48
    },
    {
        "text": " casero es el interior de K. El interior de K ha pensado en el reine, por supuesto,",
        "start": 1096.48,
        "end": 1114.24
    },
    {
        "text": " porque claro, si vos cambias el espacio, no está trabajando, puede cambiar el interior.",
        "start": 1114.24,
        "end": 1124.44
    },
    {
        "text": " Los conos de K de culo, y no son sólidos, si está pensando sin la partida dentro, el",
        "start": 1124.44,
        "end": 1132.56
    },
    {
        "text": " cucurucho de la helado solo, no es sólido.",
        "start": 1132.56,
        "end": 1137.0800000000002
    },
    {
        "text": " ¿No, pero pensan a un por así poner con la base de arriba a hígoles que tienen transinatios?",
        "start": 1137.0800000000002,
        "end": 1146.0
    },
    {
        "text": " Ah, sí, sí, el por lo que está apuntando para cualquier lado, lo que pasa es que el dibujo",
        "start": 1146.0,
        "end": 1152.16
    },
    {
        "text": " escanoónico, el cono, podemos tener problemas, primero que nada que tiene que ser infinito,",
        "start": 1152.16,
        "end": 1160.0800000000002
    },
    {
        "text": " porque si no él sale la helfa, no puede parar. Y segundo, para adaptarnos a la definición",
        "start": 1160.0800000000002,
        "end": 1168.48
    },
    {
        "text": " en este modelo, tiene que ser sólido, porque si yo agarró este vector, vamos a dibujar",
        "start": 1168.48,
        "end": 1173.64
    },
    {
        "text": " el otro color, este vector poner y este vector la suma te va a quedar para acá dentro,",
        "start": 1173.64,
        "end": 1181.92
    },
    {
        "text": " ¿no? Entonces, ¿quién es que este vector este? Por lo tanto, tiene que ser sólido, sino",
        "start": 1181.92,
        "end": 1185.6000000000001
    },
    {
        "text": " no, ni siquiera conos, o sea, tiene que ser con toda la interior para que sea un cono.",
        "start": 1185.6000000000001,
        "end": 1190.92
    },
    {
        "text": " En ese modelo de dibujo que tenemos de K3, no digo esa, no más. Y si pueden tener",
        "start": 1190.92,
        "end": 1202.6000000000001
    },
    {
        "text": " los verbectores negativos, verbectores negativos pueden tener, porque este mismo lo hace esa",
        "start": 1202.6,
        "end": 1207.08
    },
    {
        "text": " punta para allá o para abajo, sigue siendo con eso. Lo que te dice es esta, es que si hay",
        "start": 1207.08,
        "end": 1214.6799999999998
    },
    {
        "text": " un vector y lo motetizás, no para el otro lado, lo alargaso, lo ha chicas, tienen que",
        "start": 1214.6799999999998,
        "end": 1222.3999999999999
    },
    {
        "text": " estar todos dentro de el cono, que es la imagen de cono, ¿no? Bueno y el otro a pesar de",
        "start": 1222.3999999999999,
        "end": 1228.1999999999998
    },
    {
        "text": " que nos falta conos, ¿cuál nos falta? El cono propio. Cono propio, psica intersección,",
        "start": 1228.2,
        "end": 1246.66
    },
    {
        "text": " menos K, me da solo el vector nulo. Se tiene lo que es menos K, ¿no? Es el cono que tiene",
        "start": 1246.66,
        "end": 1258.78
    },
    {
        "text": " todos los opuestos acá. Y este modelo ponga lo por favor, ahí en el cual no, el modelo,",
        "start": 1258.78,
        "end": 1270.66
    },
    {
        "text": " este es todo, ¿no? Es conos, sol y propio, es un modelo prototípico que tiene todos los",
        "start": 1270.66,
        "end": 1276.22
    },
    {
        "text": " apellidos posible, todo el linaje tiene, el linaje de todos los apellidos. Bueno, muy bien.",
        "start": 1276.22,
        "end": 1288.7
    },
    {
        "text": " Entonces eso es la definición, creo que no me falta nada en principio, y vamos a dar,",
        "start": 1288.7,
        "end": 1295.22
    },
    {
        "text": " bueno, el cono positivo es que se llama cono positivo, es el primer ejemplo, así se llama",
        "start": 1295.22,
        "end": 1305.38
    },
    {
        "text": " el cono positivo, obvio porque se llama cono positivo, entonces claro que es cono, como",
        "start": 1305.38,
        "end": 1313.18
    },
    {
        "text": " el gimnasienes sólido y es propio. Ok, ese es el primer ejemplo. De dentro de reine,",
        "start": 1313.18,
        "end": 1323.8200000000002
    },
    {
        "text": " ¿no? Vamos a otro ejemplo. Este segundo ejemplo con chachos es sencillo pero la vez muy interesante.",
        "start": 1323.8200000000002,
        "end": 1332.46
    },
    {
        "text": " Entonces el imino esto queda la parte de por qué no vamos hacia los conos.",
        "start": 1332.46,
        "end": 1341.6200000000001
    },
    {
        "text": " Este es el segundo ejemplo.",
        "start": 1353.46,
        "end": 1355.22
    },
    {
        "text": " Tienes una transformación lineal de BMW por la duda, el V es el que estamos trabajando",
        "start": 1362.46,
        "end": 1380.14
    },
    {
        "text": " como el reine, el espacio victoria y tenés un colo. Entonces dice el ejemplo 2,",
        "start": 1380.14,
        "end": 1391.22
    },
    {
        "text": " que lo puse como ejercicio del práctico 8, pero igual lo vamos a hacer por lo menos",
        "start": 1395.22,
        "end": 1401.8600000000001
    },
    {
        "text": " sobrealmente vamos a razonar por qué. Tiene la minus 1 de cada colo, que es este de la minus 1",
        "start": 1401.8600000000001,
        "end": 1407.7
    },
    {
        "text": " de cada colo, porque yo no dije que la transformación fuera bisectiva, invertible ¿no?",
        "start": 1407.7,
        "end": 1412.74
    },
    {
        "text": " ¿Qué es este? La primera gena y vas, en aquello V, pertenece a V, tal que T debe,",
        "start": 1412.74,
        "end": 1427.5
    },
    {
        "text": " pertenece acá, la primera gena acá, ¿no? Bueno eso es un cono, ¿por qué chicos?",
        "start": 1427.5,
        "end": 1433.82
    },
    {
        "text": " A ver, vamos a ver. El ejemplo le ha deserrado para el final que es la más fácil y la más difícil",
        "start": 1433.82,
        "end": 1442.58
    },
    {
        "text": " al mismo tiempo. La deserrada por la suma, tenés dos vectores, V1 y V2, que son preimágenes.",
        "start": 1442.58,
        "end": 1448.38
    },
    {
        "text": " Lo sumo. ¿Qué pasa? Su imagen donde está. Es lineal y la suma de dos vectores en cada,",
        "start": 1449.3400000000001,
        "end": 1463.66
    },
    {
        "text": " en cada. Entonces esa suma que teníamos antes era la primágen de alguien de acá, entonces",
        "start": 1463.66,
        "end": 1469.3400000000001
    },
    {
        "text": " está en la primágen. Ese es el robo de la suma, eso quiero que aparecen en el práctico. Lo",
        "start": 1469.3400000000001,
        "end": 1474.7600000000002
    },
    {
        "text": " mismo con esto ¿no? Como es lineal, el alfase alépara fuera, el alfase alépara fuera",
        "start": 1474.76,
        "end": 1481.56
    },
    {
        "text": " y entonces como el segundo escono. Y ahora vamos a este del cerrado. Toda transformación",
        "start": 1481.56,
        "end": 1488.86
    },
    {
        "text": " lineal es, lo hemos usado muchas veces, continua. Entonces la primágen de un cerrado, el cerrado,",
        "start": 1488.86,
        "end": 1497.94
    },
    {
        "text": " eso es de topología, de cálculo 2 probablemente lo he visto y se terminó. La primágen",
        "start": 1497.94,
        "end": 1505.4
    },
    {
        "text": " cerrado, su cerrado de cálculo 2 y se terminó o de cálculo 3 donde lo vieron eso.",
        "start": 1505.4,
        "end": 1509.42
    },
    {
        "text": " Alcanza.",
        "start": 1516.42,
        "end": 1517.6200000000001
    },
    {
        "text": " Pero si hay tu matemática tú lo viste en topología, ese concepto central y continúa. La",
        "start": 1517.6200000000001,
        "end": 1527.66
    },
    {
        "text": " primágen de una abierto, la primágen de un cerrado, no es cerrado. Bueno, y se terminó.",
        "start": 1527.66,
        "end": 1532.74
    },
    {
        "text": " Pero ¿cuál es la pregunta que surge naturalmente a partir de este ejemplo? Yo también",
        "start": 1532.74,
        "end": 1540.78
    },
    {
        "text": " la transformación lineal y tú metes la minus 1 de cálculo. O sea, si lo se ayudó a ver.",
        "start": 1540.78,
        "end": 1546.6200000000001
    },
    {
        "text": " Tú amé el cálculo 2 y lo traje para atrás. ¿Cuál es la pregunta que surge naturalmente?",
        "start": 1546.6200000000001,
        "end": 1553.3000000000002
    },
    {
        "text": " ¿Qué pasa cuando te diga la nueva?",
        "start": 1553.3,
        "end": 1556.3799999999999
    },
    {
        "text": " ¿Eh? Si lo pasa, ¿cuál es el nuevo cerrado?",
        "start": 1556.3799999999999,
        "end": 1562.58
    },
    {
        "text": " Sí, claro, sí podría ir de vuelta y de vuelta, de vuelta, perdón, sí. Está bien.",
        "start": 1562.58,
        "end": 1567.8999999999999
    },
    {
        "text": " ¿Y vos qué estaba diciendo? ¿Qué pasa con teca?",
        "start": 1567.8999999999999,
        "end": 1571.02
    },
    {
        "text": " Claro, exactamente. ¿Qué pasa si sí si mismo cálculo veo aquí y lo mando para adelante?",
        "start": 1571.02,
        "end": 1577.82
    },
    {
        "text": " ¿Qué es pensando yo? ¿Cuál es el problema con esto?",
        "start": 1578.82,
        "end": 1583.1399999999999
    },
    {
        "text": " ¿Quién es el problema con esto?",
        "start": 1583.1399999999999,
        "end": 1586.1399999999999
    },
    {
        "text": " ¿Quién es el problema con esto?",
        "start": 1586.1399999999999,
        "end": 1591.5
    },
    {
        "text": " ¿Quién es el problema con esto?",
        "start": 1591.5,
        "end": 1595.9399999999998
    },
    {
        "text": " Bueno, descuento.",
        "start": 1595.9399999999998,
        "end": 1596.82
    },
    {
        "text": " He lo voy a poner como ejercicio de práctico también, pero van a tener que lucharlo,",
        "start": 1596.82,
        "end": 1602.58
    },
    {
        "text": " porque es interesante la pregunta. La respuesta es no tiene por qué ser cuando.",
        "start": 1602.58,
        "end": 1611.6999999999998
    },
    {
        "text": " Evidentemente que las cosas lineales nos van a ser el problema, porque es la misma elógica.",
        "start": 1611.6999999999998,
        "end": 1620.34
    },
    {
        "text": " Si yo tengo un cono, si la suma tal, te linea, la suma tal, o sea que el problema mira acá.",
        "start": 1620.34,
        "end": 1626.58
    },
    {
        "text": " Y encontrar un ejemplo de esto, me costó que amade, Google internet, busquen páginas de matemáticas, etcétera, etcétera.",
        "start": 1627.58,
        "end": 1636.6999999999998
    },
    {
        "text": " Y al final, pero es una linda ejercicio que encuentren, porque en definitiva, ¿qué pasa?",
        "start": 1636.6999999999998,
        "end": 1645.8999999999999
    },
    {
        "text": " No sé si sabemos, pero quiero decir, les comento.",
        "start": 1645.8999999999999,
        "end": 1652.1799999999998
    },
    {
        "text": " Una función es continua, si la primaja de una abierta es una abierta.",
        "start": 1652.18,
        "end": 1655.98
    },
    {
        "text": " Esa es la definición de continuidad más esencial, la que aparece cuando te vas, cuando ya no tenés ni normas, ni metr,",
        "start": 1655.98,
        "end": 1665.54
    },
    {
        "text": " no estás en el ren, no tienes normas, no tienes métricas, solo tienes topología.",
        "start": 1665.54,
        "end": 1672.7
    },
    {
        "text": " ¿Sí? Entonces, ¿qué te queda?",
        "start": 1672.7,
        "end": 1674.7
    },
    {
        "text": " La definición de continuidad más pura es que la primaja de una abierta es una abierta.",
        "start": 1674.7,
        "end": 1678.0600000000002
    },
    {
        "text": " Esa es la definición. Y por lo tanto, la primaja de una abierta es un cerrado.",
        "start": 1678.06,
        "end": 1681.34
    },
    {
        "text": " Muy bien. Pero lo sabemos que las transformaciones y naciones son continuas.",
        "start": 1681.34,
        "end": 1686.3
    },
    {
        "text": " Muy bien. Lo aprovechamos ahora bien.",
        "start": 1686.3,
        "end": 1690.06
    },
    {
        "text": " Nadie dijo que la imagen de un cerrado es un cerrado, pero ha sido una transformación liñada como que una decía,",
        "start": 1690.06,
        "end": 1698.82
    },
    {
        "text": " no es una función cualquiera, es una transformación liñada, es una cosa muy muy muy exigente,",
        "start": 1699.62,
        "end": 1704.26
    },
    {
        "text": " tiene una transformación liñada. Y sin embargo, la imagen de un cono no tiene por qué ser cono.",
        "start": 1704.26,
        "end": 1711.06
    },
    {
        "text": " Se pierde esto. Talino contra el ejemplo, busquenlo, lo pongo en práctico, pero es la pregunta más natural.",
        "start": 1711.06,
        "end": 1718.5
    },
    {
        "text": " Me tres patras un cono y llevas lo para adelante, como que no te va.",
        "start": 1718.5,
        "end": 1722.74
    },
    {
        "text": " Bueno, este no da. Ese aparece también en práctico, pero quería comentarlo en este momento.",
        "start": 1722.74,
        "end": 1728.74
    },
    {
        "text": " El ejemplo tres.",
        "start": 1728.74,
        "end": 1730.74
    },
    {
        "text": " Este es el concepto de la vida en el 1, el dual, el espacio dual.",
        "start": 1750.66,
        "end": 1757.3
    },
    {
        "text": " Venga el 2 también.",
        "start": 1759.7,
        "end": 1761.7
    },
    {
        "text": " Si lo tenemos, a más lo sabemos que si ves a reine, esto se hizo Morfa reine, como espacio territorial,",
        "start": 1763.7,
        "end": 1770.9
    },
    {
        "text": " te quedan en edinción también.",
        "start": 1770.9,
        "end": 1772.9
    },
    {
        "text": " Entonces, ¿qué pasa? Si vos tenés un cono K en B, cono.",
        "start": 1772.9,
        "end": 1779.7
    },
    {
        "text": " Vamos a encontrar un cono asociado a este, en B3, en B dual,",
        "start": 1779.7,
        "end": 1785.7
    },
    {
        "text": " la que es el cono ortogonal. Si llama cono ortogonal, se define así, K,",
        "start": 1786.66,
        "end": 1798.74
    },
    {
        "text": " Perpa. Y son aquellos funcionales, porque los elementos de B3,",
        "start": 1798.74,
        "end": 1805.8600000000001
    },
    {
        "text": " es normal, se llama los funcionales.",
        "start": 1806.82,
        "end": 1809.3
    },
    {
        "text": " Son aquellos funcionales que en el cono da mayor igual que C, que en todos los vectores del",
        "start": 1809.3,
        "end": 1817.6999999999998
    },
    {
        "text": " cono da mayor igual que C, ¿no?",
        "start": 1817.7,
        "end": 1822.82
    },
    {
        "text": " Este es el K perp.",
        "start": 1824.3400000000001,
        "end": 1826.3400000000001
    },
    {
        "text": " Entonces, en piezo con mi caela, ¿qué pasa con la suma?",
        "start": 1826.34,
        "end": 1847.3
    },
    {
        "text": " Quiero probar que, evidentemente, lo que quiero probar es que K perp es un cono, ¿no?",
        "start": 1847.3,
        "end": 1854.5
    },
    {
        "text": " Entonces, ¿qué pasa con la suma, mi caela? Si vos tenés dos funcionales en K perp,",
        "start": 1857.22,
        "end": 1863.3799999999999
    },
    {
        "text": " toma la suma, ¿por qué?",
        "start": 1864.58,
        "end": 1869.3
    },
    {
        "text": " Porque si tenés una que se llama F1 o tres que se llama F2,",
        "start": 1873.78,
        "end": 1876.58
    },
    {
        "text": " tienes F1 y en K perp y F2 en K perp. Entonces,",
        "start": 1876.58,
        "end": 1892.1
    },
    {
        "text": " ¿cómo es la cosa? Quiero preguntar que pasa con la suma, ¿no?",
        "start": 1898.34,
        "end": 1902.6599999999999
    },
    {
        "text": " ¿Y qué tengo que hacer?",
        "start": 1903.6200000000001,
        "end": 1905.6200000000001
    },
    {
        "text": " No, no tenéis como el K perp.",
        "start": 1905.6200000000001,
        "end": 1908.66
    },
    {
        "text": " K perp son aquellos funcionales, aquellos morfismos de Bnr,",
        "start": 1908.66,
        "end": 1913.66
    },
    {
        "text": " aquí esas transformaciones niñales de Bnr, que evaluados en cualquier vector del cono da mayor igual que C,",
        "start": 1913.66,
        "end": 1922.98
    },
    {
        "text": " ¿qué dice antes de ver? Porque el codominio de F es R, ¿no?",
        "start": 1922.98,
        "end": 1927.22
    },
    {
        "text": " ¿Cómo?",
        "start": 1927.22,
        "end": 1929.22
    },
    {
        "text": " ¿Cómo? ¿Aca cómo?",
        "start": 1929.22,
        "end": 1933.22
    },
    {
        "text": " Ah, porque ustedes no usan esta notación. ¿Cómo usan? ¿Qué notación usan en G1 o G2?",
        "start": 1933.22,
        "end": 1939.22
    },
    {
        "text": " La de las transformaciones niñales.",
        "start": 1939.22,
        "end": 1943.22
    },
    {
        "text": " ¿Lin?",
        "start": 1943.22,
        "end": 1945.22
    },
    {
        "text": " No, no, el conjunto de todas las transformaciones niñales de Bnr.",
        "start": 1945.22,
        "end": 1949.22
    },
    {
        "text": " ¿Cómo es el chiquito de F es que oye?",
        "start": 1949.22,
        "end": 1953.22
    },
    {
        "text": " ¿Cómo? ¿Cómo?",
        "start": 1954.18,
        "end": 1956.18
    },
    {
        "text": " De todas las transformaciones niñales, el conjunto de todas las transformaciones, ¿cómo es la pongo? ¿Cómo es la de G1 o G2?",
        "start": 1956.18,
        "end": 1962.18
    },
    {
        "text": " ¿Ele es masúscula?",
        "start": 1962.18,
        "end": 1964.18
    },
    {
        "text": " Ahí va.",
        "start": 1964.18,
        "end": 1966.18
    },
    {
        "text": " No.",
        "start": 1966.18,
        "end": 1967.22
    },
    {
        "text": " Así o así, capaz.",
        "start": 1967.22,
        "end": 1970.18
    },
    {
        "text": " De Bnb.",
        "start": 1970.18,
        "end": 1973.22
    },
    {
        "text": " De Bnb.",
        "start": 1973.22,
        "end": 1975.22
    },
    {
        "text": " En este caso sería en realidad sería de Bnr.",
        "start": 1975.22,
        "end": 1979.22
    },
    {
        "text": " Está.",
        "start": 1979.22,
        "end": 1981.22
    },
    {
        "text": " Está.",
        "start": 1981.22,
        "end": 1982.22
    },
    {
        "text": " Está. ¿Elo mismo?",
        "start": 1982.22,
        "end": 1985.22
    },
    {
        "text": " Esta notación, Home, en la que se usa en general matemática, no solamente para transformaciones para cualquier categoría.",
        "start": 1987.22,
        "end": 1995.22
    },
    {
        "text": " Home es toda la transformación de esa categoría de este dominio y con este codominio.",
        "start": 1995.22,
        "end": 2001.22
    },
    {
        "text": " Y el R abajo te está diciendo que es lineal.",
        "start": 2001.22,
        "end": 2003.22
    },
    {
        "text": " Ahí te va a quedar de que este 1 de cualquier u es más recolutivo y es de lo mismo trae más positivo.",
        "start": 2003.22,
        "end": 2009.22
    },
    {
        "text": " ¿Tenéis cambios que casé a un colon, eso?",
        "start": 2009.22,
        "end": 2013.22
    },
    {
        "text": " No, por ahora no.",
        "start": 2013.22,
        "end": 2015.22
    },
    {
        "text": " Por ahora no, a ver, vamos a ver.",
        "start": 2015.22,
        "end": 2017.22
    },
    {
        "text": " F1B, esto es como dijo en I, F1DB, más F2DB.",
        "start": 2017.22,
        "end": 2025.22
    },
    {
        "text": " Amos son mayores igual que cero, entonces toma mayor igual que cero.",
        "start": 2025.22,
        "end": 2029.22
    },
    {
        "text": " El codominio son los reales, puedo sumar el cero.",
        "start": 2029.22,
        "end": 2033.22
    },
    {
        "text": " Entonces quiere decir que F1 más F2 está en caper.",
        "start": 2033.22,
        "end": 2039.22
    },
    {
        "text": " Primero condición chequeada.",
        "start": 2039.22,
        "end": 2041.22
    },
    {
        "text": " Y como dijo Nico acá no hemos usado mucho que el B es en un cono, estamos usando simplemente la descripción de caper.",
        "start": 2041.22,
        "end": 2047.22
    },
    {
        "text": " ¿Qué más tenemos para probar esta firmación?",
        "start": 2047.22,
        "end": 2051.2200000000003
    },
    {
        "text": " Vamos ahora con agarro a F en caper y alpha, mayor igual que cero.",
        "start": 2051.22,
        "end": 2059.22
    },
    {
        "text": " Y me pregunto que pasa con alpha F si están caper, no.",
        "start": 2059.22,
        "end": 2065.22
    },
    {
        "text": " Para saber si están caper, no.",
        "start": 2065.22,
        "end": 2068.22
    },
    {
        "text": " Entonces se evaluó en un B con V en ca.",
        "start": 2071.22,
        "end": 2076.22
    },
    {
        "text": " Y alpha F en B es alpha por FB.",
        "start": 2077.22,
        "end": 2081.22
    },
    {
        "text": " Y esto como FDB, mayor igual que cero, y alpha mayor igual que cero.",
        "start": 2082.22,
        "end": 2087.22
    },
    {
        "text": " Entonces este producto es mayor igual que cero.",
        "start": 2087.22,
        "end": 2090.22
    },
    {
        "text": " Por lo tanto alpha F pertenece a caper.",
        "start": 2090.22,
        "end": 2095.22
    },
    {
        "text": " Tampoco hemos usado en este momento que casi un con.",
        "start": 2097.22,
        "end": 2100.22
    },
    {
        "text": " Y por último nos queda lo de cerrado, ¿no?",
        "start": 2100.22,
        "end": 2107.22
    },
    {
        "text": " Caper es cerrado.",
        "start": 2117.22,
        "end": 2118.22
    },
    {
        "text": " Ahora como se lo pensé para hacer esto para ustedes.",
        "start": 2131.22,
        "end": 2137.22
    },
    {
        "text": " Sí, dice así.",
        "start": 2137.22,
        "end": 2140.22
    },
    {
        "text": " Me pareció que la forma fácil de pensarlo era así.",
        "start": 2140.22,
        "end": 2144.22
    },
    {
        "text": " Yo tengo para probar que cerrado lo que tengo lo puedo pensar, si tengo una sucesión de puntos",
        "start": 2144.22,
        "end": 2152.22
    },
    {
        "text": " que con conbergentes, una sucesión de puntos, en este caso los puntos son funcionales, son funciones.",
        "start": 2152.22,
        "end": 2159.22
    },
    {
        "text": " Todo esto en caper tal que F suene, converge a F.",
        "start": 2159.22,
        "end": 2167.22
    },
    {
        "text": " Y qué quiero probar para saber si caper me he cerrado. La pregunta cuál es eso.",
        "start": 2167.22,
        "end": 2172.22
    },
    {
        "text": " Exactamente, si F también está en caper.",
        "start": 2176.22,
        "end": 2178.22
    },
    {
        "text": " ¿De verdad? Y F está en caper, si medido, si evaluada en un UB es mayor igual que cero.",
        "start": 2179.22,
        "end": 2185.22
    },
    {
        "text": " Entonces, creo que tengo que preguntarme esto, si solamente sí F de UB es mayor igual que cero para todo UB.",
        "start": 2185.22,
        "end": 2193.22
    },
    {
        "text": " ¿Cá?",
        "start": 2193.22,
        "end": 2194.22
    },
    {
        "text": " ¿Cierto?",
        "start": 2194.22,
        "end": 2195.22
    },
    {
        "text": " Y bueno, ¿pero quién es F de UB?",
        "start": 2209.22,
        "end": 2220.22
    },
    {
        "text": " Si F suene de UB es F su disculpe.",
        "start": 2220.22,
        "end": 2223.22
    },
    {
        "text": " Si F suene tiende a F si la funcionales tiende a F, esto es si solamente sí.",
        "start": 2223.22,
        "end": 2230.22
    },
    {
        "text": " A ver, por ejemplo, digo, las funcionales son transformaciones lineales, las transformaciones y a F son matrices.",
        "start": 2230.22,
        "end": 2237.22
    },
    {
        "text": " Entonces, la matrices, lo sabemos cuando una matrices tiende a otra.",
        "start": 2238.22,
        "end": 2243.22
    },
    {
        "text": " Y esto, revisenlo, por favor, si solo sí. Esto es si solamente sí, F suene de X tiende a F de X para todo X, perteneciente a R N.",
        "start": 2243.22,
        "end": 2258.22
    },
    {
        "text": " En particular, para todo, por lo tanto, F suene de B tiende a F de B para todo V y K.",
        "start": 2259.22,
        "end": 2270.22
    },
    {
        "text": " Pero F suene de B en los factores de K dan mayor igual que cero.",
        "start": 2272.22,
        "end": 2278.22
    },
    {
        "text": " Entonces, pues ahora el V está fijo.",
        "start": 2278.22,
        "end": 2280.22
    },
    {
        "text": " Tienes una sucesión de puntos en R N que cada uno de estos puntos son mayores igual que cero.",
        "start": 2281.22,
        "end": 2288.22
    },
    {
        "text": " Son vectores de R N, mayores igual que cero.",
        "start": 2288.22,
        "end": 2290.22
    },
    {
        "text": " Esto ya lo vimos. Si son todos mayores igual que cero, su límite es mayor igual que cero.",
        "start": 2290.22,
        "end": 2295.22
    },
    {
        "text": " Lo vimos cuando analizamos el cono positivo.",
        "start": 2295.22,
        "end": 2298.22
    },
    {
        "text": " Entonces, como F suene de B es mayor igual que cero para todo N, el V está fijo ahora.",
        "start": 2299.22,
        "end": 2308.22
    },
    {
        "text": " Son todos vectores en R N, entonces mayor igual que cero, todas las coordenadas su límite.",
        "start": 2308.22,
        "end": 2313.22
    },
    {
        "text": " Entonces, F de B es mayor igual que cero.",
        "start": 2313.22,
        "end": 2317.22
    },
    {
        "text": " Entonces, ¿qué probaste?",
        "start": 2319.22,
        "end": 2320.22
    },
    {
        "text": " Esto último, que la F estaba en K, si sonamente sí, evaluado en cualquier vector del cono, vamos a decir igual que cero.",
        "start": 2321.22,
        "end": 2329.22
    },
    {
        "text": " Esto es para todo V, K. Conclusión, F está en K.",
        "start": 2331.22,
        "end": 2337.22
    },
    {
        "text": " De vuelta nos damos que se van a, ¿qué casi un cono?",
        "start": 2338.22,
        "end": 2340.22
    },
    {
        "text": " Lico, es un cono, hemos usado casi nada de que...",
        "start": 2341.22,
        "end": 2343.22
    },
    {
        "text": " Sí, hemos usado que el cono, probamos que el cono, pero no hemos usado que el que hace un cono.",
        "start": 2353.22,
        "end": 2358.22
    },
    {
        "text": " Pero no importa, digamos, no, digamos. Nos obraron hipótesis, pero dado un cono, vos podés llegar a un cono que se llama el cono, te va a ganar.",
        "start": 2360.22,
        "end": 2368.22
    },
    {
        "text": " Más allá de que no usaste todas las hipótesis del cono, ¿no?",
        "start": 2370.22,
        "end": 2373.22
    },
    {
        "text": " Sí, señor. De hecho, en el libro no ponen que esto sea un cono.",
        "start": 2386.22,
        "end": 2390.22
    },
    {
        "text": " Yo le puse simplemente porque me estaban trabajando con el libro, tomar capa y ver si esto es un cono.",
        "start": 2390.22,
        "end": 2396.22
    },
    {
        "text": " Bueno, muy bien, ¿guarricé? Me sigo hasta acá porque la teoría de cono recién empieza y son cosas sencillas como la que hemos hecho,",
        "start": 2397.22,
        "end": 2407.22
    },
    {
        "text": " pero, a pesar de que son sencillas, necesitan un poquito de hacer jugar toda la matemática que ustedes saben.",
        "start": 2408.22,
        "end": 2415.22
    },
    {
        "text": " De hecho, creo que se dan cuenta que saben matemática de mano, porque jugamos con conceptos, para que no estaban mal, para el otro,",
        "start": 2416.22,
        "end": 2422.22
    },
    {
        "text": " lo vamos recogrando los conceptos y lo vamos recuperando y lo estamos conjugando, esos conceptos juntos y eso es interesante.",
        "start": 2422.22,
        "end": 2430.22
    },
    {
        "text": " Como se aprovechen y se nutren entre sí. De hecho el ejemplo de que...",
        "start": 2431.22,
        "end": 2438.22
    },
    {
        "text": " ¿Apartidado?",
        "start": 2439.22,
        "end": 2440.22
    },
    {
        "text": " ¿Apartidado?",
        "start": 2441.22,
        "end": 2442.22
    },
    {
        "text": " No, a partir de adocar, el caper es único, sí está. Eso queda determinado por acá.",
        "start": 2443.22,
        "end": 2447.22
    },
    {
        "text": " ¿Pero puesto le captamos sería también?",
        "start": 2447.22,
        "end": 2449.22
    },
    {
        "text": " Ah, claro, sí, es que si vuestro más otro conjunto, pues tomar...",
        "start": 2449.22,
        "end": 2455.22
    },
    {
        "text": " No, tenemos conjunto de la puesta de zapas.",
        "start": 2456.22,
        "end": 2458.22
    },
    {
        "text": " Si es un cono también, totalmente, ¿acuerdo? O sea, capaz que más en general y me parece que estoy armando otro ejercicio de práctico.",
        "start": 2459.22,
        "end": 2467.22
    },
    {
        "text": " Son sencillas esas cosas, pero veis que son esas preguntas que vale la pena colocarlos para que todos estén atentos, así que está bien eso.",
        "start": 2471.22,
        "end": 2477.22
    },
    {
        "text": " Vuelvo a que estás observando, a ver si se te preto, sentiado, que si votes un cono en general sea perp o cualquier cono.",
        "start": 2478.22,
        "end": 2486.22
    },
    {
        "text": " Entonces, menos acá, es cono. ¿Tiene acuerdo con eso?",
        "start": 2487.22,
        "end": 2494.22
    },
    {
        "text": " Porque si votes un cono, es cerrado por la suma, el menos acá, también cerrado por la suma, hay multiplicas por una forma y ruedal que es 0.",
        "start": 2496.22,
        "end": 2504.22
    },
    {
        "text": " Cuando multipliques allá abajo va para el otro lado, está bien.",
        "start": 2505.22,
        "end": 2509.22
    },
    {
        "text": " Y si este es cerrado, el otro es el simétrico, ¿estás haciendo la simetría por el simetía central?",
        "start": 2509.22,
        "end": 2515.22
    },
    {
        "text": " Y geométrica, ¿no? O sea, se obtiene conjunto cerrado y la simetía se obtraba hacia cerrado también.",
        "start": 2516.22,
        "end": 2520.22
    },
    {
        "text": " Así que lo que está proponiendo es antiguo sexto, y esto es correcto.",
        "start": 2521.22,
        "end": 2524.22
    },
    {
        "text": " Estaba lo vamos a poner también como ejercicio práctico.",
        "start": 2524.22,
        "end": 2527.22
    },
    {
        "text": " De hecho, hay otro ejercicio práctico que yo metí hace un rato cuando estaba preparando clase y lo pongo acá, ya como observación.",
        "start": 2528.22,
        "end": 2536.22
    },
    {
        "text": " ¿Qué pasa si tienes un cono? Recuerden que estamos trabajando en un espacio interior que se reenle, ¿no?",
        "start": 2537.22,
        "end": 2543.22
    },
    {
        "text": " O sea, acá está dentro de un espacio interior y al ve.",
        "start": 2543.22,
        "end": 2546.22
    },
    {
        "text": " Y hago el cono, ahora tengo un subespacio de ve, un subespacio de ve.",
        "start": 2547.22,
        "end": 2551.22
    },
    {
        "text": " Y hace sexto, consideramos K interés de ve.",
        "start": 2552.22,
        "end": 2561.22
    },
    {
        "text": " Lo sé escucho.",
        "start": 2563.22,
        "end": 2564.22
    },
    {
        "text": " ¿Cuál quiere suve espacio?",
        "start": 2573.22,
        "end": 2574.22
    },
    {
        "text": " ¿Por qué? A ver.",
        "start": 2577.22,
        "end": 2578.22
    },
    {
        "text": " ¿Estás intentando la conecto y esta parte que hayan sentado para implicar un vector de forma fuera de este?",
        "start": 2581.22,
        "end": 2590.22
    },
    {
        "text": " ¿La intersecución puede estar completamente indúbida?",
        "start": 2592.22,
        "end": 2595.22
    },
    {
        "text": " No, es bueno que los de ve. Son todos los victores con norma, menor o no.",
        "start": 2598.22,
        "end": 2602.22
    },
    {
        "text": " Eso no es un subespacio.",
        "start": 2603.22,
        "end": 2604.22
    },
    {
        "text": " Claro, ahí tienes la razón paula, la intersecución ahí deja ser cono, pero no es un subespacio.",
        "start": 2612.22,
        "end": 2619.22
    },
    {
        "text": " A ver.",
        "start": 2635.22,
        "end": 2636.22
    },
    {
        "text": " Conciro que interés de ve. Entonces, por ejemplo, yo tengo ve 1 en K interés de ve y ve 2 en K interés de ve.",
        "start": 2637.22,
        "end": 2648.22
    },
    {
        "text": " Y tomo el asuma, ¿no?",
        "start": 2649.22,
        "end": 2650.22
    },
    {
        "text": " Me empiezo a preguntar una de las tantas de la definición de con la suma. ¿Qué pasa con la suma?",
        "start": 2652.22,
        "end": 2658.22
    },
    {
        "text": " A la suma.",
        "start": 2658.22,
        "end": 2659.22
    },
    {
        "text": " A la es Sandra.",
        "start": 2663.22,
        "end": 2664.22
    },
    {
        "text": " Mientras les acupunta la piota de que es final.",
        "start": 2669.22,
        "end": 2672.22
    },
    {
        "text": " Sí, señor, porque suve espacio y porque su un con.",
        "start": 2673.22,
        "end": 2678.22
    },
    {
        "text": " O sea que está en K interés de ve. Por lo tanto está en interés.",
        "start": 2679.22,
        "end": 2681.22
    },
    {
        "text": " O sea que vamos bien, ¿no? ¿Verdad?",
        "start": 2683.22,
        "end": 2684.22
    },
    {
        "text": " Por lo tanto cada interés de ve más.",
        "start": 2684.22,
        "end": 2691.22
    },
    {
        "text": " Cada interés de ve está en ruido, entra en interés de ve.",
        "start": 2692.22,
        "end": 2697.22
    },
    {
        "text": " No te digo algo muy por qué.",
        "start": 2698.22,
        "end": 2699.22
    },
    {
        "text": " Porque...",
        "start": 2700.22,
        "end": 2701.22
    },
    {
        "text": " ¿Tenés 2 victores tan en K?",
        "start": 2705.22,
        "end": 2706.22
    },
    {
        "text": " Como es un con o la suma está.",
        "start": 2707.22,
        "end": 2708.22
    },
    {
        "text": " En el con. Tan en el subespacio.",
        "start": 2709.22,
        "end": 2710.22
    },
    {
        "text": " Tan en el subespacio.",
        "start": 2710.22,
        "end": 2711.22
    },
    {
        "text": " La suma dove que era el subespacio, tan en el subespacio.",
        "start": 2712.22,
        "end": 2714.22
    },
    {
        "text": " Entonces, tan interés.",
        "start": 2715.22,
        "end": 2716.22
    },
    {
        "text": " Ah, lo dije, pero no lo vamos a notarlo.",
        "start": 2720.22,
        "end": 2723.22
    },
    {
        "text": " Lo dije oralmente, pero no lo anoté.",
        "start": 2728.22,
        "end": 2729.22
    },
    {
        "text": " Vamos bien ahí.",
        "start": 2731.22,
        "end": 2732.22
    },
    {
        "text": " Y esta otra.",
        "start": 2733.22,
        "end": 2734.22
    },
    {
        "text": " Si tengo V en K interés de ve y Alpha es mayor igual que 0.",
        "start": 2734.22,
        "end": 2742.22
    },
    {
        "text": " ¿Qué pasa con Alpha V?",
        "start": 2743.22,
        "end": 2744.22
    },
    {
        "text": " Tan en K, porque con, está en el OV pero suve espacio.",
        "start": 2747.22,
        "end": 2750.22
    },
    {
        "text": " O sea que Alpha V pertenece a K interés de ve.",
        "start": 2751.22,
        "end": 2754.22
    },
    {
        "text": " Por lo tanto, Alpha por K interés de ve.",
        "start": 2756.22,
        "end": 2760.22
    },
    {
        "text": " Esta incluido en K interés de ve para todo Alpha mayor igual que 0.",
        "start": 2760.22,
        "end": 2765.22
    },
    {
        "text": " Vamos 2.",
        "start": 2766.22,
        "end": 2767.22
    },
    {
        "text": " Y la he cerrado.",
        "start": 2768.22,
        "end": 2769.22
    },
    {
        "text": " Tenés, por ejemplo,",
        "start": 2772.22,
        "end": 2773.22
    },
    {
        "text": " una sucesión de puntos, V suene.",
        "start": 2775.22,
        "end": 2780.22
    },
    {
        "text": " Me llama V suene.",
        "start": 2781.22,
        "end": 2782.22
    },
    {
        "text": " Una sucesión de puntos V suene.",
        "start": 2784.22,
        "end": 2786.22
    },
    {
        "text": " Perteneciente a N, tal que el conjunto está incluido en K interés de ve.",
        "start": 2786.22,
        "end": 2799.22
    },
    {
        "text": " Una sucesión de ve, de vectores, tal que los, mirado como puntos, tan todos en K interés de ve.",
        "start": 2800.22,
        "end": 2805.22
    },
    {
        "text": " Además, que V suene converge a V, ¿no?",
        "start": 2807.22,
        "end": 2809.22
    },
    {
        "text": " Que lees una sucesión que converge.",
        "start": 2810.22,
        "end": 2811.22
    },
    {
        "text": " En R N, estamos hablando, ¿no?",
        "start": 2813.22,
        "end": 2814.22
    },
    {
        "text": " Todo esto en V, en R N, R N es V.",
        "start": 2814.22,
        "end": 2818.22
    },
    {
        "text": " Bueno, como K es cerrado, como K es cerrado, V perteneciante acá, pues K es cerrado.",
        "start": 2821.22,
        "end": 2833.22
    },
    {
        "text": " Esto es porque, es con, ¿no? ¿no? ¿no? ¿no? ¿qué nos gustaría ver?",
        "start": 2834.22,
        "end": 2839.22
    },
    {
        "text": " Que V es tan W, pero todos los son vectores W, o sea, V suene perteneciante a W para todo N y V suene converge a V.",
        "start": 2840.22,
        "end": 2850.22
    },
    {
        "text": " Esto último, es que lo necesitamos probar que es cerrado.",
        "start": 2857.22,
        "end": 2861.22
    },
    {
        "text": " Para probar que es un cono, o sea, porque ya estamos yendo hacia la, queremos probar que esto también es un cono.",
        "start": 2862.22,
        "end": 2869.22
    },
    {
        "text": " Lo para probar que es un cono, tengo que probar que es cerrado por la suma, que es cerrado por el producto pero es que hará de más, no negativos.",
        "start": 2871.22,
        "end": 2878.22
    },
    {
        "text": " Y a más que es cerrado topológicamente, o sea que si toma una sucesión de puntos en el espacio, en el conjunto,",
        "start": 2879.22,
        "end": 2888.22
    },
    {
        "text": " este pretendo que es un cono, su límite, una sucesión que converge a un vector, su límite, tiene que estar pretendo que estén en el mismo conjunto para probar que es cerrado topológicamente.",
        "start": 2889.22,
        "end": 2902.22
    },
    {
        "text": " La sucesión que converge quiere probar que su límite está en el mismo conjunto.",
        "start": 2903.22,
        "end": 2906.22
    },
    {
        "text": " Claro, esa sucesión de vectores que tiene a V como cada uno de ellos está en K y K es cerrado, su límite está en K.",
        "start": 2907.22,
        "end": 2917.22
    },
    {
        "text": " Eso porque se aprovecha el hecho de que casi un cono y es cerrado.",
        "start": 2918.22,
        "end": 2921.22
    },
    {
        "text": " ¿Qué es lo que me falta probar? Para probar que el límite está en K y Trision W.",
        "start": 2922.22,
        "end": 2926.22
    },
    {
        "text": " Pues me falta probar que el límite está en K.",
        "start": 2927.22,
        "end": 2930.22
    },
    {
        "text": " Pero son todos los vectores de W. Piensen ustedes en RN lo subespacio que conocen como son los subespacios.",
        "start": 2931.22,
        "end": 2938.22
    },
    {
        "text": " Rectas, planos, R3, R4, R5, todas las dimensiones, menores igual que N.",
        "start": 2939.22,
        "end": 2946.22
    },
    {
        "text": " Tienes una sucesión de vectores que están en ese subespacio que pasa con el límite.",
        "start": 2947.22,
        "end": 2953.22
    },
    {
        "text": " En el mismo subespacio porque justamente, o sea, agaren para convencerlos.",
        "start": 2954.22,
        "end": 2965.22
    },
    {
        "text": " Todos los vectores de W, ponenle que estamos pensando R4 y W, R2 piensen las cichilinas.",
        "start": 2966.22,
        "end": 2976.22
    },
    {
        "text": " R2 en el sentido de dos dimensiones de las 4. Escriban en una base canónica que les sea fácil interpretar en el sentido.",
        "start": 2978.22,
        "end": 2984.22
    },
    {
        "text": " La base del W, toma dos vectores, lo llamamos 1, 0, 1, 0, 0, 0, 0.",
        "start": 2985.22,
        "end": 2990.22
    },
    {
        "text": " Estamos en el R4, 1, 0, 0, 0. Y el otro de la base, 0, 1, 0, 0.",
        "start": 2991.22,
        "end": 2996.22
    },
    {
        "text": " Estás lo llamando así porque yo tengo que se me antoja a empezar con esos dos vectores y eso para mí la base canónica.",
        "start": 2996.22,
        "end": 3001.22
    },
    {
        "text": " Y después completo hasta la base del espacio que estoy, eso que estoy haciendo el RD y R4 lo puede ser cualquier WB y cualquier RN.",
        "start": 3002.22,
        "end": 3009.22
    },
    {
        "text": " No verdad? Fumpletos de la base.",
        "start": 3009.22,
        "end": 3011.22
    },
    {
        "text": " Entonces todos los vectores de WN son vectores que tienen numeritos distintos de 0 en la primera dos coordenadas y en la última dos 0.",
        "start": 3012.22,
        "end": 3020.22
    },
    {
        "text": " El límite, si a quien se ha, tiene numeritos en la primera dos coordenadas y en la última dos 0.",
        "start": 3020.22,
        "end": 3026.22
    },
    {
        "text": " Por lo tanto, está en el mismo espacio. ¿Sentien de lo que quiero decir?",
        "start": 3026.22,
        "end": 3030.22
    },
    {
        "text": " Los subespacios vectoriales son conjuntos cerrados.",
        "start": 3033.22,
        "end": 3037.22
    },
    {
        "text": " Las rectas son cerradas en R2. Las rectas son cerradas en R3.",
        "start": 3038.22,
        "end": 3043.22
    },
    {
        "text": " Los planos son cerrados en R3 y así en general los subespacios vectoriales, WB es cerrado en B.",
        "start": 3043.22,
        "end": 3055.22
    },
    {
        "text": " Hay otras formas de mostrar esto por ejemplo.",
        "start": 3060.22,
        "end": 3063.22
    },
    {
        "text": " ¿Saben los subspacios vectoriales que no subspacios vectoriales?",
        "start": 3068.22,
        "end": 3071.22
    },
    {
        "text": " Sí, pero recordate que el K no es subspacio vectorial, ¿eh? ¿Cáis conno?",
        "start": 3071.22,
        "end": 3075.22
    },
    {
        "text": " Es cierto, el alpha suelo mayor igual que ser.",
        "start": 3077.22,
        "end": 3081.22
    },
    {
        "text": " Los connos no son subspacios vectoriales.",
        "start": 3081.22,
        "end": 3084.22
    },
    {
        "text": " Los conos son... Es la imagen de con o grisés. Es un cucurucho de este de lado o un cucurucho de...",
        "start": 3084.22,
        "end": 3093.22
    },
    {
        "text": " como se llama de barrapeñada.",
        "start": 3094.22,
        "end": 3096.22
    },
    {
        "text": " No, la suma de vector está dentro.",
        "start": 3096.22,
        "end": 3099.22
    },
    {
        "text": " Lleno, ¿no? Todo lleno.",
        "start": 3099.22,
        "end": 3101.22
    },
    {
        "text": " Y cuando utilicás por alpha mayor igual que ser, ahora si utilicás por un alpha que no es...",
        "start": 3101.22,
        "end": 3106.22
    },
    {
        "text": " si un alpha negativo se te va del con o se te va para abajo.",
        "start": 3106.22,
        "end": 3109.22
    },
    {
        "text": " Eso es este... son los connos. Y son cerrados porque tiene que tenerla afrontada.",
        "start": 3111.22,
        "end": 3116.22
    },
    {
        "text": " Entonces, en el infinitiva, el límite está acá y por lo tanto...",
        "start": 3116.22,
        "end": 3119.22
    },
    {
        "text": " ...b está en K interés de W.",
        "start": 3121.22,
        "end": 3124.22
    },
    {
        "text": " Es importante esto, ¿no?",
        "start": 3125.22,
        "end": 3127.22
    },
    {
        "text": " Los subspacios vectoriales son su conjunto cerrados en el ReN.",
        "start": 3127.22,
        "end": 3131.22
    },
    {
        "text": " Vínete una demostración inmediata de eso. Quieren que les haga una demostración inmediata que los subspacios vectoriales son cerrados.",
        "start": 3134.22,
        "end": 3140.22
    },
    {
        "text": " ¿Quién es?",
        "start": 3141.22,
        "end": 3142.22
    },
    {
        "text": " WB incluido en B. ¿Tá?",
        "start": 3143.22,
        "end": 3147.22
    },
    {
        "text": " Y tenés. Estamos hablando en el ReN, ¿no?",
        "start": 3148.22,
        "end": 3150.22
    },
    {
        "text": " Pero no importa el R, el N.",
        "start": 3150.22,
        "end": 3152.22
    },
    {
        "text": " Y tengo B que voy a parar a B cosiente WB.",
        "start": 3153.22,
        "end": 3157.22
    },
    {
        "text": " El espacio cosiente.",
        "start": 3158.22,
        "end": 3159.22
    },
    {
        "text": " Si ha visto el espacio cosiente, ¿no? ¿Verdad?",
        "start": 3159.22,
        "end": 3162.22
    },
    {
        "text": " En G2. Bueno, bolsín, el esitura viste el espacio cosiente porque eso no se pierde.",
        "start": 3162.22,
        "end": 3168.22
    },
    {
        "text": " Acá vamos a hacer el espacio cosiente antes.",
        "start": 3169.22,
        "end": 3172.22
    },
    {
        "text": " El espacio cosiente es simplemente...",
        "start": 3173.22,
        "end": 3178.22
    },
    {
        "text": " ...a ver, capaz que lo más próximo de algebral ideal que vieron es así.",
        "start": 3179.22,
        "end": 3183.22
    },
    {
        "text": " Yo tomo...",
        "start": 3183.22,
        "end": 3184.22
    },
    {
        "text": " Ahí va.",
        "start": 3191.22,
        "end": 3192.22
    },
    {
        "text": " Lo pueden haber visto así.",
        "start": 3193.22,
        "end": 3194.22
    },
    {
        "text": " Tomo WB en su espacio",
        "start": 3194.22,
        "end": 3196.22
    },
    {
        "text": " y completo una base hasta B.",
        "start": 3197.22,
        "end": 3200.22
    },
    {
        "text": " Y creo que los llamaban en G1 o G2, también esta misma cheroinbolla.",
        "start": 3202.22,
        "end": 3207.22
    },
    {
        "text": " Vaya casualidad.",
        "start": 3207.22,
        "end": 3208.22
    },
    {
        "text": " El ortobonal.",
        "start": 3208.22,
        "end": 3210.22
    },
    {
        "text": " Que es que completo en su espacio hasta llegar a B. ¿Se acuerdan esto?",
        "start": 3211.22,
        "end": 3214.22
    },
    {
        "text": " Puede ser.",
        "start": 3215.22,
        "end": 3216.22
    },
    {
        "text": " O sea, tenés WB y completas con vectores hasta llegar con vectores que...",
        "start": 3217.22,
        "end": 3221.22
    },
    {
        "text": " Incluso pueden ser ortobonales del punto de vista de la norma de...",
        "start": 3222.22,
        "end": 3226.22
    },
    {
        "text": " del Proutuiterno.",
        "start": 3227.22,
        "end": 3228.22
    },
    {
        "text": " Todo el resto.",
        "start": 3229.22,
        "end": 3230.22
    },
    {
        "text": " Entonces, vos podés poner acá, dicho esto, la transformación que tomate una base de esta manera.",
        "start": 3230.22,
        "end": 3238.22
    },
    {
        "text": " Los primeros vectores que vengan de acá y completos con vectores que ven en de acá.",
        "start": 3238.22,
        "end": 3245.22
    },
    {
        "text": " También. Entonces, la transformación lineal se olvida de estos.",
        "start": 3246.22,
        "end": 3249.22
    },
    {
        "text": " Puede tener su vectores crito en esta base que empieza con coordenadas en WB y se termina con coordenadas en WB.",
        "start": 3250.22,
        "end": 3256.22
    },
    {
        "text": " Y entonces se olvida de estas coordenadas.",
        "start": 3257.22,
        "end": 3259.22
    },
    {
        "text": " Entonces va para WB.",
        "start": 3260.22,
        "end": 3262.22
    },
    {
        "text": " ¿Cierto?",
        "start": 3262.22,
        "end": 3263.22
    },
    {
        "text": " El que arno el esto tiene.",
        "start": 3263.22,
        "end": 3265.22
    },
    {
        "text": " El que arno es de otra formación lineal.",
        "start": 3266.22,
        "end": 3268.22
    },
    {
        "text": " Que es una proyección, ¿verdad? Es una pí, proyección.",
        "start": 3268.22,
        "end": 3270.22
    },
    {
        "text": " Claro, el que arno el LP.",
        "start": 3272.22,
        "end": 3274.22
    },
    {
        "text": " El que arno el LP es exactamente WB.",
        "start": 3275.22,
        "end": 3277.22
    },
    {
        "text": " Pero que es el que arno el LP?",
        "start": 3278.22,
        "end": 3279.22
    },
    {
        "text": " Ures esa.",
        "start": 3279.22,
        "end": 3280.22
    },
    {
        "text": " Pié a la menos 1 de el nulo, ¿no?",
        "start": 3280.22,
        "end": 3284.22
    },
    {
        "text": " La preimagem del nulo.",
        "start": 3285.22,
        "end": 3287.22
    },
    {
        "text": " ¿Cierto?",
        "start": 3288.22,
        "end": 3289.22
    },
    {
        "text": " Y el conjunto este que es.",
        "start": 3289.22,
        "end": 3290.22
    },
    {
        "text": " Un conjunto de un punto.",
        "start": 3293.22,
        "end": 3294.22
    },
    {
        "text": " Es un color.",
        "start": 3295.22,
        "end": 3296.22
    },
    {
        "text": " Es un color, ¿no?",
        "start": 3296.22,
        "end": 3297.22
    },
    {
        "text": " Pero además es cerrado.",
        "start": 3297.22,
        "end": 3298.22
    },
    {
        "text": " Es un conjunto cerrado, tiene un punto.",
        "start": 3299.22,
        "end": 3300.22
    },
    {
        "text": " Es cerrado.",
        "start": 3301.22,
        "end": 3302.22
    },
    {
        "text": " Y entonces este es la preimagem de un conjunto cerrado por una función que es continuo",
        "start": 3302.22,
        "end": 3309.22
    },
    {
        "text": " porque es una transformación lineal en la proyección.",
        "start": 3309.22,
        "end": 3311.22
    },
    {
        "text": " Entonces WB es cerrado.",
        "start": 3312.22,
        "end": 3315.22
    },
    {
        "text": " Es una demostración más o menos inmediata, otra distinta a la que les mencioné allá",
        "start": 3316.22,
        "end": 3320.22
    },
    {
        "text": " de por qué es un conjunto cerrado.",
        "start": 3321.22,
        "end": 3323.22
    },
    {
        "text": " ¿OK?",
        "start": 3323.22,
        "end": 3324.22
    },
    {
        "text": " Bueno.",
        "start": 3328.22,
        "end": 3329.22
    },
    {
        "text": " Quiere decir que los subespacios son cerrados y la intercisión de cono con subespacios te dan cono.",
        "start": 3330.22,
        "end": 3335.22
    },
    {
        "text": " ¿Está bien?",
        "start": 3336.22,
        "end": 3337.22
    },
    {
        "text": " Bueno.",
        "start": 3337.22,
        "end": 3338.22
    },
    {
        "text": " Son todas imágenes que tienen, pero las tienen que ir armando en este nuevo concepto que estamos generando.",
        "start": 3339.22,
        "end": 3344.22
    },
    {
        "text": " Y eso está bueno.",
        "start": 3344.22,
        "end": 3345.22
    },
    {
        "text": " Se prendan el nuevo concepto con todas las ideas que ya vienen de antes.",
        "start": 3346.22,
        "end": 3349.22
    },
    {
        "text": " Y bueno, yo quería dar mucho más, pero vamos a dar por lo menos este lema.",
        "start": 3350.22,
        "end": 3355.22
    },
    {
        "text": " Necesito por lo menos a pasar con un lema, si no nos vamos a trazar.",
        "start": 3356.22,
        "end": 3359.22
    },
    {
        "text": " Antes el lema, esta notación que aparece en el libro.",
        "start": 3379.22,
        "end": 3382.22
    },
    {
        "text": " En el libro aparece así y yo la vestibir así.",
        "start": 3383.22,
        "end": 3387.22
    },
    {
        "text": " Que yo sabemos que sumar con el opuesto lo mismo que restar.",
        "start": 3391.22,
        "end": 3394.22
    },
    {
        "text": " Pero es que ca menos ca, como tal pueden entenderse la diferencia del conjunto,",
        "start": 3395.22,
        "end": 3399.22
    },
    {
        "text": " pueden entenderse tanta manera de distinto, ca menos ca.",
        "start": 3399.22,
        "end": 3402.22
    },
    {
        "text": " El cambio es que yo te pongo ca más menos ca, que era claro que estoy sumando con el opuesto.",
        "start": 3403.22,
        "end": 3408.22
    },
    {
        "text": " Está claro, entonces vamos a escribirlo de aquella manera.",
        "start": 3409.22,
        "end": 3411.22
    },
    {
        "text": " Y el lema dice así.",
        "start": 3412.22,
        "end": 3414.22
    },
    {
        "text": " Para un con oca, dado un con oca, son equivalentes.",
        "start": 3420.22,
        "end": 3428.22
    },
    {
        "text": " Primero que cae sólido, sólido que quería decir que tiene algún punto interior.",
        "start": 3429.22,
        "end": 3434.22
    },
    {
        "text": " Segundo es equivalente a que ca más menos ca, me da todo el espacio territorial fuerte.",
        "start": 3436.22,
        "end": 3443.22
    },
    {
        "text": " Si a que sea sólido quiere decir que en que sea un con oca,",
        "start": 3445.22,
        "end": 3450.22
    },
    {
        "text": " o tienes todo el espacio territorial fuerte.",
        "start": 3450.22,
        "end": 3453.22
    },
    {
        "text": " Si a que sea sólido quiere decir que en quien sumando los factores de ca y lo de menos ca,",
        "start": 3455.22,
        "end": 3460.22
    },
    {
        "text": " o tienes todo el espacio territorial.",
        "start": 3461.22,
        "end": 3463.22
    },
    {
        "text": " Y tres que ca, ca, solito contiene una base de B.",
        "start": 3464.22,
        "end": 3472.22
    },
    {
        "text": " Una base del espacio territorial.",
        "start": 3477.22,
        "end": 3479.22
    },
    {
        "text": " Esto también ayuda a entender esto de los colos.",
        "start": 3481.22,
        "end": 3484.22
    },
    {
        "text": " Entonces, demostración.",
        "start": 3487.22,
        "end": 3489.22
    },
    {
        "text": " Vamos a empezar con uno implicados.",
        "start": 3490.22,
        "end": 3492.22
    },
    {
        "text": " Rueitas.",
        "start": 3500.22,
        "end": 3501.22
    },
    {
        "text": " Queremos probar que vos sumando factores de ca y de menos ca, o tienes cualquier vector.",
        "start": 3503.22,
        "end": 3508.22
    },
    {
        "text": " Entonces, cuál es la hipótesis y qué cae sólido?",
        "start": 3509.22,
        "end": 3512.22
    },
    {
        "text": " Si cae sólido voy a hacer un dibujito que, a ver, dado en dimensión 2,",
        "start": 3513.22,
        "end": 3517.22
    },
    {
        "text": " porque en primera porque en dimensión 3 se ameco esta y en dimensión 4 no sea de dibujos.",
        "start": 3518.22,
        "end": 3523.22
    },
    {
        "text": " Para ponerle que tenés un con oca en dimensión 2,",
        "start": 3525.22,
        "end": 3529.22
    },
    {
        "text": " que dice la hipótesis 1 es sólido, si es sólido tiene un punto interior.",
        "start": 3529.22,
        "end": 3539.22
    },
    {
        "text": " Vamos a llamarlo, igual que le puse la demostración X.",
        "start": 3542.22,
        "end": 3545.22
    },
    {
        "text": " Y la bolita alrededor dentro del cor.",
        "start": 3549.22,
        "end": 3551.22
    },
    {
        "text": " X, como cae, es sólido, existe X pertenecer.",
        "start": 3552.22,
        "end": 3558.22
    },
    {
        "text": " Y ahora tienes el ciente al interior.",
        "start": 3559.22,
        "end": 3561.22
    },
    {
        "text": " Ya está la del dibujito, o sea, o sea, existe un Epsilon,",
        "start": 3562.22,
        "end": 3567.22
    },
    {
        "text": " tal que la bola del centro X y del radio Epsilon, está incluido un ca.",
        "start": 3568.22,
        "end": 3572.22
    },
    {
        "text": " Yo quiero probar que todo vector B se escribe como suma de 1 de ca y 1 de menos ca.",
        "start": 3578.22,
        "end": 3582.22
    },
    {
        "text": " Entonces, salga a un vector cualquiera en V,",
        "start": 3583.22,
        "end": 3585.22
    },
    {
        "text": " se a B pertenece en V.",
        "start": 3586.22,
        "end": 3588.22
    },
    {
        "text": " Entonces, yo digo que existe un delta mayor que 0,",
        "start": 3590.22,
        "end": 3594.22
    },
    {
        "text": " tal que delta B más X, a ver, urices, piensen conmigo.",
        "start": 3598.22,
        "end": 3604.22
    },
    {
        "text": " Ahora un vector cualquiera, los delta y los Epsilon como son en general,",
        "start": 3606.22,
        "end": 3611.22
    },
    {
        "text": " en nuestra imagen creada desde chiquitos.",
        "start": 3612.22,
        "end": 3615.22
    },
    {
        "text": " Entonces, la idea es que estoy achicando el B.",
        "start": 3616.22,
        "end": 3618.22
    },
    {
        "text": " Lo achico, lo chico lo chico, de tal manera que sumado con X, cae dentro de que quiero.",
        "start": 3619.22,
        "end": 3622.22
    },
    {
        "text": " O sea, si el delta lo más chiquito, no sé lo más chiquito,",
        "start": 3625.22,
        "end": 3630.22
    },
    {
        "text": " hasta que quepa dentro de la bola, porque X es centro de la bola.",
        "start": 3631.22,
        "end": 3634.22
    },
    {
        "text": " Tal que esto es igual a WB,",
        "start": 3636.22,
        "end": 3638.22
    },
    {
        "text": " un punto que esté adentro de la bola que estaba adentro.",
        "start": 3639.22,
        "end": 3642.22
    },
    {
        "text": " ¿Cierto?",
        "start": 3643.22,
        "end": 3644.22
    },
    {
        "text": " Y entonces,",
        "start": 3646.22,
        "end": 3647.22
    },
    {
        "text": " simplemente pasa un restando y dividiendo de lo que fuera,",
        "start": 3651.22,
        "end": 3655.22
    },
    {
        "text": " fíjense que el B se escribe como delta menos 1.",
        "start": 3656.22,
        "end": 3658.22
    },
    {
        "text": " Por WB, más se las puse por gusta así,",
        "start": 3659.22,
        "end": 3663.22
    },
    {
        "text": " este menos delta, la menos 1 por X.",
        "start": 3664.22,
        "end": 3668.22
    },
    {
        "text": " Pase arrestando el X y pase el delta dividiendo, del tan o cero, ¿no?",
        "start": 3671.22,
        "end": 3675.22
    },
    {
        "text": " Poco pasar dividiendo.",
        "start": 3676.22,
        "end": 3677.22
    },
    {
        "text": " ¿Dónde estaba WB?",
        "start": 3678.22,
        "end": 3680.22
    },
    {
        "text": " En la bola dentro de C.",
        "start": 3681.22,
        "end": 3682.22
    },
    {
        "text": " Entonces, delta, la menos 1, W, ¿dónde está?",
        "start": 3683.22,
        "end": 3686.22
    },
    {
        "text": " ¿Por qué está en C? Muy bien.",
        "start": 3688.22,
        "end": 3689.22
    },
    {
        "text": " Estoy multiplicando por un que?",
        "start": 3690.22,
        "end": 3691.22
    },
    {
        "text": " Un escalar que es positivo, exactamente.",
        "start": 3693.22,
        "end": 3696.22
    },
    {
        "text": " Por más que ese chiquito ahora muy grande, porque puse el inverso, es positivo.",
        "start": 3698.22,
        "end": 3701.22
    },
    {
        "text": " ¿Y qué pasa con este otro?",
        "start": 3702.22,
        "end": 3703.22
    },
    {
        "text": " El X, donde estaba, estaba en C.",
        "start": 3704.22,
        "end": 3705.22
    },
    {
        "text": " Multiplicado por lo que está en el 1, está en C.",
        "start": 3706.22,
        "end": 3708.22
    },
    {
        "text": " Y por lo tanto, si tiene un menos delante, esto está en,",
        "start": 3709.22,
        "end": 3711.22
    },
    {
        "text": " el menos C.",
        "start": 3712.22,
        "end": 3713.22
    },
    {
        "text": " Entonces, ¿qué probaste? Que cualquier vector se escribibe como 1 de C,",
        "start": 3714.22,
        "end": 3716.22
    },
    {
        "text": " más 1 de menos C.",
        "start": 3717.22,
        "end": 3718.22
    },
    {
        "text": " Es exactamente la T.",
        "start": 3719.22,
        "end": 3720.22
    },
    {
        "text": " Es muy fácil la demostración, pero fíjense que dice muchísimo ¿no?",
        "start": 3724.22,
        "end": 3731.22
    },
    {
        "text": " Bueno, ahora nos vamos a 2, implica 3.",
        "start": 3736.22,
        "end": 3739.22
    },
    {
        "text": " Yo me voy contento si hacemos este lema que es sencillo.",
        "start": 3740.22,
        "end": 3743.22
    },
    {
        "text": " No, voy a hacer 2, implica 3 y 3 implica 1.",
        "start": 3746.22,
        "end": 3748.22
    },
    {
        "text": " Voy a hacer circular la demostración. Como quiero probar que son 2 equivalentes,",
        "start": 3749.22,
        "end": 3751.22
    },
    {
        "text": " la voy a hacer así, se va a cambiar.",
        "start": 3751.22,
        "end": 3753.22
    },
    {
        "text": " Estimplica este, esta implica este y esta implica este.",
        "start": 3754.22,
        "end": 3758.22
    },
    {
        "text": " Eso van a hacer los pasos.",
        "start": 3759.22,
        "end": 3760.22
    },
    {
        "text": " Entonces 2, implica 3, toca ahora.",
        "start": 3774.22,
        "end": 3776.22
    },
    {
        "text": " Y tenemos.",
        "start": 3781.22,
        "end": 3782.22
    },
    {
        "text": " Todo vector lo puede escribir como suma de elemento de C.",
        "start": 3786.22,
        "end": 3790.22
    },
    {
        "text": " Yo quiero probar que hay toda una base de vectores que la puedes meter adentro el color.",
        "start": 3791.22,
        "end": 3795.22
    },
    {
        "text": " Fuerces ¿no?",
        "start": 3796.22,
        "end": 3797.22
    },
    {
        "text": " Hay una base de la muerte del color.",
        "start": 3798.22,
        "end": 3799.22
    },
    {
        "text": " Entonces, ¿qué hacemos? Consideramos.",
        "start": 3800.22,
        "end": 3802.22
    },
    {
        "text": " V1, V2, Vs que yo no sé cuánto hay, pero,",
        "start": 3805.22,
        "end": 3810.22
    },
    {
        "text": " conjunto, maximal, devectores,",
        "start": 3811.22,
        "end": 3817.22
    },
    {
        "text": " linealmente, independientes, en K.",
        "start": 3819.22,
        "end": 3824.22
    },
    {
        "text": " Linealmente independientes sabemos y maximal que quiere decir.",
        "start": 3828.22,
        "end": 3831.22
    },
    {
        "text": " O sea que no le caben más linealmente independientes.",
        "start": 3834.22,
        "end": 3837.22
    },
    {
        "text": " O sea, no tiene nada.",
        "start": 3838.22,
        "end": 3840.22
    },
    {
        "text": " Porque, ¿eh más? No, porque en RN, un conjunto,",
        "start": 3841.22,
        "end": 3845.22
    },
    {
        "text": " en máximo, en el EI que es.",
        "start": 3846.22,
        "end": 3847.22
    },
    {
        "text": " Olví bien se que estamos en el RN.",
        "start": 3848.22,
        "end": 3849.22
    },
    {
        "text": " Claro, lo conjunto, máximales, el EI son las bases.",
        "start": 3850.22,
        "end": 3853.22
    },
    {
        "text": " Y los conjuntos mínimales generadores son las bases.",
        "start": 3854.22,
        "end": 3858.22
    },
    {
        "text": " Un máximo, el EI es generador, un minimal generador,",
        "start": 3860.22,
        "end": 3863.22
    },
    {
        "text": " el EI exactamente.",
        "start": 3864.22,
        "end": 3866.22
    },
    {
        "text": " ¿Por qué exactamente cómo era la cosa?",
        "start": 3867.22,
        "end": 3869.22
    },
    {
        "text": " Si no fuera en el RN, acá no es un espacio vetorial,",
        "start": 3870.22,
        "end": 3874.22
    },
    {
        "text": " o sea que pensemos en el RN, olvíense de un por un instante de esto.",
        "start": 3875.22,
        "end": 3877.22
    },
    {
        "text": " ¿Cómo era en Galuno o al 2 de Macoro?",
        "start": 3878.22,
        "end": 3880.22
    },
    {
        "text": " Si no fuera generador, ¿qué hacía?",
        "start": 3881.22,
        "end": 3883.22
    },
    {
        "text": " Hay un vector que no generas.",
        "start": 3884.22,
        "end": 3885.22
    },
    {
        "text": " Entonces, ¿qué haces?",
        "start": 3886.22,
        "end": 3887.22
    },
    {
        "text": " Los metes en el conjunto y terminas probando que sigue siendo el EI.",
        "start": 3888.22,
        "end": 3891.22
    },
    {
        "text": " A el EI que tenía le puedes agregar un... ¿sacuaran el truco?",
        "start": 3892.22,
        "end": 3894.22
    },
    {
        "text": " Ah, no es generador, metelo.",
        "start": 3895.22,
        "end": 3897.22
    },
    {
        "text": " Y entonces, que te queda un EI más grande, entonces no era máximal, ¿sacuaran?",
        "start": 3898.22,
        "end": 3901.22
    },
    {
        "text": " Acá es un conjunto... ahí estamos hablando de espacios vectoriales.",
        "start": 3902.22,
        "end": 3905.22
    },
    {
        "text": " ¿Qué no es espacios vectorial? Pero, tienes un conjunto máximo de vector SLA",
        "start": 3906.22,
        "end": 3909.22
    },
    {
        "text": " y lo que yo digo, este...",
        "start": 3910.22,
        "end": 3913.22
    },
    {
        "text": " El principio, fíjese en lo que voy a decir, vamos a llamarlo así.",
        "start": 3918.22,
        "end": 3920.22
    },
    {
        "text": " Si a B, este...",
        "start": 3921.22,
        "end": 3925.22
    },
    {
        "text": " Yo lo que digo que B acá, abuso del lenguaje, genera acá.",
        "start": 3926.22,
        "end": 3931.22
    },
    {
        "text": " ¿Por qué digo que es un abuso del lenguaje?",
        "start": 3932.22,
        "end": 3934.22
    },
    {
        "text": " Alejandra, Alexandra.",
        "start": 3935.22,
        "end": 3937.22
    },
    {
        "text": " ¿Por qué es un abuso del lenguaje esto?",
        "start": 3940.22,
        "end": 3942.22
    },
    {
        "text": " Porque el cánose, un espacio vectorial.",
        "start": 3946.22,
        "end": 3949.22
    },
    {
        "text": " Es una sutileza, pero quería avisarlo, porque de pago en el asignado Prof.",
        "start": 3950.22,
        "end": 3953.22
    },
    {
        "text": " Esto se abuso el lenguaje porque no lo suele pasar.",
        "start": 3954.22,
        "end": 3956.22
    },
    {
        "text": " Pero se entiende que quiere decir con que genera, que todo vector de acá",
        "start": 3956.22,
        "end": 3960.22
    },
    {
        "text": " lo puedo escribir como combinación leñal de los delmenos de acá.",
        "start": 3960.22,
        "end": 3963.22
    },
    {
        "text": " Y que le haya llamado Belarga, es porque va a terminar siendo una base.",
        "start": 3964.22,
        "end": 3969.22
    },
    {
        "text": " Pero por ahora no sabemos nada.",
        "start": 3969.22,
        "end": 3971.22
    },
    {
        "text": " Pero, tan de acuerdo que genera acá,",
        "start": 3972.22,
        "end": 3976.22
    },
    {
        "text": " ¿Por qué? Si no genera acá, ¿qué haces?",
        "start": 3977.22,
        "end": 3980.22
    },
    {
        "text": " Al razo vector de acá, el que no está generado, lo metés al en conjunto",
        "start": 3981.22,
        "end": 3986.22
    },
    {
        "text": " y entonces el conjunto no era máxima en el ley.",
        "start": 3986.22,
        "end": 3988.22
    },
    {
        "text": " El mismo trumbo que hicieron en galú, en galú.",
        "start": 3989.22,
        "end": 3991.22
    },
    {
        "text": " ¿Cuál es lo que haces? ¿Paullo? ¿Me seguiste ahí?",
        "start": 3992.22,
        "end": 3994.22
    },
    {
        "text": " Sí.",
        "start": 3995.22,
        "end": 3996.22
    },
    {
        "text": " Está. Sí. ¿No te ha hecho ni no te da el saltamiento que...",
        "start": 3996.22,
        "end": 4000.22
    },
    {
        "text": " ¿Te da un mesión y el pertenejo?",
        "start": 4001.22,
        "end": 4003.22
    },
    {
        "text": " Yo no aprovecho de que vas.",
        "start": 4004.22,
        "end": 4005.22
    },
    {
        "text": " Simplemente dije que esto genera acá.",
        "start": 4006.22,
        "end": 4008.22
    },
    {
        "text": " ¿Por qué digo que ahora vamos a probar que es una base?",
        "start": 4009.22,
        "end": 4011.22
    },
    {
        "text": " Y no de acá, que es una base de todo el espacio de la literaria.",
        "start": 4012.22,
        "end": 4015.22
    },
    {
        "text": " Pero, ¿por qué? Lo repito una vez más. ¿Por qué genera acá?",
        "start": 4016.22,
        "end": 4018.22
    },
    {
        "text": " Si no generase acá, hay algún vector de acá que no está generado por estos elementos.",
        "start": 4019.22,
        "end": 4023.22
    },
    {
        "text": " A ese vector, metélo acá dentro al conjunto",
        "start": 4024.22,
        "end": 4027.22
    },
    {
        "text": " y te sigue quedando... Hay que probarlo, te sigue quedando el ley.",
        "start": 4028.22,
        "end": 4030.22
    },
    {
        "text": " Es una prohibita que se hace en el alumno.",
        "start": 4031.22,
        "end": 4033.22
    },
    {
        "text": " Y entonces, como te sigue quedando el ley, entonces este no era máxima.",
        "start": 4034.22,
        "end": 4036.22
    },
    {
        "text": " Había uno más que tenía más vectores",
        "start": 4037.22,
        "end": 4039.22
    },
    {
        "text": " y que se iba haciendo el ley.",
        "start": 4040.22,
        "end": 4041.22
    },
    {
        "text": " Entonces, por favor, no tenés que hay una prohibita para hacer como se hizo en galú en el alumno.",
        "start": 4042.22,
        "end": 4047.22
    },
    {
        "text": " Muy bien.",
        "start": 4048.22,
        "end": 4049.22
    },
    {
        "text": " Entonces, veis genera acá.",
        "start": 4050.22,
        "end": 4051.22
    },
    {
        "text": " Bueno.",
        "start": 4051.22,
        "end": 4052.22
    },
    {
        "text": " Pero ahora vamos a usar la hipótesis que tenemos, porque vamos de 2 a 3.",
        "start": 4056.22,
        "end": 4060.22
    },
    {
        "text": " La hipótesis es que ca más, menos ca, es b.",
        "start": 4061.22,
        "end": 4064.22
    },
    {
        "text": " Esa es la hipótesis.",
        "start": 4068.22,
        "end": 4069.22
    },
    {
        "text": " Entonces, piensen conmigo, en el pizarro.",
        "start": 4070.22,
        "end": 4074.22
    },
    {
        "text": " ¿Qué quiero probar yo?",
        "start": 4075.22,
        "end": 4077.22
    },
    {
        "text": " Es más, yo es de esa delante. Quiero probar que esta es una base.",
        "start": 4078.22,
        "end": 4080.22
    },
    {
        "text": " ¿No verdad?",
        "start": 4081.22,
        "end": 4082.22
    },
    {
        "text": " Entonces, ese es el objetivo. Probable que es una base.",
        "start": 4083.22,
        "end": 4085.22
    },
    {
        "text": " Resulta que con estos generas cualquier vector de K.",
        "start": 4086.22,
        "end": 4090.22
    },
    {
        "text": " Resulta que con esto generas cualquier vector de menos K.",
        "start": 4091.22,
        "end": 4096.219999999999
    },
    {
        "text": " Con lo supuesto.",
        "start": 4097.219999999999,
        "end": 4098.219999999999
    },
    {
        "text": " Si lo asumás, ¿qué generas?",
        "start": 4099.219999999999,
        "end": 4101.219999999999
    },
    {
        "text": " Quiero cualquier vector de B.",
        "start": 4102.219999999999,
        "end": 4104.219999999999
    },
    {
        "text": " Pero con quién es, con esto.",
        "start": 4105.219999999999,
        "end": 4106.219999999999
    },
    {
        "text": " Entonces, lo que digo es que esto...",
        "start": 4107.219999999999,
        "end": 4109.219999999999
    },
    {
        "text": " genera B.",
        "start": 4112.22,
        "end": 4113.22
    },
    {
        "text": " Pero ahora, B sí es un espacio vectorial.",
        "start": 4115.22,
        "end": 4118.22
    },
    {
        "text": " Y B genera B larga, genera U B.",
        "start": 4119.22,
        "end": 4123.22
    },
    {
        "text": " Y a la vez es un conjunto LA.",
        "start": 4124.22,
        "end": 4126.22
    },
    {
        "text": " Porque así está badado, un conjunto LA.",
        "start": 4127.22,
        "end": 4129.22
    },
    {
        "text": " Y ahora sí puedo decir.",
        "start": 4132.22,
        "end": 4133.22
    },
    {
        "text": " Entonces, B es una base de B.",
        "start": 4134.22,
        "end": 4138.22
    },
    {
        "text": " ¿Cuál es el concepto al final?",
        "start": 4139.22,
        "end": 4141.22
    },
    {
        "text": " Dos conceptos voy a destacar de esta demostración.",
        "start": 4143.22,
        "end": 4145.22
    },
    {
        "text": " Tengo más de un conjunto maximal LA en el cono y terminaste probando que es base.",
        "start": 4146.22,
        "end": 4152.22
    },
    {
        "text": " En particular probaste que es ese chiquita zen, ¿no?",
        "start": 4153.22,
        "end": 4155.22
    },
    {
        "text": " Porque estamos trabajando en el RN.",
        "start": 4155.22,
        "end": 4156.22
    },
    {
        "text": " O sea que adentro tenés N vector LA.",
        "start": 4157.22,
        "end": 4160.22
    },
    {
        "text": " Es importante eso.",
        "start": 4162.22,
        "end": 4163.22
    },
    {
        "text": " Pero además, en el medio probamos estos grises.",
        "start": 4164.22,
        "end": 4165.22
    },
    {
        "text": " Que ese conjunto maximal de vector generaba acá.",
        "start": 4165.22,
        "end": 4168.22
    },
    {
        "text": " Lo dijimos más de una vez que es un concepto importante.",
        "start": 4170.22,
        "end": 4172.22
    },
    {
        "text": " Porque de esta color rojo, porque en el siguiente terema que no vamos a llegar a dar hoy, se usa esto.",
        "start": 4173.22,
        "end": 4178.22
    },
    {
        "text": " Que si tomás un conjunto maximal de vectores, leñalmente, independiente, en N, K, generas todo el cono.",
        "start": 4179.22,
        "end": 4185.22
    },
    {
        "text": " Y importa el cono que sea.",
        "start": 4186.22,
        "end": 4187.22
    },
    {
        "text": " Acá no hemos usado hasta este momento rojo, no habíamos usado la hipótesis.",
        "start": 4188.22,
        "end": 4193.22
    },
    {
        "text": " Ese concepto general, un conjunto maximal de vectores ni a meti-dependiente en el cono, te lo genera.",
        "start": 4194.22,
        "end": 4200.22
    },
    {
        "text": " Entonces, quería destacar eso.",
        "start": 4201.22,
        "end": 4203.22
    },
    {
        "text": " Y no falta, te les implica uno, le robo.",
        "start": 4204.22,
        "end": 4207.22
    },
    {
        "text": " No, estamos bien, falta cuatro minutos para terminar la clase.",
        "start": 4208.22,
        "end": 4210.22
    },
    {
        "text": " Tré, se implica uno.",
        "start": 4217.22,
        "end": 4223.22
    },
    {
        "text": " Fíjense que son realmente distintos los conceptos.",
        "start": 4226.22,
        "end": 4229.22
    },
    {
        "text": " Uno es geometrico, ¿no?",
        "start": 4230.22,
        "end": 4232.22
    },
    {
        "text": " Esto es leñal, y esto es también digamos, esto es si quieres, y esto es algeoreal.",
        "start": 4233.22,
        "end": 4238.22
    },
    {
        "text": " Son bien conceptos distintos y son equivalentes para un color.",
        "start": 4239.22,
        "end": 4241.22
    },
    {
        "text": " Ahora, si tengo una base, quiero probar que es solio.",
        "start": 4242.22,
        "end": 4244.22
    },
    {
        "text": " O sea que hay un punto interior, en definitiva lo que quiero probar es que hay algún punto interior.",
        "start": 4244.22,
        "end": 4248.22
    },
    {
        "text": " Y miren que linda la demostración.",
        "start": 4249.22,
        "end": 4251.22
    },
    {
        "text": " Dice, más os voy a usar los mismos coeficientes, y no me lo sé todo eso, que acá.",
        "start": 4252.22,
        "end": 4255.22
    },
    {
        "text": " La base B se llama B1, B2, Bn.",
        "start": 4262.22,
        "end": 4266.22
    },
    {
        "text": " Una base Db, pero que está dentro de K.",
        "start": 4267.22,
        "end": 4271.22
    },
    {
        "text": " Todos los victores se están dentro de K.",
        "start": 4272.22,
        "end": 4274.22
    },
    {
        "text": " Entonces, o sea, lo que estoy diciendo es que cada...",
        "start": 4276.22,
        "end": 4281.22
    },
    {
        "text": " Lo repito porque bajó a un papel importante, o sea, ya está dicho, pero lo quiero ser pesado.",
        "start": 4282.22,
        "end": 4287.22
    },
    {
        "text": " Cada uno de los victores está en K.",
        "start": 4288.22,
        "end": 4290.22
    },
    {
        "text": " Entonces, curices, si yo tengo tres victores dentro de K, si lo sumo, tengo VN en realidad, pero...",
        "start": 4292.22,
        "end": 4300.22
    },
    {
        "text": " Si sumas, está en la dentro de K.",
        "start": 4301.22,
        "end": 4303.22
    },
    {
        "text": " Si lo multiplicas por escalar es mayor igual que Cero, está en la dentro de K.",
        "start": 4304.22,
        "end": 4307.22
    },
    {
        "text": " Esa es la cosa que te permite hacer un color, ¿no?",
        "start": 4308.22,
        "end": 4312.22
    },
    {
        "text": " Sumar y multiplicar por escalar es mayor igual que Cero.",
        "start": 4313.22,
        "end": 4315.22
    },
    {
        "text": " Entonces, considera en este conjunto.",
        "start": 4319.22,
        "end": 4321.22
    },
    {
        "text": " Lo sé, escucho, tiene muchas cosas para decir.",
        "start": 4331.22,
        "end": 4333.22
    },
    {
        "text": " ¿Están ahí dentro Cero y B1?",
        "start": 4355.22,
        "end": 4357.22
    },
    {
        "text": " Sí.",
        "start": 4357.22,
        "end": 4358.22
    },
    {
        "text": " Al ser la andada entre Cero y B1, puedo jugar con la hipotecisisa de los cone, son mayor igual que Cero.",
        "start": 4359.22,
        "end": 4365.22
    },
    {
        "text": " ¿Qué me dicen de este conjunto?",
        "start": 4367.22,
        "end": 4369.22
    },
    {
        "text": " Tiene muchas cosas.",
        "start": 4369.22,
        "end": 4370.22
    },
    {
        "text": " Perfecto, muy bien. ¿Por qué es un suco junto acá?",
        "start": 4371.22,
        "end": 4373.22
    },
    {
        "text": " Primero cosa que es el sur que es muy importante, porque es un suco junto acá.",
        "start": 4374.22,
        "end": 4377.22
    },
    {
        "text": " Con cosas mayores igual que Cero y sumando cosas que son de K.",
        "start": 4380.22,
        "end": 4383.22
    },
    {
        "text": " Perfecto. ¿Y qué es geometricamente eso?",
        "start": 4384.22,
        "end": 4386.22
    },
    {
        "text": " Píénsele en R2 o en R3 si quieren.",
        "start": 4388.22,
        "end": 4390.22
    },
    {
        "text": " Sí, que si hubiera liberado los coeficientes todo el espacio porque está en una base ¿no?",
        "start": 4392.22,
        "end": 4398.22
    },
    {
        "text": " Si hubiera liberado... pero si no hubiera liberado, ¿qué estás haciendo?",
        "start": 4399.22,
        "end": 4402.22
    },
    {
        "text": " Ponen el que son dos hectares, o son tres. ¿Si son dos qué estás haciendo?",
        "start": 4403.22,
        "end": 4406.22
    },
    {
        "text": " El segmento entre ellos. Si son tres, el triángulo entre ellos.",
        "start": 4408.22,
        "end": 4413.22
    },
    {
        "text": " Si son cuatro, el cuadra y así.",
        "start": 4414.22,
        "end": 4416.22
    },
    {
        "text": " Quiero decir, este es el cubo, el cubo enidimensional que tiene como verdices de sus factores.",
        "start": 4416.22,
        "end": 4424.22
    },
    {
        "text": " ¿Por qué vuelo qué estás haciendo es moviéndote entre Cero y uno?",
        "start": 4425.22,
        "end": 4428.22
    },
    {
        "text": " O sea, ¿cuánto pongo de cada uno para llegar a ser?",
        "start": 4429.22,
        "end": 4432.22
    },
    {
        "text": " Ponéle 2, ponéle 2.",
        "start": 4434.22,
        "end": 4436.22
    },
    {
        "text": " Dos factores, voy a agarrar a su vector y estás haciendo el segmento entre estos factores.",
        "start": 4437.22,
        "end": 4441.22
    },
    {
        "text": " Entonces, esto es un cubito enidimensional.",
        "start": 4441.22,
        "end": 4448.22
    },
    {
        "text": " Yo no puedo dibujarlo enidimensional, por supuesto.",
        "start": 4450.22,
        "end": 4453.22
    },
    {
        "text": " Pero lo que estamos haciendo es un cubito.",
        "start": 4454.22,
        "end": 4458.22
    },
    {
        "text": " Este...",
        "start": 4464.22,
        "end": 4465.22
    },
    {
        "text": " Lo pego acá, ahí.",
        "start": 4466.22,
        "end": 4467.22
    },
    {
        "text": " Pero este cubito está dentro, como hicieron ustedes, del cono.",
        "start": 4467.22,
        "end": 4474.22
    },
    {
        "text": " Un cono ahí.",
        "start": 4484.22,
        "end": 4485.22
    },
    {
        "text": " Y en ese cubito, ¿qué hay dentro del cubito?",
        "start": 4487.22,
        "end": 4491.22
    },
    {
        "text": " Está dentro del cono.",
        "start": 4492.22,
        "end": 4493.22
    },
    {
        "text": " Un cubito es el que tiene puntos interior, está lleno de puntos interior, no importa.",
        "start": 4493.22,
        "end": 4499.22
    },
    {
        "text": " O sea, no tiene una forma de bolita, pero eso tiene...",
        "start": 4500.22,
        "end": 4503.22
    },
    {
        "text": " O sea, lo que te quiero decir es este cubito, lo que me está diciendo es que su interior es novacío.",
        "start": 4504.22,
        "end": 4511.22
    },
    {
        "text": " Y está clarísimo que el interior del cubito está dentro del interior del conito,",
        "start": 4512.22,
        "end": 4517.22
    },
    {
        "text": " porque uno te atrasa el otro.",
        "start": 4517.22,
        "end": 4519.22
    },
    {
        "text": " Entonces, acabas de probar que el conno no, el interior del conno no hacía.",
        "start": 4520.22,
        "end": 4523.22
    },
    {
        "text": " Puede meter tu una cajita dentro del conno, la cajita tiene puntos interior.",
        "start": 4524.22,
        "end": 4528.22
    },
    {
        "text": " Entonces, esos son puntos interior, están bien del conno.",
        "start": 4529.22,
        "end": 4531.22
    },
    {
        "text": " ¿Tan de acuerdo?",
        "start": 4533.22,
        "end": 4534.22
    },
    {
        "text": " Es linda la matemática cuando se junta toda, ¿no?",
        "start": 4535.22,
        "end": 4537.22
    },
    {
        "text": " Que topología, que análisis, que...",
        "start": 4538.22,
        "end": 4540.22
    },
    {
        "text": " ¿cuál es un tercera de los puntos interior?",
        "start": 4541.22,
        "end": 4542.22
    },
    {
        "text": " Claro, claro, ahí hay infinito puntos interior, todos los puntos que están dentro de la caja del cubo.",
        "start": 4543.22,
        "end": 4546.22
    },
    {
        "text": " Fantó puntos interior.",
        "start": 4548.22,
        "end": 4549.22
    },
    {
        "text": " Bueno, muy bien chicos, tenemos mucho más para hablar de conos,",
        "start": 4551.22,
        "end": 4555.22
    },
    {
        "text": " pero será el martes que viene, para el lunes se va a estar el práctico de conos en el Eva.",
        "start": 4556.22,
        "end": 4563.22
    }
]