[
    {
        "text": " Bueno, vamos a comenzar. La charla de hoy es otro día vimos cómo la empresa definía,",
        "start": 0.0,
        "end": 27.64
    },
    {
        "text": " la decisión de definir cuánto producir. Ahora vamos a ver un poco asociado a esto,",
        "start": 27.64,
        "end": 34.4
    },
    {
        "text": " cómo define la cantidad de factores. Y esto es lo que vamos a ver.",
        "start": 34.4,
        "end": 39.64
    },
    {
        "text": " Este esquema es el que ustedes tienen en la bibliografía, nosotros vimos esta parte y si cómo la",
        "start": 43.14,
        "end": 48.94
    },
    {
        "text": " empresa definía la cantidad de productos que va a ofrecer, ya vamos a ver justamente cómo define",
        "start": 48.94,
        "end": 57.32
    },
    {
        "text": " la demanda de factores. Esto es asocia siempre al enfoque racional que estamos",
        "start": 57.32,
        "end": 67.5
    },
    {
        "text": " analizando o asumiendo que tienen la empresa. Por lo tanto, recordemos que lo que estamos diciendo",
        "start": 67.5,
        "end": 73.04
    },
    {
        "text": " es que la empresa va a perseguir un objetivo que es maximizar beneficios. Vamos a ver los",
        "start": 73.04,
        "end": 81.16
    },
    {
        "text": " elementos que vamos a utilizar, las dos herramientas principales son muy similares a lo que vamos",
        "start": 81.16,
        "end": 86.48
    },
    {
        "text": " a ver un poquito más adelante que es cuando veamos demanda del consumidor. Una vez que",
        "start": 86.48,
        "end": 92.16
    },
    {
        "text": " internalizemos bien el uso de estos herramientales, básicamente 2, ahí nos va a servir mucho para",
        "start": 92.16,
        "end": 99.88000000000001
    },
    {
        "text": " cuando veamos consumidor. Bueno, recordemos que estamos hablando siempre de una función de",
        "start": 99.88000000000001,
        "end": 106.36
    },
    {
        "text": " producción que utilizamos dos factores, capital y trabajo. Digo, porque el otro factor es tierra",
        "start": 106.36,
        "end": 112.36
    },
    {
        "text": " que no lo vamos a usar para no complicar. Básicamente podíamos decir que si una empresa produce",
        "start": 112.36,
        "end": 119.2
    },
    {
        "text": " dos bienes, cuyo único es un y cuyo dos, el uso de los factores productivos, capital y trabajo,",
        "start": 119.2,
        "end": 130.52
    },
    {
        "text": " obviamente puede ser diverso depende de la tecnología, la disponibilidad que tenga la empresa,",
        "start": 130.52,
        "end": 136.68
    },
    {
        "text": " etcétera, etcétera. ¿Qué quiere decir con esto? Que una misma cantidad de productos unidos",
        "start": 136.68,
        "end": 143.88
    },
    {
        "text": " en este caso se puede realizar con diferentes combinaciones de bienes. Eso es poco la idea tras",
        "start": 143.88,
        "end": 154.84
    },
    {
        "text": " ladar que infinitiva, yo puedo producir un bien según la tecnología que esté aplicando,",
        "start": 154.84,
        "end": 161.24
    },
    {
        "text": " utilizando mayor cantidad de capital o mayor cantidad de trabajo. En este caso, que estamos",
        "start": 161.24,
        "end": 167.24
    },
    {
        "text": " acotando la producción a dos bienes, podemos hablar de esta línea apuntiada sería el límite, la",
        "start": 167.24,
        "end": 174.8
    },
    {
        "text": " frontera de propiedades de producción cuando hay rendimiento costantes y esta línea que curva sería",
        "start": 174.8,
        "end": 183.0
    },
    {
        "text": " cuando hay rendimiento de creciente. Estéis ya lo vieron esto, pero esto lo podemos aplicar también",
        "start": 183.0,
        "end": 187.60000000000002
    },
    {
        "text": " en el caso del uso de los factores productivos que estamos analizando acá en esta función de la",
        "start": 188.12,
        "end": 193.51999999999998
    },
    {
        "text": " producción. Nifinitiva, quiero que queremos decir, en la empresa en este marco, te lo estamos",
        "start": 193.51999999999998,
        "end": 200.51999999999998
    },
    {
        "text": " analizando, va a situarse en algún punto de esta recta, sin el caso que sea constante",
        "start": 200.51999999999998,
        "end": 207.76
    },
    {
        "text": " de los rendimientos o de esta curva. Es decir, va a utilizar todos los factores que están disponibles,",
        "start": 207.76,
        "end": 212.44
    },
    {
        "text": " va a ser un uso eficiente de punto de esta económico y los recursos. No es posible que",
        "start": 213.04,
        "end": 218.44
    },
    {
        "text": " subí que en el área inferior de estas figuras, porque ahí estaría dejando de utilizar algún",
        "start": 218.44,
        "end": 224.2
    },
    {
        "text": " recurso y por supuesto no puede salir de la frontera porque no le da la posibilidad. Es un marco",
        "start": 224.2,
        "end": 231.32
    },
    {
        "text": " teórico, digamos, para que nos situemos, que definitiva estas figuras no están dando el máximo",
        "start": 231.32,
        "end": 236.72
    },
    {
        "text": " nivel de producción, que la empresa puede obtener con la disponibilidad de recursos que tiene",
        "start": 236.72,
        "end": 241.96
    },
    {
        "text": " la empresa y que está asociado, actualmente, a la tecnología que está aplicando.",
        "start": 241.96,
        "end": 248.2
    },
    {
        "text": " Bueno, recordando la función de producción, que es la combinación de factores productivos,",
        "start": 250.72,
        "end": 257.24
    },
    {
        "text": " capital y trabajo, para obtener un producto. Esa es un poco la idea de la función de producción",
        "start": 257.24,
        "end": 263.28
    },
    {
        "text": " que vinimos desarrollando. Y obviamente, como os estuimos viendo, dejamos de lado, la tierra es una",
        "start": 263.28,
        "end": 272.32
    },
    {
        "text": " función de capital y de trabajo y está asociado de la tecnología. Vimos también que en el largo",
        "start": 272.32,
        "end": 277.84
    },
    {
        "text": " plazo de la empresa, elegía ambos factores productivos y en el corto plazo el capital es fijo,",
        "start": 277.84,
        "end": 283.84
    },
    {
        "text": " por lo tanto la función de producción se tornaba definitiva de la variable L o trabajo.",
        "start": 283.84,
        "end": 291.2
    },
    {
        "text": " Entonces, lo dos componentes, la dos herramientas que vamos a utilizar es la crua de izocostos y la",
        "start": 293.28,
        "end": 299.03999999999996
    },
    {
        "text": " crua de izocuanta. Y tiene esta forma que está ahí en las gráficas que ustedes pueden observar ahí.",
        "start": 299.03999999999996,
        "end": 304.84
    },
    {
        "text": " Entonces, la crua de izocostos, esa línea recta que está acá, que nos está diciendo, bueno,",
        "start": 305.84,
        "end": 316.91999999999996
    },
    {
        "text": " para un montón total de costos, en este caso 10, es el mismo ejemplo que está en la referencia",
        "start": 317.48,
        "end": 323.28000000000003
    },
    {
        "text": " de videográfica. El punto de los extremos sería que solo utilizar un factor.",
        "start": 323.28000000000003,
        "end": 330.40000000000003
    },
    {
        "text": " Por lo tanto, acá estaría solo utilizando capital y aquí, obviamente, trabajo.",
        "start": 333.04,
        "end": 337.76
    },
    {
        "text": " En el trayecto, en el desplazamiento de esa recta sería, obviamente, con este mismo",
        "start": 339.88,
        "end": 346.36
    },
    {
        "text": " volumen de costos, una combinación de ambos factores, en un caso más intensivo capital y en",
        "start": 346.36,
        "end": 352.40000000000003
    },
    {
        "text": " otro caso más intensivo el trabajo. Como yo le dije, previamente, este punto A no sería un",
        "start": 352.40000000000003,
        "end": 359.44
    },
    {
        "text": " punto eficiente, no sería un punto que la empresa se iba a producir porque estaría implicando",
        "start": 359.44,
        "end": 365.12
    },
    {
        "text": " que estaría dejando recursos sin usar trabajo o capital en este caso, los dos en este caso.",
        "start": 365.12,
        "end": 372.44
    },
    {
        "text": " Y el punto de que está acá, el punto B sería un punto que la empresa se haría usar, pero no",
        "start": 373.32,
        "end": 379.4
    },
    {
        "text": " puede, porque no le dan las posibilidades de recursos que tienen. En definitiva, esta recta,",
        "start": 379.4,
        "end": 387.44
    },
    {
        "text": " esta gráfica oficia como la restricción, límite que le impone la empresa a producir sin volumen",
        "start": 387.44,
        "end": 396.84
    },
    {
        "text": " de costos, un monto de dinero destinado a contratar factores productivos, de que la desalecura.",
        "start": 396.88,
        "end": 402.88
    },
    {
        "text": " Con la combinación tecnológica o la tecnología que dispone, le va a dar determinada combinación y",
        "start": 404.88,
        "end": 410.4
    },
    {
        "text": " ahí va a tratar de lograr, obviamente, el punto de mejor mayor producción posible.",
        "start": 410.4,
        "end": 416.32
    },
    {
        "text": " La pendiente de esta recta es la relación de precios, donde ves alario y R es el precio",
        "start": 419.28,
        "end": 425.84
    },
    {
        "text": " hay capital. Vamos a ver qué es importante, ¿qué quiere decir esto?",
        "start": 425.84,
        "end": 431.15999999999997
    },
    {
        "text": " Nos está indicando cómo varía la cantidad de capital, por ejemplo, se aumenta en la cantidad",
        "start": 431.15999999999997,
        "end": 439.15999999999997
    },
    {
        "text": " de trabajo. Voy a ver al revés, pero conceptualmente es eso, es decir, si voy sustituyendo un factor por",
        "start": 439.15999999999997,
        "end": 449.23999999999995
    },
    {
        "text": " otro en qué proporción lo que se obtuviera. ¿Lo ven esto? Por otro lado está el lo que se conoce",
        "start": 449.24,
        "end": 461.92
    },
    {
        "text": " como la curva de Isocuant. La curva de Isocuant tiene esta forma, ahora vamos a ver alguna",
        "start": 461.92,
        "end": 467.64
    },
    {
        "text": " característica más, observe por la convención que se suele notar el eleje vertical, capital y",
        "start": 467.64,
        "end": 476.0
    },
    {
        "text": " el horizontal héroe. Eso es por notación, obviamente se puede arrevesar. ¿Qué quiere decir la",
        "start": 476.0,
        "end": 484.28
    },
    {
        "text": " curva de Isocuant? La curva de Isocuant nos está diciendo la diferentes combinaciones de capital",
        "start": 484.28,
        "end": 491.84
    },
    {
        "text": " y de trabajo, observen que acá a, a, a, b y c son diferentes combinaciones de estos factores,",
        "start": 491.84,
        "end": 498.0
    },
    {
        "text": " pero que me dan el mismo lumen de producción, un poco lo que yo les decía, una empresa puede",
        "start": 498.0,
        "end": 505.0
    },
    {
        "text": " producir un terminado producto de determinadas formas, pero obviamente puede alterar los factores y",
        "start": 505.0,
        "end": 512.36
    },
    {
        "text": " también producir ese producto, el fin o el lumen. Entonces, ahí está el tema de la disponibilidad",
        "start": 512.36,
        "end": 519.76
    },
    {
        "text": " de tecnología, lo lógica, los costos atrás y que es más conveniente a la empresa, si contratar",
        "start": 519.76,
        "end": 524.24
    },
    {
        "text": " más, más factor trabajo o contratar más factor capital. La pendiente de esta curva,",
        "start": 524.24,
        "end": 532.2
    },
    {
        "text": " es lo que se conoce como la tasa imaginaris de instrucción. Es decir, cuánto de capital va a",
        "start": 532.2,
        "end": 545.5600000000001
    },
    {
        "text": " renunciar por incrementar una unidad de trabajo, es un poco la idea conceptual, se toma una unidad",
        "start": 545.5600000000001,
        "end": 552.48
    },
    {
        "text": " para simplificar también, obviamente, pero esto está en términos infinitesimales. Entonces,",
        "start": 552.48,
        "end": 562.28
    },
    {
        "text": " tenemos la pendiente de estas, de estas, de estas gráficas que son conceptualmente importantes para",
        "start": 562.28,
        "end": 568.44
    },
    {
        "text": " esto que estamos tratando de narizar. Entonces, veamos un poquito más, cada una de estas curvas.",
        "start": 568.44,
        "end": 573.84
    },
    {
        "text": " Le hizo cuanta. Le hizo cuanta, como yo le he estado expresando,",
        "start": 574.8000000000001,
        "end": 582.84
    },
    {
        "text": " es decir, está diciendo, está expresando la diferente combinaciones de capital y de trabajo",
        "start": 582.84,
        "end": 589.9200000000001
    },
    {
        "text": " manteniendo constante nivel de producción. Obviamente acá estamos asumiendo intuitivamente",
        "start": 589.9200000000001,
        "end": 598.4000000000001
    },
    {
        "text": " que los factores se pueden sustituir, ¿no? Tensas que, a veces hay áreas o hay trabajo que no",
        "start": 598.4,
        "end": 605.04
    },
    {
        "text": " están sencillo sustituir máquinas por trabajadores, pero en este caso se sube, entiende que no hay esa",
        "start": 605.04,
        "end": 610.28
    },
    {
        "text": " refrupción, pero se los comento. Entonces, lo que está diciendo, obviamente, es que manteniendo",
        "start": 610.28,
        "end": 618.12
    },
    {
        "text": " este nivel de volumen de producción o el CUS constante, el desplazamiento sobre la curva",
        "start": 618.12,
        "end": 626.6
    },
    {
        "text": " y eso cuanta, nos está indicando justamente cómo se sustituye un factor por otro. Si lo",
        "start": 626.6,
        "end": 632.8000000000001
    },
    {
        "text": " mira de esta manera, lo que estoy haciendo es cómo reduzco capital en función de que voy",
        "start": 632.8000000000001,
        "end": 639.28
    },
    {
        "text": " a incrementar trabajo. Bueno, esta gráfica, repito, la que tiene ahí, es",
        "start": 639.28,
        "end": 656.08
    },
    {
        "text": " CUS 1, su volumen, se suele, suele vamos a utilizar estas funciones de producción, cada",
        "start": 656.08,
        "end": 663.32
    },
    {
        "text": " 0,5, el 0,5 de la función que hagan daño, justamente el nivel de producción y lo que va",
        "start": 663.32,
        "end": 672.6800000000001
    },
    {
        "text": " determinando la ISO cuanta. La tasa imagina de producción es la pendiente, la pendiente",
        "start": 672.6800000000001,
        "end": 681.96
    },
    {
        "text": " que indica esto en cada punto, ¿no? Eso en relación técnica a usar una niña más de trabajo,",
        "start": 681.96,
        "end": 690.24
    },
    {
        "text": " nos está expresando esta relación cuanta su nidades de capital renuncia en la empresa con",
        "start": 690.24,
        "end": 698.2
    },
    {
        "text": " la condición de que produzca la misma cantidad de CUS. Esta tasa imagina de producción es",
        "start": 698.2,
        "end": 709.44
    },
    {
        "text": " decreciente, es decir, a medida que nos vamos desplazando este en este sentido, y si vamos",
        "start": 709.44,
        "end": 716.8000000000001
    },
    {
        "text": " instituyendo capital por trabajo, cada vez la tasa es menor. Y este es un elemento que",
        "start": 716.8000000000001,
        "end": 728.6400000000001
    },
    {
        "text": " también juega en el tema de terminar qué cantidad de factores, trabajos o capital, se va",
        "start": 728.64,
        "end": 742.3199999999999
    },
    {
        "text": " a usar. Estamos asumiendo, además, que la putida de los factores es decreciente. Bueno, matemáticamente,",
        "start": 742.3199999999999,
        "end": 753.6
    },
    {
        "text": " si mantenemos constante la cantidad CUS, por lo tanto al incrementar trabajo, obviamente,",
        "start": 753.6,
        "end": 764.08
    },
    {
        "text": " hay un efecto positivo en el tema de marginales sobre CUS. La putida imagina que es dada por",
        "start": 764.08,
        "end": 774.4
    },
    {
        "text": " el incremento de L, y a su vez al reducir capital hay una reducción en términos marginales",
        "start": 774.4,
        "end": 783.04
    },
    {
        "text": " de la producción por C, en este caso se neutralizan ambos efectos y esa es la tasa imagina",
        "start": 783.04,
        "end": 788.64
    },
    {
        "text": " de producción. Tiene un elemento que el costiente de las putidas marginales, la putida imagina",
        "start": 788.64,
        "end": 794.16
    },
    {
        "text": " del trabajo de la putida imagina de capital, las derivadas parciales, entonces, este",
        "start": 794.16,
        "end": 803.28
    },
    {
        "text": " lo importante es que, como es lógico, se mantiene el nivel de producción igual, el efecto",
        "start": 803.28,
        "end": 817.76
    },
    {
        "text": " positivo que genera incrementar una unidad más de trabajo, tiene que compensarse con lo que",
        "start": 817.76,
        "end": 824.04
    },
    {
        "text": " reduzco de capital. Es un poco las ideas. En términos marginales de ahí el costiente de las",
        "start": 824.04,
        "end": 829.0799999999999
    },
    {
        "text": " productidades marginales, y esa es la tasa imagina de producción, o sea, como dice acá,",
        "start": 829.08,
        "end": 833.5600000000001
    },
    {
        "text": " a medida que nos vamos desplazando por lo hizo cuánta institución a capital por trabajo,",
        "start": 833.5600000000001,
        "end": 840.0
    },
    {
        "text": " la putida imagina del capital y del trabajo se compensan en conjunto en la tasa imagina",
        "start": 840.0,
        "end": 848.24
    },
    {
        "text": " de producción diminucia. Una empresa, obviamente, cuando uno pretende producir, trata de",
        "start": 848.24,
        "end": 862.5600000000001
    },
    {
        "text": " producir la mayor cantidad posible, por lo tanto, en cuanto a ISO cuántas, la empresa",
        "start": 862.5600000000001,
        "end": 868.36
    },
    {
        "text": " le puede enfrentar a un mapa infinito de ISO cuántas. El recordemos que esto está expresando",
        "start": 868.36,
        "end": 874.28
    },
    {
        "text": " diferentes combinaciones de capital y trabajo que permiten un volumen de producción constante.",
        "start": 874.28,
        "end": 880.4
    },
    {
        "text": " Acá tenemos un millón y ahí va subiendo la cantidad de Google, a medida que nos vamos",
        "start": 880.4,
        "end": 885.68
    },
    {
        "text": " a desplazando del origen. ¿Qué otras componentes que tienen cuenta con estas curvas? Bueno,",
        "start": 885.68,
        "end": 894.72
    },
    {
        "text": " son de crecientes, como ustedes pueden ver, de izquierda derecha, no se cortan entre ellas.",
        "start": 894.72,
        "end": 901.52
    },
    {
        "text": " Asesú me que no se cortan los ejes, no se podría producir este caso, no se puede",
        "start": 901.52,
        "end": 910.16
    },
    {
        "text": " producir como un solo factor, son con bexas, se valor recursos casos por rendimiento",
        "start": 910.16,
        "end": 915.76
    },
    {
        "text": " a majerales de crecientes, e denso el mapa, a infinita ISO cuántas, y obviamente hay una",
        "start": 915.76,
        "end": 922.0799999999999
    },
    {
        "text": " mayor producción cuando me alejo del origen. Vamos a manejarlo con este tipo de curvas,",
        "start": 922.0799999999999,
        "end": 928.36
    },
    {
        "text": " ante menos generales, igual yo les es mencionar algunos casos, sumamente particulares,",
        "start": 928.36,
        "end": 934.64
    },
    {
        "text": " solo para justamente salvar esto que no quede que son las únicas que hay, pero se los voy",
        "start": 934.64,
        "end": 943.36
    },
    {
        "text": " a mencionar, además como casos particulares. Vamos a hablar de la curva ISO cuánta, cuando",
        "start": 943.36,
        "end": 949.96
    },
    {
        "text": " hay una función de producción de proporciones fijas, es decir, faltore que se complementan",
        "start": 949.96,
        "end": 956.9200000000001
    },
    {
        "text": " una forma perfecta, y también factores productivos que son sustitutos perfectos. Entonces,",
        "start": 956.92,
        "end": 962.64
    },
    {
        "text": " tenemos un caso de una curva ISO cuántas particulares, en esta forma de él, donde los factores",
        "start": 962.64,
        "end": 972.36
    },
    {
        "text": " se utilizan propciones fijas, no se puede sustituir, y para obtener una mayor producción",
        "start": 972.36,
        "end": 977.56
    },
    {
        "text": " necesito aumentar K y L en una determinada proporción. Y este caso sería cuando hay factores",
        "start": 977.56,
        "end": 989.8
    },
    {
        "text": " sustitutos que son totalmente perfectos un y otro, obtengo los niveles de producto",
        "start": 989.8,
        "end": 995.5999999999999
    },
    {
        "text": " en A, B y C, y obviamente la pendiente acá es una constante. Son los casos particulares,",
        "start": 995.5999999999999,
        "end": 1001.88
    },
    {
        "text": " se los menciono, pero en la edificia nos vamos a trabajar con las que yo les estoy mencionando,",
        "start": 1001.88,
        "end": 1007.28
    },
    {
        "text": " anteriormente, es decir, hay una situación de un bien por otro, la tasa más reducción",
        "start": 1007.28,
        "end": 1014.3399999999999
    },
    {
        "text": " queda es de creciente y se mantiene el nivel de producción.",
        "start": 1014.3399999999999,
        "end": 1018.16
    },
    {
        "text": " ¿Preguntas? Vamos a ver la otra herramienta que es la disocosto, es decir, acá vamos a introducir,",
        "start": 1018.16,
        "end": 1035.56
    },
    {
        "text": " ya no el tema tecnológico, como era el tema de la disoccuántal, sino directamente",
        "start": 1035.56,
        "end": 1040.1
    },
    {
        "text": " el tema de los costos de los factores productivos. Es decir, acá lo que estamos analizando",
        "start": 1040.1,
        "end": 1049.28
    },
    {
        "text": " es la diferentes combinaciones que la empresa puede realizar de capital y de trabajo, de",
        "start": 1049.28,
        "end": 1055.8
    },
    {
        "text": " contratar capital y trabajo gastando el lo mismo, con lo mismo costo. Esa es la idea.",
        "start": 1055.8,
        "end": 1063.08
    },
    {
        "text": " Entonces, recorremos que el costo total es WD por L y más R por K.",
        "start": 1063.08,
        "end": 1071.4399999999998
    },
    {
        "text": " ¿Dolevez es salario? L es, ahora, su cantidad personal. R es el precio de capital y K,",
        "start": 1071.4399999999998,
        "end": 1081.1999999999998
    },
    {
        "text": " yo la son de físicas. WD y R bienedado por el mercado, estamos en competencia perfecta,",
        "start": 1081.1999999999998,
        "end": 1088.96
    },
    {
        "text": " la empresa no es sido absolutamente nada en el precio ni de los bienes y los factores.",
        "start": 1088.96,
        "end": 1094.02
    },
    {
        "text": " Lo que estamos viendo acá en este caso es dotación de capital y de trabajo, y particularmente",
        "start": 1094.02,
        "end": 1101.6000000000001
    },
    {
        "text": " lo que indica esta gráfica es justamente diferentes combinaciones de capital y trabajo,",
        "start": 1101.6000000000001,
        "end": 1107.24
    },
    {
        "text": " pero que su costo es el mismo. Entonces, obviamente el punto este acá sería donde",
        "start": 1107.24,
        "end": 1118.8400000000001
    },
    {
        "text": " todo el gasto sería en Fator K y obviamente este sería el revés, que solo utilizaría",
        "start": 1119.3999999999999,
        "end": 1127.08
    },
    {
        "text": " fatorele. No suelen ser casos muy comunes, además no lo vamos a considerar, pero les menciono",
        "start": 1127.08,
        "end": 1135.48
    },
    {
        "text": " por las dudas que no suelen ser casos comunes. Es general, este le inmesa mayoría de las",
        "start": 1135.48,
        "end": 1140.6
    },
    {
        "text": " funciones de producción o las dotaciones de recursos se distribuyen en contratar ambos.",
        "start": 1140.6,
        "end": 1146.1599999999999
    },
    {
        "text": " ¿Qué son que? No, acá podría llegar a dar que se debe ser matemáticamente captableando,",
        "start": 1146.16,
        "end": 1165.2
    },
    {
        "text": " conceptualmente no lo vamos a considerar, por eso que sea vos, para poder generar.",
        "start": 1165.2,
        "end": 1169.3200000000002
    },
    {
        "text": " No, claro, aunque si me voy del modelo, me voy del modelo ratito un minuto en un segundo,",
        "start": 1169.32,
        "end": 1178.9199999999998
    },
    {
        "text": " hoy por hoy como está el tema tecnológico, yo no descartaría el tema de que puede darse,",
        "start": 1178.9199999999998,
        "end": 1187.08
    },
    {
        "text": " ¿no? O cero o próximo a cero, podría darse. De hecho, en algunos casos ya está, por",
        "start": 1187.08,
        "end": 1198.84
    },
    {
        "text": " ejemplo, hay pedajes acá en Uruguay, no, pero en otros lados hay pedajes que ya no es solo",
        "start": 1198.84,
        "end": 1203.24
    },
    {
        "text": " automatizado, no hay una de personas en humano. Es más, si es una tarjeta con chip, también no pasás,",
        "start": 1203.24,
        "end": 1213.24
    },
    {
        "text": " pero bueno, me fui. Entonces, estamos considerando acá costos, variables económicas y que juegan",
        "start": 1213.24,
        "end": 1228.32
    },
    {
        "text": " estamos suponiendo además un elemento que se les menciona el pasar, que utiliza todos los",
        "start": 1229.32,
        "end": 1235.76
    },
    {
        "text": " fondos disponibles, el empresario es eficiente, es racional, va a tratar de maximizar su ganancia,",
        "start": 1235.76,
        "end": 1243.9199999999998
    },
    {
        "text": " va a tratar de obtener obviamente lo más yo beneficio y va a utilizar todos los recursos disponibles.",
        "start": 1243.9199999999998,
        "end": 1248.96
    },
    {
        "text": " O sea, que de punto de vista formal, matemáticamente hablando, ¿qué quiere decir esto? Como expresa",
        "start": 1258.32,
        "end": 1264.04
    },
    {
        "text": " ahí la transparencia, ¿no? La positiva. Hay ese lugar geomético, el frente es punto del plano,",
        "start": 1264.04,
        "end": 1270.2
    },
    {
        "text": " que representa las diferentes combinaciones de los factores capital y trabajo, donde la empresa",
        "start": 1270.2,
        "end": 1277.04
    },
    {
        "text": " utilizando todo su fondo disponible y nada más que eso, en la contratación de factores.",
        "start": 1277.04,
        "end": 1287.24
    },
    {
        "text": " Utiliza todo el dinero que tiene, o sea en este caso el costo total es 10, lo que puede variar",
        "start": 1298.08,
        "end": 1305.2
    },
    {
        "text": " es esta combinación, pero cualquier combinación acá, G, H, cualquier es 10, pues lo que expresábamos",
        "start": 1305.2,
        "end": 1315.68
    },
    {
        "text": " hoy no sería racional, que si se estuera acá porque estaría utilizando, no sé, ¿sais o qué",
        "start": 1315.68,
        "end": 1322.72
    },
    {
        "text": " sé? Entonces, que haría fondos que le permitiría producir más, y acá cualquier punto fuera",
        "start": 1322.72,
        "end": 1330.72
    },
    {
        "text": " presaría más de 10, no llega. Bueno, esto es una cuestión de la recta, despejamos en este caso",
        "start": 1330.72,
        "end": 1340.24
    },
    {
        "text": " que K, ¿verdad? Y quedaría a esta función, ¿no? De costo total, despejamos K, o sea el costo total",
        "start": 1340.24,
        "end": 1348.88
    },
    {
        "text": " menos el costo variable dividido R, y se deriva a mostre, tenemos la pendiente que es la relación de",
        "start": 1348.88,
        "end": 1357.6000000000001
    },
    {
        "text": " precios que eso le ve sobre R. ¿Qué interpretación le damos a la pendiente? Bueno, yo se lo expresaba",
        "start": 1357.6,
        "end": 1371.76
    },
    {
        "text": " su trato. ¿Cuánto se debe intercame en el mercado de capital para obtener unidad más de trabajo?",
        "start": 1371.76,
        "end": 1378.7199999999998
    },
    {
        "text": " ¿Ese conceptualmente la idea? ¿Con qué restricción o qué condición que se gaste lo mismo,",
        "start": 1378.72,
        "end": 1387.84
    },
    {
        "text": " manteniendo el mismo costo? ¿Cuántas unidades de capital renunció para obtener una más de trabajo?",
        "start": 1387.84,
        "end": 1395.04
    },
    {
        "text": " Con la salvedad de que el monto que voy a gastar es igual. Entonces, estamos hablando de la",
        "start": 1395.04,
        "end": 1408.28
    },
    {
        "text": " empresa, está tratando de definir su adaptación de capital, capital y trabajo, ahí ponemos",
        "start": 1408.28,
        "end": 1415.8
    },
    {
        "text": " largo plazo porque sabemos que en el corto plazo una vez que define el capital, la empresa,",
        "start": 1415.8,
        "end": 1420.46
    },
    {
        "text": " lo vio que va a determinar, se lo lee el en, pero lo le ves bien edado. ¿Qué objetivo podemos",
        "start": 1420.46,
        "end": 1429.02
    },
    {
        "text": " visualizar de la empresa? Bueno, podemos ver dos que nos llevan al mismo resultado. Por un lado,",
        "start": 1429.02,
        "end": 1435.8600000000001
    },
    {
        "text": " minimizar los costos para obtener un nivel de producción. Vamos a suponer que la empresa fija un",
        "start": 1435.8600000000001,
        "end": 1441.46
    },
    {
        "text": " volumen de producción cualquiera y si bueno, ¿cuál es la forma de producir, cuál lo hago con",
        "start": 1441.46,
        "end": 1449.1000000000001
    },
    {
        "text": " lo menor costo posible? Es eso que eso es una forma. Entonces, para uno eso cuantas fija, el",
        "start": 1449.1,
        "end": 1456.6399999999999
    },
    {
        "text": " cúfijo, ¿cuál es en definitiva la recta y son costos que implica el menor costo total para",
        "start": 1456.6399999999999,
        "end": 1468.6599999999999
    },
    {
        "text": " la empresa, el menor gasto. Bueno, en esta gráfica se verifica, se verifica cuál es,",
        "start": 1468.66,
        "end": 1479.1000000000001
    },
    {
        "text": " exactamente, la curva de hizo costos que la empresa va a lograr este objetivo.",
        "start": 1479.1000000000001,
        "end": 1485.8200000000002
    },
    {
        "text": " Vean, por ejemplo, en esta curva, 7.1, que está acá, la más próxima lorigen, está,",
        "start": 1485.82,
        "end": 1495.8999999999999
    },
    {
        "text": " ahí, obviamente, la que tiene menor costo, la que definitivamente, podía si fuera o fuera,",
        "start": 1495.8999999999999,
        "end": 1503.1799999999998
    },
    {
        "text": " la podía producir ahí, pero con eso no puede, con esta curva no logra adquirir la dotación",
        "start": 1503.1799999999998,
        "end": 1510.4199999999998
    },
    {
        "text": " de recursos, capital y trabajo como para poder producir la cantidad cus 1, ¿no? O sea,",
        "start": 1510.42,
        "end": 1516.26
    },
    {
        "text": " lo que está más lejos la curva. Por lo tanto, esa no puede ser, esta que está",
        "start": 1516.26,
        "end": 1524.98
    },
    {
        "text": " que arriba, que corta a la recta de hizo costos en G y H, bueno, podría ser, habría que ver,",
        "start": 1524.98,
        "end": 1533.7
    },
    {
        "text": " pero vemos que hay otro punto acá de tangencia que es el punto O y sabemos que tanto en",
        "start": 1533.7,
        "end": 1542.3400000000001
    },
    {
        "text": " el punto, estos puntos H, O y G se produce lo mismo, pero observen que si la empresa",
        "start": 1542.3400000000001,
        "end": 1553.6200000000001
    },
    {
        "text": " elige esta, o sea que corta el punto H o este punto G, estaría en un momento de costos",
        "start": 1553.62,
        "end": 1564.8999999999999
    },
    {
        "text": " superior a esta el punto O, produciendo lo mismo. Por lo tanto, se verifica que la empresa",
        "start": 1564.8999999999999,
        "end": 1573.9399999999998
    },
    {
        "text": " va a optimizar o va, en este caso lograr el objetivo de lograr un volumen de producción",
        "start": 1573.9399999999998,
        "end": 1579.54
    },
    {
        "text": " determinado al menor costo posible en el punto de tangencia entre estos instrumentos, la curva",
        "start": 1579.54,
        "end": 1587.34
    },
    {
        "text": " hizo cuanta y la hizo costos. Cualquier otro punto o gasta más o produce menos, es ineficiente.",
        "start": 1587.34,
        "end": 1594.5
    },
    {
        "text": " ¿Te ve? Por lo tanto, va a elegir una dotación de capital y trabajo, este es justo determinado",
        "start": 1597.54,
        "end": 1606.94
    },
    {
        "text": " en este punto O, está ahí que indica el punto de tangencia entre estos instrumentos.",
        "start": 1606.94,
        "end": 1611.74
    },
    {
        "text": " ¿Qué otra posibilidad puede ser? Bueno, pues, en vez de que la empresa diga bueno, para producir un volumen",
        "start": 1620.94,
        "end": 1627.42
    },
    {
        "text": " fijo, ¿cuál es los mínimos costos posibles, cómo puedo maximizar la producción con un",
        "start": 1627.42,
        "end": 1633.66
    },
    {
        "text": " monto de costos dado? Tengo tanto dinero para gastar en capital y trabajo, ¿cuál es el punto",
        "start": 1633.66,
        "end": 1642.3000000000002
    },
    {
        "text": " óptimo? ¿Cómo puedo realmente hacer rendir esta dotación de recursos que me permitan",
        "start": 1642.3000000000002,
        "end": 1648.38
    },
    {
        "text": " maximizar la producción? Entonces, esto es tan ventanálogo, ¿no? Simplemente lo que queda fijo",
        "start": 1648.38,
        "end": 1659.94
    },
    {
        "text": " acá es el costo. Entonces, al ser fijo el costo lo mismo, es decir, el empresario se enfrenta a un",
        "start": 1659.94,
        "end": 1669.42
    },
    {
        "text": " mapa de insoquantas infinito, va a tratar de obviamente de producir aquel volumen de producción,",
        "start": 1669.42,
        "end": 1677.8600000000001
    },
    {
        "text": " con aquella y yo cuenta que temas lejos del origen, porque la que tiene mayor volumen de unidades,",
        "start": 1677.86,
        "end": 1683.02
    },
    {
        "text": " pero ¿qué pasa? Por ejemplo, esta curso 2 sería la de la que está expresada esta gráfica,",
        "start": 1683.02,
        "end": 1689.02
    },
    {
        "text": " la mayor, pero no puede, con los recursos que tienen lo que ha querido, por lo tanto no va.",
        "start": 1689.02,
        "end": 1695.6999999999998
    },
    {
        "text": " Y analagamente lo que habíamos recién en esta curva disocuanta, corta la curva disocosta en los",
        "start": 1695.7,
        "end": 1708.7
    },
    {
        "text": " puntos J y K, ¿y qué ocurre con esto? Ocurre que la empresa está gastando lo mismo que acá en el",
        "start": 1708.7,
        "end": 1718.54
    },
    {
        "text": " punto O, pero obtiene un volumen de producción inferior, por lo tanto se demuestra nuevamente que",
        "start": 1718.54,
        "end": 1726.22
    },
    {
        "text": " esto no le conviene y que le va a convenir el punto de tangencia, o sea que con este mismo costo",
        "start": 1726.22,
        "end": 1733.3
    },
    {
        "text": " que lo que gasta en J y K obtiene un nivel de producción superior, por lo tanto ambos",
        "start": 1733.3,
        "end": 1739.98
    },
    {
        "text": " instrumentos convergen a lo mismo, es decir, optimizar los recursos K y L, uno fijando la",
        "start": 1739.98,
        "end": 1746.26
    },
    {
        "text": " producción y otro fijando el volumen de dinero que gasta en K y L. Por lo tanto el punto",
        "start": 1746.26,
        "end": 1753.1
    },
    {
        "text": " donde optimiza la empresa, los recursos, el punto de la mente donde va a maximizar su producción,",
        "start": 1753.1,
        "end": 1761.5
    },
    {
        "text": " o minimizar sus costos va a ser el punto de tangencia, es decir, cuando sigualan las pendientes",
        "start": 1761.5,
        "end": 1767.86
    },
    {
        "text": " de estas dos curvas que estuvimos viendo, o sea que maximizar la producción o minimizar los costos",
        "start": 1767.86,
        "end": 1775.58
    },
    {
        "text": " convergen a esto que yo le estoy diciendo, la pendiente de la ISO cuanta siguala a la pendiente",
        "start": 1776.58,
        "end": 1784.78
    },
    {
        "text": " de la curva ISO cortos, o sea la tasa más genera institución siguala a la relación de",
        "start": 1784.78,
        "end": 1790.6599999999999
    },
    {
        "text": " empresas.",
        "start": 1790.74,
        "end": 1815.0600000000002
    },
    {
        "text": " ¿Qué es conceptualmente esto? Esto está comparando la relación tecnológica, es decir, la relación",
        "start": 1815.06,
        "end": 1827.1
    },
    {
        "text": " en la cual la empresa está dispuesta a sustituir capital por trabajo, la punto vista tecnológico,",
        "start": 1827.1,
        "end": 1834.74
    },
    {
        "text": " comparado con la relación de precios. Bueno, la cambio tecnológico para mantenir un nivel",
        "start": 1834.74,
        "end": 1841.3799999999999
    },
    {
        "text": " de producción, ¿no? Con la relación de precios que hizo sí son datos del mercado, ¿no? Hoy",
        "start": 1841.38,
        "end": 1846.46
    },
    {
        "text": " estos son datos del mercado, salario, el precio del capital. O sea, la relación intercambio",
        "start": 1846.46,
        "end": 1859.9
    },
    {
        "text": " que la empresa tecnologicamente está dispuesta a realizar, tiene que coincidir con la",
        "start": 1859.9,
        "end": 1864.6200000000001
    },
    {
        "text": " intercambio que impone el mercado a través de los precios y los factores. Y ese es el óptimo,",
        "start": 1864.62,
        "end": 1869.7399999999998
    },
    {
        "text": " ¿no? Y justamente en el punto O, en ambos casos, es cuando coinciden las pendientes.",
        "start": 1869.7399999999998,
        "end": 1879.9799999999998
    },
    {
        "text": " ¿Preguntas? ¿Qué pasa, obviamente, si una vez que la empresa determina que este punto",
        "start": 1879.98,
        "end": 1898.82
    },
    {
        "text": " sea el punto mejor, el punto óptimo, o que el ruincamio en las condiciones iniciales,",
        "start": 1898.82,
        "end": 1904.94
    },
    {
        "text": " por ejemplo, ocurre un cambio acá, que el precio de una de los factores varía. Por ejemplo,",
        "start": 1904.94,
        "end": 1912.96
    },
    {
        "text": " sube los salarios. Sube los salarios y observen que se mantiene el fondo disponible para",
        "start": 1912.96,
        "end": 1919.98
    },
    {
        "text": " gastar si es siendo el mismo, ¿no? Entonces, obviamente se corre la pendiente saltera, ¿no?",
        "start": 1919.98,
        "end": 1928.14
    },
    {
        "text": " Se corre el curro de costos. O sea, ahora ya no puedo querir esta cantidad de salarios,",
        "start": 1928.14,
        "end": 1934.18
    },
    {
        "text": " al kilómenos. El capital es altera, por tanto, ahí sigo partiendo el mismo punto. ¿Y",
        "start": 1934.18,
        "end": 1940.66
    },
    {
        "text": " qué esto me implica del punto de vista de producción? Bueno, esto me implica, obviamente, que voy",
        "start": 1940.66,
        "end": 1945.66
    },
    {
        "text": " a pasar el nuevo punto óptimo, a un nuevo punto donde siguen las pendientes de ISOCOS,",
        "start": 1945.66,
        "end": 1952.5400000000002
    },
    {
        "text": " ISOCWANT, pero ya voy a estar a un ISOCWANT a inferior. Ya no voy a producir lo que produciría",
        "start": 1952.58,
        "end": 1959.74
    },
    {
        "text": " antes. Por lo tanto, la curva de ISOCWANT, la curva de ISOCOST, gira acá y corta, bueno, este",
        "start": 1959.74,
        "end": 1966.6599999999999
    },
    {
        "text": " punto es totalmente demostrativo, puede estar en otro lado, ¿no? Pero lo que sí, tiene que ser un",
        "start": 1966.6599999999999,
        "end": 1971.3
    },
    {
        "text": " volumen de producción inferior a este ó inicial. Obviamente, estamos saludo que el costo",
        "start": 1971.3,
        "end": 1980.28
    },
    {
        "text": " subió si el costo baja, es al revés.",
        "start": 1980.28,
        "end": 1984.18
    },
    {
        "text": " Si bajan los salarios, me permite producir más,",
        "start": 1984.18,
        "end": 1986.94
    },
    {
        "text": " paso en eso cuanta superior.",
        "start": 1986.94,
        "end": 1988.92
    },
    {
        "text": " Si un poco le da que está trasladada acá.",
        "start": 1988.92,
        "end": 1991.06
    },
    {
        "text": " ¿Qué pasa si aumenta la cantidad de dinero disponible",
        "start": 1994.02,
        "end": 1996.74
    },
    {
        "text": " para comprofactores?",
        "start": 1996.74,
        "end": 1999.54
    },
    {
        "text": " Bueno, si aumenta la cantidad de dinero para comprofactores,",
        "start": 1999.54,
        "end": 2002.7
    },
    {
        "text": " en este caso 16, siempre manteniendo constante",
        "start": 2002.7,
        "end": 2005.94
    },
    {
        "text": " del resto de los componentes.",
        "start": 2005.94,
        "end": 2009.7
    },
    {
        "text": " Entonces, la reta y soco esto, obviamente se corre para",
        "start": 2009.7,
        "end": 2014.56
    },
    {
        "text": " la derecha.",
        "start": 2014.56,
        "end": 2016.56
    },
    {
        "text": " Lo que permite es que permite adquirir más costación,",
        "start": 2019.9,
        "end": 2025.6000000000001
    },
    {
        "text": " o a veces más costación de capital,",
        "start": 2025.6000000000001,
        "end": 2027.32
    },
    {
        "text": " y yo capital de trabajo.",
        "start": 2027.32,
        "end": 2030.8400000000001
    },
    {
        "text": " Y en definitiva, me redunda en que puedo lograr tangencia",
        "start": 2030.8400000000001,
        "end": 2036.24
    },
    {
        "text": " a una curva superior de hizo cuanta, una curva de mayor producción.",
        "start": 2036.24,
        "end": 2042.24
    },
    {
        "text": " Por lo tanto, me permite producir más, por mayor uso, recursos.",
        "start": 2042.24,
        "end": 2047.64
    },
    {
        "text": " Bueno, puede cambiar la tecnología también.",
        "start": 2047.64,
        "end": 2066.7200000000003
    },
    {
        "text": " Si cambia la tecnología que permite tener la misma producción",
        "start": 2066.7200000000003,
        "end": 2069.8
    },
    {
        "text": " con una menor cantidad de recursos o una mayor producción",
        "start": 2069.8,
        "end": 2074.12
    },
    {
        "text": " con los factores costantes.",
        "start": 2074.12,
        "end": 2076.56
    },
    {
        "text": " Entonces, en definitiva, bueno, se obtiene más producto.",
        "start": 2076.56,
        "end": 2083.56
    },
    {
        "text": " Se obtiene, perdón, se obtiene el mismo producto que tenía antes,",
        "start": 2083.56,
        "end": 2089.16
    },
    {
        "text": " pero a una línea de costo menor.",
        "start": 2089.16,
        "end": 2091.7599999999998
    },
    {
        "text": " En definitiva, estamos asumiendo acá que el cambio de tecnológico es positivo.",
        "start": 2091.7599999999998,
        "end": 2097.24
    },
    {
        "text": " Entonces, eso siempre se traduce con una reducción de costos,",
        "start": 2097.24,
        "end": 2102.08
    },
    {
        "text": " o una mayor productividad.",
        "start": 2102.08,
        "end": 2103.08
    },
    {
        "text": " Entonces, ¿qué hemos visto hasta ahora?",
        "start": 2106.64,
        "end": 2112.6
    },
    {
        "text": " Hemos visto cómo la empresa definía su cantidad de capital y de trabajo",
        "start": 2112.6,
        "end": 2117.7599999999998
    },
    {
        "text": " con la cinta de tecnológica, la despliegue de recursos, etcétera, etcétera.",
        "start": 2117.7599999999998,
        "end": 2125.56
    },
    {
        "text": " Y optimizando, tratando de masimizar el rendimiento de esos recursos.",
        "start": 2125.56,
        "end": 2131.56
    },
    {
        "text": " ¿Qué pasa en el corto plazo, como yo les mencionaba?",
        "start": 2133.56,
        "end": 2135.96
    },
    {
        "text": " En el corto plazo, habíamos dicho que el capital es fijo.",
        "start": 2136.16,
        "end": 2140.96
    },
    {
        "text": " ¿Por qué esto es de capital fijo?",
        "start": 2140.96,
        "end": 2143.52
    },
    {
        "text": " Bueno, se entiende que la empresa no ha bien definida su capacidad tecnológica,",
        "start": 2143.52,
        "end": 2148.76
    },
    {
        "text": " su composición de capital.",
        "start": 2148.76,
        "end": 2152.36
    },
    {
        "text": " Es relativamente estable por un tiempo, ¿no?",
        "start": 2154.36,
        "end": 2156.52
    },
    {
        "text": " Como yo les mencioné el otro día, el tema de corto plazo acá,",
        "start": 2156.52,
        "end": 2161.44
    },
    {
        "text": " no hay que medirlo justamente en periodo de tiempo.",
        "start": 2161.44,
        "end": 2165.92
    },
    {
        "text": " Si no, de punto de vista conceptual, cuando la empresa necesariamente va a tener que cambiar su capital.",
        "start": 2165.92,
        "end": 2172.52
    },
    {
        "text": " O sea, ahí sí, el capital se torna variable.",
        "start": 2172.52,
        "end": 2175.52
    },
    {
        "text": " Y eso, como yo también les mencioné, va a depender y mucho del giro de actividad",
        "start": 2175.52,
        "end": 2180.7200000000003
    },
    {
        "text": " que la empresa se te desarrolla.",
        "start": 2180.7200000000003,
        "end": 2182.7200000000003
    },
    {
        "text": " Y empresas que tienen más posibilidad de en el tiempo poder desarrollarse con la misma planta física",
        "start": 2182.7200000000003,
        "end": 2190.52
    },
    {
        "text": " y otras que tienen que ser mucho más rápido la transformación y el cambio de su equipamiento.",
        "start": 2190.52,
        "end": 2198.12
    },
    {
        "text": " Entonces, volviendo a esto, el corto plazo al tener que apetar el fijo,",
        "start": 2198.12,
        "end": 2203.72
    },
    {
        "text": " esto se simplifica en cuánta cantidad de trabajo va a contratar la empresa.",
        "start": 2203.72,
        "end": 2208.32
    },
    {
        "text": " Y esa es el elemento clave acá para determinar y se totalmente articula",
        "start": 2208.32,
        "end": 2216.72
    },
    {
        "text": " con lo que tuvimos viendo en la Xarlante Yorsov,",
        "start": 2216.72,
        "end": 2220.52
    },
    {
        "text": " la cantidad de producir por la empresa del punto de vista óptimo.",
        "start": 2220.52,
        "end": 2225.3199999999997
    },
    {
        "text": " Entonces, la demanda de trabajo se torna un elemento clave.",
        "start": 2225.3199999999997,
        "end": 2229.9199999999996
    },
    {
        "text": " Recordemos que lo vieron en descripción, demanda de trabajo es las que realiza las empresas.",
        "start": 2229.9199999999996,
        "end": 2235.52
    },
    {
        "text": " Los trabajadores ofrecen.",
        "start": 2235.52,
        "end": 2236.9199999999996
    },
    {
        "text": " Entonces, si el capital e fijo, la variación de producción va a depender de la cantidad de trabajo",
        "start": 2237.92,
        "end": 2248.92
    },
    {
        "text": " que esté utilizando, el producto total va a depender o yo no función de él, o me hice acá.",
        "start": 2248.92,
        "end": 2256.92
    },
    {
        "text": " Podemos hablar del producto medio del trabajo,",
        "start": 2257.92,
        "end": 2261.92
    },
    {
        "text": " que es el producto total del trabajo divido él, esto que es decir en promedio,",
        "start": 2261.92,
        "end": 2270.92
    },
    {
        "text": " cuántas frías da un trabajador.",
        "start": 2270.92,
        "end": 2273.92
    },
    {
        "text": " Y el producto marginal del trabajo,",
        "start": 2276.92,
        "end": 2278.92
    },
    {
        "text": " producto marginal del trabajo, conceptualmente que es,",
        "start": 2279.92,
        "end": 2284.92
    },
    {
        "text": " conceptualmente, cuántas unidades de producción, de producto,",
        "start": 2284.92,
        "end": 2289.92
    },
    {
        "text": " me genera un nuevo trabajador más, un trabajador adicional.",
        "start": 2291.92,
        "end": 2296.92
    },
    {
        "text": " Y esto es importante, muy importante, a la hora de la toma de decisiones",
        "start": 2298.92,
        "end": 2305.92
    },
    {
        "text": " en este marco, te digo, estamos analizando,",
        "start": 2306.92,
        "end": 2308.92
    },
    {
        "text": " si la empresa va a contratar o no va a contratar un trabajador más.",
        "start": 2308.92,
        "end": 2311.92
    },
    {
        "text": " Ya que va a depender justamente de esta cantidad marginal de producto",
        "start": 2311.92,
        "end": 2320.92
    },
    {
        "text": " que un trabajador más genere multiplicado por el precio,",
        "start": 2320.92,
        "end": 2324.92
    },
    {
        "text": " que es el ingreso que le va a implicar a la empresa comparado con el costo",
        "start": 2324.92,
        "end": 2331.92
    },
    {
        "text": " y la mayoría que tiene es contratar un trabajador más.",
        "start": 2331.92,
        "end": 2334.92
    },
    {
        "text": " Bueno, se asume que también el factor trabajo tiene rendimientos",
        "start": 2341.92,
        "end": 2348.92
    },
    {
        "text": " al inicio crecientes y luego, a partir de ese to punto,",
        "start": 2348.92,
        "end": 2354.92
    },
    {
        "text": " a medida que voy agregando factor trabajo,",
        "start": 2354.92,
        "end": 2358.92
    },
    {
        "text": " sigue incrementándose la producción, pero lo que me agrega es que es menor respecto al anterior",
        "start": 2358.92,
        "end": 2364.92
    },
    {
        "text": " porque se impone las leyes rendimientos marginales de crecientes.",
        "start": 2364.92,
        "end": 2368.92
    },
    {
        "text": " Entonces, hay rendimientos al principio crecientes, luego se tornan de crecientes",
        "start": 2370.92,
        "end": 2376.92
    },
    {
        "text": " y esto son las funciones de producto medio y producto marginal,",
        "start": 2376.92,
        "end": 2380.92
    },
    {
        "text": " que tienen este comportamiento, ¿no?",
        "start": 2380.92,
        "end": 2383.92
    },
    {
        "text": " van creciendo al principio y luego van descendiendo.",
        "start": 2383.92,
        "end": 2387.92
    },
    {
        "text": " Se muestra por qué corta en este punto la cuya producto marginal,",
        "start": 2388.92,
        "end": 2394.92
    },
    {
        "text": " pero en definitiva lo que está acá indicando es esto,",
        "start": 2398.92,
        "end": 2401.92
    },
    {
        "text": " acá hay un tramo de rendimiento de marginales crecientes y luego se tornan de crecientes.",
        "start": 2401.92,
        "end": 2406.92
    },
    {
        "text": " Como se le mencioné recién, podemos hablar de una idea física que lo que estamos haciendo recién,",
        "start": 2407.92,
        "end": 2419.92
    },
    {
        "text": " cuánto la producción total, cuánto la producción media de un trabajador,",
        "start": 2419.92,
        "end": 2423.92
    },
    {
        "text": " cuál es la producción marginal, pues sólo podemos valorar.",
        "start": 2423.92,
        "end": 2427.92
    },
    {
        "text": " Entonces, ¿cómo se valora en términos monetarios multiplicados por el precio del bien?",
        "start": 2427.92,
        "end": 2435.92
    },
    {
        "text": " Un precio que está dado por el mercado, que la empresa no insiden nada.",
        "start": 2436.92,
        "end": 2439.92
    },
    {
        "text": " Entonces, el valor del producto total del trabajo va a ser P4Q.",
        "start": 2439.92,
        "end": 2446.92
    },
    {
        "text": " El valor del producto medio del trabajo, obviamente va a ser el total dividido L.",
        "start": 2449.92,
        "end": 2455.92
    },
    {
        "text": " ¿Cuál tome ingresa en promedio a mi por trabajador?",
        "start": 2457.92,
        "end": 2460.92
    },
    {
        "text": " Eso sería un poco la idea.",
        "start": 2460.92,
        "end": 2462.92
    },
    {
        "text": " Y el valor del producto marginal del trabajo es la productiva marginal multiplicado por SP.",
        "start": 2463.92,
        "end": 2473.92
    },
    {
        "text": " Y este es el elemento que hay que tomar en cuenta, como yo le he mencionado,",
        "start": 2473.92,
        "end": 2478.92
    },
    {
        "text": " para la toma de decisiones si contratos o no trabaja, o no contratos un trabajador más.",
        "start": 2478.92,
        "end": 2484.92
    },
    {
        "text": " ¿Qué pasa con los costos?",
        "start": 2485.92,
        "end": 2489.92
    },
    {
        "text": " Los costos, obviamente, a medida que voy aumentando la cantidad de trabajadores,",
        "start": 2489.92,
        "end": 2494.92
    },
    {
        "text": " el costo aumenta.",
        "start": 2494.92,
        "end": 2496.92
    },
    {
        "text": " Eso no hay mucha duda, ¿no?",
        "start": 2498.92,
        "end": 2502.92
    },
    {
        "text": " En este caso, tomando un salario constante 50, a medida que voy contatando más trabajadores,",
        "start": 2504.92,
        "end": 2509.92
    },
    {
        "text": " la culpa de costos va creciendo.",
        "start": 2509.92,
        "end": 2512.92
    },
    {
        "text": " También podemos hablar de un costo medio del trabajador.",
        "start": 2515.92,
        "end": 2520.92
    },
    {
        "text": " Este sería el costo total del trabajo, un WD por L.",
        "start": 2520.92,
        "end": 2525.92
    },
    {
        "text": " Un costo medio, el costo medio sería dividido L, o sea el salario.",
        "start": 2525.92,
        "end": 2532.92
    },
    {
        "text": " Y el costo marginal, que es el costo que implica una empresa incorporar un trabajador más",
        "start": 2534.92,
        "end": 2539.92
    },
    {
        "text": " que también es igual de salaria.",
        "start": 2539.92,
        "end": 2541.92
    },
    {
        "text": " Más allá de que estas cuentas son muy sencillas, conceptualmente, es importante que recordemos.",
        "start": 2542.92,
        "end": 2549.92
    },
    {
        "text": " O sea, ¿qué quiere decir esto del costo medio del trabajo?",
        "start": 2549.92,
        "end": 2555.92
    },
    {
        "text": " Es justamente cuánto me sale en promedio un trabajador en este esquema que estamos analizando",
        "start": 2555.92,
        "end": 2561.92
    },
    {
        "text": " es igual el salario.",
        "start": 2561.92,
        "end": 2564.92
    },
    {
        "text": " Es igual el salario también, el costo marginal, porque que implica a mí",
        "start": 2565.92,
        "end": 2571.92
    },
    {
        "text": " incorporar un trabajador más el salario que le pago, más los costos que tengan aportes.",
        "start": 2571.92,
        "end": 2578.92
    },
    {
        "text": " ¿Te entiende?",
        "start": 2578.92,
        "end": 2580.92
    },
    {
        "text": " Obviamente esto es igual en la constante, no es igual al salario,",
        "start": 2582.92,
        "end": 2586.92
    },
    {
        "text": " por lo tanto salario, costo medio del trabajo,",
        "start": 2586.92,
        "end": 2589.92
    },
    {
        "text": " y el costo marginal del trabajo es igual.",
        "start": 2589.92,
        "end": 2591.92
    },
    {
        "text": " ¿Hasta dónde se va a contratar trabajadores?",
        "start": 2595.92,
        "end": 2600.92
    },
    {
        "text": " Aquí estamos analizando la decisión de la empresa de cuántos trabajadores va a incorporar,",
        "start": 2600.92,
        "end": 2608.92
    },
    {
        "text": " ¿cuál es la decisión racional de la empresa?",
        "start": 2608.92,
        "end": 2611.92
    },
    {
        "text": " Su marco conceptual sigue siendo el mismo, maximizar beneficios,",
        "start": 2612.92,
        "end": 2617.92
    },
    {
        "text": " por lo tanto va a elegir la cantidad óptima de trabajadores a que hay que maximizar beneficio.",
        "start": 2618.92,
        "end": 2625.92
    },
    {
        "text": " Matemáticamente sería justamente esto, maximizar beneficios,",
        "start": 2626.92,
        "end": 2633.92
    },
    {
        "text": " que es ingreso total, menos costo total derivando, ¿verdad?",
        "start": 2633.92,
        "end": 2637.92
    },
    {
        "text": " sustituyendo igualando a cero.",
        "start": 2637.92,
        "end": 2641.92
    },
    {
        "text": " Conceptualmente, ¿qué es lo que se llega?",
        "start": 2642.92,
        "end": 2650.92
    },
    {
        "text": " Y bueno, se llega que en definitiva el doble vez el costo marginal,",
        "start": 2650.92,
        "end": 2656.92
    },
    {
        "text": " que le implica a la empresa incorporar un trabajador más,",
        "start": 2656.92,
        "end": 2660.92
    },
    {
        "text": " y el valor de la potencia marginal, podríamos coger con el ingreso marginal",
        "start": 2660.92,
        "end": 2665.92
    },
    {
        "text": " que tiene la empresa, la cantidad de ingreso de dinero que le provoca,",
        "start": 2666.92,
        "end": 2672.92
    },
    {
        "text": " el hecho de contratador trabajador más.",
        "start": 2672.92,
        "end": 2674.92
    },
    {
        "text": " ¿Por qué este trabajador le produjo ciertas unidades adicionales multiplicado por el precio?",
        "start": 2674.92,
        "end": 2679.92
    },
    {
        "text": " Esta es la decisión racional de la empresa, acaba optimizar.",
        "start": 2683.92,
        "end": 2687.92
    },
    {
        "text": " Si la empresa tiene una ecuación donde el salario es mayor que este valor",
        "start": 2688.92,
        "end": 2696.92
    },
    {
        "text": " de la potencia marginal de trabajo, no va a contratar o despide.",
        "start": 2696.92,
        "end": 2700.92
    },
    {
        "text": " Si el ingreso marginal, el valor de la potencia marginal del trabajo es mayor que el salario contrata.",
        "start": 2700.92,
        "end": 2709.92
    },
    {
        "text": " Cuando digo despide contrata, estamos en competencia perfecta,",
        "start": 2711.92,
        "end": 2714.92
    },
    {
        "text": " no hay ningún tipo de problemas, ningún tipo de inconveniente como para realizarlo.",
        "start": 2715.92,
        "end": 2719.92
    },
    {
        "text": " Estamos en la realidad más compleja, pero el marco teórico este no preside ningún tipo de problemas",
        "start": 2719.92,
        "end": 2726.92
    },
    {
        "text": " de contratar o de pedir trabajador.",
        "start": 2726.92,
        "end": 2728.92
    },
    {
        "text": " Entonces, esa es la decisión que va a tomar la empresa.",
        "start": 2732.92,
        "end": 2736.92
    },
    {
        "text": " En definitiva va a contratar en la medida que el beneficio marginal",
        "start": 2736.92,
        "end": 2741.92
    },
    {
        "text": " que de genera y contratar un trabajador más y a positivo.",
        "start": 2741.92,
        "end": 2746.92
    },
    {
        "text": " Esa es la idea.",
        "start": 2746.92,
        "end": 2748.92
    },
    {
        "text": " Si el ingreso marginal, menos el costo marginal, la medida que de positivo, ahí contrata.",
        "start": 2748.92,
        "end": 2753.92
    },
    {
        "text": " Si da negativo, no contrata y se detiene cuando cero.",
        "start": 2753.92,
        "end": 2757.92
    },
    {
        "text": " Esto lo podemos considerar también en términos reales,",
        "start": 2760.92,
        "end": 2764.92
    },
    {
        "text": " es decir, la potencia marginal de trabajo por el precio, igual a WB, paso dividiendo peacá",
        "start": 2764.92,
        "end": 2770.92
    },
    {
        "text": " y me da unidad de físicas.",
        "start": 2770.92,
        "end": 2772.92
    },
    {
        "text": " Las ciudades físicas que me genera marginalmente este trabajador lo comparo con cuantos ciudades",
        "start": 2773.92,
        "end": 2780.92
    },
    {
        "text": " equivale el salario.",
        "start": 2780.92,
        "end": 2782.92
    },
    {
        "text": " Esa es la variable que hay que tomar en cuenta del público de la empresa.",
        "start": 2782.92,
        "end": 2787.92
    },
    {
        "text": " Esa es la empresa que va a maximizar los beneficios cuando el producto marginal",
        "start": 2787.92,
        "end": 2793.92
    },
    {
        "text": " que aporta y el último trabajador que contrata siguala al salario real.",
        "start": 2793.92,
        "end": 2799.92
    },
    {
        "text": " El producto marginal igual al costo marginal en términos físicos.",
        "start": 2802.92,
        "end": 2806.92
    },
    {
        "text": " ¿Lo ven?",
        "start": 2807.92,
        "end": 2808.92
    },
    {
        "text": " ¿Preguntas?",
        "start": 2811.92,
        "end": 2812.92
    },
    {
        "text": " Esta vera fica nos muestra justamente esto que yo estaba mencionando.",
        "start": 2819.92,
        "end": 2822.92
    },
    {
        "text": " El doleveso repé es el costo marginal del trabajo, de menos reales.",
        "start": 2823.92,
        "end": 2828.92
    },
    {
        "text": " Si lo comparamos con la productividad marginal, vemos que acá esta área es positiva,",
        "start": 2830.92,
        "end": 2838.92
    },
    {
        "text": " entonces va a contratar hasta que sea cero.",
        "start": 2838.92,
        "end": 2842.92
    },
    {
        "text": " Si sigue contratando, ¿qué ocurre? Si sigue contratando, tiene un beneficio marginal negativo.",
        "start": 2845.92,
        "end": 2851.92
    },
    {
        "text": " Paga mayor cantidad de unidad de físicas que las que le aporta ese trabajador adicional.",
        "start": 2853.92,
        "end": 2860.92
    },
    {
        "text": " No olvidemos que los rendimientos son de creciente, o sea que en medida que aumenta un trabajador",
        "start": 2860.92,
        "end": 2865.92
    },
    {
        "text": " produce pero que a veces produce menos respecto al anterior.",
        "start": 2865.92,
        "end": 2868.92
    },
    {
        "text": " Por lo tanto, llega un momento que se torna marginalmente inconveniente,",
        "start": 2869.92,
        "end": 2874.92
    },
    {
        "text": " mágicamente negativo, que pude ver esta racional contratar un trabajador",
        "start": 2874.92,
        "end": 2878.92
    },
    {
        "text": " en este marco anterior que estamos alalizando.",
        "start": 2878.92,
        "end": 2880.92
    },
    {
        "text": " Lo ven.",
        "start": 2880.92,
        "end": 2883.92
    },
    {
        "text": " Bueno, así como vimos por el caso de la empresa que la curva de costo marginal",
        "start": 2892.92,
        "end": 2897.92
    },
    {
        "text": " determinaba la oferta de bienes, la curva de lo valor de la productividad marginal",
        "start": 2897.92,
        "end": 2903.92
    },
    {
        "text": " es la curva de demanda del empleo, la curva de demanda del trabajo perón.",
        "start": 2903.92,
        "end": 2908.92
    },
    {
        "text": " Va a coincidir con el tramo de creciente de la curva del valor de producto marginal del trabajo.",
        "start": 2909.92,
        "end": 2914.92
    },
    {
        "text": " Y ahí se determina a diferentes valores del salario cuantas cantidades de trabajadores",
        "start": 2915.92,
        "end": 2922.92
    },
    {
        "text": " el empresario va a contratar.",
        "start": 2922.92,
        "end": 2925.92
    },
    {
        "text": " Siempre va a maximizar donde se corten.",
        "start": 2925.92,
        "end": 2928.92
    },
    {
        "text": " Lo que es igual es mejor dicho.",
        "start": 2930.92,
        "end": 2932.92
    },
    {
        "text": " La demanda individual de la empresa sumada a las demandas individuales nos da la demanda de mercado,",
        "start": 2932.92,
        "end": 2941.92
    },
    {
        "text": " la demanda agregada de trabajo.",
        "start": 2941.92,
        "end": 2944.92
    },
    {
        "text": " En el caso de trabajo es un bien particular, hay una oferta en la demanda,",
        "start": 2944.92,
        "end": 2949.92
    },
    {
        "text": " el relaritero que es de manda son las empresas que les ofrecen trabajadores",
        "start": 2949.92,
        "end": 2955.92
    },
    {
        "text": " pero sobre todo cuando hablamos de mercado agregado es bastante asctante.",
        "start": 2955.92,
        "end": 2961.92
    },
    {
        "text": " Hay muchas heterogeneidades en esta composición de mercado de trabajo,",
        "start": 2962.92,
        "end": 2969.92
    },
    {
        "text": " diferentes calificaciones, diferentes edades, diferentes capacidades,",
        "start": 2969.92,
        "end": 2974.92
    },
    {
        "text": " situaciones geográficas distintas.",
        "start": 2974.92,
        "end": 2978.92
    },
    {
        "text": " Pero en este marco que estamos analizando, por eso se las hago un poquito de recuerdo",
        "start": 2978.92,
        "end": 2983.92
    },
    {
        "text": " que estoy conviendo esto, podemos ver que si hay",
        "start": 2983.92,
        "end": 2989.92
    },
    {
        "text": " un desequilibrio en el mercado, obviamente el ajuste es bioprecio",
        "start": 2990.92,
        "end": 2996.92
    },
    {
        "text": " ya que opera el mecanismo de oferti de manda.",
        "start": 2996.92,
        "end": 3000.92
    },
    {
        "text": " Por ejemplo, este es el gráfico que nos muestra,",
        "start": 3000.92,
        "end": 3004.92
    },
    {
        "text": " este salario real y el trabajo, el mercado trabajo.",
        "start": 3004.92,
        "end": 3008.92
    },
    {
        "text": " Esta es la demanda y esta es la oferta.",
        "start": 3008.92,
        "end": 3011.92
    },
    {
        "text": " A este salario lo ves su uno, vemos que hay un exceso de demanda.",
        "start": 3011.92,
        "end": 3016.92
    },
    {
        "text": " Esto es hay una necesidad o mayor demanda de las empresas",
        "start": 3017.92,
        "end": 3026.92
    },
    {
        "text": " de la gente que está buscando trabajo.",
        "start": 3026.92,
        "end": 3030.92
    },
    {
        "text": " Cuando se da esta situación de un exceso de demanda",
        "start": 3030.92,
        "end": 3035.92
    },
    {
        "text": " que hay unas casas de trabajadores, digamos, lo que ocurre es que ocurre.",
        "start": 3035.92,
        "end": 3040.92
    },
    {
        "text": " Sube el salario.",
        "start": 3041.92,
        "end": 3043.92
    },
    {
        "text": " Hay una presión a subir el salario.",
        "start": 3043.92,
        "end": 3047.92
    },
    {
        "text": " Esto se da como se le comenté, se puede dar o lo puede visualizar más.",
        "start": 3047.92,
        "end": 3054.92
    },
    {
        "text": " Cuando hay algunas casas de necesidad de algo,",
        "start": 3054.92,
        "end": 3060.92
    },
    {
        "text": " para traer esa especialidad hay que pagar un salario mayor.",
        "start": 3060.92,
        "end": 3064.92
    },
    {
        "text": " Olvídemonos de eso, el marco conceptual acá es que si hay una exceso de demanda",
        "start": 3065.92,
        "end": 3070.92
    },
    {
        "text": " hay salido subir.",
        "start": 3070.92,
        "end": 3073.92
    },
    {
        "text": " Y obviamente, al subir hay más gente dispuesta a trabajar",
        "start": 3073.92,
        "end": 3080.92
    },
    {
        "text": " y se converje a un equilibrio.",
        "start": 3080.92,
        "end": 3084.92
    },
    {
        "text": " Veamos el otro caso.",
        "start": 3084.92,
        "end": 3087.92
    },
    {
        "text": " El otro caso es que hay un salario por encima del valor de equilibrio.",
        "start": 3087.92,
        "end": 3091.92
    },
    {
        "text": " Y ocurre exactamente al revés.",
        "start": 3092.92,
        "end": 3094.92
    },
    {
        "text": " Cuando hay un salario por encima del equilibrio,",
        "start": 3094.92,
        "end": 3097.92
    },
    {
        "text": " el equilibrio es cuando la oferta sigua la demanda.",
        "start": 3097.92,
        "end": 3100.92
    },
    {
        "text": " Acá hay más gente dispuesta a trabajar que la que realmente puede.",
        "start": 3100.92,
        "end": 3107.92
    },
    {
        "text": " Acá las empresas están demandando un número de trabajadores inferior",
        "start": 3109.92,
        "end": 3115.92
    },
    {
        "text": " a lo que están buscando trabajo.",
        "start": 3115.92,
        "end": 3118.92
    },
    {
        "text": " O sea, hay desempleo.",
        "start": 3119.92,
        "end": 3122.92
    },
    {
        "text": " Hay mayor gente buscando trabajo que los que pueden absorber las empresas.",
        "start": 3122.92,
        "end": 3126.92
    },
    {
        "text": " Por lo tanto, el ajuste también es bien precio acá y que va a ocurrir acá.",
        "start": 3126.92,
        "end": 3132.92
    },
    {
        "text": " Baja, acá el salario baja.",
        "start": 3132.92,
        "end": 3135.92
    },
    {
        "text": " Entonces, cuando hay un exceso de oferta, el salario baja.",
        "start": 3135.92,
        "end": 3140.92
    },
    {
        "text": " Pero hasta que se llega a un nuevo equilibrio.",
        "start": 3140.92,
        "end": 3145.92
    },
    {
        "text": " Preguntas?",
        "start": 3149.92,
        "end": 3151.92
    },
    {
        "text": " Bueno, vamos a ver entonces ahora.",
        "start": 3160.92,
        "end": 3163.92
    },
    {
        "text": " Vamos a ver.",
        "start": 3208.92,
        "end": 3212.92
    },
    {
        "text": " Vamos a ver.",
        "start": 3238.92,
        "end": 3242.92
    },
    {
        "text": " Vamos a ver.",
        "start": 3268.92,
        "end": 3272.92
    },
    {
        "text": " ¿Qué hay que hacer acá?",
        "start": 3299.92,
        "end": 3302.92
    },
    {
        "text": " ¿Por qué? Me parece que no tengo un PDF.",
        "start": 3315.92,
        "end": 3318.92
    },
    {
        "text": " Me tengo un poco de pude más.",
        "start": 3318.92,
        "end": 3321.92
    },
    {
        "text": " ¿Cuál dice de briló?",
        "start": 3321.92,
        "end": 3324.92
    },
    {
        "text": " ¿Tú puedo creerlo? No me parece.",
        "start": 3325.92,
        "end": 3328.92
    },
    {
        "text": " ¿Qué es?",
        "start": 3339.92,
        "end": 3342.92
    },
    {
        "text": " El trabajo.",
        "start": 3346.92,
        "end": 3349.92
    },
    {
        "text": " ¿Qué es el congo de?",
        "start": 3349.92,
        "end": 3351.92
    },
    {
        "text": " ¿Qué es el trabajo?",
        "start": 3352.92,
        "end": 3354.92
    },
    {
        "text": " El trabajo.",
        "start": 3354.92,
        "end": 3356.92
    },
    {
        "text": " ¿Qué es?",
        "start": 3356.92,
        "end": 3359.92
    },
    {
        "text": " ¿Qué es el trabajo?",
        "start": 3359.92,
        "end": 3362.92
    },
    {
        "text": " ¿Para qué?",
        "start": 3362.92,
        "end": 3365.92
    },
    {
        "text": " ¿Dónde dice briló?",
        "start": 3365.92,
        "end": 3368.92
    },
    {
        "text": " ¿Adiós, briló?",
        "start": 3368.92,
        "end": 3371.92
    },
    {
        "text": " ¿Adiós, briló?",
        "start": 3371.92,
        "end": 3374.92
    },
    {
        "text": " Gracias.",
        "start": 3375.92,
        "end": 3378.92
    },
    {
        "text": " Bueno, gracias.",
        "start": 3378.92,
        "end": 3381.92
    },
    {
        "text": " Bueno, muy bien.",
        "start": 3394.92,
        "end": 3398.92
    },
    {
        "text": " ¿A qué?",
        "start": 3405.92,
        "end": 3408.92
    },
    {
        "text": " ¿Dónde dice briló?",
        "start": 3422.92,
        "end": 3425.92
    },
    {
        "text": " ¿Adiós?",
        "start": 3425.92,
        "end": 3428.92
    },
    {
        "text": " ¿Dónde dice briló?",
        "start": 3428.92,
        "end": 3431.92
    },
    {
        "text": " Ahora sí, pecadole.",
        "start": 3432.92,
        "end": 3435.92
    },
    {
        "text": " Bueno.",
        "start": 3435.92,
        "end": 3438.92
    },
    {
        "text": " Vamos a ver ahora la guía 7,",
        "start": 3441.92,
        "end": 3446.92
    },
    {
        "text": " que nos va a introducir al tema de la eficiencia del mercado.",
        "start": 3446.92,
        "end": 3453.92
    },
    {
        "text": " Entonces, vamos a ver,",
        "start": 3454.92,
        "end": 3460.92
    },
    {
        "text": " partiendo en la situación de equilibrio que la oferta es igual a la demanda,",
        "start": 3460.92,
        "end": 3466.92
    },
    {
        "text": " donde se termina un precio y termina en la cantidad que pasa.",
        "start": 3466.92,
        "end": 3472.92
    },
    {
        "text": " Es decir, ¿cómo se distribuye esas cantidades de equilibrio?",
        "start": 3472.92,
        "end": 3478.92
    },
    {
        "text": " Es un poco lo que está atrás de esto que estamos hablando de la eficiencia del mercado",
        "start": 3478.92,
        "end": 3484.92
    },
    {
        "text": " y que se condensa lo que se conoce la economía del bienestar.",
        "start": 3484.92,
        "end": 3487.92
    },
    {
        "text": " El bienestar económico es una área en el cual se analiza",
        "start": 3492.92,
        "end": 3497.92
    },
    {
        "text": " cómo se distribuye los recursos y cómo se afecta el bienestar,",
        "start": 3497.92,
        "end": 3501.92
    },
    {
        "text": " en términos globales, en este marco teórico que estamos analizando.",
        "start": 3501.92,
        "end": 3506.92
    },
    {
        "text": " Es decir, tanto lo demandantes como los oferentes reciben un beneficio",
        "start": 3507.92,
        "end": 3513.92
    },
    {
        "text": " al estar integrando al mercado y el equilibrio del mercado es el punto de maximiza,",
        "start": 3513.92,
        "end": 3520.92
    },
    {
        "text": " evidentemente, el bienestar, tanto lo demandantes como lo oferente,",
        "start": 3520.92,
        "end": 3524.92
    },
    {
        "text": " es un mercado puro de competencia perfecta como lo que estamos analizando hasta ahora.",
        "start": 3524.92,
        "end": 3529.92
    },
    {
        "text": " La expedición a pagar, algo hayamos comentado en este curso,",
        "start": 3529.92,
        "end": 3538.92
    },
    {
        "text": " recordemos que por el podido definido como el precio máximo que un individuo está dispuesto",
        "start": 3538.92,
        "end": 3544.92
    },
    {
        "text": " a pagar por un bien y puede pagar.",
        "start": 3544.92,
        "end": 3547.92
    },
    {
        "text": " Vamos a difigir el excedente del consumidor como esa expedición a pagar,",
        "start": 3547.92,
        "end": 3556.92
    },
    {
        "text": " esa cantidad de dinero que el consumidor está dispuesto y puede pagar",
        "start": 3556.92,
        "end": 3561.92
    },
    {
        "text": " respecto a la que realmente paga en el mercado.",
        "start": 3561.92,
        "end": 3565.92
    },
    {
        "text": " Esa diferencia es lo que se conoce como excedente del consumidor.",
        "start": 3566.92,
        "end": 3570.92
    },
    {
        "text": " Y obviamente, el excedente del consumidor se va a componer",
        "start": 3572.92,
        "end": 3581.92
    },
    {
        "text": " de las sucesivas sumas de esta diferencia entre lo que está dispuesto a pagar",
        "start": 3581.92,
        "end": 3585.92
    },
    {
        "text": " por cada una de las cantidades y lo que realmente paga en el mercado.",
        "start": 3585.92,
        "end": 3590.92
    },
    {
        "text": " Graficamente, vamos a ver que es el área situado por debajo de la curva de demanda",
        "start": 3592.92,
        "end": 3596.92
    },
    {
        "text": " y por arriba del precio del mercado.",
        "start": 3596.92,
        "end": 3598.92
    },
    {
        "text": " Dice esto que está acá.",
        "start": 3598.92,
        "end": 3600.92
    },
    {
        "text": " En este caso está moviendo una curva de demanda, un bien cualquiera,",
        "start": 3600.92,
        "end": 3605.92
    },
    {
        "text": " el precio está dado, pez uno, en este caso sería el área amarilla,",
        "start": 3606.92,
        "end": 3613.92
    },
    {
        "text": " sería el excedente del consumidor, esto es.",
        "start": 3614.92,
        "end": 3617.92
    },
    {
        "text": " Lo que está dispuesto a pagar este consumidor por la diferente tipo de bienes,",
        "start": 3618.92,
        "end": 3623.92
    },
    {
        "text": " perdón, por diferentes cantidades del bien uno,",
        "start": 3623.92,
        "end": 3626.92
    },
    {
        "text": " o el Q, bien el lado por esta curva de demanda y después ya la pagar.",
        "start": 3626.92,
        "end": 3632.92
    },
    {
        "text": " Y lo que realmente paga es lo que impone el mercado.",
        "start": 3633.92,
        "end": 3637.92
    },
    {
        "text": " Por lo tanto, esa área es lo que se conoce como el excedente del consumidor.",
        "start": 3638.92,
        "end": 3643.92
    },
    {
        "text": " Lo ven esto, un chachoso.",
        "start": 3652.92,
        "end": 3654.92
    },
    {
        "text": " Amen!",
        "start": 3662.92,
        "end": 3664.92
    },
    {
        "text": " cualquier punto de esta curva está expresando a los diferentes precios la cantidad",
        "start": 3664.92,
        "end": 3694.16
    },
    {
        "text": " que el consumidor está dispuesto a pagar, los consumidores están dispuestos a pagar de este biencum.",
        "start": 3694.16,
        "end": 3701.16
    },
    {
        "text": " Están dispuestos a pagar. Vamos a ver más adelante por qué, o digamos, por qué el consumidor",
        "start": 3701.16,
        "end": 3711.6
    },
    {
        "text": " tiene un comportamiento de este tipo, es decir, por qué está dispuesto a pagar más alto,",
        "start": 3711.6,
        "end": 3717.0
    },
    {
        "text": " un precio más alto por estas unidades iniciales y pagar menos por las unidades que ya no son tan",
        "start": 3717.0,
        "end": 3725.24
    },
    {
        "text": " escasas, justamente por este tema de la saciedad o que el bien se torno tan escaso. Ahora,",
        "start": 3725.24,
        "end": 3734.36
    },
    {
        "text": " qué pasa? Está dispuesto a pagar de determinado precio, pero el mercado es el que le impone el precio.",
        "start": 3734.36,
        "end": 3741.2
    },
    {
        "text": " Está dispuesto a pagar, pero el precio viene dado, por lo tanto, toda esta área que está por arriba",
        "start": 3741.2,
        "end": 3747.04
    },
    {
        "text": " del precio contra la demanda es lo que se conoce el excedente de consumidor, eso que estaría dispuesto",
        "start": 3747.04,
        "end": 3752.96
    },
    {
        "text": " a pagar de más tricomilla y lo que efectivamente paga. Conceptualmente es eso. A veces ocurre,",
        "start": 3752.96,
        "end": 3763.48
    },
    {
        "text": " me comería, no sé qué, me tomaría de fah, pagaría tal cosa y va así, salió menos,",
        "start": 3763.48,
        "end": 3772.48
    },
    {
        "text": " barbaro, pasa a veces. Ese es un poco le dé.",
        "start": 3772.48,
        "end": 3780.56
    },
    {
        "text": " Bueno, obviamente, si el precio baja el excedente de consumidor, en este caso sería mayor,",
        "start": 3780.56,
        "end": 3789.36
    },
    {
        "text": " pero la área verde, lo pume y la da el revés, no sé si es parte de acá y el precio sube,",
        "start": 3789.36,
        "end": 3795.96
    },
    {
        "text": " el excedente de consumidor se reduce. Entonces, conceptualmente es lo que yo le mencionaba,",
        "start": 3795.96,
        "end": 3811.6
    },
    {
        "text": " el excedente del consumidor es la diferencia de calcula entre la disposición a pagar y",
        "start": 3811.6,
        "end": 3817.48
    },
    {
        "text": " cada una de los unidades. Es decir, en este ejemplo que yo ponía acá, yo tenía que",
        "start": 3817.48,
        "end": 3822.36
    },
    {
        "text": " acular todas las unidades que están acá antes de llegar al equilibrio, la diferencia",
        "start": 3822.36,
        "end": 3826.56
    },
    {
        "text": " entre el precio y lo que realmente paga y eso se calcula el área de esta, y eso sería",
        "start": 3826.56,
        "end": 3831.64
    },
    {
        "text": " el excedente de consumidor. Bueno, acá tenemos algún problema con el programa. Bueno,",
        "start": 3831.64,
        "end": 3855.72
    },
    {
        "text": " conceptualmente es eso que le estoy indicando, acá tenemos un problema que le pone y no",
        "start": 3855.72,
        "end": 3860.52
    },
    {
        "text": " merece. Pero indica, el edificativo, el excedente de consumidor, y me indica que yo",
        "start": 3860.52,
        "end": 3866.3599999999997
    },
    {
        "text": " estaba expresando, cada unidad, la diferencia me va sumando a esa área.",
        "start": 3866.3599999999997,
        "end": 3876.64
    },
    {
        "text": " El excedente del productor es la diferencia entre lo que realmente recibe el vendedor,",
        "start": 3876.64,
        "end": 3896.2799999999997
    },
    {
        "text": " referente al productor, el precio del bien, menos el precio mínimo a lo que estaría",
        "start": 3896.28,
        "end": 3906.5600000000004
    },
    {
        "text": " dispuesto a vender, va a recibir definitiva.",
        "start": 3906.56,
        "end": 3914.6
    },
    {
        "text": " Sobre todos mismos de todos días que esta la funcionó frata, por lo tanto el precio",
        "start": 3922.6,
        "end": 3928.2799999999997
    },
    {
        "text": " viene por acá, siempre, y el vendedor está dispuesto a este determinado precio ofrecer",
        "start": 3928.2799999999997,
        "end": 3936.44
    },
    {
        "text": " estas cantidades. Por menos de eso no, va a ofrecer. No se le diga, acá está la curva",
        "start": 3936.44,
        "end": 3945.2400000000002
    },
    {
        "text": " de costo marginal, por menos de eso no va a ofrecer. Ahora, lo mismo, por estas cantidades",
        "start": 3945.2400000000002,
        "end": 3952.16
    },
    {
        "text": " está dispuesto a recibir como mínimo esto, pero si el precio vendedor por acá, toda esta",
        "start": 3952.16,
        "end": 3957.0
    },
    {
        "text": " área es el excedente del consumidor, es decir, la diferencia entre el precio realmente",
        "start": 3957.0,
        "end": 3963.0
    },
    {
        "text": " del bien, menos el costo marginal, o el mínimo que estaría dispuesto a vender el producto.",
        "start": 3963.0,
        "end": 3970.0
    },
    {
        "text": " ¿Se ve? Entonces, para cualquier cantidad, estamos hablando de la curva oferta, sería",
        "start": 3970.0,
        "end": 3981.52
    },
    {
        "text": " el precio mínimo que los oferentes están dispuestos a recibir por cada nivel de la cantidad",
        "start": 3981.52,
        "end": 3985.84
    },
    {
        "text": " vendida, perdón, esa la oferta, ¿no? Y determina lo que están dispuestos a salir de mercado",
        "start": 3985.84,
        "end": 3991.16
    },
    {
        "text": " si el precio es femenor, o sea, si hay un precio menor, como vimos en la función de",
        "start": 3991.16,
        "end": 3994.7999999999997
    },
    {
        "text": " oferta, el producto no vende, no ofrecer. Ese precio mínimo que está dispuesto a recibir",
        "start": 3994.7999999999997,
        "end": 4003.7599999999998
    },
    {
        "text": " es en costo marginal, el precio mínimo que está dispuesto a vender las señorías del producto",
        "start": 4003.7599999999998,
        "end": 4007.7599999999998
    },
    {
        "text": " sabemos que es creciente, por lo que estuvimos viendo en cuanto a los rendimientos marginales",
        "start": 4007.7599999999998,
        "end": 4014.44
    },
    {
        "text": " de creciento, los costos crecientes. Por lo tanto, este precio que está dispuesto a recibir",
        "start": 4014.44,
        "end": 4021.48
    },
    {
        "text": " siempre va a tener esta tendencia a subir. ¿Qué es el esente del productor? Un año",
        "start": 4021.48,
        "end": 4028.56
    },
    {
        "text": " manimeno que la suma la diferencia entre el precio que reciben las empresas, por cada una",
        "start": 4028.56,
        "end": 4034.32
    },
    {
        "text": " se produce hace vendidas y el costo marginal o el precio mínimo que está dispuesto a recibir.",
        "start": 4034.32,
        "end": 4039.7200000000003
    },
    {
        "text": " Ya, andá lo que vamos con el consumidor, calculamos el área y ese es el eleccidente",
        "start": 4039.72,
        "end": 4045.08
    },
    {
        "text": " del productor. O sea, en definitiva, ese es el área que está entre el precio del mercado",
        "start": 4045.08,
        "end": 4054.56
    },
    {
        "text": " y lo que ocupó a oferta. Viene lo que está acá. Si el precio es este, obviamente todo",
        "start": 4054.56,
        "end": 4063.3199999999997
    },
    {
        "text": " esto es el esente del consumidor. Si el precio baja a pésu uno, el esente del productor",
        "start": 4063.32,
        "end": 4076.92
    },
    {
        "text": " sería solo se estrellan. Si entiende esto, se ve mucho hecho, ¿no? El precio que recibe",
        "start": 4076.92,
        "end": 4085.88
    },
    {
        "text": " realmente con respecto al precio que mínimo que está requiriendo, que está dado por la",
        "start": 4085.88,
        "end": 4090.04
    },
    {
        "text": " cuba o factor. En realidad el tienden, lo que pasa que está acá, ¿no? Si el precio",
        "start": 4090.04,
        "end": 4107.84
    },
    {
        "text": " está en pésu uno y va a pésu dos como que agarras toda esta figura. Si el precio está",
        "start": 4107.84,
        "end": 4126.8
    },
    {
        "text": " arriba, todo el exidente es este, si el precio está acá abajo, el exidente se reduce acá,",
        "start": 4126.8,
        "end": 4131.12
    },
    {
        "text": " si el precio está ahí, uno por cantidad y todo por precio, porque la cantidad se reduce también.",
        "start": 4131.12,
        "end": 4138.12
    },
    {
        "text": " Y si eso no va, se explica por cantidad o por precio, pero conceptualmente lo mismo se",
        "start": 4138.12,
        "end": 4146.44
    },
    {
        "text": " reduce o se aumenta. Eso va a separar cuál es el efecto del precio, el aumento del cantidad",
        "start": 4146.44,
        "end": 4157.68
    },
    {
        "text": " o la reducción. Bueno, entonces, ¿cómo se calcula esto como la diferencia del precio",
        "start": 4157.68,
        "end": 4168.6
    },
    {
        "text": " y la mínima posición a cobrar por el productor?",
        "start": 4168.6,
        "end": 4174.6
    },
    {
        "text": " Y este es el exidente del productor. Me siguen hasta ahora. Entonces, si sumamos los",
        "start": 4174.6,
        "end": 4200.76
    },
    {
        "text": " dos accidentes, el exidente de consumidor, el exidente del productor, tenemos obviamente",
        "start": 4200.76,
        "end": 4207.0
    },
    {
        "text": " la eficiencia del mercado. Este es el exidente total, ¿no? Mercado, competencia perfecta,",
        "start": 4207.0,
        "end": 4216.24
    },
    {
        "text": " un mercado que no tiene ningún tipo de interferencia, donde el equilibrio, obviamente,",
        "start": 4216.24,
        "end": 4220.88
    },
    {
        "text": " la antigención al afuértila de mandas, ningún tipo de nada que intervengan, el libro",
        "start": 4220.88,
        "end": 4226.76
    },
    {
        "text": " del juego de mercado me genera el mayor área posible de exidente del consumidor y el",
        "start": 4226.76,
        "end": 4231.56
    },
    {
        "text": " mayor área del exidente del productor. Se demuestra que en definitiva, si uno compara",
        "start": 4231.56,
        "end": 4240.6
    },
    {
        "text": " exidente del consumidor, es el valor para los consumidores, menos lo que realmente pagan",
        "start": 4240.6,
        "end": 4249.56
    },
    {
        "text": " y que el exente del productor de la cantidad que reciben, menos el costo, bueno, la cantidad",
        "start": 4249.56,
        "end": 4255.84
    },
    {
        "text": " que pagan es igual a la cantidad recibida, por lo tanto en definitiva, el exidente total",
        "start": 4255.84,
        "end": 4261.88
    },
    {
        "text": " va a ser igual, el valor de los demandantes, menos el costo los referentes. Quiero que",
        "start": 4261.88,
        "end": 4268.96
    },
    {
        "text": " está acá, el exidente total no es ni manimero que les deposición a pagar, menos el costo",
        "start": 4268.96,
        "end": 4277.400000000001
    },
    {
        "text": " de menos. Entonces, este es el máximo de excedente que",
        "start": 4277.4,
        "end": 4288.759999999999
    },
    {
        "text": " puede haber en el mercado, excedente del consumidor, excedente del consumidor, en este caso",
        "start": 4288.759999999999,
        "end": 4295.32
    },
    {
        "text": " reitero, no hay ningún tipo de interferencia, por lo tanto, si se distribuye el máximo",
        "start": 4295.32,
        "end": 4302.0
    },
    {
        "text": " excedente total de la sociedad, estamos hablando de lo que se dice una distribución",
        "start": 4302.0,
        "end": 4307.84
    },
    {
        "text": " eficiente en el mercado.",
        "start": 4307.84,
        "end": 4311.0
    },
    {
        "text": " Y justamente estamos hablando de mercados competitivos, los mercados competitivos se",
        "start": 4311.0,
        "end": 4326.68
    },
    {
        "text": " entiende que cada gente individual toma la decisión en forma racional, los vendedores",
        "start": 4326.68,
        "end": 4332.92
    },
    {
        "text": " en forma racional, los consumidores también. Entonces, se entiende que esto, mercados,",
        "start": 4332.92,
        "end": 4340.6
    },
    {
        "text": " distribuye los venez servicios entre los consumidores que más lo valoran, distribuye la demanda",
        "start": 4340.6,
        "end": 4345.6
    },
    {
        "text": " de venez a los vendedores que los pueden producir a menor costo, produce la cantidad de",
        "start": 4345.6,
        "end": 4350.240000000001
    },
    {
        "text": " venez que maximiza la suma de excedente del consumidor es entre el productor.",
        "start": 4350.24,
        "end": 4355.24
    },
    {
        "text": " A través de esta teapositiva o esto que está contenido ahí, se lo asente el concepto",
        "start": 4355.24,
        "end": 4361.4
    },
    {
        "text": " de mercado competencia perfecta, si nadie ventaja al otro, hay una manera de generar",
        "start": 4361.4,
        "end": 4366.719999999999
    },
    {
        "text": " el producto, los consumidores también deciden en forma óptima en forma racional, todos",
        "start": 4366.719999999999,
        "end": 4374.0
    },
    {
        "text": " operan con esa conducta, pues lo tanto se tiene estos resultados del punto de vista",
        "start": 4374.0,
        "end": 4381.0
    },
    {
        "text": " del funcionamiento de distribución excedente, mejor con respecto a otros mercados donde ya",
        "start": 4381.0,
        "end": 4388.2
    },
    {
        "text": " la situación cambia.",
        "start": 4388.2,
        "end": 4390.08
    },
    {
        "text": " Si cuando hay empresa que determina el precio, cuando hay un poder sobre el mercado,",
        "start": 4390.08,
        "end": 4395.48
    },
    {
        "text": " cuando hay un monopolio, ya es la cosa cambia, es decir, va a haber un resultado diferente,",
        "start": 4395.48,
        "end": 4403.32
    },
    {
        "text": " no va a ser tan eficiente como con mercado competencia perfecta, van a establecer ineficiencia,",
        "start": 4403.32,
        "end": 4411.88
    },
    {
        "text": " establecer el precio, eso va a condicionar la cantidad y obviamente ya distribuye totalmente",
        "start": 4411.88,
        "end": 4418.639999999999
    },
    {
        "text": " el equilibrio de fertidemández, con respecto a un mercado competencia perfecto.",
        "start": 4418.639999999999,
        "end": 4426.08
    },
    {
        "text": " Esto es lo que se conoce en economía como una falla del mercado, hay otras también,",
        "start": 4426.08,
        "end": 4430.44
    },
    {
        "text": " como la mayor dimensión de los productos, o un monopolio o un oligoporio, quizás mejor,",
        "start": 4430.44,
        "end": 4452.16
    },
    {
        "text": " todavía más verificable.",
        "start": 4452.16,
        "end": 4455.919999999999
    },
    {
        "text": " Entonces, vamos a ver, vamos a introducir por lo menos el tema de los impuestos, el tema",
        "start": 4455.92,
        "end": 4464.92
    },
    {
        "text": " de los impuestos, hasta ahora que vimos, vimos cómo los mercados operan malidremente,",
        "start": 4464.92,
        "end": 4471.52
    },
    {
        "text": " o fertidemanda y ahí se lo grababa una eficiencia tanto de los puntos de los consumidores",
        "start": 4471.52,
        "end": 4477.56
    },
    {
        "text": " como lo demandantes, los oferentes, pero vamos a ver qué ocurre cuando interviene",
        "start": 4477.56,
        "end": 4485.88
    },
    {
        "text": " el Estado, como una gente también interveniente en el mercado y en el caso de que está fijando",
        "start": 4486.04,
        "end": 4493.04
    },
    {
        "text": " impuestos, como ustedes saben los impuestos, es una fuente de recaudación que tiene en los",
        "start": 4493.04,
        "end": 4498.36
    },
    {
        "text": " Estados, se financia el gasto público con eso y puede ser directos o indirectos.",
        "start": 4498.36,
        "end": 4505.6
    },
    {
        "text": " ¿Directos?",
        "start": 4505.6,
        "end": 4506.6
    },
    {
        "text": " ¿Hay esa verdad que se opuesto directo?",
        "start": 4506.6,
        "end": 4512.4800000000005
    },
    {
        "text": " ¿Directos?",
        "start": 4512.4800000000005,
        "end": 4515.240000000001
    },
    {
        "text": " ¿Directos?",
        "start": 4515.240000000001,
        "end": 4516.240000000001
    },
    {
        "text": " ¿Directos?",
        "start": 4516.240000000001,
        "end": 4517.240000000001
    },
    {
        "text": " ¿Directos?",
        "start": 4517.240000000001,
        "end": 4518.240000000001
    },
    {
        "text": " ¿Directos?",
        "start": 4518.240000000001,
        "end": 4519.240000000001
    },
    {
        "text": " Sí, conceptualmente que es directo.",
        "start": 4519.240000000001,
        "end": 4522.400000000001
    },
    {
        "text": " ¿Directos?",
        "start": 4522.400000000001,
        "end": 4523.400000000001
    },
    {
        "text": " ¿Directos?",
        "start": 4523.400000000001,
        "end": 4524.400000000001
    },
    {
        "text": " ¿Directos?",
        "start": 4524.400000000001,
        "end": 4525.400000000001
    },
    {
        "text": " ¿Directos?",
        "start": 4525.400000000001,
        "end": 4526.400000000001
    },
    {
        "text": " ¿Directos?",
        "start": 4526.400000000001,
        "end": 4527.400000000001
    },
    {
        "text": " ¿Directos?",
        "start": 4527.400000000001,
        "end": 4528.400000000001
    },
    {
        "text": " ¿Directos?",
        "start": 4528.96,
        "end": 4529.96
    },
    {
        "text": " No, no, no, no, no, no.",
        "start": 4529.96,
        "end": 4531.759999999999
    },
    {
        "text": " ¿Cuánta mente es directo?",
        "start": 4531.759999999999,
        "end": 4533.24
    },
    {
        "text": " ¿Directos?",
        "start": 4533.24,
        "end": 4534.24
    },
    {
        "text": " ¿Directos?",
        "start": 4534.24,
        "end": 4534.879999999999
    },
    {
        "text": " O indirectos.",
        "start": 4534.879999999999,
        "end": 4535.879999999999
    },
    {
        "text": " Ahí ya saben, ¿no?",
        "start": 4535.879999999999,
        "end": 4536.5599999999995
    },
    {
        "text": " ¿Tampoco?",
        "start": 4536.5599999999995,
        "end": 4536.92
    },
    {
        "text": " ¿Directos?",
        "start": 4536.92,
        "end": 4537.759999999999
    },
    {
        "text": " ¿Directos?",
        "start": 4537.759999999999,
        "end": 4539.08
    },
    {
        "text": " ¿Directos?",
        "start": 4539.08,
        "end": 4540.0
    },
    {
        "text": " ¿Directos?",
        "start": 4540.0,
        "end": 4540.48
    },
    {
        "text": " ¿Por qué es indirectos?",
        "start": 4540.48,
        "end": 4541.48
    },
    {
        "text": " ¿Directos?",
        "start": 4541.48,
        "end": 4542.28
    },
    {
        "text": " ¿Directos?",
        "start": 4542.28,
        "end": 4543.28
    },
    {
        "text": " ¿Directos?",
        "start": 4543.28,
        "end": 4545.28
    },
    {
        "text": " ¿Pero no está inatopada en el sitio?",
        "start": 4545.28,
        "end": 4546.92
    },
    {
        "text": " ¿No está paando a eso que está en el sitio?",
        "start": 4546.92,
        "end": 4548.5199999999995
    },
    {
        "text": " ¿Ai va?",
        "start": 4548.5199999999995,
        "end": 4549.5599999999995
    },
    {
        "text": " ¿Directos?",
        "start": 4549.5599999999995,
        "end": 4550.5599999999995
    },
    {
        "text": " Lo que es ya es, ¿no?",
        "start": 4550.5599999999995,
        "end": 4551.5599999999995
    },
    {
        "text": " Yo compro un artículo a cualquiera y sé que estoy pagando un impuesto, pero no voy",
        "start": 4551.5599999999995,
        "end": 4554.719999999999
    },
    {
        "text": " o ya a un lugar que me diga impuesto, ¿no? o la de fe y. ¿Cómo?",
        "start": 4554.72,
        "end": 4560.22
    },
    {
        "text": " ¿Qué os debería de ir directamente?",
        "start": 4560.22,
        "end": 4562.22
    },
    {
        "text": " ¿Como creía que un cliente de mi buscar?",
        "start": 4562.22,
        "end": 4564.22
    },
    {
        "text": " ¿Te nihan país con eso?",
        "start": 4564.22,
        "end": 4566.22
    },
    {
        "text": " ¿Cómo capaz de ir directamente?",
        "start": 4566.22,
        "end": 4568.22
    },
    {
        "text": " ¿Capa que qué?",
        "start": 4568.22,
        "end": 4570.22
    },
    {
        "text": " ¿Capa que le el sastre de lo paga que lo hay?",
        "start": 4570.22,
        "end": 4572.72
    },
    {
        "text": " Bueno, pues, ¿sabes?",
        "start": 4572.72,
        "end": 4574.22
    },
    {
        "text": " ¿Cos realmente es un poco lo que decía?",
        "start": 4574.22,
        "end": 4576.72
    },
    {
        "text": " Es decir, impuesto directo de que realmente lo paga el contribuyente",
        "start": 4576.72,
        "end": 4579.72
    },
    {
        "text": " directamente a la gente recaudador, digamos, ¿no?",
        "start": 4579.72,
        "end": 4583.72
    },
    {
        "text": " O se graba directamente a la persona grabada.",
        "start": 4583.72,
        "end": 4588.72
    },
    {
        "text": " Mientras que el indirecto es que, por ejemplo,",
        "start": 4588.72,
        "end": 4590.72
    },
    {
        "text": " el caso típico de Liva, ¿no?",
        "start": 4590.72,
        "end": 4592.72
    },
    {
        "text": " Cualquier artículo, yo lo compro, sé que estoy pegando un impuesto,",
        "start": 4592.72,
        "end": 4595.72
    },
    {
        "text": " pero lo pago en el comercio, ¿no?",
        "start": 4595.72,
        "end": 4598.72
    },
    {
        "text": " No estoy separando.",
        "start": 4598.72,
        "end": 4601.72
    },
    {
        "text": " En Uruguay también es tu impuesto indirecto muy importante",
        "start": 4601.72,
        "end": 4604.72
    },
    {
        "text": " que se limese.",
        "start": 4604.72,
        "end": 4606.72
    },
    {
        "text": " El imésio también, que dan la nasta hasta este,",
        "start": 4606.72,
        "end": 4609.72
    },
    {
        "text": " si arriesos, voy a sarcolicas,",
        "start": 4609.72,
        "end": 4612.72
    },
    {
        "text": " másticos perfumes, también, cosméticos, tipo autos,",
        "start": 4612.72,
        "end": 4618.72
    },
    {
        "text": " los autos, entonces también pago, me compro un auto,",
        "start": 4618.72,
        "end": 4622.72
    },
    {
        "text": " bueno, tanto peso, tal o pago, pero hay un porcentaje que es impuesto,",
        "start": 4622.72,
        "end": 4629.72
    },
    {
        "text": " el imésio.",
        "start": 4629.72,
        "end": 4631.72
    },
    {
        "text": " Eso se opuesto, hay un montón más,",
        "start": 4631.72,
        "end": 4633.72
    },
    {
        "text": " pero básicamente lo más importante en Uruguay,",
        "start": 4633.72,
        "end": 4635.72
    },
    {
        "text": " el impuesto directo es que paga directamente el contribuyente,",
        "start": 4635.72,
        "end": 4638.72
    },
    {
        "text": " pues con primaria, puede ser un caso de impuesto directo,",
        "start": 4638.72,
        "end": 4643.72
    },
    {
        "text": " este, el RPF que me decía él también,",
        "start": 4643.72,
        "end": 4647.72
    },
    {
        "text": " podemos considerarlo como un impuesto directo,",
        "start": 4647.72,
        "end": 4649.72
    },
    {
        "text": " que, vamos a considerar lo que sí.",
        "start": 4649.72,
        "end": 4652.72
    },
    {
        "text": " ¿De qué le iba a poder dar la foto?",
        "start": 4652.72,
        "end": 4654.72
    },
    {
        "text": " ¿Cómo?",
        "start": 4654.72,
        "end": 4655.72
    },
    {
        "text": " ¿De qué le iba a poder dar el directo directo?",
        "start": 4655.72,
        "end": 4657.72
    },
    {
        "text": " ¿De qué le paga el deporte de la persona?",
        "start": 4657.72,
        "end": 4659.72
    },
    {
        "text": " ¿Le voy a ver, o qué le paraste a la persona directo?",
        "start": 4659.72,
        "end": 4661.72
    },
    {
        "text": " No, para empezar no es directo tampoco,",
        "start": 4661.72,
        "end": 4663.72
    },
    {
        "text": " porque el empresario recauda, no,",
        "start": 4663.72,
        "end": 4668.72
    },
    {
        "text": " es una gente de retención, no es que lo pague el empresario,",
        "start": 4668.72,
        "end": 4673.72
    },
    {
        "text": " yo le compro como una camisa en un local y el empresario me está cobrando a mi",
        "start": 4673.72,
        "end": 4680.72
    },
    {
        "text": " impuesto, él tiene la obligación de darse lo de J.I.",
        "start": 4680.72,
        "end": 4683.72
    },
    {
        "text": " ¿No?",
        "start": 4683.72,
        "end": 4684.72
    },
    {
        "text": " No es que esté grabado él con él, iba,",
        "start": 4684.72,
        "end": 4687.72
    },
    {
        "text": " él paga solo si vende esa camisa,",
        "start": 4687.72,
        "end": 4689.72
    },
    {
        "text": " si no nos paga arriba.",
        "start": 4689.72,
        "end": 4692.72
    },
    {
        "text": " Y además descuenta, ¿no?",
        "start": 4692.72,
        "end": 4694.72
    },
    {
        "text": " es lo que compra, suponiendo que cumpla con todo y nos paga nada.",
        "start": 4694.72,
        "end": 4701.72
    },
    {
        "text": " Es un directo, solamente un directo.",
        "start": 4701.72,
        "end": 4705.72
    },
    {
        "text": " Bueno, también puede ser, bueno, aquí se acá,",
        "start": 4705.72,
        "end": 4710.72
    },
    {
        "text": " el indirecto se paga a través de terceros,",
        "start": 4710.72,
        "end": 4712.72
    },
    {
        "text": " o sea, a través de gente de retención,",
        "start": 4712.72,
        "end": 4714.72
    },
    {
        "text": " por eso yo decía que el RPF, pero bueno,",
        "start": 4714.72,
        "end": 4716.72
    },
    {
        "text": " podemos tomarlo así.",
        "start": 4716.72,
        "end": 4718.72
    },
    {
        "text": " En este caso de Lívar y Messi en un lugar yo no más,",
        "start": 4718.72,
        "end": 4721.72
    },
    {
        "text": " importante, le pudo estar en recaudación, además.",
        "start": 4721.72,
        "end": 4726.72
    },
    {
        "text": " Taza fija o porcentaje, si puede ser un porcentaje,",
        "start": 4726.72,
        "end": 4730.72
    },
    {
        "text": " el impuesto, un porcentaje sobre el monto o directamente una taza fija.",
        "start": 4730.72,
        "end": 4735.72
    },
    {
        "text": " Vamos a ver esta introducción que nos vamos.",
        "start": 4741.72,
        "end": 4744.72
    },
    {
        "text": " El efecto nos heupuesto sobre el efecto y la demanda.",
        "start": 4744.72,
        "end": 4747.72
    },
    {
        "text": " Entonces, vamos.",
        "start": 4747.72,
        "end": 4750.72
    },
    {
        "text": " Impuesto sobre los consumidores, sobre los demandantes.",
        "start": 4750.72,
        "end": 4755.72
    },
    {
        "text": " Impuesto unitario, por cada unidad un bien que los consumidos van a comprar,",
        "start": 4755.72,
        "end": 4761.72
    },
    {
        "text": " se le pone un impuesto T.",
        "start": 4761.72,
        "end": 4765.72
    },
    {
        "text": " Entonces, ¿qué pasa?",
        "start": 4765.72,
        "end": 4768.72
    },
    {
        "text": " El precio de equilibrio, el precio de equilibrio que tenía antes,",
        "start": 4768.72,
        "end": 4773.72
    },
    {
        "text": " el mercado, ¿no?",
        "start": 4773.72,
        "end": 4774.72
    },
    {
        "text": " El cual daba dado por la fértil la demanda,",
        "start": 4774.72,
        "end": 4777.72
    },
    {
        "text": " ya cuando hay un impuesto, esos se distorsione.",
        "start": 4777.72,
        "end": 4780.72
    },
    {
        "text": " En este caso estamos viendo que el precio que paga un consumidor,",
        "start": 4780.72,
        "end": 4786.72
    },
    {
        "text": " el peso obses este, el peso del consumidor,",
        "start": 4786.72,
        "end": 4790.72
    },
    {
        "text": " ya no va a coincidir exactamente con el precio que recibe el vendedor,",
        "start": 4790.72,
        "end": 4794.72
    },
    {
        "text": " porque cuando estamos hablando de un mercado en equilibrio, ¿no?",
        "start": 4794.72,
        "end": 4799.72
    },
    {
        "text": " Este es el precio y esta es la cantidad.",
        "start": 4804.72,
        "end": 4808.72
    },
    {
        "text": " Este precio es el mismo que paga el vendedor, el comprador,",
        "start": 4808.72,
        "end": 4813.72
    },
    {
        "text": " como el que recibe el comprador.",
        "start": 4813.72,
        "end": 4816.72
    },
    {
        "text": " Es el mismo precio.",
        "start": 4816.72,
        "end": 4818.72
    },
    {
        "text": " Cuando aparece un impuesto, ya la cosa se distorsiona.",
        "start": 4818.72,
        "end": 4822.72
    },
    {
        "text": " Este precio se desdobla, digamos, ¿no?",
        "start": 4822.72,
        "end": 4825.72
    },
    {
        "text": " No coinciden el precio que paga el consumidor con el que recibe el vendedor.",
        "start": 4825.72,
        "end": 4831.72
    },
    {
        "text": " Y eso es lo que hay que tener en cuenta, ¿no?",
        "start": 4831.72,
        "end": 4833.72
    },
    {
        "text": " Cuando hay un impuesto, dependiendo un poquito de que nos están indicando,",
        "start": 4833.72,
        "end": 4837.72
    },
    {
        "text": " si es un impuesto sobre la venta o un impuesto sobre la compra.",
        "start": 4837.72,
        "end": 4842.72
    },
    {
        "text": " Entonces, en el caso de este que es un impuesto sobre los consumidores,",
        "start": 4842.72,
        "end": 4846.72
    },
    {
        "text": " vemos que se da una brecha entre el precio que paga el consumidor",
        "start": 4846.72,
        "end": 4850.72
    },
    {
        "text": " y el precio que va a recibir el vendedor,",
        "start": 4850.72,
        "end": 4853.72
    },
    {
        "text": " es decir, el precio que paga el consumidor ahora,",
        "start": 4853.72,
        "end": 4857.72
    },
    {
        "text": " es que tenía ante el vendedor más el té, más el impuesto.",
        "start": 4857.72,
        "end": 4864.72
    },
    {
        "text": " Es decir, la Cuba de Mandá se va a mover en este sentido.",
        "start": 4864.72,
        "end": 4868.72
    },
    {
        "text": " Bueno, acá no se ve muy bien.",
        "start": 4868.72,
        "end": 4871.72
    },
    {
        "text": " Acá tenemos un problema con el pobre pollo.",
        "start": 4871.72,
        "end": 4874.72
    },
    {
        "text": " Entonces, vamos a quedarnos con esto y lo retomamos en la próxima.",
        "start": 4874.72,
        "end": 4882.72
    },
    {
        "text": " Entonces, vamos a ver qué pasa con el efecto de los impuestos sobre los demandantes,",
        "start": 4883.72,
        "end": 4888.72
    },
    {
        "text": " sobre los referentes, pero básicamente tomando en cuenta esto, ¿no?",
        "start": 4888.72,
        "end": 4892.72
    },
    {
        "text": " ¿Cómo se evitúa el tema de que el precio ya no es igual en la ofértila de manda?",
        "start": 4892.72,
        "end": 4897.72
    },
    {
        "text": " Y qué es lo que vamos a terminar para ver este tema,",
        "start": 4897.72,
        "end": 4901.72
    },
    {
        "text": " es quiénes son los que absorben los impuestos,",
        "start": 4901.72,
        "end": 4904.72
    },
    {
        "text": " quiénes realmente son los que se tienen mayor impacto,",
        "start": 4904.72,
        "end": 4909.72
    },
    {
        "text": " cuando se aplican impuestos, uno tiene que pensar que el impuesto lo paga siempre el comprador.",
        "start": 4909.72,
        "end": 4915.72
    },
    {
        "text": " Bueno, vamos a ver si esto está naciono y también ¿cómo afecta a esto la eficiencia de marcado?",
        "start": 4915.72,
        "end": 4923.72
    },
    {
        "text": " Nos vemos la próxima.",
        "start": 4923.72,
        "end": 4925.72
    }
]