[
    {
        "text": " ¿Cómo dijimos la asionratito verdad?",
        "start": 0.0,
        "end": 23.0
    },
    {
        "text": " Vamos a terminar de presentar este tema, que corresponde al primer tópico de economía",
        "start": 24.0,
        "end": 32.76
    },
    {
        "text": " escrita que trata acerca de los indicadores del mercado laboral, el tema de la",
        "start": 32.76,
        "end": 38.6
    },
    {
        "text": " clasificación de la población verdad, el tema de lo que es la clasificación",
        "start": 38.6,
        "end": 42.32
    },
    {
        "text": " de las poblaciones categorías, ya esta altura del no, no tenemos no tenemos",
        "start": 42.32,
        "end": 47.96
    },
    {
        "text": " conveniente de temas dudas y lo que vamos a pasar a presentar en términos",
        "start": 47.96,
        "end": 52.160000000000004
    },
    {
        "text": " teóricos y a la vez lo vamos a comentar con lo que tiene que ver con los",
        "start": 52.160000000000004,
        "end": 56.32
    },
    {
        "text": " ejercicios prácticos hacia las principales tasas de referencia del mercado",
        "start": 56.32,
        "end": 62.4
    },
    {
        "text": " de trabajo y vamos a representar tres tasas de referencia del mercado de",
        "start": 62.4,
        "end": 66.92
    },
    {
        "text": " trabajo, las tres más importantes, por un lado la tasa de actividad, las tres",
        "start": 66.92,
        "end": 74.16
    },
    {
        "text": " son proporciones, las tres son conscientes, las tres son porcentajes, esto dio esto",
        "start": 74.16,
        "end": 81.64
    },
    {
        "text": " por 100, ¿cómo definimos a la tasa de actividad para luego presentar cómo se",
        "start": 81.64,
        "end": 89.47999999999999
    },
    {
        "text": " calcula? ¿Cómo la definimos? ¿la definimos como la proporción de personas",
        "start": 89.47999999999999,
        "end": 94.24
    },
    {
        "text": " mayores de 14 años que se vuelcan al mercado laboral? Esto es, se ofrece en el",
        "start": 94.24,
        "end": 102.32
    },
    {
        "text": " mercado de trabajo, ¿o están trabajando directamente o buscan activamente?",
        "start": 102.32,
        "end": 109.39999999999999
    },
    {
        "text": " La proporción por tanto de personas mayores de 14 años que se vuelcan",
        "start": 109.88,
        "end": 114.6
    },
    {
        "text": " activamente al mercado laboral, ¿qué sobre qué? ¿qué categoría sobre cuál será",
        "start": 114.6,
        "end": 119.28
    },
    {
        "text": " entonces esta tasa de actividad? Miremos el árbol de población",
        "start": 119.28,
        "end": 126.88
    },
    {
        "text": " fuerte, pea sobrepets, esto es la proporción de personas mayores de 14 años",
        "start": 127.88,
        "end": 139.4
    },
    {
        "text": " que buscan o trabajan verdad que se ofrecen en el mercado de trabajo, de ahí que",
        "start": 139.4,
        "end": 144.51999999999998
    },
    {
        "text": " la evolución de la tasa de actividad puede ser tomada como pero se",
        "start": 144.51999999999998,
        "end": 148.8
    },
    {
        "text": " de la evolución en la oferta de trabajo en el mercado laboral, si la tasa de",
        "start": 148.8,
        "end": 154.48
    },
    {
        "text": " actividad está aumentando a ver algo del tiempo, podemos concluir respecto a",
        "start": 154.48,
        "end": 159.39999999999998
    },
    {
        "text": " que se está ofreciendo una mayor cantidad relativa de personas en el mercado de",
        "start": 159.39999999999998,
        "end": 164.0
    },
    {
        "text": " trabajo, hay más gente que se vuelca al mercado de trabajo si es repito que la",
        "start": 164.0,
        "end": 168.67999999999998
    },
    {
        "text": " tasa de actividad está aumentando, si está cayendo podremos decir que la oferta",
        "start": 168.67999999999998,
        "end": 173.64
    },
    {
        "text": " de trabajo está cayendo, por tanto esta tasa de repito puede ser considerada",
        "start": 173.64,
        "end": 178.76
    },
    {
        "text": " proxy de la oferta de trabajo en el mercado laboral, ¿habéis? segunda, tasa de",
        "start": 178.76,
        "end": 186.39999999999998
    },
    {
        "text": " ocupación o tasa de empleo, la definimos, sí, bien el compañero ya no está dando",
        "start": 186.39999999999998,
        "end": 196.39999999999998
    },
    {
        "text": " la formula, la verdad dice que se calcula como ocupados sobre pet por 100, si",
        "start": 196.39999999999998,
        "end": 202.76
    },
    {
        "text": " este resultado da un 60% como interpretamos, es 60%",
        "start": 202.76,
        "end": 209.76
    },
    {
        "text": " el 60% de los que pueden trabajar están trabajando, o algo así el tema de poder",
        "start": 213.04,
        "end": 222.32
    },
    {
        "text": " trabajar está dado por qué? son pet, ¿qué es ser pet?",
        "start": 222.32,
        "end": 231.79999999999998
    },
    {
        "text": " pertenecen a que grupo de población en edad de trabajo, es correcto lo que",
        "start": 232.76,
        "end": 239.79999999999998
    },
    {
        "text": " estás diciendo, por eso pero quería clarizar el poder trabajar que significa el",
        "start": 239.79999999999998,
        "end": 244.72
    },
    {
        "text": " 60% de las personas mayores de 14 años declaran la encuesta está realizando",
        "start": 244.72,
        "end": 250.44
    },
    {
        "text": " una actividad remunerada al menos durante una hora, por lo tanto está ocupada,",
        "start": 250.44,
        "end": 254.07999999999998
    },
    {
        "text": " 6 de cada 10 personas mayores de 14 años están trabajando, está realizando",
        "start": 254.07999999999998,
        "end": 259.96
    },
    {
        "text": " actividad remunerada, por tanto si la tasa de actividad era una medida",
        "start": 259.96,
        "end": 264.76
    },
    {
        "text": " aproximada de las farta de trabajo, en este caso la tasa de ocupación o tasa de",
        "start": 264.76,
        "end": 269.59999999999997
    },
    {
        "text": " empleo podrá ser considerada como una medida de la demanda de trabajo en el",
        "start": 269.59999999999997,
        "end": 274.96
    },
    {
        "text": " mercado de trabajo, esto es, si a lo largo del tiempo yo advierto una serie",
        "start": 274.96,
        "end": 279.24
    },
    {
        "text": " histórica que la tasa de ocupación o tasa de empleo está aumentando,",
        "start": 279.24,
        "end": 283.52
    },
    {
        "text": " podría concluir respecto a qué podría decir que la demanda de trabajo ahora",
        "start": 283.52,
        "end": 290.15999999999997
    },
    {
        "text": " es la que está aumentando en el mercado laboral, me explico bien, alguna duda,",
        "start": 290.15999999999997,
        "end": 298.44
    },
    {
        "text": " ninguna, excelente, mejor imposible, tasa de desempleo, la vedete del mercado,",
        "start": 298.44,
        "end": 306.08
    },
    {
        "text": " la tasa de desempleo o tasa de ocupación, ¿por qué digo la vedete del mercado?",
        "start": 306.08,
        "end": 310.2
    },
    {
        "text": " ¿Por qué es la que más se comenta? Es la que está, además,",
        "start": 310.2,
        "end": 313.68
    },
    {
        "text": " blanqueando, demostrando y exponiendo uno de los principales problemas que hace",
        "start": 313.68,
        "end": 320.2
    },
    {
        "text": " al tema laboral, el mercado de trabajo esto es, aquellas personas que quieren",
        "start": 320.2,
        "end": 325.2
    },
    {
        "text": " trabajar pero buscan activamente y no, y no que, continúe, complete la",
        "start": 325.2,
        "end": 334.76
    },
    {
        "text": " operación y no lo encuentran, lo consiguen, por lo tanto blanquea uno de los",
        "start": 334.76,
        "end": 339.0
    },
    {
        "text": " problemas del mercado de trabajo, de ahí que es una de las más mostradas,",
        "start": 339.0,
        "end": 343.48
    },
    {
        "text": " analizadas, ¿verdad? Una más interesante y más importante, un tasa de desempleo,",
        "start": 343.48,
        "end": 348.32
    },
    {
        "text": " ¿cómo interpretar el resultado de tasa de desempleo? Conceptualmente que representa,",
        "start": 348.32,
        "end": 353.71999999999997
    },
    {
        "text": " la tasa de desempleo, vamos a ver luego cómo se calcula, ¿qué representa la",
        "start": 353.71999999999997,
        "end": 358.71999999999997
    },
    {
        "text": " tasa de desempleo? En términos conceptuales, es una proporción también, verdad?",
        "start": 358.72,
        "end": 365.28000000000003
    },
    {
        "text": " Es un porcentaje, es una proporción de personas mayores de 14 años que buscan",
        "start": 365.28000000000003,
        "end": 373.32000000000005
    },
    {
        "text": " trabajos activamente y no lo encuentran. ¿Cuántas personas mayores de",
        "start": 373.32000000000005,
        "end": 378.92
    },
    {
        "text": " 14 años que buscan que se ofrecen en el mercado cuántos de ellos terminan",
        "start": 378.92,
        "end": 383.92
    },
    {
        "text": " la tiobora no lo encuentran? Por lo tanto, ¿qué sobre qué estamos calculando?",
        "start": 383.92,
        "end": 388.24
    },
    {
        "text": " ¿Fuerte?",
        "start": 390.76,
        "end": 391.48
    },
    {
        "text": " ¿de su ocupado sobre?",
        "start": 394.48,
        "end": 396.24
    },
    {
        "text": " Correcto, pea.",
        "start": 399.24,
        "end": 400.72
    },
    {
        "text": " ¿Qué dijimos nosotros?",
        "start": 404.56,
        "end": 406.24
    },
    {
        "text": " ¿Qué dijimos cuando decíamos conceptualmente cómo leer esta tasa de desempleo?",
        "start": 408.40000000000003,
        "end": 413.44
    },
    {
        "text": " ¿De total de personas mayores de 14 años estaba dentro de la PET que buscan",
        "start": 414.40000000000003,
        "end": 421.08000000000004
    },
    {
        "text": " trabajos activamente, me metí en la PETA, como hace? ¿Cuántos no lo encuentran?",
        "start": 421.08000000000004,
        "end": 426.72
    },
    {
        "text": " ¿De su ocupado sobre?",
        "start": 426.72,
        "end": 427.8
    },
    {
        "text": " ¿Sorrepea?",
        "start": 431.28000000000003,
        "end": 431.92
    },
    {
        "text": " Adviertan la diferencia, ¿no? Que es fácilmente, fácil de cometer el error,",
        "start": 434.88,
        "end": 443.56
    },
    {
        "text": " decir todo, se llega calculando sobre PET, ¿verdad? Bueno, calculo la tasa de desempleo",
        "start": 443.56,
        "end": 447.16
    },
    {
        "text": " también sobre PET, ¿no? ¿Cuidado? ¿Estamos calculando sobre la pea en este caso?",
        "start": 447.16,
        "end": 450.32
    },
    {
        "text": " ¿Tamos, ¿acuerdo?",
        "start": 453.16,
        "end": 454.16
    },
    {
        "text": " Si la tasa de desempleo en la economía nos da 8 por ciento,",
        "start": 455.04,
        "end": 459.52
    },
    {
        "text": " diremos que 8 de cada 100 personas o de cada 100 personas que buscan trabajos",
        "start": 459.52,
        "end": 464.92
    },
    {
        "text": " activamente y mayores de 14 años, 8 no lo encuentran.",
        "start": 464.92,
        "end": 468.56
    },
    {
        "text": " ¿Estamos, ¿acuerdo?",
        "start": 469.48,
        "end": 470.28
    },
    {
        "text": " ¿Alguna duda con la presentación teórica de las tasas? ¿Cómo se calcula,",
        "start": 471.23999999999995,
        "end": 475.52
    },
    {
        "text": " qué cómo se lee cada una? Bien, los invitó entonces a tomar el práctico también número 1",
        "start": 475.52,
        "end": 481.76
    },
    {
        "text": " y vamos a meternos en el ejercicio número 3.",
        "start": 481.76,
        "end": 484.03999999999996
    },
    {
        "text": " El ejercicio 3 nos presenta un cuadro donde tenemos a la población total 10.000 personas,",
        "start": 500.28,
        "end": 510.0
    },
    {
        "text": " mujeres 6.000, nos da datos de la pea, población económicamente activa, 4.000 en el global del país,",
        "start": 510.0,
        "end": 522.0
    },
    {
        "text": " para todo el país y a nivel de género nos da datos de las mujeres 3.000 ocupados",
        "start": 522.0,
        "end": 529.8399999999999
    },
    {
        "text": " 1.000 de todo el país 600 hombres ocupados de esos ocupados no nos da nada,",
        "start": 530.84,
        "end": 542.36
    },
    {
        "text": " no nos dice nada, nos da datos de esos ocupados hombres y de esos ocupados mujeres y por tanto",
        "start": 542.36,
        "end": 549.2800000000001
    },
    {
        "text": " nos da todo el sumo.",
        "start": 549.2800000000001,
        "end": 550.2
    },
    {
        "text": " Población económicamente inactiva nos dice que son mil hombres, no nos da a todo el",
        "start": 551.2,
        "end": 560.44
    },
    {
        "text": " mujer ni el población total, población que está en edad de trabajar pet 6.000 y población que no",
        "start": 560.44,
        "end": 572.5200000000001
    },
    {
        "text": " está en edad de trabajar, población, que dice población que no está en edad de trabajar",
        "start": 572.5200000000001,
        "end": 577.76
    },
    {
        "text": " 1.000 de todo el país y en primer lugar nos dice que completemos el cuadro. No lo voy a",
        "start": 578.76,
        "end": 583.4399999999999
    },
    {
        "text": " ver, vamos a hacer algunas comentarios generales y después ustedes lo termina, la lógica de resoluciones",
        "start": 583.4399999999999,
        "end": 588.28
    },
    {
        "text": " exactamente la misma. A ver, en la lectura horizontal sabemos que el total de",
        "start": 588.28,
        "end": 596.16
    },
    {
        "text": " algo de hombres y todo el de mujeres no da total de la población, ¿verdad? Bien, por tanto,",
        "start": 596.16,
        "end": 601.76
    },
    {
        "text": " si sabemos que la población total es 10.000 y sabemos que hay 6.000 mujeres hay 4.000 hombres,",
        "start": 601.76,
        "end": 607.88
    },
    {
        "text": " ¿verdad? Entonces, en términos horizontales, ¿verdad? En la población total las separamos",
        "start": 607.88,
        "end": 614.76
    },
    {
        "text": " en estos 2 generos que están planteados, ¿verdad? Estados de situaciónos, ¿no? ¿Se",
        "start": 614.76,
        "end": 618.2
    },
    {
        "text": " como llamables? O hombres y mujeres por lo tanto, si la población total es de 4.000 y hay",
        "start": 618.2,
        "end": 622.16
    },
    {
        "text": " 3.000 mujeres, bueno, 1.000 serán hombres. Bien, seguimos ¿no? ¿Qué pasa acá? 400, ¿verdad?",
        "start": 622.16,
        "end": 635.0
    },
    {
        "text": " Es decir, no debería verdudas en estos llenados hasta ahora, si alguien tiene duda me lo pregunta.",
        "start": 635.0,
        "end": 640.1999999999999
    },
    {
        "text": " Bien, y hasta acá llegamos ¿no? Porque en términos horizontales no podemos llenar más. A ver,",
        "start": 640.1999999999999,
        "end": 648.28
    },
    {
        "text": " ¿cómo podemos sacar los desocupados totales? ¿Qué está la? Bien, el compañero dice que la",
        "start": 648.28,
        "end": 658.28
    },
    {
        "text": " pie está formada por ocupado más desocupados, por lo tanto en este caso los desocupados anteriores",
        "start": 658.28,
        "end": 662.12
    },
    {
        "text": " de todo el país son 3.000. Los desocupados hombres son 400, desocupados mujeres son",
        "start": 662.12,
        "end": 671.56
    },
    {
        "text": " 200, 200, estamos de acuerdo lo que estamos haciendo, siente, entre duda, levanta la mano.",
        "start": 671.56,
        "end": 676.7199999999999
    },
    {
        "text": " Bien, población económicamente inactiva, ¿cómo la obtenemos? ¿Cómo la obtenemos? ¿O",
        "start": 676.7199999999999,
        "end": 690.52
    },
    {
        "text": " otra persona, ver? ¿Por la situación total menos pea? Porque si voy a largo, ¿no? Que presentamos",
        "start": 690.52,
        "end": 699.4
    },
    {
        "text": " la sesión anterior, sabemos que de la población total tenemos, de la población total tenemos",
        "start": 699.4,
        "end": 706.0
    },
    {
        "text": " la población de la de trabajar y la población que no está en la de trabajar. Dentro de la",
        "start": 706.0,
        "end": 711.48
    },
    {
        "text": " población que está en la de trabajar, dentro de la PET, tenemos a quién y quién? La pea y la",
        "start": 711.48,
        "end": 720.68
    },
    {
        "text": " verdad, por lo tanto la pea y la calculamos cómo? La PET, menos pea, es igual a PET, ¿no está?",
        "start": 721.2399999999999,
        "end": 732.7199999999999
    },
    {
        "text": " 6.000, menos 4.000 de pea, 2.000 forman parte de la población económicamente inactiva.",
        "start": 732.7199999999999,
        "end": 740.64
    },
    {
        "text": " Estamos de acuerdo a aquellos que se hayan perdido un poquito en esta lectura que hicimos mental",
        "start": 740.64,
        "end": 745.56
    },
    {
        "text": " de la árbol, lo invito a ir a la clase anterior a lo que tiene en escrito. Mire lo que",
        "start": 745.56,
        "end": 750.3199999999999
    },
    {
        "text": " tiene en escrito y van a dudas. Bien, seguimos. PAY, PAY para mujeres, cuántos nos da a mil. Bien,",
        "start": 750.32,
        "end": 762.8000000000001
    },
    {
        "text": " población de de trabajar, de los hombres, de los total lo tenemos, de los hombres. ¿Cómo",
        "start": 762.8000000000001,
        "end": 771.5200000000001
    },
    {
        "text": " lo calculaste? ¿Qué calculaste acá? No sé quién habló, habló alguien. ¿Qué calculaste?",
        "start": 771.52,
        "end": 789.72
    },
    {
        "text": " Perdón. Péjame a país. La PET, ¿vamos a acuerdo? ¿Aguien tiene dudas? Correcto, ¿no?",
        "start": 789.72,
        "end": 798.56
    },
    {
        "text": " Bien, ¿y lo mismo para las mujeres? 4.000, tenemos acá.",
        "start": 799.0799999999999,
        "end": 802.66
    },
    {
        "text": " población que no está en de trabajar. Habíamos dicho que la población total tenemos los mayores",
        "start": 802.66,
        "end": 809.04
    },
    {
        "text": " de 14 años, la PET y los menores de 14, la PNOF, todo tanto por diferencia. 10.000, menos 6.000,",
        "start": 809.04,
        "end": 815.92
    },
    {
        "text": " 4.000 niños, a nivel de todo el país, 4.000, menos 2.000, 2.000, varones y 6.000, menos 4.000, 2.000,",
        "start": 815.92,
        "end": 826.64
    },
    {
        "text": " también menos. Y en términos horizontales sierra ¿no? Estamos a acuerdo. ¿Hay alguien",
        "start": 826.64,
        "end": 834.0
    },
    {
        "text": " tiene dudas con el completado del cuadro? ¿Hay alguien dirá qué tiene que ver con las tasas",
        "start": 834.0,
        "end": 838.76
    },
    {
        "text": " que acabamos de presentar? La respuesta es, nada, ¿no? Nada, pero bueno, como estamos",
        "start": 838.76,
        "end": 845.04
    },
    {
        "text": " también resolviendo práctico, ya aprovechamos y lo hacemos. Porque ahora sí nos piden",
        "start": 845.04,
        "end": 848.64
    },
    {
        "text": " que calculemos la tasa de actividad, tasa de empleo y tasa de desempleo para la población",
        "start": 848.64,
        "end": 853.64
    },
    {
        "text": " total. Esto es para la primer columna. No lo voy a escribir porque no tengo nada a dir",
        "start": 853.64,
        "end": 858.56
    },
    {
        "text": " al tapizar rom. Pero la tasa de actividad, ¿cuánto he ido? ¿Cuánto?",
        "start": 858.56,
        "end": 862.0799999999999
    },
    {
        "text": " Mira, ¿en acá, Borises? ¿Cuál? La tasa de actividad a nivel de la población total.",
        "start": 862.0799999999999,
        "end": 870.56
    },
    {
        "text": " Pía sobre P, ¿verdad? Por 100, 4.000 dividido, 6.000, 0.75, ¿no? Por 100, 75, 75, ¿qué? Por",
        "start": 870.56,
        "end": 885.8
    },
    {
        "text": " 100. La tasa de actividad me da 75%. Bien, la tasa de desempleo. Perdón, como que",
        "start": 885.8,
        "end": 898.76
    },
    {
        "text": " calculamos la tasa de desempleo? Dezocupado sobre P, ¿verdad? Por 100. ¿Cuánto de",
        "start": 898.76,
        "end": 903.92
    },
    {
        "text": " desocupado sanidad de todo el país tenemos? 3.000 dividido, P, ¿cuántos? 4.000, ahora sí,",
        "start": 903.92,
        "end": 917.1
    },
    {
        "text": " 0.75, ¿verdad? Por 100, ¿cuánto? 75% de tasa de desempleo. Esta economía está",
        "start": 917.1,
        "end": 926.92
    },
    {
        "text": " en el horno. 75% de tasa de desempleo parece un poco mucho, ¿no? Porque mire los datos",
        "start": 926.92,
        "end": 934.56
    },
    {
        "text": " para Uruguay, por ejemplo, estos últimos trimestres, ¿qué tasa de desempleo tenemos a nivel",
        "start": 934.56,
        "end": 940.92
    },
    {
        "text": " de todo el país? En Uruguay, ¿no? ¿Dónde vivimos? Y en Uruguay, ¿eh? Bueno, ¿no?",
        "start": 940.92,
        "end": 949.56
    },
    {
        "text": " Juntamos con alguien argentino y dice, ¿quánto de tasa de desempleo ustedes? ¿Por qué",
        "start": 949.56,
        "end": 957.88
    },
    {
        "text": " es de buen saire? ¿Has otros temas? Bueno, el inenuestro es cualquier cosa, pero ustedes",
        "start": 957.88,
        "end": 965.2399999999999
    },
    {
        "text": " son más serios, ¿no? Es porteño, ¿no? Es como que bueno, ¿cuál de tasa de desempleo",
        "start": 965.2399999999999,
        "end": 971.7199999999999
    },
    {
        "text": " en Uruguay? ¿Más o menos? ¿Debe ser 75%? ¿60% o no? ¿Más o menos un 7 y 5%, ¿verdad?",
        "start": 971.72,
        "end": 982.34
    },
    {
        "text": " 7, 7, 8, andamos a liberar, ¿verdad? En esos números andamos. Por eso dije que",
        "start": 982.34,
        "end": 988.2
    },
    {
        "text": " 75 es un disparate, ¿no? Pobre país. Y en los peores momentos de Uruguay, en los peores",
        "start": 988.2,
        "end": 994.08
    },
    {
        "text": " de Uruguay, ¿no? Pero, al menos de los últimos 30 años, la tasa de desempleo quizás",
        "start": 994.08,
        "end": 999.64
    },
    {
        "text": " como mucho tocó 18%, 19%, 20%, a nivel de todo el país, ¿verdad? No hablo ni de mujeres",
        "start": 999.64,
        "end": 1006.64
    },
    {
        "text": " ni de hombres, ni de otros subgroupos, ¿no? De todo el país, que es mucho, ¿verdad?",
        "start": 1006.64,
        "end": 1011.96
    },
    {
        "text": " 20% es un disparate, ¿sí, sí? Más el doble lo que hay ahora, ¿sí? ¿sí, sí? Por",
        "start": 1011.96,
        "end": 1017.96
    },
    {
        "text": " eso que uno tiene que decir a ver, estamos en la época donde, ¿no? Las dificultades",
        "start": 1017.96,
        "end": 1023.16
    },
    {
        "text": " de laborales no se visualizan, digo, cuando hay dificultades para conseguir trabajo, hay",
        "start": 1023.16,
        "end": 1027.12
    },
    {
        "text": " dificultades para conseguir trabajo. No es chiste, quiero decir, ¿no? Quizás usted",
        "start": 1027.12,
        "end": 1032.52
    },
    {
        "text": " es también un poco poblada a 2017, poblada está acostumbrada, ¿sí, quiero trabajar",
        "start": 1032.52,
        "end": 1039.32
    },
    {
        "text": " que a paz que consigo, fácil o no? Y todavía ganó mucho porque dicen que los ingenieros",
        "start": 1039.32,
        "end": 1043.8799999999999
    },
    {
        "text": " no son muy demandados. Bien, pero no siempre fueron muy demandados, ingenieros. Me",
        "start": 1043.8799999999999,
        "end": 1048.12
    },
    {
        "text": " explico, no siempre hubo trabajo para todo el mundo, no siempre fue tan fácil. Ah, bueno,",
        "start": 1048.12,
        "end": 1053.6
    },
    {
        "text": " trabajo ahora porque igual el trabajo cuando quiero, porque sé que si salgo a buscar",
        "start": 1053.6,
        "end": 1056.78
    },
    {
        "text": " consigo, ¿wait? Estamos en una buena época, pero cuidado, no siempre, es una buena época,",
        "start": 1056.78,
        "end": 1061.8799999999999
    },
    {
        "text": " ¿no? Por eso también de aprovechar las épocas buenas, porque no siempre hay épocas",
        "start": 1061.8799999999999,
        "end": 1068.0
    },
    {
        "text": " buenas. Bien, tasas de ocupación son cocientes simples, como decía estúen la pausa, ¿verdad?",
        "start": 1068.0,
        "end": 1078.04
    },
    {
        "text": " No, las tasas son simples cocientes, ¿cómo calculamos la tasa de empleo? ¿Cómo la",
        "start": 1078.04,
        "end": 1084.1599999999999
    },
    {
        "text": " calculamos teóricamente? Teóricamente, la tasa de ocupación de empleo, ¿cómo la calculamos?",
        "start": 1084.1599999999999,
        "end": 1092.48
    },
    {
        "text": " Acá, ¿no? Esto que está acá, bien, y esto que está acá dice que, fuerte, ¿quién",
        "start": 1092.48,
        "end": 1107.88
    },
    {
        "text": " está hablando? Ahí está, bien, bien, un puñero, ¿verdad? Dale, bien, fuerte. Bien,",
        "start": 1107.88,
        "end": 1117.04
    },
    {
        "text": " ocupados sobre PET, ocupados sobre la población de trabajar y en el marco de los números",
        "start": 1117.04,
        "end": 1120.94
    },
    {
        "text": " de la ejercicio de todo el país, cuántos ocupados y cuántas PET tenemos y cuántos del cociente.",
        "start": 1120.94,
        "end": 1125.44
    },
    {
        "text": " Mil, sobre 6.000, un sexto, ¿verdad? 0,16 por 100, 16,67 por ciento. ¿Alguien tiene",
        "start": 1127.44,
        "end": 1136.3
    },
    {
        "text": " duda lo que estamos haciendo? ¿A los que están charlando? ¿Tienen duda o no? O está",
        "start": 1136.3,
        "end": 1141.54
    },
    {
        "text": " clarísimo esto, y seguimos, ahí me vine al pelo para seguir. No hay dudas, bien, seguimos.",
        "start": 1141.54,
        "end": 1147.42
    },
    {
        "text": " Calcura, está específica de actividad, empleo de desempleo para mujeres lo hacen en casa,",
        "start": 1148.42,
        "end": 1153.22
    },
    {
        "text": " ¿verdad? Es exactamente lo mismo, pero en vez de la columna del total país, columna de mujeres.",
        "start": 1153.22,
        "end": 1157.54
    },
    {
        "text": " Es exactamente lo mismo, ¿no? Debería haber dudas, si no lo hubo para total país. Bien,",
        "start": 1157.54,
        "end": 1162.02
    },
    {
        "text": " seguimos, supongo que en el año 2012, la tasa de desempleo aumentó, indique qué puede",
        "start": 1162.02,
        "end": 1171.18
    },
    {
        "text": " haber sucedido con la oferta y la demanda de trabajo. Y este tema está pregunta.",
        "start": 1171.18,
        "end": 1180.1000000000001
    },
    {
        "text": " No se está llevando a, ya no tanto en el tema de escribtivo sino de analítico, ¿por qué",
        "start": 1185.6200000000001,
        "end": 1194.42
    },
    {
        "text": " puede haber subido o bajado? ¿Cómo puede explicarse la trayectoria de la tasa de desempleo",
        "start": 1194.42,
        "end": 1200.66
    },
    {
        "text": " en función de lo que pase con la oferta y la demanda de trabajo? Las medidas de la oferta y la",
        "start": 1200.66,
        "end": 1206.1000000000001
    },
    {
        "text": " demanda de trabajo eran cuales en términos lativos. ¿Qué tasas daban cuenta de la evolución",
        "start": 1206.1000000000001,
        "end": 1213.1000000000001
    },
    {
        "text": " de la oferta de trabajo? ¿Qué tasa? La de actividad correcto. Habíamos dicho, cuando presentamos",
        "start": 1213.1000000000001,
        "end": 1221.78
    },
    {
        "text": " la tasa de actividad dijimos, si la tasa de actividad sube eso no está mostrando que del total",
        "start": 1221.78,
        "end": 1227.82
    },
    {
        "text": " de mayores de 14 años, ¿no? De la persona mayor de 14 años hay más gente que se volcó,",
        "start": 1227.82,
        "end": 1232.1
    },
    {
        "text": " se ofrece al mercado de trabajo. Por eso que la tasa de actividad podía ser utilizada como",
        "start": 1232.1,
        "end": 1237.54
    },
    {
        "text": " peroxido de la oferta de trabajo en el mercado. En cambio, la tasa de ocupación o empleo,",
        "start": 1237.54,
        "end": 1243.66
    },
    {
        "text": " en tanto me muestra relativamente del total de mayores de 14 años, cuántos están trabajando,",
        "start": 1243.66,
        "end": 1250.22
    },
    {
        "text": " si aumenta esta última la tasa de ocupación o empleo, podré concluir que la demanda de trabajo",
        "start": 1250.22,
        "end": 1256.6200000000001
    },
    {
        "text": " está aumentando. Porque como todo el mercado de trabajo también interactuvo o farte de manda,",
        "start": 1256.6200000000001,
        "end": 1263.1000000000001
    },
    {
        "text": " quizás no comentamos eso. En el mercado de trabajo interactúa la gente que ofrece su",
        "start": 1263.1000000000001,
        "end": 1267.94
    },
    {
        "text": " fuerza de trabajo respecto a las empresas que demandan la fuerza de trabajo, ¿verdad? Están",
        "start": 1267.94,
        "end": 1273.18
    },
    {
        "text": " quienes ofrecen y quienes demandan. En términos descriptivos, la tasa de actividad será tomada,",
        "start": 1273.18,
        "end": 1278.78
    },
    {
        "text": " puede ser tomada como medida de la oferta y la tasa de ocupación como medida de la demanda de trabajo.",
        "start": 1278.78,
        "end": 1284.06
    },
    {
        "text": " Está claro, por lo tanto esta pregunta que nos dice, suponga que en el año 2012 la tasa de",
        "start": 1284.06,
        "end": 1292.5
    },
    {
        "text": " desempleo aumentó, señal, ¿qué puede haber sucedido con la oferta de manda de trabajo? Por lo",
        "start": 1292.5,
        "end": 1298.46
    },
    {
        "text": " tanto nos dice, ¿podemos vincular la evolución de la tasa de desempleo en función o respecto a lo",
        "start": 1298.46,
        "end": 1307.58
    },
    {
        "text": " que esté sucediendo con la tasa de actividad y tasa de ocupación? Por tanto, o farte de manda,",
        "start": 1307.58,
        "end": 1314.1799999999998
    },
    {
        "text": " yo puedo explicar la evolución de desempleo en función de lo que pase con la oferta y la demanda,",
        "start": 1314.1799999999998,
        "end": 1319.4199999999998
    },
    {
        "text": " la respuesta es sí. Podemos demostrar, se puede demostrar, lo voy a hacer acá para la cámara,",
        "start": 1319.4199999999998,
        "end": 1330.1399999999999
    },
    {
        "text": " hasta bien acá, sí, bien. A ver, ya no han términos porcentuales, pero sí la tasa de",
        "start": 1330.14,
        "end": 1342.0600000000002
    },
    {
        "text": " desempleo, ¿no? En términos decimales se calcula como que o qué la tasa de desempleo.",
        "start": 1342.0600000000002,
        "end": 1346.74
    },
    {
        "text": " Acá está, ¿no? Acá está. De eso ocupado sobre pega, ¿verdad?",
        "start": 1346.74,
        "end": 1351.3000000000002
    },
    {
        "text": " No le voy a poner por 100, porque le voy a presentar en términos de",
        "start": 1354.3000000000002,
        "end": 1357.5400000000002
    },
    {
        "text": " desempleo, pero es lo mismo, ¿verdad? En términos porcentuales multiplico por 100, no hay bien.",
        "start": 1357.54,
        "end": 1363.18
    },
    {
        "text": " Nosotros sabemos que la pega está formada por ocupados más desocupados o no. La pega es igual",
        "start": 1367.26,
        "end": 1377.1399999999999
    },
    {
        "text": " ocupados más desocupados, piensen el árbol, ¿no? La pega tenemos ocupados y eso ocupado,",
        "start": 1377.1399999999999,
        "end": 1384.02
    },
    {
        "text": " ¿tamos acuerdo? Por lo tanto los desocupados son la pega menos los ocupados, me siguen los desocupados,",
        "start": 1384.02,
        "end": 1392.74
    },
    {
        "text": " son la pega menos los ocupados, esto estoy diciendo. Si la pega es igual ocupado más desocupados,",
        "start": 1392.74,
        "end": 1400.22
    },
    {
        "text": " los desocupados son la pega menos ocupados. Está claro lo que estoy diciendo. ¿Hay",
        "start": 1400.22,
        "end": 1406.4
    },
    {
        "text": " entiendes duda de esto? Si o no, gracias, ¿no? Gracias. Bien, por tanto los desocupados son",
        "start": 1406.4,
        "end": 1415.88
    },
    {
        "text": " pega menos ocupados, hasta ahí, ¿tamos bien, verdad? Bien, gracias. Seguimos, voy a seguir acá abajo",
        "start": 1415.88,
        "end": 1424.64
    },
    {
        "text": " porque me queda como, no más. No sé cómo se llama, pero a este cociente lo voy a separar en dos.",
        "start": 1424.64,
        "end": 1431.3600000000001
    },
    {
        "text": " Yo lo voy a hacer, ustedes me dicen si está bien y si algunos saben cómo se llama ese procedimiento,",
        "start": 1432.24,
        "end": 1437.28
    },
    {
        "text": " le agradezco. A ver, lo que voy a hacer es esto. Pía sobre pega menos ocupados sobre pega.",
        "start": 1437.28,
        "end": 1446.28
    },
    {
        "text": " Abrí un cociente, ¿cómo se llama esto en términos matemáticos? A partura de cociente, ¿no?",
        "start": 1450.28,
        "end": 1456.36
    },
    {
        "text": " Tipo, cociente partido al medio. ¿Eh? A una la hice dos, con un divisor común.",
        "start": 1456.36,
        "end": 1467.36
    },
    {
        "text": " No tiene nombre esto, mínimo como multilinominador común, ¿no? Porque sería el revés.",
        "start": 1470.6399999999999,
        "end": 1475.7199999999998
    },
    {
        "text": " Sí, como el revés. Ah, está. Es un revés de un denominador común. Es común de nominadores,",
        "start": 1475.7199999999998,
        "end": 1482.28
    },
    {
        "text": " al revés. Es un chistecito de alguien veterano que bueno, a mí me dio gracias. Bueno, no importa,",
        "start": 1482.28,
        "end": 1489.36
    },
    {
        "text": " bien, para servirme en ochem, ya me bastó para llevarme una sonrecita. Bien, como me hice mi",
        "start": 1489.36,
        "end": 1495.12
    },
    {
        "text": " señal de la voz, te reí solo de tu chiste porque y muchas veces sí, yo me estoy reendo de mi chiste",
        "start": 1495.12,
        "end": 1501.2
    },
    {
        "text": " que son muy malos, pero bueno, marrí, está, está, bueno. Entonces lo que encontramos es,",
        "start": 1501.2,
        "end": 1506.28
    },
    {
        "text": " a ver, que la tasa de desempleo que es uno, ¿verdad? Pía, sobrepega, claramente. La tasa de",
        "start": 1506.28,
        "end": 1514.48
    },
    {
        "text": " desempleo es uno menos ocupado sobrepea, por tanto uno menos la tasa de que, la tasa de ocupación,",
        "start": 1514.48,
        "end": 1522.44
    },
    {
        "text": " uno menos la tasa de ocupación, esto es pea, ocupado sobrepea, ¿no? Uno menos la tasa de ocupación,",
        "start": 1522.44,
        "end": 1531.12
    },
    {
        "text": " porque la tasa de ocupación, no, la tasa se calcula como ocupado sobrepeats y acá tenemos",
        "start": 1532.12,
        "end": 1539.52
    },
    {
        "text": " ocupado sobrepea, por lo tanto, vamos para atrás, de nuevo, la tasa de desempleo es uno menos la",
        "start": 1539.52,
        "end": 1546.52
    },
    {
        "text": " tasa de... La empleo, ¿no? Quiente de quién está hablando? Allá, la tasa, uno menos la tasa,",
        "start": 1546.52,
        "end": 1557.28
    },
    {
        "text": " tasa de desempleo, tasa de ocupación, lo mismo, ¿no? Estamos ahí, maquél, ¿no? Y debe ser uno menos",
        "start": 1558.28,
        "end": 1565.6399999999999
    },
    {
        "text": " ocupados. Uno menos ninguna tasa, eso no es ninguna tasa, ¿no? Entonces uno levanta la",
        "start": 1565.6399999999999,
        "end": 1577.96
    },
    {
        "text": " mano y dice, uno menos ninguna tasa, ¿no hicisteas? ¿O no hicisteas? Uno menos ninguna tasa,",
        "start": 1577.96,
        "end": 1584.32
    },
    {
        "text": " pero la podemos hacer aparecer, me gustó ese término, magia, si yo divido numerador y denominador",
        "start": 1584.32,
        "end": 1592.96
    },
    {
        "text": " por lo mismo, el cociente no se altera, matemática, básica, por lo tanto voy a dividir numerador y",
        "start": 1592.96,
        "end": 1600.48
    },
    {
        "text": " denominador por quien, por pet y ahora sí, en el numerador quien aparece, ocupado sobre pet,",
        "start": 1600.48,
        "end": 1610.0
    },
    {
        "text": " ¿qué es la tasa de ocupación? Y en el denominador quien aparece, pea sobre pet,",
        "start": 1610.0,
        "end": 1615.16
    },
    {
        "text": " la tasa de actividad y ahora sí, por lo tanto lo que estamos diciendo que la tasa de desempleo",
        "start": 1616.16,
        "end": 1623.68
    },
    {
        "text": " puede ser explicada como uno menos la tasa de ocupación sobre la tasa de actividad, lo pasamos",
        "start": 1623.68,
        "end": 1629.8
    },
    {
        "text": " en limpio, ¿sí? Taza de desempleo es uno menos la tasa de ocupación sobre la tasa de actividad,",
        "start": 1629.8,
        "end": 1636.96
    },
    {
        "text": " miren qué coqueta que queda esto, o no, matemática pura, ¿y ustedes acá en ingeniería?",
        "start": 1636.96,
        "end": 1645.44
    },
    {
        "text": " ¿Tarán copados o no? ¿Por qué es matemática esto? Es decir, aparece la ofrtila demanda de trabajo",
        "start": 1645.44,
        "end": 1659.32
    },
    {
        "text": " en la explicación de la tasa de desempleo, miremos la pregunta del práctico, quién la lee?",
        "start": 1659.32,
        "end": 1666.9199999999998
    },
    {
        "text": " ¿Tan y más? Sí, tú, alerla.",
        "start": 1669.24,
        "end": 1672.84
    },
    {
        "text": " En la facultad ingeniería, estamos en el ejercicio 3, ha estado un poco como que perdido, ¿no?",
        "start": 1680.72,
        "end": 1688.3999999999999
    },
    {
        "text": " Ah, está, bien, ejercicio 3 que pregunta la 4, bien, dale arriba, ah, estás con el celular,",
        "start": 1689.3999999999999,
        "end": 1695.4399999999998
    },
    {
        "text": " está más, está, te esté complicando la vida, lee ahí la pregunta el ejercicio 3, la pregunta 4,",
        "start": 1695.4399999999998,
        "end": 1700.72
    },
    {
        "text": " bien fuerte.",
        "start": 1700.72,
        "end": 1701.56
    },
    {
        "text": " ¿Qué les parece?",
        "start": 1710.8799999999999,
        "end": 1712.32
    },
    {
        "text": " Si la demanda permaneció constante en el periodo, esto es no se modificó, ¿qué tasa no se modificó?",
        "start": 1713.32,
        "end": 1721.04
    },
    {
        "text": " Si la demanda repito de trabajo permaneció constante en ese periodo, ¿qué tasa permaneció constante?",
        "start": 1723.1599999999999,
        "end": 1729.6799999999998
    },
    {
        "text": " La de ocupación, por tanto, primera escenario, la tasa de ocupación se mantuvo constante,",
        "start": 1729.6799999999998,
        "end": 1737.76
    },
    {
        "text": " pregunta de viernes a la noche para llevarse de veres, aunque lo muéramos a lo ver ahora,",
        "start": 1737.76,
        "end": 1746.64
    },
    {
        "text": " ¿qué tiene que haber pasado con la oferta de trabajo y miren aquí en señal o qué tiene que",
        "start": 1746.64,
        "end": 1754.12
    },
    {
        "text": " haber pasado con la oferta de trabajo, la tasa de actividad para que la tasa de desempleo allá,",
        "start": 1754.12,
        "end": 1759.2
    },
    {
        "text": " como dice en la letra, creo que subido, aumentó, para que la tasa de desempleo haya aumentado,",
        "start": 1759.92,
        "end": 1768.92
    },
    {
        "text": " ¿qué tiene que haber pasado con la tasa de actividad? Matemáticamente, tiene que haber bajado",
        "start": 1768.92,
        "end": 1776.44
    },
    {
        "text": " la tasa de actividad, mira un cociente, si el numerador permaneció constante y el denominador",
        "start": 1776.44,
        "end": 1782.72
    },
    {
        "text": " cayó, ¿qué pasa con el cociente? Si es un conjunto, si es cada el denominador que pasa con el",
        "start": 1782.72,
        "end": 1788.8400000000001
    },
    {
        "text": " cociente, es más grande, si el cociente creció, uno menos algo que creció, es más chico y tiene",
        "start": 1788.84,
        "end": 1800.24
    },
    {
        "text": " que hacer más grande, por tanto, ¿tabíos lo que estamos diciendo?",
        "start": 1800.24,
        "end": 1805.6399999999999
    },
    {
        "text": " Si el denominador baja, este número crece, el cociente, uno menos algo que creció,",
        "start": 1805.64,
        "end": 1818.88
    },
    {
        "text": " bajo verdad, usted hablando muy gruto, pero por tanto lo que estoy visualizando, lo que estoy",
        "start": 1821.88,
        "end": 1828.5200000000002
    },
    {
        "text": " visualizando, que esto está mal, que para que la tasa de desempleo haya aumentado, la tasa de",
        "start": 1828.52,
        "end": 1836.36
    },
    {
        "text": " actividad tiene que haber subido, vamos a repetirlo, a ver si el denominador sube y el numerador",
        "start": 1836.36,
        "end": 1844.92
    },
    {
        "text": " permanece constante, me permite la expresión, agrandolo de abajo y dejo constante, lo de arriba,",
        "start": 1844.92,
        "end": 1852.6
    },
    {
        "text": " hablando bien bruto, pero ahora si lo entendemos, ¿qué pasa con el cociente en este escenario?",
        "start": 1853.48,
        "end": 1858.36
    },
    {
        "text": " Cáez, si todo el cociente cae, uno menos algo que cayó, es más grande, por lo tanto,",
        "start": 1858.36,
        "end": 1867.56
    },
    {
        "text": " tiene que haber caído la tasa de actividad, sí, ha aumentado, perdón, la tasa de actividad,",
        "start": 1867.56,
        "end": 1873.1599999999999
    },
    {
        "text": " matemáticamente, los que habían dicho lo contrario o tengan dudas, lo toman y de última",
        "start": 1874.1200000000001,
        "end": 1882.28
    },
    {
        "text": " después lo envuelven a mirar en sus casas, económicamente, ya no la matemática, esto de numerador,",
        "start": 1882.28,
        "end": 1889.5600000000002
    },
    {
        "text": " denominador, sino busquemole una explicación económica, olvíense de la ecuación de la matemática",
        "start": 1889.5600000000002,
        "end": 1896.44
    },
    {
        "text": " y pensemos un mercado de trabajo.",
        "start": 1896.44,
        "end": 1898.2
    },
    {
        "text": " No sabemos por qué suba la tasa de actividad, decimos si suba la tasa de actividad y permanece",
        "start": 1903.16,
        "end": 1916.68
    },
    {
        "text": " constante de tasa de ocupación, la tasa de desempleo aumenta, sí, efectivamente.",
        "start": 1916.68,
        "end": 1920.52
    },
    {
        "text": " Bien, vamos por ahí, vamos a buscar un sentido económico, olvíense de la ecuación,",
        "start": 1920.52,
        "end": 1926.3600000000001
    },
    {
        "text": " olvíense de la matemática, saquemol, la que va a ser matemática y pensemos un mercado",
        "start": 1926.3600000000001,
        "end": 1930.68
    },
    {
        "text": " de laboral, donde hay empresas que demandan que contratan, personas que se ofrecen, ¿verdad?",
        "start": 1930.68,
        "end": 1936.8
    },
    {
        "text": " Sí, se contrata lo mismo, la demanda permanece constante, pero hay más gente que se vuelca al",
        "start": 1936.8,
        "end": 1946.16
    },
    {
        "text": " mercado, más gente que se ofrece, esperamos que haya más desocupados, más gente que busca y",
        "start": 1946.16,
        "end": 1953.8400000000001
    },
    {
        "text": " no consigue, me explico, entonces por un lado de la matemática nos permite confirmarlo,",
        "start": 1953.84,
        "end": 1961.6
    },
    {
        "text": " pero además, y es lo más importante un poco lo que nos invita el texto, el práctico,",
        "start": 1961.6,
        "end": 1967.36
    },
    {
        "text": " es, debemos de un sentido económico, que hórico, que se lo podemos encontrar claramente,",
        "start": 1967.36,
        "end": 1972.8799999999999
    },
    {
        "text": " no son incompatibles, no concluyen cosas distintas.",
        "start": 1972.8799999999999,
        "end": 1977.6799999999998
    },
    {
        "text": " Si la demanda permanece constante, olvíense de la ecuación, no mira en la ecuación en",
        "start": 1977.6799999999998,
        "end": 1982.04
    },
    {
        "text": " un mercado, si la demanda permanece constante, pero la oferta aumenta, es probable que si veníamos",
        "start": 1982.04,
        "end": 1987.48
    },
    {
        "text": " de un equilibrio, ahora yo un desequilibrio de qué tipo, más oferta que demanda o no, y si hay",
        "start": 1987.48,
        "end": 1993.12
    },
    {
        "text": " más oferta de gente para trabajar y las empresas no contratan más, es probable que encontremos",
        "start": 1993.12,
        "end": 1998.6
    },
    {
        "text": " desempleo o no.",
        "start": 1998.6,
        "end": 1999.6
    },
    {
        "text": " Bien, perfecto.",
        "start": 1999.6,
        "end": 2002.8
    },
    {
        "text": " Primero escenario que la tasa de ocupación haya permanece constante, que posiblemente explique,",
        "start": 2002.8,
        "end": 2009.92
    },
    {
        "text": " en el caso de aumento de la oferta explique el aumento de la tasa de desempleo, pero",
        "start": 2009.92,
        "end": 2014.76
    },
    {
        "text": " puede aumentar la tasa de desempleo ahora, permaneciendo constante, quién.",
        "start": 2014.76,
        "end": 2021.4
    },
    {
        "text": " La tasa de actividad le puse un igual, ¿verdad?",
        "start": 2021.4,
        "end": 2023.96
    },
    {
        "text": " En el inventé un simbolito ahí, ¿qué debería haber pasado?",
        "start": 2023.96,
        "end": 2028.8400000000001
    },
    {
        "text": " Si la oferta permanece constante para que el desempleo de la tasa de desempleo humente,",
        "start": 2028.8400000000001,
        "end": 2033.8000000000002
    },
    {
        "text": " ¿qué debería pasar con la demanda y, por ende, la tasa de ocupación claramente",
        "start": 2033.8,
        "end": 2040.24
    },
    {
        "text": " de diminuir?",
        "start": 2040.24,
        "end": 2041.24
    },
    {
        "text": " Perdón, que no te dí la palabra de trabajo en la más levantada, pero te damos el mérito.",
        "start": 2041.24,
        "end": 2047.52
    },
    {
        "text": " Tiene que haber diminuido la tasa de ocupación, esto es la demanda.",
        "start": 2047.52,
        "end": 2055.2
    },
    {
        "text": " Nos olvidamos de la ecuación, nos vamos al mercado, decimos haber también, sí, ¿no?",
        "start": 2055.2,
        "end": 2060.04
    },
    {
        "text": " Y se destruyen puestos de trabajo y la gente sigue siendo de la misma, la que se ofrece.",
        "start": 2060.04,
        "end": 2064.96
    },
    {
        "text": " Bueno, hay gente que ahora no va a tener trabajo, por tanto, es decir, va a estar queriendo,",
        "start": 2064.96,
        "end": 2070.04
    },
    {
        "text": " pero no, no encontrando, por tanto, de eso ocupado.",
        "start": 2070.04,
        "end": 2073.44
    },
    {
        "text": " Bueno, la tasa de desempleo aumenta.",
        "start": 2073.44,
        "end": 2075.6
    },
    {
        "text": " Entonces, la pregunta decía, ¿indique qué puede haber sucedido con la oferta y la demanda",
        "start": 2075.6,
        "end": 2080.72
    },
    {
        "text": " de mano de obra?",
        "start": 2080.72,
        "end": 2081.72
    },
    {
        "text": " Y planteamos dos escenarios.",
        "start": 2081.72,
        "end": 2083.72
    },
    {
        "text": " ¿Hay alguno más?",
        "start": 2083.72,
        "end": 2085.12
    },
    {
        "text": " ¿Qué pasa a los dos cosas?",
        "start": 2085.12,
        "end": 2086.7599999999998
    },
    {
        "text": " ¿Qué pasa a los dos cosas?",
        "start": 2086.7599999999998,
        "end": 2087.7599999999998
    },
    {
        "text": " ¿Qué pasa a los dos cosas?",
        "start": 2087.7599999999998,
        "end": 2088.7599999999998
    },
    {
        "text": " ¿Usted o con los dos cosas?",
        "start": 2088.76,
        "end": 2090.76
    },
    {
        "text": " Una oferta.",
        "start": 2090.76,
        "end": 2091.76
    },
    {
        "text": " Usted o con los dos cosas.",
        "start": 2091.76,
        "end": 2093.76
    },
    {
        "text": " ¿De acuerdo?",
        "start": 2093.76,
        "end": 2094.76
    },
    {
        "text": " Claro.",
        "start": 2094.76,
        "end": 2095.76
    },
    {
        "text": " ¿Aungmente la tasa de ocupación?",
        "start": 2095.76,
        "end": 2097.76
    },
    {
        "text": " ¿Tabes?",
        "start": 2097.76,
        "end": 2098.76
    },
    {
        "text": " Pero si aumenta la demanda en este escenario, no, nunca.",
        "start": 2098.76,
        "end": 2109.76
    },
    {
        "text": " Vamos a aumentar la tasa de desempleo.",
        "start": 2109.76,
        "end": 2112.76
    },
    {
        "text": " A ver, si aumenta la demanda de trabajo, nunca va a dar.",
        "start": 2112.76,
        "end": 2118.2000000000003
    },
    {
        "text": " Quiero decir, si aumenta la tasa de empleo, necesariamente la tasa de desempleo va a tener que caer.",
        "start": 2118.2,
        "end": 2125.2
    },
    {
        "text": " Y sí, porque si aumenta la demanda, ¿no?",
        "start": 2125.2,
        "end": 2128.2
    },
    {
        "text": " ¿Y si pasa esto?",
        "start": 2128.2,
        "end": 2132.2
    },
    {
        "text": " No se se entiende el tamaño, ¿no?",
        "start": 2132.2,
        "end": 2137.2
    },
    {
        "text": " El tamaño está haciendo significativo, en este caso,",
        "start": 2137.2,
        "end": 2140.2
    },
    {
        "text": " porque lo que estoy queriendo decir es, aumentó la tasa de empleo,",
        "start": 2140.2,
        "end": 2145.2
    },
    {
        "text": " pero en el mismo periodo una lubión de gente se volcó al mercado de trabajo.",
        "start": 2146.2,
        "end": 2153.2
    },
    {
        "text": " En Uruguay aumenta la creación de puesto de trabajo un 3%",
        "start": 2153.2,
        "end": 2157.2
    },
    {
        "text": " sin embargo, llueve embarcos del extranjero con gente que vino Uruguay a buscar trabajo.",
        "start": 2157.2,
        "end": 2162.2
    },
    {
        "text": " Viene mucha gente, muchas personas que hasta ahora no buscaban trabajo,",
        "start": 2162.2,
        "end": 2167.2
    },
    {
        "text": " formaban parte de la pay, ahora se vuelcan,",
        "start": 2167.2,
        "end": 2170.2
    },
    {
        "text": " a más de casa que ahora dicen, bueno, voy a ponerle trabajar muchos chachos,",
        "start": 2171.2,
        "end": 2175.2
    },
    {
        "text": " que no trabajaban, me voy a ponerle trabajar, se vuelcan,",
        "start": 2175.2,
        "end": 2178.2
    },
    {
        "text": " por el motivo que sea, si aumenta más la oferta que la demanda,",
        "start": 2178.2,
        "end": 2182.2
    },
    {
        "text": " aun aumentando la tasa de desempleo,",
        "start": 2182.2,
        "end": 2185.2
    },
    {
        "text": " sube, ¿verdad?",
        "start": 2191.2,
        "end": 2193.2
    },
    {
        "text": " sube, ¿si?",
        "start": 2193.2,
        "end": 2196.2
    },
    {
        "text": " Bien, ¿tamos a Córdoba?",
        "start": 2196.2,
        "end": 2199.2
    },
    {
        "text": " Estamos haciendo una ensalada, ¿verdad? Pero de todo lo mismo,",
        "start": 2199.2,
        "end": 2205.2
    },
    {
        "text": " porque una vez que entendí, ¿por dónde razonarlo o por la matemática o lo razono por la economía?",
        "start": 2205.2,
        "end": 2213.2
    },
    {
        "text": " Por cualquiera los dos, cierra, ¿si?",
        "start": 2213.2,
        "end": 2216.2
    },
    {
        "text": " Sube más que proporcionalmente a lo que aumentó la tasa de empleo,",
        "start": 2219.2,
        "end": 2223.2
    },
    {
        "text": " aun aumentando la tasa de ocupación, la tasa de desempleo puede aumentar.",
        "start": 2223.2,
        "end": 2228.2
    },
    {
        "text": " Sí, en ese caso, la explicación está en un aumento más que proporcional",
        "start": 2228.2,
        "end": 2234.2
    },
    {
        "text": " en donde, en la oferta de trabajo.",
        "start": 2234.2,
        "end": 2237.2
    },
    {
        "text": " Porque intuitivamente, si yo les preguntaba priori,",
        "start": 2237.2,
        "end": 2240.2
    },
    {
        "text": " gurises, ¿puedes suceder que en un país creándose más puestos,",
        "start": 2240.2,
        "end": 2245.2
    },
    {
        "text": " demandándose más trabajadores, la tasa de desempleo, un mente?",
        "start": 2245.2,
        "end": 2249.2
    },
    {
        "text": " Quizás el sentido como en la primera vez, si no, es imposible,",
        "start": 2249.2,
        "end": 2253.2
    },
    {
        "text": " a ver, la tasa de desempleo cae si aumenta la demanda.",
        "start": 2253.2,
        "end": 2257.2
    },
    {
        "text": " Es lo primero que hubiéramos pensado.",
        "start": 2257.2,
        "end": 2259.2
    },
    {
        "text": " Y es normal, es natural caer en ese error.",
        "start": 2259.2,
        "end": 2263.2
    },
    {
        "text": " Sin embargo, lo que estamos viendo es que es posible que aumenta la tasa de desempleo",
        "start": 2263.2,
        "end": 2269.2
    },
    {
        "text": " aun aumentando la tasa de ocupación.",
        "start": 2269.2,
        "end": 2271.2
    },
    {
        "text": " La explicación está en un aumento más que proporcional en donde,",
        "start": 2271.2,
        "end": 2275.2
    },
    {
        "text": " en la tasa de actividad, en la oferta.",
        "start": 2275.2,
        "end": 2278.2
    },
    {
        "text": " Bien.",
        "start": 2278.2,
        "end": 2280.2
    },
    {
        "text": " Gurises, ejercicio 4.",
        "start": 2283.2,
        "end": 2286.2
    },
    {
        "text": " Me dan datos de la población total, pet, ocupados, desocupados, pea y pei.",
        "start": 2290.2,
        "end": 2295.2
    },
    {
        "text": " Para dos años, año uno y año dos.",
        "start": 2295.2,
        "end": 2299.2
    },
    {
        "text": " Residen empezar el mundo.",
        "start": 2299.2,
        "end": 2301.2
    },
    {
        "text": " ¿Tá?",
        "start": 2301.2,
        "end": 2302.2
    },
    {
        "text": " En qué año estamos y en el dos?",
        "start": 2302.2,
        "end": 2305.2
    },
    {
        "text": " ¿Cuántos tenés?",
        "start": 2306.2,
        "end": 2308.2
    },
    {
        "text": " Y 40, como no me cierra.",
        "start": 2308.2,
        "end": 2311.2
    },
    {
        "text": " Bueno, no, año dos, unidos.",
        "start": 2311.2,
        "end": 2314.2
    },
    {
        "text": " Para el año uno, año dos calcula, tasa de actividad, tasa de desempleo y ya demás me dice que analice la evolución.",
        "start": 2314.2,
        "end": 2322.2
    },
    {
        "text": " A ver, para completar el cuadro, ¿cómo calculamos la pea del año uno?",
        "start": 2322.2,
        "end": 2328.2
    },
    {
        "text": " La pea del año dos, la pea del año uno, la pea del año dos, antes de los cálculos.",
        "start": 2328.2,
        "end": 2333.2
    },
    {
        "text": " ¿Cómo completamos el cuadro?",
        "start": 2334.2,
        "end": 2336.2
    },
    {
        "text": " Bien, el compañero dice la pea del año uno es ocupado, 5.000 más de esos ocupados, 2.000, por tanto, 7.000.",
        "start": 2339.2,
        "end": 2348.2
    },
    {
        "text": " Bien.",
        "start": 2348.2,
        "end": 2349.2
    },
    {
        "text": " Lo mismo para el año dos, ¿verdad?",
        "start": 2349.2,
        "end": 2351.2
    },
    {
        "text": " Bien, lo calcula a ustedes.",
        "start": 2351.2,
        "end": 2353.2
    },
    {
        "text": " Y la pea acá, necesitaría tener, ¿qué categoría forma parte de la pea?",
        "start": 2353.2,
        "end": 2359.2
    },
    {
        "text": " Correcto.",
        "start": 2364.2,
        "end": 2366.2
    },
    {
        "text": " Inactivo pleno y trabajadores ha alentado.",
        "start": 2366.2,
        "end": 2369.2
    },
    {
        "text": " Pero no tiene que ver con lo que estamos haciendo, porque queremos calcular la pea. ¿Cómo calculamos la pea?",
        "start": 2369.2,
        "end": 2376.2
    },
    {
        "text": " Pea menos pea.",
        "start": 2376.2,
        "end": 2378.2
    },
    {
        "text": " Pea menos pea, porque la pea más la pea es la pea. Por lo tanto, pea menos pea es la pea.",
        "start": 2378.2,
        "end": 2387.2
    },
    {
        "text": " Bien, se animan a calcular a ustedes las tasas, digo las diferencias y las tasas y analizar la evolución y qué van a encontrar.",
        "start": 2388.2,
        "end": 2398.2
    },
    {
        "text": " Y esto vamos a la solución ya que la tenemos.",
        "start": 2398.2,
        "end": 2401.2
    },
    {
        "text": " Pues las tasas, el cálculo es esto, digo esto, digo esto, no, para la tiempo.",
        "start": 2401.2,
        "end": 2406.2
    },
    {
        "text": " Y lo que vamos a encontrar es que para el año uno, donde estoy, acá, 87% y 95% la tasa de actividad.",
        "start": 2406.2,
        "end": 2414.2
    },
    {
        "text": " ¿No?",
        "start": 2414.2,
        "end": 2415.2
    },
    {
        "text": " La tasa de ocupación 62 y 75% de la solución.",
        "start": 2416.2,
        "end": 2419.2
    },
    {
        "text": " No, aprovecharles, son números.",
        "start": 2419.2,
        "end": 2422.2
    },
    {
        "text": " Y la tasa de ejemplo 28, 21, por tanto, la tasa de ejemplo bajo, la tasa de ocupación creció y la tasa de actividad creció.",
        "start": 2422.2,
        "end": 2431.2
    },
    {
        "text": " Esto es, aumenta la oferta de trabajo, la tasa de actividad y vimos que se aumenta la tasa de actividad.",
        "start": 2431.2,
        "end": 2440.2
    },
    {
        "text": " Si aumenta la tasa de actividad, la tasa de desempleo.",
        "start": 2441.2,
        "end": 2447.2
    },
    {
        "text": " ¿Quién está diciendo? ¿Por qué escuché de minuye? ¿No?",
        "start": 2454.2,
        "end": 2458.2
    },
    {
        "text": " ¿Repito? Si la tasa de actividad aumenta, que veo que aumentó de 87 a 95%, no aumentó.",
        "start": 2458.2,
        "end": 2468.2
    },
    {
        "text": " Oops, o no.",
        "start": 2469.2,
        "end": 2471.2
    },
    {
        "text": " Bueno, está.",
        "start": 2473.2,
        "end": 2474.2
    },
    {
        "text": " A aumentó.",
        "start": 2474.2,
        "end": 2475.2
    },
    {
        "text": " De 87 a 95%, si la tasa de actividad aumenta, la tasa de desempleo.",
        "start": 2475.2,
        "end": 2483.2
    },
    {
        "text": " Correcto.",
        "start": 2489.2,
        "end": 2490.2
    },
    {
        "text": " No me apuro. Es la opción válida.",
        "start": 2490.2,
        "end": 2494.2
    },
    {
        "text": " Optiona, la tasa de desempleo permanece constante.",
        "start": 2495.2,
        "end": 2499.2
    },
    {
        "text": " Option V, la tasa de desempleo creo que se calcula de otra forma.",
        "start": 2499.2,
        "end": 2506.2
    },
    {
        "text": " Option 3, no me apuro y pienso. ¿Cuál elijo?",
        "start": 2506.2,
        "end": 2511.2
    },
    {
        "text": " No apurarme pensar.",
        "start": 2513.2,
        "end": 2515.2
    },
    {
        "text": " Bueno, ¿por qué? Porque la respuesta correcta está en haber aumentó la tasa de actividad.",
        "start": 2515.2,
        "end": 2521.2
    },
    {
        "text": " ¿Pero qué pasó con la tasa de ocupación? Porque si la tasa de ocupación permaneció constante, y ahora sí,",
        "start": 2522.2,
        "end": 2529.2
    },
    {
        "text": " si permanece constante la tasa de ocupación, esto es la demanda que da aquí tita y la oferta aumenta,",
        "start": 2529.2,
        "end": 2535.2
    },
    {
        "text": " ¿qué deberíamos esperar que suceda con la tasa de desempleo? ¿Qué aumenta?",
        "start": 2535.2,
        "end": 2540.2
    },
    {
        "text": " ¿No? ¿Sí? Pero en este caso lo que vemos que la tasa de ocupación pasó de 62 a 75%.",
        "start": 2541.2,
        "end": 2554.2
    },
    {
        "text": " Diferencialas.",
        "start": 2557.2,
        "end": 2559.2
    },
    {
        "text": " Aumentó más el numerador, que el denominador, por lo tanto el cociente aumentó.",
        "start": 2559.2,
        "end": 2564.2
    },
    {
        "text": " Uno, ¿me lo sabe que aumentó? Claramente en este caso cae.",
        "start": 2565.2,
        "end": 2569.2
    },
    {
        "text": " Y si miró pasó de 28 a 21% la tasa de desempleo. Cayo.",
        "start": 2569.2,
        "end": 2574.2
    },
    {
        "text": " Se ofrece más gente en el mercado, pero se demanda mucho más.",
        "start": 2576.2,
        "end": 2581.2
    },
    {
        "text": " Entonces la tasa de desempleo cae.",
        "start": 2581.2,
        "end": 2584.2
    },
    {
        "text": " ¿Lobran darse cuenta de la lógica de todo esto? Bien.",
        "start": 2584.2,
        "end": 2588.2
    },
    {
        "text": " Bien.",
        "start": 2589.2,
        "end": 2591.2
    },
    {
        "text": " 5, 6, a ver, ¿qué más viene?",
        "start": 2594.2,
        "end": 2600.2
    },
    {
        "text": " Comenten el siguiente fragmento del... ¿Qué le empezamos?",
        "start": 2600.2,
        "end": 2605.2
    },
    {
        "text": " El teórico. ¿A qué le empezamos?",
        "start": 2605.2,
        "end": 2609.2
    },
    {
        "text": " El teórico. ¿Tamos en una hora?",
        "start": 2609.2,
        "end": 2612.2
    },
    {
        "text": " Yo dije más o menos una hora. A principios que 40, pero si es una hora marcó la oral y después cerramos y no vamos a precios.",
        "start": 2613.2,
        "end": 2620.2
    },
    {
        "text": " Bien. ¿Cómo ente el siguiente fragmento del informe de cociuntura del Instituto de Economía?",
        "start": 2620.2,
        "end": 2627.2
    },
    {
        "text": " Cuidado lo confundir con el Instituto de Economía con el Instituto de Nacidad Estadística.",
        "start": 2627.2,
        "end": 2633.2
    },
    {
        "text": " El Instituto de Nacidad Estadística, INE, es un organismo público dependiente de presidencia república",
        "start": 2633.2,
        "end": 2639.2
    },
    {
        "text": " que está encargado de relevarla, de producir las estadísticas económicas.",
        "start": 2639.2,
        "end": 2644.2
    },
    {
        "text": " Para que comenté el dinamismo de la economía también se reflejó en el mercado de trabajo.",
        "start": 2644.2,
        "end": 2649.2
    },
    {
        "text": " Ya que a diferencia de lo sucedido en el 2010, cuando el crecimiento de la tasa de desempleo fue nulo,",
        "start": 2649.2,
        "end": 2656.2
    },
    {
        "text": " los datos disponibles sobre el primer trimestre del 2011 parecerían indicar que se retoma la senda de crecimiento",
        "start": 2656.2,
        "end": 2664.2
    },
    {
        "text": " del empleo registrado hasta el 2009. En efecto, la tasa de empleo creció en dicho periodo 1.3.",
        "start": 2664.2,
        "end": 2674.2
    },
    {
        "text": " En relación al mismo trimestre del 2010 y la oferta de trabajo se incrementó en 0.6.",
        "start": 2674.2,
        "end": 2685.2
    },
    {
        "text": " Lo cual implico que el desempleo descendiera 1.1% de los puntos presentales.",
        "start": 2685.2,
        "end": 2693.2
    },
    {
        "text": " En el mismo periodo se ubicara en 6.3% de la población económicamente activo.",
        "start": 2693.2,
        "end": 2701.2
    },
    {
        "text": " Varios cosas, varios como decir, muchos jugos, puntos presentales, puntos presentales.",
        "start": 2701.2,
        "end": 2716.2
    },
    {
        "text": " Sí, acá no hay consenso de que puntos presentales es PP, un invento de María.",
        "start": 2716.2,
        "end": 2727.2
    },
    {
        "text": " María, dejar de inventarle, podemos escribir después. Me confundís.",
        "start": 2727.2,
        "end": 2733.2
    },
    {
        "text": " Pero muchas cosas para sacarles jugo a este texto, ¿verdad?",
        "start": 2733.2,
        "end": 2736.2
    },
    {
        "text": " ¿Qué es esto último último que la tasa de desempleo se ubicará en 6.3% de la pea?",
        "start": 2736.2,
        "end": 2741.2
    },
    {
        "text": " Bueno, está bien. Está confirmando que la tasa de desempleo se calcula como desempleado sobre pea.",
        "start": 2741.2,
        "end": 2746.2
    },
    {
        "text": " Está correcto. No nos pién que analicemos si está correcto.",
        "start": 2746.2,
        "end": 2751.2
    },
    {
        "text": " Simplemente para sacar jugo, ¿qué quiero decir con esto?",
        "start": 2751.2,
        "end": 2754.2
    },
    {
        "text": " Que ojalá está matéria, aporte para que si usted le en un reporte, por ejemplo,",
        "start": 2754.2,
        "end": 2758.2
    },
    {
        "text": " si entiendan de que está hablando. Y otra cosa que ustedes deberían estar en condiciones",
        "start": 2758.2,
        "end": 2763.2
    },
    {
        "text": " allá de entender, tiene que ver con estos numeritos de uno los puntos presentales.",
        "start": 2763.2,
        "end": 2769.2
    },
    {
        "text": " Yo podría haber puesto en el informe un espacio vacío completar por el alumno.",
        "start": 2769.2,
        "end": 2776.2
    },
    {
        "text": " La parte del medio hacia abajo, en efecto, la tasa de desempleo creció en dicho periodo 1.3, puntos presentales.",
        "start": 2776.2,
        "end": 2786.2
    },
    {
        "text": " En relación a el mismo trimestre del 2010, y la oferta de trabajo que tasa de actividad,",
        "start": 2786.2,
        "end": 2799.2
    },
    {
        "text": " aumentó, se incrementó en 0.6 puntos presentales, lo cual implicó que el desempleo",
        "start": 2799.2,
        "end": 2809.2
    },
    {
        "text": " y ahí aparecería el espacio y ustedes podrían haberlo completado.",
        "start": 2810.2,
        "end": 2815.2
    },
    {
        "text": " Segundo, comentar el siguiente fragmento, tomado a decir una empresa consultora de Internet,",
        "start": 2815.2,
        "end": 2820.2
    },
    {
        "text": " de acuerdo con la información que la obra de Instituto Nacional Estadística,",
        "start": 2820.2,
        "end": 2823.2
    },
    {
        "text": " ahora sí, el mercado laboral durante el 2016, mostró un deterioro que es continuidad",
        "start": 2823.2,
        "end": 2829.2
    },
    {
        "text": " de lo ocurrido en 2015. Por segundo, año consecutivo, cayó el empleo,",
        "start": 2829.2,
        "end": 2834.2
    },
    {
        "text": " trepando la tasa de su ocupación al 7.8% el nivel más alto desde el 2008.",
        "start": 2835.2,
        "end": 2841.2
    },
    {
        "text": " Sin embargo, ese comportamiento no fue homogéneo, ya que el segundo semestre",
        "start": 2841.2,
        "end": 2847.2
    },
    {
        "text": " mostró una moderación de esa tendencia a la baja. En el último año,",
        "start": 2847.2,
        "end": 2852.2
    },
    {
        "text": " está hablando en el 2016, creo. En el último año, la tasa promedio de empleo,",
        "start": 2852.2,
        "end": 2856.2
    },
    {
        "text": " se situó en el 58,5% de la población económicamente activa,",
        "start": 2856.2,
        "end": 2861.2
    },
    {
        "text": " es decir, aquellos mayores de 14 años dispuestos a trabajar.",
        "start": 2861.2,
        "end": 2865.2
    },
    {
        "text": " Si bien, es un dato alineado con la media histórica, se encuentra por debajo",
        "start": 2865.2,
        "end": 2870.2
    },
    {
        "text": " del máximo alcanzado en el 2014. Frente al 2015, en el 2016,",
        "start": 2870.2,
        "end": 2875.2
    },
    {
        "text": " se perdieron aproximadamente 7.500 puestos de trabajo.",
        "start": 2875.2,
        "end": 2879.2
    },
    {
        "text": " En el primer mes del 2017, el mercado de trabajo reflejo nuevamente",
        "start": 2879.2,
        "end": 2884.2
    },
    {
        "text": " un deterioro de sus indicadores respecto de los datos al cierre el año pasado,",
        "start": 2884.2,
        "end": 2888.2
    },
    {
        "text": " a pesar de haber menor cantidad de personas dispuestas a trabajar,",
        "start": 2888.2,
        "end": 2893.2
    },
    {
        "text": " a pesar de haber menor cantidad de personas dispuestas a trabajar,",
        "start": 2893.2,
        "end": 2898.2
    },
    {
        "text": " el desempleo siguió en enero. A pesar de haber menor cantidad de personas dispuestas",
        "start": 2898.2,
        "end": 2905.2
    },
    {
        "text": " a trabajar, a pesar de haber menor que oferta de trabajo,",
        "start": 2905.2,
        "end": 2910.2
    },
    {
        "text": " miemén, bien, a pesar de haber una menor tasa de actividad,",
        "start": 2910.2,
        "end": 2914.2
    },
    {
        "text": " la tasa de desempleo dice que se incrementó en enero cuatro décimas en comparación con el",
        "start": 2914.2,
        "end": 2920.2799999999997
    },
    {
        "text": " mes y el medio de otro anterior y el mismo guarismo relación a enero del 2016 llegando a 8.1%.",
        "start": 2920.2799999999997,
        "end": 2925.6
    },
    {
        "text": " Está bien?",
        "start": 2929.6,
        "end": 2930.4399999999996
    },
    {
        "text": " Digo, nada.",
        "start": 2932.8399999999997,
        "end": 2934.12
    },
    {
        "text": " Comente.",
        "start": 2936.2,
        "end": 2936.8399999999997
    },
    {
        "text": " Luego dice recaved datos para el lugar de tasas específicas de actividad.",
        "start": 2938.2,
        "end": 2941.12
    },
    {
        "text": " Seú sexo para los últimos diez años, claro. Bueno, sexo, no? Acaba el inerreleva para hombres y para mujeres",
        "start": 2942.12,
        "end": 2950.44
    },
    {
        "text": " y nada lo que se puede observar si ustedes quieren advertir, verdad? Que hay diferencia,",
        "start": 2950.44,
        "end": 2957.64
    },
    {
        "text": " una cosa es la tasa a nivel de todo el país, otra cosa es la realidad que suceda a nivel de",
        "start": 2957.64,
        "end": 2961.68
    },
    {
        "text": " hombres y de mujeres. Es probable que no sea la misma y por ende la política pública debería",
        "start": 2961.68,
        "end": 2967.4
    },
    {
        "text": " atacar distintos a problemas distintos.",
        "start": 2967.4,
        "end": 2970.4
    },
    {
        "text": " Si los hombres respecto a mujeres tienen distintos tasas de desempleo es que para unos es mucho",
        "start": 2971.12,
        "end": 2977.0
    },
    {
        "text": " más difícil que los hay trabajo para otros. Por tanto, repito la política pública debería si es",
        "start": 2977.0,
        "end": 2982.6
    },
    {
        "text": " que comparte esto, atacarlos a los que tienen más problemas. Y también yo los invito a que",
        "start": 2982.6,
        "end": 2988.52
    },
    {
        "text": " analicen datos, esto los invito a que entra en internet, ¿verdad? El domingo, el asocio de la mañana,",
        "start": 2988.52,
        "end": 2994.2799999999997
    },
    {
        "text": " preparan un matí, mira mamá, me va a poner a analizar los datos del mercado laboral, ¿verdad?",
        "start": 2995.0,
        "end": 3001.0800000000004
    },
    {
        "text": " ¿Qué hace esa internet a las siete de la mañana? Estoy en la página de línea.",
        "start": 3001.0800000000004,
        "end": 3006.6800000000003
    },
    {
        "text": " Sado de noche, en la watt. Viene ahí, la pareja dice, che, deja el celular, no es que estamos",
        "start": 3009.6800000000003,
        "end": 3016.48
    },
    {
        "text": " danzando, para no me interrumpas, estoy en la página de línea. Bueno, analicen también las tasas",
        "start": 3017.0,
        "end": 3026.76
    },
    {
        "text": " de actividad, pero principalmente la desempleo que repito es la vedette, no en un sentido de",
        "start": 3026.76,
        "end": 3031.84
    },
    {
        "text": " verdad, es de festejo obviamente la vedette porque muestra y desnuda el problema de aquellas",
        "start": 3031.84,
        "end": 3037.88
    },
    {
        "text": " gente que quiere trabajar y no encuentra, analicen también las específicas por región geográfica.",
        "start": 3037.88,
        "end": 3043.64
    },
    {
        "text": " La página web del NEM permite conocer la de todo Uruguay, pero también nos permite conocer",
        "start": 3043.8399999999997,
        "end": 3048.96
    },
    {
        "text": " que está sucediendo en un monte de video respecto a todo el interior. Podemos también visualizar",
        "start": 3048.96,
        "end": 3054.3199999999997
    },
    {
        "text": " y preguntarnos, la realidad de artigas es la misma que de San José, la tasa de desempleo de",
        "start": 3054.3199999999997,
        "end": 3060.12
    },
    {
        "text": " flores, es la misma que la desarrollar, la tasa de desempleo de entienden, capaz que de",
        "start": 3060.12,
        "end": 3065.68
    },
    {
        "text": " dice, che, deja ver mi departamento, ver cómo está, posicionado a nivel todo el país y es",
        "start": 3065.68,
        "end": 3071.12
    },
    {
        "text": " probable, y van a encontrar grandes diferencias en términos de distribución geográfica, de departamentos,",
        "start": 3071.12,
        "end": 3082.12
    },
    {
        "text": " y si se meten a nivel de las tasas de desempleo por tramos de edad, por ejemplo,",
        "start": 3083.4,
        "end": 3090.3599999999997
    },
    {
        "text": " tasa de desempleo para personas jóvenes, verdad, hasta 24 años, de 24 a 30, ahí van a ver",
        "start": 3090.3599999999997,
        "end": 3096.7999999999997
    },
    {
        "text": " los entornos que se presentan, y si todavía cruzan por sexo, van a encontrar, por ejemplo,",
        "start": 3096.8,
        "end": 3104.4
    },
    {
        "text": " que si el Ministerio de Trabajo planteó una política pública de promoción, de facilitar la",
        "start": 3104.4,
        "end": 3109.8
    },
    {
        "text": " contratación de hombres de 40 años, van a decir, pues, esta gente está rada, porque ahí la",
        "start": 3109.8,
        "end": 3114.6000000000004
    },
    {
        "text": " tasa de desempleo, cuánto es 2%? 2, 1, para ese subgrupo de población, en cambio, capaz que",
        "start": 3114.6000000000004,
        "end": 3122.88
    },
    {
        "text": " mujeres jóvenes, la tasa de desempleo es 25%, 30%, en bebancenes, esos números para ver",
        "start": 3122.88,
        "end": 3133.08
    },
    {
        "text": " realidad es muy distintas, no nos quedemos con el dato general de la tasa de desempleo,",
        "start": 3133.08,
        "end": 3138.36
    },
    {
        "text": " la cuánto de la tasa de desempleo uruguay, 7%, ¡ah, estamos barbaros, hay que hacer nada,",
        "start": 3138.36,
        "end": 3145.1600000000003
    },
    {
        "text": " che, murro, no, murro, el Ministerio de Trabajo, nada, nada, no, pero nosotros queremos trabajar,",
        "start": 3145.16,
        "end": 3153.24
    },
    {
        "text": " dice, murro, no, queremos trabajar, no, no, no, nada, estamos barbaros, estamos bien, murro,",
        "start": 3153.24,
        "end": 3160.3199999999997
    },
    {
        "text": " mira que la tasa de desempleo para mujeres jóvenes, 30%, porque un llamado del República que pusiste",
        "start": 3160.3199999999997,
        "end": 3168.8799999999997
    },
    {
        "text": " para todos, ¿por qué no pones un llamado para administrativos y, de últimamente,",
        "start": 3169.88,
        "end": 3175.7200000000003
    },
    {
        "text": " escluyente, mujeres jóvenes menores de 24 años, porque ahí hay un problema de trabajo,",
        "start": 3175.7200000000003,
        "end": 3181.6400000000003
    },
    {
        "text": " ese subgrupo de población es la que está sufriendo los problemas de ecos y trabajo, y no hombres",
        "start": 3181.6400000000003,
        "end": 3187.56
    },
    {
        "text": " de 40, me explico, y así con todos los grupos, pero investiguemos objetivamente dónde está el",
        "start": 3187.56,
        "end": 3194.6400000000003
    },
    {
        "text": " problema, no lo inventemos, investiguemos el real, no lo inventemos, miremos las cifras,",
        "start": 3194.64,
        "end": 3201.3199999999997
    },
    {
        "text": " por eso yo no se invito a hondar a meterse, en los números navegar ahí en esos números y no",
        "start": 3201.3199999999997,
        "end": 3207.7599999999998
    },
    {
        "text": " quedarse con los general, ¿verdad? Vamos a comentar alguna cosa, me da rapita, me da rapita,",
        "start": 3207.7599999999998,
        "end": 3212.48
    },
    {
        "text": " también me voy a aparecer ranto, un incremento de la tasa de actividad necesariamente conduce",
        "start": 3212.48,
        "end": 3217.92
    },
    {
        "text": " un aumento de tasa de desempleo, verdadero falso, si no renuncio ahora mismo, si ahí me dice",
        "start": 3217.92,
        "end": 3229.48
    },
    {
        "text": " verdadero, ¿dónde firmó? No, renuncio, claro, bueno, bien, falso, la tasa específica",
        "start": 3229.48,
        "end": 3238.16
    },
    {
        "text": " de desempleo a las mujeres es un indicador de la contribución de las mujeres a la tasa de desempleo",
        "start": 3238.16,
        "end": 3242.7200000000003
    },
    {
        "text": " de la economía, esto no lo presentamos, el tema de la contribución de la contribución de la",
        "start": 3242.72,
        "end": 3252.04
    },
    {
        "text": " mujer de la tasa de desempleo, de la contribución de los hombres, la tasa de desempleo, no lo presentamos,",
        "start": 3252.04,
        "end": 3256.48
    },
    {
        "text": " así que vamos a bajar la pasada. En Montevideo el año 2010 se benefició un incremento en número",
        "start": 3256.48,
        "end": 3260.9599999999996
    },
    {
        "text": " de estudiantes que trabaja a tiempo parcial, quienes en su totalidad pasaron a interar la población",
        "start": 3260.9599999999996,
        "end": 3268.48
    },
    {
        "text": " de trabajadores con restricciones, esto es su empleada menos de 40 horas humanales.",
        "start": 3268.48,
        "end": 3274.96
    },
    {
        "text": " Un incremento en número de estudiantes que trabaja a tiempo parcial, eso necesariamente",
        "start": 3277.46,
        "end": 3282.2
    },
    {
        "text": " hace aumentar el subempleo, la respuesta es no, porque pueden estar conformes, acuerdan a",
        "start": 3282.2,
        "end": 3289.0
    },
    {
        "text": " que el tema de la conformidad o no, pero acá habrá un paréntesis, respecto a algo que hace un",
        "start": 3289.0,
        "end": 3296.36
    },
    {
        "text": " rato alguien comentó, es cierto que yo dije en clase o no sé si acabo de jueves, no me acuerdo,",
        "start": 3296.36,
        "end": 3304.4
    },
    {
        "text": " alguien que lo comentó hace un rato, medir la satisfacción, por ejemplo de ingresos,",
        "start": 3304.4,
        "end": 3312.2000000000003
    },
    {
        "text": " es algo muy subjetivo, ¿verdad? Y conociendo al uruguayo promedio, como somos los uruguayos,",
        "start": 3312.2000000000003,
        "end": 3317.6
    },
    {
        "text": " es probable que lo primero que me dio un uruguayo medio, estás conforme con lo que cobrás,",
        "start": 3317.6,
        "end": 3321.96
    },
    {
        "text": " ¿qué me va a decir así? Con los ojos cerrados. Primero me hace que no está conforme, aunque",
        "start": 3321.96,
        "end": 3329.88
    },
    {
        "text": " cobre, capaz que cobre 50 mil dólares, ¿no? Porque los uruguayos somos de poner, pero siempre,",
        "start": 3329.88,
        "end": 3335.64
    },
    {
        "text": " estoy generalizando realmente, ¿no? Pero ante esa, ante ese relativismo de la valoración",
        "start": 3337.96,
        "end": 3345.0
    },
    {
        "text": " subjetiva individual y por tanto, claro, si lo medimos por eso el subempleo es 99% en Uruguay o no,",
        "start": 3345.0,
        "end": 3351.56
    },
    {
        "text": " el INE, en términos prácticos, la realidad dice, está bien que teóricamente la categoría subempleo,",
        "start": 3352.92,
        "end": 3363.08
    },
    {
        "text": " la OIT no, sugiere medirla de esta forma como planteábamos con el tema de satisfacción,",
        "start": 3363.08,
        "end": 3369.0
    },
    {
        "text": " sin embargo, yo INE en Uruguay, en la práctica voy a hacer un supuesto, todas las personas que",
        "start": 3369.0,
        "end": 3377.12
    },
    {
        "text": " declaren, trabajar menos de 40 horas semanales, no importa si están conformes o no, las voy a etiquetar",
        "start": 3377.12,
        "end": 3387.64
    },
    {
        "text": " como subempleado, y ustedes irán, Mateo, se me cae unido, lo bueno, sí he cuidado, no confundamos",
        "start": 3387.64,
        "end": 3393.88
    },
    {
        "text": " la teoría y así lo vamos a evaluar respecto a la práctica puntual de simpleidad que encontró",
        "start": 3393.88,
        "end": 3402.44
    },
    {
        "text": " línia para cuantificar el subempleo, dice, todos los que trabajen menos de 40 son subempleados,",
        "start": 3402.44,
        "end": 3407.08
    },
    {
        "text": " no les preguntas sobre una sensación personal, desistir con formelón, está claro, se toma como un",
        "start": 3407.08,
        "end": 3415.84
    },
    {
        "text": " empleo con restricciones a que hay que tener menos de 40, pero cuidado y vuelvo a repetir y",
        "start": 3415.84,
        "end": 3420.56
    },
    {
        "text": " grave en esto último, si estamos en un parcial así y aparece el tema de subempleo, ¿cómo lo",
        "start": 3420.56,
        "end": 3426.2000000000003
    },
    {
        "text": " me dimos? ¿Cómo hicimos el principio? Respecto a la satisfacción, punto, estamos de acuerdo en",
        "start": 3426.2,
        "end": 3434.56
    },
    {
        "text": " esto último, porque puede generar 40, el famoso Fultime o part-time, no, veo que en la",
        "start": 3434.56,
        "end": 3441.58
    },
    {
        "text": " jerga por ahí, la calle se habla de part-time, que es bien, lo desocupado, ocultos, trabajadores",
        "start": 3441.58,
        "end": 3449.3599999999997
    },
    {
        "text": " desalentados, son personas que se encuentran trabajando, pero no realizan aportes a la",
        "start": 3449.3599999999997,
        "end": 3454.3799999999997
    },
    {
        "text": " seguridad social, por lo cual no son captados, perdón, por las estadísticas de empleo. Por",
        "start": 3454.38,
        "end": 3460.58
    },
    {
        "text": " esta razón es que suele afirmarse que la tasa de desempleo subestima el verdadero nivel",
        "start": 3460.58,
        "end": 3467.2200000000003
    },
    {
        "text": " de desempleo en la economía. Los trabajadores desalentados o desocupados ocultos son personas",
        "start": 3467.2200000000003,
        "end": 3474.38
    },
    {
        "text": " que se encuentran trabajando, pero tienen la particularidad de que esta gente trabajadores",
        "start": 3474.38,
        "end": 3479.54
    },
    {
        "text": " desalentados, ¿verdad? No aportan a la seguridad social. ¿Eh? Existe la categoría trabajadores",
        "start": 3479.54,
        "end": 3496.42
    },
    {
        "text": " alentado? Formalmente, ¿así existen? La clasificación que presentamos? Sí, existe.",
        "start": 3496.42,
        "end": 3505.62
    },
    {
        "text": " Que también llamada desempleo culto, verdad no sé si lo comenté, pero también llamada",
        "start": 3506.18,
        "end": 3510.68
    },
    {
        "text": " desempleo culto, te la presento. Bien. Forma parte de que su grupo de población...",
        "start": 3510.68,
        "end": 3518.2999999999997
    },
    {
        "text": " Mira, mira, una polla en serio en el esquema, ¿sí?",
        "start": 3518.2999999999997,
        "end": 3524.22
    },
    {
        "text": " Población económicamente inactiva, por tanto, no son personas que trabajan, aunque se llaman",
        "start": 3524.22,
        "end": 3532.7799999999997
    },
    {
        "text": " trabajadores desalentados, no trabajan. Graven celó. 57% de probabilidad de que cometan",
        "start": 3532.78,
        "end": 3543.3
    },
    {
        "text": " el error en el parcial. Trabajadores salentados, ah, sí, trabajan. No. Y deben ser estos",
        "start": 3543.3,
        "end": 3551.5400000000004
    },
    {
        "text": " que no aportan a la seguridad social, no. Forman parte de la pei, como bien decía el compañero",
        "start": 3551.5400000000004,
        "end": 3556.7400000000002
    },
    {
        "text": " ahí. Por tanto, no trabajan y tampoco buscan, porque tampoco son desocupados. Abandonaron la",
        "start": 3557.74,
        "end": 3569.7
    },
    {
        "text": " búsqueda activa de empleo. Abandonaron la búsqueda, no trabajan, obviamente.",
        "start": 3569.7,
        "end": 3574.8199999999997
    },
    {
        "text": " No, tuviste que haber buscado. La definición operativa de la población de la pea,",
        "start": 3578.8199999999997,
        "end": 3585.62
    },
    {
        "text": " de la población económicamente activa, limita la cobertura de la producción a las actividades",
        "start": 3585.62,
        "end": 3590.7799999999997
    },
    {
        "text": " realizadas dentro de un plazo periodo de referencia a determinado, personas que cumple en un criterio",
        "start": 3590.7799999999997,
        "end": 3597.7799999999997
    },
    {
        "text": " de edad específico. ¿Cómo media? A mí gustó un poquito, quizás le podíamos retocar esta, ¿no?",
        "start": 3597.7799999999997,
        "end": 3606.66
    },
    {
        "text": " Pero a ver, estamos de acuerdo que la pea no es pea por un tema de edad. Espet por un tema de edad",
        "start": 3606.66,
        "end": 3618.06
    },
    {
        "text": " o PNOET. Espea por un tema de voluntad o de trabajo, ¿verdad? Punto. Nos quedamos con",
        "start": 3618.06,
        "end": 3624.7799999999997
    },
    {
        "text": " eso último, ¿no? Porque está un poco confusa, no la lean mucho, como confundo un poco.",
        "start": 3624.7799999999997,
        "end": 3630.42
    },
    {
        "text": " Un miembro empleado de la población económicamente activa es una persona empleada de la pea,",
        "start": 3630.42,
        "end": 3637.42
    },
    {
        "text": " es, en términos generales es una persona que durante el periodo referencia realizada,",
        "start": 3637.42,
        "end": 3641.42
    },
    {
        "text": " realiza una actividad para producir bien esos servicios, incluidos en la definición de producción",
        "start": 3641.42,
        "end": 3645.9
    },
    {
        "text": " económica del sistema de cuentas nacionales. Ni idea que esa sistema de cuentas nacionales",
        "start": 3645.9,
        "end": 3651.14
    },
    {
        "text": " ustedes, punto, no le de embolicio. La definición operativa de población empleada requiere que se indique",
        "start": 3651.14,
        "end": 3659.58
    },
    {
        "text": " el número mínimo de horas que debe haber trabajado una persona durante el periodo referencia",
        "start": 3659.58,
        "end": 3664.9
    },
    {
        "text": " para ser considerado como empleado, como trabajador. ¿Cuál es ese mínimo? Una hora, ¿verdad?",
        "start": 3664.9,
        "end": 3671.46
    },
    {
        "text": " Por lo tanto sí, efectivamente hay un mínimo de horas, si yo trabajé cinco minutos, no.",
        "start": 3671.46,
        "end": 3675.74
    },
    {
        "text": " Hay un estándar de mínimo de horas, sí, efectivamente. En muchos países en desarrollo el desempleo",
        "start": 3675.74,
        "end": 3684.66
    },
    {
        "text": " que se define mediante tres criterios sin trabajo disponible para trabajar y en busca de trabajo.",
        "start": 3684.66,
        "end": 3691.66
    },
    {
        "text": " Entonces, en muchos países en desarrollo el desempleo que se define mediante esos tres criterios",
        "start": 3691.66,
        "end": 3696.5
    },
    {
        "text": " puede no abarcar todos los deseclíricos existentes en el mercado laboral. Una baja tasa de desempleo",
        "start": 3696.5,
        "end": 3702.14
    },
    {
        "text": " general no implica necesariamente que los países o regiones en desarrollo no tengan problemas de empleo.",
        "start": 3702.14,
        "end": 3708.66
    },
    {
        "text": " ¿Qué les parece esto, Dad?",
        "start": 3711.66,
        "end": 3713.66
    },
    {
        "text": " Si nos enteramos, que Huawei tiene una baja tasa de desempleo. Decimos que no hay problemas de empleo,",
        "start": 3715.66,
        "end": 3722.66
    },
    {
        "text": " no es Huawei. Está bien, está bien. Viene por acá la ley el tema.",
        "start": 3722.66,
        "end": 3732.66
    },
    {
        "text": " ¿Está la pueden mirar? Si le miraba, ¿sabes qué? Te sé de la palabra, para mí es un gusto.",
        "start": 3732.66,
        "end": 3738.66
    },
    {
        "text": " Compartir la respuesta contigo, complementarnos. El compañero estaba encarando por el lado de decir",
        "start": 3739.66,
        "end": 3744.66
    },
    {
        "text": " la tasa de desempleo baja, la global, y se puede haber un subgrupo de población quizás un subgrupo",
        "start": 3744.66,
        "end": 3752.66
    },
    {
        "text": " de nivel económico muy bajo que tenga problemas de empleo. Por ejemplo, entonces,",
        "start": 3752.66,
        "end": 3757.66
    },
    {
        "text": " a ver que la tasa de desempleo general sea baja, bueno, habría que ver quiénes son, ¿no?",
        "start": 3757.66,
        "end": 3765.66
    },
    {
        "text": " No está mal, pero la pregunta venía más por el lado de la que la compañera dice.",
        "start": 3765.66,
        "end": 3770.66
    },
    {
        "text": " Hay otros problemas, además del desempleo, hay otros problemas en el mercado de trabajo,",
        "start": 3770.66,
        "end": 3775.66
    },
    {
        "text": " porque no es un síntoma positivo de una economía que crece, que se desarrolla humanamente,",
        "start": 3775.66,
        "end": 3782.66
    },
    {
        "text": " que haya un muy alto aumento, no sí está bien dicho, un alto incremento en la ocupación,",
        "start": 3782.66,
        "end": 3790.66
    },
    {
        "text": " pero sean subocupados, con restricciones, horarias, verdad, con problemas, con insatisfacción.",
        "start": 3790.66,
        "end": 3796.66
    },
    {
        "text": " Estamos, ¿acuerdo? Y después hay un problema que hasta ahora no lo medimos, ¿qué es cuál que aparecía por ahí? ¿Asun rato?",
        "start": 3796.66,
        "end": 3804.66
    },
    {
        "text": " Muy formalmente, el compañero de un trabajo no oficial. ¿Qué sería el trabajo no?",
        "start": 3812.66,
        "end": 3819.66
    },
    {
        "text": " No lo digas, porque no se puede decir, el trabajo informal. La informalidad es un problema.",
        "start": 3819.66,
        "end": 3831.66
    },
    {
        "text": " Es decir, no tener cobertura de seguridad social, no estar registrado en BPS ni en el Ministerio de Trabajo.",
        "start": 3831.66,
        "end": 3841.66
    },
    {
        "text": " Es decir, trabajar sin papeles, cobrar como se dice popularmente en la mano.",
        "start": 3842.66,
        "end": 3848.66
    },
    {
        "text": " Chie, pero no me van a dar un recibo de sueldo, ¿no? Flaco, si bueno estás, ¿no? No estás ni registrado.",
        "start": 3848.66,
        "end": 3853.66
    },
    {
        "text": " Bueno, pero yo digo, ¿no? Si ustedes me he hecho, me indenizan por despido. ¿What?",
        "start": 3853.66,
        "end": 3862.66
    },
    {
        "text": " Si no estoy registrado, ¿no? ¿Verdad? Si estoy informal, no.",
        "start": 3862.66,
        "end": 3865.66
    },
    {
        "text": " Si me enfermo, tengo algún tipo, me puede ir a mi casa y cobro parte del sueldo, ¿verdad?",
        "start": 3866.66,
        "end": 3870.66
    },
    {
        "text": " Tengo derecho a asistirme en una motualista, ¿o? ¿Y si tengo alguna incapacidad ustedes me pagan, ¿no?",
        "start": 3870.66,
        "end": 3876.66
    },
    {
        "text": " ¿VPS? Una pensión, ¿no? Y no, si estoy informal, ¿no?",
        "start": 3876.66,
        "end": 3881.66
    },
    {
        "text": " Y si queda embarazada, bueno, ¿no? Tengo algún tipo de derecho para mientras curse el embarazo o esté amamantando los primeros años, ¿verdad?",
        "start": 3881.66,
        "end": 3893.66
    },
    {
        "text": " ¿O es otro año, verdad dos meses o años, de estar con atender a la criatura, no sé cuánto?",
        "start": 3893.66,
        "end": 3899.66
    },
    {
        "text": " No. Si no estoy registrado, no tengo derechos.",
        "start": 3899.66,
        "end": 3905.66
    },
    {
        "text": " ¿Tamos acuerdo? Por lo tanto, la informalidad es otro problema.",
        "start": 3905.66,
        "end": 3913.66
    },
    {
        "text": " La gente es empleada, la gente sube empleada y los que no tienen cobertura de seguridad social,",
        "start": 3913.66,
        "end": 3919.66
    },
    {
        "text": " que hasta ahora no había categoría que lo cuantificara, porque ocupado no era aquel que estaba en el VPS, ¿no?",
        "start": 3919.66,
        "end": 3930.66
    },
    {
        "text": " Era aquel que dijo que sí a la pregunta de si al menos durante una hora, regresó a actividad remunerada en la última semana y punto.",
        "start": 3930.66,
        "end": 3938.66
    },
    {
        "text": " ¿Se ha hecho una changa, se ha hecho, no? ¿Era ocupado o no?",
        "start": 3938.66,
        "end": 3944.66
    },
    {
        "text": " Eline, crea una categoría denominada empleo precario, empleo precario, empleo con restricción, empleo precario más bien.",
        "start": 3944.66,
        "end": 3962.66
    },
    {
        "text": " ¿Qué no forma parte de aquel esquema que sugiere la OIT para clasificar a la población?",
        "start": 3962.66,
        "end": 3971.66
    },
    {
        "text": " ¿Qué es una categoría aparte? La llama empleo precario, son personas ocupadas, sí son personas ocupadas.",
        "start": 3971.66,
        "end": 3978.66
    },
    {
        "text": " Han trabajando, pero de forma precaria, esto es no son empleos de calidad, es un problema y acá en este caso lo que estamos midiendo es personas que carecen,",
        "start": 3978.66,
        "end": 3989.66
    },
    {
        "text": " porque le vamos a preguntar, ¿usted está registrado en VPS y estos blancos negro o no? ¿Sí o no? ¿No hay? ¿Qué crees que te diga?",
        "start": 3989.66,
        "end": 4000.66
    },
    {
        "text": " ¿Sí o no? ¿A ver, flaco o no? ¿Está registrado? No está registrado, no es muy difícil.",
        "start": 4000.66,
        "end": 4005.66
    },
    {
        "text": " Si estoy perfecto, no sos empleo precario, no tengo seguridad social, perfecto, sos empleo precario para mí.",
        "start": 4005.66,
        "end": 4013.66
    },
    {
        "text": " No pasa nada, es simplemente de enfílices estadísticos porque también quiero conocer ese problema,",
        "start": 4013.66,
        "end": 4017.66
    },
    {
        "text": " porque la precaridad es un problema, el su empleo es un problema y el desempleo es otro problema.",
        "start": 4017.66,
        "end": 4023.66
    },
    {
        "text": " Por tanto, ya te veo la palabra, ¿qué un país tenga tasa de desempleo baja significa que no hay problemas de trabajo?",
        "start": 4023.66,
        "end": 4028.66
    },
    {
        "text": " No, necesariamente, porque puede haber, ¿no? Podemos tener un departamento donde la tasa de desempleo sea muy baja,",
        "start": 4030.66,
        "end": 4037.66
    },
    {
        "text": " sin embargo tener muchísima gente trabajando en la calle. Vendeo de desambulante, ¿no?",
        "start": 4037.66,
        "end": 4045.66
    },
    {
        "text": " No puede estar la tasa de alta valenciada y activa, sin embargo. ¿Cómo? ¿Puedes tener un policía y activa alta y desempleo, o sea?",
        "start": 4045.66,
        "end": 4057.66
    },
    {
        "text": " Bueno, por eso que lo que digo es, está bien, sí, no hay que mirar un número y ser concluyendo,",
        "start": 4057.66,
        "end": 4064.66
    },
    {
        "text": " hay que analizar todos los datos, verdad el conjunto, panear el conjunto de las situaciones.",
        "start": 4064.66,
        "end": 4069.66
    },
    {
        "text": " Entre otros también ver relativamente, ¿no? ¿Cómo están los inactivos respecto a los activos?",
        "start": 4069.66,
        "end": 4074.66
    },
    {
        "text": " Sí hay que ver todo, todo. Hay que analizar en la evolución, hay que analizar también todo,",
        "start": 4074.66,
        "end": 4081.66
    },
    {
        "text": " que está pasando en términos generales. No quedarse con un dato, decir, no, señores, Uruguay,",
        "start": 4081.66,
        "end": 4086.66
    },
    {
        "text": " Uruguay va a terrecors, la tasa de desempleo, la menor, los últimos 15 años tiramos bombos,",
        "start": 4086.66,
        "end": 4093.66
    },
    {
        "text": " tiramos los cuete para arriba, somos los mejores del mundo, los campeones del mundo, para un poco,",
        "start": 4093.66,
        "end": 4099.66
    },
    {
        "text": " porque vengo de Rivera, sí hay mucha gente ocupada, pero todos venden en la calle,",
        "start": 4099.66,
        "end": 4104.66
    },
    {
        "text": " es gente que no tiene seguridad social, por ejemplo me explico, no nos apuremos entonces,",
        "start": 4104.66,
        "end": 4112.66
    },
    {
        "text": " está bien, sí, es importante que la tasa de desempleo va aje, pero para todos los grupos",
        "start": 4112.66,
        "end": 4118.66
    },
    {
        "text": " obtenemos un subgroupo de personas con discapacidad, con una tasa de desempleo de 70%",
        "start": 4119.66,
        "end": 4126.66
    },
    {
        "text": " Ah bueno, pero discapacitos son pocos, bueno, no sé, digo, me explico, no nos apuremos entonces, ¿qué querías comentar que te?",
        "start": 4128.66,
        "end": 4136.66
    },
    {
        "text": " No lo que cobra una parte informal, ¿dónde es el donde es el donde es el formal?",
        "start": 4136.66,
        "end": 4142.66
    },
    {
        "text": " Los que cobran una parte, el famoso te pongo en planilla por la mitad del sueldo,",
        "start": 4143.66,
        "end": 4150.66
    },
    {
        "text": " es esa situación, no está registrado, claro, no es el ideal tampoco, ¿verdad?",
        "start": 4150.66,
        "end": 4159.66
    },
    {
        "text": " para el trabajador, porque el trabajador tiene derecho a estar por el 100% su sueldo,",
        "start": 4159.66,
        "end": 4164.66
    },
    {
        "text": " porque si va el seguro de paro, por ejemplo va a curar la mitad de la mitad,",
        "start": 4164.66,
        "end": 4169.66
    },
    {
        "text": " porque el VPS nos le puede pagar todos, ¿cómo es decir? ¿cómo cobrás 30 mil pesos si va a dar acá figuras por 15?",
        "start": 4170.66,
        "end": 4176.66
    },
    {
        "text": " No, Mundo, ¿cómo es que se llama vos? Mundo, bueno, Mundo, bueno, Mundo, 30,",
        "start": 4176.66,
        "end": 4184.66
    },
    {
        "text": " perdón acá está por 15, a los efectos de esto estás registrado, ¿sí?",
        "start": 4185.66,
        "end": 4191.66
    },
    {
        "text": " Y después ahí lo que no sé si lo hablamos, ¿no?",
        "start": 4191.66,
        "end": 4195.66
    },
    {
        "text": " Y ahora bien fue con el grupo de Marte y Sijueves que nos acuerdo bien, hablamos del delito de la evación fiscal del empleador, ¿no?",
        "start": 4195.66,
        "end": 4206.66
    },
    {
        "text": " Esto lo comentábamos también, ¿no? Es una evación fiscal, digo, ¿por qué es una obligación registrado?",
        "start": 4206.66,
        "end": 4211.66
    },
    {
        "text": " Si lugar a dudas que a veces me podremos sentarnos en una mesa y llamas en el campo analítico,",
        "start": 4211.66,
        "end": 4217.66
    },
    {
        "text": " decir, che, pero viste, sí, yo tengo voluntad de ponerlos por todo, pero si pongo los debo poner por todo,",
        "start": 4218.66,
        "end": 4224.66
    },
    {
        "text": " el sueldo me sale carísimos, no puedo contratar a todos, en vez de 10, tengo contratada 7.",
        "start": 4224.66,
        "end": 4229.66
    },
    {
        "text": " También pasa eso, porque tampoco es un empresario empleador, ¿no? Es un tramillonario que la plata le llueve y puede pagar y pagar todo, ¿no?",
        "start": 4229.66,
        "end": 4237.66
    },
    {
        "text": " A veces es caro, contratar y capaz que en términos subjetivos podemos compartir la opinión de que es caro contratar.",
        "start": 4237.66,
        "end": 4245.66
    },
    {
        "text": " Ahora están en debate y al lunes hay una paralización general del sindicato de la construcción por unas modificaciones en el sabor,",
        "start": 4246.66,
        "end": 4257.66
    },
    {
        "text": " que es yo, se blanquió, no, se publicó y se publica por ahí mucho, lo que tiene que ver con los aportes, los aportes por los trabajadores de la construcción y son muy altos.",
        "start": 4257.66,
        "end": 4268.66
    },
    {
        "text": " ¿Qué quiero decir, grises, si contratamos a trabajadores y lo formalizamos? Es casi el doble que hay que pagar,",
        "start": 4269.66,
        "end": 4277.66
    },
    {
        "text": " porque hay que pagar el sueldo todo y después a veces me explico el doble, por aportes patronales, por el famoso impuesto, el impuesto por contratar.",
        "start": 4277.66,
        "end": 4286.66
    },
    {
        "text": " Y si me preguntás a mí me parece mucho, por eso hay tanto incentivo, muchas veces y no es el ideal, a que haya gente, si se habría social y trabajos así.",
        "start": 4286.66,
        "end": 4297.66
    },
    {
        "text": " Capas que se abaratamos las cosas, la gente dice a ver, a ver por tenerlo registrado cuánto me cuesta, me cuesta algo razonable, no sé si un poco, razonable, pero no el doble.",
        "start": 4298.66,
        "end": 4310.66
    },
    {
        "text": " La informalidad sí, la gente que no tiene que ser una seguridad social, principalmente aunque teoricamente la categoría empleo precaria también recogia,",
        "start": 4316.66,
        "end": 4326.66
    },
    {
        "text": " no sé cuántifica tanto, pero teoricamente recogia situaciones de inestabilidad laboral y empleo familiares no remunirados.",
        "start": 4326.66,
        "end": 4334.66
    },
    {
        "text": " Esto es aquella gente que trabaja con la mamá preparando pasqualinas para vender en el parque de Sabado cuando hay fútbol, le va a ir fútbol.",
        "start": 4334.66,
        "end": 4343.66
    },
    {
        "text": " La persona no cobra un sueldo, pero trabaja, cumple un radio todo, pero no cobra un sueldo porque lo que gana es lo que gana en la familia.",
        "start": 4343.66,
        "end": 4350.66
    },
    {
        "text": " Me explico que hay mucho también, mucho joven, mucha gente, joven, no tan joven, que trabaja con un familiar.",
        "start": 4350.66,
        "end": 4358.66
    },
    {
        "text": " Bien, seguimos.",
        "start": 4358.66,
        "end": 4361.66
    },
    {
        "text": " Los problemas de los países en desarrollo, los países más desarrollados son más complejos de lo que puede reflejar una simple tasa.",
        "start": 4361.66,
        "end": 4369.66
    },
    {
        "text": " Por ese motivo, es necesario contar con estadísticas mejores y más amplias sobre las características económicas a fin de poder examinar detenidamente la situación tanto de la población,",
        "start": 4369.66,
        "end": 4379.66
    },
    {
        "text": " económicamente activa como el resto de la población.",
        "start": 4379.66,
        "end": 4385.66
    },
    {
        "text": " En necesario contar con estadísticas buenas tampoco nos volvamos enfermos del número y contratamos expertos en matemática a tómica porque a ver la tasa de semplio no es 7,8%.",
        "start": 4385.66,
        "end": 4406.66
    },
    {
        "text": " A mí yo estoy usando unos sistemas de cálculo, me da 7,81%",
        "start": 4406.66,
        "end": 4412.66
    },
    {
        "text": " capaz que aquellos amantes de la matemática, está bien, pero a ver, es lo mismo ¿no?",
        "start": 4417.66,
        "end": 4424.66
    },
    {
        "text": " ¿Cuántas personas estamos hablando? 3, bueno, entre millones no es significativo ¿verdad?",
        "start": 4424.66,
        "end": 4431.66
    },
    {
        "text": " Entonces tampoco nos vayamos a el fanatismo por las estadísticas.",
        "start": 4431.66,
        "end": 4436.66
    },
    {
        "text": " Si me da 7,8% y no, y si me investigando baja 7,78% bajo, a ver, ¿qué estamos hablando? Un caso menos.",
        "start": 4436.66,
        "end": 4449.66
    },
    {
        "text": " Hay problemas, pensemos, dediquemos más esfuerzo en solucionarlo y no tanto en medirlo.",
        "start": 4450.66,
        "end": 4455.66
    },
    {
        "text": " No es que no lo quiera medir, no exageremos en la cuantificación, no nos volvamos enfermos de la medición y lo pienso,",
        "start": 4456.66,
        "end": 4465.66
    },
    {
        "text": " lo estoy mirando para el ámbito de las ciencias económicas ¿no?",
        "start": 4465.66,
        "end": 4468.66
    },
    {
        "text": " Uno mira las tesis de grado de economía y pululan las que trabajan con mucha metodología económetrica,",
        "start": 4469.66,
        "end": 4479.66
    },
    {
        "text": " un chocal escuros, no se hemos vuelto calculistas y no hay tesis de planteo de política económica, esto es ¿qué hacer para solucionar el problema de la pobreza?",
        "start": 4479.66,
        "end": 4489.66
    },
    {
        "text": " No hay una tesis, pero hay 80 que la miden, me explico, 90 tesis que miden la tasa de desempleo metodológicamente,",
        "start": 4489.66,
        "end": 4498.66
    },
    {
        "text": " sistemas estadísticos, programas de computación complejos ¿verdad? Conometría, pu-pub-pub, número 7,84,3,2,9%",
        "start": 4498.66,
        "end": 4511.66
    },
    {
        "text": " Estoy pensando en una expresión que es irrepetible porque está filmando la cámara, pero digo no nos volvamos enfermos de las estadísticas y entonces lo único que hacemos es repetir números y números y números y no nos preocupamos del problema.",
        "start": 4512.66,
        "end": 4526.66
    },
    {
        "text": " Me explico, sobrecargamos las oficinas estadísticas llenamos de oficinas estadísticas al Estado, pero no tenemos gente que piense cómo solucionar los problemas.",
        "start": 4527.66,
        "end": 4540.66
    },
    {
        "text": " No estoy siendo claro, no estoy hablando de nada en concreto, estoy hablando de las estadísticas, ha marcado trabajo y las estadísticas en general.",
        "start": 4540.66,
        "end": 4548.66
    },
    {
        "text": " Bien, la categoría de población desempleada comprende a todas las personas mayores de una edad determinada, 14 idiomas nosotros ahorros,",
        "start": 4549.66,
        "end": 4560.66
    },
    {
        "text": " que durante el periodo de referencia opciona, se encontraban sin trabajo, es decir, no tenían un empleo remunerado ni un trabajo por cuenta propio.",
        "start": 4560.66,
        "end": 4572.66
    },
    {
        "text": " Los desempleados son todos aquellos que se encuentran sin trabajo. Opción B, los desempleados son todas las aquellas personas que estaban disponibles para trabajar en ese momento,",
        "start": 4573.66,
        "end": 4587.66
    },
    {
        "text": " ya sean un empleo o un trabajo por cuenta propia. Es decir, soy desempleado si estoy disponible para trabajar.",
        "start": 4587.66,
        "end": 4596.66
    },
    {
        "text": " O soy desempleado si opción C buscan trabajo, es decir, habían tomado medidas concretas en un periodo reciente determinado para buscar un empleo remunerado o un trabajo por cuenta propia.",
        "start": 4596.66,
        "end": 4611.66
    },
    {
        "text": " Voy a hacer un resumen y les voy a preguntar qué les parece cuál es la opción correcta, hay una sola que es correcta.",
        "start": 4612.66,
        "end": 4617.66
    },
    {
        "text": " Desempleados de que junto a los ocupados forman parte de la P, ¿verdad?",
        "start": 4617.66,
        "end": 4623.66
    },
    {
        "text": " Que junto a la P, forman parte de la población de trabajar, dentro de la población total. Bien, desocupados.",
        "start": 4624.66,
        "end": 4629.66
    },
    {
        "text": " Se caracteriza por ser personas que están sin trabajo, por lo tanto si la tasa de desempleo en Uruguay es del 7% decimos que el 7% de las personas mayores de 14 años no tiene trabajo.",
        "start": 4630.66,
        "end": 4644.66
    },
    {
        "text": " Opciona, ¿verdad? Se encuentra sin trabajo.",
        "start": 4645.66,
        "end": 4648.66
    },
    {
        "text": " Otra interpretación opción B, el 7% de las personas mayores de 14 años se encuentra disponible para trabajar.",
        "start": 4649.66,
        "end": 4658.66
    },
    {
        "text": " O 7% de las personas mayores de 14 años buscan trabajos efectivamente en el encuentro.",
        "start": 4660.66,
        "end": 4667.66
    },
    {
        "text": " Creo que mi caripella está mostrando que la opciona es la correcta, ¿verdad? Me vendí.",
        "start": 4668.66,
        "end": 4675.66
    },
    {
        "text": " Ser desempleado implica no tener trabajo.",
        "start": 4676.66,
        "end": 4679.66
    },
    {
        "text": " La opciona, ¿no? Están disponibles, perdón me quiero que yo.",
        "start": 4685.66,
        "end": 4689.66
    },
    {
        "text": " Se han desempleado de ese, estoy disponible. Tengo capacidad de trabajo, sí, puede trabajar si soy desempleado.",
        "start": 4690.66,
        "end": 4696.66
    },
    {
        "text": " Mira, mamá, soy desempleado este. Este cuerpito podría estar haciendo muchas tareas.",
        "start": 4698.66,
        "end": 4706.66
    },
    {
        "text": " Mi cabecita me da con los números, me desenvuelo, no? Tremastre la tabla del 8, la que fue la última que aprendí, ¿verdad?",
        "start": 4707.66,
        "end": 4717.66
    },
    {
        "text": " La del 9% sube uno bajado, otro de eso ya me enseñaron.",
        "start": 4717.66,
        "end": 4720.66
    },
    {
        "text": " 18, 27, 36. ¿Tú es la reglita la aprendí? Estoy disponible para trabajo, soy un desocupado de este país.",
        "start": 4721.66,
        "end": 4730.66
    },
    {
        "text": " Así que si vienen estos elines, decirle que tenés un hijo desocupado porque está disponible para trabajar.",
        "start": 4731.66,
        "end": 4736.66
    },
    {
        "text": " ¿Cómo? ¿Cómo un bajo? ¿Cómo un bajo? ¿Sire un bajo? ¿Está bien ahora o no?",
        "start": 4740.66,
        "end": 4746.66
    },
    {
        "text": " No. Yo pienso que se le gestaba eso. Yo pienso que población desempleada, si desocupado lo mismo.",
        "start": 4748.66,
        "end": 4759.66
    },
    {
        "text": " Claro que si desocupado está dentro de la pea, ¿no? Sí, está bien, entonces está disponible.",
        "start": 4760.66,
        "end": 4769.66
    },
    {
        "text": " ¿No es que un caen trabajo?",
        "start": 4770.66,
        "end": 4773.66
    },
    {
        "text": " Entonces estar disponible, pero no tener voluntad de trabajo implicarían no ser desempleados.",
        "start": 4775.66,
        "end": 4781.66
    },
    {
        "text": " Estar disponible? Sí, puedo trabajar, pero no están ni ahí.",
        "start": 4782.66,
        "end": 4787.66
    },
    {
        "text": " No están ni ahí. Y dentro de la pea estudias no tampoco, porque tampoco están ni ahí.",
        "start": 4788.66,
        "end": 4795.66
    },
    {
        "text": " Soy juguila o menos. ¿Qué soy? Estoy tratando de ir a la categoría del compañero.",
        "start": 4796.66,
        "end": 4803.66
    },
    {
        "text": " Soy el inactivo pleno, ¿verdad? Entonces, entonces lo correcto es decir que la población desempleada tiene que aparecer en un momento esa voluntad de trabajo.",
        "start": 4804.66,
        "end": 4816.66
    },
    {
        "text": " Porque si no, no sería un problema. Porque no trabajar, porque no quiero, no es un problema.",
        "start": 4817.66,
        "end": 4822.66
    },
    {
        "text": " Trabajas alguien hacia el gesto vos, ¿no? ¿Vos hoy mismo te autoreferenciaste? No, no trabaja.",
        "start": 4823.66,
        "end": 4829.66
    },
    {
        "text": " ¿Quieres trabajar? No, Mateo, estoy avanzando los estudios. Barbaro, es un problema para vos. No, si no estás buscando trabajo.",
        "start": 4830.66,
        "end": 4836.66
    },
    {
        "text": " Me explicó. Problema es buscar trabajo ser desempleado como veíamos hoy y no conseguirlo.",
        "start": 4837.66,
        "end": 4843.66
    },
    {
        "text": " Problema es tenerlo y estar ni satisfecho con problemas de horas, verdad, de que trabajo menos la que quisiera, quisiera trabajar más horas y problema es no tener cortura de seguridad social.",
        "start": 4844.66,
        "end": 4856.66
    },
    {
        "text": " Exercicios 7. Analice la tendencia reciente de los principales indicadores del mercado laboral. ¿Y quieren que lo vayó? Ni mamá.",
        "start": 4857.66,
        "end": 4876.66
    },
    {
        "text": " Este lo van a hacer ustedes. Nada, a ver, Ulises, agarren Internet, ponen HTTP, 2 puntos, barra barra, dobleb, dobleb, dobleb, ¿no?",
        "start": 4877.66,
        "end": 4888.66
    },
    {
        "text": " Ine, miren datos del mercado laboral, Chiven, agarrendiarios, miren, embebancen la realidad, tratan de tener un poco el más peo del mercado laboral.",
        "start": 4889.66,
        "end": 4904.66
    },
    {
        "text": " Si alguno quiere también poder compararlo con Brasil, con Argentina, con la región, con Chile, ¿cómo estamos posicionados en América?",
        "start": 4904.66,
        "end": 4911.66
    },
    {
        "text": " La OIT, la oficina de interracional de trabajo, tiene datos del mercado de trabajo para todos los países que interran la comunidad, en Latinoamérica, ¿cómo estamos respecto a Europa? ¿Cómo estamos?",
        "start": 4912.66,
        "end": 4923.66
    },
    {
        "text": " Por ejemplo, respecto a la madre patria que se llama, ¿no? ¿A los españoles? ¿Qué dicen ser la madre? ¿Cómo estamos? ¿Cómo es la tasa de simple y Uruguay respecto a la española? ¿A la francesa?",
        "start": 4923.66,
        "end": 4932.66
    },
    {
        "text": " En bebancen en el mundo de las estadísticas del mercado de trabajo lo van a hacer ustedes, no lo vamos a hacer en clase.",
        "start": 4933.66,
        "end": 4938.66
    },
    {
        "text": " Muchachos, estamos terminando la clase, ahora sí, la clase que viene del día miércoles, vamos a estar metiéndonos en indicadores de precios, particularmente lindice de precios al consumo.",
        "start": 4938.66,
        "end": 4951.66
    },
    {
        "text": " Muchas gracias.",
        "start": 4951.66,
        "end": 4953.66
    }
]