[
    {
        "text": " La clase de hoy vamos a terminar el termina de Tiorna de Jordán por fin.",
        "start": 0.0,
        "end": 5.0
    },
    {
        "text": " Este lleva rato a hacerlo para hacerlo bien.",
        "start": 5.0,
        "end": 9.0
    },
    {
        "text": " Y pues me quedé pensando, probablemente ustedes no hayan visto la demostración de Jordán en Galdos, ¿no?",
        "start": 9.0,
        "end": 14.0
    },
    {
        "text": " Han visto el Tiorema en un siado, pero la demostración no.",
        "start": 14.0,
        "end": 18.0
    },
    {
        "text": " Claro.",
        "start": 18.0,
        "end": 20.0
    },
    {
        "text": " Este lleva mucho tiempo para un curso como Galdos.",
        "start": 20.0,
        "end": 24.0
    },
    {
        "text": " Nosotros lo podemos ofrecer porque estamos justamente dando el tiempo a la matemática y a la aplicación.",
        "start": 25.0,
        "end": 32.0
    },
    {
        "text": " Entonces, pero si no vamos a salir del caso general, porque eso llevaría demasiado tiempo ya.",
        "start": 32.0,
        "end": 39.0
    },
    {
        "text": " Bien, les resumo, estuve bastante tiempo preparando estas clases porque en el libro en particular,",
        "start": 44.0,
        "end": 53.0
    },
    {
        "text": " nuestra referencia, están muy muy escuetos.",
        "start": 53.0,
        "end": 57.0
    },
    {
        "text": " Y para intentar que ustedes no se pierdan y que las clases que más o menos seguibles,",
        "start": 57.0,
        "end": 65.0
    },
    {
        "text": " la verdad que trate de describirlo lo mejor posible, los escribir varias veces y mismo así se que no va a ser la versión más prolija,",
        "start": 65.0,
        "end": 72.0
    },
    {
        "text": " pero en fin, esperemos que al menos en las guanas por algún lado, a no te queda la clase de hoy.",
        "start": 72.0,
        "end": 82.0
    },
    {
        "text": " La clase del viernes, muy bien.",
        "start": 83.0,
        "end": 90.0
    },
    {
        "text": " Entonces, final,",
        "start": 90.0,
        "end": 98.0
    },
    {
        "text": " ahí ya está el título para un chacho perfil, final de Jordán y tuve la clase.",
        "start": 103.0,
        "end": 108.0
    },
    {
        "text": " Bueno, en clases pasadas,",
        "start": 114.0,
        "end": 119.0
    },
    {
        "text": " empiezo el repaso pero más rápido que otra vez porque necesitamos avanzar.",
        "start": 119.0,
        "end": 124.0
    },
    {
        "text": " ¿Cuál es el estado de situación? Tenemos una transformación lineal de BMW, cada un cuerpo al quebrecamente cerrado.",
        "start": 124.0,
        "end": 133.0
    },
    {
        "text": " Esta es una transformación lineal.",
        "start": 133.0,
        "end": 137.0
    },
    {
        "text": " Y bueno, hasta este momento, primero, lo primero que hicimos en el paso 1,",
        "start": 143.0,
        "end": 150.0
    },
    {
        "text": " fue probar que existe, lo hicimos hace 2 clases atrás, un polinomio,",
        "start": 150.0,
        "end": 159.0
    },
    {
        "text": " tal que éste evaluado en la transformación lineal de acero.",
        "start": 159.0,
        "end": 164.0
    },
    {
        "text": " El concepto de evaluar polinomio es la transformación lineal, lo hemos discutido muchas veces y es esencial,",
        "start": 164.0,
        "end": 170.0
    },
    {
        "text": " que es lo que quiere decir, hoy va a aparecer muchas veces también como,",
        "start": 170.0,
        "end": 174.0
    },
    {
        "text": " en particular aprovechando que acá es algeoraiicamente cerrado,",
        "start": 174.0,
        "end": 178.0
    },
    {
        "text": " o sea que tiene todas las raíces de todos los polinomios,",
        "start": 178.0,
        "end": 181.0
    },
    {
        "text": " cualquier polinomio tiene todas sus raíces en este cuerpo, el ceda,",
        "start": 181.0,
        "end": 188.0
    },
    {
        "text": " este polinomio los factorizamos totalmente.",
        "start": 188.0,
        "end": 194.0
    },
    {
        "text": " Se llamamos lambda 1, la primera raíz que aparecía en una vez,",
        "start": 195.0,
        "end": 201.0
    },
    {
        "text": " en el 2 hasta, de menos lambda a ese, a la ns.",
        "start": 201.0,
        "end": 210.0
    },
    {
        "text": " Bien, eso tenemos derecho a hacerlo y bueno, en particular,",
        "start": 210.0,
        "end": 217.0
    },
    {
        "text": " en esta expresión lo dijimos también todas las clases,",
        "start": 217.0,
        "end": 220.0
    },
    {
        "text": " estamos hablando que las raíces, lambda a y lambda a j, son distintas cuando hay intras j,",
        "start": 220.0,
        "end": 226.0
    },
    {
        "text": " la factorización clásica en raíces diferentes.",
        "start": 226.0,
        "end": 231.0
    },
    {
        "text": " Después, nos llevó mucho tiempo, pero lo logramos en la segundo paso de todo este proceso,",
        "start": 231.0,
        "end": 238.0
    },
    {
        "text": " logramos describir, logramos describir al espacio V,",
        "start": 238.0,
        "end": 249.0
    },
    {
        "text": " justamente como suma directa de superpacios,",
        "start": 249.0,
        "end": 261.0
    },
    {
        "text": " todo esto, incluso discutimo bastante, recordamos el concepto de suma directa,",
        "start": 261.0,
        "end": 265.0
    },
    {
        "text": " y en las lambda que aparece, por eso puse el paso 1,",
        "start": 265.0,
        "end": 269.0
    },
    {
        "text": " no solamente para recordarlos, sino para referenciar que estos lambda son exactamente",
        "start": 269.0,
        "end": 273.0
    },
    {
        "text": " los mismos lambda que aparecen en la descripción de V como suma directa de espacios vectoriales.",
        "start": 273.0,
        "end": 278.0
    },
    {
        "text": " Todos estos espacios vectoriales son núcleos, núcleos de diferentes transformaciones diñales,",
        "start": 278.0,
        "end": 283.0
    },
    {
        "text": " son modificaciones de la transformación lineal,",
        "start": 283.0,
        "end": 287.0
    },
    {
        "text": " este F, que le restas en la lambda a 1 por la identidad, lo elevás en la n1,",
        "start": 287.0,
        "end": 292.0
    },
    {
        "text": " la misma expresión que aparecen en ese polinomioseda de arriba.",
        "start": 292.0,
        "end": 298.0
    },
    {
        "text": " La aprovechamos y entonces logramos esta forma nos costó montar para el logramos.",
        "start": 298.0,
        "end": 310.0
    },
    {
        "text": " Esto en particular estaba asociado,",
        "start": 310.0,
        "end": 316.0
    },
    {
        "text": " porque después que les compones V como suma directa de estos espacios vectoriales,",
        "start": 316.0,
        "end": 320.0
    },
    {
        "text": " como la Fiva de BMW, podés preguntarte como queda la FI de BMW,",
        "start": 320.0,
        "end": 324.0
    },
    {
        "text": " y eso lo hicimos también que la FI cuando lo restringías,",
        "start": 324.0,
        "end": 331.0
    },
    {
        "text": " cuando restringías FI a algunos de estos a cualquiera de ellos,",
        "start": 331.0,
        "end": 336.0
    },
    {
        "text": " al que arne el FI menos lambda y por la identidad a la NI,",
        "start": 336.0,
        "end": 342.0
    },
    {
        "text": " eso es lo restringo a unos de estos espacios vectoriales, subesparios vectoriales,",
        "start": 342.0,
        "end": 348.0
    },
    {
        "text": " bueno si lo restringías, el dominio es él, es esa restricción,",
        "start": 348.0,
        "end": 352.0
    },
    {
        "text": " que arne el FI menos lambda y por la identidad a la NI,",
        "start": 352.0,
        "end": 360.0
    },
    {
        "text": " y juntos vimos alguna pausa de 2 segundos que el codominio eso lo vimos",
        "start": 360.0,
        "end": 366.0
    },
    {
        "text": " y hay que probarlo, no venía gratis, que el codominio era exactamente el mismo,",
        "start": 366.0,
        "end": 371.0
    },
    {
        "text": " ísimos la cuentita y resultaba, teníamos la enorme suerte de que la FI restrixta",
        "start": 372.0,
        "end": 381.0
    },
    {
        "text": " a cada uno de estos subesparios iba a parar al mismo subespario,",
        "start": 381.0,
        "end": 386.0
    },
    {
        "text": " eso era todo eso era justamente a propósito que se lo grababa la construcción de llorra,",
        "start": 386.0,
        "end": 392.0
    },
    {
        "text": " y entonces de esta forma con este comportamiento de lo que resultaba",
        "start": 392.0,
        "end": 398.0
    },
    {
        "text": " es que FI se escribía como suma directa, vamos a poner y uno más FI2 más FI-S,",
        "start": 398.0,
        "end": 408.0
    },
    {
        "text": " si a cada una de estas las llamamos FI, lo pongo acá a muchos chachos,",
        "start": 408.0,
        "end": 413.0
    },
    {
        "text": " en este momento, lo dijimos en la clase pasada también, pero para el repaso",
        "start": 413.0,
        "end": 417.0
    },
    {
        "text": " la que va de ísimos subesparios, el ísimo subesparios lo llamamos FI,",
        "start": 417.0,
        "end": 424.0
    },
    {
        "text": " y entonces FI tenía la forma de la suma directa también,",
        "start": 425.0,
        "end": 429.0
    },
    {
        "text": " que vamos a repasar para que quede bien grabado, lo dijimos también la última clase,",
        "start": 429.0,
        "end": 434.0
    },
    {
        "text": " pero esta expresión queda muy grabada cuando la ves como matriz,",
        "start": 434.0,
        "end": 439.0
    },
    {
        "text": " o bueno lo aquí mismo, cuando la ves así que queda más grabada todavía,",
        "start": 439.0,
        "end": 446.0
    },
    {
        "text": " la expresión, acá FI1, FI2,",
        "start": 446.0,
        "end": 451.0
    },
    {
        "text": " acá FI-S, bueno en el resto vanceros, queda muy explícito,",
        "start": 454.0,
        "end": 467.0
    },
    {
        "text": " lo que se estuvamos a poner acá a puntos subpensivos,",
        "start": 467.0,
        "end": 470.0
    },
    {
        "text": " en el sentido de que hay un montón más en el medio,",
        "start": 470.0,
        "end": 474.0
    },
    {
        "text": " lo que está diciendo es cada uno su cuadrado, bien, cuadrado, cuadrado,",
        "start": 474.0,
        "end": 479.0
    },
    {
        "text": " cada uno su cuadrado, bueno esto es así, cada uno juega su cuadrado,",
        "start": 479.0,
        "end": 483.0
    },
    {
        "text": " FI2 juega en el cuadradito, debe suir y en B.",
        "start": 483.0,
        "end": 486.0
    },
    {
        "text": " Se la acuerdan el tolemagre llorra, en el cada vez que escuchen esa canción,",
        "start": 486.0,
        "end": 490.0
    },
    {
        "text": " si tienen hermanos, chicos, sobrinos, la fiesta de fin de año,",
        "start": 490.0,
        "end": 495.0
    },
    {
        "text": " ese es el teorema de llorra, en cada uno su cuadrado, la próxima,",
        "start": 495.0,
        "end": 498.0
    },
    {
        "text": " vamos a poner en el loop en fin, en el medio,",
        "start": 498.0,
        "end": 501.0
    },
    {
        "text": " ditamos y ponemos la canción cada uno su cuadrado, ¿qué les parece?",
        "start": 501.0,
        "end": 505.0
    },
    {
        "text": " No se olviden más, eso es lo que dice el teorema llorra.",
        "start": 505.0,
        "end": 509.0
    },
    {
        "text": " Después, ahora lo que nos vamos a dedicar en la parte 3,",
        "start": 510.0,
        "end": 515.0
    },
    {
        "text": " que se ha ido adelantando, por supuesto, la clase pasada,",
        "start": 515.0,
        "end": 519.0
    },
    {
        "text": " es describir cada una de estas chiquitas,",
        "start": 519.0,
        "end": 522.0
    },
    {
        "text": " porque ahora, o usted va a quedar, como siempre menciona el compañero acá adelante,",
        "start": 522.0,
        "end": 528.0
    },
    {
        "text": " es, ahí te quedaste con el valor propio, constante,",
        "start": 528.0,
        "end": 532.0
    },
    {
        "text": " en cada una de estas, el valor propio constate,",
        "start": 532.0,
        "end": 535.0
    },
    {
        "text": " cambia la cosa mucho más fácil,",
        "start": 535.0,
        "end": 538.0
    },
    {
        "text": " y entonces, ahí nos vamos a meter con el análisis de la parte de nil potencia",
        "start": 538.0,
        "end": 544.0
    },
    {
        "text": " que venimos insistiendo con ese concepto, jugando bastante con ese concepto,",
        "start": 544.0,
        "end": 548.0
    },
    {
        "text": " de nil potencia, porque ahora parece esa situación.",
        "start": 548.0,
        "end": 553.0
    },
    {
        "text": " Bueno, pero ya logramos que la matriz quede completamente llena de cero por todos lados,",
        "start": 555.0,
        "end": 561.0
    },
    {
        "text": " ojo, estos bloques pueden ser grandes, ¿no?",
        "start": 561.0,
        "end": 564.0
    },
    {
        "text": " estos cuadrados pueden ser grandes, si la matriz es mil por mil,",
        "start": 564.0,
        "end": 568.0
    },
    {
        "text": " si ustedes van a programar y van a jugar con cosas, van a tener matriz muy grandes,",
        "start": 568.0,
        "end": 573.0
    },
    {
        "text": " estos bloques van a ser grandes también, pero bueno, definitiva,",
        "start": 573.0,
        "end": 577.0
    },
    {
        "text": " lo lograste primero esa semi diagonalización,",
        "start": 577.0,
        "end": 581.0
    },
    {
        "text": " porque estos son bloques en terro, ¿no?",
        "start": 581.0,
        "end": 584.0
    },
    {
        "text": " Bueno, bien,",
        "start": 584.0,
        "end": 587.0
    },
    {
        "text": " ahora en los que nos toca es analizar esta parte,",
        "start": 587.0,
        "end": 597.0
    },
    {
        "text": " lo pongo en rojo, esto es lo que nos queda analizar cada uno de los bloques,",
        "start": 597.0,
        "end": 604.0
    },
    {
        "text": " y cada uno de los bloques tiene esa información, ¿no?",
        "start": 604.0,
        "end": 610.0
    },
    {
        "text": " y para analizar estas justamente para ver que estas fisuy como se comportan,",
        "start": 610.0,
        "end": 620.0
    },
    {
        "text": " veamos lo siguiente, paso intermedio antes de empezar con 3,",
        "start": 620.0,
        "end": 624.0
    },
    {
        "text": " pero muy cortito para que entiendan el paso 3,",
        "start": 624.0,
        "end": 627.0
    },
    {
        "text": " el 3 ya lo dijimos, la clase pasada y el anterior,",
        "start": 627.0,
        "end": 630.0
    },
    {
        "text": " que es analizar como las matriz de Jordan de transformaciones nil potentes, ¿accuerdan?",
        "start": 630.0,
        "end": 636.0
    },
    {
        "text": " Bueno, muy bien, de transformaciones nil potentes, ¿vindos dónde está lo?",
        "start": 636.0,
        "end": 640.0
    },
    {
        "text": " La transformación nil potente, eso es lo que quiero que visueles en conmigo,",
        "start": 640.0,
        "end": 643.0
    },
    {
        "text": " la fisuy en realidad es la propia fis, restricta a este espacio victorial,",
        "start": 643.0,
        "end": 649.0
    },
    {
        "text": " pero veamos, si vos tenés una transformación,",
        "start": 649.0,
        "end": 655.0
    },
    {
        "text": " vamos a cambiarles nombre, un paso intermedio, ¿sí?",
        "start": 655.0,
        "end": 658.0
    },
    {
        "text": " ¿Vos tenés una transformación? ¿Cómo le sea medio para explicar?",
        "start": 658.0,
        "end": 665.0
    },
    {
        "text": " Bueno, importa, quiero usar la misma notación que puso, ¿no me acuerdo?",
        "start": 665.0,
        "end": 676.0
    },
    {
        "text": " ¿No se está en import? Supongamos que vos tenés una transformación t,",
        "start": 676.0,
        "end": 683.0
    },
    {
        "text": " que va a de b en b, entonces vuelve a encontrar una base y tener la matriz asociate,",
        "start": 683.0,
        "end": 695.0
    },
    {
        "text": " por otro lado, y yo tomo t, menos lambda por la identidad,",
        "start": 695.0,
        "end": 700.0
    },
    {
        "text": " ponerle que esto me da, entonces la matriz de Jordan, en base b de t, ¿sí?",
        "start": 700.0,
        "end": 710.0
    },
    {
        "text": " Entonces, si yo tomo t, menos lambda por la identidad, en esa base b,",
        "start": 711.0,
        "end": 719.0
    },
    {
        "text": " lo que vamos a obtener es la matriz en de Jordan, de t, menos lambda por la identidad,",
        "start": 719.0,
        "end": 728.0
    },
    {
        "text": " porque la onda digamos, si vos te quedo en la matriz de Jordan,",
        "start": 728.0,
        "end": 734.0
    },
    {
        "text": " con toda su forma, ¿no? Le restas lambda por la identidad y te quedas una matriz de Jordan también.",
        "start": 735.0,
        "end": 741.0
    },
    {
        "text": " Incluso si lambda eso no es el valor propio, ni importa eso,",
        "start": 741.0,
        "end": 747.0
    },
    {
        "text": " lo único que te cambia es el valor que se encuentra, ¿se acuerdan como en la?",
        "start": 747.0,
        "end": 750.0
    },
    {
        "text": " Los que estoy diciendo es súper básico, no se complejicen con,",
        "start": 750.0,
        "end": 755.0
    },
    {
        "text": " ¿a qué estas? ¿se acuerdan como en las matricias de Jordan?",
        "start": 755.0,
        "end": 759.0
    },
    {
        "text": " Miremos los bloques, ponamos alpha, eran alpha y uno, ¿se acuerdan?",
        "start": 760.0,
        "end": 771.0
    },
    {
        "text": " Y uno, ¿se deduce y se deduce? Si vuelve restas lambda por la identidad,",
        "start": 771.0,
        "end": 777.0
    },
    {
        "text": " te queda alpha, menos lambda, alpha, menos lambda, ¿sabra?",
        "start": 777.0,
        "end": 782.0
    },
    {
        "text": " No debería estar ya porque te quedo, entonces ahora te quedo, ¿té, menos lambda?",
        "start": 783.0,
        "end": 789.0
    },
    {
        "text": " ¿Por qué? Porque hay que dar familia lambda, no hay ninguna broma ahí, ¿no?",
        "start": 789.0,
        "end": 796.0
    },
    {
        "text": " O sea, lo que quiero decir es encontrar la matriz de Jordan de t,",
        "start": 796.0,
        "end": 802.0
    },
    {
        "text": " o matriz de Jordan de cualquiera esta la misma, ¿por qué?",
        "start": 802.0,
        "end": 804.0
    },
    {
        "text": " ¿por qué pueden le sumas o le restas en lambda por la identidad?",
        "start": 804.0,
        "end": 808.0
    },
    {
        "text": " Si esto está claro lo borro, porque entonces ya saben lo que voy a hacer,",
        "start": 809.0,
        "end": 814.0
    },
    {
        "text": " en vez de mirar fí, ¿qué voy a mirar? Fí menos lambda por la identidad,",
        "start": 814.0,
        "end": 820.0
    },
    {
        "text": " ¿qué es el fímino? Acá, y la que voy a encontrar es la matriz de Jordan de fímino,",
        "start": 820.0,
        "end": 825.0
    },
    {
        "text": " es lambda por la identidad, y si encuentro esa después,",
        "start": 825.0,
        "end": 828.0
    },
    {
        "text": " después de por qué le encontraste, les dejo su marlanda,",
        "start": 828.0,
        "end": 830.0
    },
    {
        "text": " y entonces ya encontré la matriz de Jordan de la original de la fí,",
        "start": 830.0,
        "end": 834.0
    },
    {
        "text": " ¿te dan cuenta? Eso es lo único que vamos a hacer, y dicho eso, ¿por qué voy a trabajar con fímino",
        "start": 834.0,
        "end": 841.0
    },
    {
        "text": " es lambda y no con fí? Paso tres, voy a trabajar con fímino es lambda por la identidad,",
        "start": 841.0,
        "end": 851.0
    },
    {
        "text": " ¿qué va a ir? Acá, por una vez más, pongo todo este chiringbol o restricto al quermel,",
        "start": 851.0,
        "end": 862.0
    },
    {
        "text": " y después ya no le pongo más, porque si no es mucho chiringbol o acabajo,",
        "start": 862.0,
        "end": 865.0
    },
    {
        "text": " ya se sabe que estamos restringiendo, restricto al quermel de fímino es lambda,",
        "start": 865.0,
        "end": 874.0
    },
    {
        "text": " acá sería lambda y, ¿no? Menos lambda y por la identidad a la ni,",
        "start": 874.0,
        "end": 880.0
    },
    {
        "text": " ¿qué va desde el quermel de fímino es lambda y por la identidad a la ni?",
        "start": 880.0,
        "end": 889.0
    },
    {
        "text": " Y antes de escribir el codomiño, visualicen conmigo, terminando de copiar antes de escribir el codomiño.",
        "start": 889.0,
        "end": 904.0
    },
    {
        "text": " Si esta la fí, va a des, olvíaste todo este nombre, de WB, si se llama WB,",
        "start": 904.0,
        "end": 911.0
    },
    {
        "text": " de WB, la lambda por la identidad a donde va, WB en, ¿no?",
        "start": 911.0,
        "end": 916.0
    },
    {
        "text": " Y es la F, porque es lambda por la identidad, WB, entonces la resta o la suma va a WB,",
        "start": 916.0,
        "end": 921.0
    },
    {
        "text": " tengo derecho a poner el mismo codomiño, ¿se va a en cuenta? Vieron que el con cuidado,",
        "start": 921.0,
        "end": 926.0
    },
    {
        "text": " si una iba, le WB y la lambda por la identidad también, entonces no se les pongo nada,",
        "start": 926.0,
        "end": 931.0
    },
    {
        "text": " la resta va, ¿no?",
        "start": 931.0,
        "end": 940.0
    },
    {
        "text": " Bueno, bien, y ahora viene la pregunta clave a ver si entendimos,",
        "start": 940.0,
        "end": 945.0
    },
    {
        "text": " ahora vamos a hacer tu en la análisis, cuenta, el dibujito que adelantamos en la clase pasada,",
        "start": 945.0,
        "end": 952.0
    },
    {
        "text": " pero antes que eso, ¿por qué prefiero trabajar con fímino es lambda y y no con fí?",
        "start": 952.0,
        "end": 961.0
    },
    {
        "text": " En ese domino.",
        "start": 961.0,
        "end": 969.0
    },
    {
        "text": " Exactamente, porque esta es esta y te queda ni el potente, de hecho,",
        "start": 969.0,
        "end": 976.0
    },
    {
        "text": " en vez de este chirimolo, vamos a escribir así, vamos a escribir Mu,",
        "start": 976.0,
        "end": 982.0
    },
    {
        "text": " lo que vamos a analizar es Mu del kernel, de Mu a la M,",
        "start": 982.0,
        "end": 990.0
    },
    {
        "text": " en el kernel de Mu a la M, ¿sabes? ¿Quién es Mu todo esto?",
        "start": 990.0,
        "end": 997.0
    },
    {
        "text": " ¿Quién es M sería el N suí, que es el rol de cada uno de estas potencias?",
        "start": 997.0,
        "end": 1004.0
    },
    {
        "text": " Y entonces veamos, esto es mi potente, si o no, yo lo que digo es que esta Mu del kernel de Mu a la M,",
        "start": 1004.0,
        "end": 1012.0
    },
    {
        "text": " el kernel de Mu, yo que digo es que Mu a la M es 0, ¿por qué?",
        "start": 1012.0,
        "end": 1019.0
    },
    {
        "text": " Cuando vas a tomar un V acá, si V pertenece al kernel, al dominio, de Mu a la M,",
        "start": 1019.0,
        "end": 1029.0
    },
    {
        "text": " entonces vamos a poner así, pues, pues, entonces Mu a la M de V,",
        "start": 1029.0,
        "end": 1043.0
    },
    {
        "text": " bueno, por definiciones 0, ¿por qué están el kernel?",
        "start": 1043.0,
        "end": 1050.0
    },
    {
        "text": " Y esto es para todo V, vamos al cuantificador para todo, para que quede bien claro,",
        "start": 1050.0,
        "end": 1056.0
    },
    {
        "text": " para todo V del dominio, quiere decir que esta Mu es el potente,",
        "start": 1056.0,
        "end": 1065.0
    },
    {
        "text": " es mi potente de índice M. ¿Quién está ejemplificando Mu?",
        "start": 1065.0,
        "end": 1077.0
    },
    {
        "text": " Lo digo una vez más, por si nos perdimos, Mu es, en vez de escribir F,",
        "start": 1077.0,
        "end": 1082.0
    },
    {
        "text": " menos lambda I a la identidad, le llamamos Mu, en vez de escribir,",
        "start": 1082.0,
        "end": 1088.0
    },
    {
        "text": " kernel de, bueno, kernel de todo esto que queda Mu y en vez de escribir N, I,",
        "start": 1089.0,
        "end": 1094.0
    },
    {
        "text": " le pongo M, que sirve por cualquiera de los N, I, N1, N12, N, E,",
        "start": 1094.0,
        "end": 1100.0
    },
    {
        "text": " y lo analizamos todos a la vez, claro, ese es el objetivo,",
        "start": 1100.0,
        "end": 1105.0
    },
    {
        "text": " analizar ahora cada uno de estos bloques y ver cómo aparece la descripción de su orda",
        "start": 1105.0,
        "end": 1114.0
    },
    {
        "text": " en cada uno de estos bloques. Vamos bien, acá está el gran truco,",
        "start": 1114.0,
        "end": 1126.0
    },
    {
        "text": " esta Mu es el potente, cada una es el potente, describimos esa y después les llamamos",
        "start": 1126.0,
        "end": 1133.0
    },
    {
        "text": " lambda por la identidad y ya está, bien, ¿cuál es el objetivo?",
        "start": 1133.0,
        "end": 1141.0
    },
    {
        "text": " Ya lo adelanto, vamos a probar que la matriz, que vamos a encontrar una base de sorda",
        "start": 1141.0,
        "end": 1151.0
    },
    {
        "text": " para Mu, B, base de sorda, ese es el objetivo para Mu,",
        "start": 1151.0,
        "end": 1161.0
    },
    {
        "text": " de tal manera que la matriz en base B, justamente va a tener la forma Jm1 0,",
        "start": 1162.0,
        "end": 1172.0
    },
    {
        "text": " JmT, 0 para algunos naturales. Vamos a recordar, vamos a recordar,",
        "start": 1173.0,
        "end": 1190.0
    },
    {
        "text": " yo escribo pero quiero que nadie quede perdido, los que están acá,",
        "start": 1190.0,
        "end": 1194.0
    },
    {
        "text": " lo que están atrás de la pantalla, todo esto lo dijimos pero vamos a recordar,",
        "start": 1194.0,
        "end": 1200.0
    },
    {
        "text": " primero, los M1, M2, Mt, Mn, M, M hasta Mt son todos naturales, mayor y igual que 1,",
        "start": 1201.0,
        "end": 1209.0
    },
    {
        "text": " o sea si quieren le ponemos, si algunos gustan ponerle cero en los naturales,",
        "start": 1209.0,
        "end": 1214.0
    },
    {
        "text": " no es el caso, lo sacamos. Entonces primero pregunta, pero profe, ¿todos",
        "start": 1214.0,
        "end": 1219.0
    },
    {
        "text": " es todos los valores propios onceros? Sí, ¿del anal potente? Sí, del anal potente,",
        "start": 1219.0,
        "end": 1227.0
    },
    {
        "text": " los valores propios onceros, el tema es que cuando reconstruyas la FI,",
        "start": 1227.0,
        "end": 1232.0
    },
    {
        "text": " cuando hagamos la reconstrucción de cada bloque, el cero se cambia por lambda 1,",
        "start": 1232.0,
        "end": 1238.0
    },
    {
        "text": " el cero se cambia por lambda 2, ojo lambda 1 o lambda 2 puede ser cero también,",
        "start": 1238.0,
        "end": 1243.0
    },
    {
        "text": " no? Algunos de ellos, se cambia porque el cero tiene que sumar en la diagonal,",
        "start": 1243.0,
        "end": 1248.0
    },
    {
        "text": " a la hora de reconstruir de pasar de esta a FI solita,",
        "start": 1248.0,
        "end": 1253.0
    },
    {
        "text": " de tener que volver a sumar lambda, ¿no? ¿no? ¿no? Laanda ahí, ¿qué otra cosa",
        "start": 1253.0,
        "end": 1257.0
    },
    {
        "text": " una puede dudar ahí? Y los M1 que eran ahí profe, el tamaño,",
        "start": 1257.0,
        "end": 1262.0
    },
    {
        "text": " el tamaño son las matrices de sorda, del tamaño M1 por M1, cero en la diagonal",
        "start": 1262.0,
        "end": 1267.0
    },
    {
        "text": " y uno en la diagonal superior o, si prefieren, y están los acostumbrados",
        "start": 1267.0,
        "end": 1272.0
    },
    {
        "text": " en la diagonal inferior, ¿cómo quiere? Y otra pregunta más surge de acá,",
        "start": 1272.0,
        "end": 1276.0
    },
    {
        "text": " ¿y está bueno que anoten estas cosas?",
        "start": 1276.0,
        "end": 1280.0
    },
    {
        "text": " Profes, ¿y usted encuentra una base B para la primera?",
        "start": 1280.0,
        "end": 1286.0
    },
    {
        "text": " O sea, porque muy gusta jugando el rol de la primera, laanda 1,",
        "start": 1286.0,
        "end": 1290.0
    },
    {
        "text": " para FI, menos laanda 1, otra base para FI, menos laanda 2,",
        "start": 1290.0,
        "end": 1294.0
    },
    {
        "text": " otra base para FI, menos laanda 3, y después ¿qué hace profe? ¿cómo hace para",
        "start": 1294.0,
        "end": 1299.0
    },
    {
        "text": " organizar todas esas bases? La pregunta la hice mal por gusto,",
        "start": 1299.0,
        "end": 1306.0
    },
    {
        "text": " para evaluarlos un poquito, ¿en cuento una base de sorda para la primera?",
        "start": 1306.0,
        "end": 1312.0
    },
    {
        "text": " ¿en cuento una base de sorda para la segunda? ¿y después?",
        "start": 1312.0,
        "end": 1318.0
    },
    {
        "text": " La igual, ¿no? ¿un momento que te va a dar con el dolor o no va a dar más?",
        "start": 1318.0,
        "end": 1323.0
    },
    {
        "text": " ¿pero qué pasa con esas bases? Pero vamos a tardar una para la primera,",
        "start": 1323.0,
        "end": 1326.0
    },
    {
        "text": " la abril encontró otra para la segunda y después ¿cómo hacemos?",
        "start": 1326.0,
        "end": 1330.0
    },
    {
        "text": " ¿y pues camila? ¿eh? ¿la sumin?",
        "start": 1331.0,
        "end": 1335.0
    },
    {
        "text": " ¿porque son bases en espacios distintos que suma directa de estos espacios te da todo?",
        "start": 1335.0,
        "end": 1340.0
    },
    {
        "text": " ¿base para la primera? Una B de sorda para el primer bloque.",
        "start": 1340.0,
        "end": 1345.0
    },
    {
        "text": " Barbaro, metiste una B de sorda para la segunda bloque.",
        "start": 1345.0,
        "end": 1349.0
    },
    {
        "text": " Barbaro, ¿los vas pegando? Porque el comportamiento de ese mundo separado.",
        "start": 1349.0,
        "end": 1354.0
    },
    {
        "text": " Cada uno es su cuadrado, entonces ahí está, ¿sierto?",
        "start": 1354.0,
        "end": 1359.0
    },
    {
        "text": " Las bases que vos encuentres, las uniz y te quedan una base de quién.",
        "start": 1359.0,
        "end": 1364.0
    },
    {
        "text": " ¿del ve? ¿que lo claro?",
        "start": 1364.0,
        "end": 1367.0
    },
    {
        "text": " ¿tenemos armado el camino? Parece una papa. Ahora hay un montón de cuentas para hacer para lograr esto.",
        "start": 1367.0,
        "end": 1372.0
    },
    {
        "text": " ¿si? ¿no hay que dar claro que ven los que son?",
        "start": 1372.0,
        "end": 1375.0
    },
    {
        "text": " ¿seguen los cuales vamos a llamar para la un sí, o la primera?",
        "start": 1375.0,
        "end": 1378.0
    },
    {
        "text": " Sí, pero este sí a la vez puede tener diferentes tamaños.",
        "start": 1378.0,
        "end": 1383.0
    },
    {
        "text": " O sea, quiero decir, los bloquees se oran estos, acá, no sé si se ve bien, es un ateno.",
        "start": 1384.0,
        "end": 1392.0
    },
    {
        "text": " Este puede ser, voy a poner dos, no más, este igual dos, podría ser que esto sea la descripción de FI1",
        "start": 1392.0,
        "end": 1407.0
    },
    {
        "text": " que tenga dos pedazos a la vez, se parte a la vez en pedazos, cada vez más chicos",
        "start": 1407.0,
        "end": 1414.0
    },
    {
        "text": " y uno se da a poner en M1 por M1, acá es FI, entonces sale sumo el landa 1.",
        "start": 1414.0,
        "end": 1427.0
    },
    {
        "text": " O sea, esto misma pero con el landa 1.",
        "start": 1427.0,
        "end": 1431.0
    },
    {
        "text": " 1, 1, 0 y acá puede ser más chiquito el cuadrado, M2 por M2 porque hicimos dos bloquees nada más para el dibujo",
        "start": 1431.0,
        "end": 1444.0
    },
    {
        "text": " y acá el landa 1 de vuelta porque estoy recostruciendo el primero, el primer FI1,",
        "start": 1444.0,
        "end": 1451.0
    },
    {
        "text": " pero con un bloque más chiquito, los tamaños de los bloquees pueden ser más chicos, o sea puede haber un gran de uno más chicos",
        "start": 1451.0,
        "end": 1462.0
    },
    {
        "text": " Exactamente, y acá, acá, para que se empiezan a acordar, eso tenía que ver, legal dos, con el carácterístico y con el animal",
        "start": 1462.0,
        "end": 1474.0
    },
    {
        "text": " ahí daba una información de distintas, sí, ¿se sería un bloque de S1 y de S1?",
        "start": 1474.0,
        "end": 1483.0
    },
    {
        "text": " Sí, este sería un bloque de S1 y de S1, ¿se sería otro?",
        "start": 1483.0,
        "end": 1485.0
    },
    {
        "text": " No, para cada valor propio a la vez te pueden hacer, te pueden aparecer varios bloquees, exactamente",
        "start": 1485.0,
        "end": 1494.0
    },
    {
        "text": " Ahora, como tal vez que ¿cuánto que lo voy a hacer en S1?",
        "start": 1494.0,
        "end": 1506.0
    },
    {
        "text": " Ahí está un tema, bueno, ahora vamos a analizar cómo aparece en M1 y Mt, eso va a aparecer de todas las cuentas, ¿quién es N1 y Mt?",
        "start": 1506.0,
        "end": 1517.0
    },
    {
        "text": " También va a aparecer, por ejemplo, porque ahí alguien se puede preguntar, pero usted ha armado una base y lo encontró así,",
        "start": 1518.0,
        "end": 1531.0
    },
    {
        "text": " yo armé otra base, me cuando yo disquinto, no, vamos a mostrar que la base existe, pero pueden ser distintas las bases,",
        "start": 1531.0,
        "end": 1538.0
    },
    {
        "text": " vamos a mostrar que no importa la base que escojas, las formas la misma, todas esas cosas van a ir apareciendo en la clase,",
        "start": 1538.0,
        "end": 1547.0
    },
    {
        "text": " espero que terminemos la clase, pero no quiero apurar, porque estas dudas que están planteando ustedes son esenciales,",
        "start": 1547.0,
        "end": 1553.0
    },
    {
        "text": " es sentamente ahí, es que el truco, entender bien esto. ¿Se supone que N1 es la forma de S1, ¿no?",
        "start": 1553.0,
        "end": 1561.0
    },
    {
        "text": " No, F1, estoy séndose la forma de S1, entonces lo primero que hice es separez, podríamos hablar mal cambiando la terminología, según valor propio,",
        "start": 1561.0,
        "end": 1575.0
    },
    {
        "text": " ojo, y ojo que estoy hablando mal, porque esto no son valores propios todavía, ¿por qué no son valores propios todavía?",
        "start": 1575.0,
        "end": 1582.0
    },
    {
        "text": " ¿Por qué estos tipos vinieron desde S1, no del polínimo carácteríctico? ¿Y S1, quien te digo que tiene lo valor de propios de... ¿se acuerdan eso?",
        "start": 1582.0,
        "end": 1590.0
    },
    {
        "text": " Lo de pasa es que es el camino de construcción, y así lo logramos de ser mar, capaz que algunos de esto ni aparece,",
        "start": 1590.0,
        "end": 1598.0
    },
    {
        "text": " porque realmente sabemos que lo que aparece son los valores propios, a algunos de estos van a ser valores propios,",
        "start": 1598.0,
        "end": 1605.0
    },
    {
        "text": " pero capaz que no los S, ¿por qué esto de dónde vinieron? Por eso puse esta parte acá, este no era el carácteríctico,",
        "start": 1605.0,
        "end": 1612.0
    },
    {
        "text": " porque si no nos podés ni... recién después del S1, vamos a poder demostrar que el carácteríctico anula la F1,",
        "start": 1612.0,
        "end": 1623.0
    },
    {
        "text": " que lo hicimos en un ejercicio en el diagonalizable, que qué que me impasó, en el caso de diagonalizable, pero en general lo hicimos,",
        "start": 1623.0,
        "end": 1630.0
    },
    {
        "text": " bueno, recién ahí vas a poder decir, acá hay otro que anula la F1, el carácteríctico, y después vamos a definir el minimal, que anula la F1,",
        "start": 1630.0,
        "end": 1639.0
    },
    {
        "text": " bueno pero tiempo al tiempo, entonces en el camino de construcción apareció esta descripción, muchos de esto cuando logre la forma de llorar en final ni esta,",
        "start": 1639.0,
        "end": 1651.0
    },
    {
        "text": " y de hecho cuando logre la forma, por ejemplo, poner que el F1 está, porque el anda uno realmente va a lo propio,",
        "start": 1651.0,
        "end": 1658.0
    },
    {
        "text": " así puede aparecer bloque grandes, bloque chico, uno de dos por dos, uno de tres por tres y uno de dos por dos,",
        "start": 1658.0,
        "end": 1666.0
    },
    {
        "text": " poner, bien, todas estas dudas eran esenciales, así que está muy bien que las pregunten, y que haga los ejercicios que yo puse en el prático de reconstrucción de forma de llorar,",
        "start": 1666.0,
        "end": 1681.0
    },
    {
        "text": " o también que recuerden en el Galdos, algunos ejercicios, que vayan a Galdos para recordar, bueno muy bien, estamos con este objetivo, nos quedó claro el objetivo, ahora cuantas y cuentas para lograr ver esto,",
        "start": 1681.0,
        "end": 1698.0
    },
    {
        "text": " pero esa cuenta es la estrategia de ordenar para que nadie se me pierda.",
        "start": 1698.0,
        "end": 1703.0
    },
    {
        "text": " Muy muy bien, entonces, un poco lo que tenía acá escrito era cómo, después de esto se recontruye esto, su mandolela,",
        "start": 1712.0,
        "end": 1732.0
    },
    {
        "text": " pero un poco surgió en la discusión, así que no lo voy a repetir, ¿no? Entonces, cuál es el objetivo, el punto 3, es mi olvido ya de la forma tan complicada de escribir y le voy a llamar mu,",
        "start": 1732.0,
        "end": 1744.0
    },
    {
        "text": " y voy a tratar de analizar cuál es la forma de sordan de una ni el potente, porque sabemos que después les sumamos la anda por la identidad y encontramos la forma de sordan de todas estas pequeñas transformaciones fisubis,",
        "start": 1744.0,
        "end": 1757.0
    },
    {
        "text": " en las que digeregué se paré la transformación ni al general, bueno, ahora sí voy a borrar esto pues ya sabemos para dónde vamos.",
        "start": 1757.0,
        "end": 1768.0
    },
    {
        "text": " Entonces, el objetivo es construir una base de sordan, esta escrito ya, construir una base de sordan para mu, de bnb, me olvido de, si quieres le llamamos de doble bn, doble bn,",
        "start": 1788.0,
        "end": 1809.0
    },
    {
        "text": " de bnb, una transformación lineal ni el potente de indice m, le llamamos doble b para minimizar notaciones, ¿no?",
        "start": 1809.0,
        "end": 1837.0
    },
    {
        "text": " Entonces, tenemos este dibujo lo hicimos el otro día, tenemos un doble b, lo hicimos con b, ¿no? ¿verdad?",
        "start": 1837.0,
        "end": 1842.0
    },
    {
        "text": " Didad prácticamente es un error, lo notamos cuando terminó la clase, creo que vino qué, bien fue o algún compañero y me dijo pero profe,",
        "start": 1842.0,
        "end": 1851.0
    },
    {
        "text": " discutimos sobre el dibujo que voy a hacer nuevamente hoy, que el dibujo estaba bien pero didácticamente les amé b, b, b, le puse los mismos nombres y la b y la b, original,",
        "start": 1851.0,
        "end": 1863.0
    },
    {
        "text": " hay que cuidarla, ese objetivo final, pero la que es una transformación lineal ni potente son cada uno estos pedacitos chiquititos, que no es ni b, ni b, ni b, ¿no?",
        "start": 1863.0,
        "end": 1876.0
    },
    {
        "text": " Surgen de b, b, b, y b, entonces, el didácticamente se le llamé b, b, b, y b, el dibujo y no está bien, o sea, tenemos un doble b, el dibujo de tu simila que se pasa, tenemos, incluso creo que hizo una arrozita en el dibujo que lo vamos a revelar,",
        "start": 1876.0,
        "end": 1892.0
    },
    {
        "text": " tenemos, mude b, la imagen, recuerden que mude b, no es otra cosa que le imagen de m, el recorrido, tenemos,",
        "start": 1892.0,
        "end": 1909.0
    },
    {
        "text": " este, mude cuadrado de b, mude cuadrado de b, es la imagen de m, cuadrado, o sea, la imagen de m, cuesta como, cada uno de estos espacios es más chico, ¿por qué?",
        "start": 1909.0,
        "end": 1932.0
    },
    {
        "text": " ¿por qué? Porque si alguien está en la imagen de m, cuadrado, está en la imagen de m, porque el último es mude alguien, ¿no?",
        "start": 1932.0,
        "end": 1942.0
    },
    {
        "text": " Ya pueden en la imagen de m, el cubo, etcétera, pero voy a poner unos puntos suspensivos acá, como diciendo bueno, sigo para adelante, y entonces, se cego, vamos a poner así, se entienda, y cego hasta la imagen de m, a la m, menos 1 de m,",
        "start": 1942.0,
        "end": 1967.0
    },
    {
        "text": " 1 de W, y el último lo pongo el rojo, acá, ¿qué es? O, porque el vector nulo está en la imagen de todo el mundo, de todas las transformaciones iniguales, o sea,",
        "start": 1967.0,
        "end": 1984.0
    },
    {
        "text": " de hacer m, de W, y eso puedo poner m, o sea, como, como, como, como, como, como, como, como, como, como, como, como, toda la vez que quiera, ¿tabien? Y eso es lo que voy haciendo,",
        "start": 1984.0,
        "end": 1994.0
    },
    {
        "text": " yo digo que este es el último paso, el rojo, y está bien, porque m, a la m, de W es 0, porque es el potente, ¿no? Entonces, cuando llegas a m, a la m, de W, W es todo el espacio editorial, ¿no?",
        "start": 1994.0,
        "end": 2012.0
    },
    {
        "text": " No estoy tomando un vector, la imagen de todo el espacio editorial, esto es el vector nulo, ¿por qué? Porque el potente.",
        "start": 2012.0,
        "end": 2022.0
    },
    {
        "text": " Bueno, y el otro que dibujamos en la clase pasada, y que le vamos a reacer hoy, es el núcleo de m, como un imagen que cruzaba a todos estos espacios, ¿no?",
        "start": 2022.0,
        "end": 2036.0
    },
    {
        "text": " Lo voy a hacer mal, y después no lo copien, la primera instancia, agarra el otro color, no lo copien, y después lo voy a hacer bien,",
        "start": 2036.0,
        "end": 2046.0
    },
    {
        "text": " porque la clase pasada hicimos en el rocito, lo voy a hacer igual que la clase pasada y después lo corregimos.",
        "start": 2046.0,
        "end": 2051.0
    },
    {
        "text": " Fíjese así, como es, un subespacio, en principio, podría cortar a todos, acá está el piano, está claro que tiene que tener el núcleo, siempre el núcleo está en el piano, ¿no?",
        "start": 2051.0,
        "end": 2066.0
    },
    {
        "text": " Y puede cortar a todo, pero hay una cosa malen, ese dibujo, a ver si alguien se da cuenta,",
        "start": 2066.0,
        "end": 2074.0
    },
    {
        "text": " si se los, la hago una pequeña ayuda, hay alguien que tiene que estar adentro del azul,",
        "start": 2074.0,
        "end": 2090.0
    },
    {
        "text": " hay alguien, hay una cosa ahí que tiene que estar adentro del azul, en el azul están todos los vectores que si le aplicas mu, dancero, ¿sí?",
        "start": 2090.0,
        "end": 2109.0
    },
    {
        "text": " ¿Es exactamente, ¿por qué? Porque después de mu, si le aplicas mu, una vez más, que te da el nulo, entonces toda esta zona negra, la última imagen, no nula, tiene que estar adentro del que armel,",
        "start": 2110.0,
        "end": 2129.0
    },
    {
        "text": " justamente, o sea, ahora sí va a quedar bien, lo pueden compiar, el que armel tiene que incluir a toda esta zona,",
        "start": 2130.0,
        "end": 2142.0
    },
    {
        "text": " puede haber más cosas, pero esa zona tiene que estar adentro, porque si le aplicas mu, una vez más que te da, ¿si ha cero? entonces está todo dentro del núcleo, ¿sabien?",
        "start": 2142.0,
        "end": 2152.0
    },
    {
        "text": " ¿sabien? Son dibujitos, pero por lo menos adámolo que queden bien, bueno, ¿cuál es la idea? Ahora, les voy a tratar de usar todos los colores,",
        "start": 2152.0,
        "end": 2173.0
    },
    {
        "text": " la idea chicos, es esta, voy a armar una base del kernel, la idea es construir una base del kernel, yo voy a escribir por acá, capaz que borro de pisar un derecho, o sea, lo habrán copiado seguramente, tenemos claro el objetivo,",
        "start": 2173.0,
        "end": 2197.0
    },
    {
        "text": " entonces la idea es, bueno esta secuencia, este WB, incluye a FI, WB, incluye, FI, no, Mu,",
        "start": 2203.0,
        "end": 2225.0
    },
    {
        "text": " incluye a Mu, del WB, incluye a Mu cuadrado, del WB, Mu a la M, menos 1, del WB, y ya al final solo es, solita el Vecta Nue, ¿sabien?",
        "start": 2225.0,
        "end": 2251.0
    },
    {
        "text": " Este objetivo intermedio es ahora crear una base del kernel de Mu, de azul, escribanlo por favor, objetivo, vamos a armar una base del kernel de Mu, que nos va a ayudar por supuesto. Ahora bien, hay dos ejercicios que ya están en el para el práctico 3 pendientes, de Mu,",
        "start": 2251.0,
        "end": 2274.0
    },
    {
        "text": " el próximo objetivo es encontrar una base del kernel de mu, lo vamos a construir de a poquito, hay dos ejercicios que también armé el práctico 3, pero ya quedaron escritos para ir al práctico 3, uno es este, el que aparece en este momento, probar que si Mu es ni el potente, esas inclusiones que están ahí, no lo vamos a usar esto que voy a decir, pero me gusta como ejercicio, son todas estrictas, ¿sabien?",
        "start": 2274.0,
        "end": 2301.0
    },
    {
        "text": " probar que si Mu es el potente de índice M, todas las inclusiones son estrictas, eso va a aparecer como primer ejercicio del práctico 3, ¿sabien?",
        "start": 2305.0,
        "end": 2318.0
    },
    {
        "text": " Bien, repito, ahora no lo vamos a usar lo que sean estrictas, pero les quería comentar como que sur que se ejercicio, ¿sabien?",
        "start": 2318.0,
        "end": 2326.0
    },
    {
        "text": " No pueden ser ya, no vaya ya a ver como se va a hacer así, ¿sabien?",
        "start": 2327.0,
        "end": 2334.0
    },
    {
        "text": " ¿sí no lo fuera que?",
        "start": 2334.0,
        "end": 2336.0
    },
    {
        "text": " No pueden exactamente bajar el duceo, ponenle que acá",
        "start": 2336.0,
        "end": 2340.0
    },
    {
        "text": " Si, eso es lo que hay que hacer, justamente esa idea es que si hubiera un caso que te diera ponenle acá igual, bueno probar que después no puede seguir creciendo hasta cero, exactamente, es algo así, la idea de dejar esto, exactamente, ¿sabien?",
        "start": 2340.0,
        "end": 2365.0
    },
    {
        "text": " Pero bueno eso quedó como ejercicio, ¿sabien?",
        "start": 2366.0,
        "end": 2369.0
    },
    {
        "text": " Lo que vamos a hacer, gurise de sexto, miren acá, si quieren lo dibujan también, voy a empezar a escribir una base del carna, el primero voy a tomar una base cita, cuando vos tenés espacios vectoriales, si los cortas,",
        "start": 2369.0,
        "end": 2384.0
    },
    {
        "text": " bueno, la interacción de espacios vectoriales es una espacios vectorial, todos los que están acá son espacios vectoriales, ¿no verdad?",
        "start": 2384.0,
        "end": 2390.0
    },
    {
        "text": " Porque este es la imagen de mus, una espacios vectorial, la imagen de mucompo esta como, es un subespacio vectorial, son todos su espacios vectoriales, ¿no verdad?",
        "start": 2390.0,
        "end": 2399.0
    },
    {
        "text": " Entonces, yo voy a agarrar una base cita de este espacios vectorial, ¿de quién es este?",
        "start": 2399.0,
        "end": 2406.0
    },
    {
        "text": " Este, este, el de mua la m-1 de la brv, que está dentro del azul, ahora yo tengo aquí este está incluido en el, bueno, cada vez más grande, ¿no?",
        "start": 2406.0,
        "end": 2420.0
    },
    {
        "text": " Esa cadena es inclusión cada vez más grande, entonces voy a agarrar una base cita de esta parte dentro del carna, ¿no?",
        "start": 2420.0,
        "end": 2430.0
    },
    {
        "text": " Si quieren la podemos escribir en otro colazo.",
        "start": 2430.0,
        "end": 2435.0
    },
    {
        "text": " ¿Qué hice? Bueno, en la anterior y más grande, entonces extiéndola base, esta base, esto también lo sabemos de galuno ¿no?",
        "start": 2443.0,
        "end": 2453.0
    },
    {
        "text": " Si vos tenés, miren este y este, este y este, ¿no? Pero en realidad lo que estamos mirando se las escribó acá para que quede bien claro, corto todo con el carna de mu, entonces te queda",
        "start": 2453.0,
        "end": 2468.0
    },
    {
        "text": " WB, cortado con el carna de mu, que esto es el carna de mu claro, mu de WB, cortado con el carna de mu, mua el cuadrado, el WB, cortado con el carna de mu",
        "start": 2468.0,
        "end": 2490.0
    },
    {
        "text": " Mu a la M menos 1, el WB, cortado con el carna de mu y cero, corte a todos con el lo que hicimos acá en el dibujo, todos cortados con el azul",
        "start": 2490.0,
        "end": 2509.0
    },
    {
        "text": " Si quieren el más, el carna de mu, podríamos ponerlo todos en azul para que se vean bien quiénes son.",
        "start": 2509.0,
        "end": 2514.0
    },
    {
        "text": " Y entonces que haces, voy a arrasar una base acá, una base de este espacio de literaria, esa es esta que está acá en la hierna.",
        "start": 2515.0,
        "end": 2526.0
    },
    {
        "text": " La extiéndola cuando pase el siguiente paso le pongo la extiéndola para tener una base del siguiente paso.",
        "start": 2526.0,
        "end": 2536.0
    },
    {
        "text": " Sigo avanzando y cada vez que crezco que paso a un espacio de literaria en un poco más grande, entonces acá la extiéndola",
        "start": 2537.0,
        "end": 2549.0
    },
    {
        "text": " y después le pongo los vectores que faltan para tener un espacio para tener una base más grande.",
        "start": 2550.0,
        "end": 2556.0
    },
    {
        "text": " Por acá, más o menos ese naranja donde es es mu de WB, por acá esto y ya no.",
        "start": 2556.0,
        "end": 2562.0
    },
    {
        "text": " Y el verde en realidad, si hacemos corresponder dibujo con lo que está escrito en el pizarrón, el verde estaría por acá, se tiene esta parte.",
        "start": 2562.0,
        "end": 2574.0
    },
    {
        "text": " Y finalmente el último paso la extiéndola acá.",
        "start": 2575.0,
        "end": 2583.0
    },
    {
        "text": " ¿Cierto?",
        "start": 2583.0,
        "end": 2586.0
    },
    {
        "text": " Toma una base, la voy estendiendo, la voy estendiendo, la voy estendiendo hasta llegar al carna, ese va a ser el truco.",
        "start": 2589.0,
        "end": 2597.0
    },
    {
        "text": " Toma una base y la agregar los vectores, la agregar vectores hasta.",
        "start": 2597.0,
        "end": 2602.0
    },
    {
        "text": " Porque nosotros sabemos que si vos tenés un conjun, Dios, una base en un sub espacio más grande es un conjunto leí y todos los conjuntos leí se pueden extender a una base del espacio más grande.",
        "start": 2603.0,
        "end": 2616.0
    },
    {
        "text": " La completa, tengo una base del espacio grande, el propio oro que hago.",
        "start": 2616.0,
        "end": 2619.0
    },
    {
        "text": " Este es un leí de este que es más grande, esto se completala.",
        "start": 2619.0,
        "end": 2624.0
    },
    {
        "text": " Y este que es el leí en este completa de la base, se dan cuenta, el truco de completar junto a el leí hasta formar una base cada uno en su espacio.",
        "start": 2625.0,
        "end": 2636.0
    },
    {
        "text": " Bien, ahora viene el tema de ponerles nombre, ¿no?",
        "start": 2636.0,
        "end": 2641.0
    },
    {
        "text": " Para ahorrar notación de vuelta, a este, vamos a llamarlo a este corte, lo vamos a llamar WM-1, a este corte WB-2, WB-1 y WB-0, al intercision.",
        "start": 2642.0,
        "end": 2670.0
    },
    {
        "text": " Claro, WB-0 es todo el que armelona, es el caso grande.",
        "start": 2671.0,
        "end": 2676.0
    },
    {
        "text": " Y todos los demás se lo llaman así para que sea más chiquito, una más describida.",
        "start": 2676.0,
        "end": 2680.0
    },
    {
        "text": " Entonces lo que dijimos es, empezad con una base acá, esa base lo vamos a llamar, es su M-1,",
        "start": 2680.0,
        "end": 2690.0
    },
    {
        "text": " es su M-1, N-1, esta sería una base de WB-1, esta es esta.",
        "start": 2690.0,
        "end": 2704.0
    },
    {
        "text": " Lépo, por si no se ve bien para la cámara o si no usted no lo ve bien.",
        "start": 2705.0,
        "end": 2713.0
    },
    {
        "text": " Tiene el doble sub índice cada vectorcito y empiezan M-1-1, el primero, M-1 porque estoy en el lugar M-1.",
        "start": 2713.0,
        "end": 2724.0
    },
    {
        "text": " Y el último es su M-1 y el segundo sub índice N-1, yo no sé cuánto vale, si vale 8 o 25,",
        "start": 2725.0,
        "end": 2736.0
    },
    {
        "text": " el último sub índice, pero entonces le estamos depende del lugar donde estoy N-1.",
        "start": 2736.0,
        "end": 2741.0
    },
    {
        "text": " Ahora la estiendo un poquito, lo dos últimos son, es su M-1 porque estoy en el espacio M-1,",
        "start": 2744.0,
        "end": 2753.0
    },
    {
        "text": " como N-1, porque Lélie no sabes cuánto se haya acá, puede ser un montón depende de que lo artas.",
        "start": 2753.0,
        "end": 2762.0
    },
    {
        "text": " Lo estiendo un poquito, vean que esta notación de la pared se le dije va a ser en gorros y trate de hacerlo lo más proligito posible para que nadie se me pierra,",
        "start": 2762.0,
        "end": 2771.0
    },
    {
        "text": " pero ves en gorros, eso no hay forma.",
        "start": 2771.0,
        "end": 2775.0
    },
    {
        "text": " Acá voy a escribir un paso más que no están la cadena, acá este haría WB en el medio M-2, estaría por acá, ¿no?",
        "start": 2776.0,
        "end": 2785.0
    },
    {
        "text": " El siguiente, lo voy a escribir, entonces sería su M-2, 1 hasta su M-2, N-2, me siguieron.",
        "start": 2785.0,
        "end": 2801.0
    },
    {
        "text": " Son los nuevos vetores que están en WB en su M-2, que no estaban en WB en su M-1, pero los otros los tengo que conservar,",
        "start": 2802.0,
        "end": 2812.0
    },
    {
        "text": " la parte nira que estaba acá hay que conservarla, solo estos son los nuevos que vinieron.",
        "start": 2812.0,
        "end": 2818.0
    },
    {
        "text": " Bueno, la parte nira lo copió, el sum-1, 1 hasta sum-1, N sum-1.",
        "start": 2818.0,
        "end": 2827.0
    },
    {
        "text": " Y esto sería una base de WB en su M-2.",
        "start": 2828.0,
        "end": 2833.0
    },
    {
        "text": " Este proceso sigue, sigue, sigue, sigue, sigue.",
        "start": 2833.0,
        "end": 2837.0
    },
    {
        "text": " Y vamos a escribir, V-1 y V-0 por ejemplo.",
        "start": 2837.0,
        "end": 2844.0
    },
    {
        "text": " WB es un, perdón. Y WB es un 0.",
        "start": 2844.0,
        "end": 2848.0
    },
    {
        "text": " Quiero decir, un 0 ya es el que hame.",
        "start": 2848.0,
        "end": 2851.0
    },
    {
        "text": " Vamos con WB-1, tanto se estuvo, muchos, tanto.",
        "start": 2860.0,
        "end": 2865.0
    },
    {
        "text": " Eso están todos, pero hay muchos más.",
        "start": 2879.0,
        "end": 2890.0
    },
    {
        "text": " Seguirá hasta WB-1, o sea que estoy en la parte naraja, si quieren, la parte naraja los escribimos",
        "start": 2890.0,
        "end": 2898.0
    },
    {
        "text": " una raja para que se vea bien, acá estaría S-1-1, parte naraja es la 1, hasta S-1-N-1.",
        "start": 2899.0,
        "end": 2910.0
    },
    {
        "text": " ¿Entendió?",
        "start": 2920.0,
        "end": 2922.0
    },
    {
        "text": " Los tendí, los tendí, los tendí hasta que seguía lo WB-1.",
        "start": 2922.0,
        "end": 2925.0
    },
    {
        "text": " Y escribamos, perdón, que sea en gorroso y pesado, pero quiero que se entienda bien,",
        "start": 2926.0,
        "end": 2930.0
    },
    {
        "text": " escribamos WB-0 que ya es todo en núcle, ¿no?",
        "start": 2930.0,
        "end": 2933.0
    },
    {
        "text": " Bueno, tengo de copiar todo esto, S-1-1, S-2-N-2.",
        "start": 2933.0,
        "end": 2942.0
    },
    {
        "text": " Todo eso.",
        "start": 2949.0,
        "end": 2951.0
    },
    {
        "text": " También la parte naraja y una parte azul.",
        "start": 2952.0,
        "end": 2960.0
    },
    {
        "text": " S-1 y una parte azul, que sería S-1 hasta S-0-N-1.",
        "start": 2968.0,
        "end": 2978.0
    },
    {
        "text": " ¿Entendió?",
        "start": 2982.0,
        "end": 2984.0
    },
    {
        "text": " Fue de anotar, pero el concepto no es tan difícil.",
        "start": 2984.0,
        "end": 2987.0
    },
    {
        "text": " Fue usted estendiendo, estendiendo, estendiendo, estén controlando la base del carnel de mo.",
        "start": 2990.0,
        "end": 2995.0
    },
    {
        "text": " Bien.",
        "start": 3001.0,
        "end": 3003.0
    },
    {
        "text": " Ahora voy a borrar el pizarro en el izquierdo y va a parecer otro dibujo similar a este,",
        "start": 3004.0,
        "end": 3013.0
    },
    {
        "text": " porque así como armamos estas cadenas que la voy a dejar en el pizarro en derecho para que se vean,",
        "start": 3013.0,
        "end": 3018.0
    },
    {
        "text": " voy a armar otras cadenas en el pizarro en el izquierdo y que voy a jugar con estos conceptos también.",
        "start": 3018.0,
        "end": 3024.0
    },
    {
        "text": " Antes de borrar alguna duda, el pizarro en el derecho queda, pero voy a borrar todo esto aquí.",
        "start": 3025.0,
        "end": 3036.0
    },
    {
        "text": " Y información igual está ya, porque están la cadena hasta todo.",
        "start": 3038.0,
        "end": 3041.0
    },
    {
        "text": " Bien.",
        "start": 3042.0,
        "end": 3044.0
    },
    {
        "text": " Aquí podemos poner, ¿no?",
        "start": 3055.0,
        "end": 3059.0
    },
    {
        "text": " Que juntos observamos, el nacho lo dijo que esta intersección es muela M-1WB,",
        "start": 3059.0,
        "end": 3069.0
    },
    {
        "text": " porque la azul incluida el último, ¿sacuera?",
        "start": 3069.0,
        "end": 3072.0
    },
    {
        "text": " La podemos poner, ¿no?",
        "start": 3072.0,
        "end": 3074.0
    },
    {
        "text": " Pimo juntos que esto es información, nada más, para que el dibujo quede bien, ¿no?",
        "start": 3075.0,
        "end": 3081.0
    },
    {
        "text": " No lo vamos a usar esa información, pero esa que estamos la ponemos.",
        "start": 3082.0,
        "end": 3086.0
    },
    {
        "text": " Bien. Pizarro en el izquierdo, ¿qué va a pasar ahora?",
        "start": 3086.0,
        "end": 3090.0
    },
    {
        "text": " Bien y otra cadena. ¿Qué es así?",
        "start": 3090.0,
        "end": 3093.0
    },
    {
        "text": " Yo tengo B, en este caso W. Y en azul, ahora lo voy a hacer más chiquito el azul,",
        "start": 3093.0,
        "end": 3102.0
    },
    {
        "text": " porque necesito agrandarlo después y no en el dibujo que da feazo,",
        "start": 3102.0,
        "end": 3106.0
    },
    {
        "text": " por acá tenemos el look, el cero y tenemos que hablar un poquito más chico,",
        "start": 3106.0,
        "end": 3114.0
    },
    {
        "text": " el kernel de mu. ¿Ahora qué pasa?",
        "start": 3114.0,
        "end": 3120.0
    },
    {
        "text": " ¿Qué pasa si yo tomo el kernel de mu cuadrado?",
        "start": 3120.0,
        "end": 3127.0
    },
    {
        "text": " El kernel de mu y el kernel de mu cuadrado.",
        "start": 3128.0,
        "end": 3133.0
    },
    {
        "text": " En vez de las imágenes, ahora tomo los kernel de las composiciones.",
        "start": 3133.0,
        "end": 3140.0
    },
    {
        "text": " ¿Cómo son estos espacios vectoriales? ¿Son espacios vectoriales? ¿Son qué análes de transformaciones de nial?",
        "start": 3145.0,
        "end": 3150.0
    },
    {
        "text": " ¿Cuál es más grande, cuál es más chico? ¿Hay un incluido en otro?",
        "start": 3153.0,
        "end": 3156.0
    },
    {
        "text": " Exactamente. ¿Por qué si algo por mu va a parar a cero?",
        "start": 3156.0,
        "end": 3164.0
    },
    {
        "text": " ¿Ese algo por mu cuadrado qué pasa?",
        "start": 3164.0,
        "end": 3167.0
    },
    {
        "text": " Exactamente. O sea, si B pertenece al kernel de mu,",
        "start": 3167.0,
        "end": 3175.0
    },
    {
        "text": " entonces mu de B es cero. Le aprico mu de vuelta mu, de mu de B es mu de cero,",
        "start": 3175.0,
        "end": 3183.0
    },
    {
        "text": " es cero. Se ha mu cuadrado de B también es cero.",
        "start": 3183.0,
        "end": 3188.0
    },
    {
        "text": " Directo. Por lo tanto, como dije en ustedes, esto es así. ¿No verdad?",
        "start": 3188.0,
        "end": 3193.0
    },
    {
        "text": " Y acá está. Y ya eliminaron cuál es la cadena, ¿no?",
        "start": 3193.0,
        "end": 3199.0
    },
    {
        "text": " La chico un poquito para que meten en el pizarrón.",
        "start": 3199.0,
        "end": 3202.0
    },
    {
        "text": " Acá viene el kernel de mu cuadrado, sigo, el kernel de mu a la M menos 1",
        "start": 3203.0,
        "end": 3214.0
    },
    {
        "text": " y el kernel de mu a la M.",
        "start": 3214.0,
        "end": 3221.0
    },
    {
        "text": " Pregunto. Pregunto, pregunto, pregunto, pregunto. Gabriel, ¿qué es el kernel de mu a la M? ¿Quién es?",
        "start": 3222.0,
        "end": 3230.0
    },
    {
        "text": " El último de la cadena.",
        "start": 3230.0,
        "end": 3233.0
    },
    {
        "text": " Yo lo voy a repren en el pizarrón, habíamos asumido que era una transformación",
        "start": 3235.0,
        "end": 3240.0
    },
    {
        "text": " lineal ni el potente de índice ni el potente de índice. ¿Qué dijimos?",
        "start": 3240.0,
        "end": 3254.0
    },
    {
        "text": " M. Entonces, el kernel de mu a la M quina esa.",
        "start": 3254.0,
        "end": 3259.0
    },
    {
        "text": " Todavía de. Todo el espacio. Exactamente. Todo el mundo está acá.",
        "start": 3259.0,
        "end": 3265.0
    },
    {
        "text": " Porque muela M ya es 0. Exactamente. Va creciendo, va creciendo, va creciendo, va creciendo.",
        "start": 3266.0,
        "end": 3273.0
    },
    {
        "text": " ¿Ah? Y facundo, porque tienes ya esa. ¿Cuál va a ser el ejercicio 2 del práctico 3?",
        "start": 3273.0,
        "end": 3283.0
    },
    {
        "text": " Que estas inclusiones son? Estrictamente.",
        "start": 3283.0,
        "end": 3288.0
    },
    {
        "text": " Estas cesatamente. Si muen el potente de índice M, entonces estas inclusiones son estrictas",
        "start": 3288.0,
        "end": 3295.0
    },
    {
        "text": " y estas inclusiones son estrictas. Y además, si quieren, capaz que lo pongo solo como un ejercicio",
        "start": 3295.0,
        "end": 3303.0
    },
    {
        "text": " porque están relacionados entre sí. Una va a ser estricta y si una va a ser metricida o otra se estricta.",
        "start": 3303.0,
        "end": 3308.0
    },
    {
        "text": " Muy bien. Excelente, chiquiline. Dibujo, entonces. Vamos al dibujo.",
        "start": 3308.0,
        "end": 3316.0
    },
    {
        "text": " En esta cadena, tienes el kernel de mu, el kernel de mu cuadrado va creciendo.",
        "start": 3316.0,
        "end": 3327.0
    },
    {
        "text": " Hasta, oops. Y el penúltimo es el kernel de mu a la M minus 1 y este, el grande ya es el kernel de mu a la M.",
        "start": 3328.0,
        "end": 3344.0
    },
    {
        "text": " Acá me quedó malé.",
        "start": 3344.0,
        "end": 3346.0
    },
    {
        "text": " Ay, va. Que se note para un peucín y pretende más que índice M.",
        "start": 3347.0,
        "end": 3358.0
    },
    {
        "text": " Muy bien. Excelente. Pizarrón derecho, tenemos las imágenes.",
        "start": 3358.0,
        "end": 3367.0
    },
    {
        "text": " Las imágenes las cortamos con el kernel y no quedó esta cadena y armamos una base del kernel.",
        "start": 3367.0,
        "end": 3374.0
    },
    {
        "text": " Y esa base del kernel que es la última que está acá abajo, la que coloríamos todo, la fuimos armando otro cito a trocito.",
        "start": 3375.0,
        "end": 3382.0
    },
    {
        "text": " Pizarrón izquierdo nos dedicamos a otra cadena creciente, la cadena creciente de los subespacios que en el de mu, mu cuadrado, papá.",
        "start": 3382.0,
        "end": 3390.0
    },
    {
        "text": " El primero de todos es el kernel, el que es más grande ya es el pizarrón derecho.",
        "start": 3390.0,
        "end": 3395.0
    },
    {
        "text": " El último de el pizarrón derecho. Este es el más chiquito acá y empieza a crecer hasta llegar a todo el levé.",
        "start": 3395.0,
        "end": 3402.0
    },
    {
        "text": " Bueno.",
        "start": 3405.0,
        "end": 3407.0
    },
    {
        "text": " Acá me to' una observación intermedia que la necesito para las cuentas.",
        "start": 3412.0,
        "end": 3418.0
    },
    {
        "text": " Una pequeña observación de estas típicas de un ejercicio de galuno podría ser que dice así.",
        "start": 3420.0,
        "end": 3428.0
    },
    {
        "text": " El kernel de muela es lo mismo que muela y menos uno del kernel de mu.",
        "start": 3429.0,
        "end": 3440.0
    },
    {
        "text": " Lo hacemos juntos, chim. Es sencillo.",
        "start": 3440.0,
        "end": 3453.0
    },
    {
        "text": " Hacemos juntos porque lo necesito usar.",
        "start": 3453.0,
        "end": 3457.0
    },
    {
        "text": " Como estamos de tiempo, creo que terminamos hoy por fin, ¿sabrán? Vamos arriba.",
        "start": 3457.0,
        "end": 3464.0
    },
    {
        "text": " Necesitamos terminarlo porque me mataría en tener que empezar todo el huelto.",
        "start": 3464.0,
        "end": 3469.0
    },
    {
        "text": " A ver, Burice, vamos a hacer rapidito esto.",
        "start": 3470.0,
        "end": 3472.0
    },
    {
        "text": " Que el kernel de muela y es muela, me lo suen, mía, me lo suena del kernel de mu.",
        "start": 3472.0,
        "end": 3475.0
    },
    {
        "text": " Y medio como que lo hicimos hace un rato también en una cuenta más sencilla.",
        "start": 3475.0,
        "end": 3479.0
    },
    {
        "text": " Pero veamos, si vos tenés B en el kernel de muela y esto es, si solamente si muela y de B es el nuk, es el cero.",
        "start": 3479.0,
        "end": 3492.0
    },
    {
        "text": " Muela y de B, que se quede claro que esto es una B es cero.",
        "start": 3493.0,
        "end": 3499.0
    },
    {
        "text": " Y entonces pongámoslo así. Muela y es mu, compuesta como mu, compuesta como mu, compuesta como mu y veces.",
        "start": 3499.0,
        "end": 3510.0
    },
    {
        "text": " Y es como mu, compuesta como mu a la y menos 1 de B, es el vector nulo.",
        "start": 3510.0,
        "end": 3517.0
    },
    {
        "text": " Y esto como sigue.",
        "start": 3528.0,
        "end": 3529.0
    },
    {
        "text": " Si vos, ¿a dónde está este elemento? Si muela da el nulo, ¿dónde está este elemento?",
        "start": 3532.0,
        "end": 3537.0
    },
    {
        "text": " Si solamente si muela y menos 1 de B, pertenece al kernel de mu.",
        "start": 3538.0,
        "end": 3545.0
    },
    {
        "text": " A que el busse al revés de mu?",
        "start": 3546.0,
        "end": 3547.0
    },
    {
        "text": " A que el busse al revés de mu?",
        "start": 3560.0,
        "end": 3562.0
    },
    {
        "text": " Si solamente si.",
        "start": 3565.0,
        "end": 3567.0
    },
    {
        "text": " B pertenece a mu, acá, menos 1.",
        "start": 3568.0,
        "end": 3572.0
    },
    {
        "text": " Ahora, ahora lo ocurrido.",
        "start": 3573.0,
        "end": 3575.0
    },
    {
        "text": " Aca no es a la y menos 1, es a la menos y menos 1.",
        "start": 3580.0,
        "end": 3586.0
    },
    {
        "text": " Y, ¿dónde fue? Me faltó el menos. O sea.",
        "start": 3586.0,
        "end": 3589.0
    },
    {
        "text": " Y si les marea poner así lo podemos poner de otra manera.",
        "start": 3595.0,
        "end": 3598.0
    },
    {
        "text": " Cuando yo digo mu a la menos y menos 1 es la preimagen.",
        "start": 3599.0,
        "end": 3603.0
    },
    {
        "text": " O sea, si quieren lo podemos escribir de esta otra manera, si les resulta mejor.",
        "start": 3603.0,
        "end": 3606.0
    },
    {
        "text": " La transformación mu a la y menos 1, la preimagen.",
        "start": 3607.0,
        "end": 3611.0
    },
    {
        "text": " Esto es lo mismo que esto, la preimagen.",
        "start": 3613.0,
        "end": 3615.0
    },
    {
        "text": " Lo que estoy diciendo es, el kernel de muela y es la preimagen del kernel de mu a través de la función de la transformación y al mu a la y menos 1.",
        "start": 3616.0,
        "end": 3626.0
    },
    {
        "text": " Veamos el último paso para que quede claro lo de la preimagen.",
        "start": 3629.0,
        "end": 3633.0
    },
    {
        "text": " Si muela la, olvidate que se llama muela y menos 1. Si llama la transformación se llama a t.",
        "start": 3634.0,
        "end": 3640.0
    },
    {
        "text": " Si tdb está en el kernel de algo, ni importa, si solamente si B pertenece a t a la menos 1, menos 1, es la inversa.",
        "start": 3641.0,
        "end": 3653.0
    },
    {
        "text": " O sea, trae para atrás del kernel de mu.",
        "start": 3653.0,
        "end": 3657.0
    },
    {
        "text": " Eso es lo que está aquí en todo ahí.",
        "start": 3657.0,
        "end": 3659.0
    },
    {
        "text": " Si vos agarras a alguien y termina, ni importa si se llama el kernel, si se llama en cualquier espacio vectorial, W, U, entonces V está en la preimagen de CU,",
        "start": 3660.0,
        "end": 3672.0
    },
    {
        "text": " en la preimagen a través de la transformación y al, eso es lo que está aquí en todo esto.",
        "start": 3672.0,
        "end": 3677.0
    },
    {
        "text": " ¿No? ¿No? Buena pregunta, para nada.",
        "start": 3688.0,
        "end": 3693.0
    },
    {
        "text": " Y de hecho el amuno va a ser invertible. Cuando vos tomas preimagenes, no, no, no, no, no.",
        "start": 3693.0,
        "end": 3699.0
    },
    {
        "text": " Estás diciendo solamente, vamos a escribirlo acá, si tenés T de U1 en U2 y siquiera tiene que ser espacio vectorial,",
        "start": 3699.0,
        "end": 3711.0
    },
    {
        "text": " Tomas un A, un subconjunto cualquiera de U2, no digo que es invertible y nada, T de la menos 1 de A que son aquellos vectores de U1,",
        "start": 3711.0,
        "end": 3723.0
    },
    {
        "text": " tal que Tdb está en A, es eso.",
        "start": 3723.0,
        "end": 3728.0
    },
    {
        "text": " La preimagen son aquellos que van a parar A, entonces eso, vamos de vuelta, ¿no?",
        "start": 3728.0,
        "end": 3735.0
    },
    {
        "text": " Yo la transformación se llama MU, el A y menos 1, al A, R, el B y termina en el kernel, quiere decir que el B está en la preimagen de esa transformación del kernel,",
        "start": 3735.0,
        "end": 3747.0
    },
    {
        "text": " sí solamente sí.",
        "start": 3747.0,
        "end": 3750.0
    },
    {
        "text": " Yo estuve mal en la observación, me olvide poner la inversa y culpo.",
        "start": 3750.0,
        "end": 3755.0
    },
    {
        "text": " Bueno, pero esta observación por un lado tan medio compleja, por otro lado es muy sencillo,",
        "start": 3755.0,
        "end": 3775.0
    },
    {
        "text": " lo que está diciendo, miren lo que está diciendo, ¿urice?",
        "start": 3775.0,
        "end": 3779.0
    },
    {
        "text": " Miren los dos pizarroles, acá está el juego creciente o si quieren decresciente, lo vimos de izquierda derecha,",
        "start": 3780.0,
        "end": 3790.0
    },
    {
        "text": " MUDD, MUDDWB, MucuadraWB, se fue haciendo más chiquita, más chiquita la imagen, ¿cierto?",
        "start": 3790.0,
        "end": 3798.0
    },
    {
        "text": " Después lo cortamos con el kernel y lo quedó esta cadena que fue la que usamos, la cadena que le construimos la base, muy bien.",
        "start": 3798.0,
        "end": 3804.0
    },
    {
        "text": " Pero en este caso, vos arrancás el kernel y vas tomando el kernel de MucuadraWBB, cada vez más grande,",
        "start": 3805.0,
        "end": 3813.0
    },
    {
        "text": " cada vez más grande hasta que llegas a todo el B, muy bien.",
        "start": 3813.0,
        "end": 3818.0
    },
    {
        "text": " Resulta que todos estos que están acá en el medio, no son otra cosa que la preimagen del kernel,",
        "start": 3819.0,
        "end": 3826.0
    },
    {
        "text": " pero la preimagen, en vez de la imagen, la preimagen del kernel de transformaciones que van cambiando,",
        "start": 3827.0,
        "end": 3835.0
    },
    {
        "text": " o sea, una es MUDD, después MucuadraWB, después MucuadraWB, así, cada vez le vas creciéndole por el temprano,",
        "start": 3835.0,
        "end": 3842.0
    },
    {
        "text": " no tomás la imagen como ya, tomás la preimagen.",
        "start": 3842.0,
        "end": 3845.0
    },
    {
        "text": " Entonces, el juego acá es similar a aquello, te enmira diciendo, ¿este? ¿y acá?",
        "start": 3846.0,
        "end": 3853.0
    },
    {
        "text": " Por ejemplo, dos para ahí dos, entonces te queda muy la menos una, ¿no?",
        "start": 3856.0,
        "end": 3862.0
    },
    {
        "text": " Esto es la preimagen que débil claro del kernel de MucuadraWBBBB,",
        "start": 3862.0,
        "end": 3871.0
    },
    {
        "text": " más grande, tomás la preimagen todos los que después si le aplicas Mucuadra en el kernel.",
        "start": 3871.0,
        "end": 3876.0
    },
    {
        "text": " Y este último sería la preimagen de Múa Lm-1, la preimagen del kernel de Mú.",
        "start": 3876.0,
        "end": 3887.0
    },
    {
        "text": " Bueno, bien, muy bien.",
        "start": 3892.0,
        "end": 3897.0
    },
    {
        "text": " Entonces, voy a borrar la demostración cita acá abajo de la observación, porque en",
        "start": 3897.0,
        "end": 3905.76
    },
    {
        "text": " necesito se pizarrón para seguir la construcción.",
        "start": 3905.76,
        "end": 3910.32
    },
    {
        "text": " Entonces, ¿qué pasaba?",
        "start": 3910.32,
        "end": 3912.04
    },
    {
        "text": " Nosotros allá abajo, habíamos construido la base del kernel de mu.",
        "start": 3912.04,
        "end": 3917.24
    },
    {
        "text": " Teníamos una base del kernel de mu.",
        "start": 3917.24,
        "end": 3921.2
    },
    {
        "text": " Si quieren la llamamos acá a este...",
        "start": 3921.2,
        "end": 3925.4799999999996
    },
    {
        "text": " No quiero llamar la B que las base final, vamos a llamar la N.",
        "start": 3925.4799999999996,
        "end": 3931.8399999999997
    },
    {
        "text": " Una base del kernel de mu.",
        "start": 3931.8399999999997,
        "end": 3934.4799999999996
    },
    {
        "text": " N está acá.",
        "start": 3934.4799999999996,
        "end": 3936.56
    },
    {
        "text": " N es una base del kernel de mu.",
        "start": 3936.56,
        "end": 3943.3199999999997
    },
    {
        "text": " Y resulta que tomando entonces, fíjense como se construyen los otros espacios que",
        "start": 3943.32,
        "end": 3949.0
    },
    {
        "text": " siguen los otros espacios que están acá.",
        "start": 3949.0,
        "end": 3952.0
    },
    {
        "text": " Son primágenes del primer espacio.",
        "start": 3952.0,
        "end": 3956.96
    },
    {
        "text": " Muela menos 1 del kernel, muela menos 2 del kernel, muela menos M, menos 2 del",
        "start": 3956.96,
        "end": 3962.76
    },
    {
        "text": " kernel y muela menos M, menos 1 del kernel.",
        "start": 3962.76,
        "end": 3966.1200000000003
    },
    {
        "text": " Son todas primágenes de esta acá.",
        "start": 3966.1200000000003,
        "end": 3970.7200000000003
    },
    {
        "text": " Quiere decir, bueno, entonces, necesito escribir de vuelta toda esta base, necesito",
        "start": 3970.72,
        "end": 3979.12
    },
    {
        "text": " disculpen, escribir la de vuelta aquí arriba, porque bajo el otro rol acá.",
        "start": 3979.12,
        "end": 3986.52
    },
    {
        "text": " Tenemos su 0, 1, su 0 en el 0, es 1, 1.",
        "start": 3986.52,
        "end": 3997.0
    },
    {
        "text": " El saco de las comas intermedias, pues, sino es 1, 1, hasta es 1 en 1.",
        "start": 3997.0,
        "end": 4007.6
    },
    {
        "text": " Y lo voy a cortar un poquito, sí, hasta es sum, menos 1, 1, sum, menos 1 en sum, esta",
        "start": 4007.6,
        "end": 4019.04
    },
    {
        "text": " de la base que construimos juntos del kernel de mu.",
        "start": 4019.04,
        "end": 4026.96
    },
    {
        "text": " Está donde estaba la azul, yo la esté acá.",
        "start": 4026.96,
        "end": 4034.56
    },
    {
        "text": " La parte naranja está acá, sí, entonces vean conmigo, la parte naranja, la parte",
        "start": 4034.56,
        "end": 4043.64
    },
    {
        "text": " naranja es mu de alguien, acá dice, es imagen de alguien, todos los veintores de este espacio",
        "start": 4043.64,
        "end": 4050.12
    },
    {
        "text": " son imágenes de alguien, todos los verdes son imágenes de mu cuadrados, de la base,",
        "start": 4050.12,
        "end": 4056.88
    },
    {
        "text": " son imágenes de mu cuadrados, todos los primeros son imágenes de muela en menos 1,",
        "start": 4056.88,
        "end": 4064.88
    },
    {
        "text": " eso es lo que quiero decir ahora, o sea, este que está acá, esta primera parte que construimos",
        "start": 4064.88,
        "end": 4073.92
    },
    {
        "text": " juntos, los voy a escribir como mu a la m menos 1, de f su m menos 1, 1, hasta mu a la",
        "start": 4073.92,
        "end": 4087.44
    },
    {
        "text": " m menos 1, de f su m menos 1 en su m menos 1.",
        "start": 4087.44,
        "end": 4093.48
    },
    {
        "text": " Un dos subvencidos en el medio, porque en el medio hay muchos.",
        "start": 4093.48,
        "end": 4099.52
    },
    {
        "text": " Que use una vez más, quiero que no se pierdan, me ponen unas flechas de acá si quieren,",
        "start": 4099.52,
        "end": 4105.280000000001
    },
    {
        "text": " la parte negra que es la primera parte que hicimos juntos son vectores que están en la",
        "start": 4105.280000000001,
        "end": 4112.080000000001
    },
    {
        "text": " imagen de muela en menos 1, estaban acá, así se llamaban, bueno, pero son imágenes de alguien,",
        "start": 4112.080000000001,
        "end": 4120.4400000000005
    },
    {
        "text": " imágenes por mu, no, imágenes por muela en menos 1, por eso los quiero decir así, y",
        "start": 4120.4400000000005,
        "end": 4126.92
    },
    {
        "text": " todos los que están en f su m menos 1, 1 están acá en W, son imágenes de alguien por muela",
        "start": 4126.92,
        "end": 4134.84
    },
    {
        "text": " en menos 1, para que se entienda bien, esto mismo, lo voy haciendo, lo voy haciendo, lo voy",
        "start": 4134.84,
        "end": 4139.64
    },
    {
        "text": " haciendo, todos los casos, vamos al caso acá, este caso es el caso naranja, en la zona naranja,",
        "start": 4139.64,
        "end": 4150.72
    },
    {
        "text": " no me dan escribirlo de vuelta, simplemente le pongo así, la zona naranja, son mude",
        "start": 4150.72,
        "end": 4156.76
    },
    {
        "text": " alguien, los naranjas son mude alguien, entonces esto lo se escribo, por acá abajo, como mu de f",
        "start": 4156.76,
        "end": 4166.76
    },
    {
        "text": " es 1, 1, hasta mu de f es 1, en es 1, está bien, y los azules, eso no son imágenes de nadie,",
        "start": 4166.76,
        "end": 4183.2
    },
    {
        "text": " eso es lamentablemente, o lamentablemente o sin lamentar nada, porque queda ni igualitos,",
        "start": 4183.2,
        "end": 4188.76
    },
    {
        "text": " es 0, 1, es 0, en es 0, bueno, si queda trabajo escribir las cosas con cuidado para",
        "start": 4192.2,
        "end": 4206.639999999999
    },
    {
        "text": " llordan, para que se visualice bien el proceso, bueno bien, este, les iba a copiar tranquilos,",
        "start": 4206.64,
        "end": 4223.64
    },
    {
        "text": " para homogenizar notación, a estos últimos también lo llamamos f es 1, f es 1, en es 0, lo",
        "start": 4223.64,
        "end": 4239.160000000001
    },
    {
        "text": " llamó igualito, porque no son mude nadie, entonces así me queda todo en f, ahora, las f es,",
        "start": 4239.160000000001,
        "end": 4244.64
    },
    {
        "text": " las imágenes de las f, las imágenes al cuadrado, las imágenes al m-1 de las f,",
        "start": 4244.64,
        "end": 4249.88
    },
    {
        "text": " y acá empieza a aparecer todo el proceso llorda, ya empiezan a visualizar eso de cómo se van",
        "start": 4253.64,
        "end": 4263.96
    },
    {
        "text": " transformando los victores y se van desapareciendo la base, bueno, esto, porque no tengo otro pizarro,",
        "start": 4263.96,
        "end": 4279.52
    },
    {
        "text": " necesito borrarlo, el pizarro derecho, le pido disculpa, lo voy a borrar, capas que después",
        "start": 4279.52,
        "end": 4284.88
    },
    {
        "text": " tenemos que recurrir a la información que está acá, usted la tiene en el cuadro, es que necesito",
        "start": 4284.88,
        "end": 4290.320000000001
    },
    {
        "text": " borrar esto para escribir, entonces es una escalera nueva, pero es una escalera nueva, digamos,",
        "start": 4290.320000000001,
        "end": 4296.320000000001
    },
    {
        "text": " utilizando esta información de los f, así como está escalera, pero desde aquí,",
        "start": 4296.32,
        "end": 4305.08
    },
    {
        "text": " bueno, bien, teníamos,",
        "start": 4326.32,
        "end": 4354.799999999999
    },
    {
        "text": " la primera es la base del caramel, la voy a llamar entonces f sub 0 1 hasta f sub 0 en 0,",
        "start": 4354.8,
        "end": 4373.8
    },
    {
        "text": " mu de f sub 1 1 hasta mu de f sub 1 en 0, mu a la m menos 1 de f sub m menos 1,",
        "start": 4373.8,
        "end": 4396.52
    },
    {
        "text": " mu a la m menos 1 e f sub m menos 1 en f sub m menos 1, esta, la misma que teníamos antes,",
        "start": 4396.52,
        "end": 4409.200000000001
    },
    {
        "text": " pero le cambié la forma de notarlos, y esta es una base del caramel de mu, bien, ahora voy a escribir",
        "start": 4409.200000000001,
        "end": 4422.360000000001
    },
    {
        "text": " otra escalera de creciente, bien, se ha chicarse esta escalera, la escalera es este, no les digo nada y les",
        "start": 4422.36,
        "end": 4429.32
    },
    {
        "text": " pregunto dónde estarán estos pintores.",
        "start": 4429.32,
        "end": 4435.16
    },
    {
        "text": " El primero quité los primeros, los azules, ya no le puse colores, los azules lo quité,",
        "start": 4459.32,
        "end": 4471.4
    },
    {
        "text": " todos los demás, los cambios un poquito también, ya no es mu de f 1 1, sino de f 1 1, no es mu de f 1 en",
        "start": 4471.4,
        "end": 4480.599999999999
    },
    {
        "text": " 1, sino de f 1 en 1, y acá le quité una potencia también, ¿no? A dónde están estos?",
        "start": 4480.6,
        "end": 4488.6
    },
    {
        "text": " Si le aplicas mu los ayudo, si a esto le aplica mu donde están?",
        "start": 4498.200000000001,
        "end": 4502.360000000001
    },
    {
        "text": " Perfecto, exactamente acá están en la pre imagen del que dan el de mu, porque si le aplica mu están en el que",
        "start": 4502.36,
        "end": 4515.799999999999
    },
    {
        "text": " le aplica, entonces están en el que dan el de mu cuadrada, exactamente, de hecho, pero no voy a escribir esto,",
        "start": 4515.8,
        "end": 4529.12
    },
    {
        "text": " esto están en el que dan el de mu cuadrada, esto se están en el que dan el de mu cuadrada, su imagen está en el",
        "start": 4529.12,
        "end": 4542.28
    },
    {
        "text": " que dan el de mu, a ver si me ayudan, si logramos esto aunque no terminemos el teorema andamos",
        "start": 4542.28,
        "end": 4550.84
    },
    {
        "text": " pero volando, voy a agarrar un color verde, estos, si le aplico la imagen están en el que dan el de mu,",
        "start": 4550.84,
        "end": 4563.92
    },
    {
        "text": " es más, si le aplico la imagen son un gran parte de la base del que dan el de mu, no toda,",
        "start": 4564.88,
        "end": 4573.4800000000005
    },
    {
        "text": " pero gran parte de la base, pregunto, eso verde, que dibujé allá que el redón 10,",
        "start": 4573.4800000000005,
        "end": 4580.52
    },
    {
        "text": " ¿dónde está acá? Ya me dijeron, están en esta zona, me lo dijeron, en el que dan el de mu cuadrado",
        "start": 4582.28,
        "end": 4589.12
    },
    {
        "text": " me dijeron, muy bien, lo quiero dibujar donde lo dibujo, el verde, tengo el verde en la mano,",
        "start": 4589.12,
        "end": 4596.599999999999
    },
    {
        "text": " levanto la mano en la compañía de la de un finfíjil,",
        "start": 4602.32,
        "end": 4604.5199999999995
    },
    {
        "text": " si le aplico mu, si le aplico mu, cada vez acá, esto no lo puedo recuperar, está bien, esto no,",
        "start": 4604.52,
        "end": 4618.72
    },
    {
        "text": " pero cada vez en parte de la base, pregunto, voy a dibujar mal, puede estar acá, si le aplica mu a",
        "start": 4618.72,
        "end": 4631.040000000001
    },
    {
        "text": " esto, ¿sabes dónde van a parar? ¿Hacero? ¿por qué están en el carnet? ¿Pues estar así? No, porque esto",
        "start": 4631.04,
        "end": 4638.6
    },
    {
        "text": " lo que esté en acá, van a parar acero, no van a parar el elemento de una base, quiere decir que",
        "start": 4638.6,
        "end": 4645.36
    },
    {
        "text": " esa parte verde que acabas de dibujar, está acá, está ahí, y la parte primera, me dijiste lo",
        "start": 4645.36,
        "end": 4653.88
    },
    {
        "text": " construimos juntos, más de esa que ya no tengo colores para diferenciar mucho, disculpen,",
        "start": 4653.88,
        "end": 4659.64
    },
    {
        "text": " ponámoslo en azul, esta parte primera estaba, disculpen que se la azul el mismo azul estaba por",
        "start": 4659.64,
        "end": 4669.84
    },
    {
        "text": " acá, ¿sierto? Era una base del carnet de mu, la verde está acá, ¿por qué no puede una vez más?",
        "start": 4669.84,
        "end": 4677.4400000000005
    },
    {
        "text": " ¿Por qué no puede tocar el carnet? Porque si algunos de esos tocaran el carnet, si algunos",
        "start": 4677.4400000000005,
        "end": 4681.56
    },
    {
        "text": " tuvieran el carnet, si ese es muy te va a acero, no parte de una base, en serio no puede ser nunca",
        "start": 4681.56,
        "end": 4686.96
    },
    {
        "text": " parte de una base, ¿tá claro? Entonces, esto van a parar a este trozo, entonces esto es bien,",
        "start": 4686.96,
        "end": 4695.400000000001
    },
    {
        "text": " no me va a dar el tiempo en la metálemente para terminar de su orda, pero voy a hacer preguntas para",
        "start": 4698.52,
        "end": 4703.120000000001
    },
    {
        "text": " ya ubicamos bien, obviamente la escalera sigue, pero si decemos bien el primer pasito, sé que el",
        "start": 4704.8,
        "end": 4710.160000000001
    },
    {
        "text": " resto lo podemos hacer, también muy bien, esto ya lo dibujamos, están allá, pregunto y esta más",
        "start": 4710.16,
        "end": 4720.54
    },
    {
        "text": " difícil o no, que para que es más fácil, entonces, este conjunto, ¿cómo es? En aquellas",
        "start": 4720.54,
        "end": 4727.639999999999
    },
    {
        "text": " características de leí, el ED, ¿por qué? Es el leí, muy bien, ¿por qué? No, yo puse base, pero lo",
        "start": 4727.64,
        "end": 4742.52
    },
    {
        "text": " quiten, no termine siendo parte de una base, lo que estamos construyendo en la base, ahora hacia",
        "start": 4742.52,
        "end": 4748.88
    },
    {
        "text": " arriba estamos construyendo de la misma forma, ¿por qué es el leí?",
        "start": 4748.88,
        "end": 4751.92
    },
    {
        "text": " Sí, me dejas corgirte solamente una cosita, porque si el hacer la transformación pasa ser parte de una base,",
        "start": 4758.64,
        "end": 4765.92
    },
    {
        "text": " el leí, si fuera el ED, transformado que el ED, ¿no? Y transformado que el leí, porque es parte de una base,",
        "start": 4765.92,
        "end": 4774.96
    },
    {
        "text": " lo anotamos por favor, entonces el verde es el leí, y ahora viene una pregunta más, Gabriel,",
        "start": 4774.96,
        "end": 4786.96
    },
    {
        "text": " no te convenci con que el leí, ¿te convenci con que el leí? Ahí va, vamos de vuelta,",
        "start": 4786.96,
        "end": 4794.88
    },
    {
        "text": " suponente que te da una combinación niña que te da cero, le aplica muy, como es una combinación",
        "start": 4794.88,
        "end": 4800.96
    },
    {
        "text": " niña, le aplica muy, te queda una combinación niña, acá, y ahí mirás lo, no, pero esto es",
        "start": 4800.96,
        "end": 4806.12
    },
    {
        "text": " parte de una base, entonces todos los coeficientes tienes que ser cero, entonces ese te da el",
        "start": 4806.12,
        "end": 4810.44
    },
    {
        "text": " transformado del edad, este queda en el ED, pero no puede ser el ED, porque parte de una base, entonces",
        "start": 4811.24,
        "end": 4818.36
    },
    {
        "text": " el leí, ¿tabes? ¿de acuerdo? Y es una última pregunta, para irme más contento todavía,",
        "start": 4818.36,
        "end": 4824.599999999999
    },
    {
        "text": " esto quiero que la noten lo que estamos diciendo, porque no lo estoy anotando yo, ya dijimos,",
        "start": 4824.599999999999,
        "end": 4829.2
    },
    {
        "text": " esta la base del que an el, este es un conjunto, lo pusimos acá, golazo, este es un golazo,",
        "start": 4829.2,
        "end": 4835.96
    },
    {
        "text": " se abruvicarlo y última pregunta para irnos entre los dos, los uno ahora, uno los dos",
        "start": 4835.96,
        "end": 4846.92
    },
    {
        "text": " conjuntos, me queda el el ahí, sí o no, ¿por qué me queda el ahí?",
        "start": 4846.92,
        "end": 4853.4400000000005
    },
    {
        "text": " Intuitivamente está muy bien lo que dijiste, muy bien lo que dijiste va a ser el el ahí, pero quiero",
        "start": 4866.16,
        "end": 4873.0
    },
    {
        "text": " explicar un poquito más formalmente, yo digo que la unión de los dos, del azul lo pongo así,",
        "start": 4873.0,
        "end": 4880.52
    },
    {
        "text": " para no escribir tanto, esto, unión con el verde,",
        "start": 4882.52,
        "end": 4887.08
    },
    {
        "text": " me queda el ahí,",
        "start": 4891.6,
        "end": 4893.0
    },
    {
        "text": " formalizo un poquito, digo así, supongamos que tenemos una combinación lineal",
        "start": 4893.0,
        "end": 4902.6
    },
    {
        "text": " y miren cómo los escribo, para que se entienda bien, con los V en el azul, con los W",
        "start": 4912.36,
        "end": 4921.96
    },
    {
        "text": " en el verde, se entiende? Una combinación lineal para no escribir todo esto que es larguísimo,",
        "start": 4923.44,
        "end": 4932.84
    },
    {
        "text": " una combinación lineal de los azules y de los verdes, se entendió bien así y yo quiero",
        "start": 4932.84,
        "end": 4939.28
    },
    {
        "text": " probar que se leí todavía, que es un poco la instrucción que dijo recién camina, que hago,",
        "start": 4939.28,
        "end": 4944.68
    },
    {
        "text": " le aplico fee, o sea yo digo, esta combinación lineal igual al nulo, y quiero ver qué pasa con los",
        "start": 4944.68,
        "end": 4950.84
    },
    {
        "text": " eficientes, si pruebo que son todos cero es lo que queríamos, es el ahí, pero cuál es el",
        "start": 4950.84,
        "end": 4956.6
    },
    {
        "text": " truco, le aplico fin o disculpe mu, es que fee la original, le aplico mu, entonces yo le aplico",
        "start": 4956.6,
        "end": 4962.12
    },
    {
        "text": " mu, ¿qué pasa con los azules?",
        "start": 4962.12,
        "end": 4964.2
    },
    {
        "text": " A donde se fueron? A cero, pinba, los azules son tan en el que, no, se van a cero y que te queda,",
        "start": 4967.24,
        "end": 4974.64
    },
    {
        "text": " te queda la sumatoria de beta W por mu de W cuando W en los verdes, ¿cierto? Igual a mu de cero,",
        "start": 4974.64,
        "end": 4991.88
    },
    {
        "text": " que cero, esto queda igual, igual a mu, al no, el truco nulo, ¿y estos? ¿quién son estos",
        "start": 4991.88,
        "end": 4998.64
    },
    {
        "text": " que están acá? esto es muy W, con los W en el verdes, esta parte de los azules, ¿se",
        "start": 4998.64,
        "end": 5006.6
    },
    {
        "text": " acordan? esta parte de los azules, van a parar por mu, van a parar por mu, van a parar por mu,",
        "start": 5006.6,
        "end": 5015.320000000001
    },
    {
        "text": " es una parte de un conjunto que es una base, el particular esto es el ahí, entonces cuál es la",
        "start": 5016.8,
        "end": 5024.200000000001
    },
    {
        "text": " conclusión respecto de los beta? los beta son todos cero, vamos ponernos en colorcito para que se",
        "start": 5024.2,
        "end": 5036.8
    },
    {
        "text": " esté bien claro para todo W en la parte verde, entonces se anulaste, permítanme seguir con el",
        "start": 5036.8,
        "end": 5045.76
    },
    {
        "text": " razonamiento, entonces se anulaste toda esta parte ¿no verdad? ¿cierto? esta se fue, ¿qué te",
        "start": 5045.76,
        "end": 5051.9
    },
    {
        "text": " quería probar que los alfas son cero, pero ahora que te quedó, te quedó simplemente así, la",
        "start": 5051.9,
        "end": 5057.42
    },
    {
        "text": " suma de los alfab por B igual a cero, porque la otra parte se fue, con B en los azules, pero ¿qué?",
        "start": 5057.42,
        "end": 5065.259999999999
    },
    {
        "text": " ¿cómo era el conjunto azul? es una base, si es una base lo coeficiente, tienen que ser cero,",
        "start": 5067.0599999999995,
        "end": 5074.54
    },
    {
        "text": " por favor no ten todo lo que no anote y digio oralmente, entonces alfab es igual a cero para todo",
        "start": 5075.26,
        "end": 5085.86
    },
    {
        "text": " chicos, no se vayan porque la clase terminó pero necesito que me hagan preguntas, yo no pasamos",
        "start": 5090.66,
        "end": 5097.22
    },
    {
        "text": " cinco minutos, no quiero que se lleven ninguna duda, quiere que este quede porque no terminamos",
        "start": 5097.22,
        "end": 5103.22
    },
    {
        "text": " y ¿cómo sigue la clase que viene que lamentablemente no es el martes porque el paro de lia va a ser",
        "start": 5103.22,
        "end": 5108.46
    },
    {
        "text": " recién el viernes que viene, sigue en terminar las escaleras, esta escalera, si, si, si, ¿cora que",
        "start": 5108.46,
        "end": 5114.54
    },
    {
        "text": " teníamos en las escaleras crecientes? ahora vamos a tener una escalera decreciente que atiende",
        "start": 5114.54,
        "end": 5120.22
    },
    {
        "text": " este proceso, si le sacan una foto y me la pasan por el capaz que en este momento sacan una foto",
        "start": 5120.22,
        "end": 5129.3
    },
    {
        "text": " alguno y la meten el foro, vamos a arrancar con esta foto en la clase del viernes que viene, pero por favor",
        "start": 5129.3,
        "end": 5135.54
    },
    {
        "text": " sacen con el celular un par de fotos y alguna que quede linda la suben el foro, voy a terminar las",
        "start": 5135.54,
        "end": 5142.38
    },
    {
        "text": " escaleras, ¿sí? y ese proceso de las escaleras cuando miran las columnas, eso llordan, ahí te quedo",
        "start": 5142.38,
        "end": 5149.38
    },
    {
        "text": " llorando, las columnas son exactamente el proceso llorando, ¿tabien? ojo, hay una cosa más, terminamos",
        "start": 5149.38,
        "end": 5157.18
    },
    {
        "text": " probando que rojo la unión de los dos y se lee, lo mismo cuando una tres, cuando una cuatro, cuando",
        "start": 5157.18,
        "end": 5162.9400000000005
    },
    {
        "text": " una, cuando una todas las escaleras, pero me faltó decir algo que va a quedar para el otro viernes,",
        "start": 5162.9400000000005,
        "end": 5168.34
    },
    {
        "text": " no solamente es el ley sino que es una base del grande, entre el azul y el verde formamos una base",
        "start": 5168.34,
        "end": 5176.5
    },
    {
        "text": " de mucuadrado, del que dan el de mucuadrado, entre estos dos, eso falta argumentar, pues ya lo vamos a",
        "start": 5177.06,
        "end": 5182.78
    },
    {
        "text": " argumentar, se entendió el final, no faltan cuentitas, pero tenemos atrapado a Jordán y lo tenemos",
        "start": 5182.78,
        "end": 5190.02
    },
    {
        "text": " bien, bien, bien ordenado, sí.",
        "start": 5190.02,
        "end": 5191.98
    }
]