[
    {
        "text": " Bueno, ¿qué dimos la clase pasada?",
        "start": 0.0,
        "end": 2.84
    },
    {
        "text": " Un breve repaso de algunos conceptos.",
        "start": 2.84,
        "end": 8.24
    },
    {
        "text": " Por un lado vimos la diferencia entre el gerente omnipotente y el gerente simbólico.",
        "start": 8.24,
        "end": 14.280000000000001
    },
    {
        "text": " Digimos que cuando estamos en una visión simbólica,",
        "start": 14.280000000000001,
        "end": 18.2
    },
    {
        "text": " habían dos condiciones que estaban limitando el ejercicio del criterio excelencial.",
        "start": 18.2,
        "end": 23.76
    },
    {
        "text": " Y allí teníamos la cultura, que fue todo lo que estuvimos hablando a la otra clase.",
        "start": 23.76,
        "end": 29.04
    },
    {
        "text": " Y a su vez también el entorno en el que esté insertar a la organización.",
        "start": 29.08,
        "end": 34.8
    },
    {
        "text": " Dimos, bueno, la cultura con una reflexión interna,",
        "start": 34.8,
        "end": 37.96
    },
    {
        "text": " el entorno con una reflexión externa.",
        "start": 37.96,
        "end": 40.879999999999995
    },
    {
        "text": " Hablamos del entorno externo, como todas aquellas factores y fuerzas que operan y",
        "start": 40.879999999999995,
        "end": 45.879999999999995
    },
    {
        "text": " que están cuida de la organización y que van a afectar claramente el desempeño de la misma.",
        "start": 45.879999999999995,
        "end": 53.480000000000004
    },
    {
        "text": " Hablamos de los diferentes componentes de ese entorno externo,",
        "start": 53.480000000000004,
        "end": 58.04
    },
    {
        "text": " tanto como aspectos económicos, propios de la economía.",
        "start": 58.04,
        "end": 63.12
    },
    {
        "text": " Por ejemplo, cuando hablamos del tipo de cambio,",
        "start": 63.12,
        "end": 64.76
    },
    {
        "text": " estamos hablando de un aspecto económico.",
        "start": 64.76,
        "end": 68.2
    },
    {
        "text": " Temas demográficos, hablamos de algunos ruros de actividad",
        "start": 68.2,
        "end": 71.72
    },
    {
        "text": " que se estaban viendo afectados por cambios demográficos, aspectos tecnológicos.",
        "start": 71.72,
        "end": 78.56
    },
    {
        "text": " Ahí, bueno, uno de los temas que surgió la clase pasada fue la inteligencia artificial.",
        "start": 78.56,
        "end": 83.8
    },
    {
        "text": " Por ejemplo, que es algo que a nivel tecnológico se está dando,",
        "start": 83.8,
        "end": 87.84
    },
    {
        "text": " que está teniendo impacto en varias organizaciones.",
        "start": 87.84,
        "end": 91.84
    },
    {
        "text": " Alguien que quiera contar una experiencia de luso que le esté dando a la inteligencia",
        "start": 91.84,
        "end": 96.0
    },
    {
        "text": " artificial dentro de sus puestos laborales.",
        "start": 96.0,
        "end": 98.12
    },
    {
        "text": " No sé si tienen algún ejemplo.",
        "start": 103.12,
        "end": 104.8
    },
    {
        "text": " Me mencionamos el caso de algunos estudios jurídicos",
        "start": 104.8,
        "end": 113.12
    },
    {
        "text": " que lo estaban utilizando para lo que era la transcripción,",
        "start": 113.12,
        "end": 116.39999999999999
    },
    {
        "text": " para lo que era el armado de reportes, correcciones de reacción.",
        "start": 116.39999999999999,
        "end": 122.0
    },
    {
        "text": " Ya ya salido en varios medios de prensa.",
        "start": 124.0,
        "end": 126.2
    },
    {
        "text": " Bueno, allí, o aquí, menciona también el tema de mejorar reacción de tomar ideas.",
        "start": 127.4,
        "end": 132.4
    },
    {
        "text": " Está haciendo muy clíos.",
        "start": 133.4,
        "end": 134.4
    },
    {
        "text": " No para programar.",
        "start": 134.4,
        "end": 135.4
    },
    {
        "text": " Como herramienta de ayuda para los desarrolladores está muy bueno.",
        "start": 137.4,
        "end": 141.4
    },
    {
        "text": " Perfecto, ¿y tú lo estás usando?",
        "start": 141.4,
        "end": 143.4
    },
    {
        "text": " Sí.",
        "start": 143.4,
        "end": 144.4
    },
    {
        "text": " Buenísimo.",
        "start": 144.4,
        "end": 146.4
    },
    {
        "text": " Incluso se está utilizando inteligencia artificial para hacer lectura de estudios médicos",
        "start": 147.4,
        "end": 153.4
    },
    {
        "text": " y, bueno, ya está bastante asignado.",
        "start": 153.4,
        "end": 156.4
    },
    {
        "text": " En la en cuenta que, cuando más casos se den y cuantos más información",
        "start": 156.4,
        "end": 161.4
    },
    {
        "text": " vayan procesando mejor y más atinados van a ser los resultados.",
        "start": 161.4,
        "end": 165.4
    },
    {
        "text": " ¿Qué otro ejemplo?",
        "start": 167.4,
        "end": 168.4
    },
    {
        "text": " En mi trabajo, se hizo un chat box que está asociado con WhatsApp.",
        "start": 170.4,
        "end": 177.4
    },
    {
        "text": " Y en general, o sea, no, si bien no se ve lo que busca la gente,",
        "start": 177.4,
        "end": 183.4
    },
    {
        "text": " si se han hecho consultas de qué tanto lo usan y para qué.",
        "start": 184.4,
        "end": 188.4
    },
    {
        "text": " Y también vemos el tráfico que tiene y es bastante común que se concentre más durante la semana.",
        "start": 190.4,
        "end": 198.4
    },
    {
        "text": " O sea, hay muchos estudiantes que lo usan para preguntar cosas.",
        "start": 198.4,
        "end": 203.4
    },
    {
        "text": " Genial.",
        "start": 204.4,
        "end": 205.4
    },
    {
        "text": " Claro, es importantísimo no estar atentos a lo que va pasando, bueno, como es ejemplo de tu decía de los chat box",
        "start": 205.4,
        "end": 212.4
    },
    {
        "text": " que se están popularizando bastante, que cada vez más las empresas lo están utilizando.",
        "start": 212.4,
        "end": 217.4
    },
    {
        "text": " ¿Qué otro ejemplo? Muy bueno.",
        "start": 217.4,
        "end": 219.4
    },
    {
        "text": " Bueno, pues hablamos de temas también culturales que afectan a la organización.",
        "start": 224.4,
        "end": 229.4
    },
    {
        "text": " Cada país tiene su cultura y esas características culturales hace que algunos bienes y servicios sean",
        "start": 229.4,
        "end": 236.4
    },
    {
        "text": " más probables de uso en un país que no otros aspectos también políticos,",
        "start": 236.4,
        "end": 242.4
    },
    {
        "text": " que también afectan a la organización.",
        "start": 242.4,
        "end": 245.4
    },
    {
        "text": " Mimos este cuadro que lo que hace es comparar la complejidad del entorno y por otro lado que tan dinámico es, que tan cambiante.",
        "start": 249.4,
        "end": 259.4
    },
    {
        "text": " Mimos los diferentes grupos de interés de la organización y bueno, vimos cada uno de ellos con, con ejemplos.",
        "start": 260.4,
        "end": 268.4
    },
    {
        "text": " Esto no sé si lo recuerdan.",
        "start": 271.4,
        "end": 274.4
    },
    {
        "text": " Este autor lo que hace es identificar siete dimensiones de la cultura.",
        "start": 274.4,
        "end": 285.4
    },
    {
        "text": " Indica que las empresas, algunas formas u otras, tienen ciertas características que se alinean más con algunos de estos puntos,",
        "start": 285.4,
        "end": 294.4
    },
    {
        "text": " pero siempre también sucede que puede tener más de uno de estos aspectos, pero hay uno que siempre resalta más que los demás.",
        "start": 294.4,
        "end": 303.4
    },
    {
        "text": " Y allí lo que hice es aquellas organizaciones que prestan mucha atención hacia los detalles, luego plantea también las que orientan a resultados, por ejemplo,",
        "start": 304.4,
        "end": 314.4
    },
    {
        "text": " el incremento de ventas o la baja de posto, porque ahora que está siempre mirando lo que es un mérico, por ejemplo.",
        "start": 314.4,
        "end": 322.4
    },
    {
        "text": " Aquellas que están orientadas hacia la gente, que uno de los ejemplos que vimos la clase pasada fue el video de Google donde podíamos visualizar eso,",
        "start": 322.4,
        "end": 332.4
    },
    {
        "text": " la que tiene una orientación a los equipos, la que mencionan siempre el trabajo en equipo y en grupo y cómo generar esa dinámica.",
        "start": 332.4,
        "end": 343.4
    },
    {
        "text": " Luego vimos aquellas organizaciones agresivas que también vimos un video con esa característica, de mayor recibidad con la expecta de otras.",
        "start": 343.4,
        "end": 354.4
    },
    {
        "text": " Vimos también, bueno, casos de organizaciones estables, que son aquellas que no tienen demasiado cambio, que siguen hacia las cosas de la misma forma y la cultura también se mantiene con estabilidad.",
        "start": 354.4,
        "end": 368.4
    },
    {
        "text": " Y luego esas organizaciones que tienen esa característica de armas innoadoras y tener más toma de arrieses.",
        "start": 368.4,
        "end": 377.4
    },
    {
        "text": " Y bueno, esa forma es que el autor identifica estas siete dimensiones de la cultura organizacional.",
        "start": 377.4,
        "end": 385.4
    },
    {
        "text": " Culturas fuertes y versos culturas débiles. La clase pasada hablamos que en algunos casos, la de tener una cultura fuerte y es favorable,",
        "start": 388.4,
        "end": 397.4
    },
    {
        "text": " porque ayudaba a, entre otras cosas, saber cómo hasta las cosas generaba con un cierto control y que luego las culturas débiles tenían su pró, por ejemplo, en el caso de una fusión o a una adquisición,",
        "start": 397.4,
        "end": 414.4
    },
    {
        "text": " que era más sencillo hacerlo si la cultura no estaba tan arraigada.",
        "start": 414.4,
        "end": 418.4
    },
    {
        "text": " Acá lo que vemos en este cuadro es la diferencia entre una cultura fuerte debil, donde las fuertes, los valores están compartidos, la cultura se transmite de comensajes consistentes,",
        "start": 419.4,
        "end": 432.4
    },
    {
        "text": " casi todos los empleados pueden citar anécdotas de la historia de la compañía, los empleados sienten una profundidad en edificación con la cultura organizacional y existe una solida conexión.",
        "start": 432.4,
        "end": 443.4
    },
    {
        "text": " Y bueno, la cultura de él es lo contrario todo eso.",
        "start": 444.4,
        "end": 447.4
    },
    {
        "text": " Lo que va sucediendo es que las empresas que tienen una alta rotación de personal van de alguna forma debilitando la cultura y cuando las empresas tienen un grupo humano que se mantiene,",
        "start": 448.4,
        "end": 460.4
    },
    {
        "text": " en el tiempo la cultura cada vez se va arraigando más y cada vez se va fotaleciendo más y las zaneras,",
        "start": 461.4,
        "end": 465.4
    },
    {
        "text": " y las zaneras se van trasladando y las simbologías empiezan a cada vez mayor y los ritos y las frases empiezan a irse arraigando dentro de lo que es la organización.",
        "start": 466.4,
        "end": 478.4
    },
    {
        "text": " Esto también ya lo vimos la clase pasada de qué forma sostenemos la cultura, proceso de selección de los empleados,",
        "start": 478.4,
        "end": 500.4
    },
    {
        "text": " miran que generalmente buscan en ese proceso de selección que sean similares a los empleados que la empresa ya tiene,",
        "start": 501.4,
        "end": 510.4
    },
    {
        "text": " entonces de esa forma se van asegurando mantener en cierta medida esa cultura organizacional.",
        "start": 510.4,
        "end": 517.4
    },
    {
        "text": " Les puse también como decíamos la clase pasada, todos los actos de los directores, la socialización,",
        "start": 517.4,
        "end": 524.4
    },
    {
        "text": " es la forma en que se van adaptándolo, se empleados a la cultura organización y muy habitual que cuando alguien ingresa una organización rápidamente le empiezan a decir",
        "start": 524.4,
        "end": 534.4
    },
    {
        "text": " ¿Qué es lo que está bien, qué es lo que está mal, qué es lo que se espera de él y en cierta manera lo van adaptando, lo van sociabilizando.",
        "start": 534.4,
        "end": 541.4
    },
    {
        "text": " Como aprende las culturas de los empleados, teníamos las anegotas, esas historias, esos ritos,",
        "start": 542.4,
        "end": 548.4
    },
    {
        "text": " que vimos un video de una forma inicial la jornada laboral que muchos no les gustó,",
        "start": 548.4,
        "end": 557.4
    },
    {
        "text": " no se se mirían como con la actividad del inicio, pero en la cada empresa tiene sus ritos y sus características.",
        "start": 557.4,
        "end": 565.4
    },
    {
        "text": " Los símbolos materiales también, los logos, los colores que tienen organizaciones parpedeños,",
        "start": 566.4,
        "end": 574.4
    },
    {
        "text": " el lenguaje, decíamos que hay empresa que tiene su lenguaje que es muy claro y que lo se identifica,",
        "start": 574.4,
        "end": 581.4
    },
    {
        "text": " que es una forma de respirirse a ciertos aspectos que son propios de esa empresa y que en un funcionario si usan esa palabra en otro ambiente",
        "start": 581.4,
        "end": 592.4
    },
    {
        "text": " no sería entendido, quizás sería malitarpretado.",
        "start": 592.4,
        "end": 596.4
    },
    {
        "text": " Bueno, las dentajas de la cultura lo que habíamos hablado de barreras contra el cambio, barreras de la diversidad,",
        "start": 596.4,
        "end": 601.4
    },
    {
        "text": " barreras de las funciones y las adquisiciones.",
        "start": 601.4,
        "end": 605.4
    },
    {
        "text": " ¿Cómo se establece entonces la cultura de organización, la filosofía de los fundadores de la organización?",
        "start": 609.4,
        "end": 615.4
    },
    {
        "text": " ¿Sapuérdan que en el video que vimos del extracto de la película al inicio hace referencia a los fundadores?",
        "start": 616.4,
        "end": 624.4
    },
    {
        "text": " Y dice por qué es nuestro fundador, es una forma de ir hacia los orígenes.",
        "start": 624.4,
        "end": 630.4
    },
    {
        "text": " Luego, en lo que hacíamos, cuando seleccionamos empleados, los buscamos que tengan características, valores y principios similar a los de nuestra organización.",
        "start": 630.4,
        "end": 639.4
    },
    {
        "text": " Luego, el comportamiento de la alta dirección, la socialización y eso es lo que mantienen entonces establece la cultura organización.",
        "start": 639.4,
        "end": 648.4
    },
    {
        "text": " ¿Alguna duda con respecto a este tema de la clase pasada?",
        "start": 649.4,
        "end": 653.4
    },
    {
        "text": " Si no hay dudas, vamos a arrancar con la unidad de la clase de hoy.",
        "start": 658.4,
        "end": 663.4
    },
    {
        "text": " Perfecto.",
        "start": 664.4,
        "end": 666.4
    },
    {
        "text": " Perfecto.",
        "start": 667.4,
        "end": 669.4
    },
    {
        "text": " Perfecto.",
        "start": 670.4,
        "end": 672.4
    },
    {
        "text": " Perfecto.",
        "start": 675.4,
        "end": 678.4
    },
    {
        "text": " Lo bueno que tiene esta materia es que todo lo que vemos aquí, luego lo van a trasladar con la realidad.",
        "start": 683.4,
        "end": 690.4
    },
    {
        "text": " Cuando empiezan a la de las notas de prensa, van a identificar, cuando empiezan a trabajar, van a visualizar algunos de estos puntos.",
        "start": 690.4,
        "end": 698.4
    },
    {
        "text": " Bueno, esto es un símbolo, esto es una frase típica de acá, pero que no están otros lados, esto es un ritmo, es una actividad que hacemos aquí con ciertos que no se indiquica.",
        "start": 698.4,
        "end": 716.4
    },
    {
        "text": " La idea es que después vayan en la práctica y en la realidad, comparando con lo que vimos teóricamente.",
        "start": 716.4,
        "end": 727.4
    },
    {
        "text": " Perfecto.",
        "start": 729.4,
        "end": 731.4
    },
    {
        "text": " Químadeo hoy, la administración en un entorno global.",
        "start": 732.4,
        "end": 736.4
    },
    {
        "text": " Muchos ya hemos hablado en las primeras clases cuando decíamos que la organización esté incierta en un entorno,",
        "start": 736.4,
        "end": 744.4
    },
    {
        "text": " dijimos que está todo muy lovalizado y que la economía se ve una afectada entre sí, que lo que sucede en una termina afectando en Sierra Media a la otra.",
        "start": 745.4,
        "end": 754.4
    },
    {
        "text": " Bueno, tenemos experiencia, verdad de crisis que ha sucedido en otros países y cómo terminan repercutiendo.",
        "start": 754.4,
        "end": 761.4
    },
    {
        "text": " Y eso, ¿por qué pasa? Porque estamos muy conectados, porque hoy en día, mediante la importación, mediante la exportación,",
        "start": 761.4,
        "end": 767.4
    },
    {
        "text": " mediante empresas que se instalan para la abastecimiento, otras que prestan servicio, está todo muy, muy interconectado.",
        "start": 768.4,
        "end": 775.4
    },
    {
        "text": " Entonces, no podemos pensar en una organización que no tenga vínculos con su entorno global hoy en día, está todo interconectado.",
        "start": 775.4,
        "end": 784.4
    },
    {
        "text": " Una forma que dice el autor Robbins, que tenemos de ver esa globalización, es ir al marcado, verdad, y reflexionar sobre",
        "start": 784.4,
        "end": 794.4
    },
    {
        "text": " cuál es el país de origen de algunos de los productos que son muy familias para nosotros.",
        "start": 795.4,
        "end": 800.4
    },
    {
        "text": " O sea, ir a un abondo, la de un supermercado, mirar y poder detectar cuál es productos son orgullos y cuáles no.",
        "start": 800.4,
        "end": 807.4
    },
    {
        "text": " Entonces ahí nos estamos dando verdad cómo existe la globalización.",
        "start": 807.4,
        "end": 813.4
    },
    {
        "text": " Uruguay tiene una baja actividad industrial con respecto a otros países.",
        "start": 813.4,
        "end": 821.4
    },
    {
        "text": " Nosotros importamos gran parte de los productos.",
        "start": 822.4,
        "end": 827.4
    },
    {
        "text": " Entonces, bueno, y nos vemos muy influidos a veces por lo que sucede en el resto del mundo.",
        "start": 827.4,
        "end": 833.4
    },
    {
        "text": " ¿Cuál es la perspectiva global?",
        "start": 836.4,
        "end": 839.4
    },
    {
        "text": " Y acá tenemos algunos conceptos que son importantes para ir viendo el tema de la clase de hoy.",
        "start": 839.4,
        "end": 847.4
    },
    {
        "text": " ¿Algún trabaja en alguna empresa que sea multinacional, que tenga su casa matriz en otro país?",
        "start": 851.4,
        "end": 857.4
    },
    {
        "text": " Yo, en Francia.",
        "start": 865.4,
        "end": 868.4
    },
    {
        "text": " Perfecto. Y todo lo que es, por ejemplo, la forma de trabajo, las buenas prácticas, todo viene desde Francia o localmente han podido realizar modificaciones.",
        "start": 868.4,
        "end": 879.4
    },
    {
        "text": " No hace tanto que estoy, pero al parecer esto todavía es en edicta combinada o de Francia.",
        "start": 882.4,
        "end": 887.4
    },
    {
        "text": " Perfecto. Un poco la clase de hoy vamos a ver eso y bueno, hay que entender cuál es el concepto que hay detrás.",
        "start": 888.4,
        "end": 895.4
    },
    {
        "text": " Porque es que viene todo armado de cierto país y no consideran demasiado.",
        "start": 895.4,
        "end": 901.4
    },
    {
        "text": " Bueno, eso es porque toman ciertas perfectivas.",
        "start": 901.4,
        "end": 905.4
    },
    {
        "text": " Y acá las vamos a ver.",
        "start": 905.4,
        "end": 908.4
    },
    {
        "text": " Bueno, en el caso de la que le comenta que es de Francia, una forma sería pensar que podríamos ya estar en el caso de Nocéntrica.",
        "start": 908.4,
        "end": 918.4
    },
    {
        "text": " ¿Qué? Aquí nos referimos con Nocéntrica, que todas las buenas prácticas son aquellas que priman del país de origen.",
        "start": 918.4,
        "end": 926.4
    },
    {
        "text": " Cuando tenemos una empresa que hace todo en base a lo que se establece por parte de su casa matriz, entonces estamos ante una mentalidad etnocéntrica.",
        "start": 926.4,
        "end": 938.4
    },
    {
        "text": " Policéntrica, sin embargo, es la creencia que los gerentes del país, Westped, utilizan las mejores enfocres y prácticas laborales.",
        "start": 938.4,
        "end": 946.4
    },
    {
        "text": " Eso es cuando cada una de las sucursales, por ejemplo, puede tomar decisiones propias, puede tener manales propios, puede hacer los ajustes que entiendan necesario para adaptar.",
        "start": 947.4,
        "end": 958.4
    },
    {
        "text": " Para adaptar aquí, a un tema muy importante que vimos la clase pasada para adaptar a la cultura.",
        "start": 958.4,
        "end": 964.4
    },
    {
        "text": " Desde imaginen que cada país tiene sus características y por tanto, quizás que una práctica que en un país es muy buena, es muy positiva, en otro país, genere su choque, genere sus ripidezes y no sea útil, quizás no genere la ganancia justamente por las diferencias punturales.",
        "start": 965.4,
        "end": 982.4
    },
    {
        "text": " Y luego el agio centrica que a mí entender, esa hacia donde tendría que dirigirse la forma de actuar, es una forma de pensamiento universalista, que se pucan usar los mejores métodos y las gente más capaz sin importar de que el lugar del mundo provadena.",
        "start": 983.4,
        "end": 1001.4
    },
    {
        "text": " ¿Qué significa esto? Y es algo que se está dando mucho, en mi opasado, tener charlas con empresarios, que tienen locaciones en varios países y mendicamos en la parte logística, la hacemos en tal país porque son muy buenos en eso y tienen un equipo muy bueno.",
        "start": 1002.4,
        "end": 1018.4
    },
    {
        "text": " La parte comercial, todo lo que es soporte, lo hacemos en este otro país porque son muy capaces porque lograron un software que es muy útil.",
        "start": 1018.4,
        "end": 1031.4
    },
    {
        "text": " Y en esa forma van considerando los diferentes países sin importar si son efectivamente de la casa matrizona.",
        "start": 1031.4,
        "end": 1040.4
    },
    {
        "text": " Pero hay muchas empresas que tienen una postura bastante rígida, es no centrica, donde desde la casa matriz se pasan todas las formas de actuar, raro todos los criterios, todos los manuales y no existe cierto margen para adaptarlo a las características culturales de otros países.",
        "start": 1041.4,
        "end": 1062.4
    },
    {
        "text": " ¿Qué es el ejemplo que ahora los voy a mandar a grupos para que lo piensen un poquito, 5 o 10 minutos solamente? ¿Qué les parece con respecto a los menú?",
        "start": 1063.4,
        "end": 1076.4
    },
    {
        "text": " Y eso es lo que me gustaría que busquen en Internet Varsi, ha hecho cierras adaptaciones o no en los diferentes países.",
        "start": 1077.4,
        "end": 1085.4
    },
    {
        "text": " No me lo dían ahora, los voy a mandar a grupos 5 minutos para que piensen si más de una vez 100% enocéntrico, si tiene algo de policéntrico, si tiene algo de geocéntrico.",
        "start": 1085.4,
        "end": 1096.4
    },
    {
        "text": " Así que los voy a mandar a grupos para que entrustes. Bueno, ya estamos retornando de los grupos.",
        "start": 1097.4,
        "end": 1110.4
    },
    {
        "text": " Encontraron información sobre Malgona.",
        "start": 1117.4,
        "end": 1121.4
    },
    {
        "text": " Algo.",
        "start": 1127.4,
        "end": 1129.4
    },
    {
        "text": " Alucas? No sé si lo queréis compartir.",
        "start": 1129.4,
        "end": 1132.4
    },
    {
        "text": " No, lo que estoy moviendo tienen productos que son clásicos de la marca y la clase Amurgesa está un idiense.",
        "start": 1132.4,
        "end": 1144.4
    },
    {
        "text": " Y por otro lado también tienen productos especiales, depende de la región en la que ten, como menúes especiales, pero que también a veces son como promociones o que tienen más márviles.",
        "start": 1144.4,
        "end": 1155.4
    },
    {
        "text": " Perfecto. Y la idea de esos productos que quizás ahora me comentan algunos. Yo creo que les doy uno que es la guarana, por ejemplo, en el caso de Brasil que tienen como bebida, si me marro aquí, si vamos a pedir seguramente no esté dentro de las leas disponibles.",
        "start": 1156.4,
        "end": 1175.4
    },
    {
        "text": " Y también algunos productos especiales, las modificaciones en cuanto al tipo de carne, cuanto a los sabores para que se adapte más a la cultura.",
        "start": 1176.4,
        "end": 1185.4
    },
    {
        "text": " ¿Alguna ejemplo?",
        "start": 1185.4,
        "end": 1188.4
    },
    {
        "text": " No sé si lo mencionaron antes, pero en India, por ejemplo, Malgona sólo tiene menudo de carne a algunos. Sólo tiene menudo de cordero.",
        "start": 1188.4,
        "end": 1197.4
    },
    {
        "text": " Perfecto, algunos tres ejemplo más. Todo lo que estamos mencionando es justamente para adaptar a las diferentes culturas y entender que no se puede aplicar 100% a la experiencia de la casa matricicla y ser la medida que se tienen que ayudar.",
        "start": 1198.4,
        "end": 1216.4
    },
    {
        "text": " ¿O bien la carne cocher en Israel?",
        "start": 1217.4,
        "end": 1222.4
    },
    {
        "text": " Perfecto. En México, por ejemplo, los sabores son distintos, los condimentos.",
        "start": 1222.4,
        "end": 1230.4
    },
    {
        "text": " ¿Qué más?",
        "start": 1234.4,
        "end": 1236.4
    },
    {
        "text": " ¿Qué más?",
        "start": 1237.4,
        "end": 1239.4
    },
    {
        "text": " Hay un texto que después les voy a compartir de Malgona, al que cuento un poco lo que es la instalación de los restaurantes y un poco también con para ver lo que son estas tres ideas que mencionamos, que la primera de ella es no céntrica, me vas solo,",
        "start": 1241.4,
        "end": 1257.4
    },
    {
        "text": " rada en la casa matriz, luego tenemos la policéntrica, verdad que tengo muy en cuenta todo lo que el país huésped tiene, y las prácticas laborales de ese país huésped, y luego la geoséntrica que es,",
        "start": 1258.4,
        "end": 1274.4
    },
    {
        "text": " tomo lo mejor de cada uno de ellos, y este texto que después les voy a compartir cuenta la historia de las diferentes instalaciones de Malgona, y como en algunos casos se adoptaron las mejores prácticas que no surgieron de la casa matriz, entre ellas y les comento,",
        "start": 1275.4,
        "end": 1293.4
    },
    {
        "text": " y les comento algunas si les interesa, ya les digo, se los voy a compartir, pero después a su vez lo pueden buscar en la red, tenían, por ejemplo, restaurantes satélites,",
        "start": 1293.4,
        "end": 1306.4
    },
    {
        "text": " verdad que eran, se llamaban mínima McDonald, y esa idea que se usa en estadios y que se usa en hospitales se originan en Singapore,",
        "start": 1306.4,
        "end": 1317.4
    },
    {
        "text": " luego todo lo que es la fuente de frío, una forma de congelarlos los alimentos y unos centros especiales para eso, vienen por lo que dice aquí, de los suecos,",
        "start": 1317.4,
        "end": 1335.4
    },
    {
        "text": " entonces es una forma de que toman verdad de otro país eso que entienden que es positivo, y luego bueno las adaptaciones de menú que fueron las que ya mencionaron, después de más de abastecimiento,",
        "start": 1335.4,
        "end": 1350.4
    },
    {
        "text": " McDonald en algunos casos trae de otros países, ciertos productos cuando entiende que la calidad de los proveedores locales no se atifacen lo que ellos establecen como el estándar,",
        "start": 1350.4,
        "end": 1363.4
    },
    {
        "text": " eso es otro punto de tener en cuenta, pero en definitiva lo que es importante que les quede claro es que existen tres posturas,",
        "start": 1363.4,
        "end": 1372.4
    },
    {
        "text": " la primera vez es la policéntica, que es cuando se basa mucho en lo que marca la casa matriz, luego, para lo mencioné mala digues, la primera vez es la enocéntrica,",
        "start": 1372.4,
        "end": 1385.4
    },
    {
        "text": " verdad que es las mejores prácticas son la del país, luego tenemos la policéntrica, la que allí tenemos que el país huésped,",
        "start": 1385.4,
        "end": 1393.4
    },
    {
        "text": " la que tiene las mejores enfocas y prácticas, y luego la geocéntrica que toman lo mejor de los mejores metos y las mejores personas, la gente más capaz sin importar el lugar del mundo donde provena,",
        "start": 1393.4,
        "end": 1409.4
    },
    {
        "text": " esas serían los tres aspectos, las empresas están en una tendencia, a ir más hacia los geocéntricos y a ir tomándolo mejor de cada una de las organizaciones,",
        "start": 1409.4,
        "end": 1423.4
    },
    {
        "text": " cuando en el caso, por ejemplo, del que mencionó que trabajaba en una organización francesa sería bueno si hay algo positivo, que sea en Uruguay que luego se pueda trasladar y aplicar en otras opusales,",
        "start": 1423.4,
        "end": 1440.4
    },
    {
        "text": " pero un poco el espíritu de CC, tratar de que se tomen lo mejor de cada una de las estructuras, de cada una de las organizaciones y que se pueda aplicar en otras.",
        "start": 1440.4,
        "end": 1451.4
    },
    {
        "text": " Y el otro punto es entender que los países tienen diferencias culturales y que eso hace que se tenga que adaptar la empresa al lugar donde está,",
        "start": 1451.4,
        "end": 1463.4
    },
    {
        "text": " en cuanto a las formas de manejarse, las formas de adecuar, y en el caso de Magdalena por ser una empresa de algún alimento, en el caso de los menú, los sabores, cada cultura tiene sus preferencias.",
        "start": 1463.4,
        "end": 1478.4
    },
    {
        "text": " ¿Alguna duda estará?",
        "start": 1479.4,
        "end": 1481.4
    },
    {
        "text": " Yo tengo una duda, si bien mencionas que sería algo positivo que de cada país se tome lo mejor que funciona en ese país y se intenta aplicar en todos,",
        "start": 1481.4,
        "end": 1493.4
    },
    {
        "text": " puede ser que a veces lo que funciona en un país bien no funcione en otro.",
        "start": 1493.4,
        "end": 1498.4
    },
    {
        "text": " Ah, puede pasar.",
        "start": 1499.4,
        "end": 1501.4
    },
    {
        "text": " Puede pasar.",
        "start": 1501.4,
        "end": 1503.4
    },
    {
        "text": " Sí sí, puede pasar que es que generen un choque cultural con el otro país, que no se ha práctico y que no tenga validez.",
        "start": 1503.4,
        "end": 1511.4
    },
    {
        "text": " Lo importante es salir de esa mentalidad que todo lo bueno va a estar solamente en la casa matriz,",
        "start": 1511.4,
        "end": 1518.4
    },
    {
        "text": " y tratar de darse cuenta que quizás exista un buen desarrollo que se pueda desarrollar en otras de las sucursales y que pueda ser utilizado para todas.",
        "start": 1518.4,
        "end": 1529.4
    },
    {
        "text": " Pero sí, las carreras culturales o las características de cada uno de los países puede hacer que no sea aplicable.",
        "start": 1529.4,
        "end": 1538.4
    },
    {
        "text": " Pero por lo menos tan alamente abierta para que en caso de que sea útil y que sirve y que realmente sea mejor la forma en que lo realizan sepa aplicar en otros,",
        "start": 1538.4,
        "end": 1550.4
    },
    {
        "text": " y no estar con esa forma cerrada de ver las cosas, de entender que solo hay que utilizar lo que viene de la casa matriz.",
        "start": 1550.4,
        "end": 1558.4
    },
    {
        "text": " Que cuando solo ponemos foco en la casa matriz, estamos ante una costura en nocent.",
        "start": 1558.4,
        "end": 1565.4
    },
    {
        "text": " ¿Alguna dudas acá?",
        "start": 1571.4,
        "end": 1573.4
    },
    {
        "text": " Bueno, seguimos.",
        "start": 1581.4,
        "end": 1583.4
    },
    {
        "text": " Estaba en torno global, alianzas comerciales regionales y mecanismos de comercio global.",
        "start": 1588.4,
        "end": 1605.4
    },
    {
        "text": " En términos generales, en un lugar, y vieron que se han planteado varios juntos con respecto a la integración de Uruguay en el Marcosur,",
        "start": 1606.4,
        "end": 1615.4
    },
    {
        "text": " ¿cuál va a ser el futuro del Marcosur? ¿Cómo nos vamos a organizar? ¿Qué ventaja tenemos por integrar el Marcosur? ¿Qué le sucede a una empresa cuando se abre una puerta nueva?",
        "start": 1615.4,
        "end": 1629.4
    },
    {
        "text": " ¿Cuándo es la empresa cuando un país genera una alianza nueva? ¿Todo el tema de los aranceles? ¿Eso aspecto es un querente que lo tiene en cuenta?",
        "start": 1629.4,
        "end": 1637.4
    },
    {
        "text": " Cuando se va a instalar incluso en otro país, analiza con qué países es más fácil el intercambio, analiza con qué países se acuerdan,",
        "start": 1637.4,
        "end": 1647.4
    },
    {
        "text": " tipo por ejemplo, arancelario, y de esa forma se tiene que ir estructurando.",
        "start": 1647.4,
        "end": 1653.4
    },
    {
        "text": " Vamos a ver algunos nombres, pero la idea del día de la prueba no se les quede tranquilo, que no se les va a consultar de tal país,",
        "start": 1654.4,
        "end": 1665.4
    },
    {
        "text": " sin integrar, tal organización, tal país, forma parte de eso, no lo vamos a preguntar, lo que sí nos interesa a nivel administrativo,",
        "start": 1665.4,
        "end": 1675.4
    },
    {
        "text": " es que es importante para un administrador conocer y para un querente conocer cuáles características hay de ese entorno global, con qué países existen alianzas,",
        "start": 1676.4,
        "end": 1690.4
    },
    {
        "text": " por todos los temas que hablamos recién, de facilidad de intercambio, de diferentes tipos de arancel,",
        "start": 1690.4,
        "end": 1699.4
    },
    {
        "text": " muchas veces van a escuchar a hablar que con algunos países tenemos grupos de exportación, entonces evitar conocer cuáles tenemos libre intercambio,",
        "start": 1699.4,
        "end": 1709.4
    },
    {
        "text": " cuáles no, cuáles tenemos grupos, cuáles tenemos arancelceros, cuáles tenemos ciertas preferencias arancelarias, y todos esos aspectos,",
        "start": 1709.4,
        "end": 1718.4
    },
    {
        "text": " que es entre a trabajar en organización y tengan un cargo de importancia, es algo que van a tener que analizar en profundidad y bueno,",
        "start": 1719.4,
        "end": 1728.4
    },
    {
        "text": " a hacerse en todos los reportes que tienen hoy en día.",
        "start": 1728.4,
        "end": 1731.4
    },
    {
        "text": " Algunas alianzas comerciales que se mencionan en el texto, bueno, por un lado está la Unión Europea, por otro lado tenemos un tratado libre comercio,",
        "start": 1732.4,
        "end": 1743.4
    },
    {
        "text": " acuerdos que hay latinoamericanos, asociaciones de naciones de su estésiático, pero como les decía, no se les va a consultar el día de la prueba ni en qué año se fundaron estas alianzas,",
        "start": 1743.4,
        "end": 1758.4
    },
    {
        "text": " ni qué países le integran, son aspectos que son interesantes para que los lean, pero si vamos a poner énfasis en los puntos anteriores,",
        "start": 1759.4,
        "end": 1770.4
    },
    {
        "text": " en las diferentes posturas existen en cuanto al entorno y a su vez sí conocimientos más generales, raso sobre el tema de las alianzas comerciales,",
        "start": 1770.4,
        "end": 1784.4
    },
    {
        "text": " pero no pierdan tiempo en lo que es año, países que integran y ese tipo de cosas porque no se lo vamos a preguntar.",
        "start": 1785.4,
        "end": 1793.4
    },
    {
        "text": " Mi canismo de comercio global, comercio global en entrenaciones no ocurre de una manera espontánea cuando surgen problemáticas comerciales,",
        "start": 1793.4,
        "end": 1803.4
    },
    {
        "text": " determinados sistemas globales aseguran de que el intercambio continúe dando suficiente épicamente, si buscan en la prensa van a ver que en algunas ocasiones se recurre a la organización mundial de comercio.",
        "start": 1804.4,
        "end": 1817.4
    },
    {
        "text": " Además los países firman una serie de acuerdos y van a ver que cuando surgen discrepancias entre el actual de los gobiernos,",
        "start": 1817.4,
        "end": 1828.4
    },
    {
        "text": " es que allí se empieza a ser mención, verdad, ciertos tratados internacionales que los países han firmado y el cumplimiento de esos tratados internacionales.",
        "start": 1828.4,
        "end": 1838.4
    },
    {
        "text": " Cuando un país firmo, un tratado internacional con otro país se compromete a cumplir con ciertos aspectos y cuando hay diferencias,",
        "start": 1838.4,
        "end": 1847.4
    },
    {
        "text": " muchas veces se recurren teniendo en cuenta esos tratados internacionales que sean firmados.",
        "start": 1847.4,
        "end": 1855.4
    },
    {
        "text": " También obviamente los cuicios inician localmente, cuando hay una respuesta local, es que se va hacia el exterior, hacia estas organizaciones específicas.",
        "start": 1859.4,
        "end": 1870.4
    },
    {
        "text": " El universo de los negocios globales, bueno acá tenemos, vieron que cuando arrancó la clase, les pregunté bueno a alguien trabajó en una multinacional, a alguien trabaja,",
        "start": 1872.4,
        "end": 1883.4
    },
    {
        "text": " en alguna empresa que tenga su matriz en otro país, el autor Robins define a corporación multinacional como aquella que hace referencia a cualquier tipo y a todos los tipos de empresa internacional que operan varios países,",
        "start": 1883.4,
        "end": 1898.4
    },
    {
        "text": " por lo que cuando una empresa operan varios países ya la considera como una corporación multinacional.",
        "start": 1898.4,
        "end": 1904.4
    },
    {
        "text": " Y ahora conocer un montón de empresas que se encuentran en ubicadas en varios países, las grandes firmas auditoras como KPMG, como Price, tienen su actuación en varios puntos.",
        "start": 1904.4,
        "end": 1919.4
    },
    {
        "text": " Eso hace que cuando una empresa Uruguay tiene una sociedad en el exterior, si sucede algo en la sociedad en el exterior se va a haber afectada de una manera u otra.",
        "start": 1920.4,
        "end": 1932.4
    },
    {
        "text": " Por eso es el tema del global y la importancia de analizar, como se afectan las organizaciones entre sí por más que sean sociedades distintas, pero están vinculadas.",
        "start": 1932.4,
        "end": 1945.4
    },
    {
        "text": " En Uruguay un caso que hizo mucho ruido, que fue el caso de Teima, salió en todos los medios de prensa que en realidad a Vengua era su casa matriz, que era un grupo español, tuvo ciertos inconvenientes y generó hace muchos años, inconvenientes en la Uruguay.",
        "start": 1946.4,
        "end": 1969.4
    },
    {
        "text": " Corporación multidomística es una corporación que descentraliza su decisiones administrativas y de otra índole en el país local.",
        "start": 1970.4,
        "end": 1981.4
    },
    {
        "text": " Entonces cuando las decisiones las puede tomar el país local podemos hablar que es una corporación multidomética, están varios lados, pero los aspectos de decisión están descentralizados.",
        "start": 1981.4,
        "end": 1994.4
    },
    {
        "text": " Muchas veces pasa que las empresas tienen ubicaciones en otros países, pero esas ubicaciones son independientes en lo que se requiera sus decisiones.",
        "start": 1994.4,
        "end": 2004.4
    },
    {
        "text": " En otros casos las decisiones se levan y son tomadas con la casa matriz.",
        "start": 2004.4,
        "end": 2011.4
    },
    {
        "text": " Luego tenemos una empresa global, que es la que centraliza sus decisiones administrativas y de otra índole en el país de origen, que esto es muy habitual, que las grandes decisiones se tomen en las empresas en la casa matriz.",
        "start": 2012.4,
        "end": 2027.4
    },
    {
        "text": " Organización transnacional, esas son las organizaciones que eliminan las carreras geográficas artificiales.",
        "start": 2028.4,
        "end": 2036.4
    },
    {
        "text": " En estos casos la organización se ve como un todo, esto es un tema contable también de consolidación, en otros aspectos juegan, pero en cierta medida es como que no hay un severita de tener un centro verdad logístico en cada país,",
        "start": 2036.4,
        "end": 2054.4
    },
    {
        "text": " sino que se hace un centro logístico, canalice la logística de todos los países, se ve toda la estructura como un todo y los funcionarios terminan siendo funcionarios de la organización transnacional y no dar algo específico,",
        "start": 2055.4,
        "end": 2071.4
    },
    {
        "text": " si bien reglamentariamente y por temas legales muchas veces, obviamente están en las planillas laborales de un país o otro, pero lo que se busca es que conceptualmente todos trabajen para un objetivo común sin tener en cuenta dando las barreras donde están posicionados físicamente los diferentes funcionarios.",
        "start": 2071.4,
        "end": 2090.4
    },
    {
        "text": " Y además toma lo que habíamos hablado de lo mejor de cada país.",
        "start": 2092.4,
        "end": 2097.4
    },
    {
        "text": " ¿Alguna duda está acá?",
        "start": 2102.4,
        "end": 2104.4
    },
    {
        "text": " Yo de un doctor.",
        "start": 2105.4,
        "end": 2107.4
    },
    {
        "text": " Sí.",
        "start": 2107.4,
        "end": 2108.4
    },
    {
        "text": " En cuanto a... ¿En cuál le has categorías que acá es de nombrar?",
        "start": 2108.4,
        "end": 2113.4
    },
    {
        "text": " Entra ahí una empresa que por ejemplo tiene centros regionales pero no en cada país yo que se tiene, una subusal que no administra solo Uruguay, sino que administra toda la tina america por él.",
        "start": 2113.4,
        "end": 2125.4
    },
    {
        "text": " Y bueno va a depender de 100 milas decisiones.",
        "start": 2126.4,
        "end": 2129.4
    },
    {
        "text": " Si las decisiones se toman solo en la casa matriz, entonces va a ser una empresa global.",
        "start": 2132.4,
        "end": 2139.4
    },
    {
        "text": " Si las decisiones van a estar descentralizadas y cada una de las unidades puede tomar sus propias decisiones, cuando hablamos decisiones a las más decisiones significativas, ¿no?",
        "start": 2139.4,
        "end": 2150.4
    },
    {
        "text": " Porque no estamos hablando de la compra de papel o estamos hablando de cuando bueno esas grandes decisiones sobre si lanzaron o lanzaron productos o de bueno si empieza a haber más descentralización de las decisiones administrativas, entonces hablamos de multígoma.",
        "start": 2151.4,
        "end": 2168.4
    },
    {
        "text": " Hay muchas organizaciones que realmente está todo muy centralizado.",
        "start": 2170.4,
        "end": 2174.4
    },
    {
        "text": " Y en ese caso hablamos de... de... de... de... de... de otro tipo de organización.",
        "start": 2175.4,
        "end": 2181.4
    },
    {
        "text": " ¿Alguna otra duda?",
        "start": 2188.4,
        "end": 2189.4
    },
    {
        "text": " Después se agrisen, ¿no? Porque por la vez es bueno, algunas decisiones se toman por parte de las subusales pero otras las toma casa matriz, ¿no?",
        "start": 2192.4,
        "end": 2201.4
    },
    {
        "text": " Pero bueno, en términos generales uno puede llegar a visualizar cuando algo es multidoméstico, verdad o cuando simplemente está regido prácticamente mayoritariamente por la casa matriz.",
        "start": 2202.4,
        "end": 2215.4
    },
    {
        "text": " A Administración en un momento global, bueno, algunos temas ya los... los fimos viendo, ¿no?",
        "start": 2218.4,
        "end": 2224.4
    },
    {
        "text": " Temas políticos y... y legales, temas vinculados al entorno económico, temas vinculados al entorno cultural, fallece si será importante, ¿no?",
        "start": 2225.4,
        "end": 2238.4
    },
    {
        "text": " Tienen en cuenta las características culturales de cada uno de los países ha pasado con algunos productos que son muy buenos y que han tenido un excelente resultado en ciertos países y sin embargo cuando se inicia ese proceso de...",
        "start": 2238.4,
        "end": 2253.4
    },
    {
        "text": " internacionalización, es muy... es muy difícil que pueda ingresar a otros países porque a veces las costumbres son... son muy muy diferentes.",
        "start": 2254.4,
        "end": 2266.4
    },
    {
        "text": " Entonces, incluso pasa hasta... hasta en países que son bastante similares como Uruguay y Argentina, yo le...",
        "start": 2266.4,
        "end": 2275.4
    },
    {
        "text": " y es comentar que trabajo en la institución financiera argentina y hacemos rondas entre... entre algunas de nuestras actividades, hacemos rondas de negocios donde exportadores argentinos presentan sus productos a importadores uruguayos.",
        "start": 2276.4,
        "end": 2291.4
    },
    {
        "text": " Y pasa que algunos productos son... de... de costumbre en... en ese país pero acá no estamos tan acostumbrándose es más difícil su... su ingreso.",
        "start": 2291.4,
        "end": 2301.4
    },
    {
        "text": " Entonces, siempre tener en cuenta el entorno cultural es importante. Luego también, obviamente que el entorno económico, no?",
        "start": 2301.4,
        "end": 2309.4
    },
    {
        "text": " Tener en cuenta de cuál es la situación económica financiera del país, cuáles son sus grandes cifras, cómo se maneja el tipo de cambio, si tienen o no, tienen a restricciones de tipo de cambio.",
        "start": 2309.4,
        "end": 2321.4
    },
    {
        "text": " Si hay salida o no hay salida de divisas, o sea, hay países en los que la distribución utilidades es más sencilla que en otras, ustedes imaginen que ustedes se inmierten en diemañanas, son querentes, deciden instalarse en otro país, pero bueno, después a fin de año van a querer hacer distribución utilidades.",
        "start": 2322.4,
        "end": 2341.4
    },
    {
        "text": " Bueno, no todos los países tienen las mismas definiciones con respecto a eso ni la misma libertad es cambiar.",
        "start": 2341.4,
        "end": 2349.4
    },
    {
        "text": " Y después, bueno, todos los temas políticos y legales también son importantes si ustedes el día de mañana, en caso de decidir ingresar a otro país también lo van a tener que considerar, ¿no?",
        "start": 2349.4,
        "end": 2362.4
    },
    {
        "text": " O sea, ¿cuáles el amparo legal que tienen, qué tanto cambia la normativa, qué seguridad le da a ese país a los empresarios, cómo se maneja la propiedad privada?",
        "start": 2362.4,
        "end": 2372.4
    },
    {
        "text": " O soy un montón de conceptos que ustedes van a tener que manejar a la hora de instalarse en otro país también.",
        "start": 2372.4,
        "end": 2380.4
    },
    {
        "text": " De mal legales a nivel de funcionarios, ¿no? Hay países que tienen una legislación que es mucho más laxa, en lo que son los derechos laborales, otros son más estrictos,",
        "start": 2381.4,
        "end": 2394.4
    },
    {
        "text": " hay algunos países donde despedir un funcionario tiene un costo diferente al de otros países, y eso no implica que no nos instalemos,",
        "start": 2394.4,
        "end": 2403.4
    },
    {
        "text": " pero sí que la estructura de costos hay que analizarla en ese contexto, ¿no?",
        "start": 2403.4,
        "end": 2408.4
    },
    {
        "text": " ¿De cuánto cuesta la mano de obra, qué cara tenteca saque, legislación, qué aportes, no?",
        "start": 2408.4,
        "end": 2417.4
    },
    {
        "text": " Tod eso siempre que están a lo en cuenta la hora de que uno se va a instalar a otro país.",
        "start": 2417.4,
        "end": 2422.4
    },
    {
        "text": " ¿Alguna dudas acá?",
        "start": 2423.4,
        "end": 2425.4
    },
    {
        "text": " ¿Dudas, consultas?",
        "start": 2429.4,
        "end": 2431.4
    },
    {
        "text": " No, gran.",
        "start": 2432.4,
        "end": 2434.4
    },
    {
        "text": " Bueno, ahora no sé si todos tienen el texto de Robbins, pero me gustaría que analicen esto y los voy a mandar nuevamente a grupos,",
        "start": 2437.4,
        "end": 2446.4
    },
    {
        "text": " que son las cinco dimensiones de la cultura nacional.",
        "start": 2446.4,
        "end": 2451.4
    },
    {
        "text": " El autor define ciertos aspectos, y dice que en algunos países es más individualista, en otros es más colectivista,",
        "start": 2451.4,
        "end": 2461.4
    },
    {
        "text": " en algunos hay mucha distancia de poder, en otros es de poca distancia de poder, y plantea, yo sí ven, se los voy a mostrar acá.",
        "start": 2461.4,
        "end": 2469.4
    },
    {
        "text": " Lantea cinco puntos, que me gustaría que los analicen en forma colectiva, después lo vemos para ver qué les da en ese análisis grupal,",
        "start": 2470.4,
        "end": 2483.4
    },
    {
        "text": " los amagióricariamente que características tienen en función de los cinco puntos, de las cinco dimensiones de la cultura.",
        "start": 2483.4,
        "end": 2490.4
    },
    {
        "text": " Así que los voy a mandar nuevamente a grupos y vamos a compartir.",
        "start": 2491.4,
        "end": 2495.4
    },
    {
        "text": " Bueno, vamos a retornar de los grupos, voy a compartir pantalla.",
        "start": 2495.4,
        "end": 2503.4
    },
    {
        "text": " Vamos a esperar a que te ingresen.",
        "start": 2515.4,
        "end": 2518.4
    },
    {
        "text": " Bueno, vamos a hacerlo de la siguiente forma.",
        "start": 2526.4,
        "end": 2536.4
    },
    {
        "text": " Lo primero que vamos a hacer es una votación entre ustedes, levanten la mano, los que entienden que la cultura, en el caso ustedes, no, no en el caso Uruguay, en el caso ustedes personal, los que entienden que son más individualistas.",
        "start": 2536.4,
        "end": 2554.4
    },
    {
        "text": " Ahora, si levantan la mano,",
        "start": 2556.4,
        "end": 2559.4
    },
    {
        "text": " y ahí va uno, dos, tres manos por ahora,",
        "start": 2560.4,
        "end": 2581.4
    },
    {
        "text": " vamos levantando la mano, los que piensan que es individualista.",
        "start": 2582.4,
        "end": 2587.4
    },
    {
        "text": " Hablando a nivel personal, ¿no? Ustedes como se mueven.",
        "start": 2590.4,
        "end": 2595.4
    },
    {
        "text": " Bueno, en individualista, por ahora van cuatro manos levantadas. Vamos a ver ahora quienes sienten que trabajan de una forma más colectiva que son colectivistas.",
        "start": 2597.4,
        "end": 2606.4
    },
    {
        "text": " Bueno, bueno, la no colectivista.",
        "start": 2612.4,
        "end": 2618.4
    },
    {
        "text": " Amdea más bien.",
        "start": 2629.4,
        "end": 2631.4
    },
    {
        "text": " Bueno, les comiendo un poquito a que se refiere con con esto, ¿no?",
        "start": 2631.4,
        "end": 2638.4
    },
    {
        "text": " En el caso individualista lo que dice es que la persona solo se va a interesar de sus propios intereses de lo que le pasa a sí mismo, y a su vez de su entorno más cercano, de lo que se le dice el primer círculo, ¿no?",
        "start": 2639.4,
        "end": 2650.4
    },
    {
        "text": " Esa, esas personas delazo, delazo más directo.",
        "start": 2650.4,
        "end": 2654.4
    },
    {
        "text": " El colectivista, sin embargo, que es el que ustedes optaron, lo que dicen es que a la gente les gusta partencer a un grupo y que busca protección dentro de ese propio grupo, ¿no?",
        "start": 2654.4,
        "end": 2667.4
    },
    {
        "text": " El autor plantea algunos países que tienen características más individualistas, entre ellos señalan a Estados Unidos, a Canadá, a Australia, y luego plantea que hay otros países como el caso de México que por el contrario tiene menos individualismo y va más hacia el colectivo.",
        "start": 2667.4,
        "end": 2687.4
    },
    {
        "text": " Lo tenemos el segundo punto que ya va más allá de lo que son los intereses, sino lo que plantea en las formas de organización, en las formas de trabajo, como es el tema de la distancia de poder irrecían ingreser a uno de los grupos y estuvimos conversando un poco sobre este punto.",
        "start": 2688.4,
        "end": 2709.4
    },
    {
        "text": " Me gustaría ahora sí que va en todos la mano y vamos a levantar la mano aquellos que piensan en que existe mucha distancia del poder.",
        "start": 2709.4,
        "end": 2721.4
    },
    {
        "text": " 4 manos levantadas y quienes piensan que hay poca distancia del poder.",
        "start": 2740.4,
        "end": 2746.4
    },
    {
        "text": " Ganó poca distancia. Yo siento que actualmente hay una tendencia a disminuir la distancia del poder y eso un poco lo estuvimos hablando en el grupo que ingresé, que ahora estamos tratando de tratando ese tema.",
        "start": 2746.4,
        "end": 2771.4
    },
    {
        "text": " Cada vez más tratamos de igual e igual entre los superiores, no existe un temor de aproximarse a los superiores, no sé si alguno tiene alguna experiencia personal.",
        "start": 2772.4,
        "end": 2787.4
    },
    {
        "text": " Alguien que quiera contar alguna experiencia, Lucas.",
        "start": 2788.4,
        "end": 2799.4
    },
    {
        "text": " Bueno, me llego a levantar la mano. Alguien que quiera contar alguna experiencia.",
        "start": 2802.4,
        "end": 2814.4
    },
    {
        "text": " Yo por ejemplo personalmente entiendo que en mi primer trabajo, quizás que había como más distancia del poder y que a medida que fue pasando el tiempo y en los nuevos trabajos, cada vez fue chica nomás esa distancia del poder.",
        "start": 2815.4,
        "end": 2832.4
    },
    {
        "text": " Y bueno, un poco la forma de trabajo está llevando a que haya verdad no tanta desigualdad que no existe a temor, en aproximarse, comunicar, dar opiniones, dar ideas.",
        "start": 2832.4,
        "end": 2846.4
    },
    {
        "text": " Y bueno, este autor plantea algunos países donde hay mucha distancia del poder, como México, sin la public Francia, y Estados Unidos y suencia como países con poca distancia del poder.",
        "start": 2847.4,
        "end": 2860.4
    },
    {
        "text": " El elevador, Cheso, le inserte nombre. ¿Qué les parece? A ningun que quiera comentar.",
        "start": 2860.4,
        "end": 2878.4
    },
    {
        "text": " Nos gustan a los riesgos a los uruguayos.",
        "start": 2879.4,
        "end": 2887.4
    },
    {
        "text": " Nos gustan los riesgos y creo que se estonda el caso de Francia que vas.",
        "start": 2887.4,
        "end": 2893.4
    },
    {
        "text": " Ahí me ha costado también un cultural en la estabilidad de Uruguay que artes y trabajos un problema grave, eso no es tan fácil, al reconvertirte.",
        "start": 2893.4,
        "end": 2904.4
    },
    {
        "text": " Es una visión muy personal, pero se llama fácil. ¿Qué es esa opción?",
        "start": 2905.4,
        "end": 2910.4
    },
    {
        "text": " Es lo que estamos buscando, justamente, de opinar entre todos y coincido con lo que tú asfirmas.",
        "start": 2910.4,
        "end": 2918.4
    },
    {
        "text": " Por ahí, ese aquí el plantea que el uruguayo no es muy innovador. ¿Qué más?",
        "start": 2921.4,
        "end": 2930.4
    },
    {
        "text": " Igual en Uruguay no sé de cuántos años para atrás, pero se ha formado un buen ambien de empresas tecnológicas,",
        "start": 2931.4,
        "end": 2945.4
    },
    {
        "text": " nuevas que han innovado en sus propios, por lo menos en el ámbito tecnológico. Yo creo que es riesgo si, pero medido.",
        "start": 2945.4,
        "end": 2955.4
    },
    {
        "text": " Si justamente el sector tecnológico tiene ciertas características de esas con un poco diferente a la mayoría de los trabajos.",
        "start": 2956.4,
        "end": 2966.4
    },
    {
        "text": " Una coincido con ti, que ha tenido un gran empuje innovador y que ama se caracteriza por eso y que las que han tenido éxitos ha sido gracias a la innovación.",
        "start": 2966.4,
        "end": 2978.4
    },
    {
        "text": " Y otra que hay una necesidad de fuentes laborales que quizás que no pasa en otras áreas, en todo lo que este tecnológico continuamente se necesitan más funcionarios y quizás que incluso la rotación es más alta y quizás que no sea tan preocupante para una persona de el sector tecnológico hacer un cambio laboral.",
        "start": 2979.4,
        "end": 3001.4
    },
    {
        "text": " Y además, los sectores, el poder reenganjar con otra actividad, la paz que tiene plazos diferentes y posibilidades diferentes.",
        "start": 3002.4,
        "end": 3011.4
    },
    {
        "text": "Any examen de tu pipeline saludable, no necesito哪ja làm eso ni de esa para chamar ese contexto.",
        "start": 3012.4,
        "end": 3021.4
    },
    {
        "text": " y comercios, pero bueno creo que en términos generales se mantiene que al uruguayo no",
        "start": 3021.4,
        "end": 3031.88
    },
    {
        "text": " le gusta la mi variedad, creo que el uruguayo se sienta incómodo ante situaciones de riesgos,",
        "start": 3031.88,
        "end": 3039.1600000000003
    },
    {
        "text": " como que hay un rechazo hacia la incertidumna, pero bueno en cada uno de los grupos lo habrán",
        "start": 3039.1600000000003,
        "end": 3046.44
    },
    {
        "text": " conversado, quizás se llegan como se en el gente, pues hemos incluso buscado estudios que seguramente los hay",
        "start": 3046.44,
        "end": 3053.64
    },
    {
        "text": " y que analicen este aspecto, luego tenemos el tema de la omisión personal, entonces allí tenemos",
        "start": 3053.64,
        "end": 3064.12
    },
    {
        "text": " algunos países que ponen foco en la omisión personal que en ese sentido son muy competitivos,",
        "start": 3064.12,
        "end": 3071.56
    },
    {
        "text": " verdad y que buscan justamente al grito dinero, bienes materiales y competir para ello y luego aquellos que",
        "start": 3071.56,
        "end": 3079.7999999999997
    },
    {
        "text": " procuran tener relaciones, cuántos ustedes tienen una fuerte ambición personal que prima ante",
        "start": 3079.7999999999997,
        "end": 3089.16
    },
    {
        "text": " lo relacionan, una manadimentada, dos, alguien por ejemplo dejaría un aumento porque no se lo van a",
        "start": 3089.16,
        "end": 3104.52
    },
    {
        "text": " otro y entiende que se lo merecía a la otra persona o para no quedar mal como un compañero o lo que",
        "start": 3104.52,
        "end": 3111.72
    },
    {
        "text": " sea, bueno un poco va por hici lado, cuatro manos me han levantado para mición personal, procuración de",
        "start": 3111.72,
        "end": 3123.08
    },
    {
        "text": " relaciones, bajamos la mano en los que teníamos, vamos a procuración de relaciones ahora,",
        "start": 3123.08,
        "end": 3128.3599999999997
    },
    {
        "text": " que prevarijan los valores, como voy a la relación humana y el interés en los demás,",
        "start": 3136.04,
        "end": 3140.64
    },
    {
        "text": " pocos, estamos dando pocos igual de los veintisiete, hay muy poquitas manos levantadas,",
        "start": 3141.72,
        "end": 3151.56
    },
    {
        "text": " pero bueno un poco justamente lo que se mire es eso, aquellos que buscan al grito dinero,",
        "start": 3154.04,
        "end": 3160.8799999999997
    },
    {
        "text": " bienes materiales que son muy competitivos, versus aquellos que le importa más el humano,",
        "start": 3160.8799999999997,
        "end": 3165.12
    },
    {
        "text": " los relacionales, grupos, esa experiencia humana, el salida de tener un compañero cuando se entiende",
        "start": 3165.12,
        "end": 3174.12
    },
    {
        "text": " que se injusto, ¿no?",
        "start": 3174.12,
        "end": 3174.92
    },
    {
        "text": " Yo creo que puede haber gente que le pasa como es que le puede pasar como a mí, en realidad yo trabajo con",
        "start": 3181.16,
        "end": 3187.96
    },
    {
        "text": " gente que no son del tipo de gente de hacer una injusticia contra un empleado, entonces es",
        "start": 3187.96,
        "end": 3197.56
    },
    {
        "text": " difícil imaginarte porque no si no un gasto hice en una situación racino,",
        "start": 3197.56,
        "end": 3202.08
    },
    {
        "text": " entonces trabajar así, además depende del rubro en el que trabajes también,",
        "start": 3203.8,
        "end": 3209.44
    },
    {
        "text": " pero hay algunos que son más competitivos que otros, hay algunos rubros que son pocas las",
        "start": 3209.44,
        "end": 3216.8
    },
    {
        "text": " posibilidades, como acceder esa posibilidad, ¿no?",
        "start": 3216.8,
        "end": 3220.92
    },
    {
        "text": " ¿Hasta qué grado competir?",
        "start": 3222.92,
        "end": 3224.5600000000004
    },
    {
        "text": " Paso a veces incluso que hay personas que no se presentan en un concurso porque entienden que",
        "start": 3226.92,
        "end": 3232.4
    },
    {
        "text": " otra lo merece más y dejan del lado de lo que son misión personal,",
        "start": 3232.4,
        "end": 3236.92
    },
    {
        "text": " quizás en algún otro trabajo, algunos escuchado alguna historia de esas,",
        "start": 3238.6000000000004,
        "end": 3242.6800000000003
    },
    {
        "text": " ¿no? de bueno, su fiota lo oportunidad de trabajo pero no me presenté porque mi sector entiendo",
        "start": 3242.68,
        "end": 3247.7999999999997
    },
    {
        "text": " que tal persona que se va a presentar y no quiero que armalo, ¿no?",
        "start": 3247.7999999999997,
        "end": 3252.24
    },
    {
        "text": " Es un poco a veces sucede, luego tenemos orientación en largo plazo cuando las personas están",
        "start": 3253.8399999999997,
        "end": 3259.72
    },
    {
        "text": " todo el tiempo mirando en el futuro, y luego en el corto plazo las personas valoran las",
        "start": 3259.72,
        "end": 3266.8799999999997
    },
    {
        "text": " tradiciones y el pasado, y ahí tenemos los dos ejemplos.",
        "start": 3266.88,
        "end": 3271.36
    },
    {
        "text": " Bueno, algunas dudas acá, bueno, ¿qué es importante de esto que conozcan?",
        "start": 3276.6800000000003,
        "end": 3282.2400000000002
    },
    {
        "text": " ¿Cuáles son las cinco dimensiones? Y que entiendan dentro de cada una de esas dimensiones,",
        "start": 3282.2400000000002,
        "end": 3288.96
    },
    {
        "text": " los dos tipos que hay, obviamente no les vamos a consultar si Estados Unidos es inigualista o",
        "start": 3288.96,
        "end": 3295.84
    },
    {
        "text": " es colectivista o si Italia verdad está en un punto medio o no lo está, un poco para que",
        "start": 3295.84,
        "end": 3302.08
    },
    {
        "text": " focalicen su estudio y no pierdan tiempo en aspectos que no suman lo que es lo que es la administración,",
        "start": 3302.08,
        "end": 3311.0
    },
    {
        "text": " siempre el foco va a ser justamente de aquellos aspectos que sean más relevantes.",
        "start": 3311.0,
        "end": 3317.04
    },
    {
        "text": " ¿Alguna dudas acá?",
        "start": 3318.04,
        "end": 3322.2799999999997
    },
    {
        "text": " Bueno, vamos a ver ahora estos puntos, ¿no?",
        "start": 3327.08,
        "end": 3329.92
    },
    {
        "text": " ¿Qué es el capital intelectual y conocimiento de los negocios internacionales y la capacidad",
        "start": 3329.92,
        "end": 3334.56
    },
    {
        "text": " de comprender cómo funciona las empresas en una escala global?",
        "start": 3334.56,
        "end": 3338.2799999999997
    },
    {
        "text": " Hay personas que tienen una gran habilidad de comprender justamente de ver la organización",
        "start": 3338.2799999999997,
        "end": 3344.08
    },
    {
        "text": " como un todo y analizar de qué forma se puede llegar a vincular en una forma global.",
        "start": 3344.08,
        "end": 3350.64
    },
    {
        "text": " Luego, el capital psicológico, la capacidad de apertura a nuevas ideas y experiencias,",
        "start": 3350.64,
        "end": 3357.4
    },
    {
        "text": " hay personas que por el miedo al riesgo, por su aversión, también al riesgo y por sus experiencias",
        "start": 3357.4,
        "end": 3365.4
    },
    {
        "text": " pasadas, quizás que no está tan abierto a nuevas ideas y experiencias y ese capital psicológico es",
        "start": 3365.4,
        "end": 3371.96
    },
    {
        "text": " importante. Luego, el capital social, la capacidad para establecer conexiones y desarrollar",
        "start": 3371.96,
        "end": 3378.4
    },
    {
        "text": " relaciones de confianza con las personas que son distintas, pensemos que si vamos a trabajar",
        "start": 3378.4,
        "end": 3383.16
    },
    {
        "text": " con personas de otros países, es fundamental poder romper esas barreras que va a haber seguramente",
        "start": 3383.16,
        "end": 3389.92
    },
    {
        "text": " culturales y poder interactuar en base a la honestidad, en base a nuestra forma de ser con las",
        "start": 3389.92,
        "end": 3396.8
    },
    {
        "text": " personas y poder generar justamente esos lazos de confianza.",
        "start": 3396.8,
        "end": 3400.04
    },
    {
        "text": " Aquí en esta parte lo que vemos es las formas que tiene que tiene una empresa en",
        "start": 3403.6400000000003,
        "end": 3410.32
    },
    {
        "text": " entrar en un entorno global. La inversión mínima es cuando yo tengo una abastecimiento global.",
        "start": 3410.32,
        "end": 3416.6400000000003
    },
    {
        "text": " Cuando hablamos de una abastecimiento global es cuando yo, por ejemplo, empezo a importar un",
        "start": 3416.6400000000003,
        "end": 3421.6800000000003
    },
    {
        "text": " producto que necesito. Ustedes pensarán, bueno, pero es algo medio básico, pero sucede que muchas",
        "start": 3421.68,
        "end": 3429.04
    },
    {
        "text": " veces las empresas compran en plaza productos que si los compraran, importando, saldrían mucho menos.",
        "start": 3429.04,
        "end": 3435.7599999999998
    },
    {
        "text": " Hoy en día hay mucha información y eso es lo lindo y los invito a que siempre ustedes aprovechen",
        "start": 3436.48,
        "end": 3443.2
    },
    {
        "text": " la información que tiene porque hoy en día realmente uno puede buscar el precio de los productos,",
        "start": 3443.2,
        "end": 3449.64
    },
    {
        "text": " uno puede mandar un mail y consultar cuánto sale uno puede pedir una cotización. Antes,",
        "start": 3449.64,
        "end": 3455.16
    },
    {
        "text": " imagínen que era muy complejo, había que viajar, muy poca gente viajaba al exterior, muy poca gente",
        "start": 3455.16,
        "end": 3462.6
    },
    {
        "text": " conocía a los productos que se estaban vendiendo. Hoy en día es muy fácil traer un repuesto,",
        "start": 3462.6,
        "end": 3468.8799999999997
    },
    {
        "text": " importar un biena y que simplemente contactarse con un despachante aduana. Entonces la primer parte es",
        "start": 3468.8799999999997,
        "end": 3476.3199999999997
    },
    {
        "text": " lograr un abastecimiento global en caso de que obviamente la empresa lo necesite. Hay algunos",
        "start": 3476.32,
        "end": 3482.2000000000003
    },
    {
        "text": " productos que su costo de traslado está alto que no justifica muchas veces su importación. Entonces,",
        "start": 3482.2000000000003,
        "end": 3488.2400000000002
    },
    {
        "text": " a veces es más conveniente comprar en plaza. Luego tenemos, rató a la parte de exportación,",
        "start": 3488.2400000000002,
        "end": 3496.96
    },
    {
        "text": " importación, otorgamiento de licencia, franquicia, que ahora lo vamos a ver. Luego tenemos la",
        "start": 3496.96,
        "end": 3503.4
    },
    {
        "text": " alianza estratégica que también vamos a ver ejemplo, la subsidiaria en el extranjero que también",
        "start": 3503.4,
        "end": 3509.4
    },
    {
        "text": " vamos a ver en ejemplo. Y cuando estamos hablando justamente de estos últimos puntos de la alianza",
        "start": 3509.4,
        "end": 3514.92
    },
    {
        "text": " estratégica y de la suciencia en el tráquero es que estamos refiriendo a una inversión global ya",
        "start": 3514.92,
        "end": 3521.12
    },
    {
        "text": " mucho más significativa. Abastecimiento global es la adquisición de materia prima o fuerza laboral en",
        "start": 3521.12,
        "end": 3531.44
    },
    {
        "text": " cualquier marcado internacional que los ofrezca más barato. Entonces lo que lo que se va a hacer es buscar",
        "start": 3531.44,
        "end": 3537.84
    },
    {
        "text": " el producto que yo necesito y comparar el precio con otros países y esa forma accedera.",
        "start": 3537.84,
        "end": 3547.7200000000003
    },
    {
        "text": " Franquicia. Bueno, acá es un tema súper interesante el tema de la franquicia. Uruguay no teníamos",
        "start": 3549.88,
        "end": 3557.4
    },
    {
        "text": " tantas franquicias. Ahora tenemos muchas más franquicias en funcionamiento. Tenemos una cámara",
        "start": 3557.4,
        "end": 3564.96
    },
    {
        "text": " de franquicias que nuclea a las diferentes franquicias. Ahora hay una página web que si",
        "start": 3564.96,
        "end": 3572.56
    },
    {
        "text": " alguno está por allí la puede buscar que justamente de la cámara de franquicias donde",
        "start": 3572.56,
        "end": 3576.36
    },
    {
        "text": " donde está el listado. Si alguno le interesa el tema o sueñe algún día con tener una franquicia,",
        "start": 3576.36,
        "end": 3584.12
    },
    {
        "text": " esas incluso hasta una feria de franquicias donde se ven las diferentes franquicias que hay y la",
        "start": 3584.12,
        "end": 3588.92
    },
    {
        "text": " posibilidad de dar las vidlas. El día mañana si ustedes son querentes y tienen un modelo de negocio",
        "start": 3588.92,
        "end": 3596.3599999999997
    },
    {
        "text": " que sea interesante pueden ver la forma de franquicia. Uruguay empezó con ese tema. ¿Cuáles",
        "start": 3596.3599999999997,
        "end": 3605.68
    },
    {
        "text": " les parece que son las desventajas de una franquicia? ¿Por qué motivo les parece que un empresario",
        "start": 3605.68,
        "end": 3611.0
    },
    {
        "text": " podría decir no me gustaría tener una franquicia? Y después vamos a dar algunos aspectos positivos",
        "start": 3611.0,
        "end": 3619.88
    },
    {
        "text": " de las franquicias. ¿No perdería uno como el control de su imagen en cierta forma ya que se",
        "start": 3619.88,
        "end": 3629.24
    },
    {
        "text": " expandería tanto que se ramificaría las decisiones en un montón de cosas? A tu tuecidas del lado",
        "start": 3629.24,
        "end": 3637.12
    },
    {
        "text": " es de si tuvar más la franquicia. Sí, exacto. Claro, ahí lo que se hace generalmente es un contrato,",
        "start": 3637.12,
        "end": 3644.52
    },
    {
        "text": " el contrato es muy rígido y establece una serie de condiciones que tienen que cumplir la otra parte y",
        "start": 3644.52,
        "end": 3650.7999999999997
    },
    {
        "text": " si el franquicia o no las cumple pierre su derecho a la franquicia. Por ejemplo, si yo tengo una",
        "start": 3650.7999999999997,
        "end": 3658.24
    },
    {
        "text": " cafetería y quiero que esa cafetería la tenga otra otra persona pero en otra localidad, por ejemplo,",
        "start": 3658.24,
        "end": 3664.7999999999997
    },
    {
        "text": " en el interior porque yo la tengo un otro vídeo, lo que hago es establecer estándares de calidad",
        "start": 3664.8,
        "end": 3670.2400000000002
    },
    {
        "text": " seguramente y le haga utilizar los mismos proveedores que yo utilizo o en caso que utilizo un",
        "start": 3670.2400000000002,
        "end": 3676.36
    },
    {
        "text": " proveedor local lo validaría. ¿Rade eso? Lo que se hace generalmente se establecen, por ejemplo,",
        "start": 3676.36,
        "end": 3683.32
    },
    {
        "text": " obligaciones en cuando lo que es los muebles que se usan en el lugar, la decoración, ¿no? Y todo",
        "start": 3683.32,
        "end": 3691.52
    },
    {
        "text": " eso queda por escrito y cuando hay un incumplimiento simplemente se le retira el derecho.",
        "start": 3691.52,
        "end": 3698.84
    },
    {
        "text": " Bueno, hay a la nunte pa de ganancias.",
        "start": 3709.72,
        "end": 3712.0
    },
    {
        "text": " Ahí es verdad que existe un porcentaje generalmente de la facturación que se establece, que hay que dar",
        "start": 3712.0,
        "end": 3723.28
    },
    {
        "text": " la empresa que armula la franquicia, entonces yo no me quedo con el 100% de mi facturación,",
        "start": 3723.28,
        "end": 3730.0
    },
    {
        "text": " tengo un porcentaje que tengo que dar. Generalmente se maneja una parte fija y una parte con porcentaje,",
        "start": 3730.0,
        "end": 3738.24
    },
    {
        "text": " o sea que todos los meses hay que pasar cierto dinero por los costos de gestión de esa franquicia y",
        "start": 3738.7999999999997,
        "end": 3746.16
    },
    {
        "text": " bueno, por todo el no ojau y después de haber una parte de porcentaje. Y al inicio hay como una",
        "start": 3746.16,
        "end": 3752.7599999999998
    },
    {
        "text": " llave un dinero inicial o en otros casos se establece una inversión mínima para poder tener la",
        "start": 3752.7599999999998,
        "end": 3759.3199999999997
    },
    {
        "text": " franquicia. Bueno, la ventaja que tiene la franquicia es que ya está todo organizado,",
        "start": 3759.32,
        "end": 3768.1200000000003
    },
    {
        "text": " ya está todo previsto, todo, es algo que funcionó, que ya tiene todo un modelo de negocio armado,",
        "start": 3768.1200000000003,
        "end": 3775.28
    },
    {
        "text": " que ya tiene logo, que ya tiene símbolos, que ya tiene colores, verdad y todo ya armado y eso",
        "start": 3775.28,
        "end": 3783.0800000000004
    },
    {
        "text": " no deja de ser una ventaja. La desventaja es que bueno, es algo muy estructurado, como",
        "start": 3783.08,
        "end": 3790.2799999999997
    },
    {
        "text": " decía no ustedes por allí por el chat, es algo muy rígido, tenemos margen muy escaso,",
        "start": 3790.2799999999997,
        "end": 3797.68
    },
    {
        "text": " a veces para realizar cambios, tenemos que muchas veces utilizar los proveedores que nos indican y",
        "start": 3797.68,
        "end": 3808.2
    },
    {
        "text": " no tenemos necesidad de libertad de elegir nuestros proveedores, tenemos a veces que aceptar",
        "start": 3808.2,
        "end": 3815.3599999999997
    },
    {
        "text": " ciertos temas de la imagen, de la marca, de los colores, que quizás que no sean confortables",
        "start": 3815.3599999999997,
        "end": 3821.2
    },
    {
        "text": " para nosotros. Bueno, todos son algunos de los aspectos neativos, como positivo lo que les decía,",
        "start": 3821.2,
        "end": 3827.12
    },
    {
        "text": " la franquicia es algo que está testiado y se supone que si lanzó ese producto para que se",
        "start": 3827.12,
        "end": 3834.52
    },
    {
        "text": " instale en otras localidades es porque le fue bien en la localidad y bueno, obviamente que",
        "start": 3834.52,
        "end": 3841.0
    },
    {
        "text": " tiene un uso, bueno, se tiene un montón de dar ranientas que nos daban para trabajar, que",
        "start": 3841.0,
        "end": 3847.08
    },
    {
        "text": " poder, el día que no sé si alguno tiene algún emprendimiento personal, pero cuando una ranga con",
        "start": 3847.08,
        "end": 3853.84
    },
    {
        "text": " una idea y luego esta idea le empieza a plasmar en un montón de gestiones que no hace dentro",
        "start": 3853.84,
        "end": 3861.2
    },
    {
        "text": " de la organización y cada una de esas cosas lleva tiempo y lleva dinero, o sea, decir bueno,",
        "start": 3861.2,
        "end": 3867.2
    },
    {
        "text": " que eso es lo que voy a utilizar y compro en su buena medida y elegí los proveedores quizás",
        "start": 3867.2,
        "end": 3873.3199999999997
    },
    {
        "text": " que se eligieron un montón anteriormente que no funcionaron y que costaron y etcétera,",
        "start": 3873.3199999999997,
        "end": 3878.72
    },
    {
        "text": " entonces bueno, a todas esas recorridos cuando vamos por el sistema de franquicia ya está",
        "start": 3878.72,
        "end": 3884.3199999999997
    },
    {
        "text": " hecho, entonces esa es un poco la ventaja.",
        "start": 3884.3199999999997,
        "end": 3888.12
    },
    {
        "text": " Nos pasan el conocimiento, el definitiva también, el cómo hacer las cosas y a veces sucede",
        "start": 3892.04,
        "end": 3900.7999999999997
    },
    {
        "text": " que las franquicias no funcionan porque hay productos que en algunas localidades son muy positivos",
        "start": 3900.7999999999997,
        "end": 3907.3199999999997
    },
    {
        "text": " y en otras no y a veces pasa por aspectos demográficos, por eso que es importante todos los estudios",
        "start": 3907.3199999999997,
        "end": 3913.3199999999997
    },
    {
        "text": " en el mercado fructo antes de la cestaresión.",
        "start": 3913.32,
        "end": 3916.36
    },
    {
        "text": " Otra herramienta de licencia, una organización da otra el derecho a fabricar o vender sus productos",
        "start": 3919.0,
        "end": 3925.6000000000004
    },
    {
        "text": " usando su tecnología o especificaciones de producción.",
        "start": 3925.6000000000004,
        "end": 3929.32
    },
    {
        "text": " A veces eso sucede que se dice, bueno, yo te descone la licencia para que puedas vender",
        "start": 3929.32,
        "end": 3934.48
    },
    {
        "text": " mis productos, obviamente con todas las restricciones y lo que entienda, ¿verdad?",
        "start": 3934.48,
        "end": 3942.4
    },
    {
        "text": " La licencia que se le enjeque.",
        "start": 3942.52,
        "end": 3944.4
    },
    {
        "text": " Importación y exportación, bueno, la importación es la adquisición de productos fabricados en el extranjero",
        "start": 3947.6800000000003,
        "end": 3953.7200000000003
    },
    {
        "text": " para vendarlos localmente, lo que decíamos cuando nosotros necesitamos ciertos productos",
        "start": 3953.7200000000003,
        "end": 3960.84
    },
    {
        "text": " que en Uruguay no se producen o que quizás sean más costosos o por temas de calidad o por temas",
        "start": 3960.84,
        "end": 3966.36
    },
    {
        "text": " de diseño, uno puede importarlos en el exterior, teniendo en cuenta todos los costos de importación",
        "start": 3966.36,
        "end": 3974.32
    },
    {
        "text": " que van a ser menores dependiendo de los acuaros a rancelarios que existan con ese país.",
        "start": 3974.32,
        "end": 3979.2400000000002
    },
    {
        "text": " Y luego tenemos la exportación Uruguay que exporta mayoritariamente.",
        "start": 3981.2400000000002,
        "end": 3986.1200000000003
    },
    {
        "text": " Ganado. Muchos como de ticito, lo que ha ganado, todo lo que es granos, toda la parte también",
        "start": 3986.12,
        "end": 4000.92
    },
    {
        "text": " deselulosa ahora con las plantas deselulosas. Así, bueno, mayoritariamente eso es lo que estamos",
        "start": 4000.92,
        "end": 4009.92
    },
    {
        "text": " aportando. Alianza estratégica, sociedad dentro de una organización y uno varias empresas extranjeras,",
        "start": 4009.92,
        "end": 4023.0
    },
    {
        "text": " en la cual todas comparten sus recursos y conocimientos para desarrollo de nuevos productos o la",
        "start": 4023.0,
        "end": 4028.6800000000003
    },
    {
        "text": " edificación instalación de producción. A muchas veces sucede que las empresas generan una",
        "start": 4028.6800000000003,
        "end": 4034.04
    },
    {
        "text": " alianza para un objetivo puntual. En ese caso lo que hacen es comparten sus recursos, que cuando",
        "start": 4034.04,
        "end": 4041.32
    },
    {
        "text": " hagamos de recursos hablamos de instalaciones, personas, no solo son recursos económicos,",
        "start": 4041.32,
        "end": 4048.8
    },
    {
        "text": " también a veces ahí intangible, de los conocimientos que se comparten entre ellos, para desarrollar",
        "start": 4048.8,
        "end": 4055.0
    },
    {
        "text": " nuevos productos o la edificación instalación de producción.",
        "start": 4055.0,
        "end": 4059.04
    }
]