[
    {
        "text": " en nuestra faceta de ilosente, tanto valería como yo somos docentes de la",
        "start": 0.0,
        "end": 7.6000000000000005
    },
    {
        "text": " facultad de ciencia económica y administración. Facultad que da forma y",
        "start": 7.6000000000000005,
        "end": 17.48
    },
    {
        "text": " da programa a este curso de administración general para ingenieros, que en",
        "start": 17.48,
        "end": 23.28
    },
    {
        "text": " intercambios que hacemos los docentes y en apoyo a unidades curriculares que no",
        "start": 23.28,
        "end": 28.96
    },
    {
        "text": " son específicas de la facultad de ingeniería. En este caso, bueno, hay convenios por",
        "start": 28.96,
        "end": 35.0
    },
    {
        "text": " el cual, este docentes de otra casa de estudio, en este caso de la facultad de ciencia",
        "start": 35.0,
        "end": 40.24
    },
    {
        "text": " económica y administración, nos permite dar y hacernos cargo de este curso y",
        "start": 40.24,
        "end": 46.72
    },
    {
        "text": " programas, de en este caso administración general para ingenieros dentro de la",
        "start": 46.72,
        "end": 51.8
    },
    {
        "text": " facultad de ingeniería. Somos docentes de la UDLR, sabemos que la UDLR",
        "start": 51.8,
        "end": 56.8
    },
    {
        "text": " nuclea a todas las facultades que están dentro de esta gran casa de estudio",
        "start": 56.8,
        "end": 62.08
    },
    {
        "text": " o del art, pero no somos docentes más allá de esta unidad curricular de la",
        "start": 62.08,
        "end": 67.28
    },
    {
        "text": " facultad de ingeniería. Somos docentes de la facultad de ciencia económica y administración.",
        "start": 67.28,
        "end": 72.28
    },
    {
        "text": " Ahí tenemos este con valería muchos años de conocer, somos gente jor en por",
        "start": 72.28,
        "end": 77.88
    },
    {
        "text": " supuesto, pero bueno, arrancamos dando clases, muchos quitos, para dar valería.",
        "start": 77.88,
        "end": 81.75999999999999
    },
    {
        "text": " Era muy pequeños cuando arrancamos. Era muy pequeñas, exactamente. Y bueno, ahí",
        "start": 81.96000000000001,
        "end": 87.08000000000001
    },
    {
        "text": " este ahí nos conocemos un curso, este administración general para ingenieros que con valería",
        "start": 87.08000000000001,
        "end": 95.04
    },
    {
        "text": " tomamos la responsabilidad el año pasado, el año 2023 hasta el año 2022, el docente que",
        "start": 95.04,
        "end": 105.36000000000001
    },
    {
        "text": " estaba a cargo de esta unidad curricular era Isidro Alfaya, Isidro Sejubilo,",
        "start": 105.36,
        "end": 110.96
    },
    {
        "text": " este día, a partir del año pasado valería y yo tomamos la responsabilidad del curso.",
        "start": 110.96,
        "end": 116.8
    },
    {
        "text": " Así que bueno, entendemos que por qué toda esta introducción, bueno, para",
        "start": 116.8,
        "end": 124.28
    },
    {
        "text": " comentarles que está bueno porque en las facultades y las económicas también los",
        "start": 124.28,
        "end": 129.8
    },
    {
        "text": " proponemos de esta forma que unidades curriculares que tiene mucho de lectura detrás.",
        "start": 129.8,
        "end": 136.12
    },
    {
        "text": " Y cuando digo mucho de lectura, me refiero a que tiene un poquito más de lectura a lo",
        "start": 136.12,
        "end": 142.28
    },
    {
        "text": " que tiene una ciencia exacta, que probablemente las ciencias exactas son de las cuales ustedes",
        "start": 142.28,
        "end": 148.56
    },
    {
        "text": " conocen y mucho más que nosotros. La administración como tal es una ciencia, pero es una ciencia",
        "start": 148.56,
        "end": 156.52
    },
    {
        "text": " social, no es una ciencia exacta. Entonces en este sentido, las ciencias sociales como tal tienen",
        "start": 156.52,
        "end": 166.0
    },
    {
        "text": " mucha base, tienen mucha consulta en lectura que muchas veces puede parecer y a veces lo es,",
        "start": 166.0,
        "end": 174.20000000000002
    },
    {
        "text": " de hecho, puede ser masiva o puede ser bastante, pero esto sucede si tomamos contacto con los",
        "start": 174.20000000000002,
        "end": 184.16000000000003
    },
    {
        "text": " materiales para estudiar unas semanas antes de preparar la revisión. Si seguimos el curso,",
        "start": 184.16,
        "end": 190.76
    },
    {
        "text": " si vamos preparando, y cuando digo preparando, digo leyendo las unidades temáticas que con valería",
        "start": 190.76,
        "end": 198.16
    },
    {
        "text": " vamos a dar el curso de una ciencia social, en este caso de una rama de administración,",
        "start": 198.16,
        "end": 205.2
    },
    {
        "text": " no se hace tan tedioso, no se hace tan pesado, porque vamos asimilando en los conceptos clases,",
        "start": 205.2,
        "end": 213.07999999999998
    },
    {
        "text": " los lunes y los viernes de 19 a 21. Este curso tiene la particularidad que tiene un gran componente",
        "start": 213.96,
        "end": 223.0
    },
    {
        "text": " teórico, no, este con valería vamos a incorporar también en este caso prácticos, pero el gran componente",
        "start": 223.0,
        "end": 231.32000000000002
    },
    {
        "text": " en el cual incluso se basan las revisiones y los exámenes, es un fuerte componente teórico,",
        "start": 231.32000000000002,
        "end": 236.72000000000003
    },
    {
        "text": " entonces por eso entendemos que enseguirlo clase a clase, el de leer un poquito de material para",
        "start": 237.28,
        "end": 243.8
    },
    {
        "text": " escucharnos a nosotros, que muchas veces sin el aporte de ustedes hasta se nos hace aburrido,",
        "start": 243.8,
        "end": 248.96
    },
    {
        "text": " a mí, a mí particularmente no me aburre escuchar a valería, pero me aburre escucharme a mí mismo,",
        "start": 248.96,
        "end": 255.92
    },
    {
        "text": " y me imagina a ustedes cuánto lo puede llegar a aburrir, si yo me aburro, me imagino ustedes",
        "start": 255.92,
        "end": 262.4
    },
    {
        "text": " cuánto puede llegar a aburrirles escucharme a mí al menos, ¿no? Entonces por eso...",
        "start": 262.4,
        "end": 267.88
    },
    {
        "text": " El curso también la hacemos entre todos, y eso es lo que lo van haciendo y lo vamos a ir también",
        "start": 267.88,
        "end": 273.52
    },
    {
        "text": " ajustando en más a las necesidades de ustedes en un tema que no entendieron demasiado, si hay otro",
        "start": 273.52,
        "end": 279.96
    },
    {
        "text": " que quieren profundizar, si algo le costó y quieren material adicional, nos ha pasado también a veces",
        "start": 279.96,
        "end": 285.47999999999996
    },
    {
        "text": " alumnos que por cuestiones laborales les interesaba un tema porque estaba muy vinculado alguna tarea",
        "start": 285.47999999999996,
        "end": 291.56
    },
    {
        "text": " específica que estaban realizando, entonces nosotros podemos proporcionarles también información",
        "start": 291.56,
        "end": 295.76
    },
    {
        "text": " para ampliar ese tema, que no van a ser nuevas bibliografías obligatorias, pero sí bibliografías",
        "start": 295.76,
        "end": 302.72
    },
    {
        "text": " que ustedes pueden disponar para aspectos puntuales, entonces un poco ese, eso no, y lo haciendo",
        "start": 302.72,
        "end": 308.6
    },
    {
        "text": " entre todos y que todos nos sentamos ajustos en el curso. Exactamente, exactamente, por ahí va.",
        "start": 308.6,
        "end": 315.64
    },
    {
        "text": " Entonces, bueno, un poco respondiendo ahora sí las dos preguntas que tenemos en el chat,",
        "start": 316.2,
        "end": 322.88
    },
    {
        "text": " las clases de zoom de lunes y viernes de 19 a 21 horas la vamos a grabar, si, las clases van a",
        "start": 322.88,
        "end": 333.0
    },
    {
        "text": " hacer por esta plataforma, plataforma zoom, y las vamos a subir al curso que tiene esta unidad",
        "start": 333.0,
        "end": 341.32
    },
    {
        "text": " curricular en el Eva, y vamos a intentar hacerlo a más tardar al día siguiente a cuando la clase",
        "start": 341.32,
        "end": 349.92
    },
    {
        "text": " termine, en ese sentido yo sé que Valeria es mucho más prolija que yo y capaz que termine a la clase",
        "start": 349.92,
        "end": 357.84
    },
    {
        "text": " y ya los cinco minutos tienen la clase subida, cuando tengan la clase conmigo probablemente a más tardar",
        "start": 357.84,
        "end": 366.15999999999997
    },
    {
        "text": " la tengan el al otro día, o sea que la clase del lunes la tengan en el martes y que la clase del",
        "start": 366.16,
        "end": 372.20000000000005
    },
    {
        "text": " viernes o la tengan el sábado o a más tardar este el lunes de la semana siguiente,",
        "start": 372.20000000000005,
        "end": 378.40000000000003
    },
    {
        "text": " si, importantísimo, y esto es importante para este curso 2024, la bibliografía para este curso",
        "start": 378.40000000000003,
        "end": 387.48
    },
    {
        "text": " 2024 cambia, y por eso las clases que hasta ahora ustedes podían acceder en la plataforma Open",
        "start": 387.48,
        "end": 397.20000000000005
    },
    {
        "text": " Fin lo reiteramos, nosotros le pedimos al Departamento de apoyo a la enseñanza de la facultad de",
        "start": 397.20000000000005,
        "end": 404.44
    },
    {
        "text": " ingeniería que les guiera debaja, también nos dijeron que en la plataforma Open Fin también",
        "start": 404.44,
        "end": 412.48
    },
    {
        "text": " iban a estar subido los links de estas clases de zoom, de las clases de zoom de este año,",
        "start": 412.48,
        "end": 419.56
    },
    {
        "text": " probablemente con tiempo para el año que viene vamos a grabar nuevas clases en la plataforma",
        "start": 419.56,
        "end": 426.36
    },
    {
        "text": " este Open Fin, y también a partir de ahí van a tener en la plataforma Open Fin lo que hasta ahora",
        "start": 426.36,
        "end": 432.8
    },
    {
        "text": " tenían esas grabaciones, quiere decir que las clases grabadas van a ser en plataforma zoom,",
        "start": 432.8,
        "end": 439.20000000000005
    },
    {
        "text": " las vamos a colgar en el Eva, en el curso de Eva de administración general para ingeniero y",
        "start": 439.71999999999997,
        "end": 445.44
    },
    {
        "text": " también en la plataforma Open Fin van a tener el link de estas clases, ¿sí? cómo va a ser el",
        "start": 445.44,
        "end": 452.48
    },
    {
        "text": " tema de los doscientes, los doscientes son Valeria y soy yo Valeria va a estar dando las clases de",
        "start": 452.48,
        "end": 463.28
    },
    {
        "text": " la primer parte del curso, la que hoy nos convoca hasta la última clase antes de la primer",
        "start": 463.28,
        "end": 473.11999999999995
    },
    {
        "text": " revisión, no he venido en la primer revisión dentro del receso y una vez que comience la segunda",
        "start": 473.11999999999995,
        "end": 480.2
    },
    {
        "text": " parte del curso, ahí van a tener conmigo las otras unidades temáticas hasta dar la segunda revisión,",
        "start": 480.2,
        "end": 487.76
    },
    {
        "text": " la idea de estar hoy presente, además de robarla algunos minutitos, Valeria perdón, era que nos",
        "start": 488.32,
        "end": 494.8
    },
    {
        "text": " conocieran a los dos, tanto Valeria como yo y ponernos a disposición, este Valeria luego les",
        "start": 494.8,
        "end": 502.24
    },
    {
        "text": " va a decir de nuestros correos electrónicos, o sea que nos pueden convocar por ese lado también,",
        "start": 502.24,
        "end": 507.12
    },
    {
        "text": " estar ampliamente dispuestos a colaborar, a responder preguntas, a las que ustedes puedan surgir,",
        "start": 507.12,
        "end": 515.08
    },
    {
        "text": " sabemos que, por ejemplo ahora nos están preguntando en cuanto a evaluaciones, se refiere cuando",
        "start": 515.08,
        "end": 522.96
    },
    {
        "text": " la vamos a tener y como son, tenemos dos evaluaciones, las dos evaluaciones son virtuales,",
        "start": 522.96,
        "end": 529.8000000000001
    },
    {
        "text": " si, por plataforma e va también, una en el primer receso y otra en el segundo receso,",
        "start": 529.8000000000001,
        "end": 537.08
    },
    {
        "text": " aún no tenemos las fechas, pero cuando las tengamos las vamos a informar, la bibliografía, bueno,",
        "start": 537.08,
        "end": 545.5600000000001
    },
    {
        "text": " qué cambia de la bibliografía, nosotros basamos este curso en una edición de unos autores",
        "start": 545.5600000000001,
        "end": 553.0
    },
    {
        "text": " Robins y Cutler que los autores no cambian, los autores son los mismos, lo que cambia es la",
        "start": 553.0,
        "end": 560.6800000000001
    },
    {
        "text": " edición de esos autores, muchas veces los nombres de los temas van a ser los mismos, pero dentro",
        "start": 560.68,
        "end": 570.0799999999999
    },
    {
        "text": " de cada tema pueden cambiar y de hecho cambian los conceptos, las explicaciones de esos conceptos y",
        "start": 570.0799999999999,
        "end": 578.92
    },
    {
        "text": " por eso el material que hasta ahora se arruía en este curso, lo dejamos un poquito de lado y",
        "start": 578.92,
        "end": 585.24
    },
    {
        "text": " ahora le vamos a decir cuál es la edición de los autores Robins y Cutler en los cuales nos",
        "start": 585.24,
        "end": 592.04
    },
    {
        "text": " basamos para dar este curso 2024, a Lelia, no sé si me olvida a Lelia.",
        "start": 592.04,
        "end": 600.08
    },
    {
        "text": " 12, exactamente.",
        "start": 600.08,
        "end": 603.92
    },
    {
        "text": " A agregar un, o sea, es un foco más moderno, la última decisión tiene algunos cambios y a sube",
        "start": 603.92,
        "end": 611.16
    },
    {
        "text": " también empieza a plasmar un poco más también lo que fue el impacto de la tecnología y",
        "start": 611.16,
        "end": 615.88
    },
    {
        "text": " empieza a referencias de temas más ayernados con respecto a la edición anterior.",
        "start": 615.88,
        "end": 620.16
    },
    {
        "text": " Exactamente.",
        "start": 620.16,
        "end": 623.8
    },
    {
        "text": " Vamos a subir a la cantidad de personas que estamos, Valeria, somos 90, o sea que buenísimo.",
        "start": 623.8,
        "end": 633.64
    },
    {
        "text": " No sé si a ustedes le surge preguntas de todo lo que hemos dicho hasta acá, probablemente",
        "start": 634.64,
        "end": 640.36
    },
    {
        "text": " les surgan a media que pasen los minutos de esta clase y las clases, con muchísimo gusto,",
        "start": 640.36,
        "end": 647.16
    },
    {
        "text": " reiteramos a disposición de ustedes.",
        "start": 647.16,
        "end": 650.24
    },
    {
        "text": " Reteramos que las clases son por plataforma zoom, lunes y viernes de 19 a 21.",
        "start": 650.24,
        "end": 657.96
    },
    {
        "text": " La primera parte del curso van a estar con Valeria, luego viene la primera revisión que es",
        "start": 657.96,
        "end": 662.88
    },
    {
        "text": " virtual por Eva, en la segunda parte del curso van a estar conmigo y luego viene la segunda",
        "start": 662.88,
        "end": 669.32
    },
    {
        "text": " revisión en la segunda parte en el segundo receso de Laya.",
        "start": 669.32,
        "end": 673.48
    },
    {
        "text": " Ahí ya Valeria estamos toando algo.",
        "start": 678.68,
        "end": 681.12
    },
    {
        "text": " No, un poco ya la clave, me imagino que a esta altura ya la mayoría ingresó, si no lo",
        "start": 681.12,
        "end": 687.08
    },
    {
        "text": " hicieron, las recomendamos que ingresen y que empiezan a visualizar, allí van a ver que",
        "start": 687.08,
        "end": 693.96
    },
    {
        "text": " están todas las unidades temáticas y en cada una de ellas vamos a ir colocando información",
        "start": 693.96,
        "end": 699.6
    },
    {
        "text": " que va a ser útil y relevante para lo que es el estado del curso.",
        "start": 699.6,
        "end": 704.5600000000001
    },
    {
        "text": " Así que ahí incluso van a estar disponibles también estas presentaciones.",
        "start": 704.5600000000001,
        "end": 710.08
    },
    {
        "text": " Van a tener algún ejemplo de las multiplocciones.",
        "start": 710.08,
        "end": 713.36
    },
    {
        "text": " Me entrega y luego lo recorran en un sector de novedades también donde nosotros les vamos",
        "start": 713.48,
        "end": 719.08
    },
    {
        "text": " informando en algunos temas fundamentales sobre el funcionamiento del curso.",
        "start": 719.08,
        "end": 725.0
    },
    {
        "text": " Hay otro sector que es de intercambio entre estudiantes donde pueden entre usted,",
        "start": 725.0,
        "end": 728.72
    },
    {
        "text": " su opinar y proporcionar información o datos que necesiten.",
        "start": 728.72,
        "end": 735.24
    },
    {
        "text": " Y bueno, todo lo que es la plataforma Eva pueden hacer consultas allí, no solo se le vamos a estar",
        "start": 735.24,
        "end": 740.44
    },
    {
        "text": " contestando, bueno es más hemos recibido varias consultas en estos días con respecto",
        "start": 740.44,
        "end": 745.6
    },
    {
        "text": " a la modalidad y bueno, algunas de las que ya hemos mencionado nuevamente en el día de hoy.",
        "start": 745.6,
        "end": 750.44
    },
    {
        "text": " Tudas consultas deciden sumando.",
        "start": 752.24,
        "end": 755.44
    },
    {
        "text": " Ya no, no me entendí.",
        "start": 756.44,
        "end": 757.44
    },
    {
        "text": " ¿191?",
        "start": 758.44,
        "end": 759.72
    },
    {
        "text": " Impresionante.",
        "start": 760.44,
        "end": 761.44
    },
    {
        "text": " Hay algunos temas del curso que nos parece interesante que puedan ver un pantalla,",
        "start": 762.44,
        "end": 770.44
    },
    {
        "text": " eso es todo para los que todavía están ahí por definir si la van a cursar o no.",
        "start": 770.44,
        "end": 776.44
    },
    {
        "text": " Bueno, realmente eso es una materia sumamente importante para ustedes.",
        "start": 776.44,
        "end": 780.44
    },
    {
        "text": " Y para cualquier persona que luego va a integrar una organización, porque son los pilares",
        "start": 780.44,
        "end": 785.44
    },
    {
        "text": " fundamentales que nos dan información, verdad para poder luego ocupar un lugar",
        "start": 785.44,
        "end": 791.6800000000001
    },
    {
        "text": " gerencial y lea mañana o simplemente ser parte de verdad una organización y entender",
        "start": 791.6800000000001,
        "end": 795.44
    },
    {
        "text": " el funcionamiento de la misma.",
        "start": 795.44,
        "end": 797.44
    },
    {
        "text": " Vamos a haber toda una primer parte de introducción a la administración con los conceptos básicos,",
        "start": 797.44,
        "end": 802.44
    },
    {
        "text": " donde también vamos a ver el rol lejerente, las características del gerente,",
        "start": 802.44,
        "end": 807.44
    },
    {
        "text": " la cual son sus habilidades, cuáles son sus características que rolcúmple dentro de la organización.",
        "start": 807.44,
        "end": 813.44
    },
    {
        "text": " Vamos a ver también los aspectos culturales, tienen mucha influencia en lo que es el accionar",
        "start": 814.44,
        "end": 820.44
    },
    {
        "text": " luego de un gerente.",
        "start": 820.44,
        "end": 822.44
    },
    {
        "text": " Vamos a ver el entorno global que con todos los aspectos vinculados a la pandemia realmente se valorizó",
        "start": 822.44,
        "end": 829.44
    },
    {
        "text": " nuevamente la importancia del entorno y como las organizaciones no son ajenas a lo que pasa en el exterior.",
        "start": 829.44,
        "end": 837.44
    },
    {
        "text": " Vamos a ver también todo lo que es responsabilidad social empresarial,",
        "start": 837.44,
        "end": 841.44
    },
    {
        "text": " que también es algo que en los últimos años ha tenido mayor, mayor encaspiega,",
        "start": 841.44,
        "end": 848.44
    },
    {
        "text": " hasta aquí punto las organizaciones tienen que hacer más allá de lo que la ley les obliga,",
        "start": 848.44,
        "end": 854.44
    },
    {
        "text": " pero con un fin de poder mejorar el ambiente, mejorar la sociedad y aportar a la comunidad.",
        "start": 854.44,
        "end": 862.44
    },
    {
        "text": " La toma de decisiones es un tema sumamente interesante porque bueno,",
        "start": 862.44,
        "end": 868.44
    },
    {
        "text": " si bien obviamente que el foco que nosotros le vamos a dar el tema es a nivel empresarial,",
        "start": 868.44,
        "end": 874.44
    },
    {
        "text": " todos tomamos decisiones por lo que empieza a ser relevante también para ustedes poder entender",
        "start": 874.44,
        "end": 880.44
    },
    {
        "text": " cómo es el funcionamiento y algunos aspectos que influyen en la toma de decisiones que no son siempre",
        "start": 880.44,
        "end": 887.44
    },
    {
        "text": " de todo racionales y entonces bueno allí vamos a ver lo que son las decisiones inditivas,",
        "start": 887.44,
        "end": 893.44
    },
    {
        "text": " los consejos que podemos tener a la hora de tomar decisiones,",
        "start": 893.44,
        "end": 897.44
    },
    {
        "text": " es un tema bastante importante, no solo para esta materia sino para otras actividades",
        "start": 897.44,
        "end": 903.44
    },
    {
        "text": " que luego puedan desarrollar el entender como es el proceso decisario, es bastante significativo.",
        "start": 903.44,
        "end": 910.44
    },
    {
        "text": " Luego tenemos toda la parte de planificación, de administraciones estratégicas,",
        "start": 910.44,
        "end": 915.44
    },
    {
        "text": " la estrategia de las empresas muy importantes y cómo la lleva adelante y vía la implantación mucho más,",
        "start": 915.44,
        "end": 922.44
    },
    {
        "text": " siempre se dice que donde fallan las estrategias en el momento de la implantación y después bien,",
        "start": 922.44,
        "end": 929.44
    },
    {
        "text": " bueno los temas que queda Marcelo así que Marcelo, si queréis comentar un poquito lo que es esa parte,",
        "start": 929.44,
        "end": 935.44
    },
    {
        "text": " la segunda parte del curso.",
        "start": 935.44,
        "end": 938.44
    },
    {
        "text": " Como no, estaba viendo un poquito las preguntas que están haciendo,",
        "start": 938.44,
        "end": 945.44
    },
    {
        "text": " este curso tiene dos revisiones, si bien en el programa que la facultad ingeniería aprobó y que hicimos con Valeria,",
        "start": 945.44,
        "end": 957.44
    },
    {
        "text": " mencionamos de que las revisiones pueden ser presenciales o pueden servir toales,",
        "start": 957.44,
        "end": 963.44
    },
    {
        "text": " para este año particularmente las dos revisiones van a ser en modalidad virtual.",
        "start": 963.44,
        "end": 969.44
    },
    {
        "text": " El total de los puntos son 100 puntos divididos en 50 puntos cada uno,",
        "start": 969.44,
        "end": 976.44
    },
    {
        "text": " en cada revisión, el mínimo para exonerar, para salvar cada revisión, es de 50%,",
        "start": 976.44,
        "end": 989.44
    },
    {
        "text": " o sea 25 puntos, si sacamos el mínimo en cada revisión 25 más 25, 50,",
        "start": 989.44,
        "end": 997.44
    },
    {
        "text": " pero el total para exonerar es el 60%.",
        "start": 997.44,
        "end": 1004.44
    },
    {
        "text": " Así que no sé si estoy respondiendo ahí un poquito de lo que están preguntando,",
        "start": 1004.44,
        "end": 1009.44
    },
    {
        "text": " el total son 100 puntos, hay dos revisiones, 50 puntos en cada revisión,",
        "start": 1009.44,
        "end": 1015.44
    },
    {
        "text": " el mínimo para salvar cada revisión es el 50%, o sea 25 puntos,",
        "start": 1015.44,
        "end": 1020.44
    },
    {
        "text": " pero si queremos exonerar la unidad curricular, el curso, tenemos que sumar entre las dos revisiones",
        "start": 1021.44,
        "end": 1029.44
    },
    {
        "text": " un mínimo de 60% de los puntos, o sea 60 puntos.",
        "start": 1029.44,
        "end": 1034.44
    },
    {
        "text": " Se va a leer ya, si quieres agregar algo.",
        "start": 1036.44,
        "end": 1038.44
    },
    {
        "text": " No, que por ejemplo no es libre en la verabilidad, que eso es muy práctico para ustedes,",
        "start": 1038.44,
        "end": 1044.44
    },
    {
        "text": " si pueden ir hacia adelante, para dar algo, retornar a preguntas que quizás en ese momento no sabían,",
        "start": 1045.44,
        "end": 1051.44
    },
    {
        "text": " pero luego sí, no se arrestan puntos, que también es eso que siempre nos piden,",
        "start": 1051.44,
        "end": 1056.44
    },
    {
        "text": " que no se penalice una pregunta incorrecta, y bueno, la base de preguntas va a tener modificaciones varias",
        "start": 1056.44,
        "end": 1064.44
    },
    {
        "text": " por todo el tema este, que cambió el libro, así que para los que ya la cursaron,",
        "start": 1064.44,
        "end": 1072.44
    },
    {
        "text": " van a notar varias diferencias en lo que se pregunta.",
        "start": 1072.44,
        "end": 1076.44
    },
    {
        "text": " Referente a los temas de la segunda parte que van a ver conmigo,",
        "start": 1078.44,
        "end": 1082.44
    },
    {
        "text": " lo que hoy Valeria ha comentado de la tecneología,",
        "start": 1082.44,
        "end": 1087.44
    },
    {
        "text": " es algo que forma transversal ha cambiado muchísimo a las organizaciones,",
        "start": 1087.44,
        "end": 1093.44
    },
    {
        "text": " no solo con los medios y los recursos que hoy las organizaciones tienen que contar,",
        "start": 1094.44,
        "end": 1101.44
    },
    {
        "text": " para ejemplo, para capacitar una persona, sino también para armar la estructura de la organización",
        "start": 1101.44,
        "end": 1110.44
    },
    {
        "text": " para que luego la organización a su vez cumpla los objetivos,",
        "start": 1110.44,
        "end": 1114.44
    },
    {
        "text": " antes era muy común, por ejemplo, observar una estructura de una empresa por funciones,",
        "start": 1114.44,
        "end": 1122.44
    },
    {
        "text": " por funciones me refiero, bueno, hay un gran grupo de funciones o de actividades que se refieren",
        "start": 1122.44,
        "end": 1128.44
    },
    {
        "text": " a la administración, esos están dentro de un departamento,",
        "start": 1128.44,
        "end": 1132.44
    },
    {
        "text": " hay un gran grupo de actividades y funciones referente a las compras,",
        "start": 1132.44,
        "end": 1136.44
    },
    {
        "text": " esos están en un departamento, a recursos humanos, a la área de venta,",
        "start": 1136.44,
        "end": 1141.44
    },
    {
        "text": " eso sigue estando, pero las organizaciones han cambiado tanto que hoy muchas organizaciones",
        "start": 1141.44,
        "end": 1147.44
    },
    {
        "text": " capaz que por su tamaño, porque sean grandes o porque sean chicas,",
        "start": 1147.44,
        "end": 1151.44
    },
    {
        "text": " sino porque tienen una necesidad a la hora de cumplir sus objetivos,",
        "start": 1151.44,
        "end": 1157.44
    },
    {
        "text": " necesitan, por ejemplo, un departamento de IT,",
        "start": 1157.44,
        "end": 1161.44
    },
    {
        "text": " lo que hoy están estudiando mucho de ustedes, después nos gusta preguntar la compa Valeria",
        "start": 1161.44,
        "end": 1167.44
    },
    {
        "text": " que rama de la ingeniería están haciendo, si en sistemas, si civil,",
        "start": 1167.44,
        "end": 1172.44
    },
    {
        "text": " si eléctrica, si mecánica, bueno, todas estas carreras que ustedes hacen luego",
        "start": 1172.44,
        "end": 1178.44
    },
    {
        "text": " en las organizaciones tienen una repercusión en el diseño de la organización",
        "start": 1178.44,
        "end": 1185.44
    },
    {
        "text": " para dar respuesta a las objetivos que la organización quiere,",
        "start": 1185.44,
        "end": 1190.44
    },
    {
        "text": " y han cambiado tan drásticamente que incluso hay organizaciones que ya ni se organizan",
        "start": 1190.44,
        "end": 1197.44
    },
    {
        "text": " por funciones, sino que en un mismo departamento o área de actividad podemos encontrar personas",
        "start": 1197.44,
        "end": 1204.44
    },
    {
        "text": " que tienen conocimientos o conceptos o experiencia de diferentes áreas,",
        "start": 1204.44,
        "end": 1211.44
    },
    {
        "text": " porque por ejemplo trabajan en equipo, es muy común que una organización de software,",
        "start": 1211.44,
        "end": 1218.44
    },
    {
        "text": " por ejemplo, arme un equipo específico para atender las necesidades de un cliente,",
        "start": 1218.44,
        "end": 1225.44
    },
    {
        "text": " a la hora de desarrollar un software, por ejemplo,",
        "start": 1225.44,
        "end": 1228.44
    },
    {
        "text": " y cuando ese objetivo del desarrollo del software se cumple,",
        "start": 1228.44,
        "end": 1232.44
    },
    {
        "text": " ese equipo se desarma, no quiere decir que las personas dejen de partencer a la organización,",
        "start": 1232.44,
        "end": 1237.44
    },
    {
        "text": " sino que luego se juntan en otro equipo para dar respuesta a otro cliente,",
        "start": 1237.44,
        "end": 1243.44
    },
    {
        "text": " entonces el diseño organizacional de las organizaciones ha cambiado,",
        "start": 1243.44,
        "end": 1248.44
    },
    {
        "text": " también ha cambiado cómo las organizaciones deben trabajar con su principal recurso,",
        "start": 1249.44,
        "end": 1255.44
    },
    {
        "text": " que no es el económico, que no es el de maquinar y así no que somos nosotros las personas,",
        "start": 1255.44,
        "end": 1261.44
    },
    {
        "text": " el recurso humano, este hoy por hoy, ustedes como integrantes de la nueva generación,",
        "start": 1261.44,
        "end": 1267.44
    },
    {
        "text": " muchas de las cosas que avalerie a mí, por ejemplo y más a mí me cuesta asociar la tecnología,",
        "start": 1267.44,
        "end": 1273.44
    },
    {
        "text": " ustedes nacieron con ese tipo de cosas, pero en una organización diferentes personas,",
        "start": 1274.44,
        "end": 1280.44
    },
    {
        "text": " con diferentes formaciones y de diferentes idades, tenemos que aprender a convivir,",
        "start": 1280.44,
        "end": 1286.44
    },
    {
        "text": " a trabajar junto, a ensamblar junto y a dar respuesta junto,",
        "start": 1286.44,
        "end": 1291.44
    },
    {
        "text": " entonces hay una administración de los recursos humanos, que es algo muy importante,",
        "start": 1291.44,
        "end": 1296.44
    },
    {
        "text": " y también hoy hay gente específica en las organizaciones que se forma en el área",
        "start": 1296.44,
        "end": 1302.44
    },
    {
        "text": " de recursos humanos para darle forma a estas personas que venimos de conocimientos diferentes,",
        "start": 1302.44,
        "end": 1309.44
    },
    {
        "text": " de experiencias diferentes, de formaciones, este diferente, la innovación,",
        "start": 1309.44,
        "end": 1314.44
    },
    {
        "text": " cuanto ha cambiado, cuanto ha hecho que las organizaciones cambian,",
        "start": 1314.44,
        "end": 1319.44
    },
    {
        "text": " muchas veces hoy yo tengo una gran idea, ni siquiera tengo una organización formada o un emprendimiento",
        "start": 1319.44,
        "end": 1326.44
    },
    {
        "text": " y por tener una buena idea capaz que se forma una nueva organización,",
        "start": 1326.44,
        "end": 1330.44
    },
    {
        "text": " de hecho las nuevas organizaciones que hoy han cambiado en nuestro estilo de vida se han formado",
        "start": 1330.44,
        "end": 1336.44
    },
    {
        "text": " en esta última década, la que estamos viviendo, y organizaciones de muchos,",
        "start": 1336.44,
        "end": 1341.44
    },
    {
        "text": " de muchos años han desaparecido, porque no han logrado adecuarse o a compasarse",
        "start": 1341.44,
        "end": 1349.44
    },
    {
        "text": " a los tiempos que vivimos, y no lo digo solo por empresas locales,",
        "start": 1349.44,
        "end": 1353.44
    },
    {
        "text": " sino que también empresas multinacionales le ha pasado,",
        "start": 1353.44,
        "end": 1358.44
    },
    {
        "text": " la comunicación, como esas personas de diferentes formaciones comunicamos,",
        "start": 1358.44,
        "end": 1364.44
    },
    {
        "text": " como esas personas nos motivamos o nos motivan para lograr este objetivo",
        "start": 1364.44,
        "end": 1371.44
    },
    {
        "text": " y lograr que podamos permanecer en las organizaciones y que no haya una alta rotación",
        "start": 1371.44,
        "end": 1377.44
    },
    {
        "text": " porque formar y capacitar a una persona también tiene un uso de recursos súper importante para las organizaciones.",
        "start": 1377.44,
        "end": 1386.44
    },
    {
        "text": " ¿Cómo son los líderes y los tipos de líderes?",
        "start": 1386.44,
        "end": 1389.44
    },
    {
        "text": " Antes los líderes eran personas altas o hombres altos y que tenían fuerte voz,",
        "start": 1389.44,
        "end": 1396.44
    },
    {
        "text": " eso estamos hablando del siglo pasado, hoy hay mujeres muy empoderadas que lideran",
        "start": 1396.44,
        "end": 1402.44
    },
    {
        "text": " y conducen organizaciones que son pioneras y líderes en su rama de actividad,",
        "start": 1402.44,
        "end": 1408.44
    },
    {
        "text": " o sea, el liderazgo ha cambiado también, eso son un poquito algunos de los temas que vamos a dar en la segunda parte.",
        "start": 1408.44,
        "end": 1416.44
    },
    {
        "text": " Y el liderazgo también cambia porque la forma de trabajo cambia,",
        "start": 1416.44,
        "end": 1420.44
    },
    {
        "text": " ahora está todo el tema del trabajo, entonces capaz que lo que antes mencionaba recién Marcelo",
        "start": 1420.44,
        "end": 1425.44
    },
    {
        "text": " de la teoría de los rasgos, aquellas características,",
        "start": 1425.44,
        "end": 1428.44
    },
    {
        "text": " bueno, capaz que hay querentes que están liderando sin siquiera que otros funcionarios los estén viendo,",
        "start": 1428.44,
        "end": 1434.44
    },
    {
        "text": " entonces, todo se ha modificado notoriamente via a la tecnología y bueno con todos los cambios que se han dado",
        "start": 1434.44,
        "end": 1442.44
    },
    {
        "text": " y también el impacto de la pandemia y los cambios que ha generado en la organización.",
        "start": 1442.44,
        "end": 1448.44
    },
    {
        "text": " Exacto.",
        "start": 1448.44,
        "end": 1450.44
    },
    {
        "text": " Bueno, por mi parte, ya de las dos horas que Valeria tiene hoy para la Primar Clase,",
        "start": 1450.44,
        "end": 1456.44
    },
    {
        "text": " ya usamos 30 minutos Valeria, así que en lo que a mí refiere te he quitado mucho tiempo ya,",
        "start": 1456.44,
        "end": 1462.44
    },
    {
        "text": " no, básicamente era bueno, muchas gracias.",
        "start": 1462.44,
        "end": 1465.44
    },
    {
        "text": " La idea era que nos conocieran a ambos, nuevamente presentarnos,",
        "start": 1465.44,
        "end": 1471.44
    },
    {
        "text": " mostrarnos a disposición y por más que Valeria está en la primer parte y yo en la segunda parte,",
        "start": 1471.44,
        "end": 1478.44
    },
    {
        "text": " ambos somos los doscientes de esta unidad curricular,",
        "start": 1478.44,
        "end": 1481.44
    },
    {
        "text": " así que los dos estamos disponibles en cualquier momento del curso.",
        "start": 1481.44,
        "end": 1484.44
    },
    {
        "text": " Un gusto y bueno, ojalá que nos veamos prontito el tiempo, el pasaje del tiempo es rapidísimo",
        "start": 1484.44,
        "end": 1492.44
    },
    {
        "text": " y ojalá podamos contar con todos ustedes que hoy están acá en la Primar Clase,",
        "start": 1492.44,
        "end": 1496.44
    },
    {
        "text": " en la siguiente clase y en la clase de la segunda parte donde vamos a tener un poco más de relación al menos con mí.",
        "start": 1496.44,
        "end": 1504.44
    },
    {
        "text": " Un gusto que estén bien y en lo que refiere a mí me desponecto por acá.",
        "start": 1505.44,
        "end": 1510.44
    },
    {
        "text": " Gracias Valeria.",
        "start": 1510.44,
        "end": 1511.44
    },
    {
        "text": " Gracias Valeria.",
        "start": 1511.44,
        "end": 1512.44
    },
    {
        "text": " Suerte que pase bien.",
        "start": 1512.44,
        "end": 1513.44
    },
    {
        "text": " Gracias, vos.",
        "start": 1513.44,
        "end": 1514.44
    },
    {
        "text": " Vamos con mi carta.",
        "start": 1514.44,
        "end": 1515.44
    },
    {
        "text": " Chau.",
        "start": 1515.44,
        "end": 1516.44
    },
    {
        "text": " Bueno, un poquito, el tema de la evaluación ya lo visualizamos anteriormente,",
        "start": 1518.44,
        "end": 1523.44
    },
    {
        "text": " pero bueno, si alguno se conectó y se sumó luego a aprobación,",
        "start": 1523.44,
        "end": 1528.44
    },
    {
        "text": " verdad de dos parciales, que como les comentábamos recién,",
        "start": 1528.44,
        "end": 1531.44
    },
    {
        "text": " va a ser formato virtual.",
        "start": 1531.44,
        "end": 1532.44
    },
    {
        "text": " Dos pruebas, parciales, virtuales, 50 puntos cada una, sin restar y libre navegación.",
        "start": 1535.44,
        "end": 1541.44
    },
    {
        "text": " Bueno, lo que hablábamos, ¿no?",
        "start": 1546.44,
        "end": 1548.44
    },
    {
        "text": " De los 25 puntos en cada una de las pruebas que implica hacer correctamente el 50%.",
        "start": 1548.44,
        "end": 1554.44
    },
    {
        "text": " Con respecto al edición del libro que veo que están escribiendo el chat si es exacto, ese es.",
        "start": 1559.44,
        "end": 1568.44
    },
    {
        "text": " Primar parcial, segundo parcial, un taje mínimos.",
        "start": 1572.44,
        "end": 1575.44
    },
    {
        "text": " Bueno, vamos a arrancar con la clase de hoy.",
        "start": 1579.44,
        "end": 1582.44
    },
    {
        "text": " Dúgolas consumitas.",
        "start": 1583.44,
        "end": 1584.44
    },
    {
        "text": " Bueno, primero que gustaría conocer de qué rama de la ingeniería, ¿cuál es la orientación que están estudiando?",
        "start": 1590.44,
        "end": 1595.44
    },
    {
        "text": " A ver si alguno se anima a comentar.",
        "start": 1595.44,
        "end": 1597.44
    },
    {
        "text": " A veces para todo lo que esté más de ejemplo, si no facilita saber que es cuál es esta nettudión.",
        "start": 1602.44,
        "end": 1608.44
    },
    {
        "text": " Veo que el chat está civil, química, computación.",
        "start": 1609.44,
        "end": 1616.44
    },
    {
        "text": " Bueno, muy variado, comunicaciones.",
        "start": 1616.44,
        "end": 1619.44
    },
    {
        "text": " Perfect.",
        "start": 1624.44,
        "end": 1625.44
    },
    {
        "text": " Bueno, veo que también hay industria.",
        "start": 1629.44,
        "end": 1631.44
    },
    {
        "text": " Bueno, así que es un grupo muy variado, eso le suma mucho valor.",
        "start": 1631.44,
        "end": 1636.44
    },
    {
        "text": " Nosotros no usamos mucho más entretenida a las clases cuando son de creenciorientación.",
        "start": 1637.44,
        "end": 1641.44
    },
    {
        "text": " Ya habían hecho anteriormente algún curso de administración.",
        "start": 1645.44,
        "end": 1648.44
    },
    {
        "text": " No, sí, variado a las respuestas.",
        "start": 1656.44,
        "end": 1660.44
    },
    {
        "text": " Bueno, como les decía, anteriormente es fundamental, porque los va a posicionar diferentes cuando empiecen a trabajar o cuando incluso tengan su propio emprendimiento.",
        "start": 1661.44,
        "end": 1669.44
    },
    {
        "text": " El conocer estos conceptos básicos y el entender el funcionamiento de las organizaciones y también toda la parte comportamental que van a haber respuestas con Marcelo, de la comunicación, el liderazgo.",
        "start": 1669.44,
        "end": 1681.44
    },
    {
        "text": " Les suma mucho valor.",
        "start": 1681.44,
        "end": 1683.44
    },
    {
        "text": " Además, es algo diferente de lo que ustedes están acostumbrados en el resto de las materias que tienen, entonces también es algo complemental.",
        "start": 1684.44,
        "end": 1693.44
    },
    {
        "text": " ¿Qué hacen los gerentes?",
        "start": 1697.44,
        "end": 1699.44
    },
    {
        "text": " Bueno, acá vamos a hablar muchas veces de los gerentes y el rol de los gerentes y sus actividades.",
        "start": 1699.44,
        "end": 1705.44
    },
    {
        "text": " Para eso es importante que hagamos una definición inicial de todos aquellos conceptos que vamos a ir mencionando a la hora de los gerentes.",
        "start": 1706.44,
        "end": 1714.44
    },
    {
        "text": " Los gerentes se encargan de administrar, pero cuando decimos que se encargan de administrar, entonces tenemos que definir que es administrar.",
        "start": 1714.44,
        "end": 1721.44
    },
    {
        "text": " Y administrar es coordinar y supervisar las actividades laborales de otras personas de manera que se analizan de forma suficiente y eficaz.",
        "start": 1722.44,
        "end": 1731.44
    },
    {
        "text": " Por un lado van a ver como en toda organización una serie de actividades que se desarrollan y va a existir una persona que las va a coordinar, que las va a supervisar y que va a buscar que sean realizadas en forma eficia y eficaz, que ahora más adelante vamos a ver esos conceptos.",
        "start": 1732.44,
        "end": 1752.44
    },
    {
        "text": " Existen cuatro funciones en la administración, eso es muy relevante.",
        "start": 1753.44,
        "end": 1759.44
    },
    {
        "text": " Primero lo que hacemos es planificar toda la parte de planianción y allí lo que hacemos es definir los objetivos, vamos a establecer cuáles van a hacer las estrategias organizacionales, vamos a desarrollar los planes, como lo vamos a llevar adelante y vamos a coordinar los planes para poderlo ir o no coordinar esas actividades.",
        "start": 1759.44,
        "end": 1781.44
    },
    {
        "text": " Luego tenemos la capa de la organización y ahí vamos a determinar qué es lo que debemos hacer, cómo lo vamos a hacer y quién va a ser la persona que va a llevar adelante esas tareas.",
        "start": 1782.44,
        "end": 1795.44
    },
    {
        "text": " Luego viene la parte de dirección de todo eso comportamental, verdad el vínculo entre las personas, donde va a estar la motivación, la orientación, efectuar cualquiera de satidez involucradas en lo que es manejo del personal.",
        "start": 1795.44,
        "end": 1810.44
    },
    {
        "text": " Y por último viene la etapa de control, donde existe una supervisión de las actividades y lo que buscamos cuando nosotros hacemos ese etapa de control es asegurarnos que todo está funcionando de la manera que lo teníamos previsto.",
        "start": 1810.44,
        "end": 1826.44
    },
    {
        "text": " Desde en esa etapa de control yo lo podía amigar, verdad decir las cosas están desarrollando de la forma que tenía previsto. Por ejemplo, si en una fábrica de alpajores, verdad una persona al final de la cadena verifica, verdad si la cantidad de ucel hecho, como ha sido armado esa etapa, estamos haciendo un control, verdad.",
        "start": 1826.44,
        "end": 1851.44
    },
    {
        "text": " En ese caso es un control al final de la introducción.",
        "start": 1851.44,
        "end": 1858.44
    },
    {
        "text": " Bueno ahora sí, chequeado el tema que habían consultado de las PPT volvamos.",
        "start": 1861.44,
        "end": 1868.44
    },
    {
        "text": " En un poco, vimos algunos conceptos generales, verdad sobre la planificación, verdad que es fundamental y bueno, a las diferentes.",
        "start": 1868.44,
        "end": 1880.44
    },
    {
        "text": " Los diferentes puntos y ahora vamos a ver estos aspectos, ¿no? ¿Qué deterministramos? ¿Por qué es tan importante?",
        "start": 1881.44,
        "end": 1887.44
    },
    {
        "text": " La verdad que nosotros demos estos temas, por qué bueno, ametamos organizaciones. ¿Cómo es administras que hoy vimos algunos conceptos con eficacia y con eficiencia?",
        "start": 1887.44,
        "end": 1898.44
    },
    {
        "text": " ¿Inportancia de las organizaciones y su administración? Bueno, ¿qué es una organización? Porque bueno, en algún momento quizás que nomeremos en resa, pero este curso es también para las organizaciones en general.",
        "start": 1898.44,
        "end": 1916.44
    },
    {
        "text": " Cuando hablamos de organizaciones, están organizaciones con fines de lucro, pero también están las organizaciones sin fines de lucro, ¿verdad?",
        "start": 1916.44,
        "end": 1923.44
    },
    {
        "text": " Hay organizaciones de tipo público, organizaciones de tipo privada y para todas ellas es importante lo que es la administración y que ustedes tengan los conceptos.",
        "start": 1924.44,
        "end": 1933.44
    },
    {
        "text": " Después incluso vamos a ver algunas particularidades, ¿no? Vamos a ver por ejemplo qué características tienen las pequeñas y las medianas empresas, vamos a ver qué características tienen las empresas familiares, ¿recuerdan que esta primera clase es como un pantallazo inicial?",
        "start": 1933.44,
        "end": 1951.44
    },
    {
        "text": " ¿Perdad para que ustedes vean lo que es el curso en general y luego sí, a partir de la clase que viene ya vamos a poner más foco en todos esos puntos específicos? ¿Qué es una organización?",
        "start": 1951.44,
        "end": 1964.44
    },
    {
        "text": " Es un conjunto de personas que está constituido en una forma deliberada para cumplir un propósito específico. Para hacer una organización tiene que tener un propósito que esté bien definido,",
        "start": 1964.44,
        "end": 1976.44
    },
    {
        "text": " tiene que tener una estructura y tiene que tener personas, a que eso es un concepto fundamental para que podamos hablar de organización, tiene que haber personas.",
        "start": 1976.44,
        "end": 1986.44
    },
    {
        "text": " Algunas organizaciones, simplemente obviamente, a modo de ejemplo, la facultad ingeniería, es una organización, buena proele, es una organización de tipo cooperativo,",
        "start": 1989.44,
        "end": 1999.44
    },
    {
        "text": " la teletón es una organización sin fines de lucro, la usted es una organización pública, Samán, es una organización de tipo privado, la intensidad de un monte de vídeo,",
        "start": 1999.44,
        "end": 2012.44
    },
    {
        "text": " las instituciones financieras también son organizaciones, verdad del sector financiero. Entonces, todos estos temas que nosotros vamos a ir dando van a ser útiles, van a ser aplicables a todas las organizaciones.",
        "start": 2012.44,
        "end": 2028.44
    },
    {
        "text": " ¿Cuántos trabajan?",
        "start": 2028.44,
        "end": 2030.44
    },
    {
        "text": " A ver si levantan la mano.",
        "start": 2035.44,
        "end": 2037.44
    },
    {
        "text": " Muchos pocos.",
        "start": 2040.44,
        "end": 2041.44
    },
    {
        "text": " ¿Cuántos?",
        "start": 2041.44,
        "end": 2042.44
    },
    {
        "text": " Bueno, cuando los que trabajan van a empezar a visualizar, que todos estos puntos que nosotros estamos viendo, van a ser aplicables luego.",
        "start": 2047.44,
        "end": 2059.44
    },
    {
        "text": " Y a su vez, los que después pongan algún emprendimiento personal, porque seguramente, básicamente quizás alguno quise con algún emprendimiento, quizás de gran porto, quizás de menor porte, también van a ir aplicando todos estos conceptos.",
        "start": 2060.44,
        "end": 2076.44
    },
    {
        "text": " Así que bueno, creo que es muy importante. ¿Qué hace los gerentes? Esto lo vimos hoy, verdad, que se encargan de administrar, que se administrar, también lo vimos.",
        "start": 2076.44,
        "end": 2086.44
    },
    {
        "text": " ¿Por qué son importantes los gerentes? ¿Qué les parece a ustedes?",
        "start": 2087.44,
        "end": 2092.44
    },
    {
        "text": " ¿Se pueden una organización sin gerentes?",
        "start": 2094.44,
        "end": 2097.44
    },
    {
        "text": " Gonzalo.",
        "start": 2108.44,
        "end": 2109.44
    },
    {
        "text": " Vale, en que quiera comentar que les parece. ¿Se pueden una organización sin gerentes?",
        "start": 2110.44,
        "end": 2114.44
    },
    {
        "text": " ¿Se pueden una organización sin gerentes?",
        "start": 2117.44,
        "end": 2119.44
    },
    {
        "text": " ¿Se pueden una organización sin gerentes?",
        "start": 2122.44,
        "end": 2125.44
    },
    {
        "text": " ¿Se pueden una organización sin gerentes?",
        "start": 2125.44,
        "end": 2128.44
    },
    {
        "text": " ¿Podrían no haber alguien que es oficialmente un gerente, pero la función de gerente la va a terminar desempeñando alguien. Si la organización funciona.",
        "start": 2131.44,
        "end": 2140.44
    },
    {
        "text": " Es exacto, alguien en definitiva va a terminar haciendo la coordinación y la supervisión, en verdad, de las diferentes actividades.",
        "start": 2141.44,
        "end": 2148.44
    },
    {
        "text": " La siempre es necesario, incluso hasta cuando vamos a organizar un asado, alguien que tiene que coordinar todas las diferentes actividades,",
        "start": 2149.44,
        "end": 2156.44
    },
    {
        "text": " ahí alguien que termina sin darse cuenta veces tomando ese ron.",
        "start": 2156.44,
        "end": 2161.44
    },
    {
        "text": " Y esos gerentes tienen que tener ciertas habilidades y ciertas actitudes, que son muy particulares.",
        "start": 2162.44,
        "end": 2170.44
    },
    {
        "text": " Y más teniendo en cuenta lo que habíamos mencionado es un rapito, ¿verdad?",
        "start": 2170.44,
        "end": 2173.44
    },
    {
        "text": " De estos tiempos tan inciertos, tan complejos, tan caóticos, bueno, todo lo que fue el que no me lo de la pandemia.",
        "start": 2173.44,
        "end": 2180.44
    },
    {
        "text": " Entonces, bueno, resultan fundamentales para que las cosas se hagan, ordínale el entorno laboral y los sistemas de trabajo para que los demás puedan llevar a cabo de las tareas.",
        "start": 2181.44,
        "end": 2192.44
    },
    {
        "text": " Entonces, imaginen que es fundamental el rol que rende porque no es solo a nivel, de visualizar que las tareas se realizan.",
        "start": 2192.44,
        "end": 2201.44
    },
    {
        "text": " También también hay temas de comportamiento, tienen que en cierta manera visualizar un montón de cosas que van sucediendo, tienen que motivar, tienen que apoyar a los funcionarios, cúmrenos un rol fundamental en la comunicación.",
        "start": 2202.44,
        "end": 2215.44
    },
    {
        "text": " Después lo vamos a ver, pero realmente es muy importante el rol que llega a un gerente dentro de la organización y los cambios que puede llevar en esa organización,",
        "start": 2215.44,
        "end": 2227.44
    },
    {
        "text": " cuando un gerente no es positivo, ¿verdad? Bueno, ¿qué es lo que luego termina sucediendo con ese equipo de trabajo y cuando el equipo de trabajo no está bien que lo que termina pasando con el desempeño?",
        "start": 2227.44,
        "end": 2239.44
    },
    {
        "text": " Hay muchos estudios con respecto a lo que se el clima laboral y como influye luego en lo que se ha resultado final.",
        "start": 2239.44,
        "end": 2248.44
    },
    {
        "text": " Entonces, es muy importante el rol de un gerente pues vamos a ver más adelante las características que tiene que tener ese gerente.",
        "start": 2248.44,
        "end": 2257.44
    },
    {
        "text": " Bueno, los conceptos que mencionamos hoy varias veces hablamos, ¿no? De que tenía el casado con eficiencia y con eficacia, pero bueno, no llegamos a definirlos.",
        "start": 2260.44,
        "end": 2268.44
    },
    {
        "text": " Bueno, cuando hablamos de ser eficientes, esas cosas bien o lograron resultados a partir de la menor cantidad.",
        "start": 2268.44,
        "end": 2274.44
    },
    {
        "text": " Esto es algo que seguramente en otras materias ya lo han escuchado, cuando yo tengo que evitar reduzar más de lo que necesito para cumplir.",
        "start": 2274.44,
        "end": 2285.44
    },
    {
        "text": " Es el control de los recursos que se ensuno.",
        "start": 2285.44,
        "end": 2290.44
    },
    {
        "text": " Y cuando lo deficacia, esas son los correctos o llevar a cabo las artividades laborales que llevaran en el logro de los objetivos de la empresa.",
        "start": 2290.44,
        "end": 2298.44
    },
    {
        "text": " Entonces, tiene como una foca diferente, uno que va más enfocada lo que es el uso de los recursos y el otro verdad que habla del logro de los objetivos de la empresa.",
        "start": 2298.44,
        "end": 2312.44
    },
    {
        "text": " Acabemos que algo es esficiente, que tiene poco del paradigio y cuando algo es eficaz, hablamos de los logros.",
        "start": 2313.44,
        "end": 2324.44
    },
    {
        "text": " La administración tiene entonces ese doble juego de forzarse por desparmiciar pocos recursos,",
        "start": 2324.44,
        "end": 2332.44
    },
    {
        "text": " que en lo que es la actividad industrial hay mucho estudio, de lo que son las mermas, de qué forma lograr ser más eficientes.",
        "start": 2333.44,
        "end": 2341.44
    },
    {
        "text": " Hay incluso diseño industrial, para lograr que el espardicio disminuya y analizar, justamente en cada uno de las partes donde podemos mejorar.",
        "start": 2341.44,
        "end": 2352.44
    },
    {
        "text": " Y entonces tenemos que esa administración se fuerza por desparmiciar pocos recursos, que es una alta eficiencia y lograr los objetivos.",
        "start": 2353.44,
        "end": 2362.44
    },
    {
        "text": " Esa son las dos cosas que una administración debería de poder conseguir.",
        "start": 2362.44,
        "end": 2367.44
    },
    {
        "text": " Las cuatro funciones de la administración que las vimos hoy, planear, organizar, direccionar y controlar, esto ya lo vimos.",
        "start": 2368.44,
        "end": 2381.44
    },
    {
        "text": " No sé si hay alguna duda hasta acá.",
        "start": 2381.44,
        "end": 2384.44
    },
    {
        "text": " ¿Qué pasa?",
        "start": 2385.44,
        "end": 2387.44
    },
    {
        "text": " ¡Rolegerenciales!",
        "start": 2391.44,
        "end": 2395.44
    },
    {
        "text": " Este es un tema muy lindo.",
        "start": 2395.44,
        "end": 2397.44
    },
    {
        "text": " Este autor lo que hace es dividir los roles entre los que son interpersonales, que ellos van involucradas a las personas.",
        "start": 2397.44,
        "end": 2408.44
    },
    {
        "text": " Luego los roles informativos, están vinculados a todo lo que es la información, y luego tenemos los roles decisorios.",
        "start": 2409.44,
        "end": 2418.44
    },
    {
        "text": " A todos los roles son importantes, realmente.",
        "start": 2418.44,
        "end": 2422.44
    },
    {
        "text": " O sea, el manejo interprersonal, el usar correctamente la información, el distribuir correctamente la información, el captar correctamente la información.",
        "start": 2422.44,
        "end": 2434.44
    },
    {
        "text": " Y bueno, luego haya sido importante tomar buenas decisiones, muchas empresas han fracasado y han terminado desapareciendo justamente por errores en lo que son las tomas de decisiones.",
        "start": 2435.44,
        "end": 2448.44
    },
    {
        "text": " ¿Por qué sinto el personal?",
        "start": 2449.44,
        "end": 2453.44
    },
    {
        "text": " Haga tenemos representante líder enlace.",
        "start": 2453.44,
        "end": 2460.44
    },
    {
        "text": " A representante como aquí ya figura visible de la organización, líder, como aquella que lidera y motiva a sus grupos, y luego tenemos la dellace, ¿verdad?",
        "start": 2461.44,
        "end": 2477.44
    },
    {
        "text": " Que es la que conecta a la organización.",
        "start": 2477.44,
        "end": 2481.44
    },
    {
        "text": " Roles informativos, aquí tenemos el role monitor, el role de difusor, el role de portavoz.",
        "start": 2482.44,
        "end": 2493.44
    },
    {
        "text": " Cuando hablamos de monitor, esto es la parte de captación de la información.",
        "start": 2493.44,
        "end": 2498.44
    },
    {
        "text": " Cuando yo busco, por ejemplo, en las noticias, los querientes se muy habitual que al inicio del día lean las noticias, o por ejemplo los que trabajan en el sector financiero, como en el caso.",
        "start": 2498.44,
        "end": 2510.44
    },
    {
        "text": " Que se que inician el día, le dan las pantallas de número, información relativa, lo que sucede en el sector.",
        "start": 2511.44,
        "end": 2519.44
    },
    {
        "text": " Luego difusor, la que es cuando dentro de la organización nosotros trasladamos lo que entendemos que es importante, usas insueros detectamos algo, ¿verdad?",
        "start": 2519.44,
        "end": 2530.44
    },
    {
        "text": " Y luego tenemos que trasladar a otros, ahí estamos cumpliendo el role de difusor, y luego tenemos portavoz, ¿qué les parece que es portavoz?",
        "start": 2531.44,
        "end": 2542.44
    },
    {
        "text": " Y quién básicamente, o sea, luego de una reunión de los gerentes, por decir así, informa a toda la población, en este caso, por ejemplo, los estudiantes.",
        "start": 2545.44,
        "end": 2558.44
    },
    {
        "text": " Perfecto. Portavoz es cuando es externo, o sea, afuera de la organización, como tu bien decía, de la población, al público, cuando, por ejemplo, la persona da una nota de prensa, ahí es un caso de portavoz.",
        "start": 2559.44,
        "end": 2575.44
    },
    {
        "text": " Ah, todos esos son ejemplas de portavoz.",
        "start": 2575.44,
        "end": 2578.28
    },
    {
        "text": " Difusor puede ser, por ejemplo, mediante un informe, en verdad, interno, que se estuvo en información, o simplemente una llamada por teléfono, en verdad, comentándole a un compañero de trabajo, algo que nos parece interesante de trasladar.",
        "start": 2578.28,
        "end": 2592.44
    },
    {
        "text": " Y luego recaltar la importancia de ser monitores, de poder captar la información.",
        "start": 2592.44,
        "end": 2598.44
    },
    {
        "text": " Hoy en día, hay muchos textos que justamente hablan del exceso de información, que existe hoy, no, a día realmente hay mucha información que está en la vuelta, bueno, de qué forma también seleccionamos adecuadamente lo que suci elivalioso para la empresa, la que estamos, ¿no?",
        "start": 2598.44,
        "end": 2618.44
    },
    {
        "text": " ¿Roles decisorios? Ah, acá tenemos los roles de empreendedor, tenemos el solucionador de conflictos, el asignador de recursos, que es muy importante, que es cuando determinamos, como vamos a asignar los fondos dentro de la organización, ¿verdad? ¿Cuánto dinero vamos a destinar a cada una de las actividades?",
        "start": 2618.44,
        "end": 2647.44
    },
    {
        "text": " Y luego tenemos la parte de negociación, que la negociación es algo muy importante, no sé si en la carrera ustedes tienen una materia que sea negociación, pero bueno, sé que en otras carreras sí, no sé si algunos me comenta, si ustedes han tenido algún curso de negociación.",
        "start": 2647.44,
        "end": 2664.44
    },
    {
        "text": " Pero bueno, siempre tenemos que negociar a nivel personal, a nivel laboral, no es, es una función muy, un rol muy importante.",
        "start": 2664.44,
        "end": 2678.44
    },
    {
        "text": " ¿Hayan escuchado del autor Robert Katz, habla de las habilidades gerenciales?",
        "start": 2678.44,
        "end": 2687.44
    },
    {
        "text": " ¿Qué es silenci?",
        "start": 2687.44,
        "end": 2701.44
    },
    {
        "text": " Robert Katz plantea que los gerenes necesitan encontrar con tres conjuntos de habilidades fundamentales, por un lado el conocimiento técnico, que cuando hablamos de técnico es saber hacer las cosas, cuando nosotros ingresamos un puesto laboral,",
        "start": 2701.44,
        "end": 2718.44
    },
    {
        "text": " se nos enseña hacer si artistaria, si nosotros vamos a escribir una destresa técnica con respecto a esa tarea.",
        "start": 2718.44,
        "end": 2726.44
    },
    {
        "text": " Por ejemplo, una institución financiera cuando una persona ingresa, por ejemplo, en la área de créditos se les enseña técnicamente como es la emisión de un vale por el sistema,",
        "start": 2726.44,
        "end": 2737.44
    },
    {
        "text": " y todas las características que tiene que tener esa operación, creen que todos los aspectos, que ese funcionario técnicamente tiene que considerar.",
        "start": 2737.44,
        "end": 2747.44
    },
    {
        "text": " Pero luego hay otras cosas que también son importantes, y que los gerenes tienen que contar, y que ahora vamos a ver que en la medida que vamos a aumentar de algunas habilidades que son más importantes que otras.",
        "start": 2747.44,
        "end": 2761.44
    },
    {
        "text": " Y es humano, para todo lo que habíamos hablado de la importancia en el relacionamiento con nosotros, bueno, eso es parte de las habilidades gerenciales.",
        "start": 2762.44,
        "end": 2771.44
    },
    {
        "text": " Y luego tenemos la habilidad conceptual, cuando estamos en los niveles más altos, adquiere protagonismo, a que es ver la organización como un todo, que eso es muy importante.",
        "start": 2771.44,
        "end": 2785.44
    },
    {
        "text": " A ustedes le parece que la habilidad técnica, cuando estamos en los niveles más altos, es muy importante.",
        "start": 2785.44,
        "end": 2795.44
    },
    {
        "text": " Deja de ser tan crucial.",
        "start": 2796.44,
        "end": 2805.44
    },
    {
        "text": " Exacto. Un poco el autor lo que marca es eso, que la importancia de esa habilidad técnica, verdad, en los gerenes, en niveles más altos, ven que se ve como más clarito, empieza a disiparse.",
        "start": 2805.44,
        "end": 2821.44
    },
    {
        "text": " ¿Por qué? Porque la habilidad técnica, me va a dar ya no es ese, es tan importante, sino que la habilidad conceptual va a empezar a hacer más importante cuando estamos en los niveles más altos.",
        "start": 2821.44,
        "end": 2836.44
    },
    {
        "text": " Y luego, bueno, la habilidad de sus manos claramente en todos los niveles son importantes, porque el relacionamiento, el buen vínculo, el diálogo, la comunicación, la participación, entonces eso es fundamenta.",
        "start": 2836.44,
        "end": 2850.44
    },
    {
        "text": " Pero lo técnico empieza a disipujarse cuando estamos en los niveles más altos, que no significa que no lo sepan hacer o que si lo tienen que hacer, no lo puedan hacer, simplemente que ya quizás que no ponen el foco para dar esa habilidad técnica y si se pone un foco más en una habilidad más conceptual.",
        "start": 2850.44,
        "end": 2873.44
    },
    {
        "text": " ¿Dienes que nosotros?",
        "start": 2874.44,
        "end": 2875.44
    },
    {
        "text": " Hablidades concepales.",
        "start": 2875.44,
        "end": 2879.44
    },
    {
        "text": " Es cuando nosotros entendemos la organización como un todo, cuando la vemos desde el exterior y la interpretamos, verdad, en su funcionamiento de una forma más completa, ¿verdad?",
        "start": 2879.44,
        "end": 2893.44
    },
    {
        "text": " Y luego lo vamos a ver quizás que con, con ejemplos.",
        "start": 2893.44,
        "end": 2897.44
    },
    {
        "text": " Claro, porque queda muy conérico, o sea, habilidades concepales, ver la organización como un todo, como que no es muy, no es muy, no es un diálogo, como bueno es muy específico con lo que...",
        "start": 2897.44,
        "end": 2907.44
    },
    {
        "text": " Sí, es un gran...",
        "start": 2907.44,
        "end": 2909.44
    },
    {
        "text": " Es un gran comprensión mayor de la organización.",
        "start": 2909.44,
        "end": 2914.44
    },
    {
        "text": " Es verla como apartando de esos temas justamente específicos y técnicos y entender cómo funciona la organización, qué es lo que influye la organización, qué características generales tiene la organización.",
        "start": 2914.44,
        "end": 2931.44
    },
    {
        "text": " Hay una frase que siempre dicen que es ver el busque, ¿no? Y eso es lo que se logra justamente con esa habilidad conceptual.",
        "start": 2931.44,
        "end": 2940.44
    },
    {
        "text": " No, no, no, no, no pared de tallo, no, sino como que ver más en en en generico y en más subtrátil, más desde lejos, lo que es la lo que es la organización.",
        "start": 2941.44,
        "end": 2952.44
    },
    {
        "text": " Bueno, varias veces hablamos de niveles gerenciales. Digimos que habían algunos aspectos que en los altos niveles no eran tan tan significativos como en...",
        "start": 2958.44,
        "end": 2968.44
    },
    {
        "text": " En los otros, pero bueno, vamos a ver acá en este gráficamente",
        "start": 2968.44,
        "end": 2973.04
    },
    {
        "text": " que aquí nos reiterimos cuando mencionamos a los niveles",
        "start": 2973.04,
        "end": 2975.88
    },
    {
        "text": " gerenciales.",
        "start": 2975.88,
        "end": 2977.44
    },
    {
        "text": " Acá tenemos gerences de alto nivel.",
        "start": 2977.44,
        "end": 2980.68
    },
    {
        "text": " A veces los responsables de tomar las decisiones de amplio",
        "start": 2982.92,
        "end": 2985.04
    },
    {
        "text": " espectro de establecer los planes y los objetivos que afectan",
        "start": 2985.04,
        "end": 2987.7000000000003
    },
    {
        "text": " a empresa.",
        "start": 2987.7000000000003,
        "end": 2988.7200000000003
    },
    {
        "text": " Y para eso, necesito mucho de las habilidades conceptuales",
        "start": 2988.7200000000003,
        "end": 2991.6
    },
    {
        "text": " que hablábamos recién, no, poder entender la organización",
        "start": 2991.6,
        "end": 2994.8
    },
    {
        "text": " como un todo me va a permitir para poder tomar",
        "start": 2994.8,
        "end": 2997.8
    },
    {
        "text": " esas decisiones que van a afectar a toda la organización.",
        "start": 2998.28,
        "end": 3002.1600000000003
    },
    {
        "text": " Cuando hablamos de habilidades conceptuales, nos",
        "start": 3002.1600000000003,
        "end": 3006.1800000000003
    },
    {
        "text": " referimos también a eso.",
        "start": 3006.1800000000003,
        "end": 3007.44
    },
    {
        "text": " Cuando estamos en la parte más operativa,",
        "start": 3007.44,
        "end": 3009.0800000000004
    },
    {
        "text": " como con las trans decisiones tienen una influencia más",
        "start": 3009.0800000000004,
        "end": 3013.5800000000004
    },
    {
        "text": " pequeña, verdad?",
        "start": 3013.5800000000004,
        "end": 3014.6000000000004
    },
    {
        "text": " Y no tienen un conocimiento tan general de lo que es la",
        "start": 3014.6000000000004,
        "end": 3017.5
    },
    {
        "text": " organización, los que están en los sectores más operativos.",
        "start": 3017.5,
        "end": 3020.6000000000004
    },
    {
        "text": " Y cuando nosotros vamos aumentando el nivel gerencial,",
        "start": 3020.6000000000004,
        "end": 3024.1200000000003
    },
    {
        "text": " ahí empezamos a tomar las decisiones de una forma diferente.",
        "start": 3024.1200000000003,
        "end": 3027.0800000000004
    },
    {
        "text": " Luego tenemos los gerences de nivel medio,",
        "start": 3028.6800000000003,
        "end": 3030.48
    },
    {
        "text": " que son los que van dirigiendo el trabajo de los gerences",
        "start": 3030.48,
        "end": 3032.96
    },
    {
        "text": " de primera línea.",
        "start": 3032.96,
        "end": 3034.4
    },
    {
        "text": " Luego tenemos los gerenes de primera línea,",
        "start": 3034.4,
        "end": 3036.2000000000003
    },
    {
        "text": " que de bajo de ellos los que a los van a hacer no gerenciales.",
        "start": 3036.2000000000003,
        "end": 3041.2000000000003
    },
    {
        "text": " Ahí esa es la gran diferencia.",
        "start": 3041.2000000000003,
        "end": 3044.36
    },
    {
        "text": " Van a hacer funcionarios más de tipo operativos.",
        "start": 3044.36,
        "end": 3046.8
    },
    {
        "text": " Cuando podemos, por ejemplo, una fábrica,",
        "start": 3046.8,
        "end": 3051.0800000000004
    },
    {
        "text": " va a estar el geren de alto nivel, que seguramente sea el",
        "start": 3051.0800000000004,
        "end": 3054.28
    },
    {
        "text": " geren de general.",
        "start": 3054.28,
        "end": 3055.6400000000003
    },
    {
        "text": " Luego los gerences de nivel medio, que cuales les parece",
        "start": 3055.64,
        "end": 3058.04
    },
    {
        "text": " que sería.",
        "start": 3058.04,
        "end": 3058.56
    },
    {
        "text": " Jefe de planta, producción, no sé.",
        "start": 3066.7999999999997,
        "end": 3069.92
    },
    {
        "text": " Quizás que se estaría más abajo, nivel medio, quizás",
        "start": 3069.92,
        "end": 3072.4
    },
    {
        "text": " que estaría el gerente de finanzas, el gerente comercial,",
        "start": 3072.4,
        "end": 3076.56
    },
    {
        "text": " los caros gerenciales.",
        "start": 3076.56,
        "end": 3078.56
    },
    {
        "text": " Luego sí que en esta parte ya tendrías",
        "start": 3081.7999999999997,
        "end": 3085.4
    },
    {
        "text": " gerencias más operativas.",
        "start": 3085.4,
        "end": 3087.04
    },
    {
        "text": " Las empresas, uruallas son mayoritariamente pequeñas",
        "start": 3092.04,
        "end": 3095.32
    },
    {
        "text": " y mecanas empresas.",
        "start": 3095.32,
        "end": 3096.84
    },
    {
        "text": " Entonces, a veces, cuando queremos aplicar esto a la realidad",
        "start": 3096.84,
        "end": 3099.7200000000003
    },
    {
        "text": " urualla, quizás que son muy pocas las empresas que tienen",
        "start": 3099.7200000000003,
        "end": 3103.1600000000003
    },
    {
        "text": " una estructura tan grande, que tengan gerences generales y que",
        "start": 3103.1600000000003,
        "end": 3107.64
    },
    {
        "text": " después tengan gerences, por cada una de las funciones del",
        "start": 3107.64,
        "end": 3112.44
    },
    {
        "text": " empresa, que después tengan asubes, jefaturas.",
        "start": 3112.44,
        "end": 3116.7200000000003
    },
    {
        "text": " No son muchas las empresas con estas características.",
        "start": 3116.7200000000003,
        "end": 3120.12
    },
    {
        "text": " No sé si algunos ustedes trabajan en alguna empresa que",
        "start": 3120.12,
        "end": 3123.2400000000002
    },
    {
        "text": " tenga más un carente.",
        "start": 3123.2400000000002,
        "end": 3124.56
    },
    {
        "text": " Muchas empresas uruallas tienen un único geren de verdad,",
        "start": 3136.08,
        "end": 3138.7200000000003
    },
    {
        "text": " que va activiendo, va realizando diferenciaciones,",
        "start": 3138.72,
        "end": 3142.56
    },
    {
        "text": " la parte comercial, la parte administrativa.",
        "start": 3142.56,
        "end": 3145.16
    },
    {
        "text": " Pero bueno, lo ideal es que cuando las empresas se empiezan",
        "start": 3145.16,
        "end": 3147.16
    },
    {
        "text": " a aumentar su porte, empiezan a generar formalización,",
        "start": 3147.16,
        "end": 3150.8399999999997
    },
    {
        "text": " verdad, empiezan a dividir en diferentes líneas de gerences.",
        "start": 3150.8399999999997,
        "end": 3153.9199999999996
    },
    {
        "text": " Algunas dudas acá?",
        "start": 3163.8799999999997,
        "end": 3165.0
    },
    {
        "text": " Tus dudas, tus plantos.",
        "start": 3169.4399999999996,
        "end": 3171.04
    },
    {
        "text": "dugas, rodend regarde el donate.*",
        "start": 3171.04,
        "end": 3173.64
    },
    {
        "text": " Botos de gerencer clasesaganes",
        "start": 3173.64,
        "end": 3175.72
    },
    {
        "text": " Es protectable.",
        "start": 3175.72,
        "end": 3177.24
    },
    {
        "text": " No solo las dudas misleading así, pero la連zo de gerencer",
        "start": 3177.24,
        "end": 3179.9599999999996
    },
    {
        "text": " formedará unенным organismo de construcción fla balóno,",
        "start": 3179.9599999999996,
        "end": 3183.24
    },
    {
        "text": " fairsmith, cont ever, y la towera sous desatista.",
        "start": 3183.24,
        "end": 3187.04
    },
    {
        "text": " Una la cursa para o Launchur массa sine,",
        "start": 3187.04,
        "end": 3188.64
    },
    {
        "text": " Xbox 360, Apple 2 Razor,",
        "start": 3188.64,
        "end": 3190.2599999999998
    },
    {
        "text": " el intro y para elante de gerencer.",
        "start": 3190.2599999999998,
        "end": 3191.56
    },
    {
        "text": " queen.",
        "start": 3191.56,
        "end": 3192.3599999999997
    },
    {
        "text": " Caller, el peu final!",
        "start": 3192.3599999999997,
        "end": 3193.3599999999997
    },
    {
        "text": " Es que lo jaw isnít funny.",
        "start": 3193.3599999999997,
        "end": 3195.2799999999997
    },
    {
        "text": " Los artistas del Cielo32 lo hacen propaganda todo,",
        "start": 3195.2799999999997,
        "end": 3196.72
    },
    {
        "text": " laystos vampires y las zonotrans identicalздores.",
        "start": 3196.72,
        "end": 3198.64
    },
    {
        "text": " Ahora vamos a hacer una dinámica en grupo, vieron que vimos los diferentes tipos de roles",
        "start": 3198.64,
        "end": 3213.52
    },
    {
        "text": " y la idea es que ustedes en grupo busquen ejemplos de esos roles y vamos a comparar si está",
        "start": 3213.52,
        "end": 3222.68
    },
    {
        "text": " correo o no en base a lo que plantea el auto, así ahora vamos a mandar a grupos.",
        "start": 3222.68,
        "end": 3226.92
    },
    {
        "text": " Bueno ahora sí estamos retornando de los grupos, la idea era que buscar en ejemplos de la",
        "start": 3226.92,
        "end": 3247.64
    },
    {
        "text": " vida práctica, ejemplos de quizás genoticias de prensas que hayan leído recientemente,",
        "start": 3247.64,
        "end": 3254.28
    },
    {
        "text": " de los propios trabajos y que podamos visualizar estos diferentes tipos de roles y buscar ejemplos.",
        "start": 3254.28,
        "end": 3261.96
    },
    {
        "text": " Así vamos, esperamos un poquito que se conecten todos nuevamente.",
        "start": 3261.96,
        "end": 3265.28
    },
    {
        "text": " Vamos a frenando que vuelvan a reinvizar los grupos.",
        "start": 3265.28,
        "end": 3283.84
    },
    {
        "text": " Bueno ahora sí, ya bonimos. No un poco lo que les comentaba, la idea es buscar ejemplos",
        "start": 3283.84,
        "end": 3299.96
    },
    {
        "text": " prácticos, a la de ejemplos de quizás notas de prensa que ustedes hayan leído recientemente",
        "start": 3299.96,
        "end": 3304.8
    },
    {
        "text": " o de conocimiento que ustedes tengan por las empresas que trabajan o por conocidos o ejemplos",
        "start": 3304.8,
        "end": 3310.96
    },
    {
        "text": " que simplemente se le se le ocurren para un poco llevar a tierra lo que son estos conceptos",
        "start": 3310.96,
        "end": 3316.92
    },
    {
        "text": " que plasman este autor, que han reinvizado y que plantea estos roles gerenciales.",
        "start": 3316.92,
        "end": 3323.16
    },
    {
        "text": " Lo que el intendó hacer de cierta forma puede tratar de encaciar a aquellos roles que el",
        "start": 3323.16,
        "end": 3329.92
    },
    {
        "text": " visualizaban los gerenes y dividirlos en tres grandes grupos por un lado, los vinculados",
        "start": 3329.92,
        "end": 3335.8
    },
    {
        "text": " en interprosional por otro lado lo vinculado al informativo y por otro lo decisorial.",
        "start": 3335.8,
        "end": 3341.92
    },
    {
        "text": " Vamos a arrancar por el primero, aquel role de interprosional, ¿qué ejemplos encontraron?",
        "start": 3341.92,
        "end": 3365.6400000000003
    },
    {
        "text": " No, que silencio.",
        "start": 3365.64,
        "end": 3370.7999999999997
    },
    {
        "text": " Bueno, ahí vemos en el grupo claro, cuando hablamos del representante sí, que es la cara",
        "start": 3370.7999999999997,
        "end": 3390.64
    },
    {
        "text": " visible de la empresa, cuando nosotros vemos cierta empresa, nosotros muchas veces la identificamos",
        "start": 3390.64,
        "end": 3397.24
    },
    {
        "text": " con cierta persona que está atrás de ella como representante. ¿Qué le parece que es líder?",
        "start": 3397.24,
        "end": 3404.04
    },
    {
        "text": " ¿Qué hace un querente cuando es líder?",
        "start": 3404.04,
        "end": 3414.2799999999997
    },
    {
        "text": " Cuando, por ejemplo, junta a su equipo y los motiva para llevar adelante algún tipo de cambio",
        "start": 3414.28,
        "end": 3428.44
    },
    {
        "text": " de la empresa y está ejerciendo su liderazgo cuando comunica, pero todo vinculado lo interprosional.",
        "start": 3428.44,
        "end": 3436.6800000000003
    },
    {
        "text": " Luego enlace, cuando, por ejemplo, realiza reuniones con personas externas a la organización,",
        "start": 3436.68,
        "end": 3445.04
    },
    {
        "text": " por ejemplo, cuando mantiene una reunión con una persona de otra empresa, pero de un ruro",
        "start": 3445.04,
        "end": 3452.04
    },
    {
        "text": " similar y que quizás lo hace para generar un contacto, para después en un futuro quizás que",
        "start": 3452.04,
        "end": 3457.72
    },
    {
        "text": " pueda lograr una alianza estratégica.",
        "start": 3457.72,
        "end": 3462.04
    },
    {
        "text": " Rolles informativos, ejemplos de monitor, ¿cómo caja información un querente?",
        "start": 3462.04,
        "end": 3469.72
    },
    {
        "text": " ¿Qué les parece? Algunos ejemplos lo dimos hoy cuando dimos teoricamente.",
        "start": 3469.72,
        "end": 3476.3999999999996
    },
    {
        "text": " Por ejemplo, cuando se leen las noticias, cuando se leen los reportes, cuando se pién,",
        "start": 3476.4,
        "end": 3487.36
    },
    {
        "text": " informes estadísticos, cuando nosotros sacamos, por ejemplo, datos de la población y los analizamos,",
        "start": 3487.36,
        "end": 3495.2000000000003
    },
    {
        "text": " todo eso forma parte de lo que es monitor, la captación de la información.",
        "start": 3495.2000000000003,
        "end": 3501.44
    },
    {
        "text": " Discusor que ejemplo tienen.",
        "start": 3501.6,
        "end": 3505.92
    },
    {
        "text": " Discusores dentro de la organización. Cuando nosotros,",
        "start": 3518.7200000000003,
        "end": 3524.12
    },
    {
        "text": " lindamos información en el chat. Perfecto, man, como bien,",
        "start": 3524.12,
        "end": 3531.24
    },
    {
        "text": " dices, difundir lo que se resuelven las altas esferas.",
        "start": 3531.24,
        "end": 3534.08
    },
    {
        "text": " Y también lo que dice, gustina está muy bien, difundir información dentro de la interna.",
        "start": 3534.08,
        "end": 3540.72
    },
    {
        "text": " Trasla a los objetivos de la empresa. Perfecto, perfecto, manégenia.",
        "start": 3540.72,
        "end": 3546.6
    },
    {
        "text": " Muy bien, todos esos son ejemplos, verdad, de discusor.",
        "start": 3546.6,
        "end": 3551.44
    },
    {
        "text": " Cuando hablamos de portavos, ahí es cuando estamos por fuera de la organización.",
        "start": 3552.44,
        "end": 3559.4
    },
    {
        "text": " Ya no le estamos diciendo a nuestros compañeros de trabajo,",
        "start": 3559.4,
        "end": 3562.6
    },
    {
        "text": " ¿verdad? Como algunas características de información que captamos en la interna,",
        "start": 3562.6,
        "end": 3568.48
    },
    {
        "text": " sino que cuando vamos al portavoz estamos en la exterior de la organización.",
        "start": 3568.48,
        "end": 3572.7200000000003
    },
    {
        "text": " Roles decisorios, emprendedor. ¿Qué les parece que es emprendedor?",
        "start": 3573.72,
        "end": 3579.2799999999997
    },
    {
        "text": " Cuando emprendemos a sumimos riesgos, tomamos decisiones importantes para la empresa",
        "start": 3587.2799999999997,
        "end": 3594.3599999999997
    },
    {
        "text": " que puede incluso significar un cambio de rumbo. Exacto, gustinbúcanos oportunidades de negocios.",
        "start": 3594.3599999999997,
        "end": 3601.48
    },
    {
        "text": " Perfecto, manégenia también. Es una forma muchas veces de poder arrabar la competitividad de la empresa.",
        "start": 3603.72,
        "end": 3610.72
    },
    {
        "text": " Está muy bien también lo que dice Dehne, Garato, los aspectos de inversiones.",
        "start": 3610.72,
        "end": 3616.72
    },
    {
        "text": " ¿Qué más?",
        "start": 3621.72,
        "end": 3622.72
    },
    {
        "text": " Luego tenemos solucionador de conflictos que ahí en otras textos se está como piloto",
        "start": 3624.72,
        "end": 3631.72
    },
    {
        "text": " de tormenta o manejador de perturbaciones. Y un ejemplo que nosotros dábamos en las clases en un momento,",
        "start": 3631.72,
        "end": 3639.72
    },
    {
        "text": " fue cuando yo pinta escluses, yo no sé si recuerdan que había tenido un incendio.",
        "start": 3639.72,
        "end": 3645.72
    },
    {
        "text": " Y hablábamos del rol que había tenido que cumplir el gerente en ese momento,",
        "start": 3645.72,
        "end": 3649.72
    },
    {
        "text": " que no era la operativa clásica de la empresa, sino que tuvo que gestionar",
        "start": 3649.72,
        "end": 3655.72
    },
    {
        "text": " en una situación bastante diferente. Entonces, es un caso de solucionar conflictos o problemas",
        "start": 3655.72,
        "end": 3664.72
    },
    {
        "text": " en las organizaciones. No es solo generar nuevos rumos, sino que también muchas veces tenemos que solucionar situaciones que se tienen.",
        "start": 3664.72,
        "end": 3677.72
    },
    {
        "text": " Luego tenemos la parte de asignar recursos, eso es fundamental.",
        "start": 3678.72,
        "end": 3684.72
    },
    {
        "text": " Siempre tengan en cuenta que cuando vamos a asignar recursos, esos recursos tienen que estar vinculados",
        "start": 3684.72,
        "end": 3690.72
    },
    {
        "text": " a lo que nosotros queremos para nuestra empresa.",
        "start": 3690.72,
        "end": 3694.72
    },
    {
        "text": " Siempre es algo que a veces se plantea porque muchas veces las empresas tienen un objetivo.",
        "start": 3694.72,
        "end": 3700.72
    },
    {
        "text": " Porque si, bueno, yo quiero que mis productos se diferencien, que mis productos tengan una alta calidad",
        "start": 3701.72,
        "end": 3710.72
    },
    {
        "text": " que sean distinguidos por nuestros clientes. Pero en ese caso, yo tengo que asignar los recursos,",
        "start": 3710.72,
        "end": 3717.72
    },
    {
        "text": " justamente para que la estructura de mi empresa me permita cumplir con esa estrategia que yo tengo.",
        "start": 3717.72,
        "end": 3724.72
    },
    {
        "text": " Siempre la asignación que yo haga de recursos tiene que estar vinculada a mi estrategia.",
        "start": 3725.72,
        "end": 3730.72
    },
    {
        "text": " No es muy importante incluso los objetivos que yo me planteé.",
        "start": 3730.72,
        "end": 3735.72
    },
    {
        "text": " Por ejemplo, si yo quiero aumentar las ventas, ¿cómo lo voy a hacer con un equipo de venta?",
        "start": 3735.72,
        "end": 3740.72
    },
    {
        "text": " Bueno, entonces voy a tener casi más recursos a ese equipo de venta.",
        "start": 3740.72,
        "end": 3744.72
    },
    {
        "text": " Y es un rol muy importante en la zona de los recursos.",
        "start": 3744.72,
        "end": 3749.72
    },
    {
        "text": " Y luego está el negociador que recién hace un ratito en el chat, lo estaba hablando.",
        "start": 3750.72,
        "end": 3755.72
    },
    {
        "text": " Que es un rol muy importante.",
        "start": 3755.72,
        "end": 3758.72
    },
    {
        "text": " Y poder generar una negociación y luego tomar una decisión a posterior y una negociación.",
        "start": 3758.72,
        "end": 3766.72
    },
    {
        "text": " Algunas dudas acá.",
        "start": 3768.72,
        "end": 3770.72
    },
    {
        "text": " Tengo en en cuenta que al final de todas las clases ustedes van a poder ver las presentaciones que van a quedar por la edad para poder repasarlas.",
        "start": 3771.72,
        "end": 3781.72
    },
    {
        "text": " Y a su vez también van a tener la posibilidad de buscar el texto que fue el que les mencionamos y poder profundizar las preguntas.",
        "start": 3781.72,
        "end": 3792.72
    },
    {
        "text": " Eso es algo importante. Las preguntas van a surgir de los textos.",
        "start": 3793.72,
        "end": 3798.72
    },
    {
        "text": " O sea que toda pregunta que se realice va a estar en el texto.",
        "start": 3798.72,
        "end": 3802.72
    },
    {
        "text": " Por eso es importante que lean los materiales que van a tener disponibles.",
        "start": 3802.72,
        "end": 3807.72
    },
    {
        "text": " Y vuelvo a repetir que en el chat habían consultado que no se puede estudiar de la presentación.",
        "start": 3807.72,
        "end": 3815.72
    },
    {
        "text": " Tienen que estudiar de los materiales o visualizar las clases.",
        "start": 3816.72,
        "end": 3821.72
    },
    {
        "text": " Pero si estudian a partir de lo que son las presentaciones, es insuficiente porque tiene que tener pequeños textos, pequeños lineamientos para lo que es el seguimiento de la clase.",
        "start": 3821.72,
        "end": 3835.72
    },
    {
        "text": " Pero no tiene toda la información como para poder salvar una prueba.",
        "start": 3835.72,
        "end": 3839.72
    },
    {
        "text": " ¿Alguna otra duda consulta?",
        "start": 3840.72,
        "end": 3843.72
    },
    {
        "text": " Una duda respecto a las pruebas. Capá, claro.",
        "start": 3843.72,
        "end": 3847.72
    },
    {
        "text": " O sea, acabá de lo que tiene en el inicio, pero como dije, no estaba el inicio.",
        "start": 3847.72,
        "end": 3851.72
    },
    {
        "text": " No, no, no. No se le encerran. Múltiples opciones, los parciales.",
        "start": 3851.72,
        "end": 3855.72
    },
    {
        "text": " Los parciales van a hacer múltiples opciones y tienen la ventaja de que va a ser libre en la viabilidad, lo que les permita recorrar la prueba.",
        "start": 3855.72,
        "end": 3865.72
    },
    {
        "text": " También tienen bloques. Entonces, eso también le facilita lo que es la búsqueda de quizás la pregunta que les faltó de contestar.",
        "start": 3865.72,
        "end": 3874.72
    },
    {
        "text": " Ah, está, genial. Gracias.",
        "start": 3877.72,
        "end": 3879.72
    },
    {
        "text": " Sí, así que libre en la viabilidad y bueno, pues por bloques y no vamos a restar puntos.",
        "start": 3879.72,
        "end": 3884.72
    },
    {
        "text": " ¡Geneal!",
        "start": 3885.72,
        "end": 3888.72
    },
    {
        "text": " Sí, Paulina, le vamos a ir indicando. Seguramente, el Parallones de la Semana Proxima ya van a tener un listadito de todos los materiales que van a tener que estudiar en cada una de las clases.",
        "start": 3890.72,
        "end": 3904.72
    },
    {
        "text": " ¿Alguna otra consulta? ¿Duda? Si no seguimos.",
        "start": 3905.72,
        "end": 3914.72
    },
    {
        "text": " ¿Duda? ¿Duda? ¿Duda?",
        "start": 3921.72,
        "end": 3923.72
    },
    {
        "text": " Bueno, otro tema que en algunos de los grupos llegaron a comerse a algo, en otros no. ¿Qué ejemplo tienen de habilidades, por ejemplo, técnicas?",
        "start": 3923.72,
        "end": 3941.72
    },
    {
        "text": " Ahí, bueno, cuando estando a Berenise, sí vamos a subir un coronavirus.",
        "start": 3954.72,
        "end": 3960.72
    },
    {
        "text": " ¿Dónde van a poder visualizar qué es lo que vamos a dar en cada clase?",
        "start": 3962.72,
        "end": 3966.72
    },
    {
        "text": " Como les decía, esta primer clase, lo que tratamos a hacer es un pantallazo, bueno, una presentación por eso también estuvo Marcelo.",
        "start": 3966.72,
        "end": 3975.72
    },
    {
        "text": " Luego, por otra parte, también buscamos que se les den algunos conceptos básicos, pero luego también lo que les decía, un pantallazo un poco del curso para sepan a toda la información que vamos a ir viendo y el valor que no sólo se entendemos que tiene para ustedes.",
        "start": 3976.72,
        "end": 3993.72
    },
    {
        "text": " Bueno, vamos como técnica, como técnicas se me ocurre, y por ejemplo, como en un laboratorio o algo, hacer el seguimiento de algo, o sea, una ha dicho una muestra o algo y como todos los pasos, a seguir, digamos.",
        "start": 3994.72,
        "end": 4015.72
    },
    {
        "text": " Perfecto, y todo el conocimiento que tiene la persona con respecto a cómo se desarrolla esa actividad, todo eso es técnico. Perfecto, ¿qué más?",
        "start": 4016.72,
        "end": 4026.72
    },
    {
        "text": " Perfecto, ¿qué más?",
        "start": 4027.72,
        "end": 4028.72
    },
    {
        "text": " Un programador, un contador, también con experiencia, por ejemplo, si es una empresa financiera, un contador podría ser.",
        "start": 4032.72,
        "end": 4042.72
    },
    {
        "text": " Perfecto, todos los conocimientos que uno tiene, porque en el caso de un contador, ¿no?",
        "start": 4043.72,
        "end": 4048.72
    },
    {
        "text": " ¿Cómo se desarregís? Tragará de las características, de la partida doble, ¿no? Todos esos conceptos que nosotros utilizamos, todos esos técnicos.",
        "start": 4048.72,
        "end": 4057.72
    },
    {
        "text": " En el caso de un programador, hay diferentes tipos de programación, bueno, toda esa información.",
        "start": 4057.72,
        "end": 4065.72
    },
    {
        "text": " Perfecto, ¿qué más?",
        "start": 4066.72,
        "end": 4067.72
    },
    {
        "text": " Humana, ¿qué les parece?",
        "start": 4070.72,
        "end": 4073.72
    },
    {
        "text": " Ejemplos?",
        "start": 4076.72,
        "end": 4077.72
    },
    {
        "text": " Perfecto, ¿qué más?",
        "start": 4078.72,
        "end": 4079.72
    },
    {
        "text": " Se podría ocurrir y se organizar a la gente para equipos, para que ya en terminadas tareas acabo y como gestionar los fallas que puedan tener, no sé, y dirigir.",
        "start": 4087.72,
        "end": 4100.719999999999
    },
    {
        "text": " Perfecto, ¿y toda la forma de cómo nos vinculamos con el resto? ¿De qué forma motivamos? ¿De qué forma nos comunicamos con las otras personas?",
        "start": 4101.72,
        "end": 4112.72
    },
    {
        "text": " Bueno, ahí justamente a Uptina está mencionando eso, la capacidad de poder comunitarse correctamente, la comprensión, la charla, la empatía, que es un concepto tan importante.",
        "start": 4112.72,
        "end": 4126.72
    },
    {
        "text": " Así que bueno, tenemos, habilidad técnica que son correctamente la que mencionaron, dentro de la habilidad técnica, la habilidad que tiene un doctor verdad para hacer unos cirugietos, sus conocimientos técnicos, ¿no?",
        "start": 4127.72,
        "end": 4139.72
    },
    {
        "text": " Toda la parte bueno que decían recién en un laboratorio, todos los conocimientos que hay que tener para hacer una prueba, esos técnicos, las después tenemos.",
        "start": 4139.72,
        "end": 4149.72
    },
    {
        "text": " Perfecto, ahí es cuando está hablando de las habilidades landas, ¿sacto?",
        "start": 4149.72,
        "end": 4155.72
    },
    {
        "text": " Hablando de la parte humana, interprersonal, ¿no?",
        "start": 4156.72,
        "end": 4161.72
    },
    {
        "text": " Y bueno, después tenemos lo que decíamos de la habilidad conceptual, para que esa capacidad de ver a la organización como un todo, ¿no?",
        "start": 4163.72,
        "end": 4173.72
    },
    {
        "text": " Que va más allá de las pequeñas cosas, ¿no? Que decíamos incluso que esta es la frase, no va a arreglar la hoja y ver el voz.",
        "start": 4175.72,
        "end": 4183.72
    },
    {
        "text": " Bueno, vamos a un poco a repasar algunos puntos que vimos en la clase de o.",
        "start": 4186.72,
        "end": 4193.72
    },
    {
        "text": " Por un lado, la importancia de la administración, la administración, para que es importante para todo tipo de organización, vimos que habían diferentes tipos de organizaciones, dijimos que habían organizaciones con fines de lucro, organizaciones sin fines de lucro, organizaciones públicas, organizaciones privadas, desector financiero, desector financiero,",
        "start": 4194.72,
        "end": 4212.72
    },
    {
        "text": " dijimos que en todo es el importante la administración. Si es importante la administración, quien lleva a cabo esta administración, bueno, la administración lleva a cabo un querente.",
        "start": 4213.72,
        "end": 4222.72
    },
    {
        "text": " ¿Qué características tienen que tener ese gidente? Bueno, vimos diferentes diferentes puntos, para dar por un lado lo que eran las habilidades, conceptuales, técnicas y humanas y, por otro, los roles de Jeremy Minzver, que fueron los ejemplos,",
        "start": 4223.72,
        "end": 4241.72
    },
    {
        "text": " que vimos recién. Vimos que habían diferentes tipos de gerenes, dependiendo de cuál era su posición dentro de la organización.",
        "start": 4242.72,
        "end": 4254.72
    },
    {
        "text": " También realizamos que, dependiendo del lugar del geren de la organización, era la importancia que iba a tener algunas habilidades, dijimos que la habilidad técnica empezaba a perder relevancia cuando estábamos en las posiciones más altas de la organización.",
        "start": 4254.72,
        "end": 4271.72
    },
    {
        "text": " Y que empezaba a adquirir gran relevancia, todo lo que eran las habilidades de tipo más conceptual. ¿Qué más vimos?",
        "start": 4272.72,
        "end": 4281.72
    },
    {
        "text": " A ver si se acuerdan, vimos algo más.",
        "start": 4287.72,
        "end": 4290.72
    },
    {
        "text": " Y silencioso que estamos.",
        "start": 4303.72,
        "end": 4305.72
    },
    {
        "text": " Vimos a lo de nivel de gerenciales.",
        "start": 4307.72,
        "end": 4310.72
    },
    {
        "text": " Perfecto, ¿qué más?",
        "start": 4311.72,
        "end": 4312.72
    },
    {
        "text": " Ahí no puguimos encontrar mucho ejemplo aquí, en empresas u luayas tan grandes, pero yo, por ejemplo, trabajo en una que es brasileira y es bastante grande.",
        "start": 4313.72,
        "end": 4323.72
    },
    {
        "text": " Y tenemos todos esos gerenes, gerenes generales, gerenes, mismo yo, en mi propio grupo, tengo como alguien que se encarga de líder técnico y a su vez líder de proyecto, es como que hay mucha jerarquía.",
        "start": 4324.72,
        "end": 4337.72
    },
    {
        "text": " ¿Qué sentís a gusto trabajando cuando esa estructura jerarquica?",
        "start": 4339.72,
        "end": 4342.72
    },
    {
        "text": " Sí, está bueno, está ordenado, la verdad es como, está, yo estoy al final de la cadena alimenticia, pero yo estoy programadora.",
        "start": 4343.72,
        "end": 4351.72
    },
    {
        "text": " Y está, trabajo solamente es desarrolladora, pero sí, hay como mucha jerarquía para arriba.",
        "start": 4352.72,
        "end": 4359.72
    },
    {
        "text": " Excelente.",
        "start": 4359.72,
        "end": 4360.72
    },
    {
        "text": " ¿Alguien que trabaje en una organización más chica y que tenga algún geren que cumpla más en una función?",
        "start": 4361.72,
        "end": 4370.72
    },
    {
        "text": " Yo tengo algún ejemplo, tengo un ejemplo que en realidad es de antiguo trabajo de mi novia, no voy a nombrar el nombre de la empresa porque le hace un ejemplo medio patológico.",
        "start": 4371.72,
        "end": 4382.72
    },
    {
        "text": " Sí.",
        "start": 4383.72,
        "end": 4384.72
    },
    {
        "text": " Porque era un caso en el que había un gerente, que en el mejor de los casos era nivel medio, sino, sino directo porque en realidad organización que tenía la empresa que era que era chica, había programadores,",
        "start": 4384.72,
        "end": 4399.72
    },
    {
        "text": " había analistas y en esta ubicación física había un gerente.",
        "start": 4399.72,
        "end": 4404.72
    },
    {
        "text": " Y el problema es que los analistas tenían conocimientos de programación, pero este serente que estaba bastante cerca, digamos, si no es primera línea, era como mucho nivel medio, no tenía muchas habilidades técnicas.",
        "start": 4404.72,
        "end": 4419.72
    },
    {
        "text": " Se se comportaba en parte como si fuera de alto nivel, pero en realidad era de nivel medio.",
        "start": 4420.72,
        "end": 4427.72
    },
    {
        "text": " Y está, eso lleva problemas porque muchas veces esperaba soluciones mágicas o inicial o que las cosas se arreglen y ahí la falta de habilidades técnicas, pasan ya de la que tanta habilidad conceptual o humana tuviera, muchas veces era un obstáculo.",
        "start": 4427.72,
        "end": 4443.72
    },
    {
        "text": " Exacto. Fue bueno un poco lo que decía Gonzalo, ¿no?",
        "start": 4444.72,
        "end": 4448.72
    },
    {
        "text": " Y que habíamos mencionado en la clase que el hecho de que en la medida que se va haciendo la organización, las habilidades técnicas,",
        "start": 4448.72,
        "end": 4456.72
    },
    {
        "text": " quizás a nosotros también lo levanten, o sin decir que no te dan que saber las cosas, porque también para poder guiar a un grupo no tiene que entender, no tiene que comprender.",
        "start": 4456.72,
        "end": 4464.72
    },
    {
        "text": " Y bueno, también en la medida que uno va subiendo va aprendiendo a rodearse con personas, personas capaces y que puedan colaborar en lo que es el éxito de la organización,",
        "start": 4465.72,
        "end": 4476.72
    },
    {
        "text": " pero hay que tener conocimientos técnicos y sobre todo en un caso como en que tú mencionas, no que quizás que no, el grado máximo de la organización estaba muy cerca de la parte operativa,",
        "start": 4476.72,
        "end": 4488.72
    },
    {
        "text": " entonces claramente tenía que tener un poco más de quizás y por lo que tú mencionas un poco más de habilidades técnicas.",
        "start": 4488.72,
        "end": 4495.72
    },
    {
        "text": " Alguien otro ejemplo, muy buena el ejemplo.",
        "start": 4502.72,
        "end": 4505.72
    },
    {
        "text": " Bueno ahí vemos Mauricio, por ejemplo, que es una empresa que tiene un gerente general y bueno por lo que indiendo no existe en otros gerentes y bueno, se van desarrollando las tareas de esa forma.",
        "start": 4506.72,
        "end": 4529.72
    },
    {
        "text": " ¿Conocen los gerentes?",
        "start": 4530.72,
        "end": 4537.72
    },
    {
        "text": " ¿Se imaginan como gerentes o se imaginan por un emprendimiento personal?",
        "start": 4538.72,
        "end": 4546.72
    },
    {
        "text": " Váneres preguntas.",
        "start": 4547.72,
        "end": 4553.72
    },
    {
        "text": " Estaría en la parte más cercana el operativo, una jefatura.",
        "start": 4561.72,
        "end": 4569.72
    },
    {
        "text": " Pero bueno muchas veces tienen verdad algunas funciones credenciales.",
        "start": 4570.72,
        "end": 4579.72
    },
    {
        "text": " Bueno ahí hablan de si en algo personal de alguna forma sería tu propia esquerente,",
        "start": 4586.72,
        "end": 4594.72
    },
    {
        "text": " pero bueno no había cuando hablamos de gerentes que trabaja con más de una persona, porque tiene que coordinar tareas, asignar atividades,",
        "start": 4594.72,
        "end": 4601.72
    },
    {
        "text": " si no se las estaría asignando si mismo.",
        "start": 4601.72,
        "end": 4603.72
    },
    {
        "text": " Perfecto.",
        "start": 4604.72,
        "end": 4611.72
    },
    {
        "text": " Muchas veces los dueños cumplen el rol de gerentes de alto ni el, ¿no?",
        "start": 4617.72,
        "end": 4621.72
    },
    {
        "text": " En lo que es la dinámica de las empresas uruguayas.",
        "start": 4621.72,
        "end": 4625.72
    },
    {
        "text": " Pero bueno como les comentaba mayoritariamente en Uruguay tenemos empresas con pequeños medianos porte,",
        "start": 4626.72,
        "end": 4632.72
    },
    {
        "text": " entonces bueno muchas veces no tienen una estructura tan amplia.",
        "start": 4632.72,
        "end": 4637.72
    },
    {
        "text": " Lo que es importante que les queda claro es que existe diferentes tipos de niveles gerenciales y en la medida que se va aumentando",
        "start": 4637.72,
        "end": 4647.72
    },
    {
        "text": " en lo que es los grados dentro de una organización, hay cierta sabridad que son más importantes que otros.",
        "start": 4647.72,
        "end": 4654.72
    },
    {
        "text": " Bueno pero vimos algo más en la clase, además de todo lo que era el vinculado de los gerentes que más vimos.",
        "start": 4656.72,
        "end": 4663.72
    },
    {
        "text": " Y con esto ya estaríamos terminando.",
        "start": 4671.72,
        "end": 4675.72
    },
    {
        "text": " Vimos las cuatro funciones de la administración,",
        "start": 4675.72,
        "end": 4680.72
    },
    {
        "text": " que son muy importantes,",
        "start": 4681.72,
        "end": 4685.72
    },
    {
        "text": " que estaban la planeación, la organización, la dirección, el control,",
        "start": 4685.72,
        "end": 4692.72
    },
    {
        "text": " todo esto para alcanzar los propósitos de la organización.",
        "start": 4692.72,
        "end": 4696.72
    },
    {
        "text": " Bueno espero que les haya gustado la clase de hoy, como les decía,",
        "start": 4700.72,
        "end": 4705.72
    },
    {
        "text": " las próximas clases van a ser más ordenadas,",
        "start": 4706.72,
        "end": 4709.72
    },
    {
        "text": " esta primera clase se trata de dar un, como les decía,",
        "start": 4709.72,
        "end": 4714.72
    },
    {
        "text": " un pantalla social general, también conocernos un poco entre nosotros,",
        "start": 4714.72,
        "end": 4720.72
    },
    {
        "text": " saber qué rama del conocimiento se están especializando,",
        "start": 4720.72,
        "end": 4725.72
    },
    {
        "text": " para también poder ajustarlos los ejemplos a eso también.",
        "start": 4725.72,
        "end": 4730.72
    },
    {
        "text": " Ahí perfecto, manifínen así, las funcionan.",
        "start": 4736.72,
        "end": 4739.72
    },
    {
        "text": " Bueno, si no hay más dudas ni consultas,",
        "start": 4740.72,
        "end": 4743.72
    },
    {
        "text": " estaríamos dejando la clase por aquí,",
        "start": 4743.72,
        "end": 4748.72
    },
    {
        "text": " en lo que va a ver a ver, les vamos a avisar que es lo que tienen que dar para la próxima clase.",
        "start": 4748.72,
        "end": 4753.72
    },
    {
        "text": " Yo tengo una duda.",
        "start": 4754.72,
        "end": 4756.72
    },
    {
        "text": " Dime se vacía.",
        "start": 4756.72,
        "end": 4758.72
    },
    {
        "text": " Para rendir el examen, es necesario alcanzar alguna cantidad de puntos en los parciales",
        "start": 4758.72,
        "end": 4763.72
    },
    {
        "text": " o no.",
        "start": 4763.72,
        "end": 4765.72
    },
    {
        "text": " No.",
        "start": 4766.72,
        "end": 4767.72
    },
    {
        "text": " No.",
        "start": 4769.72,
        "end": 4770.72
    },
    {
        "text": " Gracias.",
        "start": 4770.72,
        "end": 4771.72
    },
    {
        "text": " El examen generalmente es más difícil que el parcial.",
        "start": 4772.72,
        "end": 4775.72
    },
    {
        "text": " Los parciales son más accesibles.",
        "start": 4775.72,
        "end": 4777.72
    },
    {
        "text": " ¿Alguna otra duda?",
        "start": 4783.72,
        "end": 4784.72
    }
]