[
    {
        "text": " Bueno, bon dia. Vamos a terminar ahora en el comienzo de la clase con el repaso que iniciamos",
        "start": 0.0,
        "end": 23.8
    },
    {
        "text": " la clase pasada y vamos a arrancar con valores y vectores propios que ya es propiamente parte del curso",
        "start": 23.8,
        "end": 31.32
    },
    {
        "text": " de Galdos. Entonces, si ustedes se acuerdan, si ustedes se acuerdan habíamos repasado lo que era la",
        "start": 31.32,
        "end": 39.52
    },
    {
        "text": " matria asociada de una transformación lineal cuando uno daba base del espacio de partida y del espacio",
        "start": 39.52,
        "end": 45.519999999999996
    },
    {
        "text": " de llegada y habíamos visto lo que era la matriz cambio de base, es decir, como cambian las cosas",
        "start": 45.519999999999996,
        "end": 50.32
    },
    {
        "text": " con uno cambia la base de los espacios en los cuales está trabajando y finalmente vimos una",
        "start": 50.32,
        "end": 55.2
    },
    {
        "text": " cuestión que la voy a dar acá para recordar si uno tiene una transformación lineal de un espacio",
        "start": 55.2,
        "end": 65.52
    },
    {
        "text": " en el mismo espacio, que es lo que se llama un operador lineal y si uno tiene dos bases de",
        "start": 65.52,
        "end": 75.6
    },
    {
        "text": " espacio en cuestión a y a tilde. Entonces, hay una relación muy sencilla entre la representación",
        "start": 75.6,
        "end": 85.28
    },
    {
        "text": " material de esta T usando como base de partida y la representación de la T usando como base de",
        "start": 85.28,
        "end": 91.16
    },
    {
        "text": " partida y llegada a tilde y la relación es la siguiente, esto lo habíamos visto la clase pasada,",
        "start": 91.16,
        "end": 96.32
    },
    {
        "text": " lo habíamos escrito así. La matria asociada T en la base a tilde es la matria asociada a T",
        "start": 98.32,
        "end": 107.8
    },
    {
        "text": " en la base a por uno matriz que tengo que poner de este lado y la inversa que tengo que poner",
        "start": 107.8,
        "end": 113.96
    },
    {
        "text": " de este lado que son las matriz cambios de base. Bien, eso lo habíamos denotado así, P de un lado",
        "start": 113.96,
        "end": 119.16
    },
    {
        "text": " y P de la menos 1, como estamos trabajando con el mismo espacio de partida que el de llegada,",
        "start": 119.16,
        "end": 125.84
    },
    {
        "text": " es decir, con operadores lineales, estas son todas las matrices cuadradas. Entonces, esto es una",
        "start": 125.84,
        "end": 131.64
    },
    {
        "text": " matriz cuadrada que la matriz cambió de base que es invertible y acá tengo un purificar P y acá",
        "start": 131.64,
        "end": 137.48
    },
    {
        "text": " tengo que poner P de la menos 1. Hay que tener un poquito de cuidado ahí con el que uno pone",
        "start": 137.48,
        "end": 141.48
    },
    {
        "text": " como P de la menos 1, con el horo de las bases, eso me refiero, esto acá esplicitamente",
        "start": 141.48,
        "end": 147.88
    },
    {
        "text": " es la matriz cambio de base, o es decir, la representación de la identidad usando como base a",
        "start": 147.88,
        "end": 154.12
    },
    {
        "text": " tilde de partida y a de llegada. Bien, ese es P y P de la menos 1 justamente es la inversa de",
        "start": 154.12,
        "end": 164.07999999999998
    },
    {
        "text": " esta que no es otra cosa que la representación de la transformación y identidad cuando cambió el",
        "start": 164.07999999999998,
        "end": 169.4
    },
    {
        "text": " horo de las bases, es decir, como uso a como base de partida y a tilde, como base de la base.",
        "start": 169.4,
        "end": 175.12
    },
    {
        "text": " Bien, eso lo vimos visto la clase pasada y nos llevaba la siguiente definición. Decíamos que 2",
        "start": 175.72,
        "end": 184.32
    },
    {
        "text": " matrices cuadradas son semejantes, si existe otra matriz P invertible tal que 1 se relaciona",
        "start": 184.32,
        "end": 192.36
    },
    {
        "text": " con la otra de esta manera. Bien, entonces repasamos esto, fue lo último que vimos. Ahí ve, matrices",
        "start": 192.36,
        "end": 201.08
    },
    {
        "text": " cuadradas son semejantes, si existe una tercera matriz P cuadrada invertible",
        "start": 201.08,
        "end": 219.8
    },
    {
        "text": " tal que la relación entre de y ya es justamente la que tenemos en el criterio de ahí.",
        "start": 219.8,
        "end": 229.96
    },
    {
        "text": " Ves, escribe como P de la menos 1 por A por T. Está claro, entonces fíjense lo siguiente.",
        "start": 229.96,
        "end": 239.96
    },
    {
        "text": " Si yo tengo 2 matrices semejantes, estamos trabajando como matrices cuadradas, yo les había",
        "start": 239.96,
        "end": 247.08
    },
    {
        "text": " comentado que prácticamente todo el curso de Galdova va a ser sobre operadores lineales,",
        "start": 247.08,
        "end": 254.16000000000003
    },
    {
        "text": " o sea, el mismo espacio de partida, el mismo espacio de llegada, la dimensión finita, por lo tanto",
        "start": 254.16000000000003,
        "end": 259.40000000000003
    },
    {
        "text": " todas las matricias asociadas van a ser matricias cuadradas, no sé qué se diga lo contrario,",
        "start": 259.40000000000003,
        "end": 263.52000000000004
    },
    {
        "text": " algún tema, fíjense lo siguiente. Si hay besos semejantes,",
        "start": 263.52,
        "end": 271.59999999999997
    },
    {
        "text": " en el decir, si vale esto,",
        "start": 278.2,
        "end": 280.15999999999997
    },
    {
        "text": " supongamos que yo quisiera calcular potencias de B, por ejemplo, B el cuadrado,",
        "start": 285.91999999999996,
        "end": 290.88
    },
    {
        "text": " entonces yo digo voy a calcular B el cuadrado y esto como ustedes saben es B por la propia B,",
        "start": 291.76,
        "end": 300.76
    },
    {
        "text": " es decir, pero a B la vamos a escribir así, pero a menos 1 por A por P y esto lo tengo",
        "start": 300.76,
        "end": 306.71999999999997
    },
    {
        "text": " multiplicar por sí mismo.",
        "start": 306.71999999999997,
        "end": 307.68
    },
    {
        "text": " Sí, entonces qué pasa ahí? Fíjense que si uno agrupa, acá vale la propia",
        "start": 312.2,
        "end": 319.24
    },
    {
        "text": " asociativa en el producto de matricias, si yo puedo agrupar esta parte con E está y cuando",
        "start": 319.24,
        "end": 323.48
    },
    {
        "text": " hago P por P a la menos 1, esto me da justamente la identidad en E por N, bien, entonces eso lo",
        "start": 323.48,
        "end": 331.24
    },
    {
        "text": " podemos sacar y me va a quedar P a la menos 1 por A el cuadrado por P. Está claro,",
        "start": 331.24,
        "end": 337.84000000000003
    },
    {
        "text": " este paso, fíjense que entonces lo que ocurre es que B cuadrado, si hay besos semejantes,",
        "start": 337.84000000000003,
        "end": 345.96000000000004
    },
    {
        "text": " B cuadrado y ha cuadrado también son semejantes y con las mismas matrices que tenía para",
        "start": 345.96,
        "end": 351.12
    },
    {
        "text": " ver multiplicando izquierda y a derecha y en general si uno repite esta argumento N veces,",
        "start": 351.12,
        "end": 357.56
    },
    {
        "text": " B a la N, B a una potencia digamos K o M o lo que sea, digamos llamar K es lo mismo que P",
        "start": 362.2,
        "end": 370.35999999999996
    },
    {
        "text": " a la menos 1 por A a la K por P para todo K, yo sé, más o igual que 1 para todo K natural.",
        "start": 370.36,
        "end": 379.44
    },
    {
        "text": " ¿Qué significa esto? Suponamos que no tiene una matriz cuadrada grande, uno puede",
        "start": 380.76,
        "end": 387.6
    },
    {
        "text": " empezar una matriz suficientemente grande y uno tiene que calcular potencias de esa matriz.",
        "start": 387.6,
        "end": 392.44
    },
    {
        "text": " Entonces ustedes saben que calcular, bueno ahora una computadora lo hacen dos segundos pero",
        "start": 393.44,
        "end": 397.72
    },
    {
        "text": " si uno tiene que calcular potencia de una matriz con entradas diferentes de cero eso puede",
        "start": 397.72,
        "end": 403.76000000000005
    },
    {
        "text": " ya hacer complicado, pero si uno encuentra una matriz semejante a la matriz que uno quiere",
        "start": 403.76000000000005,
        "end": 410.72
    },
    {
        "text": " elevar a una potencia, tal que esa matriz semejante tiene la forma con muchos cero, por ejemplo",
        "start": 410.72,
        "end": 416.72
    },
    {
        "text": " una forma diagonal o algo que se parezca una diagonal, entonces elevar potencias de una diagonal es",
        "start": 416.72,
        "end": 422.88000000000005
    },
    {
        "text": " muy sencillo porque si yo tengo una matriz diagonal y le lebo el cuadrado lo que tengo que hacer es",
        "start": 422.88,
        "end": 427.92
    },
    {
        "text": " elevar el cuadrado los elementos legonales y ponerse en todos lados, entonces elevar potencias",
        "start": 427.92,
        "end": 434.08
    },
    {
        "text": " de matricias diagonales o de matricias parecidas diagonales es mucho más sencillo, entonces lo que",
        "start": 434.08,
        "end": 437.96
    },
    {
        "text": " conviene es dar una matriz B plantearse si no existirá a otra matriz semejante a esta que tenga",
        "start": 437.96,
        "end": 446.52
    },
    {
        "text": " forma diagonal o parecida a la diagonal, entonces calculo las potencias con esta matriz que es mucho",
        "start": 446.52,
        "end": 451.56
    },
    {
        "text": " más fácil después me multiplico por P y P a la menos 1, que son las matricias cambiadas de base",
        "start": 451.56,
        "end": 456.36
    },
    {
        "text": " acá y obteno las potencias de esta, está claro, entonces el problema que queremos afrontar es",
        "start": 456.36,
        "end": 463.8
    },
    {
        "text": " el siguiente, si es una manera sencilla de representar una forma matricial B una matriz o un operador",
        "start": 463.8,
        "end": 474.0
    },
    {
        "text": " lineal por otra forma que semejante a esa pero que sea más fácil de manipular para hacer cuento y",
        "start": 474.0,
        "end": 480.36
    },
    {
        "text": " eso va a ser prácticamente el grueso del tema de los temas que vamos a ver en galdos, está claro hasta acá,",
        "start": 480.36,
        "end": 486.88
    },
    {
        "text": " entonces la cuestión de semejanza va a aparecer todo el tiempo y recuerden que siempre le",
        "start": 488.28000000000003,
        "end": 493.32
    },
    {
        "text": " iría a hacer, es encontrar otra matriz semejante al original que sea más fácil de manipular",
        "start": 493.32,
        "end": 498.56
    },
    {
        "text": " aquí abraícamente, antes que nada voy a escribir un teorema que está en el libro pero les voy a",
        "start": 498.56,
        "end": 506.92
    },
    {
        "text": " escribir la, es muy intuitivo, vamos más o menos, pero no lo voy a demostrar, no es una cuestión",
        "start": 506.92,
        "end": 515.8000000000001
    },
    {
        "text": " técnica que ni siquiera difícil de demostrar pero es más engorroso escribirlo que entenderlo, se los",
        "start": 515.8000000000001,
        "end": 521.9200000000001
    },
    {
        "text": " voy a dejar para que lo lea y este resultado me muestra que relaciona entre matricias semejantes",
        "start": 521.9200000000001,
        "end": 530.5600000000001
    },
    {
        "text": " con operadores, con operadores representados en diferentes bases, lo que tenía acá y que acabo de",
        "start": 530.56,
        "end": 536.8
    },
    {
        "text": " borrar, entonces el teorema me dice lo siguiente, lo copio y ya lo leemos, bueno lo que me dice este",
        "start": 536.8,
        "end": 556.56
    },
    {
        "text": " teorema es lo siguiente, yo tengo dos matricias n por n, entonces la afirmación es que hay veces",
        "start": 557.04,
        "end": 564.56
    },
    {
        "text": " son matricias semejantes, es decir existe una p invertida, tal que ves p por a por p, la menos 1 o",
        "start": 564.56,
        "end": 571.4799999999999
    },
    {
        "text": " al revés, igual es p, la menos 1 por p por p, sí solo sí puedo construir, existe un operador",
        "start": 571.4799999999999,
        "end": 579.0799999999999
    },
    {
        "text": " lineal de b, en b, donde ves un operador, donde ves una espacio territorial de dimensiones n, la misma",
        "start": 579.08,
        "end": 584.1800000000001
    },
    {
        "text": " dimensión que esté pudiendo acá, y existe no demás dos bases y etilde bases del espacio",
        "start": 584.1800000000001,
        "end": 591.26
    },
    {
        "text": " territorial, tal es que esta matriz es la representación matricial de este operador usando las bases",
        "start": 591.26,
        "end": 597.14
    },
    {
        "text": " e, de partir de llegada, y esta matriz b es la representación de este operador usando las otras",
        "start": 597.14,
        "end": 602.76
    },
    {
        "text": " bases de partir de llegada, es el tipo de partida y etilde llega, se entiende como es el",
        "start": 602.76,
        "end": 608.24
    },
    {
        "text": " renunciado, la semejanza de matricias tiene que ver con el hecho de poder encontrar un operador",
        "start": 608.72,
        "end": 615.5600000000001
    },
    {
        "text": " lineal en un espacio con la misma dimensión que esto, que este acá, n, y dos bases tales que esta es",
        "start": 615.5600000000001,
        "end": 622.08
    },
    {
        "text": " la representación del operador en una base y esta es la representación del operador en otra base,",
        "start": 622.08,
        "end": 626.12
    },
    {
        "text": " y eso me da la conexión que hay entre semejanza de matricias y operadores lineales,",
        "start": 626.12,
        "end": 630.92
    },
    {
        "text": " hay una parte que ya vimos, en más estaba escrita recién en el pizarro, de esta dos implicancias",
        "start": 631.92,
        "end": 637.92
    },
    {
        "text": " hay una que ya vimos, ¿cuál es? ¿cuál es la que vimos que yo le escribir y la borramos recién?",
        "start": 637.92,
        "end": 648.68
    },
    {
        "text": " La que va esta, de acá para allá, la disquiere, la la la resíproca, esta acá y gánsese esto,",
        "start": 648.68,
        "end": 658.1999999999999
    },
    {
        "text": " esto lo vimos, lo probamos, vimos que si es un operador lineal y tengo dos bases distintas,",
        "start": 658.2,
        "end": 666.96
    },
    {
        "text": " entonces la representación en una base y en la otra son semejantes y justamente la matriz",
        "start": 666.96,
        "end": 671.9200000000001
    },
    {
        "text": " pela, la matriz cambio de base, eso ya lo vimos, lo que no vimos es esta, y esa es lo que tenemos que hacer",
        "start": 671.9200000000001,
        "end": 683.08
    },
    {
        "text": " es dar dos matricias semejantes, o sea dar las matricias a IB y la matriz que me pase una",
        "start": 683.08,
        "end": 688.76
    },
    {
        "text": " otra es que es la P, construirme un operador apropiado que es muy sencillo de construir,",
        "start": 688.76,
        "end": 695.5200000000001
    },
    {
        "text": " eso está en el libro rojo, el espacio vectorial en el que se trabaja directamente y los escalares",
        "start": 695.5200000000001,
        "end": 702.96
    },
    {
        "text": " a la N, o si es cala N, es reala N, los compesos a la N, dependiendo de donde tenemos estas",
        "start": 702.96,
        "end": 708.36
    },
    {
        "text": " matricias y las bases que se usan una es la canónica y otra que se obtiene a partir de la canónica",
        "start": 708.36,
        "end": 713.8000000000001
    },
    {
        "text": " multiplicando por P, eso es algo muy sencillo de probar, es engorroso pero lo diré es muy",
        "start": 713.8000000000001,
        "end": 718.08
    },
    {
        "text": " tan silla y está hecho en el libro, entonces yo no lo voy a demostrar acá, lo que voy a hacer",
        "start": 718.08,
        "end": 722.52
    },
    {
        "text": " de esta parte es ver el libro rojo y se los dejo como ejercicio, en todo caso si en alguna clase",
        "start": 722.52,
        "end": 735.5600000000001
    },
    {
        "text": " queda tiempo lo podemos probar, pero crean que es bien bien sencillo, solo que es engorroso",
        "start": 735.56,
        "end": 745.8
    },
    {
        "text": " escribirlo, uno considera un operador T que es directamente la multiplicación de la matriz",
        "start": 745.8,
        "end": 753.0799999999999
    },
    {
        "text": " por un vector en la arena que es un operador en la arena o en KN y uno considera las bases",
        "start": 753.0799999999999,
        "end": 758.1199999999999
    },
    {
        "text": " canónicas y las bases P y la base canónica en ese espacio caray, y ahí se prueba que estas",
        "start": 758.12,
        "end": 770.0
    },
    {
        "text": " matricias son prontos, se prueba esto, que una matriz es esto y que la otra se toca, está claro,",
        "start": 770.0,
        "end": 778.28
    },
    {
        "text": " prefiero obrir esa demostración por qué es engorroso solamente, lo que sí vamos a probar es",
        "start": 780.04,
        "end": 786.88
    },
    {
        "text": " un par de resultados que se deduce en cuando uno trabaja con matricias semejantes,",
        "start": 788.12,
        "end": 792.2
    },
    {
        "text": " sentando yo esta correspondencia entre o sea piensen que matricias semejantes son aquellas que vienen",
        "start": 796.36,
        "end": 803.24
    },
    {
        "text": " después de un operador, un mismo operador en bases diferentes, eso es todo lo que estamos viendo.",
        "start": 803.24,
        "end": 807.76
    },
    {
        "text": " Entonces, con esto terminamos la primera parte que sería repaso del curso, aunque muchos",
        "start": 807.76,
        "end": 821.96
    },
    {
        "text": " estas cosas no las han visto en galuno, algunos labieron y me dijeron y otros no,",
        "start": 821.96,
        "end": 826.6
    },
    {
        "text": " la parte final es esto y ya pasamos un tema más entretenido.",
        "start": 828.92,
        "end": 836.52
    },
    {
        "text": " Este resultado que es el resultado con el cual terminamos estas cuestiones semejanzas y cambios",
        "start": 867.76,
        "end": 893.56
    },
    {
        "text": " de base, etcétera en la introducción, me dice que si yo tengo dos matricias semejantes,",
        "start": 893.56,
        "end": 899.3599999999999
    },
    {
        "text": " entonces esa matriz ya tienen el mismo rango, tienen la misma trasa y tienen el mismo determinado.",
        "start": 899.3599999999999,
        "end": 907.2399999999999
    },
    {
        "text": " Ojo, no es un síso lo sí, ya vamos a ver un contrá ejemplo ahora de matricias que cumplen esto,",
        "start": 912.04,
        "end": 917.4
    },
    {
        "text": " pero que no son semejantes.",
        "start": 917.4,
        "end": 918.3599999999999
    },
    {
        "text": " Les recomiendo en serio que cuando dejo algo como jarsillo vean lo, está hecho en el libro pero vean lo",
        "start": 924.04,
        "end": 929.2399999999999
    },
    {
        "text": " con cuidado, después de ser utilidad para entender los conceptos mejor.",
        "start": 929.2399999999999,
        "end": 936.3599999999999
    },
    {
        "text": " A ver, vamos a demostrar estas tres cosas, estamos pensando que tengo matricias semejantes",
        "start": 936.36,
        "end": 960.16
    },
    {
        "text": " y quiero probar esto y esto. ¿Qué es el rango de una matriz? Es el exacto y que es lo mismo que el",
        "start": 960.16,
        "end": 975.0
    },
    {
        "text": " número de filas, lignamente independiente de tamaño máximo o el número de columnas de tamaño",
        "start": 975.0,
        "end": 980.3199999999999
    },
    {
        "text": " independiente, lignamente independiente máximo. Entonces para probar esta primera parte vamos a usar el",
        "start": 980.3199999999999,
        "end": 986.8
    },
    {
        "text": " resultado que les escribí a ser un ratito de caracterizar esta como matricias o sea una",
        "start": 986.8,
        "end": 992.1999999999999
    },
    {
        "text": " transformación lineal en dos bases diferentes. Entonces por lo que vimos recién,",
        "start": 992.1999999999999,
        "end": 999.0799999999999
    },
    {
        "text": " estamos suponiendo que hay veces semejantes, entonces",
        "start": 1002.8399999999999,
        "end": 1005.76
    },
    {
        "text": " lo que vimos recién es que existe un operador lignal de Bnb, donde ves un espacio de dimension N y bases",
        "start": 1017.3599999999999,
        "end": 1033.6
    },
    {
        "text": " y etilde lo que vimos recién exactamente tales que a la matria associada a t en las bases",
        "start": 1033.6,
        "end": 1054.52
    },
    {
        "text": " y B en la matriz associada a t al mismo operador en las bases etilde. Bien, eso es lo que vimos",
        "start": 1055.52,
        "end": 1065.24
    },
    {
        "text": " hace un ratito. La más difícil de la demostración uno, más difícil porque cuesta",
        "start": 1065.24,
        "end": 1084.48
    },
    {
        "text": " ver la pero es bien simple si no recurra las cosas que yo no hay que ver ahora, es una demostración",
        "start": 1084.48,
        "end": 1092.6
    },
    {
        "text": " conceptual. Fíjense, ahí ves semejantes, construyendo operador t y bases, esta no me importa",
        "start": 1092.6,
        "end": 1098.72
    },
    {
        "text": " cuáles son tales que a la escribo esta manera y veras que la escribo esta manera. Entonces,",
        "start": 1098.72,
        "end": 1102.72
    },
    {
        "text": " el rango de A, es decir, el máximo número de filas o coluna, le llame en t y dependientes, es por",
        "start": 1102.72,
        "end": 1115.6000000000001
    },
    {
        "text": " construcción el rango de la matria associada a una transformación lineal que tengo por ahí con base",
        "start": 1115.6000000000001,
        "end": 1124.32
    },
    {
        "text": " de partida E y base de llegada E. Tiene una transformación lineal de B en B donde ve un espacio",
        "start": 1124.32,
        "end": 1129.1599999999999
    },
    {
        "text": " y dimension N y acá viene la pregunta, que tiene esta referida a lo que me hacían recién de los",
        "start": 1129.1599999999999,
        "end": 1137.3999999999999
    },
    {
        "text": " escalones, ¿qué es eso? ¿Qué relaciona ahí entre esto? ¿Qué pregunta que les hago? ¿Qué",
        "start": 1137.3999999999999,
        "end": 1145.4399999999998
    },
    {
        "text": " relaciona ahí entre esto y la imagen de ese operador t que construí? ¿Se acual fue el operador?",
        "start": 1145.44,
        "end": 1156.04
    },
    {
        "text": " Por ejemplo, recién me dijeron acá que el rango de esto es el número de escalones y el número",
        "start": 1158.44,
        "end": 1166.3200000000002
    },
    {
        "text": " de escalones de una transformación lineal con que se relaciona? La dimensión de la imagen,",
        "start": 1166.3200000000002,
        "end": 1172.56
    },
    {
        "text": " exactamente, estamos, la cantidad de escalones me dice cuántos vectores necesito poner para",
        "start": 1172.56,
        "end": 1181.6799999999998
    },
    {
        "text": " generarme la imagen, entonces el rango justamente es la dimensión de la imagen.",
        "start": 1181.6799999999998,
        "end": 1189.28
    },
    {
        "text": " ¿Se entendió? Fíjense que la Tiene y me importa cuál es, yo sé que una transformación en un",
        "start": 1195.48,
        "end": 1201.6799999999998
    },
    {
        "text": " espacio de dimension N, si estas son matricientes por N y las bases ni me importa. Lo mismo",
        "start": 1201.68,
        "end": 1207.16
    },
    {
        "text": " puede hacer con la matriz B, el rango de B es igual al rango ahora la matriz del operador",
        "start": 1207.16,
        "end": 1219.72
    },
    {
        "text": " T en la base de tilde y el tilde y por el mismo argumento recién esto es la dimensión de la imagen",
        "start": 1219.72,
        "end": 1227.32
    },
    {
        "text": " de T. O sea que de rebote sacamos que el rango de A es el rango de B porque los dos me dan la misma cosa.",
        "start": 1227.32,
        "end": 1238.4
    },
    {
        "text": " ¿Se entendió? Rango de A es igual a rango de A. Estamos siendo más",
        "start": 1238.4,
        "end": 1249.52
    },
    {
        "text": " precizos, son la dimensión de la imagen de un operador, lo operador que estamos hablando ahí,",
        "start": 1249.52,
        "end": 1254.32
    },
    {
        "text": " pero como ni me importa cuál es el operador y nada, lo escribo así, esto es igual a esto.",
        "start": 1254.32,
        "end": 1260.52
    },
    {
        "text": " ¿Se entendió o no? Segunda parte, las otras son más sencillas todavía.",
        "start": 1269.96,
        "end": 1277.32
    },
    {
        "text": " Acá ni siquiera necesito usar el teorema que les escribió anteriormente. Segunda parte, si uno",
        "start": 1278.12,
        "end": 1285.72
    },
    {
        "text": " quiere calcular la trasa de B y sabe que las matrides son semejantes, es decir uno sabe que B es",
        "start": 1285.72,
        "end": 1295.8799999999999
    },
    {
        "text": " P a la menos 1 por A por P para una matriz cuadrada invertible P. Entonces la trasa de B es la trasa",
        "start": 1295.8799999999999,
        "end": 1305.2
    },
    {
        "text": " de P a la menos 1 a por P. Se acuerdan lo que es la trasa, la suma de los elementos de la",
        "start": 1307.72,
        "end": 1312.6399999999999
    },
    {
        "text": " llavora. Bueno y hoy con la trasa tengo que recurrir también una vieja propiedad que han visto en",
        "start": 1312.6399999999999,
        "end": 1324.2
    },
    {
        "text": " galuno. La trasa con uno multiplica dos matrises, no me importa el orden que las multiplico me da lo",
        "start": 1324.2,
        "end": 1330.04
    },
    {
        "text": " mismo. La trasa de A por B me da lo mismo que la trasa de B por A, cualquier que sean las",
        "start": 1330.04,
        "end": 1334.56
    },
    {
        "text": " matrises ahí ves. Entonces fíjense que acá puedo conmuntar el orden de esto con esto y calcular",
        "start": 1334.56,
        "end": 1341.6399999999999
    },
    {
        "text": " la trasa que me da lo mismo. Ahora si yo calcular la trasa y si yo escribo la trasa entonces estoy",
        "start": 1341.6399999999999,
        "end": 1349.28
    },
    {
        "text": " conmuntando el orden de esto con esto, primero me va a quedar a por P y después me va a quedar",
        "start": 1349.28,
        "end": 1353.96
    },
    {
        "text": " P a la menos 1. Exactamente. Entonces todo lo que hice acá es usar una propiedad que ustedes han",
        "start": 1353.96,
        "end": 1360.3999999999999
    },
    {
        "text": " visto en galuno que emite que la trasa del producto de dos matrises me da lo mismo en cualquier",
        "start": 1360.4,
        "end": 1365.0800000000002
    },
    {
        "text": " orden que ponga esas matrises del producto. Entonces esto me da la trasa de esta matriz primero a",
        "start": 1365.0800000000002,
        "end": 1371.3200000000002
    },
    {
        "text": " por P por esta segunda y acá la ventaja es que quedan P y para la menos 1 multiplicadas",
        "start": 1371.3200000000002,
        "end": 1376.2800000000002
    },
    {
        "text": " consecutivas. Entonces esto me da lo mismo que la trasa de A por la identidad, o sea la trasa de A.",
        "start": 1376.2800000000002,
        "end": 1384.48
    },
    {
        "text": " Bien, galuno, estamos viendo cosas de galuno y la última determinante es igual de sencilla.",
        "start": 1384.48,
        "end": 1398.24
    },
    {
        "text": " El determinante de B es el determinante de un producto y como ustedes saben el determinante",
        "start": 1398.24,
        "end": 1414.28
    },
    {
        "text": " de un producto es el producto de los determinantes y ¿qué más puedo hacer ahí? No, bueno, pero no se",
        "start": 1414.28,
        "end": 1439.32
    },
    {
        "text": " falta porque estos números reales. Este el determinante le inversa que es 1 sobre el",
        "start": 1439.32,
        "end": 1445.1
    },
    {
        "text": " determinante de P, o sea esto acá no es otra cosa que 1 sobre el determinante de P, con lo cual",
        "start": 1445.1,
        "end": 1452.08
    },
    {
        "text": " este determinante de P abajo se me va con el determinante de P acá arriba y me queda determinante.",
        "start": 1452.08,
        "end": 1458.32
    },
    {
        "text": " Bien, es decir, si dos matrises son semejantes entonces necesariamente el rango es el mismo,",
        "start": 1458.32,
        "end": 1467.04
    },
    {
        "text": " la trasa de la misma y el determinante es el mismo. Esto me sirve por ejemplo para ver de manera",
        "start": 1467.04,
        "end": 1475.04
    },
    {
        "text": " sencilla cuando dos matrises no son semejantes porque si veo que alguna de estas cosas no se cumple,",
        "start": 1475.04,
        "end": 1480.6399999999999
    },
    {
        "text": " ya concluyo que las matrises no son semejantes. Pero como le dije recién, no me basta comprobar estas",
        "start": 1480.6399999999999,
        "end": 1490.76
    },
    {
        "text": " tres condiciones para concluir que las matrises son semejantes y para eso les voy a poner",
        "start": 1490.76,
        "end": 1496.3999999999999
    },
    {
        "text": " un ejemplo. Lo más sencillo posible, siempre hay que buscar los ejemplos con las matrises",
        "start": 1496.4,
        "end": 1505.48
    },
    {
        "text": " de tamaño más chica, digamos las más chicas se venden uno por uno, pero bueno uno busca los siguientes",
        "start": 1505.48,
        "end": 1511.88
    },
    {
        "text": " más sencillos, son las matrises dos por dos y la observación es así.",
        "start": 1511.88,
        "end": 1518.88
    },
    {
        "text": " Es recipro con no es cierto, es decir, existen matrises que tienen el mismo rango, la misma trase,",
        "start": 1518.88,
        "end": 1544.88
    },
    {
        "text": " el mismo determinante y no son semejantes.",
        "start": 1544.88,
        "end": 1551.88
    },
    {
        "text": " Ya más adelante ustedes van a ver estas dos matrises pues así se van a dar cuenta en un segundo",
        "start": 1551.88,
        "end": 1574.2800000000002
    },
    {
        "text": " que no son semejantes pero eso lo vamos a ir viendo a lo largo del curso. Matrises",
        "start": 1574.28,
        "end": 1581.3999999999999
    },
    {
        "text": " análogas a esta ahí, una diagonal y otra que no es una diagonal sino que es una diagonal",
        "start": 1581.3999999999999,
        "end": 1586.6399999999999
    },
    {
        "text": " con algo metido abajo. Bueno y con los números apropiados ahí. Fíjese lo siguiente, ¿cuál",
        "start": 1586.6399999999999,
        "end": 1599.78
    },
    {
        "text": " es el rango de esta? Obviamente dos, que también es el rango de esta, no porque las dos filas",
        "start": 1599.78,
        "end": 1605.5
    },
    {
        "text": " son loñame que independientes tanto acá como acá. ¿Cuál es la trasa? Están bien trasados",
        "start": 1605.5,
        "end": 1610.7
    },
    {
        "text": " y están bien trasados y ¿cuál es el determinante? Uno, uno por uno menos cero, uno por uno menos",
        "start": 1610.7,
        "end": 1617.74
    },
    {
        "text": " cero. O sea que estas tienen el mismo, la misma trasa, el mismo rango y el mismo determinante.",
        "start": 1617.74,
        "end": 1623.94
    },
    {
        "text": " Fíjense, supongamos que no quiera ver si son semejantes o no, supongamos que sí lo son,",
        "start": 1623.94,
        "end": 1631.74
    },
    {
        "text": " supongamos, existe p tal que ves a escribir como p a la menos uno por a por p. Estamos",
        "start": 1631.74,
        "end": 1651.46
    },
    {
        "text": " supongamos que fuesen semejantes y vamos a llegar a una contradicción que es muy sencilla",
        "start": 1651.46,
        "end": 1658.22
    },
    {
        "text": " porque esta no son la cosa que la matriz y identidad. Entonces, ¿qué me da a pear a",
        "start": 1658.22,
        "end": 1668.6200000000001
    },
    {
        "text": " la menos uno por el diente por primera identidad? O sea que esto acá me da identidad y sin embargo",
        "start": 1668.6200000000001,
        "end": 1676.02
    },
    {
        "text": " bueno, ¿cómo ven o es la identidad? Ahí está el absurdo. Sí. Bueno, ven o es la identidad, o sea acá mismo",
        "start": 1676.02,
        "end": 1687.58
    },
    {
        "text": " esta escrita la contradicción. Por lo tanto, ahí ve no son semejantes. Está claro.",
        "start": 1687.58,
        "end": 1710.46
    },
    {
        "text": " Preguntas hasta acá. Entonces, a lo que vamos a ir ahora es al problema concreto de encontrar",
        "start": 1717.58,
        "end": 1741.78
    },
    {
        "text": " bases apropias en las cuales un operador se escribe de la manera más sencilla posible. ¿Qué quiere",
        "start": 1741.78,
        "end": 1747.1399999999999
    },
    {
        "text": " decir que sea la manera más sencilla posible que la matriz asociada sea odiagonal o lo más",
        "start": 1747.14,
        "end": 1752.98
    },
    {
        "text": " parecía posible una diagonal? Porque si uno tiene cosas de ese tipo, entonces las potencias son",
        "start": 1752.98,
        "end": 1757.66
    },
    {
        "text": " fáciles de calcular, los polinómios que involucran a matriz son fáciles de calcular y un montón",
        "start": 1757.66,
        "end": 1763.26
    },
    {
        "text": " de funciones que involucran potencias de una matriz son más fáciles de calcular. Y eso es",
        "start": 1763.26,
        "end": 1771.7
    },
    {
        "text": " el problema que vamos a fronter ahora. Entonces, vamos a comenzar definiendo un concepto fundamental del",
        "start": 1771.7,
        "end": 1780.42
    },
    {
        "text": " curso que es la anosión de vectores y de valores propios. Primero vamos a dar la definición y después",
        "start": 1780.42,
        "end": 1787.82
    },
    {
        "text": " vamos a ver para qué sirven estos actores y valores propios si es que existen y qué tienen que ver",
        "start": 1787.82,
        "end": 1792.88
    },
    {
        "text": " eso con el proceso de diagonalización que les estaba comentando recién. Estamos entonces, vamos a",
        "start": 1792.88,
        "end": 1798.5800000000002
    },
    {
        "text": " comenzar con una definición, vamos a hacer varios ejemplos de vectores y valores propios y vamos a",
        "start": 1798.58,
        "end": 1804.78
    },
    {
        "text": " dar un par de propiedades pero digamos que acá empieza la parte linda del curso.",
        "start": 1804.78,
        "end": 1808.1399999999999
    },
    {
        "text": " Bien, ingredientes que necesitamos, un espacio vectorial, ¿Ve? Espacio vectorial.",
        "start": 1816.82,
        "end": 1824.86
    },
    {
        "text": " Sobre, acá esto es importante, sobre un cuerpo que pueden ser los reales los complejos pero van a",
        "start": 1828.58,
        "end": 1838.06
    },
    {
        "text": " jugar un papel fundamental el cuerpo en el que estamos trabajando. Cuerpo real o cuerpo complejo. Hay otros",
        "start": 1838.06,
        "end": 1846.02
    },
    {
        "text": " cuerpos pero no solo nos vamos a quedar acá, solamente reales complejos. Bien, vamos a definir",
        "start": 1846.02,
        "end": 1854.78
    },
    {
        "text": " la anosión de vector propio, un vector propio de un operador lineal.",
        "start": 1854.78,
        "end": 1861.02
    },
    {
        "text": " Deté, un operador propio de té asociado a un valor propio.",
        "start": 1870.62,
        "end": 1874.82
    },
    {
        "text": " Como siempre escribe y después revemos lo que estoy diciendo.",
        "start": 1884.78,
        "end": 1895.34
    },
    {
        "text": " Estos elementos van a aparecer de al horario todo el curso y de toda la carrera",
        "start": 1914.78,
        "end": 1944.66
    },
    {
        "text": " que ustedes han. La anosión de vector propio es fundamental. Entonces leamos esto lo que acabas",
        "start": 1944.66,
        "end": 1951.74
    },
    {
        "text": " escribir. Tengo un espacio vectorial sobre un cuerpo pues es reales o complejos y uno dice que",
        "start": 1951.74,
        "end": 1957.5400000000002
    },
    {
        "text": " un elemento del espacio vectorial, un V, si se pide la condición que V sea distinto de cero.",
        "start": 1957.5400000000002,
        "end": 1965.18
    },
    {
        "text": " Ya vamos a ver por qué. Un V, distinto de cero, es un vector propio de té asociado,",
        "start": 1965.18,
        "end": 1971.78
    },
    {
        "text": " a un valor propio lambda, un escalar lambda, si se cumple que T aplicado al vector V me da",
        "start": 1971.78,
        "end": 1979.3
    },
    {
        "text": " lambda multiplicado por V. Esto es fíjense que la idea es muy intuitiva geometricamente.",
        "start": 1979.3,
        "end": 1986.66
    },
    {
        "text": " Estamos buscando aquellos vectores en el espacio, tal es que la acción de té sobre esos",
        "start": 1986.66,
        "end": 1992.98
    },
    {
        "text": " vectores me da un múltiplo de sobre, de ese vector, si es que existe. O sea, estoy",
        "start": 1992.98,
        "end": 1998.06
    },
    {
        "text": " interesado en buscar si hay elemento del espacio vectorial, tal es que la acción de té",
        "start": 1998.06,
        "end": 2003.74
    },
    {
        "text": " sobre esos elementos es simplemente modificar su, como se dice, no cambiar su dirección,",
        "start": 2003.74,
        "end": 2012.82
    },
    {
        "text": " digamos. Pueden cambiar el sentido, cambiar el tamaño, etcétera, pero quedan en la misma",
        "start": 2012.82,
        "end": 2016.54
    },
    {
        "text": " dirección. Estamos. Ya vamos a ver varios ejemplos, pero lo importante, yo les remarqué",
        "start": 2016.54,
        "end": 2024.94
    },
    {
        "text": " que para que algo sea un vector propio tiene que ser un vector distinto de cero. ¿Por",
        "start": 2024.94,
        "end": 2029.06
    },
    {
        "text": " qué es eso? Porque si uno considerase la posibilidad de que un vector propio, pues el V",
        "start": 2029.06,
        "end": 2039.66
    },
    {
        "text": " igual a cero, llegaría algo trivial, algo que no tiene el menor sentido. Vamos a poner",
        "start": 2039.66,
        "end": 2052.94
    },
    {
        "text": " acá como comentario. V igual a cero se excluye, se excluye la definición, cione de vector",
        "start": 2052.94,
        "end": 2069.06
    },
    {
        "text": " propio por lo siguiente. Si yo le aplico T al cero, ustedes saben que sumen al cero,",
        "start": 2069.06,
        "end": 2083.66
    },
    {
        "text": " tu otra formación lineal aplica al cero, va al cero. Y el cero siempre es lambda por cero",
        "start": 2083.66,
        "end": 2090.06
    },
    {
        "text": " para cualquier lambda. Entonces fíjense que si el cero se incluye era, entonces, ten cero",
        "start": 2090.06,
        "end": 2096.86
    },
    {
        "text": " ser igual a lambda por cero para todo lambda en el cuerpo para todo escalarca. Y eso",
        "start": 2096.86,
        "end": 2101.8
    },
    {
        "text": " me estaría diciendo entonces que todo escalar sería un valor propio. Estoy trivializando",
        "start": 2101.8,
        "end": 2106.2200000000003
    },
    {
        "text": " el problema en un dirección que no quiero trivializarla. Yo no quiero que todos las",
        "start": 2106.2200000000003,
        "end": 2111.1
    },
    {
        "text": " lambas sean valores propios. Entonces, por eso se excluye V igual a cero de la definición",
        "start": 2111.1,
        "end": 2119.86
    },
    {
        "text": " de vector propio, porque si se incluye era entonces, siempre el cero sería vector propio",
        "start": 2119.86,
        "end": 2125.3
    },
    {
        "text": " para cualquier lambda. Y estoy cambiando, estoy deformando el problema de una manera que",
        "start": 2125.3,
        "end": 2131.6600000000003
    },
    {
        "text": " no quiero. Y todo lambda en cero sería valor propio. Entonces, ¿qué toque es bien claro?",
        "start": 2131.6600000000003,
        "end": 2145.42
    },
    {
        "text": " Si, el vector nulo queda excluido de la noción de vector propio. Nulo nunca hace un vector",
        "start": 2145.42,
        "end": 2152.94
    },
    {
        "text": " propio. Bien, eso está escrito todo. Y una segunda cuestión es que esto sí es importante,",
        "start": 2152.94,
        "end": 2164.7000000000003
    },
    {
        "text": " es que los valores propios tienen que estar en el cuerpo en el que se está trabajando.",
        "start": 2164.7000000000003,
        "end": 2179.34
    },
    {
        "text": " Lo que quiere decir, que a la hora en que uno esté haciendo cuentas para ver cómo",
        "start": 2179.34,
        "end": 2184.1000000000004
    },
    {
        "text": " se calculan esos valores propios, que ya lo vamos a ver, muchas veces pasa que uno está",
        "start": 2184.1000000000004,
        "end": 2189.44
    },
    {
        "text": " trabajando en los reales y uno resuelve una ecuación que me da lambda complejos que",
        "start": 2189.44,
        "end": 2196.82
    },
    {
        "text": " compre esta condición. A los complejos, a los que tienen parte imaginaria no trivial,",
        "start": 2196.82,
        "end": 2202.1800000000003
    },
    {
        "text": " no los puedo considerar como valores propios, porque tienen que estar en el cuerpo por definición.",
        "start": 2202.1800000000003,
        "end": 2206.6600000000003
    },
    {
        "text": " Por lo tanto, hay que tener cuidado con eso. Repito, si ustedes están trabajando con",
        "start": 2206.66,
        "end": 2213.5
    },
    {
        "text": " los reales y hacen los cálculos que ya veremos y dicen, bueno, me sale que lambda igual",
        "start": 2213.5,
        "end": 2219.14
    },
    {
        "text": " a uno más y compre esta condición, bueno, eso no es un valor propio, porque no está en",
        "start": 2219.14,
        "end": 2224.2999999999997
    },
    {
        "text": " el cuerpo. Es complejo, pero no es real. No es real, ¿tamos? Y esto no sé si sería mejor",
        "start": 2224.2999999999997,
        "end": 2235.7
    },
    {
        "text": " no haberlo escrito, porque es la… Si es el motivo por qué se excluye el vibracer.",
        "start": 2235.7,
        "end": 2245.9399999999996
    },
    {
        "text": " No me digan, después ve igual a cero, es vector propio, porque el profesor escribió en el",
        "start": 2245.9399999999996,
        "end": 2249.8999999999996
    },
    {
        "text": " pizarro que es vector propio. Está afilma de bail. Bueno. Vamos a hacer, entonces, el",
        "start": 2249.8999999999996,
        "end": 2259.2599999999998
    },
    {
        "text": " problema ahora que sigue es el siguiente. Vamos a ver algunos ejemplos y el problema es primero",
        "start": 2259.26,
        "end": 2265.82
    },
    {
        "text": " cómo se calculan los factores y los valores propios, si es que hay y después para que",
        "start": 2265.82,
        "end": 2273.38
    },
    {
        "text": " siguen. Bueno, por eso lo iremos viendo en las clases. ¿Qué viene? Vamos a considerar",
        "start": 2273.38,
        "end": 2284.7000000000003
    },
    {
        "text": " la transformación lineal de R2 en R2 del plano en el plano. Definí de la siguiente manera.",
        "start": 2284.7,
        "end": 2291.7
    },
    {
        "text": " Esta es la construida propósito porque está muy emparentada con un problema de los prácticos",
        "start": 2305.2999999999997,
        "end": 2312.8999999999996
    },
    {
        "text": " y los matrices se mejantes. No, no quiero ir al fin, pero sale bien por ahí. La te aplica",
        "start": 2312.9,
        "end": 2321.38
    },
    {
        "text": " de x y me da la primera componente, menos 12x más y y la segunda componente, 6x más",
        "start": 2321.38,
        "end": 2326.9
    },
    {
        "text": " y 6x pero menos y. Fíjense lo siguiente. Fíjense que si yo le aplico T al vector 1, 3,",
        "start": 2326.9,
        "end": 2340.9
    },
    {
        "text": " y la segunda es a la dupla 1, 3, veamos qué es lo que me da eso. La primera entrada que",
        "start": 2340.9,
        "end": 2349.3
    },
    {
        "text": " me da, 2x1 menos 2x1 más 3, o sea, me da 1 y la segunda, 6x1 que 6 menos 3, 3. Fíjense",
        "start": 2349.3,
        "end": 2365.82
    },
    {
        "text": " que si yo le aplico T al 1, 3 me da el mismo vector 1, 3. Entonces, ¿qué me está diciendo",
        "start": 2365.82,
        "end": 2372.98
    },
    {
        "text": " esto? Que el 1, 3 es vector propio asociado a qué valor propio. A 1 es como si yo tuviera",
        "start": 2372.98,
        "end": 2381.5
    },
    {
        "text": " 1, 1, pues está acá. Lo que dije es recién del 0, ojo, se refiere solamente a los",
        "start": 2381.5,
        "end": 2388.02
    },
    {
        "text": " vectores, no a los lambda, el lambda puede ser tranquilamente 0. Acá en este caso,",
        "start": 2388.02,
        "end": 2393.04
    },
    {
        "text": " la segunda me da 1, o sea, lo que estoy diciendo ahí es que el 1, 3 es valor propio,",
        "start": 2393.04,
        "end": 2404.8
    },
    {
        "text": " es perón, vector propio asociado exactamente, asociado al 1.",
        "start": 2404.8,
        "end": 2415.04
    },
    {
        "text": " Yo estoy diciendo dos cosas, 0 que el 1 es valor propio y segundo que uno 3 es vector",
        "start": 2415.04,
        "end": 2425.04
    },
    {
        "text": " propio asociado al 1. Y por otra parte, si le aplico T al 1 menos 2, ¿qué me cae",
        "start": 2425.04,
        "end": 2442.4
    },
    {
        "text": " ahí? La primera componente sí, la primera componente me queda menos 4, pero menos",
        "start": 2442.4,
        "end": 2449.4
    },
    {
        "text": " 2, menos 2, menos 4. Y la segunda componente me queda 6, más 2, 8. O sea que este 1,",
        "start": 2449.4,
        "end": 2461.28
    },
    {
        "text": " menos 2, es menos 4, 8, pero ahí que puedo hacer ahí, puedo sacar un menos 4 para afuera,",
        "start": 2461.28,
        "end": 2469.6
    },
    {
        "text": " menos 4 y acá me queda 1 y menos 2. Cámoso, o sea que fíjense que el 1 menos 2, si",
        "start": 2469.6,
        "end": 2481.88
    },
    {
        "text": " le lo aplico T, me da el mismo el propio 1 menos 2, multiplicado por lambda igual a",
        "start": 2481.88,
        "end": 2488.64
    },
    {
        "text": " menos 4. O sea, lo que estoy diciendo es que este vector propio asociado al 1 y",
        "start": 2488.64,
        "end": 2497.0
    },
    {
        "text": " menos 4. Ya veremos que a veces existen valores propios, a veces no, en no cualquier",
        "start": 2497.0,
        "end": 2504.64
    },
    {
        "text": " lambda es este valor propio, ya vamos a ver cómo se calculen esas cosas. Entonces,",
        "start": 2504.64,
        "end": 2509.8
    },
    {
        "text": " acá lo que estamos viendo es que 1 menos 2 es vector propio asociado a lambda igual",
        "start": 2509.8,
        "end": 2529.26
    },
    {
        "text": " a menos 4, al escalar menos 4. Estamos, eso es un primer ejemplo. Segundo ejemplo,",
        "start": 2529.26,
        "end": 2542.78
    },
    {
        "text": " vamos a esta definición, yo les había dicho que en el curso vamos a trabajar siempre con",
        "start": 2542.78,
        "end": 2548.6200000000003
    },
    {
        "text": " espacio de dimensión finita, aunque hay cosas que valen en espacio de dimensión infinita,",
        "start": 2548.6200000000003,
        "end": 2554.1400000000003
    },
    {
        "text": " en particular esta definición de valores y vectores propios vale para espacio de dimensión",
        "start": 2554.14,
        "end": 2559.3799999999997
    },
    {
        "text": " infinita, no hay ninguna restricción, es la misma definición de que contra un B en",
        "start": 2559.3799999999997,
        "end": 2563.74
    },
    {
        "text": " espacio de dimensión infinita, hasta que si le aplico T me queda un múltiplo de B.",
        "start": 2563.74,
        "end": 2567.94
    },
    {
        "text": " Vamos a poner un ejemplo en dimensión infinita, para eso vamos a considerar una transformación",
        "start": 2567.94,
        "end": 2575.54
    },
    {
        "text": " de esto saben lo que es, el espacio funciones derivables, con derivadas continuas en R, la",
        "start": 2575.54,
        "end": 2582.8599999999997
    },
    {
        "text": " clase C1 lo han visto, no hay esta notación. Tengo una transformación de funciones derivables,",
        "start": 2582.86,
        "end": 2589.86
    },
    {
        "text": " con derivadas continuas reales en C1 del mismo espacio y la vamos a definir de la siguiente manera.",
        "start": 2589.86,
        "end": 2600.1
    },
    {
        "text": " T me agarro una función cualquiera de clase C1 y le asigna una nueva función que es la derivada",
        "start": 2600.1,
        "end": 2614.3399999999997
    },
    {
        "text": " más F. Agarro una función cualquiera y la acción de T sobre esas funciones derivarla y",
        "start": 2614.3399999999997,
        "end": 2624.62
    },
    {
        "text": " su malo la propia función, eso está claro que es una transformación línea, lo han visto,",
        "start": 2624.62,
        "end": 2628.5
    },
    {
        "text": " este tipo de ejemplo lo han visto en G1 y lo que quiero darles un ejemplo de una función que",
        "start": 2628.5,
        "end": 2639.38
    },
    {
        "text": " cumple el rol de un vector propio, fíjense, consideremos la siguiente función,",
        "start": 2639.38,
        "end": 2646.58
    },
    {
        "text": " fdx igual a e a la menos ex para todo x real, esta es la función que estoy considerando.",
        "start": 2646.58,
        "end": 2660.58
    },
    {
        "text": " Esa es la función si yo quiero ver a dónde va a parar esa función cuando le aplico T,",
        "start": 2664.58,
        "end": 2671.18
    },
    {
        "text": " yo calcular su derivada y su malo la propia función. Entonces fíjense la función transformada,",
        "start": 2671.18,
        "end": 2678.7799999999997
    },
    {
        "text": " T, f esto que tengo acá es una función evaluada en x, lo han visto, aunque queda un poco fía la",
        "start": 2678.7799999999997,
        "end": 2687.06
    },
    {
        "text": " notación, esta función asociada de valor de nx es fíjense en x más fdx y ¿qué me da eso?",
        "start": 2687.06,
        "end": 2702.94
    },
    {
        "text": " fíjense es menos e a la menos ex y fdx es e a la menos ex, o sea que esto me da",
        "start": 2702.94,
        "end": 2713.2999999999997
    },
    {
        "text": " fíjense en x, o sea que T la transformación T de fíjense en x me da la función y fíjense en x,",
        "start": 2713.86,
        "end": 2726.0600000000004
    },
    {
        "text": " o sea que esto se entiende, T aplica de esta función, me da cero, me da la función identicamente",
        "start": 2726.0600000000004,
        "end": 2736.0600000000004
    },
    {
        "text": " cero, sí. Perdón ahí, ahí permite también ser un comentario, una cosita, esta es la transformación,",
        "start": 2736.06,
        "end": 2759.58
    },
    {
        "text": " aplica una f generica y esta es una f particular, para no enrollar no le vamos a llamar a esta f0,",
        "start": 2759.58,
        "end": 2764.94
    },
    {
        "text": " una f particular en todos lados le vamos a poner f0, cuanto vale T aplica a f0 a ese vector",
        "start": 2764.94,
        "end": 2770.78
    },
    {
        "text": " particular, vale T aplica a ese vector particular a esa función particular vale la función identicamente",
        "start": 2770.78,
        "end": 2778.2200000000003
    },
    {
        "text": " cero, entonces ¿qué estamos diciendo? Que ahí va, esto lo podemos escribir obviamente como 0 por",
        "start": 2778.2200000000003,
        "end": 2789.42
    },
    {
        "text": " la función f0, o sea lo que estamos diciendo es que esta función f0 es vector propio de este",
        "start": 2789.98,
        "end": 2798.3
    },
    {
        "text": " operador con valor propio, lambda y baracero, ¿sabes? Entonces ahí estamos diciendo que f0 es vector",
        "start": 2798.3,
        "end": 2813.1800000000003
    },
    {
        "text": " propio de esa transformación línea que tengo ahí arriba asociada el valor propio",
        "start": 2813.18,
        "end": 2822.4199999999996
    },
    {
        "text": " al valor propio lambda y baracero, simplemente leer eso bien, se entendió esto, estamos haciendo",
        "start": 2828.94,
        "end": 2841.5
    },
    {
        "text": " T aplica a esta f0 particular que es una función, esa función evaluada en cualquier",
        "start": 2842.06,
        "end": 2847.26
    },
    {
        "text": " x me da cero, por lo tanto T aplica a esta función me da la función identicamente cero,",
        "start": 2847.26,
        "end": 2853.58
    },
    {
        "text": " luego tengo acá, y al cero lo podemos escribir como cero por la función que estoy poniendo,",
        "start": 2853.58,
        "end": 2858.5
    },
    {
        "text": " entonces tengo que f0 es vector propio de esta transformación asociada el valor propio lambda y baracero.",
        "start": 2858.5,
        "end": 2864.18
    },
    {
        "text": " Eso son todos de ejemplo de un ejemplo de valores y vectores propios de mesión finita o una",
        "start": 2865.02,
        "end": 2871.3399999999997
    },
    {
        "text": " limisión infinita, y ahora les voy a poner un ejemplo, no existen valores y vectores propios,",
        "start": 2871.3399999999997,
        "end": 2876.66
    },
    {
        "text": " o sea el asunto es ahora ver cuando un escalar es un valor propio y para ese escalar que",
        "start": 2876.66,
        "end": 2886.74
    },
    {
        "text": " es valor propio, o sea que existe, ver cuáles son todos los vectores que son vectores",
        "start": 2886.74,
        "end": 2892.22
    },
    {
        "text": " propios de escalar, esa es la idea. Finalmente el tercer ejemplo vamos a consigue una transformación",
        "start": 2892.22,
        "end": 2903.22
    },
    {
        "text": " del R2 en R2, que no es otra cosa que la rotación alrededor del origen por una angular alpha,",
        "start": 2903.22,
        "end": 2918.3799999999997
    },
    {
        "text": " que lo vamos a elegir distinto de p.",
        "start": 2922.4199999999996,
        "end": 2925.1
    },
    {
        "text": " Puse de ya va a quedar claro porque puse distinto de p. Fíjense, ¿qué me hace la transformación",
        "start": 2933.22,
        "end": 2952.4599999999996
    },
    {
        "text": " de la baña le está? Me agarras un vector cualquier acá y me lo rota una angular alpha y esto me da",
        "start": 2952.46,
        "end": 2960.7400000000002
    },
    {
        "text": " te aplica de vez. Eso puede existir un vector B que sea vector propio, no porque ya dijimos que los",
        "start": 2960.7400000000002,
        "end": 2975.14
    },
    {
        "text": " vectores propios son aquellos vectores para los cuales la acción del te aplica a ese vector me da",
        "start": 2975.14,
        "end": 2980.42
    },
    {
        "text": " un múltiplo de B. Entonces acá no lo obtengo, lo que obtengo es que si agarras con este vector le",
        "start": 2980.42,
        "end": 2986.7000000000003
    },
    {
        "text": " aplico T y lo giro. Entonces salvo que alpha se igual a P, ¿qué pasa cuando alfegora? Piarar un",
        "start": 2986.7000000000003,
        "end": 2995.62
    },
    {
        "text": " vector y le voy justamente la vuelta hasta el otro lado, o sea obtengo si alpha fue ese P te",
        "start": 2995.62,
        "end": 3001.8
    },
    {
        "text": " aplicado a vez sería menos B. Entonces lo que tengo que cualquier vector B sería distinto",
        "start": 3001.8,
        "end": 3008.82
    },
    {
        "text": " de 0 sería vector propio, sociado al ámdico a la menor subo. Entonces hay que sacar los múltiplos",
        "start": 3008.82,
        "end": 3013.6600000000003
    },
    {
        "text": " de P, P2P, etcétera puse solamente P porque estoy trabajando con un alpha entre 0 y 2P sin",
        "start": 3013.6600000000003,
        "end": 3020.6600000000003
    },
    {
        "text": " incluir 2P. ¿Y qué pasa hacia alpha fue si igual a 0? Claro, si hacia alpha fue si igual a 0 a",
        "start": 3020.6600000000003,
        "end": 3029.7000000000003
    },
    {
        "text": " cualquier vector propio B le aplico T y me que a mismo vector, o sea que cualquier vector",
        "start": 3029.7000000000003,
        "end": 3034.98
    },
    {
        "text": " recito de 0 es un vector propio asociado al ámdico a la menor subo. Pero eso es un caso particular.",
        "start": 3034.98,
        "end": 3040.54
    },
    {
        "text": " Perdón, perdón, perdón, perdón. Alpha distinto de 0 y alpha distinto de P. Sí, porque si alpha",
        "start": 3040.54,
        "end": 3053.3
    },
    {
        "text": " es igual a 0, me queda la identidad y la identidad de B es B para todo. Entonces cualquier vector",
        "start": 3053.3,
        "end": 3060.1
    },
    {
        "text": " distinto de 0 es vector propio con el ámdico a la menor subo. Bien, entonces ¿cómo andamos con el tiempo?",
        "start": 3060.1,
        "end": 3079.38
    },
    {
        "text": " Bueno, perfecto, no es que yo tiempo para ver lo que quiero dar. Entonces ahora queda el",
        "start": 3079.38,
        "end": 3098.62
    },
    {
        "text": " siguiente punto es este. Supongamos que yo tengo un valor propio, que alguien me dice que un",
        "start": 3098.62,
        "end": 3105.58
    },
    {
        "text": " lado de la nada es valor propio y quiero considerar todos los vectores propios asociados a ese valor",
        "start": 3105.58,
        "end": 3111.1
    },
    {
        "text": " propio, ese conjunto. Quiero ver qué estructura tiene agregándole el 0 a ese conjunto sí le",
        "start": 3111.1,
        "end": 3117.98
    },
    {
        "text": " voy a agregar el 0 y vamos a poner que eso es un subesparcio vectorial. Sí, porque cuando",
        "start": 3117.98,
        "end": 3143.62
    },
    {
        "text": " no hay vectores propios, ni van los propios. La definición de vector propio es que la acción",
        "start": 3143.62,
        "end": 3155.94
    },
    {
        "text": " de T aplicada B me de un múltiplo de ese vector. Entonces, si la transformación consiste en",
        "start": 3155.94,
        "end": 3162.9
    },
    {
        "text": " agarrar un vector y girarlo un ángulo de alpha donde ese ángulo no es ni 0 ni P, entonces es",
        "start": 3162.9,
        "end": 3170.38
    },
    {
        "text": " imposible que agarrar un B y aplicar el T o tener algo que sea proporcional, porque siempre",
        "start": 3170.38,
        "end": 3176.58
    },
    {
        "text": " le aplico este y lo corro. A no ser que alpha sea igual a 0 con lo cual me queda el mismo vector,",
        "start": 3176.58,
        "end": 3182.1
    },
    {
        "text": " o alpha igual a P con lo cual lo estoy dando vuelta y ahí si me queda un vector alineado con B.",
        "start": 3182.1,
        "end": 3187.46
    },
    {
        "text": " La bien, esa es la de nada. Entonces, supongamos que fíjense acá y acá hay una cuestión, entonces",
        "start": 3187.46,
        "end": 3196.46
    },
    {
        "text": " queda claro. Escribí acá no tiene valores propios o lo... No lo escribí así, vamos, vamos,",
        "start": 3196.46,
        "end": 3206.42
    },
    {
        "text": " escribí. Esto acá no tiene valores ni vectores propios. Entonces, el asunto es siguiente, los",
        "start": 3206.42,
        "end": 3224.7400000000002
    },
    {
        "text": " valores y vectores propios, a veces existen, a veces no y si existen, si existen un valor propio,",
        "start": 3224.7400000000002,
        "end": 3233.98
    },
    {
        "text": " queremos ver entonces, cuáles son todos los vectores propios asociados a ese valor propio.",
        "start": 3233.98,
        "end": 3238.54
    },
    {
        "text": " Entonces, de ahí viene la siguiente definición, si es un operador lineal,",
        "start": 3239.78,
        "end": 3244.62
    },
    {
        "text": " definimos ese sublanda a operador lineal y landa valor propio.",
        "start": 3244.62,
        "end": 3267.7
    },
    {
        "text": " Yo sé que landa valor propio, por lo tanto sé que existe un B, al menos un B, tal que",
        "start": 3267.7,
        "end": 3278.1
    },
    {
        "text": " te he aplicado B es landa por B. Entonces, vamos a definir el conjunto, ese landa como el",
        "start": 3278.1,
        "end": 3285.18
    },
    {
        "text": " conjunto de todos los elementos del espacio eventual, tal es que T aplicado a B es landa por B.",
        "start": 3285.18,
        "end": 3294.3799999999997
    },
    {
        "text": " Bien, entonces, tengo un operador lineal, tengo un valor propio y con ese valor propio",
        "start": 3297.7,
        "end": 3312.74
    },
    {
        "text": " me calculo, todos los elementos del espacio vectorial, tal es que cumplen esto, TNB igual",
        "start": 3312.74,
        "end": 3317.8199999999997
    },
    {
        "text": " a landa por B. Y acá la observación que les decía recién, todos los vectores propios",
        "start": 3317.8199999999997,
        "end": 3322.8599999999997
    },
    {
        "text": " están acá, pero ahí más acá está el 0, que no es vector propio por definición, por",
        "start": 3322.86,
        "end": 3327.94
    },
    {
        "text": " lo que les comento el principio, pero está incluido acá dentro, porque justamente",
        "start": 3327.94,
        "end": 3331.5
    },
    {
        "text": " TNB es landa por 0. O sea que este conjunto está por definición todos los vectores propios",
        "start": 3331.5,
        "end": 3337.94
    },
    {
        "text": " asociados a landa y el 0. Y esto acá es lo que se llama su espacio propio, esto es",
        "start": 3337.94,
        "end": 3346.6600000000003
    },
    {
        "text": " lo que se llama su espacio propio asociado al valor propio landa. Y justamente lo que",
        "start": 3346.66,
        "end": 3368.8199999999997
    },
    {
        "text": " vamos a ver es que esto tiene la estructura de un sub espacio vectorial del espacio en",
        "start": 3368.8199999999997,
        "end": 3374.8999999999996
    },
    {
        "text": " el cual estamos trabajando. Está bien, entonces lo que vamos a probar es muy sencilla, la",
        "start": 3374.9,
        "end": 3394.2200000000003
    },
    {
        "text": " vamos a probar que esto efectivamente es un sub espacio vectorial y vamos a caracterizar.",
        "start": 3394.22,
        "end": 3404.98
    },
    {
        "text": " Me voy adelantando un poquito a lo que viene, simplemente para ver si le debía seclar",
        "start": 3404.98,
        "end": 3412.2999999999997
    },
    {
        "text": " un poquito. Yo tengo un espacio vectorial B y tengo, supongamos que yo tengo al menos",
        "start": 3412.2999999999997,
        "end": 3419.62
    },
    {
        "text": " un valor propio landa. Entonces, con ese valor propio landa me construyo este conjunto",
        "start": 3419.62,
        "end": 3425.8599999999997
    },
    {
        "text": " que ya veremos que es un sub espacio vectorial y este será el S sublanda. Y está ahí",
        "start": 3425.8599999999997,
        "end": 3431.46
    },
    {
        "text": " adentro. La pregunta natural es, puede tener respuesta afirmativo o no, pero pregunta natural",
        "start": 3431.46,
        "end": 3438.38
    },
    {
        "text": " es, habrá valores propios, tales que al conjunto B yo lo puedo particionar en su espacio",
        "start": 3438.38,
        "end": 3447.74
    },
    {
        "text": " de propios, una asociado landa 1, otra asociado landa 2, etcétera, que es una pregunta natural.",
        "start": 3447.74,
        "end": 3453.5
    },
    {
        "text": " Es decir, será que este espacio vectorial velo puede particionar en regiones, en su",
        "start": 3453.5,
        "end": 3458.3799999999997
    },
    {
        "text": " espacio, tales que un sub espacio son los vectores propios, asociado un valor propio, el",
        "start": 3458.3799999999997,
        "end": 3466.2599999999998
    },
    {
        "text": " otro son vectores propios, asociado otro, a veces sí, a veces no, porque por ejemplo",
        "start": 3466.2599999999998,
        "end": 3471.9399999999996
    },
    {
        "text": " en el caso de las rotaciones no hay valores propios. Entonces hay que tener cuidado, a veces",
        "start": 3471.9399999999996,
        "end": 3476.66
    },
    {
        "text": " sí, a veces no, vamos a ver cuando se puede, cuando no, y en el caso de que no se pueda",
        "start": 3476.66,
        "end": 3481.8999999999996
    },
    {
        "text": " que se hace, eso lo vamos a ver también, y en el caso de que sí se pueda para que sirve",
        "start": 3481.8999999999996,
        "end": 3488.98
    },
    {
        "text": " ese tipo de descomposiciones. Eso es un parte lo que viene. Lo que vamos a empezar",
        "start": 3488.98,
        "end": 3494.8599999999997
    },
    {
        "text": " viendo ahora es que esto acá es un sub espacio vectorial y eso le vamos a llamar lemma.",
        "start": 3494.8599999999997,
        "end": 3503.7799999999997
    },
    {
        "text": " La lambda es un sub espacio vectorial.",
        "start": 3503.78,
        "end": 3507.34
    },
    {
        "text": " Debe.",
        "start": 3507.34,
        "end": 3517.1000000000004
    },
    {
        "text": " ¿Qué hay que ver para probar que algo es un sub espacio vectorial?",
        "start": 3517.1,
        "end": 3533.2599999999998
    },
    {
        "text": " Claro, es alto, hay que ver que no es vacío, para empezar un sub espacio total no es un",
        "start": 3533.2599999999998,
        "end": 3541.9
    },
    {
        "text": " conjunto vacío y que es cerrado para la suma y multiplicaciones por escadar. Primero,",
        "start": 3541.9,
        "end": 3550.1800000000003
    },
    {
        "text": " porque no es vacío, bueno, porque el cero está acá dentro, el cero no es un vector propio,",
        "start": 3550.1800000000003,
        "end": 3555.54
    },
    {
        "text": " pero sí está dentro de conjunto, porque siempre cumple el cero, es lambda por cero. Entonces",
        "start": 3555.54,
        "end": 3561.14
    },
    {
        "text": " primera cuestión, el cero pertenece al conjunto, es el lambda, o sea, es el lambda, el",
        "start": 3561.14,
        "end": 3570.14
    },
    {
        "text": " cero es vacío. El asunto es que como el lambda es un valor propio, hay otros vectores",
        "start": 3570.14,
        "end": 3576.5
    },
    {
        "text": " no, no los vectores propios que están acá por definición de valor propio. Entonces",
        "start": 3576.5,
        "end": 3581.3399999999997
    },
    {
        "text": " este conjunto es un conjunto no trivial, es del cero, pero con alguna otra cosa.",
        "start": 3581.3399999999997,
        "end": 3588.14
    },
    {
        "text": " Vamos. Quiero ver además que es cerrado para la multiplicación por un escalar, o sea,",
        "start": 3588.14,
        "end": 3599.5
    },
    {
        "text": " si ve está en ese lambda y alpha es un escalar, queremos ver que alpha por beta también está",
        "start": 3599.5,
        "end": 3611.98
    },
    {
        "text": " en ese lambda. Y esto es una trivialidad enorme, cuanto vale T aplicado alpha por beta. El",
        "start": 3611.98,
        "end": 3626.98
    },
    {
        "text": " alpha lo se compra fuera, esta demostración se ascenso las pero las vamos a hacer. Como",
        "start": 3626.98,
        "end": 3634.26
    },
    {
        "text": " ve está en ese lambda, te ha aplicado B es lambda por B, entonces esto es alpha por lambda",
        "start": 3634.26,
        "end": 3641.38
    },
    {
        "text": " por B y esto lo puedo escribir, esto son escalar, lo puedo escribir como lambda por alpha por",
        "start": 3641.38,
        "end": 3646.38
    },
    {
        "text": " B. O sea que te ha aplicado alpha por B, me da lambda por alpha por B. Conclusión,",
        "start": 3646.38,
        "end": 3656.94
    },
    {
        "text": " alpha por B también está en el conjunto de celamda. O sea que llevar un vector en ese",
        "start": 3656.94,
        "end": 3663.3
    },
    {
        "text": " lambda y lo multiplico por un escalar cualquiera que ese producto alpha por B también está en",
        "start": 3663.3,
        "end": 3669.34
    },
    {
        "text": " ese lambda. Y la suma y terminamos, la suma es igual de ese sencillo.",
        "start": 3669.34,
        "end": 3678.2200000000003
    },
    {
        "text": " Y la última es que si B y W está en ese conjunto queremos ver que la suma también está.",
        "start": 3678.22,
        "end": 3697.2599999999998
    },
    {
        "text": " Bien, entonces apliquemos T a la suma, B más W, esta es absolutamente trivial, esto",
        "start": 3697.26,
        "end": 3714.6200000000003
    },
    {
        "text": " es como una transformación lineal Tmb más Tmb, como ve y W está en el lambda en ese conjunto,",
        "start": 3714.62,
        "end": 3729.38
    },
    {
        "text": " el lambda esto Tmb es lambda por B y Tmb es lambda por Wb. Lambda es un escalar que lo",
        "start": 3729.38,
        "end": 3737.1
    },
    {
        "text": " puedo sacar factor común. O sea que te ha aplicado a B más Wb, lambda por B más Wb, o sea",
        "start": 3737.1,
        "end": 3749.5
    },
    {
        "text": " que B más Wb también está en este conjunto. O sea que lo que estamos probando es que ese",
        "start": 3749.5,
        "end": 3762.14
    },
    {
        "text": " conjunto es novacio, es cerrado para la suma, es cerrado para la multiplicación por escalar,",
        "start": 3762.14,
        "end": 3767.9
    },
    {
        "text": " por lo tanto es el lambda es un subespacio del tutorial de B. Y tiene sentido entonces llamarlo",
        "start": 3767.9,
        "end": 3788.58
    },
    {
        "text": " subespacio propio, associado al lambda. Es un subespacio vectorial, el problema es como le decía",
        "start": 3788.58,
        "end": 3794.62
    },
    {
        "text": " recién, no es el cero, no es el trivial, porque tiene el cero pero como lambda es un valor propio,",
        "start": 3794.62,
        "end": 3803.02
    },
    {
        "text": " tiene cosas distintos de cero que están acá dentro, porque tiene vectores propios.",
        "start": 3803.02,
        "end": 3807.34
    },
    {
        "text": " Incluso es el lambda podría ser todo el espacio, por ejemplo, en qué ejemplo este es el",
        "start": 3807.34,
        "end": 3817.86
    },
    {
        "text": " lambda vale todo el espacio, un ejemplo sencillo. Claro, el cero en la T identicamente igual",
        "start": 3817.86,
        "end": 3826.2200000000003
    },
    {
        "text": " a cero cumple que te aplica cualquier vector B me da cero, o sea que cualquier ve vector",
        "start": 3826.2200000000003,
        "end": 3832.5
    },
    {
        "text": " propios o cero y hay otra también fácil, la identidad cumple que la identidad aplica a B me da",
        "start": 3832.5,
        "end": 3840.66
    },
    {
        "text": " B para cualquier vectoro, o sea que la identidad, o sea cualquier vectoro de acá es vectoro propios",
        "start": 3840.66,
        "end": 3849.46
    },
    {
        "text": " o sea con lambda igual a 1 y se agrega el cero, tengo el espacio entero.",
        "start": 3849.46,
        "end": 3852.66
    },
    {
        "text": " Bien, una observación que va a ser útil para la caracterización de las cosas que estamos viendo,",
        "start": 3853.66,
        "end": 3863.94
    },
    {
        "text": " también es muy sencilla de probar.",
        "start": 3863.94,
        "end": 3866.46
    },
    {
        "text": " Eso parece una cosa rara como está escrito pero es bien sencillo y interpretable.",
        "start": 3866.46,
        "end": 3883.06
    },
    {
        "text": " Esta n acá es el núcleo, esto quiere decir núcleo, es la n del núcleo, esto ya han visto en",
        "start": 3883.06,
        "end": 3888.86
    },
    {
        "text": " el valor. Lo que estamos diciendo es que dado lambda un valor propio, si yo tengo un valor",
        "start": 3888.86,
        "end": 3894.6200000000003
    },
    {
        "text": " propio y calculo este es el lambda, ese lambda es lo mismo que el núcleo de la siguiente",
        "start": 3894.6200000000003,
        "end": 3901.6200000000003
    },
    {
        "text": " transformación señal, la transformación señal T menos lambda por la identidad, la T que tengo",
        "start": 3901.6200000000003,
        "end": 3908.2200000000003
    },
    {
        "text": " que estoy considerando menos lambda por la transformación identidad. Eso así es simple",
        "start": 3908.2200000000003,
        "end": 3917.82
    },
    {
        "text": " y lo que veis está como parturo un poco pero es la demostración es absolutamente trivial y",
        "start": 3917.82,
        "end": 3924.2200000000003
    },
    {
        "text": " esta caracterización de hecho la vamos a usar un montón de veces, fíjense, la demostración es bien sencilla.",
        "start": 3924.2200000000003,
        "end": 3930.38
    },
    {
        "text": " La demostración es tomemos, vamos a probar que todo elemento acá hasta contenido acá y viceversa,",
        "start": 3936.7400000000002,
        "end": 3944.1800000000003
    },
    {
        "text": " vamos a probar que un ve acá es un ve esta casi solo si está acá. Entonces, consideremos un ve que",
        "start": 3944.18,
        "end": 3954.18
    },
    {
        "text": " está en ese lambda, entonces esta en ese lambda es lo mismo que decir que T en ve es lambda por ve.",
        "start": 3954.18,
        "end": 3962.2999999999997
    },
    {
        "text": " Bien y esto obviamente lo mismo que decir que T en ve si paso esto restando por el otro lado,",
        "start": 3962.3,
        "end": 3982.46
    },
    {
        "text": " menos lambda por ve es igual a 0 al ve y ahora ahí me gustaría sacar como factor común, esto",
        "start": 3982.46,
        "end": 3995.66
    },
    {
        "text": " escribí lo como una transformación de pica B y ahí hay que tener un poquito de cuidado porque",
        "start": 3995.66,
        "end": 4001.54
    },
    {
        "text": " esto es una transformación señal y esto es un escalar, como hago para escribirlo esto como una",
        "start": 4001.54,
        "end": 4005.94
    },
    {
        "text": " transformación señal aplicado a V, digo uno estaría tentado esto que voy a escribir ahora está mal,",
        "start": 4005.94,
        "end": 4013.38
    },
    {
        "text": " sí está mal, uno estaría escribir, intentado escribir T en ve, menos lambda por ve igual a 0 pero",
        "start": 4013.38,
        "end": 4021.82
    },
    {
        "text": " cuidado porque esto es un operador y esto es una escalar, entonces como hago para escribir esto pero",
        "start": 4021.82,
        "end": 4028.1
    },
    {
        "text": " de manera que esté bien escrito, bueno a esto lo tengo que ver como si esto estuviera multiplicado",
        "start": 4028.1,
        "end": 4032.82
    },
    {
        "text": " por el operador y entidad, entonces esto en realidad la manera correcta escribirlo es esta, T",
        "start": 4032.82,
        "end": 4038.94
    },
    {
        "text": " menos lambda por el operador y entidad aplicado a V me da 0, estamos guarda con eso, entonces esto",
        "start": 4038.94,
        "end": 4046.42
    },
    {
        "text": " lo mismo que decir que esto lo mismo que decir que T menos lo que estaba muernando lo que había",
        "start": 4046.42,
        "end": 4057.46
    },
    {
        "text": " escrito antes sin el lambda esto sí está bien, si lo que estoy diciendo acá es que esto",
        "start": 4057.46,
        "end": 4061.78
    },
    {
        "text": " mismo que T menos lambda por el operador y entidad aplicado a V me da 0, o sea que lo que estoy",
        "start": 4061.78,
        "end": 4069.46
    },
    {
        "text": " diciendo es que V está en el núcleo de esta transformación señal, porque esta transformación",
        "start": 4069.46,
        "end": 4076.1800000000003
    },
    {
        "text": " señal aplicado a V me da 0, o sea efectivamente V está en el núcleo de la transformación T menos",
        "start": 4076.1800000000003,
        "end": 4085.86
    },
    {
        "text": " lambda por el operador y ahí estamos caracterizando el subespacio social lambda cuando lambda es un",
        "start": 4085.86,
        "end": 4096.62
    },
    {
        "text": " valor propio con el núcleo de una transformación lineal que involucra lambda, cuidado tenemos que saber",
        "start": 4096.62,
        "end": 4102.66
    },
    {
        "text": " que lambda es un valor propio si no es la construcción no tiene el menos sentido, entonces el problema",
        "start": 4102.66,
        "end": 4114.66
    },
    {
        "text": " ahora justamente es como calcular si es que existen los valores y vectores propios de un operador",
        "start": 4114.66,
        "end": 4121.78
    },
    {
        "text": " lineal y ahora sí trabajaremos en esta parte en dimensión finita porque vamos a trabajar con",
        "start": 4121.78,
        "end": 4126.74
    },
    {
        "text": " matrices, siempre que hacemos matrices, estamos asumiendo que la dimensión es finita, con dimensión",
        "start": 4126.74,
        "end": 4134.34
    },
    {
        "text": " infinita hay que tener algún cuidado, a ver, pero esto, a ver, como ya está por terminar la clase,",
        "start": 4134.34,
        "end": 4157.58
    },
    {
        "text": " voy a dejar, no voy a terminar la clase, ahora quiero que ustedes me deduzcan un comentario,",
        "start": 4157.58,
        "end": 4167.26
    },
    {
        "text": " me deduzcan un razonamiento, vamos, queremos caracterizar y calcular cuando existen los valores",
        "start": 4167.26,
        "end": 4179.0599999999995
    },
    {
        "text": " y vectores propios, pero fíjense lo siguiente, a ver me voy adelantando lo que viene, si algo es un",
        "start": 4179.0599999999995,
        "end": 4185.98
    },
    {
        "text": " vector propio, suponemos que yo quisiera saber bueno cómo calcular lambda y dado lambda valor",
        "start": 4185.98,
        "end": 4191.419999999999
    },
    {
        "text": " propio como calcular los ve, vayamos a problema de cómo calcular el lambda, yo sé que los",
        "start": 4191.419999999999,
        "end": 4195.86
    },
    {
        "text": " lambda, si algo es un vector propio, entonces estoy diciendo que hay elementos no triviales que",
        "start": 4195.86,
        "end": 4204.099999999999
    },
    {
        "text": " están acá, de efecto, yo sé que el cero siempre está, pero si lambda es valor propio, estoy diciendo que",
        "start": 4204.099999999999,
        "end": 4210.62
    },
    {
        "text": " además acá hay elementos no triviales, elementos distinto del cero, traducido acá estamos diciendo",
        "start": 4210.62,
        "end": 4218.62
    },
    {
        "text": " que esta transformación lineal, esta cosa acá tiene soluciones no triviales, entonces pensemos",
        "start": 4219.82,
        "end": 4227.7
    },
    {
        "text": " que yo estoy trabajando en la representación matricial, a dar una base y represento a ese vector,",
        "start": 4227.7,
        "end": 4234.94
    },
    {
        "text": " a ese operado que se llama una matriz y yo sé que esa matriz tiene soluciones no triviales,",
        "start": 4234.94,
        "end": 4242.86
    },
    {
        "text": " en el sentido de que cuando le aplico la multiplico por las coronas de un vector me da cero, pregunta",
        "start": 4242.86,
        "end": 4249.5
    },
    {
        "text": " ¿qué podemos decir esa matriz? de la matriz asociada de esta, es invertible, puede ser invertible,",
        "start": 4249.5,
        "end": 4257.46
    },
    {
        "text": " estamos diciendo que esto, la matriz conjunta, estamos diciendo que esta matriz acá la",
        "start": 4258.46,
        "end": 4267.22
    },
    {
        "text": " matriz asociada de la transformación lineal tiene soluciones no nulas del siguiente sistema,",
        "start": 4267.22,
        "end": 4273.02
    },
    {
        "text": " digamos pensemos que esto lo llevo a coordenadas, entonces esto no escribe, en esto lo vamos a ver",
        "start": 4273.02,
        "end": 4279.94
    },
    {
        "text": " la clase que viene, me estoy anticipando para ver si se rasora bien, si yo lo paso coordenadas,",
        "start": 4279.94,
        "end": 4284.02
    },
    {
        "text": " esto va a tener una matriz asociada, si una matriz asociada que le vamos a llamar a y si esto",
        "start": 4284.02,
        "end": 4289.9400000000005
    },
    {
        "text": " lo paso coordenadas eso será a por la multiplicación por las coordenadas, acá estoy poniendo a por las",
        "start": 4289.9400000000005,
        "end": 4295.9400000000005
    },
    {
        "text": " coordenadas, debe, en alguna base y eso tiene que ser igual a cero, o sea lo que yo estoy diciendo es",
        "start": 4295.9400000000005,
        "end": 4302.540000000001
    },
    {
        "text": " que si algo es un vector propio asociado la onda, existen soluciones no triviales de esto,",
        "start": 4302.540000000001,
        "end": 4308.700000000001
    },
    {
        "text": " existen soluciones no triviales en un sistema a por este balacero, la pregunta es esta matriz",
        "start": 4308.7,
        "end": 4313.94
    },
    {
        "text": " puede ser invertible, la matriz asociado esto en una base cualquiera, puede ser invertible o no,",
        "start": 4313.94,
        "end": 4322.179999999999
    },
    {
        "text": " no, porque si fuese invertible, abriu una única solución de este sistema que sería la nula",
        "start": 4322.179999999999,
        "end": 4331.5
    },
    {
        "text": " justamente, se entiende si esta fuese invertible la única solución, este sistema sería,",
        "start": 4331.5,
        "end": 4340.26
    },
    {
        "text": " no olvides, ¿cómo son los sistemas? Compatible determinado con la única solución la nula,",
        "start": 4340.26,
        "end": 4348.98
    },
    {
        "text": " porque la nula acá cumple que es solución, lo homogéneo, es un sistema homogéneo exactamente,",
        "start": 4348.98,
        "end": 4356.18
    },
    {
        "text": " entonces si esta fuese invertible, tenemos una única solución que sería la nula, pero acá estamos",
        "start": 4356.860000000001,
        "end": 4361.18
    },
    {
        "text": " diciendo que hay soluciones que no son la nula, por lo tanto no puede ser invertible, el",
        "start": 4361.18,
        "end": 4366.62
    },
    {
        "text": " sistema este es compatible determinado y es un sistema cuadrado, la condición de que algo sea",
        "start": 4366.62,
        "end": 4372.860000000001
    },
    {
        "text": " compatible en determinado, en un sistema cuadrado, es que justamente el determinante de esto sea",
        "start": 4372.860000000001,
        "end": 4379.14
    },
    {
        "text": " sea igual a cero, igual a cero para que la matriz no sea invertible, entonces lo que vamos a",
        "start": 4380.14,
        "end": 4387.3
    },
    {
        "text": " ver que la manera de calcular este landa, eso vamos a ver la clase que viene es ver las",
        "start": 4387.3,
        "end": 4392.740000000001
    },
    {
        "text": " matricias asociadas a esto y calcular el determinante de esa matriz menos landa por i igual a cero,",
        "start": 4392.740000000001,
        "end": 4398.740000000001
    },
    {
        "text": " eso es un nuevo problema, estamos, bueno nos vemos entonces el lunes, el martes",
        "start": 4398.74,
        "end": 4407.62
    }
]