[
    {
        "text": " Bueno, pasamos a organización de una empresa de IT y segmentación de empresa de IT.",
        "start": 0.0,
        "end": 7.0
    },
    {
        "text": " La parte de organización es bastante cortito y bueno, tiene algunas... algunas bromitas.",
        "start": 7.0,
        "end": 16.0
    },
    {
        "text": " Pero la idea acá es ver un poquito cómo suelen estar estructuradas, organizadas internamente las empresas de tecnología.",
        "start": 16.0,
        "end": 26.0
    },
    {
        "text": " Y en general, hay áreas y cuando hicimos áreas, no quiere decir tipo, bueno, en el piso arriba,",
        "start": 27.0,
        "end": 34.0
    },
    {
        "text": " está este marketing, en el siguiente piso comercial, no sea a veces son monstruos, luego y más que áreas son sombreros,",
        "start": 34.0,
        "end": 42.0
    },
    {
        "text": " que tienen las personas. Y una persona, típicamente, cuanto más chica la empresa, más sombreros, más roles, cuya una misma persona.",
        "start": 42.0,
        "end": 51.0
    },
    {
        "text": " Y cuanto más grande, más especialización hay en cada una de las áreas ahí sí.",
        "start": 52.0,
        "end": 58.0
    },
    {
        "text": " Pero en general, una empresa de tecnología tiene algunos, como quieran, sombreros y somos pocos o áreas, ya sí somos más,",
        "start": 58.0,
        "end": 67.0
    },
    {
        "text": " pero se divide en una parte de dirección, o sea que son en general los fundadores, los dueños, los accionistas, los inversionistas,",
        "start": 67.0,
        "end": 76.0
    },
    {
        "text": " los directivos más altos, o sea, lo que en general se preocupan por las estrategias, prosoctivo generales, por la consecución de sus objetivos, por las KPIs,",
        "start": 77.0,
        "end": 88.0
    },
    {
        "text": " los key performance indicators de la empresa, por los temas más grandes de la empresa, esa es la dirección,",
        "start": 88.0,
        "end": 95.0
    },
    {
        "text": " después de esta marketing, que lo hemos visto, después de la parte comercial, que incluye a preventa técnica,",
        "start": 95.0,
        "end": 102.0
    },
    {
        "text": " después de la parte de operaciones, que acá, probablemente es lo que más difiere si estamos dando una empresa de producto o una empresa de servicio,",
        "start": 102.0,
        "end": 109.0
    },
    {
        "text": " la serie de operaciones probablemente se sean las que más, las que más, de, diferenan entre sí, después Cuba,",
        "start": 109.0,
        "end": 117.0
    },
    {
        "text": " y acá obviamente Cuba podría estar adentro de operaciones o no, después la parte de administración y finanzas,",
        "start": 117.0,
        "end": 125.0
    },
    {
        "text": " todas las partes, bueno, un poco lo que vieron con Bruno, con Federico, la parte económico financiera y la parte de Bacophis en sí,",
        "start": 125.0,
        "end": 135.0
    },
    {
        "text": " y después la parte de Talento, bueno, o el nombre que tenemos, antes era recurso humanos y bueno, ahora ya dejamos de hacer recursos,",
        "start": 135.0,
        "end": 143.0
    },
    {
        "text": " por suerte, y somos todos talentos dentro de la organización o colaboradores, pero también, justamente estamos en una industria",
        "start": 143.0,
        "end": 152.0
    },
    {
        "text": " en donde, todo lo que hacemos lo hacemos con la cabeza y, y, y, y, y, y, en general, al,",
        "start": 152.0,
        "end": 167.0
    },
    {
        "text": " la, la, la, la, la, la producción de las cosas que haces en un contexto donde, en general, una falta de Talento,",
        "start": 167.0,
        "end": 176.0
    },
    {
        "text": " o sea, ser capaz de tener personas que, que salgan a recrutar nuevos talentos y, después, a mantener la cultura entre la empresa,",
        "start": 176.0,
        "end": 183.0
    },
    {
        "text": " que son típicamente como las, las dos grandes patas que tiene Talento, la recruiting y la cultura son súper importantes,",
        "start": 183.0,
        "end": 191.0
    },
    {
        "text": " no, súper importantes. Entonces, éramos como las siete, más o menos, este, roles que seguramente más salgandidos,",
        "start": 191.0,
        "end": 199.0
    },
    {
        "text": " y somos chiquitos, estamos arrancando, o más profesionales, y somos más grandes, pero, estos sombreros seguramente",
        "start": 199.0,
        "end": 212.0
    },
    {
        "text": " alguien los tenga, este, en, en una empresa de tecnología.",
        "start": 212.0,
        "end": 219.0
    },
    {
        "text": " Ahora, hay, y otros, y, y, obviamente, que esto se va complicizando un poco más, además sí, y, y, más o más sí,",
        "start": 219.0,
        "end": 233.0
    },
    {
        "text": " si, metiación, desarrollo, innovación, que es, entonces, en general, lo hagram visto como",
        "start": 233.0,
        "end": 238.8
    },
    {
        "text": " la abertoración y todo, la entesa de tecnología, y también, opicio de soporte o los, los, los, los, los, los, los, los, los, los,",
        "start": 238.8,
        "end": 247.8
    },
    {
        "text": " los salve la agreement que hacemos con, con los clientes, tipo, nivel 1, nivel 2, etcétera, si es que tiene sentido, por supuesto,",
        "start": 247.8,
        "end": 253.8
    },
    {
        "text": " eso por de interno, o sea, la, la, la, la persona que nos ayuda con, con, con la VPN, con la, con la, con la red, con, con Ejárua, nuestro, con eso, fue, etcétera,",
        "start": 253.8,
        "end": 265.8
    },
    {
        "text": " y bueno, y todavía siendo tal vez un poco más grande, manejo proveedores, compras, capacitación, variedad y consultoría, etcétera, y,",
        "start": 265.8,
        "end": 275.8
    },
    {
        "text": " y cada vez, obviamente, se puede complicando más. Esto, sí, terminaba acá, así bien, bien, puntual, no sé si ahí uno tiene",
        "start": 275.8,
        "end": 285.8
    },
    {
        "text": " una duda, comentario, está parte de, de, organización de empresas de, de, entre, entre y tipo manejo proveedores, tipo,",
        "start": 285.8,
        "end": 296.8
    },
    {
        "text": " así me va a lo, y no era antes, qué sería tipo, los sonido internet, las licencias,",
        "start": 296.8,
        "end": 304.8
    },
    {
        "text": " en, en un sentido medio, medio básico, sí, pero recordate que una empresa de tecnología, muchas veces,",
        "start": 305.8,
        "end": 314.8
    },
    {
        "text": " le compra a otras empresas de tecnología, no, no, no, ya sea para para complementar algo que, que ellos no hacen, o sea,",
        "start": 314.8,
        "end": 321.8
    },
    {
        "text": " no sé, posto una empresa de tecnología, imagínate que tenés un cliente, un, un, un, un, un, un, un key account, no, una cuenta clave, un cliente clave tuyo,",
        "start": 321.8,
        "end": 328.8
    },
    {
        "text": " y ese cliente te dice para Gonzalo, este mira en este proyecto, este, te lo quiero dar a ustedes, pero ando necesitando también que,",
        "start": 329.8,
        "end": 337.8
    },
    {
        "text": " hacer una integración con SAP, ¿no? Entonces pues, tal vez, uno no tiene nada que ver con SAP, pero no cree que, o sea, no cree decirle que,",
        "start": 337.8,
        "end": 345.8
    },
    {
        "text": " no hace clientes, primero, no cree que ese cliente empieza a buscar otro pedor de tecnología SAP, que, con así como le empieza a",
        "start": 345.8,
        "end": 352.8
    },
    {
        "text": " SAP, te le puede empezar a ofrecer lo que tu hubo le está sofreciendo hoy, ¿no? Entonces, empieza a poner el, el, el código en la cuarta o un bien, en la cuarta",
        "start": 352.8,
        "end": 360.8
    },
    {
        "text": " de cliente, entonces, muchas veces le dices, ya, como sabéis, nosotros no hacemos SAP, pero trabajamos con otro proveedor, tenemos un partner",
        "start": 360.8,
        "end": 369.8
    },
    {
        "text": " y un otro proveedor, si crees la próxima reunión, los sumo ellos y vemos cómo te podemos ayudar, etcétera, bueno, en ese caso,",
        "start": 369.8,
        "end": 377.8
    },
    {
        "text": " ese, esa otra empresa que que vos probablemente hace un partnership, también la historia como un proveedor tuyo y, y en ese caso, porque le estás diciendo que tenés",
        "start": 377.8,
        "end": 387.8
    },
    {
        "text": " una empresa, porque está, si no te viene de SAP, probablemente te conviene decirle que tenés otro proveedor que es a Spartan SAP, pero,",
        "start": 387.8,
        "end": 395.8
    },
    {
        "text": " tal vez si vos haces front-end backend con él y te piden cinco front-ends de un mesa de otro, vos probablemente hagas White Label, o sea, hagas lo mismo, pero sin decirle que está sumando a tres developers de otra empresa, ¿no? Y eso también es otro proveedor.",
        "start": 395.8,
        "end": 410.8
    },
    {
        "text": " ¿No? ¿No? ¿Alguna pregunta más?",
        "start": 410.8,
        "end": 415.8
    },
    {
        "text": " Bueno, sigamos entonces, la parte de segmentación del mercado de IT, o sea, ahora vamos a hablar, o sea, vamos como dentro del del mundo de IT, amená, nos enseguen",
        "start": 421.8,
        "end": 436.8
    },
    {
        "text": " y a ver cómo está, o por menos, una posible forma de ordenar o de segmentar todo el mercado de IT. Y la idea de segmentarlo según el tipo de actividad que las empresas de IT realizan, ¿no?",
        "start": 436.8,
        "end": 451.8
    },
    {
        "text": " Y bueno, porque no es lo mismo, de hecho, producto y servicios que son como hasta ahora las grandes categorías de empresas de TI que hemos visto, pero vamos a ver que hay algunas más,",
        "start": 451.8,
        "end": 463.8
    },
    {
        "text": " en general, tener este tipo de cajitas, ¿no? Nos permitas un análisis más tipo nivel país, más nivel industria, región, ¿no? PBI, aporte, trabajo, o sea, nos nos dejas hacer un análisis un poco más abstracto, este tener una categorización, ¿no?",
        "start": 463.8,
        "end": 481.8
    },
    {
        "text": " Y bueno, y esto que sigue es una clasificación internacional y que también en un UI aplica bastante bien y sobre el final de las PPTC, hay un link a un documento que estamos para esto.",
        "start": 482.8,
        "end": 495.8
    },
    {
        "text": " Y y aparecien esos 6 mercados, ¿no? El mercado de software y horizontal, software vertical, o sea, aplicaciones de software y son tal, aplicaciones de software vertical, aplicaciones de software para para consumer, ¿no?",
        "start": 496.8,
        "end": 510.8
    },
    {
        "text": " Y después de todo lo que es V2C, que pues interment como un mercado en sí, después servicio de IT que son las empresas de servicio, ya hemos visto, y empresas de infraestructura, de infra, bueno, probablemente ahí está metido también, ¿no?",
        "start": 510.8,
        "end": 527.8
    },
    {
        "text": " Entonces vamos a repasar un poquito cada una de esas 6, software y horizontal, son empresas copres en productos, servicios, horizontales, ¿no? O sea, como es decir, que te deja gestionar toda una o parte de una empresa pero de cualquier rura, ¿no?",
        "start": 527.8,
        "end": 542.8
    },
    {
        "text": " Sin estar este requingido a una vertical, a un industria, un domínio específico, ¿no? Y acá dentro de los ejemplos también está bueno, poner ejemplos, para dar más también poner, ¿qué es lo que crees? Y cada uno como para que les empiecen a sonar algunas siglas,",
        "start": 542.8,
        "end": 556.8
    },
    {
        "text": " que es lo que la duran probablemente ya algunas capas que les suenan, por ejemplo viaj, ¿no? ¿qué es business intelligence?",
        "start": 556.8,
        "end": 564.8
    },
    {
        "text": " CMS, que en cuanto de manos en systems, o sea, REM que se removita, ¿no? ¿castan los elementos humanos?",
        "start": 564.8,
        "end": 571.8
    },
    {
        "text": " Rp, o sea, gestión de la empresa en sí, Enterprise Resource Planning, recursos humanos, desarrollo plataformas, o sea, vertilo, genexus, etcétera, etcétera, etcétera, etcétera.",
        "start": 571.8,
        "end": 586.8
    },
    {
        "text": " O sea, que estamos en este nicho, bueno, este segmento, perdón, más que nicho en este segmento, porque podría ser enorme, ¿no?",
        "start": 586.8,
        "end": 595.8
    },
    {
        "text": " Estamos en este segmento, si nuestra empresa de tecnología hace productos servicios relacionados, muy relacionados a alguno de esos subsegmentos,",
        "start": 595.8,
        "end": 604.8
    },
    {
        "text": " que como es como el ser horizontal es transversal a las diferentes verticales especializaciones.",
        "start": 604.8,
        "end": 611.8
    },
    {
        "text": " Después, bueno, casi que el otro, ¿no? Arolinia, banca, ríter, salud, gobierno, automotriz, construcción, educación, energía, agrolegal, seguro, turismo, diseño, etcétera.",
        "start": 612.8,
        "end": 627.8
    },
    {
        "text": " Y pusimos varias de las que dos por tres se citan, como ejemplo, y acá, es porque tenemos una empresa de productos servicios en una industria específica, ¿no?",
        "start": 628.8,
        "end": 636.8
    },
    {
        "text": " O sea, acá se acuerdan que en general en lo vertical, si estás metido en una vertical, es porque tenés un conocimiento específico, un conocimiento de negocio, ¿no?",
        "start": 636.8,
        "end": 644.8
    },
    {
        "text": " De ese dominio, de esa industria, y de las prácticas que lleva adelante.",
        "start": 644.8,
        "end": 649.8
    },
    {
        "text": " Bueno, después consumer es como decir, bueno, el resto de productos servicios que acá en realidad, bueno, ahí hay un servicio, pero creo que los ejemplos más comunes son ser productos, que es, bueno, para todo el mundo bitu, sí,",
        "start": 650.8,
        "end": 666.8
    },
    {
        "text": " los videos juegos, ofimática, este antivirus, herramienta de productividad, utilitarios, etcétera.",
        "start": 667.8,
        "end": 674.8
    },
    {
        "text": " Si nuestra empresa realiza productos servicios relacionados a consumer en un contexto bitu, sí, se paran business to consumer.",
        "start": 674.8,
        "end": 682.8
    },
    {
        "text": " En ese caso, decimos que nuestra empresa cae dentro del segmento de consumer application software.",
        "start": 682.8,
        "end": 689.8
    },
    {
        "text": " Después internet market, acá es cuando internet es el negocio, o sea, seguramente en todos los casos, en todos estos seis, seis, siete, ese momento de mercado de IT, todos van a usar internet de una forma u otra, obviamente, ¿no?",
        "start": 690.8,
        "end": 707.8
    },
    {
        "text": " Es parte esencial, o sea, sin internet no tendría sentido, esa empresa ahí se veía internet market y por ejemplo, agencia de marketing online, portales, contenido digitales y commerce, o sea, todo lo que se base si o si o uno, o muy, muy fuertemente en la existencia misma internet, es porque caería dentro de lo que es internet market.",
        "start": 707.8,
        "end": 736.8
    },
    {
        "text": " Bueno, después IT services, que es empresa desarrollosa o fuera medida, básicamente, ¿no?",
        "start": 738.8,
        "end": 745.8
    },
    {
        "text": " Este diseño desarrolloso, software, testing, consultoria, proyectos arrastrados, tengo material, Spring based, todo lo que hemos visto.",
        "start": 745.8,
        "end": 755.8
    },
    {
        "text": " Acá un comentario importante que en realidad, probablemente no se les ocurrió, pero justamente para introducir el concepto de BPO, BPO es Business Processing, y es algo que no es estrictamente servicio de IT, por ejemplo, si yo tercerizo un call center o si tercerizo todo el vacófis de administrativo, o a otra empresa, no se imagínense que son ejemplos bastante reales, ¿no?",
        "start": 756.8,
        "end": 784.8
    },
    {
        "text": " Para ir su otra joscupas, ofrece y, bueno, IT, TCS, por ejemplo, Tata, empresa India, también ofrece, ofrece en equipos que le hacen para un empresa más grande, imagínense para Coca-Cola, para mastercard, etcétera, lo ofrecen el servicio de vacófis administrativo, lo ofrecen el servicio de call center.",
        "start": 785.8,
        "end": 810.8
    },
    {
        "text": " Entonces, capaz que le ofrecen, no sé, 20 personas con un GED, y todo eso metido dentro de TCS, por ejemplo, o a dentro de Price o algunas cosas grandes, y eso no es TIP, TPC, no, o sea, no le están dando desarrolladores, que podría ser, la podrían darle además de darle el call center y a más darle vacófis administrativo, podrían darle un equipo de desarrollo.",
        "start": 810.8,
        "end": 837.8
    },
    {
        "text": " Ahora, en ese caso, el equipo de desarrollo sería IT services, ahora lo de call center y lo de vacófis administrativo, se les llama PPO, son proceso de negocio que se tercerizan a otro lado, y, bueno, y en general, se imaginarán que las empresas que tercerizan ese tipo de, qué hacen ese tipo de PPO, porque son empresas en general bastante grandes, que eso que están tercerizando ese proceso de negocio, que están tercerizando, no leces cor, ¿no?",
        "start": 837.8,
        "end": 866.8
    },
    {
        "text": " Si yo soy una empresa que me dedico al call center, difícilmente, difícilmente tercerice el servicio en mi laburo, Corde, Cuelte call center a otro call center, ¿no? Porque no le da ahí lo que estaría haciendo yo, pasa hacer un pasamano, ¿no? Y el valor de negocio que aporto es casi nulo, ¿no?",
        "start": 867.8,
        "end": 884.8
    },
    {
        "text": " Entonces, de vuelta, ahí el comentario era más para introducir lo que es BPO y diferenciarlo de lo que el servicio dice.",
        "start": 886.8,
        "end": 893.8
    },
    {
        "text": " Y de hecho, TCSE hace, según te he contadido, mucho más BPO en el UI que desarrollo en sí que tecnología.",
        "start": 898.8,
        "end": 906.8
    },
    {
        "text": " Y después está infraestructura y té, o sea, empieza a que ofrecen ese producto de servicios de tipo, como dice Planming, ¿no? O sea, de más de bajo nivel de infra, o sea, en general, es necesario para operar, controlar, gestionar, asegurar, dar support, aplicaciones existentes, ¿no?",
        "start": 908.8,
        "end": 922.8
    },
    {
        "text": " Y de acá se sacan lo que son las telco y la estructura de hardware puro. Y en general también estas exclusiones es porque esto se informe suelen tener, por ejemplo, bueno,",
        "start": 923.8,
        "end": 934.8
    },
    {
        "text": " este es el segmento de IT infrastructure sacando a las telco, la verdad, en este país X maneja dos billones dólares, la telco, tres billones dólares, entonces, al ir los segmentando y dejando afuera parte específica, se pueden caracterizar mejor y describir mejor cada una de los segmentos.",
        "start": 935.8,
        "end": 958.8
    },
    {
        "text": " Algunos sus segmentos, virtualización, sistema de esmesó, formáturo, formáturo, formáturo, vos sobre IP, vacápreco, verijot, etcétera, etcétera.",
        "start": 959.8,
        "end": 968.8
    },
    {
        "text": " Bueno, ahí está el informe que le comentaba.",
        "start": 972.8,
        "end": 975.8
    }
]