[
    {
        "text": " El último que vimos la clase pasada, y enteníamos un espacio vectorial sobreca.",
        "start": 0.0,
        "end": 29.8
    },
    {
        "text": " Un cuerpo K y sobre ese espacio vectorial definíamos una estructura geométrica via un producto",
        "start": 29.8,
        "end": 37.160000000000004
    },
    {
        "text": " escalar, que es un producto escalar aquí es una función, producto interno, perdón. Un",
        "start": 37.160000000000004,
        "end": 48.16
    },
    {
        "text": " producto interno en vez es una función que me agarran dos vectores, un par ordenado de",
        "start": 48.16,
        "end": 56.64
    },
    {
        "text": " vectores y me da un escalar y esa función cumple ciertas propiedades. Sí, recuerden",
        "start": 56.64,
        "end": 66.44
    },
    {
        "text": " ustedes las propiedades son que se aditiva con respecto a la primera componente, que",
        "start": 66.44,
        "end": 71.84
    },
    {
        "text": " sea homogénea respecto a la primera componente, así que las contantes acasalen para",
        "start": 71.84,
        "end": 76.52
    },
    {
        "text": " afuera el producto interno. Si yo cambio el orden de los vectores, entonces tengo que tomar",
        "start": 76.52,
        "end": 81.67999999999999
    },
    {
        "text": " el complejo conjugado y finalmente la última condición por definir un producto interno es que si",
        "start": 81.67999999999999,
        "end": 87.56
    },
    {
        "text": " yo tomo el producto interno de un vector consigo mismo, eso siempre es mayor igual que cero y",
        "start": 87.56,
        "end": 92.47999999999999
    },
    {
        "text": " igual a cero sí solo sí el vector en cuestión es el vector número. Entonces, toda función de",
        "start": 92.47999999999999,
        "end": 99.47999999999999
    },
    {
        "text": " este tipo que cumple esas cuatro propiedades es un producto interno en vez y finalmente",
        "start": 99.47999999999999,
        "end": 104.19999999999999
    },
    {
        "text": " hemos definido lo que es una norma en vez es una función que la denotamos así, que",
        "start": 104.2,
        "end": 118.42
    },
    {
        "text": " la raun vectora aquí, un elemento del espacio vectora, el vectorial y me da un real. Sí, y esa",
        "start": 118.42,
        "end": 125.16
    },
    {
        "text": " función cumple las siguientes condiciones. En primer lugar es mayor igual que cero, así para",
        "start": 125.16,
        "end": 131.84
    },
    {
        "text": " cualquier vector que yo pongo acá, la norma es mayor igual que cero, si igual a cero sí solo sí",
        "start": 131.84,
        "end": 137.64000000000001
    },
    {
        "text": " el vector en cuestión es el vector número, sí y si yo le pongo aquí una constante alpha por un",
        "start": 137.64000000000001,
        "end": 144.08
    },
    {
        "text": " vector la constante es la fuera en módulo y finalmente la desigualdad triangular. Sí y la última",
        "start": 144.08,
        "end": 149.72
    },
    {
        "text": " cosa que habíamos visto era como a través de un producto interno se puede fin naturalmente una",
        "start": 149.72,
        "end": 155.08
    },
    {
        "text": " norma que lo pisaba la norma inducida por el producto interno, ¿qué es la siguiente?",
        "start": 155.08,
        "end": 161.52
    },
    {
        "text": " Por un producto interno,",
        "start": 171.24,
        "end": 172.72000000000003
    },
    {
        "text": " quiero decir si yo tengo un producto interno puedo agarrar un vector y tomar el producto interno",
        "start": 172.72,
        "end": 186.12
    },
    {
        "text": " ese vector consigo mismo, eso sabemos que es un número mayor igual que cero, tomar la raíz",
        "start": 186.12,
        "end": 190.84
    },
    {
        "text": " cuadrada de esto y definir eso como la norma de un vector de esto, la norma inducida por un",
        "start": 190.84,
        "end": 198.32
    },
    {
        "text": " producto interno, ¿sí? Para ver que esto efectivamente es una norma hay que verificar y",
        "start": 198.32,
        "end": 202.84
    },
    {
        "text": " cumplir las tres condiciones para que se una norma, que ya habíamos visto que esto es mayor",
        "start": 202.84,
        "end": 207.44
    },
    {
        "text": " igual que cero y vale cero si solo sí es el vector número, habíamos visto que las costantes",
        "start": 207.44,
        "end": 211.68
    },
    {
        "text": " salen por la fuera en módulo y no faltaba ver la desigualdad triangular, clavamos a probar",
        "start": 211.68,
        "end": 216.28
    },
    {
        "text": " en un ratito, ¿sí? Y bueno habíamos visto les había comentado yo que no toda norma",
        "start": 216.28,
        "end": 224.28
    },
    {
        "text": " es la norma inducida de un producto interno, es decir existe normas para los cuales no pueden",
        "start": 224.8,
        "end": 229.76
    },
    {
        "text": " encontrar un producto interno, tal que esta sea la norma inducida por ese producto interno.",
        "start": 229.76,
        "end": 233.24
    },
    {
        "text": " Y finalmente lo que hemos visto en la clase final era la parte final de la clase era una",
        "start": 235.72,
        "end": 240.24
    },
    {
        "text": " desigualdad muy útil que nos llamamos la desigualdad de cosijuars,",
        "start": 240.24,
        "end": 244.28
    },
    {
        "text": " bien que esto es, yo tengo un producto interno y trabajo con la norma inducida por el",
        "start": 254.28,
        "end": 262.92
    },
    {
        "text": " producto interno, entonces la desigualdad de cosijuars me dice que se cumple que si yo",
        "start": 262.92,
        "end": 267.16
    },
    {
        "text": " tengo el producto interno de un V con un W, V, V, W cualquiera esto que es un escalar si",
        "start": 267.16,
        "end": 274.84
    },
    {
        "text": " considero el módulo de esto, eso es menor igual que la norma de V por la norma de W, bien y",
        "start": 274.84,
        "end": 284.56
    },
    {
        "text": " esto vale para todo V y W, V, V, ¿sí? Y hay igualdad sí solo sí, V y W fueron",
        "start": 284.56,
        "end": 296.91999999999996
    },
    {
        "text": " conjuntos lignamente dependientes, así solo sí, uno de ellos es un módulo de otro.",
        "start": 296.92,
        "end": 300.72
    },
    {
        "text": " Con igualdad sí solo sí,",
        "start": 306.6,
        "end": 308.44
    },
    {
        "text": " esto es un conjunto de D, yo en la clase pasada había probado en realidad que esto el cuadrado era",
        "start": 314.76,
        "end": 322.24
    },
    {
        "text": " menor igual que esto el cuadrado por esto el cuadrado, pero como son todos números positivos,",
        "start": 322.24,
        "end": 325.84000000000003
    },
    {
        "text": " los cuadrados los puedo cancelar y me queda que esto es menor igual que el producto de esto por",
        "start": 325.84000000000003,
        "end": 330.64
    },
    {
        "text": " esto, ¿sí? Y ahí habíamos terminado la clase pasada. Bueno, ¿cuándo hay preguntas",
        "start": 330.64,
        "end": 338.72
    },
    {
        "text": " hasta aquí? Sí, bueno, entonces vamos a seguir hoy con estas cuestiones, vamos a probar",
        "start": 338.72,
        "end": 351.84000000000003
    },
    {
        "text": " la desigualdad triangular para dar una industria por un producto interno que eso sale de la desigualdad",
        "start": 351.84,
        "end": 357.52
    },
    {
        "text": " de Cosius Wars y vamos a ver otras cuestiones geométricas. La primera observación tiene que ver",
        "start": 357.52,
        "end": 363.15999999999997
    },
    {
        "text": " con lo siguiente.",
        "start": 363.15999999999997,
        "end": 363.91999999999996
    },
    {
        "text": " Considemos un espacio vectorial real con producto interno.",
        "start": 363.92,
        "end": 375.84000000000003
    },
    {
        "text": " Se van a ver por qué necesito que sea un espacio vectorial para que sea real y consiguemos",
        "start": 375.84,
        "end": 398.76
    },
    {
        "text": " dos factores en ese espacio vectorial que sean distintos del vector nulo, o sea un V,",
        "start": 398.76,
        "end": 403.84
    },
    {
        "text": " un distinto vector nulo y un V, distinto vector nulo. Entonces, yo ahora tomo el producto",
        "start": 403.84,
        "end": 416.91999999999996
    },
    {
        "text": " interno de V con 2V. El producto interno de V con 2V será un número real porque estamos",
        "start": 416.91999999999996,
        "end": 429.84
    },
    {
        "text": " trabajando en el cuerpo de los reales, tal que su módulo es menor igual que el producto",
        "start": 429.84,
        "end": 438.08
    },
    {
        "text": " de la norma de V por la norma de V. Es decir que si yo divido ese numerito por la norma de V",
        "start": 438.08,
        "end": 445.15999999999997
    },
    {
        "text": " y por la norma de V que lo puedo hacer porque V y doble V son distintos del vector nulo,",
        "start": 446.52,
        "end": 450.96
    },
    {
        "text": " ese numerito entre qué número, entre qué número está, de la desigualdad de Cosius Wars.",
        "start": 450.96,
        "end": 459.2
    },
    {
        "text": " Es decir que si paso esto dividiendo me dice que el valor absoluto lo que tengo acá es menor",
        "start": 459.76,
        "end": 464.76
    },
    {
        "text": " igual que 1 o sea que el argumento está entre menos 1 y 1, lo que está dentro del valor absoluto o",
        "start": 464.76,
        "end": 470.12
    },
    {
        "text": " sea que se cumple siempre que el producto interno de V con 2V divide el producto de las normas",
        "start": 470.12,
        "end": 475.32
    },
    {
        "text": " es más y igual que menos 1 y menor igual que 1. Claro, siempre que estamos trabajando en",
        "start": 475.32,
        "end": 482.68
    },
    {
        "text": " el espacio vectorial real, que esto acasi es un número real. Por otra parte,",
        "start": 482.68,
        "end": 490.1
    },
    {
        "text": " lo sé lo siguiente.",
        "start": 492.6,
        "end": 493.84000000000003
    },
    {
        "text": " Si nos vamos a R3 o R n en general el espacio de la espacio común y común entre el espacio",
        "start": 502.6,
        "end": 510.68
    },
    {
        "text": " clídeo común y corriente o el espacio de la gn1 plus, si ustedes recuerdan esto lo vieron en",
        "start": 510.68,
        "end": 518.24
    },
    {
        "text": " gano 1, N R3 con el producto interno usual, el producto interno usual en R3,",
        "start": 518.24,
        "end": 529.5600000000001
    },
    {
        "text": " se acuerdan que si yo tengo por aquí un vector V en R3 y por aquí un vector V y el ángulo",
        "start": 529.56,
        "end": 543.5999999999999
    },
    {
        "text": " en 3 se estita, entonces el producto interno de V con 2V lo podemos escribir como el módulo",
        "start": 543.5999999999999,
        "end": 555.8
    },
    {
        "text": " del vector V por el módulo del vector V por el coseno de lago entre ellos. Acuerdan eso,",
        "start": 555.8,
        "end": 560.9599999999999
    },
    {
        "text": " eso lo tiene que ver en física o en gano 1, el producto interno de un vector con otro,",
        "start": 560.9599999999999,
        "end": 566.24
    },
    {
        "text": " el R3, bueno R n en general con el producto interno usual es el módulo de uno de los",
        "start": 566.24,
        "end": 571.28
    },
    {
        "text": " vectores por el módulo del otro por el coseno del ángulo que hay entre ellos.",
        "start": 571.28,
        "end": 576.68
    },
    {
        "text": " Y esto nos permite si uno pone estas dos cosas juntas fíjense la de igual de cosiçoars,",
        "start": 585.4399999999999,
        "end": 591.04
    },
    {
        "text": " nos garantiza que en cualquier espacio de vectorial real con producto interno y con la",
        "start": 591.04,
        "end": 594.52
    },
    {
        "text": " módulo de módulo, el producto interno de V con 2V debido al producto de las dos armas está entre 1 y",
        "start": 594.52,
        "end": 600.1999999999999
    },
    {
        "text": " menos 1 y en el producto interno usual, el R3 con el producto interno usual, esto y video esto,",
        "start": 600.1999999999999,
        "end": 607.64
    },
    {
        "text": " por esto es el coseno de un ángulo, o sea que podemos definir efectivamente como el coseno",
        "start": 607.64,
        "end": 612.16
    },
    {
        "text": " de un ángulo está entre menos 1 y 1 en un contexto general, en un espacio de vectorial real,",
        "start": 612.16,
        "end": 618.04
    },
    {
        "text": " el ángulo entre dos vectores como aquel tita hasta el coseno de tita es esto,",
        "start": 618.04,
        "end": 626.8
    },
    {
        "text": " se entiende lo que estoy diciendo, repito, si estamos en un espacio de vectorial real esto",
        "start": 626.8,
        "end": 633.16
    },
    {
        "text": " dividir el producto de las normas está entre menos 1 y 1 por la de igual de cosiçoars,",
        "start": 633.16,
        "end": 637.5999999999999
    },
    {
        "text": " lo que escribimos acá, por otra parte lo que uno sabe en R3 no que han visto en galuno,",
        "start": 637.5999999999999,
        "end": 644.5999999999999
    },
    {
        "text": " con el producto interno usual, bueno en R3 en general, el producto interno de 2V es la norma de 1",
        "start": 644.6,
        "end": 651.6800000000001
    },
    {
        "text": " por la norma del otro, el módulo de 1 por el módulo del otro, por el coseno de 1 entre ellos,",
        "start": 651.6800000000001,
        "end": 656.36
    },
    {
        "text": " entonces si yo divido esto por este producto aquí me queda coseno de tita y la de igual de cosi",
        "start": 656.36,
        "end": 665.48
    },
    {
        "text": " suarse en un contexto general me garantiza con espacio de vectorial real que esto y video esto",
        "start": 665.48,
        "end": 670.0400000000001
    },
    {
        "text": " por esto está entre menos 1 y 1, o sea que yo en un contexto general lo puedo pensar a esto como el coseno de",
        "start": 670.04,
        "end": 675.56
    },
    {
        "text": " 1 ángulo tita y ese tita pensarlo como el ángulo entre a V y 2V, en un contexto bien genérico,",
        "start": 675.56,
        "end": 682.28
    },
    {
        "text": " esto ve podría ser funciones, esto puede ser un producto interno en el espacio de funciones,",
        "start": 682.28,
        "end": 689.3199999999999
    },
    {
        "text": " puede hablar de ángulo si ese contexto bien general se tenido entonces siempre que estamos trabajando",
        "start": 689.3199999999999,
        "end": 696.12
    },
    {
        "text": " con espacio de vectorial real, entonces con esto podemos definir el ángulo entre V y 2V,",
        "start": 696.12,
        "end": 702.52
    },
    {
        "text": " definimos el ángulo entre un vector V y otro vector 2V de la siguiente manera, esa que el tita",
        "start": 707.72,
        "end": 721.6800000000001
    },
    {
        "text": " tal que coseno de tita es el producto interno de V con W dividido el producto sus normas donde acaso las",
        "start": 721.68,
        "end": 730.52
    },
    {
        "text": " normas inducidas, o lo que lo mismo tita es el arco coseno de este número que tengo puesto",
        "start": 730.52,
        "end": 739.4399999999999
    },
    {
        "text": " entonces la idea de la simulada de cosi suarse con esto acá con esta idea que uno tiene de R3,",
        "start": 741.12,
        "end": 748.3199999999999
    },
    {
        "text": " un R3 en general, nos permite definir una idea de ángulo entre V, en un espacio vectorial real",
        "start": 748.32,
        "end": 756.88
    },
    {
        "text": " y en particular eso va a ser lo que vamos a ver en la segunda parte de la clase, fíjense que",
        "start": 762.88,
        "end": 768.8000000000001
    },
    {
        "text": " me permite hablar de el concepto de ortobanalidad, qué significa ortobanalidad, qué significa que",
        "start": 768.8000000000001,
        "end": 775.48
    },
    {
        "text": " dos ventores formen un ángulo recto, significa que el tita es pisor E2 o es el coseno de tita 0,",
        "start": 775.48,
        "end": 783.8000000000001
    },
    {
        "text": " entonces ortobanalidad significa que este producto interno de V con W es 0 y esa definición la",
        "start": 783.8000000000001,
        "end": 792.4
    },
    {
        "text": " puede extender a un espacio vectorial genérico, ya hay mi olvido si es real o complejo, tan",
        "start": 792.4,
        "end": 797.08
    },
    {
        "text": " toda, yo digo que ve todo dos ventores son ortobanales, si el producto interno de uno con otro es 0,",
        "start": 797.08,
        "end": 803.16
    },
    {
        "text": " también, entonces esas ideas geometricas que uno tiene de R3, las puede llevar a un concepto",
        "start": 803.88,
        "end": 811.16
    },
    {
        "text": " bien general, bien eso lo vamos a trabajar en un ratito, lo vamos a meter con conjunto",
        "start": 812.16,
        "end": 817.16
    },
    {
        "text": " ortobanales, base ortobanales etcétera, hay resultados muy útiles que salen trabajando en ese",
        "start": 817.16,
        "end": 826.76
    },
    {
        "text": " contexto, pero antes nos quedan puntos pendientes y uno de ellos era probar que con esta norma se",
        "start": 826.76,
        "end": 836.04
    },
    {
        "text": " cumple la desigualdad triangular, que esto a alguien lo vamos a ver en dos minutos, fíjense además que",
        "start": 836.04,
        "end": 846.6
    },
    {
        "text": " de la desigualdad de cosi suar salen, salen resultados importantes porque uno puede agarrar ahora,",
        "start": 846.6,
        "end": 854.6
    },
    {
        "text": " miren, puedo pensar como primer colorario de la desigualdad de cosi suar,",
        "start": 854.6,
        "end": 859.0
    },
    {
        "text": " si yo trabajo en el espacio vectorial RN, es el espacio de la genéupla, con el producto",
        "start": 865.72,
        "end": 871.76
    },
    {
        "text": " interno usual, o sea, con el producto interno entre dos ventores, hago el producto de las",
        "start": 871.76,
        "end": 881.5600000000001
    },
    {
        "text": " coordenadas de uno por el otro y sumo desde uno hasta N, acá obviamente",
        "start": 881.56,
        "end": 887.9599999999999
    },
    {
        "text": " es decir, este el producto interno usual en RR es agarrar 12NU plas,",
        "start": 899.7199999999999,
        "end": 904.76
    },
    {
        "text": " le llamamos XEY, con coordenadas de XN y YN y el producto interno de X con Y es X1 por Y1,",
        "start": 905.72,
        "end": 914.36
    },
    {
        "text": " más aquí 2 por Y2, etcétera hasta aquí N por Y, es que lo que tengo en frito acá,",
        "start": 914.36,
        "end": 917.8
    },
    {
        "text": " este el producto interno usual, fíjense que si yo uso, me voy al caso de RN con ese producto",
        "start": 917.8,
        "end": 924.6
    },
    {
        "text": " interno, y uso ahí la desigualdad de cosi suar, que me queda, la vamos a usar el cuadrado para que",
        "start": 924.6,
        "end": 929.96
    },
    {
        "text": " nos quede más fácil de escribir, nos queda, esto en cuadrado, lo que está en el izquierdo",
        "start": 929.96,
        "end": 940.24
    },
    {
        "text": " en cuadrado el producto interno de dos ventores, o sea, suma de XE por Y1 hasta N elevado al cuadrado,",
        "start": 940.24,
        "end": 949.96
    },
    {
        "text": " sí, esto que tengo puesto ahí, una otra cosa que la norma de X con Y al cuadrado,",
        "start": 950.52,
        "end": 958.96
    },
    {
        "text": " el parón, el módulo de X con Y al cuadrado, que como el cuadrado ahí como usted",
        "start": 961.4000000000001,
        "end": 970.64
    },
    {
        "text": " tengo el cuadrado directamente no pongo el módulo, y de este lado que tendría la norma de X por",
        "start": 970.64,
        "end": 979.1999999999999
    },
    {
        "text": " la norma de Y, las estoy elevando en cuadrado, la norma de X al cuadrado, que es suma de XE",
        "start": 979.1999999999999,
        "end": 988.4
    },
    {
        "text": " al cuadrado, las sumas componentes al cuadrado, esto es cuadrado, esto es cuadrado, etcétera,",
        "start": 988.4,
        "end": 992.36
    },
    {
        "text": " con Y desde 1 está en N, esta es la norma de X al cuadrado y la norma de X al cuadrado,",
        "start": 992.36,
        "end": 999.2
    },
    {
        "text": " esto mismo, pero con las coordenadas así, perdón, que estoy poniendo, este cuadrado no va,",
        "start": 999.2,
        "end": 1008.96
    },
    {
        "text": " o sea, la norma sería, la suma de las coordenadas al cuadrado, raíz cuadrada de eso, o sea que la",
        "start": 1008.96,
        "end": 1014.72
    },
    {
        "text": " norma del cuadrado, la raíz cuadrada se me va, esto que tengo puesto acá, nos otra cosa que",
        "start": 1014.72,
        "end": 1018.8000000000001
    },
    {
        "text": " la norma de X al cuadrado y esto que tengo puesto acá es la norma de Y al cuadrado, o sea,",
        "start": 1018.8000000000001,
        "end": 1025.6000000000001
    },
    {
        "text": " es que esta es igualdad que tengo escrita ahí, es la de es igualdad de cosisuals, escrita",
        "start": 1025.6,
        "end": 1030.4399999999998
    },
    {
        "text": " en el caso particular en el que me esté trabajando en el ren, con la pregunta",
        "start": 1030.4399999999998,
        "end": 1035.52
    },
    {
        "text": " intranusual y estas sean las componentes de dos vectores, sí, y hay igualdad si solo",
        "start": 1035.52,
        "end": 1045.28
    },
    {
        "text": " si, bueno, con igualdad si solo si, uno de estos es un múltiplo de otro, lo que ustedes",
        "start": 1045.28,
        "end": 1052.6399999999999
    },
    {
        "text": " ya saben, pero ahora fíjense que esta condición acá es una de si igualdad entre números reales,",
        "start": 1052.64,
        "end": 1057.68
    },
    {
        "text": " esta de si igualdad yo la tengo en un contexto ajeno los espacios vectoria, si a las normas,",
        "start": 1057.68,
        "end": 1063.8000000000002
    },
    {
        "text": " si a los productores, ahora baja tierra, la de es igualdad de cosisual, en este contexto y",
        "start": 1063.8000000000002,
        "end": 1068.88
    },
    {
        "text": " obtengo una de si igualdad que vale entre números reales, o sea que es una de si igualdad",
        "start": 1068.88,
        "end": 1073.92
    },
    {
        "text": " útil y además se usa muchísimo de si igualdad en un montón de contexto, que sale simplemente",
        "start": 1073.92,
        "end": 1080.2
    },
    {
        "text": " bajar a tierra, esta es igualdad generica para un caso particular, bien, o sea una de si igualdad",
        "start": 1080.2,
        "end": 1091.56
    },
    {
        "text": " con números reales, pues tiran acá en en números reales, en en números reales hago esto,",
        "start": 1091.56,
        "end": 1096.96
    },
    {
        "text": " hago esto y tengo que hacer de si igualdad. Y de las mismas maneras se obtiene",
        "start": 1096.96,
        "end": 1109.2
    },
    {
        "text": " una de si igualdad equivalente a esta, trabajamos en espacios de funciones con el Producto",
        "start": 1109.2,
        "end": 1115.56
    },
    {
        "text": " Interno Funcional, en espacios de funciones, funciones continuos y bajando a tierra la de",
        "start": 1115.56,
        "end": 1122.04
    },
    {
        "text": " si igualdad de cosisual. Corbolario 2, otro resultado que se desprende la de si igualdad de cosisuals,",
        "start": 1122.04,
        "end": 1131.4
    },
    {
        "text": " yo agarro como espacio vectorial, el espacio de funciones continuos en un intervalo a",
        "start": 1131.4,
        "end": 1144.2800000000002
    },
    {
        "text": " b, que lo denotamos así, esas son las funciones continuos en un intervalo a b y de fíjil",
        "start": 1144.2800000000002,
        "end": 1151.5600000000002
    },
    {
        "text": " considero el siguiente Producto Interno, que es el Producto Interno usual en este tipo de",
        "start": 1151.5600000000002,
        "end": 1155.64
    },
    {
        "text": " funciones, es el tipo de espacios, que es nada de funciones el Producto Interno de f con g,",
        "start": 1155.64,
        "end": 1163.8000000000002
    },
    {
        "text": " es la integral entre a y b del Producto Ft por gd t, integrado por g, este es el Producto",
        "start": 1163.8000000000002,
        "end": 1173.16
    },
    {
        "text": " Interno usual en espacio de funciones que es el equivalente a este, a multiplicar coordenada",
        "start": 1173.16,
        "end": 1180.0800000000002
    },
    {
        "text": " con nada de sumado. Entonces eso es un Producto Interno, consino la norma inducida por ese",
        "start": 1180.08,
        "end": 1189.04
    },
    {
        "text": " Producto Interno y escribo la desigualdad de cosisuals en ese caso particular, ¿qué me queda",
        "start": 1189.04,
        "end": 1195.0
    },
    {
        "text": " ahí escribiendo esto al cuadrado? Bueno igual que esto al cuadrado por este cuadrado, me queda,",
        "start": 1195.0,
        "end": 1198.56
    },
    {
        "text": " el Producto Interno de f con g al cuadrado, se cumple que el Producto Interno de f con g al cuadrado,",
        "start": 1199.36,
        "end": 1211.1599999999999
    },
    {
        "text": " es decir, Ft por gd t, de t al cuadrado, es menor igual que la norma de f con este Producto,",
        "start": 1211.1599999999999,
        "end": 1226.36
    },
    {
        "text": " con la norma inducida, o sea la norma inducida, esto merece consigo mismo que es Ft",
        "start": 1226.36,
        "end": 1231.1599999999999
    },
    {
        "text": " cuadrado y la raiz cuadrada, la norma tengo que le va a cuadrado porque tengo todo lado izquierdo",
        "start": 1231.1599999999999,
        "end": 1236.6
    },
    {
        "text": " y lado derecho que le va a cuadrado, la norma de ft cuadrado sería la integral entre a y b,",
        "start": 1236.6,
        "end": 1241.52
    },
    {
        "text": " de ft cuadrado de t, de t y la norma de ft cuadrado sería la integral entre a y b,",
        "start": 1241.52,
        "end": 1251.04
    },
    {
        "text": " esa es la desigualdad de cosisuals bajada a tierra en ese contexto, hay igualdad si solo si",
        "start": 1257.08,
        "end": 1262.1999999999998
    },
    {
        "text": " una función es un múltiplo de la otra y de nuevo esto es una desigualdad entre funciones,",
        "start": 1262.1999999999998,
        "end": 1267.6399999999999
    },
    {
        "text": " es una desigualdad de integrales de funciones, ahí me puedo olvidar que estoy trabajando con normas,",
        "start": 1267.6399999999999,
        "end": 1273.4799999999998
    },
    {
        "text": " con espacios, Victoria, les computo el Interno, siempre me meten empezar esto como una desigualdad",
        "start": 1273.4799999999998,
        "end": 1279.1599999999999
    },
    {
        "text": " entre a y integral de productos de funciones que vale una desigualdad muy útil de quimonucra",
        "start": 1279.72,
        "end": 1288.4
    },
    {
        "text": " productos de funciones, está bien? O sea que hay muchas desigualdad de futiles de las",
        "start": 1288.4,
        "end": 1299.0400000000002
    },
    {
        "text": " matemáticas que se deducen simplemente como coro alario de desigualdad que vemos en este",
        "start": 1299.0400000000002,
        "end": 1304.24
    },
    {
        "text": " contexto, cómo está que quedamos aquí?",
        "start": 1304.24,
        "end": 1306.24
    },
    {
        "text": " Hay otras hay muchas otras desigualdades que salen que son útiles y que salen de coronario de",
        "start": 1315.24,
        "end": 1323.76
    },
    {
        "text": " eso y como coronario 3 veamos finalmente que usando esta desigualdad sale que la norma",
        "start": 1323.76,
        "end": 1331.72
    },
    {
        "text": " es inducida y cumple la desigualdad triangular, que es hora lo que nos queda a probar para",
        "start": 1331.72,
        "end": 1335.72
    },
    {
        "text": " ver que efectivamente la función definida así es una norma. Estamos y eso lo probamos ahora",
        "start": 1335.72,
        "end": 1347.72
    },
    {
        "text": " en dos minutos. Está claro eso, que lo que estoy poniendo acá",
        "start": 1349.72,
        "end": 1360.92
    },
    {
        "text": " es la norma de funciones F² que por definición de una norma inducida es agarrar F consigo misma",
        "start": 1360.92,
        "end": 1369.24
    },
    {
        "text": " o sea poner F por F integral de T o sea F² y lo mismo acá y pudiendo G y G.",
        "start": 1369.24,
        "end": 1377.8000000000002
    },
    {
        "text": " Eso sería entonces producinta 9F con G², esto sería la norma de F² y esto sería la norma de G².",
        "start": 1377.8,
        "end": 1397.8
    },
    {
        "text": " ¿A este? ¿A este? ¿A punto interno? No, sí, pero como es el módulo y lo estoy elevando",
        "start": 1397.8,
        "end": 1410.8
    },
    {
        "text": " el cuadrado, tanto de ases negativo, no hay ningún problema. Si saco el cuadrado y si te",
        "start": 1410.8,
        "end": 1419.28
    },
    {
        "text": " pueden darle la barritada. Entonces veamos como corolario 3 de la desigualdad de",
        "start": 1419.28,
        "end": 1427.36
    },
    {
        "text": " cosisuals, estas son desigualdad de lindas para tomar en un exámense, hay parte de desarrollo,",
        "start": 1427.36,
        "end": 1437.04
    },
    {
        "text": " o en un parcial, pues son salen fáciles, desigualdad triangular.",
        "start": 1437.04,
        "end": 1441.04
    },
    {
        "text": " Si le desigualdad triangular, el enorme inducida por un producto interno, la desigualdad triangular",
        "start": 1467.04,
        "end": 1481.2
    },
    {
        "text": " justamente es que la norma de una suma es menor igual que la suma de las normas, para",
        "start": 1481.2,
        "end": 1495.56
    },
    {
        "text": " todo par de vectores que yo considero. Eso nos queremos probar donde la norma es la norma",
        "start": 1495.56,
        "end": 1503.12
    },
    {
        "text": " inducida por un producto interno. Bueno, vamos, la demostración es bien sencilla, en lugar",
        "start": 1503.12,
        "end": 1526.36
    },
    {
        "text": " de considerar una norma, la norma esto, voy a considerar la norma del cuadrado, porque",
        "start": 1526.36,
        "end": 1539.6399999999999
    },
    {
        "text": " la norma de un vector al cuadrado, como estoy trabajando con la norma inducida, es el",
        "start": 1539.6399999999999,
        "end": 1543.9199999999998
    },
    {
        "text": " producto interno de un vector con sigo mismo, por eso pongo el cuadrado por azacar, me",
        "start": 1543.9199999999998,
        "end": 1547.34
    },
    {
        "text": " está arras cuadrada que estamos le estando acá. La norma de un vector al cuadrado es el",
        "start": 1547.34,
        "end": 1553.1599999999999
    },
    {
        "text": " producto interno de un vector con sigo mismo, acá el vector en cuestión es una suma, o",
        "start": 1553.16,
        "end": 1557.6000000000001
    },
    {
        "text": " sea que esto sería ve más dole ve, producto interno con ve más dole ve, producto interno",
        "start": 1557.6000000000001,
        "end": 1563.24
    },
    {
        "text": " de ve más dole ve con sigo mismo. Y hay desarrollo todo usando additividad, me va a quedar,",
        "start": 1563.24,
        "end": 1574.44
    },
    {
        "text": " lo que estoy enterrando de ve con ve más ve con dole ve más dole ve con ve guarda",
        "start": 1574.44,
        "end": 1589.3200000000002
    },
    {
        "text": " con el orden ahí, porque si estamos en espacios complejos de que te den cuidado con eso,",
        "start": 1589.32,
        "end": 1594.36
    },
    {
        "text": " más dole ve con dole ve. Sí, simplemente el desarrollo eso. Ahora, acá hay varias cosas",
        "start": 1594.36,
        "end": 1612.28
    },
    {
        "text": " que se reconoce fácilmente, ve escalar ve es la norma de ve al cuadrado y dole ve escalar",
        "start": 1612.28,
        "end": 1616.8799999999999
    },
    {
        "text": " dole ve, la norma de ve al cuadrado, o sea que esto es igual. A la norma de ve cuadrado",
        "start": 1616.88,
        "end": 1624.48
    },
    {
        "text": " dejemos un espacio calmedio, más la norma de dole ve al cuadrado, me falta estas dos",
        "start": 1624.48,
        "end": 1638.14
    },
    {
        "text": " cosas que están ahí en el medio. Ahora, ahí en el medio tengo la suma de ve con doble ve",
        "start": 1638.14,
        "end": 1663.7800000000002
    },
    {
        "text": " mal a suma de dole ve con ve y este acá si yo cambio el orden es el conjugado de este,",
        "start": 1663.78,
        "end": 1669.46
    },
    {
        "text": " o sea que esto que tengo ahí es ve escalar dole ve más ve escalar dole ve con jugado, o sea",
        "start": 1669.46,
        "end": 1676.1
    },
    {
        "text": " que esto es sumando un número más su conjugado. Se acuerdan ustedes que si yo tengo z que es un",
        "start": 1676.1,
        "end": 1683.1
    },
    {
        "text": " número complejo, x más y y por lo tanto su conjugado es x menos y por y, bueno obviamente z más z",
        "start": 1683.1,
        "end": 1692.98
    },
    {
        "text": " está conjugado que me da, dos veces la parte real, o sea dos veces la parte real de z, dos veces",
        "start": 1692.98,
        "end": 1699.34
    },
    {
        "text": " de x y acá lo mismo tengo un número más su conjugado que me queda dos veces la parte real",
        "start": 1699.34,
        "end": 1705.38
    },
    {
        "text": " de ese número, o sea que acá vendría dos veces la parte real del número x escalaría.",
        "start": 1705.38,
        "end": 1714.06
    },
    {
        "text": " Es un un marito que es ve dole ve si me brazias.",
        "start": 1714.06,
        "end": 1727.84
    },
    {
        "text": " Y ahí bueno, vamos a usar ahora continuación. El módulo de un vetor,",
        "start": 1745.04,
        "end": 1756.06
    },
    {
        "text": " el módulo número complejo, el módulo es z al cuadrado, es la parte real, es la parte real",
        "start": 1757.82,
        "end": 1768.54
    },
    {
        "text": " de z al cuadrado, más la parte imaginaria de z al cuadrado y esto obviamente es mayor igual que la",
        "start": 1769.5,
        "end": 1781.3
    },
    {
        "text": " parte real de z al cuadrado, o sea la parte real de z de un número complejo al cuadrado es",
        "start": 1781.3,
        "end": 1787.86
    },
    {
        "text": " menor igual que su módulo el cuadrado y en particular si obviamente si saco los cuadrados,",
        "start": 1787.86,
        "end": 1796.98
    },
    {
        "text": " puede ser positivo o negativo por esto siempre es positivo, o sea que la parte real de un número",
        "start": 1796.98,
        "end": 1802.3
    },
    {
        "text": " siempre es menor igual que el módulo de z el número, o sea que esto acá lo podemos escribir",
        "start": 1802.3,
        "end": 1807.06
    },
    {
        "text": " como la norma de ve al cuadrado, más dos veces el módulo del número estamos considerando,",
        "start": 1807.06,
        "end": 1816.78
    },
    {
        "text": " produciendo el módulo de z al cuadrado, más norma de ve al cuadrado.",
        "start": 1816.78,
        "end": 1822.82
    },
    {
        "text": " Se entonde va eso, la parte real de un número complejo siempre es menor igual que su módulo,",
        "start": 1830.22,
        "end": 1835.66
    },
    {
        "text": " es lo único que hemos usado ahí. Y ahora que hacemos bueno acá tengo el módulo de",
        "start": 1835.66,
        "end": 1843.34
    },
    {
        "text": " escalar de un bebé y hay uso la desigualdad de cosíso ars, por fin para cortar ese módulo",
        "start": 1843.34,
        "end": 1848.6599999999999
    },
    {
        "text": " por el productoral de las normas, o sea que por cosíso ars, esto es por cosíso ars,",
        "start": 1848.6599999999999,
        "end": 1855.62
    },
    {
        "text": " eso es menor igual que la norma de ve al cuadrado, más dos veces,",
        "start": 1855.62,
        "end": 1868.26
    },
    {
        "text": " la norma de ve por la norma dole ve, más dole ve al cuadrado.",
        "start": 1873.3,
        "end": 1880.1799999999998
    },
    {
        "text": " Vamos y ahora la norma de ve y la norma de ve son números, números reales,",
        "start": 1885.62,
        "end": 1898.62
    },
    {
        "text": " acá tengo este número al cuadrado, este número al cuadrado, más dos veces el producto",
        "start": 1898.62,
        "end": 1903.82
    },
    {
        "text": " de este por este, eso que es el cuadrado, una suma, esto no es otra cosa que el cuadrado",
        "start": 1903.82,
        "end": 1909.02
    },
    {
        "text": " de la suma, de la norma de ve, más la norma de dole ve, o sea el cuadrado de esta suma,",
        "start": 1909.02,
        "end": 1920.9
    },
    {
        "text": " si la desarrolla me queda esta el cuadrado, más este el cuadrado, más dos veces el producto",
        "start": 1920.9,
        "end": 1925.1399999999999
    },
    {
        "text": " de este por este, que lo que tenemos aquí, entonces como coroar y otro de esto tenemos que la norma",
        "start": 1925.1399999999999,
        "end": 1933.1
    },
    {
        "text": " de ve más dole ve al cuadrado, es menor igual que esto, ahí podemos sacarla los cuadrados,",
        "start": 1933.1,
        "end": 1941.5
    },
    {
        "text": " significa pues son todos números positivos, esto me implica entonces que la norma de ve",
        "start": 1941.5,
        "end": 1948.54
    },
    {
        "text": " más dole ve es efectivamente menor igual que la norma de ve, más la norma dole ve, que",
        "start": 1948.54,
        "end": 1954.86
    },
    {
        "text": " efectivamente la desigualdad triangular, o sea que la desigualdad triangular para la norma",
        "start": 1954.86,
        "end": 1961.58
    },
    {
        "text": " inducida sale como consecuencia la desigualdad de posicuars, ¿se entendió?",
        "start": 1961.58,
        "end": 1967.78
    },
    {
        "text": " A ver, ¿cuando habría igualdad ahí en la desigualdad triangular, cuando hay igualdad,",
        "start": 1967.78,
        "end": 1985.3
    },
    {
        "text": " pero en general, ¿cuando habría igualdad? Para casi igualdad en esta cadena de desigualdades,",
        "start": 1985.3,
        "end": 1995.42
    },
    {
        "text": " tiene que haber igualdad acá y tiene que haber igualdad ahí, ¿cuando hay igualdad en",
        "start": 1995.42,
        "end": 2002.8600000000001
    },
    {
        "text": " consecuencia? Cuando hay va, cuando el conjunto VW es el Edeo, o sea cuando uno los afectó",
        "start": 2002.8600000000001,
        "end": 2011.7
    },
    {
        "text": " de un múltiplo de otro. Bueno, sí, bueno, ahí está la otra condición que hay que poner.",
        "start": 2011.7,
        "end": 2023.78
    },
    {
        "text": " Si el producto interno es un número positivo, tiene que ser coliniales, ahí va, sí,",
        "start": 2023.78,
        "end": 2032.74
    },
    {
        "text": " pero es un segunito, hay dos condiciones que se tienen que cumplir, una es esta, esta",
        "start": 2032.74,
        "end": 2036.26
    },
    {
        "text": " condición tiene que ser una igualdad, cociuarme si hay igualdad si solo si inventó los",
        "start": 2036.26,
        "end": 2039.9
    },
    {
        "text": " múltiplo de otro. Y para tener igualdad acá, preciso que la parte real se igual al",
        "start": 2039.9,
        "end": 2046.14
    },
    {
        "text": " módulo, o sea que preciso que este producto interno sea por empezar, por eso que el producto",
        "start": 2046.14,
        "end": 2052.1
    },
    {
        "text": " interno sea real, pero además precioso que esto sea positivo, si, porque si otros fues",
        "start": 2052.1,
        "end": 2056.94
    },
    {
        "text": " negativo no fues igual el módulo, o sea que preciso que VW1 sea un múltiplo de otro y además",
        "start": 2056.94,
        "end": 2062.38
    },
    {
        "text": " que su producto interno sea positivo. Bueno, de ahí es fácil ver que la condición que sale",
        "start": 2062.38,
        "end": 2068.94
    },
    {
        "text": " es que uno es un múltiplo de otro y ese es el constante múltiplo es positivo, o sea",
        "start": 2068.94,
        "end": 2076.1
    },
    {
        "text": " hay igualdad cuando un vector es así y el otro vector es así, tiene esta en la misma línea",
        "start": 2076.1,
        "end": 2084.46
    },
    {
        "text": " por la más positiva, eso está más descrito en el libro rojo, en el libro rojo dice coliniales.",
        "start": 2084.46,
        "end": 2088.6600000000003
    },
    {
        "text": " No, no hay caso, no hay que ser coliniales, entonces es coliniales y además uno tiene",
        "start": 2088.66,
        "end": 2092.2599999999998
    },
    {
        "text": " ese un múltiplo de otro pero con el mismo signo, en particular si yo pongo VW igual a menos",
        "start": 2092.2599999999998,
        "end": 2098.08
    },
    {
        "text": " V esto me da cero y ahí no tengo igualdad, en el libro está más descrito, es por",
        "start": 2098.08,
        "end": 2104.62
    },
    {
        "text": " preciso que sean coliniales y que además tenga la misma dirección así que uno sea un múltiplo",
        "start": 2104.62,
        "end": 2111.02
    },
    {
        "text": " más igual que cero y el otro. Y en general esta es igualdad si uno lo repite para una suma",
        "start": 2111.02,
        "end": 2119.66
    },
    {
        "text": " de 3 vectores, de 4 etc., etc., la va aplicando repetidas veces la es igualdad triangular,",
        "start": 2119.66,
        "end": 2126.7
    },
    {
        "text": " está claro que el general se cumple lo siguiente. O sea esto nos termine a probar que la norma",
        "start": 2126.7,
        "end": 2133.54
    },
    {
        "text": " es una reducción de la norma y en general si uno tiene ahora una suma de n vectores,",
        "start": 2133.54,
        "end": 2148.38
    },
    {
        "text": " estos ahora son vectores, ¿no? V1, V2, etc., hasta vn son elementos de un espacio vectorial,",
        "start": 2148.38,
        "end": 2169.3
    },
    {
        "text": " ellos son vectores. Si yo hago un asumo de vectores y tomo la norma, eso es menor y igual que",
        "start": 2169.3,
        "end": 2175.62
    },
    {
        "text": " la suma de las normas, de aplicar repetidas veces la es igualdad triangular, la norma de una suma",
        "start": 2175.62,
        "end": 2183.98
    },
    {
        "text": " es menor igual que la suma de las normas.",
        "start": 2183.98,
        "end": 2195.14
    },
    {
        "text": " Hay muchas ideas y conceptos que vienen de la geometría usual, de lo que uno conoce",
        "start": 2195.14,
        "end": 2206.5
    },
    {
        "text": " en R3 en los pasos clíos como un licorrente, en los pasos de Nebublash, acá la estamos formulando",
        "start": 2206.5,
        "end": 2213.62
    },
    {
        "text": " en un contexto general. Justamente lo que nos vamos a meter ahora es en el concepto de",
        "start": 2213.62,
        "end": 2222.5
    },
    {
        "text": " ortobonalidad, que lo que le comentaba ahora es así. Bueno, preguntas, esta parte",
        "start": 2222.5,
        "end": 2230.58
    },
    {
        "text": " ortobonalidad es bastante entretenida, me parece si hay algo entretenido acá y esa es una",
        "start": 2230.58,
        "end": 2240.74
    },
    {
        "text": " idea muy sencilla de definir, uno dice que dos vectores son ortobonales, si el producto interno",
        "start": 2240.74,
        "end": 2245.9
    },
    {
        "text": " con otro me da cero y eso es todo, y fue mostrar la importancia que tiene trabajar con ese tipo",
        "start": 2245.9,
        "end": 2251.74
    },
    {
        "text": " de conjunto en particular trabajar con bases ortobonales, base de todos los elementos, uno",
        "start": 2251.74,
        "end": 2257.9399999999996
    },
    {
        "text": " con otros son ortobonales.",
        "start": 2257.9399999999996,
        "end": 2261.74
    },
    {
        "text": " Bueno, muy bien. Entonces, vamos a dar las definiciones precisas de lo que son",
        "start": 2261.74,
        "end": 2282.02
    },
    {
        "text": " con un conjunto ortobonales y arrancamos con un par de resultados importantes. Definiciones",
        "start": 2282.02,
        "end": 2304.22
    },
    {
        "text": " para definir el concepto de ortobonalidad lo que precisamos es un espacio editorial de",
        "start": 2304.22,
        "end": 2307.96
    },
    {
        "text": " la eterna definido un producto interno, así precisamos un espacio editorial de",
        "start": 2307.96,
        "end": 2324.52
    },
    {
        "text": " un producto interno. Entonces, uno dice que ve y doble ve son ortobonales, que ve y doble ve son",
        "start": 2324.52,
        "end": 2340.6
    },
    {
        "text": " ortobonales, si el producto interno debe con doble ve ser. Y la notación que se suele",
        "start": 2340.6,
        "end": 2356.88
    },
    {
        "text": " usar para dos vectores ortobonales, notación que a mí no me gusten absoluto porque están",
        "start": 2356.88,
        "end": 2361.2
    },
    {
        "text": " en libro ese esto es ver perpendicular a doble ve, vortobonal a doble ve, formando un",
        "start": 2361.2,
        "end": 2369.06
    },
    {
        "text": " ángulo recto entre ellos, estoy hablando entre comillas porque en espacio genérico que",
        "start": 2369.06,
        "end": 2376.12
    },
    {
        "text": " es lo que es un ángulo recto. Bueno, y esta definición coincide con la definición natural",
        "start": 2376.12,
        "end": 2385.96
    },
    {
        "text": " de la eterna 3, suelucar a la llevamos un contexto bien genérico y fíjense que pueden",
        "start": 2385.96,
        "end": 2390.62
    },
    {
        "text": " particular en el espacio funciones continuas. Que vimos recién hablar de funciones",
        "start": 2390.62,
        "end": 2397.04
    },
    {
        "text": " ortobonales, simplemente son dos funciones, estáis que si yo tomo el producto interno de ellas",
        "start": 2397.04,
        "end": 2402.78
    },
    {
        "text": " ver a ser un punto. Después, si yo tengo un conjunto de vectores, ahora voy a considerar",
        "start": 2402.78,
        "end": 2418.98
    },
    {
        "text": " un conjunto a contenido en vez, es ir un conjunto de vectores. Vamos a decir que es un conjunto",
        "start": 2418.98,
        "end": 2425.5800000000004
    },
    {
        "text": " de vectores ortobonal. Sí, para todo, para vectores que yo tomen a vectores distintos,",
        "start": 2425.58,
        "end": 2444.34
    },
    {
        "text": " se cumple que los vectores son ortobonales. Es decir, sí, para todo ve y doble ve en el",
        "start": 2444.34,
        "end": 2451.7599999999998
    },
    {
        "text": " conjunto a, con ve distinto dole ve, se cumple que ve es ortobonaladole. Bueno, vamos",
        "start": 2451.76,
        "end": 2466.6000000000004
    },
    {
        "text": " a la notación que acabamos de finitar. Entonces, un conjunto de vectores es lo que",
        "start": 2466.6000000000004,
        "end": 2471.92
    },
    {
        "text": " se llama un conjunto ortobonal, si para cualquier par de vectores distintos en ese conjunto,",
        "start": 2471.92,
        "end": 2478.82
    },
    {
        "text": " ese par de vectores son ortobonales. Y si además los vectores tienen norma 1, todos los",
        "start": 2478.82,
        "end": 2495.7200000000003
    },
    {
        "text": " vectores de A tienen norma 1, norma de B es igual a 1, para todo vectorea. Bien,",
        "start": 2495.72,
        "end": 2512.7999999999997
    },
    {
        "text": " ortonorma quiere decir que es ortobonal y que los vectores tienen norma 1, están normalizados,",
        "start": 2512.8,
        "end": 2520.4
    },
    {
        "text": " lo que se dice normalizado. Definiciones bien naturales que ustedes seguramente ya",
        "start": 2520.4,
        "end": 2534.7200000000003
    },
    {
        "text": " conozcan de Algebra 1, de trabajar en espacios de vectores, de vectores en RN, en E o plazo.",
        "start": 2534.72,
        "end": 2543.8799999999997
    },
    {
        "text": " Bien, vamos a dar un par de observaciones simples que se deduce en de allí y después una serie",
        "start": 2552.12,
        "end": 2559.12
    },
    {
        "text": " de resultados que involucren a conjuntos ortobonales.",
        "start": 2559.12,
        "end": 2562.04
    },
    {
        "text": " Primera observación, si yo tomo el producto interno de un vector con el vectornulo,",
        "start": 2577.3599999999997,
        "end": 2582.68
    },
    {
        "text": " eso ya habíamos visto que me da cero, no? Lo habíamos visto que sale en la propiedad",
        "start": 2583.68,
        "end": 2589.96
    },
    {
        "text": " frutintera, o sea que esto me da cero para cualquier vector, o sea lo que estamos diciendo es que el",
        "start": 2589.96,
        "end": 2597.56
    },
    {
        "text": " cero siempre es ortobonal a cualquier vector. Segundo observación,",
        "start": 2597.56,
        "end": 2608.2
    },
    {
        "text": " si se cumple que ve es ortobonal a sí mismo, eso por definición de ortobonalidad,",
        "start": 2612.68,
        "end": 2624.9199999999996
    },
    {
        "text": " lo mismo que decir que ve es calar consigo mismo es cero y esa condición por definición",
        "start": 2624.9199999999996,
        "end": 2635.2799999999997
    },
    {
        "text": " de plutintera interno solamente se cumple si solosives y volacero, es decir que si uno tiene que",
        "start": 2635.2799999999997,
        "end": 2641.64
    },
    {
        "text": " la única manera de tener que un vector se ortobonal a sí mismo es que ese vector sea el vector nulo,",
        "start": 2641.64,
        "end": 2645.7999999999997
    },
    {
        "text": " es la única posibilidad, el vector nulo es ortobonal a todo vector y en particular es ortobonal a sí mismo y",
        "start": 2645.7999999999997,
        "end": 2654.96
    },
    {
        "text": " es el único vector que es ortobonal a sí mismo. Y finalmente si yo tengo un conjunto ortobonal,",
        "start": 2654.96,
        "end": 2662.4
    },
    {
        "text": " si hace un conjunto ortobonal,",
        "start": 2664.56,
        "end": 2666.3599999999997
    },
    {
        "text": " tal que no tiene al elemento, no tiene al cero o sea llegar a un conjunto ortobonal pero que no",
        "start": 2671.64,
        "end": 2683.96
    },
    {
        "text": " tenga al cero, entonces yo ese conjunto lo puedo transformar en un conjunto ortobonal.",
        "start": 2683.96,
        "end": 2690.72
    },
    {
        "text": " El conjunto formado, yo agarró todos los vectores en a y lo debido por su norma,",
        "start": 2701.64,
        "end": 2713.3199999999997
    },
    {
        "text": " lo puedo hacer porque no está el cero entre esos vectores, si no lo podré vivir por la norma el cero,",
        "start": 2713.3199999999997,
        "end": 2719.44
    },
    {
        "text": " si yo agarró los vectores en a y lo debido por su norma y hago esto para todo el vector",
        "start": 2719.44,
        "end": 2725.64
    },
    {
        "text": " vena, entonces este conjunto es un conjunto ortobonal.",
        "start": 2725.64,
        "end": 2729.96
    },
    {
        "text": " O sea que yo tengo un conjunto de vectores ortobonales que no tiene al cero, si a cada vector",
        "start": 2744.96,
        "end": 2750.04
    },
    {
        "text": " ese conjunto lo debido por su norma, tengo un conjunto ortobonal, o sea vectores",
        "start": 2750.04,
        "end": 2755.4
    },
    {
        "text": " en ortobonales que tiene norma uro. Cuando yo hablo de norma estoy hablando de la norma",
        "start": 2755.4,
        "end": 2759.7599999999998
    },
    {
        "text": " inducida por el producto interno, si o sea tenemos un producto interno sobre ve,",
        "start": 2759.7599999999998,
        "end": 2765.36
    },
    {
        "text": " ese producto interno nos permite definir la idea de ortobonalidad y trabajamos cuando normalizamos",
        "start": 2765.36,
        "end": 2772.6
    },
    {
        "text": " con la norma inducida por el producto interno. Entonces, de donde sale eso, es último de escribir,",
        "start": 2772.6,
        "end": 2780.8399999999997
    },
    {
        "text": " eso sale por lo siguiente, si...",
        "start": 2784.56,
        "end": 2786.48
    },
    {
        "text": " Y...",
        "start": 2786.48,
        "end": 2787.48
    },
    {
        "text": " ¿Qué estos vectores tienen norma 1 sale por lo siguiente? Si yo considero la norma de un",
        "start": 2797.08,
        "end": 2805.68
    },
    {
        "text": " vector dividido su propia norma, la norma de un vector dividido su propia norma,",
        "start": 2805.68,
        "end": 2812.76
    },
    {
        "text": " la norma que es el denominador como es un numerito real sale afuera y expositivo sale afuera",
        "start": 2812.76,
        "end": 2819.1600000000003
    },
    {
        "text": " de la norma por definición de norma y arriba me quedaría por la norma de ve y esto obviamente es 1,",
        "start": 2820.6800000000003,
        "end": 2827.84
    },
    {
        "text": " o sea que efectivamente agarrar un vector y dividirlo por su norma me da un vector de norma 1.",
        "start": 2827.84,
        "end": 2836.5600000000004
    },
    {
        "text": " Y además si yo agarrar 2 vectores distintos acá, si yo agarrar 2 vectores distintos,",
        "start": 2837.08,
        "end": 2848.44
    },
    {
        "text": " 1 de la forma ve sobre la norma de ve y otro de la forma dole ve sobre la norma dole ve,",
        "start": 2848.44,
        "end": 2853.72
    },
    {
        "text": " los escalares acá que son positivos salen todos para afuera, o sea, 1 norma de ve sale para afuera,",
        "start": 2855.72,
        "end": 2861.88
    },
    {
        "text": " 1 norma dole ve sale para afuera y me queda ve escalar 2 ve y si justamente estoy tomando",
        "start": 2862.4,
        "end": 2872.2400000000002
    },
    {
        "text": " vectores de esta forma donde los vectores en el numerador son los vectores de esos elementos de A,",
        "start": 2872.2400000000002,
        "end": 2876.88
    },
    {
        "text": " o sea si ve y dole ve estar en A y hace un conjunto ortobonal, esto es lo mismo que 0,",
        "start": 2876.88,
        "end": 2883.88
    },
    {
        "text": " si ve y 102 ve, o sea que efectivamente agarrar un conjunto ortobonal que no tiene el",
        "start": 2884.88,
        "end": 2892.6400000000003
    },
    {
        "text": " 0 y dividirlo a las vectores por su dorva me da un conjunto ortobonal y ese proceso",
        "start": 2892.6400000000003,
        "end": 2898.56
    },
    {
        "text": " lo que se llama normalizar un conjunto normalizar un conjunto en este caso un conjunto ortobonal.",
        "start": 2898.56,
        "end": 2906.44
    },
    {
        "text": " Aquí estamos pensando que ve y dole ve estar en el conjunto.",
        "start": 2906.44,
        "end": 2914.2000000000003
    },
    {
        "text": " Bueno, entonces ahora sí vienen los resultados más importantes con los cuales vamos a terminar",
        "start": 2927.08,
        "end": 2933.4
    },
    {
        "text": " la clase de hoy. Preguntas",
        "start": 2933.4,
        "end": 2938.12
    },
    {
        "text": " vamos a empezar con un resultado que me relaciona con juntos ortobonales,",
        "start": 2947.7200000000003,
        "end": 2953.0
    },
    {
        "text": " ortobonalidad con independencia lineal, me dice que todo conjunto ortobonal como este",
        "start": 2953.0,
        "end": 2961.44
    },
    {
        "text": " que no tiene el 0 necesariamente es un conjunto linealmente independiente,",
        "start": 2962.0,
        "end": 2966.44
    },
    {
        "text": " es el primer resultado que vamos a empezar probando. Tenemos que sacar el 0, no si ponemos el 0",
        "start": 2966.44,
        "end": 2972.88
    },
    {
        "text": " obviamente no va a ser un conjunto linealmente independiente.",
        "start": 2972.88,
        "end": 2977.6
    },
    {
        "text": " Copiaron esto lo borreante, no.",
        "start": 2982.28,
        "end": 2985.08
    },
    {
        "text": " No, no era nada.",
        "start": 2985.08,
        "end": 2986.64
    },
    {
        "text": " Entonces el teórico me va a empezar probando, me dice.",
        "start": 3005.7599999999998,
        "end": 3009.3199999999997
    },
    {
        "text": " De nuevo, ve espacio vectorial con producto interno.",
        "start": 3009.32,
        "end": 3016.92
    },
    {
        "text": " Me dice este teorema que si yo tengo una espacio vectorial con producto interno y tengo un conjunto",
        "start": 3069.32,
        "end": 3095.6400000000003
    },
    {
        "text": " de vectores que le llame V1, V2 a Taberre, tal que ese conjunto es un conjunto ortobonal,",
        "start": 3095.64,
        "end": 3102.56
    },
    {
        "text": " cualquier parte de ellos, el punto de no es 0 y tal que todos estos vectores son distintos del 1,",
        "start": 3104.56,
        "end": 3111.44
    },
    {
        "text": " entonces este conjunto es necesariamente linealmente independiente.",
        "start": 3112.44,
        "end": 3115.8799999999997
    },
    {
        "text": " La demostración es bien sencilla, yo quiero probar que este conjunto es el de I, entonces",
        "start": 3115.88,
        "end": 3130.6400000000003
    },
    {
        "text": " a garlic tomo una combinación lineal, la igual a 0 y quiero probar que los coeficientes",
        "start": 3130.6400000000003,
        "end": 3135.4
    },
    {
        "text": " de combinación lineal necesariamente son 0. Entonces vamos a empezar considerando consideramos",
        "start": 3135.4,
        "end": 3144.2400000000002
    },
    {
        "text": " una combinación lineal, alpha 1 por V1 más alpha 2 por V2 más alpha R por VR y la igual",
        "start": 3144.24,
        "end": 3153.9599999999996
    },
    {
        "text": " a 0, los alpha son los escalares, la notación usual.",
        "start": 3153.9599999999996,
        "end": 3159.08
    },
    {
        "text": " Entonces para cada vector de este conjunto para cada uno de los vectores,",
        "start": 3159.08,
        "end": 3169.64
    },
    {
        "text": " se cumple lo siguiente,",
        "start": 3169.64,
        "end": 3180.12
    },
    {
        "text": " yo voy a agarrar esta suma esta combinación lineal y voy a tomar el producto interno,",
        "start": 3180.12,
        "end": 3200.7599999999998
    },
    {
        "text": " el producto interno esa combinación lineal con cada uno de los vectores que tengo acá,",
        "start": 3200.7599999999998,
        "end": 3205.88
    },
    {
        "text": " se va a tomar la combinación lineal, el producto interno con V1, la combinación lineal,",
        "start": 3205.88,
        "end": 3209.6400000000003
    },
    {
        "text": " el producto interno con V2 etcétera. O sea voy a tomar la combinación lineal,",
        "start": 3209.6400000000003,
        "end": 3213.48
    },
    {
        "text": " el producto interno, la combinación lineal que la vamos a escribir de manera compacta así,",
        "start": 3215.6400000000003,
        "end": 3220.08
    },
    {
        "text": " esta es la combinación lineal y voy a tomar el producto interno de esa combinación lineal con cada uno",
        "start": 3225.56,
        "end": 3230.88
    },
    {
        "text": " de los vectores que tengo ahí, o sea con VJ, con cada uno de los veJ, donde VJ va desde 1 hasta",
        "start": 3230.88,
        "end": 3237.52
    },
    {
        "text": " 0. Estamos, estoy haciendo el producto interno de la combinación lineal con esto, después el",
        "start": 3237.52,
        "end": 3248.6400000000003
    },
    {
        "text": " producto interno de la combinación con esto, con el producto interno de la combinación con cada uno de",
        "start": 3248.6400000000003,
        "end": 3251.6800000000003
    },
    {
        "text": " los vectores. Ahora esta combinación lineal es igual a 0, esto acá es la otra cosa que el",
        "start": 3251.6800000000003,
        "end": 3258.56
    },
    {
        "text": " vector duro, por lo tanto ese producto interno me da 0 y ahora uso propiedad del producto interno,",
        "start": 3258.56,
        "end": 3274.56
    },
    {
        "text": " acá tengo una suma de vectores en la primera entrada, una combinación lineal, digamos me queda",
        "start": 3274.56,
        "end": 3281.52
    },
    {
        "text": " los productos interno de la suma, de los elementos de los humanos y las constantes salen para afuera,",
        "start": 3281.52,
        "end": 3286.72
    },
    {
        "text": " o sea que esto me queda por propiedad del producto interno, me queda lo mismo que la suma",
        "start": 3286.72,
        "end": 3291.16
    },
    {
        "text": " atoria y desde 1 hasta R, de AlphaE, las constantes salen para afuera en la primera entrada,",
        "start": 3291.16,
        "end": 3297.3199999999997
    },
    {
        "text": " ve y escalar VJ, o sea el VJ esta fijo, es un vector fijo que agarre de acá, lo voy a hacer para",
        "start": 3297.3199999999997,
        "end": 3309.12
    },
    {
        "text": " cada uno de los vectores, pero lo voy fijando cada vez, fijo uno de los vectores, tomo el producto",
        "start": 3309.12,
        "end": 3315.0
    },
    {
        "text": " interno de la suma de esta con ese vector que estoy fijando ahí, eso me da 0 porque esta suma",
        "start": 3315.0,
        "end": 3319.88
    },
    {
        "text": " es 0, ahora si es arroyo esto por propiedad del producto interno me quedaría la suma, las",
        "start": 3319.88,
        "end": 3325.62
    },
    {
        "text": " constantes al país salen para afuera en el producto interno, me queda esto, o sea la propiedad del producto interno,",
        "start": 3325.62,
        "end": 3329.56
    },
    {
        "text": " y ahora acá me queda VJ, es cada vejota, donde VJ son los elementos del conjunto S y vejota es",
        "start": 3329.56,
        "end": 3337.08
    },
    {
        "text": " 1 que tengo fijo, y esto que me da, que me da este producto interno que tengo acá,",
        "start": 3337.08,
        "end": 3344.2799999999997
    },
    {
        "text": " acá tengo R sumandos, supongamos que yo estoy verificando acá sería el ve uno, entonces uno",
        "start": 3344.2799999999997,
        "end": 3353.14
    },
    {
        "text": " sumando sería VJ escalar V1, el otro tendría V2 escalar V1, otro V3 escalar V1, otro V4",
        "start": 3353.14,
        "end": 3359.22
    },
    {
        "text": " escalar V1, de estos sumandos se van todos, menos que corresponde ahí con la jota, como este",
        "start": 3359.22,
        "end": 3366.56
    },
    {
        "text": " es un conjunto ortobonal, este es un conjunto ortobonal, el propio interno de un veí con un",
        "start": 3366.56,
        "end": 3371.88
    },
    {
        "text": " vejota, si son distintos o vale 0, o sea que esto me da 0 si es distinto de jota y si igual",
        "start": 3371.88,
        "end": 3383.2799999999997
    },
    {
        "text": " a jota me queda lo que me va a quedar, es el único que me da este, bueno me da algo de",
        "start": 3383.2799999999997,
        "end": 3391.14
    },
    {
        "text": " 5, entonces, entonces acá me quedaría, de todo esto sumando el único que me queda el",
        "start": 3391.14,
        "end": 3398.14
    },
    {
        "text": " I que corresponde a j, o sea que esto me quedaría alpha j por el producto interno de vejota",
        "start": 3398.14,
        "end": 3404.3799999999997
    },
    {
        "text": " consigo mismo, se entendió eso, el vejota está fijo, toma producto interno de esto, cuando",
        "start": 3404.3799999999997,
        "end": 3414.58
    },
    {
        "text": " desarrollo de toda esta suma de la forma de los sumandos V1, vejota, V2 vejota, V3 vejota",
        "start": 3414.58,
        "end": 3421.7
    },
    {
        "text": " se van todos, ese es el que corresponde ahí con la j, porque es un conjunto ortobonal, entonces",
        "start": 3421.7,
        "end": 3426.4
    },
    {
        "text": " ahí me va a quedar alpha j por vejota escalar vejota, o sea alpha j por la norma de vejota",
        "start": 3426.4,
        "end": 3434.98
    },
    {
        "text": " al cuadrado, ahora viene entonces saco que 0 es igual alpha j por la norma de vejota",
        "start": 3434.98,
        "end": 3443.22
    },
    {
        "text": " del cuadrado, pero la norma de vejota del cuadrado es cierto de 0, porque estamos diciendo justamente",
        "start": 3443.22,
        "end": 3450.3799999999997
    },
    {
        "text": " que estos vectores son distintos del vecto nulo, la única manera de tener la norma",
        "start": 3450.3799999999997,
        "end": 3454.62
    },
    {
        "text": " igual a 0 es que el veje del vecto nulo, si saco el vecto nulo ahí, todas estas normas",
        "start": 3454.62,
        "end": 3459.18
    },
    {
        "text": " son estrictamente positivas, o sea que esto acá es distinto de 0, de manera que la única",
        "start": 3459.18,
        "end": 3464.8599999999997
    },
    {
        "text": " forma de tener que alpha j por esto sea 0 es que alpha j se igual a 0, si o sea lo que",
        "start": 3464.86,
        "end": 3476.86
    },
    {
        "text": " estamos haciendo es, yo estoy fijando en j, estoy tomando el primer vector V1, hago la",
        "start": 3476.86,
        "end": 3482.46
    },
    {
        "text": " operación, pueniendo acá la segunda entrada V1 y eso es agua y desarrollo con cruyo",
        "start": 3482.46,
        "end": 3487.36
    },
    {
        "text": " que alpha 1 igual a 0, pongo el vector V2, hago la operación y con cruyo que alpha 2",
        "start": 3487.36,
        "end": 3492.26
    },
    {
        "text": " igual a 0 y así, entonces con cruyo de cada uno de estos coeficientes tiene que ser",
        "start": 3492.26,
        "end": 3499.1200000000003
    },
    {
        "text": " necesariamente 0, o sea que alpha j es igual a 0 para todos j desde 1 hasta R y concluimos",
        "start": 3499.1200000000003,
        "end": 3511.5600000000004
    },
    {
        "text": " entonces que la única manera de tener una comisión ideal igual a 0 que todos los coeficientes",
        "start": 3511.5600000000004,
        "end": 3515.9
    },
    {
        "text": " anulos, o sea concluimos que el conjunto es efectivamente ligadamente independiente.",
        "start": 3515.9,
        "end": 3525.26
    },
    {
        "text": " Bien, es una demostración bien bien San Sisha, o sea que siempre que trabajemos con",
        "start": 3525.26,
        "end": 3546.5800000000004
    },
    {
        "text": " conjuntos ortobonales que no incluyan al 0 se conjuntos ligadamente independiente.",
        "start": 3546.58,
        "end": 3553.58
    },
    {
        "text": " Segundo resultado, bueno este es medio que pintores, pero vamos a usar, vamos a usar,",
        "start": 3553.58,
        "end": 3570.9
    },
    {
        "text": " es el teoreo de pitágoras escrito en este contexto. El teoreo de pitágoras en este contexto",
        "start": 3570.9,
        "end": 3593.42
    },
    {
        "text": " de la generalización del conocido teoreo de pitágoras de la geometría plana, si",
        "start": 3593.42,
        "end": 3598.82
    },
    {
        "text": " yo tengo acá un vector B y le pongo acá un vector W, esta aquí esto acá es un ángulo",
        "start": 3598.82,
        "end": 3607.34
    },
    {
        "text": " recto y considero el vector este que es, no otra cosa que ve más W, el teoreo de pitágoras,",
        "start": 3607.34,
        "end": 3619.86
    },
    {
        "text": " bueno acá estoy diciendo que W son ortobonales, es decir este ángulo recto, este ángulo",
        "start": 3619.86,
        "end": 3627.6200000000003
    },
    {
        "text": " recto, el teoreo de pitágoras me dice que el módulo de este vector al cuadrado es igual al módulo de",
        "start": 3628.62,
        "end": 3634.22
    },
    {
        "text": " este vector al cuadrado, más el módulo de este vector al cuadrado y eso lo vamos a formular entonces",
        "start": 3634.22,
        "end": 3639.62
    },
    {
        "text": " en un contexto genérico, me dice el teoreo de pitágoras en este contexto, de nuevo acá",
        "start": 3639.62,
        "end": 3647.58
    },
    {
        "text": " tiene que poner un cello y chanta, lo es B espacio de tutorial con producto interno y ahí",
        "start": 3647.58,
        "end": 3664.14
    },
    {
        "text": " considero un conjunto ortobonal, V1, V2 hasta VR, conjunto ortobonal, lo que me dice el teoreo",
        "start": 3664.14,
        "end": 3681.7
    },
    {
        "text": " de pitágoras en este contexto es lo que comentaba y recién, me dice, me dice que si yo tengo un",
        "start": 3681.7,
        "end": 3705.54
    },
    {
        "text": " conjunto ortobonal, la norma al cuadrado de la suma, la norma del asuma al cuadrado es igual a la suma",
        "start": 3705.54,
        "end": 3718.98
    },
    {
        "text": " de las normas del cuadrado, en la generalización de esto, acá tenemos que la norma de V más W",
        "start": 3718.98,
        "end": 3723.5
    },
    {
        "text": " al cuadrado, la norma de V al cuadrado, la norma del cuadrado, si V1 es ortobonales, en este",
        "start": 3723.5,
        "end": 3728.9
    },
    {
        "text": " contexto es si yo sumo vectores ortobonales, la norma al cuadrado es la suma de las normas",
        "start": 3728.9,
        "end": 3737.42
    },
    {
        "text": " de los vectores al cuadrado, bien, la demostración es también es trivial, vemos la demostración y terminamos",
        "start": 3737.42,
        "end": 3751.34
    },
    {
        "text": " con la ilusión de un resultado que es importante, no está muy bien, la demostración es bien",
        "start": 3751.34,
        "end": 3759.02
    },
    {
        "text": " sencilla, es una línea, también linda para tomar en un desarrollo, recuerden que si acá la norma",
        "start": 3759.02,
        "end": 3771.1800000000003
    },
    {
        "text": " es la norma inducida por un producto interno, entonces desarrollemos esto, la norma de un vector",
        "start": 3771.18,
        "end": 3781.8999999999996
    },
    {
        "text": " al cuadrado por definición de norma inducida es el producto interno de ese vector consigo mismo,",
        "start": 3781.8999999999996,
        "end": 3788.8199999999997
    },
    {
        "text": " el producto interno de un vector consigo mismo, para no entreberar la sumatoria, aúnín dice sumo,",
        "start": 3788.8199999999997,
        "end": 3800.18
    },
    {
        "text": " le voy a llamar y y al otro le voy a llamar J, porque son dos sumas distintas, una suma lo que",
        "start": 3800.18,
        "end": 3808.5
    },
    {
        "text": " va acá en el primer sumando, en la primera entrada y otra lo que va en la segunda entrada,",
        "start": 3808.5,
        "end": 3812.18
    },
    {
        "text": " bien, uso ahí las propiedades de la aditividad del producto interno con respecto a la primera",
        "start": 3820.1,
        "end": 3825.02
    },
    {
        "text": " entrada y con respecto a la segunda, la sumatoria, entonces esto acá se puede escribir como una sumatoria y desde",
        "start": 3825.02,
        "end": 3831.98
    },
    {
        "text": " 1.R, la sumatoria J, desde 1.R y después me va a quedar el producto interno de vei con vejota,",
        "start": 3831.98,
        "end": 3841.78
    },
    {
        "text": " si desarrollé ahí aplicando la linealidad, la aditividad con respecto a la primera entrada y la",
        "start": 3844.46,
        "end": 3852.56
    },
    {
        "text": " sumatoria es una entrada. Y ahora usamos que veis esto acá, veo, me doy hasta ver un conjunto",
        "start": 3852.56,
        "end": 3861.12
    },
    {
        "text": " retobona, o sea que veis que la vejota es 0, si es distinto de j, definición de punto retobona",
        "start": 3861.12,
        "end": 3870.44
    },
    {
        "text": " a dar un par de vector distintos, ese punto interno me da 0, o sea que cuando yo hago esta sumatoria,",
        "start": 3870.44,
        "end": 3876.36
    },
    {
        "text": " acá tengo una doble sumatoria, cuando yo hago la primera sumatoria sobre I, de todos los",
        "start": 3877.1600000000003,
        "end": 3885.92
    },
    {
        "text": " sumandos que involucren a la segunda sumatoria para cada índice ahí fijo, se van a ir todos excepto",
        "start": 3885.92,
        "end": 3892.2000000000003
    },
    {
        "text": " el corresponde ahí igual a J, o sea tengo la sumatoria igual de 1.R y acá de todas estas",
        "start": 3892.2000000000003,
        "end": 3899.52
    },
    {
        "text": " las segunda sumas se me van todos excepto el corresponde a J igual a I, o sea que corresponde",
        "start": 3899.52,
        "end": 3904.56
    },
    {
        "text": " acá que me da veir es calar veir. ¿Se entendió? Y esto justamente nos otra cosa que la sumatoria",
        "start": 3904.56,
        "end": 3921.24
    },
    {
        "text": " veis de 1.R, esto es la norma de veir al cuadrado, bien así sale, bien sencillo la demostración.",
        "start": 3921.24,
        "end": 3930.7999999999997
    },
    {
        "text": " Vamos, repito, de esta doble sumatoria para cada índice de todos estos sumandos que involucan",
        "start": 3931.7999999999997,
        "end": 3937.72
    },
    {
        "text": " J se me van a ir todos excepto el corresponde ahí igual a J, se me va a quedar este, se me",
        "start": 3937.72,
        "end": 3946.2799999999997
    },
    {
        "text": " va a quedar este, se me va a quedar este, se me va a quedar este, se me va a quedar",
        "start": 3946.28,
        "end": 3952.96
    },
    {
        "text": " así su matoria de 1.R veis calar veis y eso justamente la norma de veis al cuadrado.",
        "start": 3952.96,
        "end": 3958.1200000000003
    },
    {
        "text": " Bueno, preguntas,",
        "start": 3965.1200000000003,
        "end": 3966.5600000000004
    },
    {
        "text": " bien un punto importante, se los voy a en un cierre y lo vamos a dejar para la clase que viene",
        "start": 3966.56,
        "end": 3975.7999999999997
    },
    {
        "text": " de demostración, pero esto es bien, bien importante, sí que en serio siguiente.",
        "start": 3975.7999999999997,
        "end": 3980.32
    },
    {
        "text": " Para poner un ejemplo tonto, si yo trabajo en R3 con el producto interno usual,",
        "start": 3984.56,
        "end": 3989.56
    },
    {
        "text": " y con la base canónica, cuyo vector le voy a llamar E1, el primer vector, 1 0 0, E2 el segundo vector",
        "start": 3996.56,
        "end": 4019.56
    },
    {
        "text": " y el tercer vector, el 0 0 1, esto es justamente la base canónica.",
        "start": 4019.56,
        "end": 4029.0
    },
    {
        "text": " Fija en serio siguiente, está claro que si yo tomo el producto interno de este con este,",
        "start": 4038.56,
        "end": 4044.2
    },
    {
        "text": " me va a dar 0, este con este me va a dar 0 y este con este me va a dar 0. O sea que estos tres",
        "start": 4044.2,
        "end": 4049.08
    },
    {
        "text": " forman un conjunto ortogonal y que además tienen cada uno de ellos, normal uno, porque la norma de",
        "start": 4049.08,
        "end": 4055.04
    },
    {
        "text": " este es 1 al cuadrado, más 0, más 0, raíz cuadrado, es 1, la de este también es de",
        "start": 4055.04,
        "end": 4059.8799999999997
    },
    {
        "text": " también. O sea que esto acá me forman una base ortónormal de R3, esto acá es E1, E2 y E3 es una base",
        "start": 4059.8799999999997,
        "end": 4073.48
    },
    {
        "text": " ortónormal de R3 y nos está trabajando de R3 con el producto interno usual. Entonces la",
        "start": 4073.48,
        "end": 4083.56
    },
    {
        "text": " pregunta natural es la siguiente, será que en cualquier espacio vectorial con producto interno,",
        "start": 4083.56,
        "end": 4090.8
    },
    {
        "text": " pueden cualquier su espacio de un producto vectorial, tiene espacio vectorial con producto interno,",
        "start": 4090.8,
        "end": 4096.52
    },
    {
        "text": " se puede encontrar una base ortónormal, por ejemplo yo podría considerar en R3 un",
        "start": 4096.52,
        "end": 4103.68
    },
    {
        "text": " su espacio de dimensión 2, será que en su su espacio puedo encontrar una base ortónormal y la",
        "start": 4103.68,
        "end": 4108.72
    },
    {
        "text": " respuesta es sí y eso se puede hacer, esa se puede encontrar esa base usando el procedimiento de",
        "start": 4108.72,
        "end": 4117.200000000001
    },
    {
        "text": " ortónormalización de Grams-Mid, que se los vean unciera hora y lo vamos a ver con cuidado la",
        "start": 4117.200000000001,
        "end": 4122.84
    },
    {
        "text": " base de la base. Bien, el procedimiento de ortónormalización de Grams-Mid consiste en",
        "start": 4122.84,
        "end": 4129.64
    },
    {
        "text": " la siguiente en agarrar una base de un espacio vectorial y a partir de esa base fabricarme",
        "start": 4129.64,
        "end": 4135.24
    },
    {
        "text": " nuevos factores que me dan una base ortónormal. Vamos y ya veremos la clase que viene cuándo es",
        "start": 4135.24,
        "end": 4143.84
    },
    {
        "text": " la ventaja de trabajar en base ortónormal, hay un montón de ventaja de resultados útiles",
        "start": 4143.84,
        "end": 4149.8
    },
    {
        "text": " que sale en ese contexto. Entonces el método de ortónormalización",
        "start": 4149.8,
        "end": 4160.64
    },
    {
        "text": " Grams-Mid, esto se usa muchísimo. Me dice lo siguiente, volvemos a escribir y lo leemos.",
        "start": 4160.64,
        "end": 4189.64
    },
    {
        "text": " En este momento, se puede hacer una base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la",
        "start": 4219.64,
        "end": 4249.64
    },
    {
        "text": " de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la",
        "start": 4249.64,
        "end": 4279.64
    },
    {
        "text": " de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la base de la",
        "start": 4279.64,
        "end": 4309.64
    },
    {
        "text": " yo tengo un espacio vectorial con producto interno, ese espacio tiene la dimensión N y considero hay una base cualquiera, una base de N vector y ve uno me va a estar bien, entonces lo que me dice es que existe una nueva base que le vamos a llamar de prima cuyo elemento son ni uno y dos hasta de N que es una base horto normal de B, es decir todos estos tienen norma 1 y si yo tomo el punto interno de cualquier parte de ellos me da a seguirlo.",
        "start": 4309.64,
        "end": 4339.54
    },
    {
        "text": " Bien y además se cumple, esto es su espacio generado, esta la notación por su espacio generado, además se cumple que si yo considero el espacio generado por un conjunto, por el conjunto los K primeros vectores acá coincide con el espacio generado por los K primeros vectores acá, esto quiere decir, el su espacio generado por I1 coincide con el V1, el generado por I1 e I2 coincide con V1 V2 y I1 I2 I3 coincide con el V1 V2 V3 etc.",
        "start": 4339.64,
        "end": 4369.54
    },
    {
        "text": " y la demostración de esto se hace de manera constructiva y la vamos a ver con cuidado la sepasada la que se que viene, perdón.",
        "start": 4369.64,
        "end": 4376.64
    },
    {
        "text": " Y el objetivo siguiente es fabricarse una base horto con al primero y después normalizarla e ir el higiendo propiamente en los vectores, arrancar con el I1 igual a V1 y después elegir el I2 como combinación a propiedad de V1 más V2 y después el I3 como combinación de V1 V2 V3 etc.",
        "start": 4376.64,
        "end": 4397.64
    },
    {
        "text": " Lo vamos a ver la clase que viene, vamos a mostrar toda la clase dedicada a este tema. Bueno, nos vemos en jueves entonces.",
        "start": 4397.64,
        "end": 4409.64
    }
]