[
    {
        "text": " La idea de hoy seguirá avanzando con esto de cálculo del límite de decisiones matrices",
        "start": 0.0,
        "end": 20.64
    },
    {
        "text": " y empezamos repasando el último lema, no la demostracion, la demostración quedó",
        "start": 20.64,
        "end": 27.96
    },
    {
        "text": " pronta, pero si voy a repasar lo que dice el último lema como pide apoyo para el resto",
        "start": 27.96,
        "end": 33.92
    },
    {
        "text": " de la clase, dice así, decí así este lema, para los que no vinieron o para lo que se",
        "start": 33.92,
        "end": 53.24
    },
    {
        "text": " perdieron, si el límite de una sucesión de matrices a su S, esa y está en el mundo en",
        "start": 53.24,
        "end": 68.12
    },
    {
        "text": " P4M y a la vez el límite de otra sucesión de matrices de su S, S, S, B, esta en el mundo P4M,",
        "start": 68.12,
        "end": 83.92
    },
    {
        "text": " creo que era, entonces teníamos 4 puntos y se oviueltan un poquito el orden que aparece",
        "start": 83.92,
        "end": 94.0
    },
    {
        "text": " en el libro y espero acordarme el orden que la puse la última clase, creo que la primera",
        "start": 94.0,
        "end": 100.6
    },
    {
        "text": " decía que el límite de la anda por a su S es la anda si quieren los que iba distinto",
        "start": 100.6,
        "end": 111.0
    },
    {
        "text": " para que se límite a su S, el mismo, para todo el anda en el cuarto, lo que está",
        "start": 111.0,
        "end": 120.08
    },
    {
        "text": " diciendo esta primera propiedad que puse en la clase pasada es que es la anda hacia",
        "start": 120.08,
        "end": 124.48
    },
    {
        "text": " la fuera, multiplicarla por una constante si quieren es continuo, si vos metes el límite",
        "start": 124.48,
        "end": 133.52
    },
    {
        "text": " para dentro la función, la función es continuo, ¿qué funcione es multiplicar por una constante?",
        "start": 133.52,
        "end": 139.72
    },
    {
        "text": " Son formas de leer lo mismo digamos, lo digo simplemente porque capaz que en algunos textos",
        "start": 139.72,
        "end": 144.76
    },
    {
        "text": " aparece escrito así, 2, ¿qué pasa si la 2 tiene a su S es T, a y B es su S es T, a",
        "start": 144.76,
        "end": 156.07999999999998
    },
    {
        "text": " B que pasa con la suma cuando existe tal suma, por supuesto, tiene que existir la suma,",
        "start": 156.07999999999998,
        "end": 163.39999999999998
    },
    {
        "text": " para eso ahora los cribimos, se tiene que ser igual a P y en que se tiene que ser igual",
        "start": 163.39999999999998,
        "end": 167.32
    },
    {
        "text": " a N, pero lo que va a pasar es lo mismo y ahora devuelta el libro un poquito distinto,",
        "start": 167.32,
        "end": 174.23999999999998
    },
    {
        "text": " quizás alguno les guste más así o más de la otra manera, a mí me de igual dicen",
        "start": 174.24,
        "end": 178.44
    },
    {
        "text": " lo mismo que el otro día, repito cuando los mundos son correctos cuando estamos en",
        "start": 178.44,
        "end": 191.0
    },
    {
        "text": " el mundo correcto, en igual P y en igual L porque les quiero sumar, lo que dice es que",
        "start": 191.0,
        "end": 196.28
    },
    {
        "text": " la suma de matrices es una función continuo, también, estamos hablando de continuidad,",
        "start": 196.28,
        "end": 205.2
    },
    {
        "text": " estamos hablando y es porque tenemos el límite porque tenemos alguna norma, alguna topología,",
        "start": 205.2,
        "end": 209.8
    },
    {
        "text": " alguna métrica algo que nos ayuda, ¿no? Y sí, ya sabemos que dijimos en el comienzo",
        "start": 209.8,
        "end": 215.0
    },
    {
        "text": " de la clase pasada, pero vale recordarlo que en cualquier caso, por ejemplo, en el caso",
        "start": 215.0,
        "end": 221.2
    },
    {
        "text": " 2 o en la definición original como quieran, estamos trabajando en K a la N por M, piensen",
        "start": 221.2,
        "end": 231.07999999999998
    },
    {
        "text": " R a la N por M o sea a la N por M, ¿por qué? Porque son matrices en el por M, o sea,",
        "start": 231.07999999999998,
        "end": 238.6
    },
    {
        "text": " hay N por M coordenadas reales o N por M coordenadas y ahí tenés la norma habitual, la norma",
        "start": 238.6,
        "end": 248.95999999999998
    },
    {
        "text": " euclidiana con la norma euclidiana, ¿no? Y que les iba a decir, digo, en R seguro",
        "start": 248.96,
        "end": 271.32
    },
    {
        "text": " vino en el cálculo 2 que en R la 3 es 4, 5, o el quiera de esos, las 3 normas habituales",
        "start": 271.32,
        "end": 276.68
    },
    {
        "text": " son equivalentes entre sí, pero vamos a hablar la más conocida, la euclidiana, etcétera",
        "start": 276.68,
        "end": 283.84000000000003
    },
    {
        "text": " que estamos más acostumbrados. Bueno, digo para no complicar la historia, ¿qué más",
        "start": 283.84000000000003,
        "end": 291.58
    },
    {
        "text": " decía esta este lemma? punto 3, a ver, decía que el límite cuando ese tiene más infinito",
        "start": 291.58,
        "end": 301.96000000000004
    },
    {
        "text": " y podemos multiplicar correctamente cuando esto no tiene problemas, esto es lo mismo",
        "start": 301.96,
        "end": 310.59999999999997
    },
    {
        "text": " que p por el límite cuando ese tiene más infinito de a su s por q todo conformable, o",
        "start": 310.59999999999997,
        "end": 320.78
    },
    {
        "text": " sea cuando no hay problemas en esas multiplicaciones. Bueno, quiere decir que el producto por constante",
        "start": 320.78,
        "end": 328.32
    },
    {
        "text": " es por matrices constante, acá el a 1 es producto por constantes del cuerpo, en la 3 es",
        "start": 328.32,
        "end": 335.88
    },
    {
        "text": " producto por matrices constantes, lo que está diciendo es que también es una fusión",
        "start": 335.88,
        "end": 340.96
    },
    {
        "text": " continuo, el límite salientra. Las primeras 2 ya les vieron en cálculo 2, no tiene nada",
        "start": 340.96,
        "end": 351.52
    },
    {
        "text": " nuevo, las primeras 2 porque si la mirás con la norma euclidiana en R, en R a la N por",
        "start": 351.52,
        "end": 358.68
    },
    {
        "text": " M no tiene nada nuevo, esto ya lo vieron en cálculo 2, la suma de electores es continuo",
        "start": 358.68,
        "end": 365.28
    },
    {
        "text": " y el producto por escalar también se nos funciona continuo. Y esta es la primera que distinta",
        "start": 365.28,
        "end": 375.91999999999996
    },
    {
        "text": " porque de alguna manera están haciendo el producto de matrices, entonces el producto",
        "start": 375.91999999999996,
        "end": 379.68
    },
    {
        "text": " de matrices probablemente no se han visto nunca que lo que está diciendo esto que es",
        "start": 379.68,
        "end": 383.84000000000003
    },
    {
        "text": " continuo cuando eso es por una matrices constantes. Y la que sí probamos que es la 4 es de",
        "start": 383.84000000000003,
        "end": 389.0
    },
    {
        "text": " vuelta del producto de matrices pero en este caso de a su s por v su s no va por una",
        "start": 389.0,
        "end": 398.84000000000003
    },
    {
        "text": " matrices, si no, si interesante esto es el límite de la a su s, esta la demostramos",
        "start": 398.84,
        "end": 407.84
    },
    {
        "text": " en clase por el límite de la b su s cuando son conformables y conformables son a ver",
        "start": 407.84,
        "end": 415.55999999999995
    },
    {
        "text": " a su s por b su s cuando de mi igual p. Bueno, se puede multiplicar correctamente, bueno",
        "start": 415.55999999999995,
        "end": 426.08
    },
    {
        "text": " esta última no es tan trivial, no, tan interesante, vos podés mover el límite del mismo tiempo",
        "start": 426.08,
        "end": 432.2
    },
    {
        "text": " de las 2 y con la misma variable, con la misma variable, con la misma s, con el mismo",
        "start": 432.2,
        "end": 438.47999999999996
    },
    {
        "text": " tiempo digamos. Y esto sale en forma continua, si aquí es muy bonito, esa le hicimos, la 1",
        "start": 438.47999999999996,
        "end": 446.79999999999995
    },
    {
        "text": " va a quedar para el práctico, ese primer ejercicio de práctico, bueno, lo que siguiente",
        "start": 446.79999999999995,
        "end": 453.2
    },
    {
        "text": " quisimos al final de la clase y dije que iba a empezar la clase de hoy con eso es destacar",
        "start": 453.2,
        "end": 460.8
    },
    {
        "text": " la importancia de 3, por supuesto de 4 también, lo hemos hecho ya, por eso la elegimos para demostrar",
        "start": 460.8,
        "end": 467.59999999999997
    },
    {
        "text": " y acabo de decir que es muy interesante este resultado, pero quiero destacar también 3",
        "start": 467.59999999999997,
        "end": 472.91999999999996
    },
    {
        "text": " en su utilidad sobre todo, ¿no? Porque trabajamos mucho tiempo encontrando de la forma",
        "start": 472.91999999999996,
        "end": 482.21999999999997
    },
    {
        "text": " de lloradan asociadas a matrices y parece más importante empezar a utilizar todo ese",
        "start": 482.22,
        "end": 489.78000000000003
    },
    {
        "text": " material, todo ese trabajo. Y entonces le decíamos, claro, si la matriz ha asociado de su forma",
        "start": 489.78000000000003,
        "end": 499.54
    },
    {
        "text": " de lloradan, si, ya escribirlo así con todo el material y todo lo que estamos haciendo,",
        "start": 499.54,
        "end": 508.06
    },
    {
        "text": " ya sabemos que estamos diciendo de la lloradan asociada, entonces que pasa con el límite cuando",
        "start": 508.06,
        "end": 514.22
    },
    {
        "text": " N, cuando M, tiende a más infinito de A a la M, ahí un cambio, el cambio de pizarron y",
        "start": 514.22,
        "end": 524.18
    },
    {
        "text": " en vez de dedicarme a cualquier sucesión de matrices, estoy dedicándome a las sucesiones",
        "start": 524.18,
        "end": 528.54
    },
    {
        "text": " de potencias de matrices, de una matrifica, es una sucesión especial pero que la queremos",
        "start": 528.54,
        "end": 536.7
    },
    {
        "text": " entender bien porque además es la que tiene que ver con la composición de las transformaciones",
        "start": 536.7,
        "end": 541.1800000000001
    },
    {
        "text": " lineales. Por un lado, hacia el pasado, o sea, hacia el origen de la construcción matemática",
        "start": 541.1800000000001,
        "end": 551.86
    },
    {
        "text": " y sí, A a la M es muy importante porque la matriz asociada de la composición T, A, M,",
        "start": 551.86,
        "end": 557.6600000000001
    },
    {
        "text": " C, T de la transformación ideal, si F y la transformación ideal, entonces estamos hablando",
        "start": 557.6600000000001,
        "end": 564.7800000000001
    },
    {
        "text": " de la matrices asociada a F y la M y componer es entender la evolución en el tiempo de",
        "start": 564.78,
        "end": 569.9399999999999
    },
    {
        "text": " un comportamiento que hayas modelado en economía, en biología, en lo que fuera. Entonces",
        "start": 569.9399999999999,
        "end": 579.26
    },
    {
        "text": " claro, componer es repetir el procedimiento a ver cómo evoluciona, entonces claro",
        "start": 579.26,
        "end": 585.18
    },
    {
        "text": " que no se importa a la M, pero hacia el futuro además usando series de potencia, cosas",
        "start": 585.18,
        "end": 590.9
    },
    {
        "text": " que capaz que vieron algo en calculo 1 o en calculo 2 y quizás vieron algo, alguna",
        "start": 590.9,
        "end": 596.02
    },
    {
        "text": " cosita en discreto 1 cuando se hace generatrices, ¿no? Con series de potencias que las series",
        "start": 596.02,
        "end": 606.5
    },
    {
        "text": " de potencias están dado justamente porque en cada sumando aparecen de este tipo,",
        "start": 606.5,
        "end": 610.8199999999999
    },
    {
        "text": " olviden ser matriz la X, la X estaba en la serie de potencias, construyendo otras funciones",
        "start": 610.8199999999999,
        "end": 616.22
    },
    {
        "text": " se acuerdan con la serie de potencias, entonces con estas vamos a construir otras funciones,",
        "start": 616.22,
        "end": 621.82
    },
    {
        "text": " se acuerdan lo que le íbamos a un día o dos en la nota de que los investigadores, la",
        "start": 621.82,
        "end": 628.5
    },
    {
        "text": " velocidad de valencia, a mí me encontró a metros más rápidos para el cálculo de funciones",
        "start": 628.5,
        "end": 632.26
    },
    {
        "text": " de matrices, funciones de matrices, nosotros ahora tenemos polinomios, ahora con esto",
        "start": 632.26,
        "end": 640.14
    },
    {
        "text": " vamos a tratar de ver si podemos generar nuevas funciones matrices, ampliar las funciones",
        "start": 640.14,
        "end": 645.02
    },
    {
        "text": " matrices, por lo menos que vamos entendiendo, más allá después de ir al camino y la vida",
        "start": 645.02,
        "end": 650.9399999999999
    },
    {
        "text": " si algunos dedica eso o si alguno puede leer el texto de esta universidad lo que lograron",
        "start": 650.9399999999999,
        "end": 656.66
    },
    {
        "text": " esto y la relevancia que tiene a la hora de los computos, ahí desilla la emergencia artificial",
        "start": 656.66,
        "end": 664.06
    },
    {
        "text": " macuana en cuanto se explica, igual es una nota periodística, entonces hay que tomar",
        "start": 664.06,
        "end": 670.22
    },
    {
        "text": " con pinces, entonces acá a la hora de hacer el cálculo, ahí se las hacemos con la",
        "start": 670.22,
        "end": 677.78
    },
    {
        "text": " matrices original, los vamos a complicar la vida y entonces ahí aparece el truco que",
        "start": 677.78,
        "end": 684.5400000000001
    },
    {
        "text": " hemos hecho un montón de veces de sustituir, bien, a sustituir, ya este truco también lo",
        "start": 684.5400000000001,
        "end": 696.74
    },
    {
        "text": " hemos hecho un montón de veces, cuando se pega a ampera, la ampera con p se van porque",
        "start": 696.74,
        "end": 701.38
    },
    {
        "text": " queda la identidad, o sea que esto nos queda en límite, cuando emtiendan más infinito",
        "start": 701.38,
        "end": 707.1
    },
    {
        "text": " de p por conta sua a la m por ampera, a la m1, truco su parcencillos para nosotros pero",
        "start": 707.1,
        "end": 714.5600000000001
    },
    {
        "text": " que son en la clave para desarmar todo esto y ahora usando el item 3, cierto, sacamos",
        "start": 714.5600000000001,
        "end": 723.46
    },
    {
        "text": " para fuera la p y la p y la p y la m1, por el item 3, esto es p por el límite, cuando",
        "start": 723.46,
        "end": 732.34
    },
    {
        "text": " emtiene más infinito de j sua a la m por p a la m1, ¿qué quiere decir? No solamente",
        "start": 732.34,
        "end": 742.1800000000001
    },
    {
        "text": " dos cosas, ¿no? El comportamiento de a la m es el comportamiento de j sua a la m, o sea",
        "start": 742.1800000000001,
        "end": 747.94
    },
    {
        "text": " si aquí se hace comporta bien, este sabemos que alcularlo y se comporta bien, si este",
        "start": 747.94,
        "end": 752.02
    },
    {
        "text": " se comporta bien, el mismo pasamos, despejamos ¿no? Sabemos que podemos unitar que alcara por",
        "start": 752.02,
        "end": 757.3
    },
    {
        "text": " p a la m1 es una izquierda y por p a la derecha y despejamos, un comportamiento está dado por el",
        "start": 757.3,
        "end": 761.78
    },
    {
        "text": " otro, pero además de eso el cálculo también, o sea si vos sabes calcular acá, ¿cuánto da esto?",
        "start": 761.78,
        "end": 768.34
    },
    {
        "text": " Tanto, a tu y sabes cuánto da esto, tremendo de eso, no solamente el comportamiento,",
        "start": 768.34,
        "end": 772.38
    },
    {
        "text": " sino el cálculo exacto y por último y ahora es lo que viene en la clase de hoy, el j sua a la m",
        "start": 772.38,
        "end": 779.42
    },
    {
        "text": " lo vamos a ver, la escolar, maravilloso, este, porque en principio de esto te tienen con esto y,",
        "start": 779.42,
        "end": 787.18
    },
    {
        "text": " bueno, está, la computadora lo hará, pero está, entonces en particular por ejemplo,",
        "start": 787.18,
        "end": 795.38
    },
    {
        "text": " como observación intermedia es que la sucesión a la m está convergente, si solamente sí,",
        "start": 795.38,
        "end": 807.8
    },
    {
        "text": " la sucesión de potencia de j sua con ver, bien, siguiente truco que también estamos acostumbrado para",
        "start": 807.8,
        "end": 823.16
    },
    {
        "text": " seguir simplificando el cálculo, resulta, ahora ya sabemos que tenemos que dedicarnos a la",
        "start": 823.16,
        "end": 832.68
    },
    {
        "text": " matriz de lloran, pero nosotros sabemos que la matriz de lloran, se escribemos como su",
        "start": 832.68,
        "end": 838.4399999999999
    },
    {
        "text": " madireta de bloque de lloran, se acuerda eso, fundamental, o sea, j sua anda 1 más,",
        "start": 838.4399999999999,
        "end": 848.1999999999999
    },
    {
        "text": " ahí va, donde lo que hacemos habitualmente es que los landais son distintos, si los subindices son",
        "start": 848.2,
        "end": 864.24
    },
    {
        "text": " distintos, dividimos la matriz de lloran en sus bloque de lloran, bueno, porque ese truco nos",
        "start": 864.24,
        "end": 876.48
    },
    {
        "text": " ayuda muchísimo en montón de cuentas, ¿no verdad? Y además, ¿qué pasa, gurise? ¿Qué",
        "start": 876.48,
        "end": 886.0
    },
    {
        "text": " pasa con j sua a la m? Esto ya lo dijimos un par de veces, pero esta se que les cuesta,",
        "start": 886.0,
        "end": 891.4
    },
    {
        "text": " así que les doy tiempo para que la diga a ustedes.",
        "start": 892.9200000000001,
        "end": 895.28
    },
    {
        "text": " Termina siendo que lm trada 1 en su mundo, ¿no verdad? Cada uno trabaja en su mundo, esto es",
        "start": 895.28,
        "end": 911.48
    },
    {
        "text": " un trabajo, digamos, hablando en diagonal, no son diagonales, pero en el trabajo en diagonal,",
        "start": 913.64,
        "end": 920.9599999999999
    },
    {
        "text": " en el sentido de cada una trabaja por separada. Para, esto me interesa que ninguno de los que viene",
        "start": 920.96,
        "end": 931.24
    },
    {
        "text": " al clasas habitualmente que son lo que están acá, ¿qué de perdió? ¿Se acuerdan esto por qué?",
        "start": 931.24,
        "end": 937.52
    },
    {
        "text": " Si no hacemos la pausa, ese momento, que no les de ver buenza, no me acuerdo, dicen levanta la mano,",
        "start": 937.52,
        "end": 944.72
    },
    {
        "text": " pretende que subir el vídeo a eleva de cada uno de su cuadrado, lo que subí, lo subí de ese",
        "start": 951.2,
        "end": 957.0
    },
    {
        "text": " vídeo y los voy a ver el día del parcial de preguntar qué dice la letra en ese vídeo.",
        "start": 957.0,
        "end": 964.84
    },
    {
        "text": " Seguro que saben por qué se está, ¿no? Ya lo hemos clicado como 3 veces, pero no me importa",
        "start": 964.84,
        "end": 980.5600000000001
    },
    {
        "text": " que alguno diga, no sé, prefiero que ninguno que de perdió. Si go, seguro, bueno, entonces",
        "start": 980.5600000000001,
        "end": 991.24
    },
    {
        "text": " hecho esto resulta que para calcular a la m, tenemos que saber calcular j suela m, pero calcular",
        "start": 991.96,
        "end": 1000.38
    },
    {
        "text": " j suela m, necesitamos saber calcular cada una de estas y se termino, cada vez es más fácil. Y entonces",
        "start": 1000.38,
        "end": 1007.6
    },
    {
        "text": " ahora el trabajo está en calcular j a la m sublanda, pero con landa fijo, lo hago para uno",
        "start": 1007.6,
        "end": 1019.88
    },
    {
        "text": " cualquiera y eso no saben lo simple que queda ahora, porque cuando vos haces j, para calcular,",
        "start": 1019.88,
        "end": 1032.56
    },
    {
        "text": " este es el objetivo, ¿no? Pero tome el j suplanda y es landa a veces la identidad, vamos a escribirla,",
        "start": 1032.56,
        "end": 1042.56
    },
    {
        "text": " la j sublanda, vamos a exponerle de tamaño n, vamos a hacerla así, j subn de landa, está, este, el",
        "start": 1043.24,
        "end": 1061.0
    },
    {
        "text": " en el tamaño y el landa el valor propio, entonces cambió un poquito la notación, pero es que",
        "start": 1061.0,
        "end": 1071.6599999999999
    },
    {
        "text": " necesito esa nueva notación, me dejan cambiarlo un poquito, él hemos usado las dos en realidad,",
        "start": 1071.66,
        "end": 1076.3400000000001
    },
    {
        "text": " pero ahora necesito esta, j subn de landa n es el tamaño y landa el valor propio, entonces",
        "start": 1076.3400000000001,
        "end": 1087.1000000000001
    },
    {
        "text": " a ver, lo voy a dibujar para que nadie se pierda, landa 1, 0, 0, 0, landa 1, 0, 0, 0, 1, landa,",
        "start": 1087.1,
        "end": 1104.2199999999998
    },
    {
        "text": " y ya es 0, bien, n y n, n por n, digo porque las voy a hacer cuentas, entonces quiero hacer con",
        "start": 1104.22,
        "end": 1130.06
    },
    {
        "text": " detalle de esto para que nadie se me pierda las cuantas, entonces yo digo que esta matriz se",
        "start": 1130.06,
        "end": 1137.1
    },
    {
        "text": " puede escribir landa a veces la identidad, o sea le saco la diagonal, más una matriz n, que es la",
        "start": 1137.1,
        "end": 1144.1799999999998
    },
    {
        "text": " misma matriz que estuvimos jugando al comienzo de la clase pasada, quisimos alguna cuenta, se acuerdan,",
        "start": 1144.1799999999998,
        "end": 1149.46
    },
    {
        "text": " la llamamos n al comienzo de la clase pasada y juntos hicimos cuentas de cuánto valía en",
        "start": 1149.46,
        "end": 1156.1399999999999
    },
    {
        "text": " cuadrado, en el cubo, se acuerdan, que usted dice lo único que pasa a profit y se van corriendo",
        "start": 1156.14,
        "end": 1161.66
    },
    {
        "text": " en los 1's hacia la derecha, incluso me dijeron a ver si digo bien, jorríjame, n al n menos 1",
        "start": 1161.66,
        "end": 1170.46
    },
    {
        "text": " daba, todo 0, yo que pasé te vos, ¿no? Yo fue que pasé, yo fue que pasé, dijo, voy a poner",
        "start": 1170.46,
        "end": 1178.6200000000001
    },
    {
        "text": " un 0 grandón, te dijo, ¿y qué fue que pasé, que puso así, puso 1 y todo lo demás 0?",
        "start": 1178.62,
        "end": 1184.7399999999998
    },
    {
        "text": " Y está perfecta, ¿no? Se acuerda de todo, esta es la última que distinta de 0 y después",
        "start": 1184.7399999999998,
        "end": 1192.34
    },
    {
        "text": " ya viene a la n la base, ¿no? ¿Pagundo? ¿Pagundo?",
        "start": 1192.34,
        "end": 1200.3799999999999
    },
    {
        "text": " Estamos bien, entonces con eso ahora vamos a empezar a hacer cuenta, por ejemplo voy a hacer una",
        "start": 1200.38,
        "end": 1216.0200000000002
    },
    {
        "text": " que no me sirve para nada, pero para introducir la cosa, para empezar de a poquito, ¿qué pasa al",
        "start": 1216.0200000000002,
        "end": 1221.0200000000002
    },
    {
        "text": " cuadrado? Digo, me sirve para ir entrando un calor, le lebo al cuadrado, entonces al cuadrado es",
        "start": 1221.02,
        "end": 1231.02
    },
    {
        "text": " la onda, veces la entidad más n, al cuadrado, pero en vez de poner al cuadrado pongo de vuelta al",
        "start": 1231.02,
        "end": 1238.06
    },
    {
        "text": " paréntesis, porque me interesa que visualicen las cuentas, entonces la onda, veces la entidad por",
        "start": 1238.06,
        "end": 1248.3799999999999
    },
    {
        "text": " la onda, veces la entidad, ¿cuánto da? Bien, después cuando vas a la onda, veces la entidad por n,",
        "start": 1248.38,
        "end": 1256.0200000000002
    },
    {
        "text": " queda, la onda n, pero eso aparece dos veces ¿no verdad? ¿Cierto? Porque acá, importa del lado y la",
        "start": 1256.0200000000002,
        "end": 1266.98
    },
    {
        "text": " entidad por n, y por la entidad da n, ¿no verdad? Y entonces me quedo la onda cuadrado, veces la",
        "start": 1266.98,
        "end": 1272.3600000000001
    },
    {
        "text": " entidad más dos veces la onda la entidad por n, me dejan, me dejan, me dejan sacarla de la",
        "start": 1272.36,
        "end": 1282.36
    },
    {
        "text": " entidad del medio, puedo poner dos la onda n, total la entidad no dice nada, y más n cuadrado, ¿cierto?",
        "start": 1282.36,
        "end": 1292.36
    },
    {
        "text": " ¿Qué es lo que ha pasado ahí? El binomial al cuadrado, y por eso hicimos el repaso al comiso de la",
        "start": 1294.12,
        "end": 1300.4799999999998
    },
    {
        "text": " clase pasada del binomial de nudo en la n, se acuerda que jugamos con las combinaciones y todo eso,",
        "start": 1300.48,
        "end": 1305.64
    },
    {
        "text": " exactamente es lo que va a pasar, entonces lo tiramos al agua, vamos en el otro pizarrón,",
        "start": 1305.64,
        "end": 1312.24
    },
    {
        "text": " ya ahí de general,",
        "start": 1312.78,
        "end": 1316.28
    },
    {
        "text": " y ámbito.",
        "start": 1316.28,
        "end": 1327.04
    },
    {
        "text": " Ahora vamos a la m, j subn de lambda elevado de la m. ¿Quién se anima a decirme?",
        "start": 1327.04,
        "end": 1348.04
    },
    {
        "text": " Vamos por el lambda a vez en la entidad.",
        "start": 1348.04,
        "end": 1352.04
    },
    {
        "text": " Más en elevado de la m. ¿Cuánta nos va a dar?",
        "start": 1354.04,
        "end": 1360.04
    },
    {
        "text": " La m por la entidad. ¿Qué más? ¿Cién se termino?",
        "start": 1363.04,
        "end": 1370.04
    },
    {
        "text": " ¿Cómo está el lambda a la entidad? Es exacto. ¿Tigo?",
        "start": 1370.04,
        "end": 1377.04
    },
    {
        "text": " Perfecto. Acá como que estamos haciendo eso a aparecer el identidad cuadrado, ¿no?",
        "start": 1383.04,
        "end": 1388.04
    },
    {
        "text": " ¿Sería el lambda cuadrado? De identidad cuadrado. Un término va subiendo y el otro va bajando.",
        "start": 1388.04,
        "end": 1393.04
    },
    {
        "text": " Más combinaciones de m en el menos 1, lambda a la m menos 1 por n. ¿Está bien?",
        "start": 1393.04,
        "end": 1407.04
    },
    {
        "text": " Más combinaciones de m en m, lambda a la m por la entidad.",
        "start": 1407.04,
        "end": 1413.04
    },
    {
        "text": " O sea, acá un identidad tengo que dejar porque si no queda un lambda a la m. ¿No?",
        "start": 1413.04,
        "end": 1420.04
    },
    {
        "text": " No, hice mal. No, no, no, no.",
        "start": 1421.04,
        "end": 1426.04
    },
    {
        "text": " Acá, empezamos subiendo la m y bajando el otro.",
        "start": 1426.04,
        "end": 1431.04
    },
    {
        "text": " Entonces, acá el lambda a la m menos 1, vamos ahí bajando el m y subiendo el otro.",
        "start": 1431.04,
        "end": 1437.04
    },
    {
        "text": " Se puede hacer de la dos maneras, pero una u otra y yo mezcle las dos.",
        "start": 1437.04,
        "end": 1441.04
    },
    {
        "text": " Entonces, lambda a la m, lambda a la m menos 1, n, lambda a la m menos 2, n al cuadrado,",
        "start": 1441.04,
        "end": 1448.04
    },
    {
        "text": " lambda a una sola lambda, n a la m menos 1, sin lambda a la m.",
        "start": 1448.04,
        "end": 1459.04
    },
    {
        "text": " Este último, si quieren les sacan el combinaciones de m, n también, porque eso vale 1.",
        "start": 1459.04,
        "end": 1465.04
    },
    {
        "text": " Me le permiten sacarlo del pizarro.",
        "start": 1465.04,
        "end": 1470.04
    },
    {
        "text": " Entonces, queda n al n. ¿Para qué quiere igual que este?",
        "start": 1471.04,
        "end": 1475.04
    },
    {
        "text": " Uno queda simétrico. Bueno, bien.",
        "start": 1475.04,
        "end": 1482.04
    },
    {
        "text": " Y la única discusión que tenemos que hacer ahora es este lm, este ponente.",
        "start": 1484.04,
        "end": 1492.04
    },
    {
        "text": " Y tiene que ver con el ajuste de me dijeron con esto la discusión.",
        "start": 1492.04,
        "end": 1496.04
    },
    {
        "text": " Porque resulta que después que este pasas de n, n el exponente, n ya da cero.",
        "start": 1497.04,
        "end": 1504.04
    },
    {
        "text": " Entonces, lo único discusión es que si m es mayor o menor que n.",
        "start": 1504.04,
        "end": 1509.04
    },
    {
        "text": " Ahora qué pasa, no sé lo que nos interesa, el comportamiento, el límite.",
        "start": 1509.04,
        "end": 1514.04
    },
    {
        "text": " Entonces, en vez de andar discutiendo, supongamos m mayor que n, mayor igual que n,",
        "start": 1514.04,
        "end": 1525.04
    },
    {
        "text": " para que la cuenta ya quede escrita de una sola manera, no?",
        "start": 1526.04,
        "end": 1531.04
    },
    {
        "text": " La discutiendo, si no. Total, el límite se va para más infinito.",
        "start": 1531.04,
        "end": 1534.04
    },
    {
        "text": " Y el n, recurirse está fijo, el n rojo está fijo.",
        "start": 1534.04,
        "end": 1538.04
    },
    {
        "text": " Es muy importante, está fijo ese n.",
        "start": 1538.04,
        "end": 1541.04
    },
    {
        "text": " El tamaño de la matriz, si justo después en un texto, un ejercicio, el exponente pasa a ser n,",
        "start": 1541.04,
        "end": 1547.04
    },
    {
        "text": " bueno, lo que está fijo es el tamaño de la matriz.",
        "start": 1547.04,
        "end": 1551.04
    },
    {
        "text": " Entonces supongamos que ya estamos por arriba de n.",
        "start": 1552.04,
        "end": 1556.04
    },
    {
        "text": " Entonces, ¿cuánto dajo tu subn lambda a la n?",
        "start": 1556.04,
        "end": 1562.04
    },
    {
        "text": " Lo que va a pasar es que cuando vaya avanzando acá, lo pongo acá en azul esto.",
        "start": 1562.04,
        "end": 1569.04
    },
    {
        "text": " Claro, ¿qué pasa?",
        "start": 1572.04,
        "end": 1574.04
    },
    {
        "text": " Si m es mayor igual que n, vas avanzando, vas subiendo el exponente de la n",
        "start": 1574.04,
        "end": 1579.04
    },
    {
        "text": " y por acá en algún momento, ¿dónde por dónde sigas?",
        "start": 1579.04,
        "end": 1584.04
    },
    {
        "text": " Al combinaciones de m, tomada n menos 1, lambda a la m menos n,",
        "start": 1584.04,
        "end": 1593.04
    },
    {
        "text": " menos n, más 1,",
        "start": 1593.04,
        "end": 1596.04
    },
    {
        "text": " y la siguiente que va a pasar más 0, más 0,",
        "start": 1596.04,
        "end": 1619.04
    },
    {
        "text": " se entiende por que ya está n en la n, la n más 1, en el n más 2.",
        "start": 1619.04,
        "end": 1625.04
    },
    {
        "text": " Si se entiende, quiere decir que el último va a hacer esto.",
        "start": 1625.04,
        "end": 1630.04
    },
    {
        "text": " Dicho esto en el dibujito, o sea, si quieren, podemos escribir acá.",
        "start": 1630.04,
        "end": 1637.04
    },
    {
        "text": " Esto nos queda igual porque alguien me pidió hacerle en su matória, alguien dijo hace un plato.",
        "start": 1637.04,
        "end": 1643.04
    },
    {
        "text": " Yo escribió como su matória de combinaciones de m, tomadas de i,",
        "start": 1643.04,
        "end": 1650.04
    },
    {
        "text": " lambda a la m menos y por n a la i, vamos a ver, de igual 0, arrancó con 0",
        "start": 1650.04,
        "end": 1662.04
    },
    {
        "text": " y segua hasta el momento n menos 1, porque ya n a la n, 0.",
        "start": 1662.04,
        "end": 1670.04
    },
    {
        "text": " ¿De acuerdo?",
        "start": 1670.04,
        "end": 1674.04
    },
    {
        "text": " Ojo, si alguien pone, mira el pizarrón, borro y borro, doves lo mismo,",
        "start": 1674.04,
        "end": 1679.04
    },
    {
        "text": " mira el pizarrón, si alguien me pone así, esto no está mal,",
        "start": 1679.04,
        "end": 1683.04
    },
    {
        "text": " sólo hay montón de sumando que son los últimos que son cero,",
        "start": 1683.04,
        "end": 1687.04
    },
    {
        "text": " entonces esto está correcto al poner el n,",
        "start": 1687.04,
        "end": 1691.04
    },
    {
        "text": " sólo que nosotros somos más finos y gimos hasta n menos 1 y después el resto de hacer.",
        "start": 1691.04,
        "end": 1696.04
    },
    {
        "text": " ¿Cómo queda el dibujito en la matriz que aparece en el texto y me parece muy interesante dibujar?",
        "start": 1696.04,
        "end": 1704.04
    },
    {
        "text": " Bueno, queda, en la diagonal, grises, mejor la primera expresión para que lo vean.",
        "start": 1704.04,
        "end": 1710.04
    },
    {
        "text": " Acá está perfecta en su matória, pero si visualiza mejor, acá no, ¿verdad?",
        "start": 1710.04,
        "end": 1715.04
    },
    {
        "text": " En la que me dijeron ustedes al principio, toda desarrollada.",
        "start": 1715.04,
        "end": 1719.04
    },
    {
        "text": " En la diagonal, lambda la m, ¿no?",
        "start": 1719.04,
        "end": 1726.04
    },
    {
        "text": " Bueno, por supuesto acá, son todos cero.",
        "start": 1726.04,
        "end": 1731.04
    },
    {
        "text": " En la diagonal lambda la m, ¿sí?",
        "start": 1731.04,
        "end": 1735.04
    },
    {
        "text": " Porque la única que tiene, usted me dice que cuando aparece n,",
        "start": 1735.04,
        "end": 1739.04
    },
    {
        "text": " ya aparece digamos, bueno, es lambda por n, n es esta, no tiene nada,",
        "start": 1739.04,
        "end": 1744.04
    },
    {
        "text": " n es, no la dibujamos, final de n.",
        "start": 1744.04,
        "end": 1748.04
    },
    {
        "text": " n era la misma que la de Jordan, pero sin 1,",
        "start": 1748.04,
        "end": 1756.04
    },
    {
        "text": " está sin, ¿no?",
        "start": 1764.04,
        "end": 1766.04
    },
    {
        "text": " Entonces, n y n, cuadrado, ustedes le hicieron juntos en el pizarro en el comísero de la clase pasada.",
        "start": 1766.04,
        "end": 1772.04
    },
    {
        "text": " Cada vez los suelen se van displazando más hacia arriba hasta que siga",
        "start": 1772.04,
        "end": 1775.04
    },
    {
        "text": " en el n y n es 1, que tiene solo 1, ¿no? ¿no? ¿no?",
        "start": 1775.04,
        "end": 1778.04
    },
    {
        "text": " Ahora, entonces, la única que tiene diagonal es esta, lambda la m. ¿Qué viene después?",
        "start": 1778.04,
        "end": 1786.04
    },
    {
        "text": " Claro, exactamente, entonces acá pongo combinaciones de m y 2,",
        "start": 1788.04,
        "end": 1796.04
    },
    {
        "text": " mét Sawì y la emitted Rosie de 1, pearcuía de 1,",
        "start": 1796.04,
        "end": 1799.04
    },
    {
        "text": " el congreso de m es 1 y la amounta de 1 de ros light,",
        "start": 1799.04,
        "end": 1803.04
    },
    {
        "text": " del timer, a laüyena este para psyche happy,",
        "start": 1803.04,
        "end": 1806.04
    },
    {
        "text": " el sombrose grenades es una participated совет ¿no пойд?",
        "start": 1806.04,
        "end": 1809.04
    },
    {
        "text": " Bueno, losettes r送an más baño para dar que surta dis water.",
        "start": 1809.04,
        "end": 1813.04
    },
    {
        "text": " Y una vez esto que parle deices de esta coaliencia es una dolg peppers,",
        "start": 1813.04,
        "end": 1817.04
    },
    {
        "text": " que son",
        "start": 1817.04,
        "end": 1820.04
    },
    {
        "text": " un pulno personal, algo que se regrezca cosas,",
        "start": 1821.04,
        "end": 1824.04
    },
    {
        "text": " Esta es la partenera, mía, mía que didáctico que está viendo. Combinaciones de de",
        "start": 1824.04,
        "end": 1831.04
    },
    {
        "text": " de 1 por lambda en el m menos 1. Combinaciones de de 1 por lambda en el m. Esta viene por esta.",
        "start": 1831.04,
        "end": 1843.04
    },
    {
        "text": " ¿Cierto? Después vendría la siguiente que ustedes me dijeron, la verde, podemos la verde",
        "start": 1843.04,
        "end": 1850.04
    },
    {
        "text": " sería combinaciones de de 2 por lambda a la m menos 2.",
        "start": 1851.04,
        "end": 1857.04
    },
    {
        "text": " Más allá que los dibujos no quedan muy bonitas, que quedan medio brotesco los dibujos, que ha sido",
        "start": 1862.04,
        "end": 1868.04
    },
    {
        "text": " un poco más en el computador. ¿Cierto? Y por último, si había un colorcito más que teníamos",
        "start": 1868.04,
        "end": 1875.04
    },
    {
        "text": " una rangita, acá está en la rangita para este muchacho. Este es el último.",
        "start": 1875.04,
        "end": 1885.04
    },
    {
        "text": " Podríamos bajar azul, ¿no? Porque el azul no lo usamos. El azul es el último que aparece",
        "start": 1885.04,
        "end": 1899.04
    },
    {
        "text": " vivo, te haría por acá en este ángulo combinaciones de m en el m menos 1, lambda en la m menos",
        "start": 1899.04,
        "end": 1909.04
    },
    {
        "text": " 1. Este último, si, es este combinaciones de m, tomar en el m menos 1 por lambda a la m menos",
        "start": 1909.04,
        "end": 1922.04
    },
    {
        "text": " n más 1. O sea, lo que está haciendo, acá hay un montón, ¿perón? Acá faltan términos,",
        "start": 1922.04,
        "end": 1931.04
    },
    {
        "text": " ¿no? Punto su pensivo, ¿no? Es entonces estos términos que dan acá el medio, ¿no? Está",
        "start": 1931.04,
        "end": 1937.04
    },
    {
        "text": " bien. Bueno, parece complicado, pero lo que amalculamos es brutal lo que estamos habiendo",
        "start": 1937.04,
        "end": 1946.04
    },
    {
        "text": " hacer. O sea, no sé si usted se está dando cuenta. Voy a agarrarse una matriz, le calcula",
        "start": 1946.04,
        "end": 1953.04
    },
    {
        "text": " la forma de sorda, ya sabes cuánto va a dar a la m y solamente lo que tienes que hacer es volver",
        "start": 1953.04,
        "end": 1959.04
    },
    {
        "text": " a multiplicar parte. Ni siquiera tienes que hacer el cálculo, ya sabéis lo que va a dar",
        "start": 1959.04,
        "end": 1966.04
    },
    {
        "text": " y después las multiplicas por p y pelas m y no, o sea, si quieres volver atrás, perdón,",
        "start": 1966.04,
        "end": 1970.04
    },
    {
        "text": " lo que tienes que hacer depende de que lado crecesa la cuenta por p y pelas m y no, por",
        "start": 1970.04,
        "end": 1975.36
    },
    {
        "text": " pelas m y no, por pelas m y no, te acabaron para la computadora, eso es una trivialidad,",
        "start": 1975.36,
        "end": 1981.04
    },
    {
        "text": " ya sabes cuánto va a dar multiplicas por p y pelas m y se terminó. Es brutal la aplicación",
        "start": 1981.04,
        "end": 1989.04
    },
    {
        "text": " de teoría en este caso. Muy bien. Está claro que esto que hicimos en el bloque lambda",
        "start": 1989.04,
        "end": 2003.04
    },
    {
        "text": " fijo lo tienen que hacer en cada bloque, ¿no? ¿no? Para lambda 1, para lambda 2, para lambda",
        "start": 2003.04,
        "end": 2009.04
    },
    {
        "text": " R. Poden haber mucho valores propios distintos. Lo dijimos antes, es buen momento para calcar",
        "start": 2009.04,
        "end": 2016.04
    },
    {
        "text": " lo que nos me olvide, hay que hago con nosotros valores propios, en todo tengo que hacerlo",
        "start": 2016.04,
        "end": 2020.04
    },
    {
        "text": " mismo. Bueno acá puse una pausa de un ejemplo, pero en vez de dejar la pausa le dijo como",
        "start": 2020.04,
        "end": 2038.04
    },
    {
        "text": " ejercicio y ustedes los hacen en casa, dejen el cuadernito, un poco de espacio, entonces",
        "start": 2038.04,
        "end": 2044.04
    },
    {
        "text": " el ejemplo ejercicio, es simplemente hacerlo todo esto, pero para una matriz 4 por 4,",
        "start": 2044.04,
        "end": 2059.04
    },
    {
        "text": " perdón, más chica, 3 por 3, 2, menos 1, 1, 1, 5, menos 2, 0, 1, 2, y lo que le pido es",
        "start": 2059.04,
        "end": 2077.04
    },
    {
        "text": " calcular a la 4. Calculen lo de esta manera, más es que sea de que, o sea primero calculen",
        "start": 2077.04,
        "end": 2092.04
    },
    {
        "text": " cuáles son los valores propios, le calculan pepe, la menos 1, yo sé que en este caso no estamos",
        "start": 2092.04,
        "end": 2099.04
    },
    {
        "text": " ganando mucho, capaz que más fácil hacer a la 4 directamente que andaran haciendo todo el proceso,",
        "start": 2099.04,
        "end": 2104.04
    },
    {
        "text": " pero que quiero que lo practic, de hecho tiene solo un valor propio, va a tener una matriz",
        "start": 2104.04,
        "end": 2110.04
    },
    {
        "text": " y se ordena asociada, que es una 3 por 3 por supuesto, con el valor propio, creo que",
        "start": 2110.04,
        "end": 2118.04
    },
    {
        "text": " teníamos solo valor propio, sí, solo valor propio, este, través del mismo valor propio,",
        "start": 2118.04,
        "end": 2125.04
    },
    {
        "text": " digamos la diagonal, entonces tienen que calcular como ese bloque de se orden, si es 2 más",
        "start": 2125.04,
        "end": 2133.04
    },
    {
        "text": " 1, si es 1, 1, 1 entero de 3 o 3 de 1, hacen eso y quiero que aparezcan estos termines,",
        "start": 2133.04,
        "end": 2142.04
    },
    {
        "text": " el 4 está para que vean que el 4 más grande que 3, el m es más grande que lm,",
        "start": 2142.04,
        "end": 2151.04
    },
    {
        "text": " para que aparezca exactamente este diagonal, ¿sabes? y lo hacen, es una práctica para entender",
        "start": 2151.04,
        "end": 2158.04
    },
    {
        "text": " bien el procedimiento, muy bien, entonces, proposición, ahora parece, empezamos a recoger resultados,",
        "start": 2158.04,
        "end": 2172.04
    },
    {
        "text": " estas proposiciones que vienen ahora, la proposición y el teorema para nosotros a partir",
        "start": 2172.04,
        "end": 2180.04
    },
    {
        "text": " de lo que hicimos en trivialidades, así que lo que estás escribiendo, sin embargo,",
        "start": 2180.04,
        "end": 2185.04
    },
    {
        "text": " desde la perspectiva futura de la aplicación, tanto en economía o tería de grafón,",
        "start": 2185.04,
        "end": 2190.04
    },
    {
        "text": " la van a usar directos, las chupan así directos, los resultados, y dicen,",
        "start": 2190.04,
        "end": 2196.04
    },
    {
        "text": " esto se aplica directos, esto se aplica directos en economía, los vamos a escribir ahora,",
        "start": 2196.04,
        "end": 2200.04
    },
    {
        "text": " o sea, llegaremos en su momento hacerlo, pero digamos, son piedras que van a aparecer exactamente",
        "start": 2200.04,
        "end": 2206.04
    },
    {
        "text": " del mismo color, directamente la van a aprovechar, la proposición siguiente y el teorema.",
        "start": 2206.04,
        "end": 2215.04
    },
    {
        "text": " En donde estamos? Nosotros estamos haciendo todas estas cuentas porque queremos calcular el límite de lm,",
        "start": 2216.04,
        "end": 2239.04
    },
    {
        "text": " y ya dijimos que para calcular el límite de lm lo que necesitamos es calcular el límite de j sualm,",
        "start": 2239.04,
        "end": 2246.04
    },
    {
        "text": " entonces, hecha las cuentas, ya sabemos de las cuentas, estamos pronto para saber cuándo converge y cuándo no,",
        "start": 2246.04,
        "end": 2256.04
    },
    {
        "text": " e incluso para saber cuándo converas. Entonces, lo que dice la proposición, parte a,",
        "start": 2256.04,
        "end": 2267.04
    },
    {
        "text": " estoy, si no pongo hipótesis en la proposición, porque estoy en las hipótesis de la clase de hoy,",
        "start": 2267.04,
        "end": 2272.04
    },
    {
        "text": " o sea, una matriz a su formación o la de la setraza, ¿sabás?",
        "start": 2272.04,
        "end": 2277.04
    },
    {
        "text": " Y estamos por último, la proposición es trabajando con un jota sublanda y la anda fijo,",
        "start": 2277.04,
        "end": 2283.04
    },
    {
        "text": " estamos en el último caso que se vamos a analizar, esto, vamos a aprovechar esto, con la anda fijo,",
        "start": 2283.04,
        "end": 2289.04
    },
    {
        "text": " un bloque, después vamos a ver qué pasa con muchos bloques, entonces, dice así,",
        "start": 2289.04,
        "end": 2296.04
    },
    {
        "text": " si el módulo o norma de anda es menor que uno, entonces, yo no voy a escribir el resultado de la parte a,",
        "start": 2296.04,
        "end": 2313.04
    },
    {
        "text": " pero para nosotros les gusta la parte a la de porque lo escribamos, casi no necesita demostración,",
        "start": 2314.04,
        "end": 2320.04
    },
    {
        "text": " porque fue lo que hicimos al comienzo del repaso a dos, creo que se llamó,",
        "start": 2320.04,
        "end": 2327.04
    },
    {
        "text": " ¿de acuerdo que fue a uno, a dos? O, no me acuerdo bien, fue bien el comienzo de la clase pasada,",
        "start": 2327.04,
        "end": 2334.04
    },
    {
        "text": " hicimos repaso de potencias y cosas de esa límite, hicimos juntos,",
        "start": 2334.04,
        "end": 2338.04
    },
    {
        "text": " analizamos la dios de convergencia en el plano, etcétera, entonces yo me estoy preguntando, ¿qué pasa con este proceso cuando m tiene más infinito?",
        "start": 2338.04,
        "end": 2349.04
    },
    {
        "text": " Pero la cuenta ya está hecha, está acá, ¿qué pasa con esta cuenta cuando m tiene más infinito?",
        "start": 2349.04,
        "end": 2356.04
    },
    {
        "text": " Converge o no converge, si converge converge a matriz nula, pero además cuando converge,",
        "start": 2356.04,
        "end": 2364.04
    },
    {
        "text": " hay un caso que no, hay un solo caso que converge a otro tipo de matriz, pero veamos, ¿qué pasa si la norma de anda es menor que uno?",
        "start": 2365.04,
        "end": 2376.04
    },
    {
        "text": " ¿qué dijimos que pasaba? Vienen la diagonal, acero, eso lo analizamos juntos, tanto si es real o complejo, ¿no?",
        "start": 2376.04,
        "end": 2386.04
    },
    {
        "text": " Vamos a la roja, por la duda, vamos de a poco, a la roja, ¿por qué te quedamos dedicado por m?",
        "start": 2387.04,
        "end": 2397.04
    },
    {
        "text": " Pero m tiene más infinito, lambda la m-1, ¿quién ganaba?",
        "start": 2397.04,
        "end": 2402.04
    },
    {
        "text": " El lambda la m-1, ¿se acuerdas que lo analizamos juntos?",
        "start": 2402.04,
        "end": 2405.04
    },
    {
        "text": " Bueno, ¿y se acuerdas que analizamos que en realidad se valía para cualquier polinomio en m?",
        "start": 2405.04,
        "end": 2410.04
    },
    {
        "text": " Entonces todos estos términos, el rojo, los verdes, el azul, todos esos tienden a 0 cuando la norma de anda es menor que uno.",
        "start": 2411.04,
        "end": 2421.04
    },
    {
        "text": " Eso fue la parte del repaso del comienzo de la clase pasada, ¿y eso es lo que dice?",
        "start": 2421.04,
        "end": 2425.04
    },
    {
        "text": " La norma de anda es menor que uno, entonces, lo dice un poquito más general, nada más, para cualquier polinomio,",
        "start": 2426.04,
        "end": 2440.04
    },
    {
        "text": " cualquier polinomio que tome es cualquiera, pero polinomio, el límite, cuando ese tiende a más infinito, de pdc,",
        "start": 2440.04,
        "end": 2452.04
    },
    {
        "text": " por j suene de lambda, a la ssc.",
        "start": 2453.04,
        "end": 2457.04
    },
    {
        "text": " También la m por s, porque la m es de no, nos sirvió para hacer las cuentas, hasta todo bien.",
        "start": 2462.04,
        "end": 2468.04
    },
    {
        "text": " También la m por s, pero es lo mismo.",
        "start": 2468.04,
        "end": 2471.04
    },
    {
        "text": " Y el polinomio, ¿qué es? Dice que agarro cualquier polinomio que agarre y lo multipliques,",
        "start": 2471.04,
        "end": 2477.04
    },
    {
        "text": " si no está, ese es el análisis que hicimos juntos.",
        "start": 2478.04,
        "end": 2481.04
    },
    {
        "text": " Pero además, si está ahí, digamos, cualquier polinomio no cambia el comportamiento porque hay un choque entre límites,",
        "start": 2481.04,
        "end": 2488.04
    },
    {
        "text": " es ponencial que tiende a 0 y el otro potencial que quiere irse a más infinito o menos infinito, de teniendo el polinomio,",
        "start": 2488.04,
        "end": 2495.04
    },
    {
        "text": " de estar más logrado, si es un negativo positivo, pero en todo caso ese es un potencial contra un exponencial",
        "start": 2495.04,
        "end": 2502.04
    },
    {
        "text": " y fue lo que dedicamos un buen rato al comienzo de la clase pasada, comparar y entender,",
        "start": 2502.04,
        "end": 2507.04
    },
    {
        "text": " que ganaba el exponencial y en este caso el exponencial tiende a 0.",
        "start": 2507.04,
        "end": 2513.04
    },
    {
        "text": " Entonces, ese es el resultado, nos tenemos ni queremos mostrar,",
        "start": 2513.04,
        "end": 2517.04
    },
    {
        "text": " porque acá está la razón central de por qué todos los términos tienden a 0 y si lo multiplica por T a la 8",
        "start": 2517.04,
        "end": 2527.04
    },
    {
        "text": " y si que me da igual, ese a la 8 y si lo multiplica por T a la 32 me da igual,",
        "start": 2527.04,
        "end": 2532.04
    },
    {
        "text": " porque ese a la 32 comparar con un exponencial de 0, se entiende en este límite 0.",
        "start": 2532.04,
        "end": 2539.04
    },
    {
        "text": " Lo pone general porque después lo va a aprovechar así, digamos,",
        "start": 2539.04,
        "end": 2543.04
    },
    {
        "text": " que se puede murir que a por cualquier polinomio le cambia el comportamiento.",
        "start": 2543.04,
        "end": 2547.04
    },
    {
        "text": " Está bien, esa parte ni siquiera le tenemos que montar muy salísimo, vamos a la parte B.",
        "start": 2550.04,
        "end": 2555.04
    },
    {
        "text": " ¿Y capas que sí en algún momento puedo usar el característico?",
        "start": 2556.04,
        "end": 2565.04
    },
    {
        "text": " Este parte B es así, acá parece, claro, y importante destacar lo que dijo hoy Nicolás",
        "start": 2565.04,
        "end": 2575.04
    },
    {
        "text": " y quiero destacar lo nuestro hiviare el límite 0, o sea ¿qué es 0?",
        "start": 2575.04,
        "end": 2581.04
    },
    {
        "text": " ¿El amatriz nula? Todos los muchachos tienden a 0, entonces tienden la amatriz nula.",
        "start": 2582.04,
        "end": 2587.04
    },
    {
        "text": " O sea que fíjense lo que está pasando, que si existe el límite 0.",
        "start": 2589.04,
        "end": 2593.04
    },
    {
        "text": " Está, en general, si no lo te va a existir el límite,",
        "start": 2595.04,
        "end": 2599.04
    },
    {
        "text": " ya queda un comportamiento bastante claro de lo que está pasando.",
        "start": 2599.04,
        "end": 2602.04
    },
    {
        "text": " Hay un caso que no, porque acá es para la onda modulo menor que 1.",
        "start": 2602.04,
        "end": 2608.04
    },
    {
        "text": " Antes de pasar a la parte B, ¿qué pasa si el...",
        "start": 2609.04,
        "end": 2614.04
    },
    {
        "text": " la parte B se mete con otro caso, ¿no? En el caso módulo del am de igual 1.",
        "start": 2614.04,
        "end": 2619.04
    },
    {
        "text": " ¿No lo qué pasa si el módulo del am das mayor que 1?",
        "start": 2619.04,
        "end": 2622.04
    },
    {
        "text": " Digo, no va a aparecer en la proposición porque pasa algo muy claro, ¿qué es lo que sucede?",
        "start": 2622.04,
        "end": 2627.04
    },
    {
        "text": " Si el módulo del am das mayor que 1.",
        "start": 2627.04,
        "end": 2629.04
    },
    {
        "text": " Tiene infinito, ya la diagonal.",
        "start": 2630.04,
        "end": 2632.04
    },
    {
        "text": " Y si se la dió una ct va, no hay forma de agarrar la matriz.",
        "start": 2633.04,
        "end": 2636.04
    },
    {
        "text": " No verdad, porque para que converja, teniendo y converger todos los elementos de la matriz. ¿Seguardan?",
        "start": 2636.04,
        "end": 2641.04
    },
    {
        "text": " Entonces si la onda es mayor que 1, el valor absoluto, si es en los reales o el módulo, si es en los complejos,",
        "start": 2641.04,
        "end": 2647.04
    },
    {
        "text": " se la dió una ct capo.",
        "start": 2647.04,
        "end": 2649.04
    },
    {
        "text": " Queda claro eso, porque no podemos permitir el módulo mayor que 1.",
        "start": 2649.04,
        "end": 2653.04
    },
    {
        "text": " Y entonces, ¿qué nos queda analizar?",
        "start": 2653.04,
        "end": 2655.04
    },
    {
        "text": " El módulo 1. Bien.",
        "start": 2655.04,
        "end": 2657.04
    },
    {
        "text": " Y la parte B en la demostración cita que vamos a hacer se mete con ese caso en módulo 1.",
        "start": 2663.04,
        "end": 2669.04
    },
    {
        "text": " La parte B dice así, en límite existe, si solo sí.",
        "start": 2669.04,
        "end": 2688.04
    },
    {
        "text": " Y en realidad en vez de escribir la segunda parte, o sea, cuando es que existe escribilo al detalle a que a la derecha",
        "start": 2688.04,
        "end": 2700.04
    },
    {
        "text": " lo que vamos a hacer es analizarmos juntos y terminamos escribiendo resultados. ¿Es parece?",
        "start": 2700.04,
        "end": 2705.04
    },
    {
        "text": " En vez de demostrar el sí solo sí, analicemos juntos.",
        "start": 2705.04,
        "end": 2709.04
    },
    {
        "text": " Primero detalle, acá no está multiplicado por ningún polinomio, acá se analiza la matriz sola.",
        "start": 2709.04,
        "end": 2715.04
    },
    {
        "text": " Cuando existe el límite, ¿sabes?",
        "start": 2716.04,
        "end": 2719.04
    },
    {
        "text": " Bueno, está clarísimo, analicemos juntos acá.",
        "start": 2719.04,
        "end": 2723.04
    },
    {
        "text": " Está clarísimo que si el módulo de lambda es menor que 1, existe, porque es el caso A con el polinomio 1.",
        "start": 2723.04,
        "end": 2732.04
    },
    {
        "text": " Utilicando por 1.",
        "start": 2732.04,
        "end": 2735.04
    },
    {
        "text": " ¿Cierto?",
        "start": 2735.04,
        "end": 2737.04
    },
    {
        "text": " Está clarísimo, me dijeron ustedes que si el módulo de lambda es mayor que 1, no existe.",
        "start": 2737.04,
        "end": 2744.04
    },
    {
        "text": " ¿Por qué? Escribanlo, porque en la diagonal se va al infinito.",
        "start": 2744.04,
        "end": 2750.04
    },
    {
        "text": " El módulo de los elementos de la diagonal en módulo se van al infinito, tanto se han reales o complejos, el módulo se van al infinito.",
        "start": 2750.04,
        "end": 2757.04
    },
    {
        "text": " Entonces, no converge. ¿Quién nos queda?",
        "start": 2757.04,
        "end": 2761.04
    },
    {
        "text": " Nos queda el caso módulo de lambda igual 1.",
        "start": 2761.04,
        "end": 2767.04
    },
    {
        "text": " Y esto lo hicimos juntos también.",
        "start": 2768.04,
        "end": 2771.04
    },
    {
        "text": " Lo hicimos juntos, tanto fuera la lambda real o complejo.",
        "start": 2771.04,
        "end": 2774.04
    },
    {
        "text": " Miren la diagonal, lambda la m, por ejemplo, ¿no? ¿Qué pasaba con lambda la m cuando se acuerdan?",
        "start": 2774.04,
        "end": 2782.04
    },
    {
        "text": " Lo miramos la circunferencia de radio 1 en los complejos. ¿Qué pasaba con el lambda la m en general?",
        "start": 2782.04,
        "end": 2789.04
    },
    {
        "text": " ¿Y va? ¿Se acuerdan? Rotando. ¿Y va rotando? Rotando, rotando, rotando, rotando, rotando.",
        "start": 2789.04,
        "end": 2796.04
    },
    {
        "text": " Entonces, ¿convergía? No. Ni siquiera para menos 1, cuando justo estabas en la recta real, porque menos 1, 1, 1, 1, 1, 1, 1.",
        "start": 2796.04,
        "end": 2807.04
    },
    {
        "text": " Ocía, ¿no verdad? ¿Cuál es el único caso que converge?",
        "start": 2807.04,
        "end": 2812.04
    },
    {
        "text": " ¿La lambda igual 1? ¿Eh? La lambda igual 1. La lambda igual 1 es el único que tiene chance mirando la diagonal.",
        "start": 2813.04,
        "end": 2821.04
    },
    {
        "text": " Después tenemos que mirar los demás términos. Entonces, ¿qué pasa?",
        "start": 2821.04,
        "end": 2824.04
    },
    {
        "text": " Si el módulo de lambda 1, que es menor que 1, ya sabemos, mayor que 1, ya sabemos, el módulo de lambda 1,",
        "start": 2824.04,
        "end": 2832.04
    },
    {
        "text": " no existe límite excepto, acá es si la lambda y 5 de 1 y nos queda solo para analizar que pasa con la lambda igual 1,",
        "start": 2833.04,
        "end": 2846.04
    },
    {
        "text": " que no lo concluimos todavía. Ay, está. ¿Fuerte decirle Santiago?",
        "start": 2846.04,
        "end": 2853.04
    },
    {
        "text": " La combinación al infinito. La combinación de la roja, la verde, las azules se van al infinito.",
        "start": 2853.04,
        "end": 2858.04
    },
    {
        "text": " Mira las rojas. Si el lambda 1, el lambda se te fue, ¿no verdad?",
        "start": 2859.04,
        "end": 2864.04
    },
    {
        "text": " Solo te queda m, m, m, m, m, m, pero el m es el que acasi llama ese de este lado y se va al infinito.",
        "start": 2864.04,
        "end": 2872.04
    },
    {
        "text": " ¿Cuál es la única chance para que no se vaya al infinito?",
        "start": 2872.04,
        "end": 2877.04
    },
    {
        "text": " Que no haya roja, que no haya azul y que no haya verde. ¿Cuál es la única chance?",
        "start": 2880.04,
        "end": 2884.04
    },
    {
        "text": " N, N, el tamaño 1, o sea, no existe límite, acá vamos a poner, no existe límite en general y solamente existe límite cuando la n igual 1 y n igual a 1,",
        "start": 2884.04,
        "end": 2907.04
    },
    {
        "text": " o sea, la realidad no tiene escasina matrista, en eso es número, que es el número 1, 1 por 1.",
        "start": 2907.04,
        "end": 2912.04
    },
    {
        "text": " Dicho diferente. El libro lo dice un poquito diferente, si lo van a ver, el libro dice un poquito diferente.",
        "start": 2918.04,
        "end": 2924.04
    },
    {
        "text": " Acá lo que vamos a poner es, existe límite, como acá es la existencia, si solamente si el módulo de lambda es menor que 1, que es un caso muy importante, es el más importante o queda un casito de lambda igual 1 y n igual.",
        "start": 2925.04,
        "end": 2944.04
    },
    {
        "text": " Hay muchas cosas que nos escribí, pero que las fuimos diciendo todas, por ejemplo, escriban por favor, ¿por qué si lambda es 1 solo sirve n igual 1?",
        "start": 2944.04,
        "end": 2964.04
    },
    {
        "text": " Porque si n fuera mayor que 1, ya aparece la diagonal roja, ya aparece alguna otra diagonal que se va al infinito por la m, en este caso por la s, acá se llama s en la proposición.",
        "start": 2965.04,
        "end": 2978.04
    },
    {
        "text": " Digo, claro, escribanlo. Entonces, el límite existe y cuando existe el límite acá, ¿a cuánto tiende?",
        "start": 2978.04,
        "end": 2989.04
    },
    {
        "text": " Esto no es parte de la proposición, lo escriban otro color, para que quede claro que no es parte de la posición, pero ya que existe el límite, ¿a cuánto tiende?",
        "start": 2990.04,
        "end": 2998.04
    },
    {
        "text": " Tiende, en el caso que exista, tiende a la matriz nula.",
        "start": 3003.04,
        "end": 3006.04
    },
    {
        "text": " Y en este caso, el único casito extremo que nos queda, en este caso sería j sub 1, 1 por 1 de 1, a la s, claro, esto es el número 1, esto es el número 1, una matriz 1 por 1 que suele tiene 1, esto, cuando ese tiende a más infinito, es una tontería, porque es 1, va por 1 por 1 por 1 por 1 por 1 por 1, tiende a j sub 1 por 1, ¿a cuánto tiende?",
        "start": 3007.04,
        "end": 3035.04
    },
    {
        "text": " ¿a cuántas j sub 1 de 1 que si querés es, en la matriz identidad su 1, en la 1 por 1, 1?",
        "start": 3035.04,
        "end": 3041.04
    },
    {
        "text": " Cuando deja de ser tan tonto es ejemplo final, tan tonto es ese último caso, porque recuerden que esos son para todos los bloques, entonces pueden haber bloques que tienen a 0,",
        "start": 3046.04,
        "end": 3058.04
    },
    {
        "text": " puede ser algún bloque que se vaya al carajo, entonces se ha no convergen a la matriz, pero si todos convergen a 1, convergen a 0, puede ser que hay algunos que convergen a 1,",
        "start": 3059.04,
        "end": 3067.04
    },
    {
        "text": " es hecho quitas, los 1 por 1, se acuerdan que los bloques son a 0 por 2 por 2 por 3 o 1 por 1, ahí cabe la posibilidad que tiende a 1, claro, digo porque tiene que ver con un ejercicio práctico, ¿sí?",
        "start": 3068.04,
        "end": 3079.04
    },
    {
        "text": " ¿Y si el bloque es diagonalizable? No está en contraposición con todo esto porque si la diagonal ponele, ponele que tiene un solo valor propio para analizarlo de 1,",
        "start": 3079.04,
        "end": 3096.04
    },
    {
        "text": " el lo que te va a pasar es que si el lanzo es el que uno converge, si el lanzo es el que uno diverge y si el lanzo es el que uno diverge y si el lanzo es diagonalizable te quedan todos los bloques,",
        "start": 3097.04,
        "end": 3107.04
    },
    {
        "text": " decirle diagonalizable es suma de bloques de 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, o sea, estás en ese caso, recordad que este es el análisis para un bloque de llorran solo, entonces si la matriz es diagonalizable,",
        "start": 3108.04,
        "end": 3123.04
    },
    {
        "text": " entonces decir que todos los bloques que tienes son todos de a 1, pueden ser, tiendan a 0 o que tiendan a 1,",
        "start": 3123.04,
        "end": 3132.04
    },
    {
        "text": " ¿tengo claro? Bueno, entonces con esta proposición que sale directo de lo que hicimos en toda la análisis,",
        "start": 3133.04,
        "end": 3141.04
    },
    {
        "text": " estamos recogiendo frutos de 6, típicamente quisimos un montón de cuentas, aramos, sembramos, regamos y ahora lo único estamos haciendo de recoger,",
        "start": 3141.04,
        "end": 3152.04
    },
    {
        "text": " recoger, recoger, recoger frutos de una manera tremenda, vamos al teorema, ahora,",
        "start": 3153.04,
        "end": 3156.04
    },
    {
        "text": " hasta acá estamos con un lanzo de fijo, pero nosotros sabemos que las matrices tienen muchos bloques de llorran para diferentes valores propios,",
        "start": 3162.04,
        "end": 3169.04
    },
    {
        "text": " el teorema lo que dice es, pongamos todos juntos los valores propios, o sea, en un lenguaje que tenga que ver con todos los valores propios.",
        "start": 3169.04,
        "end": 3180.04
    },
    {
        "text": " Bueno, entonces acá aparecé una definición,",
        "start": 3180.04,
        "end": 3200.04
    },
    {
        "text": " esta definición ideal, ticamente podría haber aparecido, sería mejor haberla presentado cuando hablamos de las compocciones spectra,",
        "start": 3200.04,
        "end": 3219.04
    },
    {
        "text": " porque tiene que ver esta definición tiene que ver, se llama radio espectral, y de hecho la mencionamos,",
        "start": 3219.04,
        "end": 3231.04
    },
    {
        "text": " o realmente dijimos que era el radio espectral, pero no escribimos, ¿qué era esto antes de poner la definición como?",
        "start": 3231.04,
        "end": 3240.04
    },
    {
        "text": " O sea, si tienes una matriz adrada, ¿qué era el espectro?",
        "start": 3241.04,
        "end": 3249.04
    },
    {
        "text": " Lo valor de propios, exactamente, lo valor de propios, ¿sí?",
        "start": 3250.04,
        "end": 3254.04
    },
    {
        "text": " El conjunto de los valores propios, entonces el radio espectral se anota así, y esta notación es bastante homogénea en los diferentes textos,",
        "start": 3262.04,
        "end": 3273.04
    },
    {
        "text": " así la recogga y tira grafo, exactamente igual, el teorega grafo se va a hacer el radio de la matriz de la escesencia de grafo,",
        "start": 3274.04,
        "end": 3281.04
    },
    {
        "text": " es el máximo de los valores propios, pero no de los valores propios, pueden ser complejos, entonces cómo se comparar los complejos,",
        "start": 3283.04,
        "end": 3292.04
    },
    {
        "text": " es el máximo de las normas de los valores propios, si son reales sabemos compararlos todos los reales, pero es lo complejo para comparar si cual es más grande que el más grande, y da la norma,",
        "start": 3292.04,
        "end": 3301.04
    },
    {
        "text": " es el máximo de las normas de los valores propios, o sea, con lambda, en el espectro, ya, ese es el radio espectral, y si se acuerdan cuando dibujamos,",
        "start": 3301.04,
        "end": 3316.04
    },
    {
        "text": " una vez dijimos, dijimos así, dijimos, vamos a tener que mirar cuál es el radio espectral, porque lo que pase dependiendo de cuánto es el radio espectral,",
        "start": 3317.04,
        "end": 3331.04
    },
    {
        "text": " si el radio espectral es mayor o menor que uno, va a haber un comportamiento u otro, eso fue lo que dijimos en parte de clase atrás y es lo que dice el teorema siguiente,",
        "start": 3332.04,
        "end": 3350.04
    },
    {
        "text": " entonces teorema, lo pongo rojo porque realmente es central, y de vuelta, como hicimos tantas cuentas previas, no tenemos que demostrar nada, solamente recoger frutos,",
        "start": 3351.04,
        "end": 3367.04
    },
    {
        "text": " tenemos una matriz, que la vamos a pensar en los complejos para recoger todo el fruto, si no, no, no, para que sea fácil entender el comportamiento,",
        "start": 3368.04,
        "end": 3383.04
    },
    {
        "text": " si son todos sus coeficientes reales también son complejos y lo miramos adentro de los complejos, ningún problema,",
        "start": 3384.04,
        "end": 3389.04
    },
    {
        "text": " entonces parte A sale de la parte A y la parte B sale de la parte B de la proposición, dice así, voy a borrar el circulito para poder escribir bien la parte A y la parte B,",
        "start": 3389.04,
        "end": 3413.04
    },
    {
        "text": " lo que dice la parte A en esta proposición es que si un valor propio para ese bloque, ese valor propio es la norma es menor que uno, entonces este limite existe y va a liguar el acero,",
        "start": 3414.04,
        "end": 3426.04
    },
    {
        "text": " entonces lo que dice acá es que para sacar una conclusión es necesito que todos los valores propios verifican eso, y para que todos los valores propios verifican eso,",
        "start": 3427.04,
        "end": 3439.04
    },
    {
        "text": " el que tiene que tener menor que uno es el radio espectral y ahí aparece la cosa, si el radio espectral es menor que uno, a este no es el propio propio, no le puso normal,",
        "start": 3439.04,
        "end": 3451.04
    },
    {
        "text": " porque el radio espectral es el máximo de las normas, ya está la norma y no, ¿verdad?",
        "start": 3451.04,
        "end": 3456.04
    },
    {
        "text": " entonces si el radio espectral es menor que uno, entonces el limite de A la S es 0, ahora sigo escribiendo el teorema, pero me interesa hacer una paucita de 15 segundos para que os la similen,",
        "start": 3456.04,
        "end": 3479.04
    },
    {
        "text": " yo podría haber puesto también el limite de P, para cualquier polinomio PDS por A la S es 0, podamos ponerlo siquiera, no hay ningún problema, pero el tema es que el ideal queicamente es tan fuerte, se resultaba así y está bonito,",
        "start": 3479.04,
        "end": 3498.04
    },
    {
        "text": " que si no es lo que pone así, si no es lo que pone así es que yo decidí ponerlo así, porque acá está la esencia de todo lo que hicimos hasta ahora, ¿verdad?",
        "start": 3498.04,
        "end": 3508.04
    },
    {
        "text": " Es brutal lo que dice esta frase, si ustedes la logran entender, entonces entendieron un montón de matemáticas hasta ahora, desde acá hasta acá hay un montón de matemáticas,",
        "start": 3508.04,
        "end": 3519.04
    },
    {
        "text": " bueno, entonces lo que está diciendo no es otra cosa que aplicar A, porque si el máximo de los valores propios, en menor que uno todos los valores propios,",
        "start": 3519.04,
        "end": 3530.04
    },
    {
        "text": " si todos, a menor que uno es todos aquí en el Nacero existe el límite de la de S, pero si sísten todos los límites de S, de la de S, como ya se lo sabemos que A es P, J de la menos 1 y J a la vez es la suma directa,",
        "start": 3530.04,
        "end": 3548.04
    },
    {
        "text": " o con lo así, la suma directa de los J a su plana, lana en el espectro, si a lo cierto, entonces si todos tienen A0, el A tiene A0, ¿ok?",
        "start": 3548.04,
        "end": 3562.04
    },
    {
        "text": " Bueno, y la parte B se preocupa un poquito cuando existe el límite, digamos, en general, y si el límite existe,",
        "start": 3562.04,
        "end": 3575.04
    },
    {
        "text": " si solamente sí, por supuesto, si roa es menor que uno, si al radio espectro es menor que uno, ya lo sabemos que el límite existe,",
        "start": 3575.04,
        "end": 3595.04
    },
    {
        "text": " pero me falta un caso que es atender las situaciones que se dan cuando el lán, las 1 y el N igual 1, entonces cuando sucede eso, o 2, segundo caso puede ser que roa de A sea igual 1,",
        "start": 3595.04,
        "end": 3614.04
    },
    {
        "text": " vamos de a poco, vamos a pensar de a poco, no termine ahí describiré, roa de A igual 1, roa de A igual 1 quiere decir que el máximo de los módulos de los valores propios es 1,",
        "start": 3614.04,
        "end": 3627.04
    },
    {
        "text": " pero podría ser que el valor propio fuera 1 o no, el módulo es 1, pero el valor propio puede ser 1 o no, entonces eso hay que aclarar,",
        "start": 3627.04,
        "end": 3643.04
    },
    {
        "text": " no solamente tiene que suceder que roa de A sea 1, eso es lo que necesito, la realidad, porque es así, un detalle, si ve bien el pizarro,",
        "start": 3643.04,
        "end": 3664.04
    },
    {
        "text": " no, rodearse el máximo de los módulos de los valores propios, está, barro, profe quiere decir que no hay ningún valor propio que tenga módulo mayor que 1,",
        "start": 3664.04,
        "end": 3674.04
    },
    {
        "text": " pero podría haber muchos valores de prepro que tenga módulo 1, pero ser 1 menos 1, por ejemplo, o podría ser 1 e i, si es todo, si se aparece el A se podría todo, no verdad, porque el A no nos sirve,",
        "start": 3674.04,
        "end": 3688.04
    },
    {
        "text": " entonces el único que puede aparecer es 1, para que exista el límite, ¿cierto? Entonces, ¿qué vamos a poner? Si rodea es 1 el único valor propio de módulo 1,",
        "start": 3688.04,
        "end": 3712.04
    },
    {
        "text": " es 1, pero lamentablemente no terminas más todavía, todavía puede haber casos que se nos pude la situación.",
        "start": 3712.04,
        "end": 3733.04
    },
    {
        "text": " Bueno, resulta que el único valor propio con módulo 1 tiene que ser 1, pero podría aparecer 1 muchas veces, o sea, el valor propio 1 tiene su multiplicidad arilmética y tiene su multiplicidad siometrica, ¿cierto?",
        "start": 3733.04,
        "end": 3757.04
    },
    {
        "text": " ¿cierto? ¿quién termina la frase ahí? ¿cuándo existe ese límite? ¿Hacho? O sea, ma i, ma i, de 1 tiene que coincidir, ahí sí termina la frase, o sea, existe el límite, en este caso no pasa nada, ahí existe el límite porque está, pero en el otro caso es, bueno, está bien, ¿puede ahí un casito más?",
        "start": 3757.04,
        "end": 3783.04
    },
    {
        "text": " más cuando el rué es 1 pero en ese caso casi nunca exista el límite excepto que el único",
        "start": 3783.04,
        "end": 3787.88
    },
    {
        "text": " valor propio sea 1 pero ahí también tengo problemas excepto que además la multiplicidad",
        "start": 3787.88,
        "end": 3796.24
    },
    {
        "text": " adimética de 1 sea igual a la multiplicidad de 1 porque si no fuera así aparecería un bloquecito",
        "start": 3796.24,
        "end": 3804.44
    },
    {
        "text": " de llorra por lo menos de tamaño 2 por 1 y ya se igual ya se va porque sólo puede",
        "start": 3804.44,
        "end": 3815.12
    },
    {
        "text": " tener bloque de llorra de tamaño 1 por 1 entonces donde tengamos un bloque de llorra",
        "start": 3815.12,
        "end": 3822.12
    },
    {
        "text": " de tamaño 2 se no es pudría la fungo única chances eso o sea realmente es un caso muy",
        "start": 3822.12,
        "end": 3829.64
    },
    {
        "text": " exclusivo pero este análisis es central para los resultados por ejemplo anterioridad.",
        "start": 3829.64,
        "end": 3837.3199999999997
    },
    {
        "text": " Bueno, Urises, disfraigó comentar algo más hoy vamos a dejar por acá, ya les dí bastante",
        "start": 3837.32,
        "end": 3865.52
    },
    {
        "text": " palo, acá aparecen en el libro unos ejercicios que van a formar parte del práctico, yo estuve",
        "start": 3865.52,
        "end": 3872.72
    },
    {
        "text": " analizando cuales sí, cuales no y después lo que aparece digamos es meternos de apóquito",
        "start": 3872.72,
        "end": 3883.36
    },
    {
        "text": " en esto digamos una parte técnica parece van los exponencial de matrices y bueno ahí aparecen",
        "start": 3883.36,
        "end": 3892.32
    },
    {
        "text": " uno de las series de potencias etcétera que le estuve comentando yo estoy viendo de hasta",
        "start": 3892.32,
        "end": 3899.76
    },
    {
        "text": " donde vamos a hacer este capítulo o sea por ejemplo le soy sincero tengo dudas y vamos a hacer la",
        "start": 3899.76,
        "end": 3907.76
    },
    {
        "text": " sección 5 o no sinceramente la sección 6 se que no la vamos a hacer la donde empieza la 6 ahora",
        "start": 3907.76,
        "end": 3916.56
    },
    {
        "text": " no encuentro el comienzo de la 6 5",
        "start": 3916.56,
        "end": 3922.04
    },
    {
        "text": " 5 3",
        "start": 3927.68,
        "end": 3930.68
    },
    {
        "text": " no no se llama cinc o 6 se llama cinc o 6 es lo que tiene que ver con las aplicaciones a",
        "start": 3933.0,
        "end": 3940.48
    },
    {
        "text": " ecuaciones diferenciales y al interior de apóquito y todo eso 5 6 5 7 creo que esta",
        "start": 3941.44,
        "end": 3949.12
    },
    {
        "text": " me va a ver si el 5 5 5 4 5 4 ya no ahí empieza la aplicación de sección diferencial",
        "start": 3949.12,
        "end": 3959.2400000000002
    },
    {
        "text": " porque porque o sea debería pedirles que quizás que hacen hecho el curso de cuasiones",
        "start": 3959.9599999999996,
        "end": 3969.2
    },
    {
        "text": " diferenciales y no está eso ya es demasiado entonces creo que esa la vamos a hacer el",
        "start": 3969.2,
        "end": 3973.4799999999996
    },
    {
        "text": " tierno pero no no porque no valga la pena simplemente porque hay otra que valen la pena entonces",
        "start": 3973.4799999999996,
        "end": 3979.16
    },
    {
        "text": " ahí vamos a cerrar el capítulo aquí y nos vamos ahí directamente al capítulo 2 que es el",
        "start": 3979.16,
        "end": 3986.12
    },
    {
        "text": " lo que hizo más el modelo del lion tief que es una desapplicación de economía o ojo tenemos",
        "start": 3986.12,
        "end": 3992.64
    },
    {
        "text": " un rato todavía no porque tenemos que hablar de esto de las de las series de potencias y las",
        "start": 3992.64,
        "end": 3998.68
    },
    {
        "text": " exponenciales de matrices es matemática todavía pero después aparece digamos esto y estoy",
        "start": 3998.68,
        "end": 4006.8199999999997
    },
    {
        "text": " decidiendo si dar o no el la aplicación mecánica del pendulo múltiplo eso es también en el",
        "start": 4006.8199999999997,
        "end": 4014.16
    },
    {
        "text": " capítulo siguiente hoy nos directamente se ha a los otros capítulos pero bueno todo eso",
        "start": 4014.16,
        "end": 4021.2
    },
    {
        "text": " será después del parcial",
        "start": 4021.2,
        "end": 4022.24
    }
]