[
    {
        "text": " Bueno, vamos a mirar un poquito las indicaciones. El parcial son 20 preguntas de multiplopsión. Cada ejercicio",
        "start": 0.0,
        "end": 29.0
    },
    {
        "text": " es decir, cada pregunta tiene una única opción correcta, una y solamente una. Una respuesta correcta suma",
        "start": 29.0,
        "end": 38.88
    },
    {
        "text": " dos puntos, es decir, que si en una pregunta ustedes le invocan a la respuesta correcta el",
        "start": 38.88,
        "end": 44.84
    },
    {
        "text": " puntaje es más dos. Una respuesta incorrecta resta 0.5, o sea que si en una contestan una opción",
        "start": 44.84,
        "end": 54.879999999999995
    },
    {
        "text": " que está mal tienen un puntaje de medio punto negativo. Un ejercicio sin respuesta no afecta el",
        "start": 54.88,
        "end": 63.400000000000006
    },
    {
        "text": " puntaje, es decir, que si dejan sin contestar una pregunta vale 0.0 suma y resta.",
        "start": 63.400000000000006,
        "end": 69.68
    },
    {
        "text": " ¿Ve bien? Lo vamos a ver ahora cuando repasemos un poco los primeros ejercicios, no letiren",
        "start": 69.68,
        "end": 79.44
    },
    {
        "text": " a acertar, o sea la idea es leer bien lo que se pide, resolver lo que haya que resolver y en función",
        "start": 79.44,
        "end": 88.44
    },
    {
        "text": " del resultado tras haber razón, o la respuesta a conciencia marcar la respuesta correcta,",
        "start": 88.44,
        "end": 94.03999999999999
    },
    {
        "text": " o la respuesta que creamos, creamos que es correcta. Pero sea, creanme no es una buena estrategia",
        "start": 94.03999999999999,
        "end": 100.16
    },
    {
        "text": " tirar a acertar porque es muy probablemente que queden en el entorno del 0, o sea las positivas,",
        "start": 100.16,
        "end": 104.75999999999999
    },
    {
        "text": " con las negativas se compensan y si uno le tira a pegar es muy probable que el puntaje sea muy malo.",
        "start": 104.76,
        "end": 110.04
    },
    {
        "text": " A veces es preferible no contestar antes de contestar cualquier cosa.",
        "start": 111.64,
        "end": 115.08000000000001
    },
    {
        "text": " Sí, eso igual, bueno, cada uno manejará ver qué hace con cada pregunta.",
        "start": 115.08000000000001,
        "end": 119.08000000000001
    },
    {
        "text": " Este parcial vale 40 puntos, el segundo parcial es escrito y vale 60 puntos.",
        "start": 122.2,
        "end": 128.36
    },
    {
        "text": " Deben entregar la planilla con las respuestas junto con la letra.",
        "start": 129.36,
        "end": 134.68
    },
    {
        "text": " Ustedes van a recibir, creo que esto ya lo conocen, no sé si ya han tenido de cálculo o de álgebra",
        "start": 134.68,
        "end": 140.52
    },
    {
        "text": " múltiples opción, van a recibir una hoja de scanner, donde deben pintar, preferentemente con lápiz,",
        "start": 140.52,
        "end": 147.32000000000002
    },
    {
        "text": " si la letra correspondiente la opción elegida. Igualmente deben entregarnos también la letra,",
        "start": 147.32000000000002,
        "end": 155.56
    },
    {
        "text": " o sea, nos van a entregar la hoja de la scanner y también nos van a entregar la letra,",
        "start": 155.56,
        "end": 160.12
    },
    {
        "text": " debe poner nombre completo y cédula en la planilla y en la letra. O sea, lo que se va a utilizar para",
        "start": 160.12,
        "end": 169.0
    },
    {
        "text": " corregir es la hoja de scanner, que ustedes se entregan la letra es para tener un backup por si llegar a",
        "start": 169.0,
        "end": 175.64000000000001
    },
    {
        "text": " pasar alguna tragedia con la hoja de la escana. En ese caso, ustedes lo que deben hacer es en la hoja",
        "start": 175.64000000000001,
        "end": 181.8
    },
    {
        "text": " de la letra con un círculo claramente marcar la opción de la respuesta correcta. Volvo a repetir lo",
        "start": 181.8,
        "end": 188.68
    },
    {
        "text": " que se corrijes la hoja de la escana, así que tengan mucho cuidado de que lo que marcan acá se",
        "start": 188.68,
        "end": 193.96
    },
    {
        "text": " exactamente lo mismo que lo que marcan en el escana, porque si a lo mejor borraron, cambiaron de peñón",
        "start": 193.96,
        "end": 198.28
    },
    {
        "text": " a último minuto y el escana tiene una opción y la hoja de la letra tiene otra opción diferente,",
        "start": 198.28,
        "end": 203.32000000000002
    },
    {
        "text": " la que vale es la de la escana. Queda claro, únicamente si la hoja de la escana no sé, se",
        "start": 203.32000000000002,
        "end": 210.84
    },
    {
        "text": " queme hace por combustiones pontanias o alguna tragedia similar, bueno, ahí podemos mirar la letra",
        "start": 210.84,
        "end": 217.0
    },
    {
        "text": " bar que fue lo que pasó. Queda claro hasta acá, por favor poner número de parcial que eso va a",
        "start": 217.0,
        "end": 224.04
    },
    {
        "text": " figurar en la distribución por salones, va a decir cuál es el número de parcial, poner nombre,",
        "start": 224.04,
        "end": 228.8
    },
    {
        "text": " poner cédula, completar todos los datos tanto en la hoja del parcial como en la hoja de la escana,",
        "start": 228.8,
        "end": 234.04
    },
    {
        "text": " el poder aparecer una cosa tonta, pero todos los años encontramos parciales anónimos. Sí,",
        "start": 234.04,
        "end": 240.02
    },
    {
        "text": " alumnos que no sabemos quiénes son, que no pusieron quiénes eran y que ese parcial no se pudo",
        "start": 240.02,
        "end": 244.26000000000002
    },
    {
        "text": " corregir y a lo mejor el chiquilín pobre o chiquilín sacó a cero punto, o sea que asegúrense siempre",
        "start": 244.26000000000002,
        "end": 250.10000000000002
    },
    {
        "text": " de poner todos sus datos, parece una cosa chota, pero no lo es. Bien, en todos los ejercicios se",
        "start": 250.10000000000002,
        "end": 258.78000000000003
    },
    {
        "text": " utilizan lenguaje pascal y como fue dado en el curso, es decir, pascal estándar más las",
        "start": 258.78000000000003,
        "end": 266.62
    },
    {
        "text": " convenciones especiales de frípas cal que tomamos en cuesta, que a grandes rasgos son la",
        "start": 266.62,
        "end": 272.38
    },
    {
        "text": " utilización de él en el que hay, y la evaluación de expresiones julianas por circuito corto, o sea",
        "start": 272.38,
        "end": 279.5
    },
    {
        "text": " que por defecto tenemos el pascal de siempre más esos dos aspectos de frípas cal que son los que",
        "start": 279.5,
        "end": 285.42
    },
    {
        "text": " usamos habitualmente. Bien, bueno, preguntas hasta acá, bueno, vamos a mirar juntos algunas de las",
        "start": 285.42,
        "end": 294.5
    },
    {
        "text": " preguntas, no las vamos a hacer todas, se simplemente como para entrar en calor, las vamos a discutir,",
        "start": 294.5,
        "end": 300.08
    },
    {
        "text": " las vamos a desmenuzar, vamos a tratar de razonar cada una de ellas y después el resto de la classo",
        "start": 300.08,
        "end": 305.5
    },
    {
        "text": " va a hacer para que o bien ustedes sigan con este parcial o bien sigan con algún otro parcial viejo,",
        "start": 305.5,
        "end": 310.22
    },
    {
        "text": " hay montones de parciales viejos publicados en el Eva, o dudas de lo que quieran preguntarme de",
        "start": 310.22,
        "end": 315.92
    },
    {
        "text": " teórico, de ejercicios de práctico, de la tarea si tienen que entregar lo que sea.",
        "start": 315.92,
        "end": 319.98
    },
    {
        "text": " Bueno, van a ver que las preguntas pueden abarcar, vamos a ganándolo un poquito, pueden",
        "start": 319.98,
        "end": 333.66
    },
    {
        "text": " abarcar cualquier aspecto, pueden ser preguntas que tienen que ver con temas de sintaxis y con temas de",
        "start": 333.66,
        "end": 339.54
    },
    {
        "text": " convilación, pueden ser preguntas que tengan que ver con cuestiones de ejecución, pueden ser",
        "start": 339.54,
        "end": 346.26
    },
    {
        "text": " preguntas que mezclen las dos cosas, en definitiva diferentes preguntas que valúan distintas cosas",
        "start": 346.26,
        "end": 354.42
    },
    {
        "text": " que estuvimos viendo a lo largo de las primeras semanas. Sí, el del año pasado el de 2015,",
        "start": 355.21999999999997,
        "end": 361.14
    },
    {
        "text": " como perdón, del segundo semestre 2015 el primer parcial, hay transverseiones, la Vila C,",
        "start": 362.65999999999997,
        "end": 372.98
    },
    {
        "text": " esta es la Vila C, bueno eso me olvide decirles, ustedes van a tener varias versiones diferentes,",
        "start": 372.98,
        "end": 381.1
    },
    {
        "text": " normalmente nos manejamos entre 3 o 4 versiones, donde lo que hacemos es alteramos el orden de las",
        "start": 381.1,
        "end": 387.12
    },
    {
        "text": " preguntas y el orden de las opciones, o sea que yo estoy sentado con mi hoja y el compañero que",
        "start": 387.12,
        "end": 393.06
    },
    {
        "text": " está sentado al lado a tener otra versión diferente con las preguntas y las respuestas en otro orden,",
        "start": 393.06,
        "end": 397.54
    },
    {
        "text": " pero como nadie se le va a ocurrir mirar el parcial del compañero tampoco el problema,",
        "start": 398.42,
        "end": 402.58000000000004
    },
    {
        "text": " bien, bueno vamos a mirar un poco la pregunta 1, dice, dadas las siguientes instrucciones en donde",
        "start": 404.26000000000005,
        "end": 414.90000000000003
    },
    {
        "text": " final y valor son ambas variables enteras, entonces tenemos allí dos instrucciones de asignación,",
        "start": 414.90000000000003,
        "end": 425.38
    },
    {
        "text": " una es la asignación al valor 5, a final, otra es la asignación al valor 108 a valor y se",
        "start": 425.94,
        "end": 434.65999999999997
    },
    {
        "text": " propone un primer bloque y un segundo bloque y que hacen una serie de operaciones,",
        "start": 434.65999999999997,
        "end": 441.06
    },
    {
        "text": " bueno nos preguntan cuál es de las siguientes afirmaciones sobre las instrucciones 1 y 2 es correcta,",
        "start": 443.21999999999997,
        "end": 450.42
    },
    {
        "text": " cual una sola, bueno la dice ninguna de las opciones produce un error en tiempo de ejecución,",
        "start": 450.98,
        "end": 458.98
    },
    {
        "text": " o sea que si traducimos esa frase que me está diciendo, que si lo corro tanto en la",
        "start": 460.18,
        "end": 467.54
    },
    {
        "text": " instrucción 1 como la instrucción 2 el programa no que no se rombre, o sea, terminará normalmente",
        "start": 467.54,
        "end": 474.06
    },
    {
        "text": " con algún tipo de resultado, que no termine o sea que queden loop se considera exactamente",
        "start": 474.06,
        "end": 484.38
    },
    {
        "text": " que el programa no funcionaría, después la ve dice que ambas instrucciones producen un error en",
        "start": 484.38,
        "end": 492.42
    },
    {
        "text": " tiempo de ejecución, o sea que tanto la 1 como la 2 tienen problema, la se dice que solo la",
        "start": 492.42,
        "end": 501.46
    },
    {
        "text": " instrucción 1 produce un error en tiempo de ejecución, o sea que la 1 tiene problemas y que la 2",
        "start": 501.46,
        "end": 509.29999999999995
    },
    {
        "text": " andabian, la opción de dice que solo la instrucción 2 produce un error en tiempo de ejecución,",
        "start": 509.29999999999995,
        "end": 516.9
    },
    {
        "text": " o sea que la 1 andabian y la 2 es la que tiene problemas y la edice que si la variable final se",
        "start": 516.9,
        "end": 526.02
    },
    {
        "text": " inicializa en 0 en vez de 5 ambas produce en error de ejecución, bueno, qué es lo que nosotros",
        "start": 526.02,
        "end": 535.3
    },
    {
        "text": " podemos hacer para tratar de ver cuál es la correnta, vamos a empezar a ejecutar a mano estos códigos,",
        "start": 535.3,
        "end": 541.02
    },
    {
        "text": " a ver qué es lo que pasa, qué consejo les doy siempre, no recordar mentalmente los nombres de las",
        "start": 541.02,
        "end": 547.3
    },
    {
        "text": " variables, dibujen las variables, anoten sus valores, vean qué es lo que ocurre, les vamos a dar",
        "start": 547.3,
        "end": 554.34
    },
    {
        "text": " hojas, esas hojas son hojas en blanco que son para borrador, no las tienen que entregar, solamente",
        "start": 554.34,
        "end": 559.7800000000001
    },
    {
        "text": " entregar la letra y la hoja de la escana, ¿abien? Bueno, vamos a mirar un poco a ver qué pasa con el",
        "start": 559.7800000000001,
        "end": 566.86
    },
    {
        "text": " primer código, bien, tenemos la variable final, sí, con valor inicial 5 y tenemos la variable valor",
        "start": 566.86,
        "end": 583.82
    },
    {
        "text": " con valor inicial 108, bueno, vamos a mirar un poco qué pasa con la instrucción 1, tenemos un y",
        "start": 583.82,
        "end": 597.82
    },
    {
        "text": " tiene una doble condición separada con and, si no nos dicen nada qué tipo de evaluación",
        "start": 597.82,
        "end": 605.5
    },
    {
        "text": " asumimos dijimos por ser muy toco, ¿abien? Bueno, bueno, final es mayor que 0, sí, porque final",
        "start": 605.5,
        "end": 614.58
    },
    {
        "text": " vale 5 efectivamente es mayor que 0, o sea que la primera condición qué pasó, diotrú es necesario",
        "start": 614.58,
        "end": 622.18
    },
    {
        "text": " valor en la segunda, es necesario, valor div final, o sea el cosiente de la división entera entre",
        "start": 622.18,
        "end": 631.46
    },
    {
        "text": " valor y final, es menor que 300, a ver, valor dividido final cuanto al cosiente,",
        "start": 631.46,
        "end": 640.34
    },
    {
        "text": " da 20, ¿no? 21, bueno, tanto si da 20 como si da 21, es menor a 300 claramente la segunda",
        "start": 643.58,
        "end": 654.02
    },
    {
        "text": " condición es verdadera, o sea que hasta ahora qué pasa, todo bien, la primera tru, la segunda tru,",
        "start": 654.02,
        "end": 661.9399999999999
    },
    {
        "text": " el andiotrú, por lo tanto qué pasa, entramos y la restamos uno a final, o sea que final deja de",
        "start": 661.9399999999999,
        "end": 668.8
    },
    {
        "text": " valor 5 y pasa valor 4, volvemos al igual, es mayor que 0, el cosiente de la división es menor",
        "start": 668.8,
        "end": 679.9399999999999
    },
    {
        "text": " que 300 y si va a ser de hecho incluso, si fuera el cosiente real sería un poquito más pequeño,",
        "start": 679.94,
        "end": 685.4200000000001
    },
    {
        "text": " como es entero probablemente sea igual, en cualquier caso nunca va a ser más grande, o sea que la segunda",
        "start": 685.4200000000001,
        "end": 691.2600000000001
    },
    {
        "text": " de verdad es, es más grande, está bien porque se achicó final no sea gran, es verdad, va a ser un",
        "start": 691.2600000000001,
        "end": 701.1800000000001
    },
    {
        "text": " poquito más grande pero igual va a estar por debajo de 300, es más, nunca puede ser mayor que el",
        "start": 701.1800000000001,
        "end": 706.4000000000001
    },
    {
        "text": " dividendo, si el dividendo es 108 obviamente no importa lo que debe hacer claramente menor que 300,",
        "start": 706.4,
        "end": 712.68
    },
    {
        "text": " o sea qué pasa, entramos y la restamos uno y va a valor 3, o ni qué va a pasar las siguientes",
        "start": 712.68,
        "end": 720.86
    },
    {
        "text": " veces y se va a seguir cumpliendo, luego final va a entrar de vuelta y va a valor 2, se van a",
        "start": 720.86,
        "end": 728.9599999999999
    },
    {
        "text": " seguir cumpliendo las dos condiciones del an, va a entrar de vuelta, va a valer 1, se van a seguir",
        "start": 728.9599999999999,
        "end": 734.64
    },
    {
        "text": " cumpliendo las dos condiciones del an, va a entrar de vuelta, va a valer 0 y ahí que va a pasar.",
        "start": 734.64,
        "end": 740.6
    },
    {
        "text": " Cuando evalúe nuevamente la condición la primera le va a dar false y al dar le false la primera",
        "start": 742.6,
        "end": 752.52
    },
    {
        "text": " como hay un an y tenemos evaluación por circuito corto no va a evaluar la segunda y menos mal que",
        "start": 754.28,
        "end": 762.0
    },
    {
        "text": " no lo hace, porque si lo hiciera tenemos cociente 0, eso no daría un problema, pero como es la",
        "start": 762.0,
        "end": 770.76
    },
    {
        "text": " segunda condición no tenemos ese problema, qué pasa entonces con la primera instrucción,",
        "start": 770.76,
        "end": 776.48
    },
    {
        "text": " la primera instrucción funciona bien siempre, con lo cual hay una que ya podemos descartar,",
        "start": 777.96,
        "end": 783.16
    },
    {
        "text": " la C la podemos descartar porque en la instrucción 1 acabamos de ver que no produce ninguna",
        "start": 784.92,
        "end": 789.64
    },
    {
        "text": " error en tiempo de ejecución y la B también porque la B me dice que las dos seguro produce en un",
        "start": 789.64,
        "end": 795.72
    },
    {
        "text": " error en tiempo de ejecución y ya vimos que la 1 no, o sea que ya hay 2 que descartamos y la D",
        "start": 795.72,
        "end": 801.12
    },
    {
        "text": " si final bueno veamos la E, qué pasa si el valor inicial de la variable final fue ese 0,",
        "start": 803.64,
        "end": 809.36
    },
    {
        "text": " la primera vez que pregunta por el Y la condición del izquierda ya daría false y gracias al circuito",
        "start": 810.16,
        "end": 816.92
    },
    {
        "text": " corto se iría o sea que estamos entre cual y cual entre A y D o sea o ninguna produce error en",
        "start": 816.92,
        "end": 824.56
    },
    {
        "text": " tiempo de ejecución o solamente la segunda, ¿sí? hasta acá vamos a ver qué pasa con la segunda entonces,",
        "start": 824.56,
        "end": 832.56
    },
    {
        "text": " qué tiene, vamos a comparar la segunda con la primera, qué nota, se invirtió el orden de las",
        "start": 834.56,
        "end": 843.48
    },
    {
        "text": " condiciones, o sea la que haya era al izquierdo del an acá está la derecha y la que haya era la derecha",
        "start": 843.48,
        "end": 850.72
    },
    {
        "text": " acá está la izquierda, va a ocasionar algún problema de eso, con qué valor de final,",
        "start": 850.72,
        "end": 857.8000000000001
    },
    {
        "text": " cuando final toma el valor 0 después de ir bajando, porque ya vimos que mientras va bajando las 2",
        "start": 857.8000000000001,
        "end": 866.96
    },
    {
        "text": " eran verdaderas, o sea que si las evaluamos al revés, no importa el resultado va a seguir siendo verdadero,",
        "start": 866.96,
        "end": 872.0
    },
    {
        "text": " pero en el momento en que final tome el valor 0 cuando volvamos al wild la que se va a evaluar",
        "start": 872.56,
        "end": 879.4
    },
    {
        "text": " primero es la del izquierda y acá que sucede, final es 0 o sea que estamos queriendo hacer una",
        "start": 879.4,
        "end": 887.8
    },
    {
        "text": " división entre 0 eso da un error en tiempo de ejecución, no lo detecta la combinación,",
        "start": 887.8,
        "end": 894.52
    },
    {
        "text": " con lo cual esta la expresión de la izquierda es la que entre comillas se va a romper,",
        "start": 895.52,
        "end": 903.0799999999999
    },
    {
        "text": " está bien, por lo tanto que pasa con la destrucción 2, produce el error en tiempo de ejecución,",
        "start": 904.76,
        "end": 911.96
    },
    {
        "text": " con lo cual cuál es la opción correcta, la de sólo la instrucción 2 produce un error en tiempo",
        "start": 911.96,
        "end": 918.76
    },
    {
        "text": " de ejecución, se va entendiendo la mecánica de cómo jugar con estos ejercicios,",
        "start": 918.76,
        "end": 925.08
    },
    {
        "text": " o sea que acá claramente el circuito corto es algo determinante, si esto se evaluas en",
        "start": 925.08,
        "end": 933.76
    },
    {
        "text": " Pascal Standard que no tiene circuito corto, ¿qué pasaría con la instrucción 1?",
        "start": 933.76,
        "end": 940.6
    },
    {
        "text": " También daría error en tiempo de ejecución, porque qué pasaba en el Pascal Standard?",
        "start": 940.6,
        "end": 945.52
    },
    {
        "text": " Evalúa las 2, no es evaluación por circuito corto, ¿abien?",
        "start": 945.52,
        "end": 953.36
    },
    {
        "text": " Bueno se entendió la 1, más consultas de la 1,",
        "start": 956.36,
        "end": 961.0
    },
    {
        "text": " vamos a mirar un poquito de la 2, preguntamos,",
        "start": 963.52,
        "end": 969.6
    },
    {
        "text": " bueno, dado el siguiente programa, tenemos allí un programa que se llama ejercicio,",
        "start": 969.6,
        "end": 987.32
    },
    {
        "text": " que tiene dos variables X y y que realiza una serie de instrucciones, ¿qué tipo de instrucciones",
        "start": 987.32,
        "end": 995.76
    },
    {
        "text": " tenemos en este programa? Tenemos instrucciones de lectura, instrucciones de asignación,",
        "start": 995.76,
        "end": 1006.16
    },
    {
        "text": " ¿qué más?",
        "start": 1006.16,
        "end": 1008.56
    },
    {
        "text": " ¿Instrucciones de escritura en pantalla? Sí y qué otra?",
        "start": 1010.08,
        "end": 1014.08
    },
    {
        "text": " De las estructuras de control, ¿cuál es o cuál? Y, ¿eh? Y también denominada selección como,",
        "start": 1016.16,
        "end": 1023.84
    },
    {
        "text": " selección simple, después estaba el que es que era la selección como, la selección múltiples",
        "start": 1024.64,
        "end": 1030.16
    },
    {
        "text": " selección generalizada, ¿eh? No hay estructuras repetitivas en este programa.",
        "start": 1030.16,
        "end": 1034.72
    },
    {
        "text": " Bueno, indicar la opción correcta al ejecutarlo, la primera opción dice que despliega el",
        "start": 1037.6000000000001,
        "end": 1045.24
    },
    {
        "text": " carácter a, sí y solamente sí, X es paro, o sea que sí X es sin par, según la opción,",
        "start": 1045.24,
        "end": 1054.8
    },
    {
        "text": " ¿a qué pasaría? No despliegaría a, acá, para que estigue otra cosa, pero no despliegaría a,",
        "start": 1054.8,
        "end": 1060.48
    },
    {
        "text": " la vez dice despliegar a sí y solamente sí, X es sin paro, o sea que sí X no cumpliera,",
        "start": 1061.68,
        "end": 1069.84
    },
    {
        "text": " ¿a qué sin paro? Bueno, supuestamente despliegaría otra cosa, o sea lo mismo que el anterior,",
        "start": 1069.84,
        "end": 1074.8799999999999
    },
    {
        "text": " pero cambiando lo que pasa con X, ¿eh? La C dice que siempre despliega a, o sea no importa",
        "start": 1074.8799999999999,
        "end": 1082.76
    },
    {
        "text": " qué valor tome X en la entrada, siempre despliegaría. La D dice que despliega a,",
        "start": 1082.76,
        "end": 1089.3999999999999
    },
    {
        "text": " sí y sólo sí, X es sin paro, o sea que sí X es paro, bueno, probablemente despliega otra cosa.",
        "start": 1089.3999999999999,
        "end": 1095.9599999999998
    },
    {
        "text": " Y la D dice que siempre despliega a, no importa el valor que tome X, ¿eh? Bueno, ¿qué se les ocurre",
        "start": 1096.56,
        "end": 1107.64
    },
    {
        "text": " hacer para comprobar estas opciones? Bueno, probarlo con un número par y probarlo con un número",
        "start": 1107.64,
        "end": 1115.2
    },
    {
        "text": " en par, por lo menos para tener una idea de qué es lo que suceda. Bueno, bien, vamos a dibujar la",
        "start": 1115.2,
        "end": 1122.24
    },
    {
        "text": " variable X, vamos a corrarlo primero en el caso de que me dan un número par, por ejemplo cual,",
        "start": 1122.24,
        "end": 1127.32
    },
    {
        "text": " 2, ¿eh? X toma el valor 2, aparece otra variable Y, vamos a dibujarla, ¿eh? Bueno, o sea que X",
        "start": 1127.32,
        "end": 1140.72
    },
    {
        "text": " leímos el valor 2, ¿eh? Acieles signamos X, o sea que lle, toma el valor 2, ¿eh? Bueno,",
        "start": 1140.72,
        "end": 1152.1200000000001
    },
    {
        "text": " Y X mod 2 igual 0, ¿qué estamos preguntando acá? Si el número X es paro, o sea, si hacía el resto",
        "start": 1152.1200000000001,
        "end": 1160.96
    },
    {
        "text": " de dividirlo entre 2, me da 0, y bueno, 2 claramente es paro, o sea que ahí que valor le vamos a",
        "start": 1160.96,
        "end": 1167.1200000000001
    },
    {
        "text": " asignar, 2 más 2 le vamos a asignar 4, o sea que ahí deja de valor 2 y pasa a valor 4, ¿eh?",
        "start": 1167.12,
        "end": 1179.6599999999999
    },
    {
        "text": " Bien, ¿qué pasa este punto y cómo que me está indicando? Que ahí finalizó el IF, no hay",
        "start": 1179.6599999999999,
        "end": 1187.76
    },
    {
        "text": " el IF, ¿eh? Empezamos con el segundo I que sí tiene un IF, o sea, este IF corresponde",
        "start": 1187.76,
        "end": 1197.12
    },
    {
        "text": " al DEN del segundo I, ¿eh? ¿Qué estamos preguntando? Si X más sí es paro, y bueno, 2",
        "start": 1197.12,
        "end": 1210.6
    },
    {
        "text": " 4, 6 es paro, lo es, o sea que qué es lo que vamos a traer, vamos a traer el carácter",
        "start": 1210.6,
        "end": 1218.08
    },
    {
        "text": " A, ¿eh? Fregunta, esto pasó por que era puntualmente 2, o será igual con cualquier número",
        "start": 1218.08,
        "end": 1226.8799999999999
    },
    {
        "text": " paro, ¿qué opinan? Va a ser igual con cualquier número paro, ¿por qué razón?",
        "start": 1226.8799999999999,
        "end": 1237.36
    },
    {
        "text": " Nosotros sabemos que X es paro y ahí que le estamos asignando, el valor de X más 2, o sea",
        "start": 1237.36,
        "end": 1243.8799999999999
    },
    {
        "text": " que también me va a quedar paro, y entonces X más sí va a ser la suma de 2 valores pares,",
        "start": 1243.8799999999999,
        "end": 1251.4399999999998
    },
    {
        "text": " nosotros sabemos que la suma de 2 valores pares siempre ha un resultado paro, o sea que",
        "start": 1251.4399999999998,
        "end": 1256.76
    },
    {
        "text": " esto que lo constatamos para el 2 en realidad vale para cualquier valor paro que tome X, ¿eh?",
        "start": 1256.76,
        "end": 1264.24
    },
    {
        "text": " ¿Y qué pasa entonces cuando X es sin paro? Bueno, vemos que pasa la misma cosa, porque si X es",
        "start": 1265.24,
        "end": 1275.16
    },
    {
        "text": " impar, ¿eh? ¿Le vamos a sumar 2? No, vamos a sumar que X vale, por ejemplo 3, ¿eh?",
        "start": 1275.16,
        "end": 1287.88
    },
    {
        "text": " Leemos 3 para X, ahí que le asignamos entonces, le asignamos 3, ¿si? Vamos a entrar al",
        "start": 1288.88,
        "end": 1300.24
    },
    {
        "text": " primer IF, no porque X es sin paro, o sea que ahí no le vamos a estar sumando 2, le vamos a",
        "start": 1300.24,
        "end": 1307.0400000000002
    },
    {
        "text": " dejar el valor que tiene que es cual, el mismo que tenía X, y entonces que va a pasar con el",
        "start": 1307.0400000000002,
        "end": 1314.16
    },
    {
        "text": " X más sí, va a ser paro porque estamos sumando X que es como impar con sí mismo que también",
        "start": 1314.16,
        "end": 1322.68
    },
    {
        "text": " es sin paro y la suma de 2 sin paro es que pasa, da paro, con lo cual es donde va a entrar,",
        "start": 1322.68,
        "end": 1328.68
    },
    {
        "text": " ¿eh? ¿eh? ¿eh? ¿y esto va a pasar con cualquier impar? Sí, no importa qué valor tome X,",
        "start": 1328.68,
        "end": 1334.92
    },
    {
        "text": " el valor que sea impar al sumarlo con sí mismo, porque no va a entrar acá, me va a dar impar,",
        "start": 1334.92,
        "end": 1341.4
    },
    {
        "text": " más impar me va a quedar un resultado paro, ¿cuál es la conclusión entonces? Que siempre",
        "start": 1341.4,
        "end": 1349.52
    },
    {
        "text": " despliega a, tanto si la X es paro, como si la X es sin paro, no importa qué valor sea,",
        "start": 1349.52,
        "end": 1355.4
    },
    {
        "text": " este programa siempre despliega el carácter a, ¿si entendió? Sí, ¿eh? ¿eh? ¿eh? ¿eh?",
        "start": 1355.4,
        "end": 1367.5600000000002
    },
    {
        "text": " ¿eh? ¿eh? ¿eh? ¿eh? ¿eh? ¿eh? ¿eh? ¿eh? ¿eh? ¿eh? ¿eh? ¿eh? ¿eh ejerar ¿eh? aircraftar bien,",
        "start": 1367.78,
        "end": 1369.96
    },
    {
        "text": " como si la X es pal, ¿eh? ¿eh? ¿eh? El ple… ¿eh? ¿eh? ¿eh? ¿eh? ¿eh? ¿eh? ¿eh? ¿eh? ¿eh? ¿eh? ¿eh? ¿eh? ¿eh? ¡eh!",
        "start": 1369.96,
        "end": 1379.22
    },
    {
        "text": " que luego valga para cualquier caso, pero bueno por lo menos te da un punto de arranque,",
        "start": 1379.22,
        "end": 1384.32
    },
    {
        "text": " si, tienes algún valor concreto con el que va a empezar a hacer una idea y luego si corresponde,",
        "start": 1384.32,
        "end": 1389.6000000000001
    },
    {
        "text": " bueno tratar de ser una generalización del asunto.",
        "start": 1389.6000000000001,
        "end": 1396.3
    },
    {
        "text": " ¿Pero qué va a preguntar acerca de la dos? Bueno, vamos a hacer un poquito de la tres.",
        "start": 1396.3,
        "end": 1403.94
    },
    {
        "text": " Por acá, no, esta es la cinco.",
        "start": 1410.74,
        "end": 1415.3799999999999
    },
    {
        "text": " Acá. Es ejercicio tres. Van a ver que algunas preguntas llevan más tiempo,",
        "start": 1415.38,
        "end": 1428.8600000000001
    },
    {
        "text": " porque uno tiene que hacer más cálculos trabajando con variables y otras son más bien rápidas.",
        "start": 1428.8600000000001,
        "end": 1435.14
    },
    {
        "text": " O sea que no se asusten, depende también de la versión que les toquen, si justo empiezan,",
        "start": 1435.14,
        "end": 1440.94
    },
    {
        "text": " si, con alguna pregunta que ven que les toma bastante, no quiere decir que todas las preguntas",
        "start": 1440.94,
        "end": 1445.52
    },
    {
        "text": " vayan a demorar lo mismo. Puedes ver preguntas que se responden más rápido porque son más",
        "start": 1445.52,
        "end": 1449.94
    },
    {
        "text": " conceptuales de repente que otra cosa. Otro consejo, y eso lo maneja cada uno, yo en general",
        "start": 1449.94,
        "end": 1457.3400000000001
    },
    {
        "text": " trato de no perder tiempo en un parcial. O sea, si veo que en una pregunta medio que me estoy",
        "start": 1457.3400000000001,
        "end": 1462.22
    },
    {
        "text": " trancando y veo que me está tomando más de la cuenta, lo que yo hago es la dejo y sigo con otra.",
        "start": 1462.22,
        "end": 1467.6200000000001
    },
    {
        "text": " Se atratar de no perder tiempo en una pregunta. O sea, si están haciendo las cuentas normales",
        "start": 1468.62,
        "end": 1475.3
    },
    {
        "text": " con las variables, bueno, está dentro del opredisto, pero si ven que se trancan, que no les da,",
        "start": 1475.3,
        "end": 1480.1399999999999
    },
    {
        "text": " que no encuentran con la opción correcta, mi consejo es no pierdan tiempo con esa pregunta,",
        "start": 1480.1399999999999,
        "end": 1484.4199999999998
    },
    {
        "text": " dejen la si van con otra y más tarde vuelven a esa.",
        "start": 1484.4199999999998,
        "end": 1487.86
    },
    {
        "text": " Esta bastante rápida. ¿Cuál de las siguientes expresiones produce un error de compilación?",
        "start": 1487.86,
        "end": 1497.82
    },
    {
        "text": " ¿Cuál les parece? La primera, la, ¿por qué?",
        "start": 1499.82,
        "end": 1504.1399999999999
    },
    {
        "text": " Exactamente va a querer evaluar 5 an 6 primero, había una cosita, una palabrita que nombre era.",
        "start": 1508.1399999999999,
        "end": 1515.34
    },
    {
        "text": " La presidencia. Se guardan que los diferentes operadores tenían presidencia. Nosotros vimos",
        "start": 1516.34,
        "end": 1522.06
    },
    {
        "text": " una tablita de operadores, ¿sí? donde primero estaban los operadores, digamos, unarios, después",
        "start": 1522.06,
        "end": 1528.34
    },
    {
        "text": " estaban lo que se llamaban los multiplicativos, luego los aditivos y en el fondo de todo estaban",
        "start": 1528.34,
        "end": 1533.26
    },
    {
        "text": " los relacionales. Pues todos los que estaban al mismo nivel tenían igual presidencia y más",
        "start": 1533.26,
        "end": 1540.22
    },
    {
        "text": " presidencia que los del nivel siguiente. Bueno acá tenemos el an que es un operador multiplicativo",
        "start": 1540.22,
        "end": 1547.22
    },
    {
        "text": " y tenemos dos operadores relacionales. De acuerdo justamente con esa tablita de presidencias, el",
        "start": 1547.22,
        "end": 1554.98
    },
    {
        "text": " más fuerte es decir el que se aplica primero es el an y ante ausencia de paréntesis que va",
        "start": 1554.98,
        "end": 1560.94
    },
    {
        "text": " a tratar de aserla, va a tratar de asociar el an con el 5 y el 6 y le va a dar el error de tipo,",
        "start": 1560.94,
        "end": 1567.26
    },
    {
        "text": " ¿por qué? Porque 5 y 6 no son de tipo bulian, han espera dos operando de tipo bulian y se están",
        "start": 1567.26,
        "end": 1577.46
    },
    {
        "text": " contrando con los operando de tipo intéjar. Para aserla compilarla que tendría que pasar,",
        "start": 1577.46,
        "end": 1584.5
    },
    {
        "text": " tendríamos que paréntizar donde, cuatro menor que cinco, seis, mayor que tres y ahí quedaría,",
        "start": 1584.5,
        "end": 1594.54
    },
    {
        "text": " y vamos bien paréntesis ahí por ende complicaría. O sea que claramente la A es la que tiene error de",
        "start": 1595.5,
        "end": 1601.58
    },
    {
        "text": " compilación. Solo por curiosidad vamos a ver qué pasa con las demás, rapidito. True por sí",
        "start": 1601.58,
        "end": 1610.06
    },
    {
        "text": " solo, da error de compilación, claramente no, es un valor de tipo bulia. Character a menor a",
        "start": 1610.06,
        "end": 1620.06
    },
    {
        "text": " carácter, pues se pueden comparar caracteres con menor sin problemas. Estamos haciendo una comparación",
        "start": 1620.06,
        "end": 1627.62
    },
    {
        "text": " relacional entre dos valores del mismo tipo ordinal, además. False Andrew, está bien, porque han",
        "start": 1627.62,
        "end": 1636.7
    },
    {
        "text": " y dos operando de tipo bulian, no hay problema, y acá más menor y más, ¿cuál es más fuerte?",
        "start": 1636.7,
        "end": 1645.74
    },
    {
        "text": " El más, lo que dijimos, los relacionales son los más débiles de todos, o sea que menor tiene",
        "start": 1646.7,
        "end": 1654.94
    },
    {
        "text": " menos presidencia que el más, o sea que cómo va a ser pascal para evaluar esta expresión.",
        "start": 1654.94,
        "end": 1660.18
    },
    {
        "text": " 2 más 1, menor, 3 más 4, entonces claramente la A es la que produce error de compilación.",
        "start": 1660.18,
        "end": 1668.18
    },
    {
        "text": " Bien, creo que la resto, habrán visto que se valúa cualquier aspecto de cualquier cosa que dimos",
        "start": 1669.18,
        "end": 1676.94
    },
    {
        "text": " desde el inicio del curso hasta la semana de regreso. Bueno, vamos a hacerla 4.",
        "start": 1676.94,
        "end": 1685.18
    },
    {
        "text": " Estábala 5.",
        "start": 1689.42,
        "end": 1690.8600000000001
    },
    {
        "text": " A ver, acá arriba todo está la 4. Bien, otra que se responde bastante rápido.",
        "start": 1690.86,
        "end": 1703.26
    },
    {
        "text": " Bueno, dadas las siguientes declaraciones de variables. 2 variables de tipo int,",
        "start": 1707.5,
        "end": 1714.5
    },
    {
        "text": " 2 y 3, 2 variables de tipo real, R1 y R2, una variable de tipo char, se. Indique",
        "start": 1714.5,
        "end": 1724.7
    },
    {
        "text": " cual asignaciones valida. Bueno, vayamos viendo una por una, ¿sí? A R2 le asignó,",
        "start": 1724.7,
        "end": 1735.02
    },
    {
        "text": " sé, ¿qué pasa con esta? Error de tipos, porque C es de tipo char y R2 es de tipo,",
        "start": 1735.02,
        "end": 1743.46
    },
    {
        "text": " Pascal hace cuerción de char a real? No, o sea que esa es la error de compilación, error de",
        "start": 1743.46,
        "end": 1751.82
    },
    {
        "text": " tipos, o sea que la A claramente no. Bueno, la B, como toda asignación se valúa",
        "start": 1751.82,
        "end": 1760.46
    },
    {
        "text": " de derecha izquierda, R1 más R2 es una expresión de tipo real y pretendo",
        "start": 1760.46,
        "end": 1766.8600000000001
    },
    {
        "text": " asignarle una variable de tipo int, hay cuarción de real a int, no, esa también da",
        "start": 1766.8600000000001,
        "end": 1774.98
    },
    {
        "text": " error de tipos. Bien, así le quiero asignar el",
        "start": 1774.98,
        "end": 1782.3
    },
    {
        "text": " carácter A más el carácter B, ¿qué pasa? Error, ¿por qué pasa con la operación más?",
        "start": 1782.3,
        "end": 1793.3
    },
    {
        "text": " No está definida para carácteres, si está definida para int y para real. ¿Ve bien? Entonces,",
        "start": 1793.3,
        "end": 1800.3799999999999
    },
    {
        "text": " si viene en teoría el resultado de esa suma entre comillas y estuviera correcta, sería",
        "start": 1800.3799999999999,
        "end": 1805.8999999999999
    },
    {
        "text": " un carácter, bueno, sería compatible con el tipo de la variable C, pero estamos en",
        "start": 1805.9,
        "end": 1812.66
    },
    {
        "text": " presencia de una operación que no está definida para los carácteres. Así que esa tampoco.",
        "start": 1812.66,
        "end": 1821.22
    },
    {
        "text": " R1 le asigno Num, Num 2, esta expresión de qué tipo es, int y la variable destino es",
        "start": 1821.22,
        "end": 1828.68
    },
    {
        "text": " de tipo, hay cuarción de int y la real, sí, o sea que esa es correcta. Solo por curiosidad",
        "start": 1828.68,
        "end": 1838.6000000000001
    },
    {
        "text": " vamos a ver qué pasa con la E, hace, le quiero asignar el carácter R1, ¿qué problema",
        "start": 1838.6000000000001,
        "end": 1846.44
    },
    {
        "text": " hay ahí? No es un carácter, porque para hacer un carácter lo que está entre comillas",
        "start": 1846.44,
        "end": 1851.24
    },
    {
        "text": " que tendría que pasar. Tendría que ser un solo carácter, o sea un solo echidimolo, o sea",
        "start": 1851.24,
        "end": 1859.2
    },
    {
        "text": " o R entre comillas o el 1 entre comillas, pero R1, en realidad son dos carácteres pegaditos",
        "start": 1859.2,
        "end": 1866.28
    },
    {
        "text": " difrazados de 1 solo, eso ni siquiera con pila de hecho. Ojo con estas cosas, porque",
        "start": 1866.28,
        "end": 1874.0
    },
    {
        "text": " muchos estoy seguro que se durmieron, dijeron a, esto es tanto conillas, se suinchar,",
        "start": 1874.0,
        "end": 1878.6
    },
    {
        "text": " pero también en el marcalo en la E no, vean bien qué es lo que están entre comillas.",
        "start": 1878.6,
        "end": 1884.8799999999999
    },
    {
        "text": " Bueno, se entendió la 4, bueno saben que algunas son bastante rápidas y otras son un",
        "start": 1884.8799999999999,
        "end": 1897.12
    },
    {
        "text": " poquito más lentes, por ejemplo la 5, yo creo que es un poquito más lenta. Bueno,",
        "start": 1897.12,
        "end": 1906.36
    },
    {
        "text": " ellos dicen así que dadas las siguientes instrucciones, indicar la opción correcta,",
        "start": 1906.36,
        "end": 1916.6
    },
    {
        "text": " asumiendo que se ingresan siempre tres valores distintos. Y bajo un poquito, así tenemos",
        "start": 1916.6,
        "end": 1927.84
    },
    {
        "text": " ahí las opciones y vamos a dibujar acá las variables involucradas que son ABIC.",
        "start": 1927.84,
        "end": 1935.9199999999998
    },
    {
        "text": " ABIC",
        "start": 1936.64,
        "end": 1943.96
    },
    {
        "text": " y se. Bueno, leemos tres valores para a y se. Lo que sabemos es que siempre son valores",
        "start": 1943.96,
        "end": 1970.1200000000001
    },
    {
        "text": " diferentes. A ver, por ejemplo, vamos a ponerle los valores 1, 2 y 3. Bien, vamos a ejecutarlo.",
        "start": 1970.12,
        "end": 1984.04
    },
    {
        "text": " Hay menor que v, o sea que se cumplió el primerif que hacemos. Preguntamos si v es menor que",
        "start": 1984.04,
        "end": 1993.8799999999999
    },
    {
        "text": " c, v es menor que c, sí. Entonces, ¿qué hace? Escribe en pantalla el valor de a, o sea, 1.",
        "start": 1993.88,
        "end": 2005.0400000000002
    },
    {
        "text": " Vamos a ponerle acá lo que sería la pantalla y en pantalla escribe el 1.",
        "start": 2005.0400000000002,
        "end": 2013.8000000000002
    },
    {
        "text": " Bueno, vamos a ejecutarlo con otra combinación de valores. Vamos a usar también 1, 2, 3. Que combinación",
        "start": 2013.8,
        "end": 2024.04
    },
    {
        "text": " quieren? 3, 2, 1. A ver, ¿qué pasa con 3, 2, 1? Suponiendo que valen 3, 2, 1.",
        "start": 2024.04,
        "end": 2030.36
    },
    {
        "text": " Vamos a ver qué es lo que ocurre. Hay menor que v, no, hay mayor que v, o sea, ¿qué hace?",
        "start": 2030.36,
        "end": 2041.4399999999998
    },
    {
        "text": " ¿Va a cuál el es? A este de acá o a este de acá. A este. Recordemos cómo funciona el el,",
        "start": 2041.4399999999998,
        "end": 2054.04
    },
    {
        "text": " el el por defecto está asociado alif más cercano que tiene y este el cual es el el",
        "start": 2054.04,
        "end": 2060.2799999999997
    },
    {
        "text": " más cercano que tiene. Este de acá, ¿vale? Y este el cual es el el más cercano que tiene.",
        "start": 2060.2799999999997,
        "end": 2066.92
    },
    {
        "text": " Este de acá, ¿vale? Con lo cual este el no tiene más remedio que está asociado cuál,",
        "start": 2066.92,
        "end": 2073.2
    },
    {
        "text": " al de arriba el 2. Si ojo igual con la indentación, puede haber truco, que algo",
        "start": 2073.2,
        "end": 2083.84
    },
    {
        "text": " la indentación te haga pensar que es de cierta manera, pero en realidad no está, o sea,",
        "start": 2083.84,
        "end": 2090.32
    },
    {
        "text": " puede parecer algún ejercicio que la indentación no sea la masa adecuada, sí puede pasar y",
        "start": 2090.32,
        "end": 2096.0
    },
    {
        "text": " ustedes tienen que tener los ojos bien abiertos a este respecto. No confiar ciegamente en",
        "start": 2096.0,
        "end": 2100.92
    },
    {
        "text": " la indentación. Está bien, mirar bien, ¿qué es lo que sucede? De hecho, algún ejercicio",
        "start": 2100.92,
        "end": 2108.52
    },
    {
        "text": " te puede llegar a jugar alguna mala pasada porque la indentación te dio entender que en",
        "start": 2108.52,
        "end": 2113.08
    },
    {
        "text": " una cosa, pero en realidad, entonces, digamos, sacar la lupa y mirar más a fondo, no confiar",
        "start": 2113.08,
        "end": 2117.84
    },
    {
        "text": " solamente en la indentación. ¿Qué es lo claro? Son 20 preguntas. A valor de 2 cada 1, 40",
        "start": 2117.84,
        "end": 2125.96
    },
    {
        "text": " es lo que vale el parcial. Bueno, dijimos entonces que no por la indentación, si no por",
        "start": 2125.96,
        "end": 2133.12
    },
    {
        "text": " lo que razonamos, está asociado a cual al primero de todos. Bueno, dijimos, ahora menor",
        "start": 2133.12,
        "end": 2140.4
    },
    {
        "text": " que v, perdón, lo digo que no. O sea que estuvimos al último a este lse acá, 6 menor que",
        "start": 2140.4,
        "end": 2147.4
    },
    {
        "text": " v, 6 menor que v, entonces que muestra en pantalla, 6. O sea que en pantalla mostró 1. Otra combinación,",
        "start": 2147.4,
        "end": 2160.32
    },
    {
        "text": " 1, 3, 2. Vamos a ver qué pasa con 1, 3, 2. Empezamos. Ay, menor que v, sí, porque 1 es",
        "start": 2160.32,
        "end": 2175.0800000000004
    },
    {
        "text": " menor que 3. Entonces, que pregunta, si ves menor que c, ves menor que c, no, entonces",
        "start": 2175.0800000000004,
        "end": 2184.04
    },
    {
        "text": " ¿a dónde va? Ahí está el c, acá. 6 menor que a, c, vale 2 y vale 1, o sea que sí, no es",
        "start": 2184.04,
        "end": 2193.84
    },
    {
        "text": " menor que a. Bien, el el y qué es lo que hace. Escribir, o sea, 1. Bien, diame otra. No hay más.",
        "start": 2193.84,
        "end": 2208.6
    },
    {
        "text": " No, por ejemplo, a ver, 1, 2, 3 y 1, 3, 2, ya está, 3, 2, 1, 3, 1, 2, acá tenemos otra.",
        "start": 2209.16,
        "end": 2217.52
    },
    {
        "text": " Vamos, vale, arregra un poco estas variables. A ver qué pasa con 3, 1, 2. Bien, 3, 1, 2.",
        "start": 2217.52,
        "end": 2228.7999999999997
    },
    {
        "text": " Ay, menor que v, no, a no es menor que v, entonces ¿a dónde vamos? acá, 6 menor que v,",
        "start": 2228.8,
        "end": 2238.2000000000003
    },
    {
        "text": " no, se vale 2, vale 1, así que no, a dónde va? A, él es, escribe, v, o sea muestra en pantalla,",
        "start": 2238.2000000000003,
        "end": 2247.28
    },
    {
        "text": " 1, ¿sí? ¿Qué otra? 2, 1, 3. A ver qué pasa con 2 y 1, 3. Ay, menor que v, no, venimos",
        "start": 2247.28,
        "end": 2263.88
    },
    {
        "text": " a leles, C es menor que v, no, venimos a leles, que mostramos en pantalla, B es decir, 1. Y cuál",
        "start": 2263.88,
        "end": 2275.4
    },
    {
        "text": " no falta? 2, 3, 1. Ay, menor que v, ay, menor que v, se cumple la primera condición, B es",
        "start": 2275.4,
        "end": 2288.36
    },
    {
        "text": " menor que C, no, V vale 3, se vale 1, no se cumple, a dónde vamos? A este es, C es menor que",
        "start": 2288.36,
        "end": 2295.56
    },
    {
        "text": " v, ya, se vale 1, a vale 2, o sea que muestra en pantalla, C. Bueno, ¿qué es lo que pasó?",
        "start": 2295.56,
        "end": 2307.64
    },
    {
        "text": " En todos los casos sin primer mínimo de los 3 valores, a ver, siendo que siempre son diferentes,",
        "start": 2307.64,
        "end": 2316.24
    },
    {
        "text": " tomar este caso es bastante representativo de lo que sería un caso más general,",
        "start": 2316.24,
        "end": 2321.48
    },
    {
        "text": " por el único pregunta, si es menor de la mayor, nada más. Entonces, tenemos una opción que",
        "start": 2322.04,
        "end": 2328.4
    },
    {
        "text": " dice que en todos los casos imprime el mínimo de los 3 valores, no importa cómo vengan organizados,",
        "start": 2328.4,
        "end": 2333.96
    },
    {
        "text": " los datos entradas. Veamos un poquito que pasaba con las demás, imprime el mínimo de los 3",
        "start": 2333.96,
        "end": 2342.2400000000002
    },
    {
        "text": " valores ingresados, sí y solamente sí, a es menor que v, y c es mayor que a, bueno, vimos que",
        "start": 2342.2400000000002,
        "end": 2348.48
    },
    {
        "text": " sólo en ese caso no, sino que en cualquier caso imprime el mínimo, no solamente en ese caso",
        "start": 2348.48,
        "end": 2354.0
    },
    {
        "text": " puntual, lo mismo pasa acá, imprime el mínimo sí, solo sí pasan estas dos cosas, tampoco,",
        "start": 2354.0,
        "end": 2360.84
    },
    {
        "text": " vimos que pasa en cualquier caso, lo mismo con el C y lo mismo con el D, o sea que en todos los",
        "start": 2360.84,
        "end": 2368.12
    },
    {
        "text": " casos esto imprime el mínimo de los 3 valores, esta toma un poquito más de tiempo, pero como",
        "start": 2368.12,
        "end": 2375.36
    },
    {
        "text": " ahora han visto hay otras, verdad que por ahí toman un poco menos de tiempo.",
        "start": 2375.36,
        "end": 2380.1200000000003
    },
    {
        "text": " Preguntas respecto a las 5, vamos a hacer un par más, mira un poquito, ¿cómo?",
        "start": 2384.6,
        "end": 2392.08
    },
    {
        "text": " La 14, déjame ir en orden, ahí va y después cuando cortemos me preguntan de las que les",
        "start": 2393.48,
        "end": 2399.56
    },
    {
        "text": " hayan quedado. Bien, bueno el 6, este está lindo. Bueno, dado el siguiente fragmento",
        "start": 2399.56,
        "end": 2416.04
    },
    {
        "text": " de código y nos dan este fragmento de programa, que la lo miramos bien, indique cuál es la",
        "start": 2416.04,
        "end": 2427.44
    },
    {
        "text": " salida generada por su ejecución y ahí tenemos 5 posibles salidas, ¿qué tenemos que hacer?",
        "start": 2427.44,
        "end": 2438.32
    },
    {
        "text": " Corre algo, vamos a borrarlo.",
        "start": 2439.28,
        "end": 2442.2400000000002
    },
    {
        "text": " Bueno, borramos las variables y empezamos.",
        "start": 2450.16,
        "end": 2454.2000000000003
    },
    {
        "text": " Bueno, bueno, tenemos las variables y j, de tipo inteser y tenemos la variable V de tipo",
        "start": 2457.44,
        "end": 2479.32
    },
    {
        "text": " buliano. Ahí por ahí vamos a notar que pasa con la pantalla.",
        "start": 2479.32,
        "end": 2486.36
    },
    {
        "text": " Bueno, empezamos, V toma el valor inicial false y j toma el valor inicial cero,",
        "start": 2492.2000000000003,
        "end": 2498.04
    },
    {
        "text": " o sea que V comienza valiendo false y j comienza valiendo cero.",
        "start": 2498.04,
        "end": 2503.96
    },
    {
        "text": " Empieza un for que se va a ejecutar cuantas veces, tres veces, para igual 3, para igual 4 y",
        "start": 2503.96,
        "end": 2513.88
    },
    {
        "text": " para igual a 5. Bien, vamos a empezar con I valiendo 3. Bien, tenemos V y y en acá y este V y en",
        "start": 2513.88,
        "end": 2527.12
    },
    {
        "text": " cierre con cual es. Con este de acá, con lo cual dentro de este fortenemos un V que tiene V y",
        "start": 2527.12,
        "end": 2537.3599999999997
    },
    {
        "text": " en acá y en acá, o sea que estas son las instrucciones afectadas por el V. Acá hay que tener lo",
        "start": 2537.3599999999997,
        "end": 2543.3199999999997
    },
    {
        "text": " camino gusta llamar paciencia de hormiga y con toda la paciencia que vieron que las hormigas tienen",
        "start": 2543.3199999999997,
        "end": 2551.12
    },
    {
        "text": " mucha paciencia. Y el tomándose el trabajo de ir anotando las variables y no desesperarse. Bien,",
        "start": 2551.12,
        "end": 2559.12
    },
    {
        "text": " empezamos con el V, j es menor que I, sí porque j es 0 y i val 3, o sea que esta condición dio true,",
        "start": 2559.12,
        "end": 2569.64
    },
    {
        "text": " ¿qué debemos hacer? Evaluarla al lado. Se cumple not B, bueno analicemos eso, V vale false,",
        "start": 2569.64,
        "end": 2578.7599999999998
    },
    {
        "text": " not B quiere decir la negación de V, o sea el opuesto de V y el opuesto de false que en es true,",
        "start": 2580.0,
        "end": 2587.96
    },
    {
        "text": " o sea que esta expresión da como resultado true, V vale false. Si yo le aplico el operador not,",
        "start": 2587.96,
        "end": 2597.7999999999997
    },
    {
        "text": " esto cuando vimos la semántica de los operadores lógicos dijimos que not aplicado false la true,",
        "start": 2598.36,
        "end": 2604.4
    },
    {
        "text": " está bien, con lo cual el resultado de esto es true y el resultado de la de la izquierda cual era,",
        "start": 2605.5600000000004,
        "end": 2611.5600000000004
    },
    {
        "text": " también era true, o sea que tenemos true, true, se entiende?",
        "start": 2611.5600000000004,
        "end": 2616.8
    },
    {
        "text": " Sí, a ver, esto que está casi una expresión de tipo, es exacto, es porque tenemos un ant,",
        "start": 2616.8,
        "end": 2630.32
    },
    {
        "text": " exactamente, si me da true esto y me da true esto otro, el ant me va a dar true y voy a entrar",
        "start": 2630.32,
        "end": 2635.88
    },
    {
        "text": " al Y, ¿sabien? Recuerden las expresiones bulianas son como su nombre lo hizo expresiones de tipo bulian,",
        "start": 2635.88,
        "end": 2644.48
    },
    {
        "text": " pueden ser el resultado de comparar cosas mediante operadores relacionales, pero también pueden",
        "start": 2645.04,
        "end": 2651.52
    },
    {
        "text": " involucrar el uso de operadores lógicos, an o inoto, lo que importa es que esto es una expresión,",
        "start": 2651.52,
        "end": 2657.32
    },
    {
        "text": " cuyo resultado va a ser true false y ese resultado es el que yo voy a tomar para la parte derecha del",
        "start": 2657.32,
        "end": 2662.88
    },
    {
        "text": " and, ¿por qué pasa? acá tenemos un and, el de la izquierda medio true, si el de la derecha me",
        "start": 2662.88,
        "end": 2670.2
    },
    {
        "text": " irá false que ocurre, el antedafol sí corta el y, ¿sabien? pero en el momento me vienen dando true",
        "start": 2670.2,
        "end": 2677.7999999999997
    },
    {
        "text": " las 2, ¿sabien? con lo cual, efectivamente entramos, ¿cámos claro? ¿sí? mostramos el carácter S,",
        "start": 2677.7999999999997,
        "end": 2687.6
    },
    {
        "text": " o sea que tenemos S en pantalla y luego ajota les sumamos, o sea que ahora ajota deja de valer",
        "start": 2687.6,
        "end": 2696.56
    },
    {
        "text": " 0 y pasa valer 1, volvemos al guay, ajota es menor que I, sí, ajota vale 1 y vale 3,",
        "start": 2696.56,
        "end": 2705.92
    },
    {
        "text": " nosotros modificamos cual perdón, no, no, no, no, porque qué pasa, esta es la segunda entrada del",
        "start": 2710.16,
        "end": 2715.32
    },
    {
        "text": " guay, estando todavía en la primera entrada del foro, acá tenemos lo que se llama literaciones",
        "start": 2715.32,
        "end": 2722.92
    },
    {
        "text": " sanidad, o sea una estructura repetitiva dentro de otra estructura repetitiva, ojo con eso,",
        "start": 2722.92,
        "end": 2727.8
    },
    {
        "text": " que de hecho fue lo que hicieron en la primera tarea, o sea con la I valiendo 3, todavía estoy ejecutando",
        "start": 2727.8,
        "end": 2736.0
    },
    {
        "text": " el guay para I valiendo 3, ¿sí? entonces volvemos al guay la que creció fue jota, que ahora vale 1,",
        "start": 2736.0,
        "end": 2747.56
    },
    {
        "text": " pero la I sigo valiendo 3, hasta acá bueno, entonces jota que ahora vale 1, sigue siendo menor",
        "start": 2747.56,
        "end": 2756.12
    },
    {
        "text": " ahí que vale 3, sí, no te ve, se sigue cumpliendo porque ve sigo valiendo false, o sea que volvemos",
        "start": 2756.12,
        "end": 2764.92
    },
    {
        "text": " a entrar, que mostramos, una segunda S y después ajota les sumamos 1, o sea que ahora ajota deja",
        "start": 2764.92,
        "end": 2774.96
    },
    {
        "text": " de valer 1 para valer 2, está bien, volvemos al guay, j es menor que I, sí porque j vale 2 e igual",
        "start": 2774.96,
        "end": 2787.2400000000002
    },
    {
        "text": " 3, o sea que se sigue cumpliendo, no te ve, también se sigue cumpliendo porque ve sigo valiendo false,",
        "start": 2787.2400000000002,
        "end": 2794.04
    },
    {
        "text": " entramos de vuelta, mostramos S, una tercera S y ajota les sumamos 1, o sea que ahora ajota",
        "start": 2794.04,
        "end": 2804.6
    },
    {
        "text": " vale 3, j es menor que I, no, j es igual ahí, o sea que la parte izquierda del an da false que hacemos,",
        "start": 2804.6,
        "end": 2816.96
    },
    {
        "text": " salimos del primer y para entrar al segundo y, bien j es mayor que 0, sí porque vale 3,",
        "start": 2816.96,
        "end": 2827.2799999999997
    },
    {
        "text": " V, vale true, no, V vale false, o sea que la parte izquierda del wild que dio, la parte izquierda",
        "start": 2828.2400000000002,
        "end": 2838.96
    },
    {
        "text": " dio true, porque j es mayor que 0, sin embargo la parte derecha dio false, entonces tenemos true",
        "start": 2838.96,
        "end": 2845.76
    },
    {
        "text": " al false que pasa, false no entra, viene a este end y a V le asignamos not B, esto funciona como",
        "start": 2845.76,
        "end": 2857.96
    },
    {
        "text": " cualquier asignación, se valúa derecha izquierda, toma el valor actual de V que es cual, false,",
        "start": 2857.96,
        "end": 2862.76
    },
    {
        "text": " al aplicarle not que me queda, me va a quedar true y lo guardamos en la propia variante,",
        "start": 2862.76,
        "end": 2870.1600000000003
    },
    {
        "text": " ve bien, si, recién ahora, a donde volvemos, al for con I valiendo 4, o sea que ahora volvemos al",
        "start": 2870.16,
        "end": 2886.8799999999997
    },
    {
        "text": " for con I valiendo 4, está divertido esto, bueno, entramos con I valiendo 4, j es menor que I,",
        "start": 2886.88,
        "end": 2900.2400000000002
    },
    {
        "text": " j vale 3 y vale 4, o sea que efectivamente j es menor que I, bien, se cumple not B, no se cumple",
        "start": 2901.6400000000003,
        "end": 2912.04
    },
    {
        "text": " porque ahora V vale true, con lo cual la negación de B va a valor false, o sea que la parte derecha",
        "start": 2912.04,
        "end": 2919.48
    },
    {
        "text": " del end que pasa, false, tenemos true and false, resultado del end, false que hacemos, salimos",
        "start": 2919.48,
        "end": 2929.0
    },
    {
        "text": " de este wild, venimos a X, y vamos a evaluar el siguiente, se entendió eso, j es mayor que 0,",
        "start": 2929.0,
        "end": 2938.24
    },
    {
        "text": " sí porque vale 3, se cumple B, sí porque V vale true, o sea que j es mayor que 0 y V vale true,",
        "start": 2939.04,
        "end": 2946.3999999999996
    },
    {
        "text": " o sea que al resultado del end es true, que hacemos, entramos, mostramos que dice ahí, B, mostramos",
        "start": 2946.3999999999996,
        "end": 2955.4799999999996
    },
    {
        "text": " el carácter B, y después ajota que le asignamos, j menos 1, o sea que j deja de valor 3 y pasa",
        "start": 2955.4799999999996,
        "end": 2967.56
    },
    {
        "text": " a valor 2, ¿sabien? j es mayor que 0, o sea, de acá tenemos que volver a Luay, no, j es mayor que 0,",
        "start": 2967.56,
        "end": 2977.68
    },
    {
        "text": " sí porque vale 2, se sigue cumpliendo V, sí porque no cambió de valor, entonces que pasa,",
        "start": 2977.68,
        "end": 2983.36
    },
    {
        "text": " entramos, que mostramos, mostramos una segunda B y ajota le restamos 1, o sea que j ahora vale 1,",
        "start": 2983.36,
        "end": 2996.04
    },
    {
        "text": " j ahora vale 1, ¿no? no, estoy acá, ¿qué hacemos? volvemos a Luay, j es mayor que 0, sí, j vale 1 que",
        "start": 2997.88,
        "end": 3008.08
    },
    {
        "text": " es mayor que 0, se sigue cumpliendo V, se sigue cumpliendo V, entonces que hacemos, mostramos por",
        "start": 3008.08,
        "end": 3015.44
    },
    {
        "text": " 3, a B es B y ajota le restamos 1 y ahora ajota pasa a valor 0, ¿sabien? volvemos a Luay,",
        "start": 3015.44,
        "end": 3028.32
    },
    {
        "text": " j es mayor que 0, no, j ahora es igual a 0, o sea que la parte izquierda del end no se cumple,",
        "start": 3028.32,
        "end": 3035.36
    },
    {
        "text": " ¿qué hacemos? salimos, venimos al end y ejecutamos esta, a B le asignamos su opuesto, o sea que",
        "start": 3035.36,
        "end": 3043.7200000000003
    },
    {
        "text": " a B vuelve a valer, false, si a B vuelve a valer false y ahora, a B la ver ahí cuando",
        "start": 3043.72,
        "end": 3059.4399999999996
    },
    {
        "text": " recuperamos imagen, bien, estamos acá donde volvemos, volvemos al forco ni valiendo 5, bueno,",
        "start": 3059.4399999999996,
        "end": 3071.24
    },
    {
        "text": " esto está más cerca de terminar y ahora toma el valor 5, bueno, j es menor que I, j vale 0 y",
        "start": 3071.24,
        "end": 3083.68
    },
    {
        "text": " vale 5, qué lindo, bien, se cumple no, ¿de? sí, ¿por qué B vale false? su negación,",
        "start": 3083.68,
        "end": 3092.9199999999996
    },
    {
        "text": " vale, entonces que vamos a mostrar, vamos a traer ese, bueno, y esto es para j valiendo",
        "start": 3092.92,
        "end": 3101.28
    },
    {
        "text": " 0, ¿qué hacemos ahora? le sumamos 1, o sea que j pasa a valor 1, cuando volvamos al",
        "start": 3101.28,
        "end": 3110.4
    },
    {
        "text": " igual, j va a ser menor que I, sí, porque va a ser 1 menor que 5, la segunda se va a seguir",
        "start": 3111.0,
        "end": 3118.32
    },
    {
        "text": " cumpliendo, ¿qué va a ser? vamos a traer ese por segunda vez y después que le va a pasar a",
        "start": 3118.32,
        "end": 3125.64
    },
    {
        "text": " j, va a pasar a valor 2, bueno, volvemos al igual, 12 es menor que 5, la de la derecha ya vimos",
        "start": 3125.64,
        "end": 3135.76
    },
    {
        "text": " que se sigue cumpliendo, mostramos de vuelta a ese y que hacemos con j, les sumamos 1 y ahora",
        "start": 3135.76,
        "end": 3144.82
    },
    {
        "text": " j va a pasar a valer 3, volvemos al y 13 es menor que 5, se sigue cumpliendo la derecha",
        "start": 3144.82,
        "end": 3152.32
    },
    {
        "text": " que hacemos, mostramos una 4 a ese y j ahora vale 4, 4 es menor que 5, se cumple esta",
        "start": 3152.32,
        "end": 3165.32
    },
    {
        "text": " también, mostramos ese, j ahora toma el valor 5, estos dos no están más, 5 es menor",
        "start": 3165.32,
        "end": 3177.0
    },
    {
        "text": " que 5, no, deja de cumplirse la parte izquierda del al, salvo, j es mayor que 0, sí porque",
        "start": 3177.0,
        "end": 3188.06
    },
    {
        "text": " j ahora que valor tiene, 5, se cumple B, no porque B vale false, entonces que va a pasar,",
        "start": 3188.06,
        "end": 3197.32
    },
    {
        "text": " no entro, vengo a este N y a B le asigno la negación de B, o sea que vea ahora va a pasar",
        "start": 3197.32,
        "end": 3204.44
    },
    {
        "text": " a valer true y por suerte para nosotros que pasó, esta fue la última entrada al foro,",
        "start": 3204.44,
        "end": 3212.2999999999997
    },
    {
        "text": " porque era para ir valiendo 3, 4 y 5 y tu ves, algunos son más largos y otros son",
        "start": 3212.3,
        "end": 3221.38
    },
    {
        "text": " más cortos, no los 20 no, ya estuvimos viendo 2 o 3 que son más cortitos, por eso digo",
        "start": 3221.38,
        "end": 3228.9
    },
    {
        "text": " paciencia de hormiga, vamos a ver si hicimos las cuentas bien y si esas salidas están",
        "start": 3228.9,
        "end": 3234.2200000000003
    },
    {
        "text": " entre las opciones, y las opciones las tenemos por acá y bueno 3 es es 3 ves y 5 es es",
        "start": 3234.22,
        "end": 3245.98
    },
    {
        "text": " la opción B, acá no vale mucho la pena discutir porque las otras dos no, las otras 4 no,",
        "start": 3245.98,
        "end": 3254.0
    },
    {
        "text": " perdón, porque bueno lo corrimos y vimos que da eso, se entendió, vamos a hacer una",
        "start": 3254.0,
        "end": 3262.2599999999998
    },
    {
        "text": " más, vamos a hacer la 7, que trata un poquito de arreglos y dejamos por acá y bueno,",
        "start": 3262.26,
        "end": 3274.1000000000004
    },
    {
        "text": " ahí tenemos otro código, ahora considera el siguiente programa, indique cual de las opciones",
        "start": 3277.5400000000004,
        "end": 3288.7000000000003
    },
    {
        "text": " se imprime, nuevamente paciencia de hormiga, bien vamos a dibujar por sacar estas variables",
        "start": 3288.7,
        "end": 3300.3399999999997
    },
    {
        "text": " acá, bien, bueno, tenemos un rango, un subrango que toma los valores del 1 al 3 y después",
        "start": 3300.34,
        "end": 3323.38
    },
    {
        "text": " tenemos un tipo arreglo que es un arreglo, un arrae de cuántas celdas, 3 celdas numeradas",
        "start": 3323.38,
        "end": 3331.06
    },
    {
        "text": " de 1 a 3 y en cada celdaba un entero, tenemos dos variables a de tipo arreglo, o sea que",
        "start": 3331.06,
        "end": 3340.5
    },
    {
        "text": " ya, a esto o esto y los índices son 1, 2 y 3 y después tenemos una variable y de tipo",
        "start": 3340.5,
        "end": 3364.32
    },
    {
        "text": " arreglo, o sea que los valores que puede tomar y van de 1 a 3, o sea que dibujamos por acá y va",
        "start": 3364.32,
        "end": 3371.8
    },
    {
        "text": " a tomar valores de 1 a 3, bueno, empezamos, miren la primera línea, que tenemos en la primera línea,",
        "start": 3371.8,
        "end": 3382.6000000000004
    },
    {
        "text": " todo el foro, o sea, comienzo, fin y código alcanzado por el foro está todo en la misma línea,",
        "start": 3383.88,
        "end": 3390.44
    },
    {
        "text": " desde igual 1 hasta 3, a que quiere decir a entre corchetes y, en la posición y de la reglo a",
        "start": 3391.0,
        "end": 3400.48
    },
    {
        "text": " guardamos y, bueno, y ¿qué mueve aquí? ahí, y bueno en la posición 1 vamos a guardar 1 en la 2, 2,",
        "start": 3400.48,
        "end": 3408.84
    },
    {
        "text": " sin la 3, o sea que la reglo va a quedar inicializado con los mismos valores que sus índices,",
        "start": 3408.84,
        "end": 3414.92
    },
    {
        "text": " ahí puntó Cm acá y se terminó, ahí le asignamos 1, o sea que ítoma el valor inicial 1,",
        "start": 3415.52,
        "end": 3426.32
    },
    {
        "text": " esto fíjense que no está dentro del foro, porque acá teníamos un punto y coma, el foro terminó",
        "start": 3429.16,
        "end": 3434.4
    },
    {
        "text": " acá, ahí le asignamos 1 y enseguida que le asignamos y más 1 dice ahí, o sea que í queda con",
        "start": 3434.4,
        "end": 3444.64
    },
    {
        "text": " que valor con 2, o sea que deja de valer 1 y pasaba a valer 2, bueno, ya que empiezan los",
        "start": 3444.64,
        "end": 3453.72
    },
    {
        "text": " trabalenguas, así que hay que prestar mucha atención para no marearse, primero como toda asignación",
        "start": 3453.72,
        "end": 3460.64
    },
    {
        "text": " se lee como, de derecha izquierda, arreglo a en la posición y más 1, a ver cuánto valeí y",
        "start": 3460.64,
        "end": 3469.08
    },
    {
        "text": " vale 2, es decir que í más 1 vale 3, o sea que estoy queriendo acceder dentro de la reglo a a la",
        "start": 3469.08,
        "end": 3477.64
    },
    {
        "text": " posición 3, a lo que está guardado en la posición 3, y lo que está guardando en la posición 3 es esto,",
        "start": 3477.64,
        "end": 3483.36
    },
    {
        "text": " un 3, ese 3 que es todo esto se lo asignó a en qué posición, en la 2, o sea que lo que está en",
        "start": 3483.36,
        "end": 3494.96
    },
    {
        "text": " la posición 3 es copiado hacia la posición 2, o sea que lo que está acá este 3 que pasa,",
        "start": 3495.04,
        "end": 3502.0
    },
    {
        "text": " es copiado hacia la posición 2, o sea el 2 que está acá dentro es sobre escrito por este 3,",
        "start": 3504.42,
        "end": 3510.32
    },
    {
        "text": " hasta acá, bien, otro formante, para ahí, desde 1 hasta 3 mostramos el contenido del",
        "start": 3514.68,
        "end": 3524.6
    },
    {
        "text": " acelda, perdón me salte una instrucción, gracias, menos mal que hay que tener paciencia hormiga,",
        "start": 3524.6,
        "end": 3529.2
    },
    {
        "text": " bien, hacemos esta y después el form, a de y cuánto vale y que valor tiene 2, o sea que a de y",
        "start": 3529.2,
        "end": 3541.0
    },
    {
        "text": " esto de acá vale 3, le sumamos 1, o sea 4 y ese 4 en qué posición lo guardamos, en la 3,",
        "start": 3541.0,
        "end": 3551.2
    },
    {
        "text": " porque iba a leer 2 y más 1 vale 3, o sea que en la posición 3 de la reglo ponemos lo que está",
        "start": 3551.2,
        "end": 3559.3599999999997
    },
    {
        "text": " guardado en la posición 2 que es 3 más 1, 4, vieron que es bien trabalenguas, o sea que el 4",
        "start": 3559.3599999999997,
        "end": 3567.2799999999997
    },
    {
        "text": " se guarda en la posición 3, o sea que acá este 3 es cambiado por un 4, ahora sí el form,",
        "start": 3567.28,
        "end": 3581.0800000000004
    },
    {
        "text": " desde 1 hasta 3 mostramos lo que está en la posición y con la espacia blanco, o sea que en pantalla",
        "start": 3582.0800000000004,
        "end": 3590.5600000000004
    },
    {
        "text": " que es lo que vamos a mostrar, vamos a mostrar 1 espacio 3 espacio 4, 1 1 un espacio 1 3 un espacio",
        "start": 3591.52,
        "end": 3601.4
    },
    {
        "text": " 1 4, hasta acá, ahí le asignamos 1, o sea que ahora ahí deja de valer 2 y pasa vale 1,",
        "start": 3601.4,
        "end": 3615.7200000000003
    },
    {
        "text": " bueno esta de acá, a en qué posición, en la posición 1 y ahí tenemos 1, ese 1 lo vamos a",
        "start": 3618.6,
        "end": 3628.1600000000003
    },
    {
        "text": " colocar en a en la posición 2, o sea que lo que está en la posición 1 se copia a la posición 2",
        "start": 3628.16,
        "end": 3636.2799999999997
    },
    {
        "text": " y que hay en la posición 1, 1, este 1 es copiado a la posición 2, o sea dentro de la posición 2",
        "start": 3639.6,
        "end": 3646.8799999999997
    },
    {
        "text": " este 3 va y queda 1, a bien hasta acá, ahí le sumamos 1 y el resultado lo guardamos en",
        "start": 3646.88,
        "end": 3659.48
    },
    {
        "text": " y o sea que ahora ahí deja de valer 1 y pasa vale 2, bien ya me perdí esta vamos acá,",
        "start": 3659.48,
        "end": 3671.6
    },
    {
        "text": " bien ahora está de acá, a en la posición y cuanto vale y ahora 2 y allí que hay, o sea que",
        "start": 3671.6,
        "end": 3681.48
    },
    {
        "text": " esto da 1, menos 1 da 0 y ese 0 lo vamos a guardar en el arreglo en la posición y menos 1,",
        "start": 3681.48,
        "end": 3690.44
    },
    {
        "text": " cuanto vale y 2, o sea que y menos 1 es 1, o sea que en la posición 1 de la reglo vamos a poner",
        "start": 3690.44,
        "end": 3697.72
    },
    {
        "text": " 1, 0 en la posición 1 de la reglo colocamos 1, 0 no me combina ninguna instrucción,",
        "start": 3697.72,
        "end": 3708.2799999999997
    },
    {
        "text": " bien el último for que hace, vuelve a recorrer mostrando el contenido de cada posición separado con",
        "start": 3708.2799999999997,
        "end": 3717.6
    },
    {
        "text": " la espacio blanco, o sea 0, 1, 4, 0, 1, 4, bueno vamos a ver si tenemos entre las opciones 1, 3, 4, 0, 1, 4,",
        "start": 3717.6,
        "end": 3736.92
    },
    {
        "text": " acá está, la C hasta acá, esto es un parcial de programación, no, hay que tener mucha paciencia,",
        "start": 3736.92,
        "end": 3752.36
    },
    {
        "text": " hay que leer muy bien lo que se pide la letra, no confiarse en la indentación y tratar de lo que",
        "start": 3752.36,
        "end": 3762.48
    },
    {
        "text": " hicimos, no retener en la cabeza de cada uno los valores de las variables, dibujarlas, anotarlas,",
        "start": 3762.48,
        "end": 3770.88
    },
    {
        "text": " ejecutarlas con mucha paciencia porque es muy fácil equivocarse, es muy fácil que te dé",
        "start": 3770.88,
        "end": 3776.64
    },
    {
        "text": " un resultado diferente y es muy fácil darle a una opción que es incorrecta,",
        "start": 3776.64,
        "end": 3781.8
    },
    {
        "text": " ok, bueno cortamos por acá el resto de la clase",
        "start": 3781.8,
        "end": 3788.28
    }
]