[
    {
        "text": " Nosotros vimos todo una primera parte de racionalidad, del costo oportunidad, ¿verdad?",
        "start": 0.0,
        "end": 25.36
    },
    {
        "text": " Ahora empezamos a ver el tema de empresas, es decir, cómo toma la decisión en las empresas.",
        "start": 25.36,
        "end": 30.36
    },
    {
        "text": " Estoy tuviendo la función de producción, los factores productivos, el tema de los rendimientos",
        "start": 30.36,
        "end": 38.36
    },
    {
        "text": " de los factores, que ya lo estuvieron viendo en macro, ustedes, pero en definitiva esto se",
        "start": 38.36,
        "end": 42.04
    },
    {
        "text": " llamaba micro, una unidad individual. También vieron el instrumento de frontera de procedimiento",
        "start": 42.04,
        "end": 47.36
    },
    {
        "text": " y ahora vamos a ver, dentro de la línea de la empresa, cómo va a definir su conducta,",
        "start": 47.36,
        "end": 70.36
    },
    {
        "text": " cómo va a tomar las decisiones. Si vamos a modernizar un poquito que antes de iniciar la",
        "start": 70.36,
        "end": 76.36
    },
    {
        "text": " con estos conceptos que tuvimos viendo, fue lo que tuvimos también alizando. Entonces, como",
        "start": 76.36,
        "end": 81.48
    },
    {
        "text": " Marco general, ¿cuál es el objetivo que una empresa tiene? Bueno, una empresa persigue",
        "start": 81.48,
        "end": 88.36
    },
    {
        "text": " maximizar su beneficios, maximizar su ganancia, entonces el marco que nosotros vamos a",
        "start": 88.36,
        "end": 95.12
    },
    {
        "text": " hacer, como ilo conductor, parece curso. Obviamente que si bien no nos rige otro objetivo,",
        "start": 95.12,
        "end": 106.12
    },
    {
        "text": " sabemos que hay otros elementos que aún en el marco, puede hacer que la empresa produzca",
        "start": 106.12,
        "end": 116.12
    },
    {
        "text": " sin perseguir este objetivo. Por ejemplo, introducir un nuevo producto en el mercado, a veces",
        "start": 116.12,
        "end": 121.12
    },
    {
        "text": " tiene un tiempo y tiene un costo mayor, obviamente que una vez que el producto te impuesto.",
        "start": 121.12,
        "end": 128.12
    },
    {
        "text": " Así como te dice en acá, entrar en un mercado penetraramente en un mercado, lograr que el",
        "start": 128.12,
        "end": 137.12
    },
    {
        "text": " producto tenga visibilidad, ahí sea vendido por los consumidores, puede según el tipo",
        "start": 137.12,
        "end": 143.12
    },
    {
        "text": " de bien, según el mercado, según la marca, etcétera, etcétera, etcétera, desvictuar un poco",
        "start": 143.12,
        "end": 150.12
    },
    {
        "text": " el objetivo. Pero en última instancia, si ocurre eso va a ser un corto plazo, si no estamos",
        "start": 150.12,
        "end": 154.92000000000002
    },
    {
        "text": " hablando que una empresa va a tener pérdidas indefinidamente, está tratando de imponer un",
        "start": 154.92000000000002,
        "end": 160.08
    },
    {
        "text": " producto. Entonces, estamos hablando que la conducta racional de la empresa y se ponemos",
        "start": 160.08,
        "end": 167.04000000000002
    },
    {
        "text": " que no vamos a mover que en el corto plazo, que en el corto plazo es la tecnología, es decir,",
        "start": 167.04,
        "end": 175.04
    },
    {
        "text": " la vinculación entre los factores productivos, capital y trabajo, el precio de los insumos,",
        "start": 175.04,
        "end": 180.64
    },
    {
        "text": " materias primas, todos los elementos que necesiten la empresa para producir el producto, por",
        "start": 180.64,
        "end": 187.56
    },
    {
        "text": " supuesto que el salario también, como otro factor importante que va a demandar la empresa,",
        "start": 187.56,
        "end": 195.16
    },
    {
        "text": " está tardado por el mercado, es decir, la empresa también va a ser tomadora de precios de los",
        "start": 195.16,
        "end": 199.96
    },
    {
        "text": " insumos y del salario. Digo también porque también el producto que vende, el producto que va a",
        "start": 199.96,
        "end": 207.32
    },
    {
        "text": " producir la empresa, el precio también viene dado por el mercado. En definitiva entonces",
        "start": 207.32,
        "end": 212.84
    },
    {
        "text": " estamos en un enfoque de corto plazo donde la tecnología está dada y los precios vienen",
        "start": 212.84,
        "end": 221.24
    },
    {
        "text": " dado por el mercado. No olvidemos que estamos hablando de un mercado competitivo, el mercado",
        "start": 221.24,
        "end": 227.8
    },
    {
        "text": " competencia perfecta, estrictamente hablando, estamos hablando de muchísima cantidad de",
        "start": 227.8,
        "end": 233.88
    },
    {
        "text": " agentes que intervienen en ese mercado. Muchos son los compradores, muchos son los vendedores.",
        "start": 233.88,
        "end": 239.88
    },
    {
        "text": " Lo importante de esto es tomar en cuenta que esa interacción de esa especie de atomización",
        "start": 239.88,
        "end": 246.68
    },
    {
        "text": " que hay de tantos agentes hace que justamente ninguno se influye, ninguno tenga poder para",
        "start": 246.68,
        "end": 252.8
    },
    {
        "text": " incidir en el precio del mercado. De ahí que esa conjunción, quienes quieren vender, los",
        "start": 252.8,
        "end": 258.44
    },
    {
        "text": " que ofrecen y los que quieren comprar, que son los consumidores, hace que en definitiva",
        "start": 258.44,
        "end": 263.24
    },
    {
        "text": " ningún impongan en nada y en su conjunto es el mercado que deshide el precio y la cantidad",
        "start": 263.24,
        "end": 269.88
    },
    {
        "text": " transada en consecuencia. Sí, competencia perfecta.",
        "start": 269.88,
        "end": 278.08
    },
    {
        "text": " Oh, me he caido competitivo, ya saludé a que es un mercado competitivo. Estamos hablando",
        "start": 278.08,
        "end": 288.28
    },
    {
        "text": " de donde nadie ventaja al otro, donde los productos son homogéneos. Entonces, en este",
        "start": 288.28,
        "end": 302.84
    },
    {
        "text": " marco teórico, muchas chachos, la empresa va a vender. La empresa va a vender a un",
        "start": 302.84,
        "end": 309.67999999999995
    },
    {
        "text": " precio que ha venido por el mercado. Esto es un dato para la empresa. Lo que tiene que",
        "start": 309.67999999999995,
        "end": 315.64
    },
    {
        "text": " determinar es el nivel de cantidad de producción que reitero, producir y vender acais lo mismo.",
        "start": 315.64,
        "end": 322.64
    },
    {
        "text": " Entonces, en el enfoque maximizador que tiene la empresa, lo que tiene que determinar",
        "start": 322.64,
        "end": 328.71999999999997
    },
    {
        "text": " es justamente el nivel de cantidad donde maximiza el beneficio. El ingreso total va",
        "start": 328.71999999999997,
        "end": 336.12
    },
    {
        "text": " instalado por precio por la cantidad y uno va a dar esta gráfica. Es decir, cuanto",
        "start": 336.12,
        "end": 344.74
    },
    {
        "text": " más produce la empresa, cuanto más vendela la empresa, más ingreso tiene, obviamente.",
        "start": 344.74,
        "end": 349.92
    },
    {
        "text": " Como pueden observar acá, usted es, acá hay un precio de 40, este ejemplo es el mismo",
        "start": 349.92,
        "end": 366.56
    },
    {
        "text": " que está en la ficha biográfica, el precio es 40. Entonces, obviamente, a medida que va",
        "start": 366.56,
        "end": 372.12
    },
    {
        "text": " aumentando su nivel de producción, bueno, el ingreso que tiene es mayor. En este caso,",
        "start": 372.12,
        "end": 380.76
    },
    {
        "text": " la empresa tiene una capacidad de producir 200 unidades, por lo tanto si produjera la 200",
        "start": 380.76,
        "end": 387.48
    },
    {
        "text": " unidades, el ingreso sería 8.000. ¿Por qué le digo si produjera y sería? Porque lo que",
        "start": 387.48,
        "end": 394.84000000000003
    },
    {
        "text": " hay que analizar acá es que si bien la empresa tiene una capacidad de producir máximo",
        "start": 394.84000000000003,
        "end": 400.46
    },
    {
        "text": " de 200 unidades, eso no quiere decir que ese sea el punto más conveniente de producir.",
        "start": 400.46,
        "end": 408.02
    },
    {
        "text": " ¿Alguien tiene idea por qué? ¿Cómo? ¿Los costos? ¿Los costos? ¿Por qué? ¿Por qué?",
        "start": 408.02,
        "end": 419.08
    },
    {
        "text": " ¿Por qué? ¿Por qué lo siras que hay que entrar a la niña?",
        "start": 419.08,
        "end": 424.24
    },
    {
        "text": " ¿Está? Es un poco lo que decíamos en la introducción está a esta charla, es decir,",
        "start": 424.24,
        "end": 429.04
    },
    {
        "text": " sí, está bien, el ingreso total es mayor, pero los costos también crecen. Entonces,",
        "start": 429.04,
        "end": 434.92
    },
    {
        "text": " lo que decía es, bueno, puede llegar un momento a producir, aparte de temenada cantidad,",
        "start": 434.92,
        "end": 439.96000000000004
    },
    {
        "text": " tengas pérdidas marginales. Siempre ahí tenemos que darle en temenos marginales, es decir,",
        "start": 439.96000000000004,
        "end": 445.28000000000003
    },
    {
        "text": " bueno, producir más unidades, me puede implicar que los costos superen el ingreso. No lo",
        "start": 445.28000000000003,
        "end": 450.18
    },
    {
        "text": " tenemos que el ingreso es 40 por cada unidad acá, ¿sí? Lo ven, ahora lo vamos a ver un",
        "start": 450.18,
        "end": 455.22
    },
    {
        "text": " poquito más. Entonces, lo vamos a ver con esta idea, no siempre producir el máximo,",
        "start": 455.22,
        "end": 461.54
    },
    {
        "text": " es el máximo de producción, es el punto donde maximiza el beneficio, hay que tener",
        "start": 461.54,
        "end": 468.46000000000004
    },
    {
        "text": " cuidado, hay que tomar en cuenta lo que dice los costos, los costos marginales.",
        "start": 468.46000000000004,
        "end": 473.18
    },
    {
        "text": " Ingressio total es precio por cantidad, el ingreso medio, el punto vista conceptual sería",
        "start": 473.18,
        "end": 482.42
    },
    {
        "text": " la cantidad de dinero que ingresa a la empresa en promedio por cada unidad vendido producida.",
        "start": 482.42,
        "end": 489.22
    },
    {
        "text": " Bueno, más allá que matemáticamente es sencillo, hace cuenta que P por Q, dividió Q,",
        "start": 489.22,
        "end": 498.3
    },
    {
        "text": " pues igual a P, conceptualmente lo que quiero que los ha queemos, ¿no? Es decir, bueno,",
        "start": 498.3,
        "end": 503.7
    },
    {
        "text": " ¿a cuánto va a vender la empresa todas las unidades al precio? Por lo tanto, el precio",
        "start": 503.7,
        "end": 510.62
    },
    {
        "text": " promedio no puede ser otro que precio, más allá de la cuenta matemática que se necesita.",
        "start": 510.62,
        "end": 517.0600000000001
    },
    {
        "text": " Y marginalmente también, ¿no? Marginalmente que es cuánto le ingresa la empresa por vender",
        "start": 517.0600000000001,
        "end": 525.26
    },
    {
        "text": " una unidad más, ¿cuál es el impacto sobre el ingreso total de una unidad diacional? El",
        "start": 525.26,
        "end": 530.06
    },
    {
        "text": " precio del bien, estamos en el mercado competitivo por lo tanto la empresa vende ex unidades o",
        "start": 530.06,
        "end": 535.5
    },
    {
        "text": " tiene un ingreso total. Si vende aquí más uno, la diferencia es P.",
        "start": 535.5,
        "end": 538.74
    },
    {
        "text": " Estamos bien.",
        "start": 545.74,
        "end": 546.26
    },
    {
        "text": " Entonces, acá en esta gráfica nos permite ver justamente conceptualmente estos componentes",
        "start": 546.26,
        "end": 556.9
    },
    {
        "text": " que estuvimos viendo. La empresa tiene acá expresado de la cantidad que puede llegar",
        "start": 556.9,
        "end": 564.02
    },
    {
        "text": " a producir a este precio de 40, produce evidentemente diferentes volúmenes a BM, pero este",
        "start": 564.02,
        "end": 575.02
    },
    {
        "text": " precio 40 es igual al precio del bien, es igual al ingreso medio y es igual al ingreso",
        "start": 575.02,
        "end": 580.98
    },
    {
        "text": " marginal. Venda lo que venda. Venda lo que venda de este rango, ¿no? Estamos hablando",
        "start": 580.98,
        "end": 590.9
    },
    {
        "text": " la posibilidad de posiciones de la empresa, ¿no? Ingresso medio, imagine, es igual al",
        "start": 590.9,
        "end": 594.78
    },
    {
        "text": " precio. Bueno, este cuadro se inventa expresa eso, es decir, unas cantidades al precio",
        "start": 594.78,
        "end": 605.3399999999999
    },
    {
        "text": " de size que estábamos por el mercado, el ingreso total que obviamente va a ser P por Q, el",
        "start": 605.3399999999999,
        "end": 612.54
    },
    {
        "text": " ingreso medio que coincide con el precio y el ingreso marginal también. Consexualmente",
        "start": 612.54,
        "end": 621.74
    },
    {
        "text": " la mayoridad que matemáticamente es sumamente sencillo, observen que lo que agrega al ingreso",
        "start": 621.74,
        "end": 628.42
    },
    {
        "text": " total, cada unidad es justamente el precio y ese es el ingreso marginal. Consexualmente",
        "start": 628.42,
        "end": 634.22
    },
    {
        "text": " es la variación del ingreso total y eso lo que nos da en cuenta, en competencia perfecta",
        "start": 634.22,
        "end": 640.3
    },
    {
        "text": " si va a haber precio. ¿Se entiende? ¿Dudas? ¿Qué costos tienen la empresa? La empresa",
        "start": 640.3,
        "end": 657.9
    },
    {
        "text": " tiene dos componentes de costos bien identificados. Por un lado, costos que no tienen vínculo",
        "start": 657.9,
        "end": 664.38
    },
    {
        "text": " con la cantidad producida, que es lo que se conoce como los costos fijos. La empresa",
        "start": 664.38,
        "end": 670.3
    },
    {
        "text": " produce o no produce, tiene un componente de costos que tienen que hacer frente, mencionado",
        "start": 670.3,
        "end": 675.86
    },
    {
        "text": " ese concepto de impuestos, por ejemplo, o alquiler, determinados salarios pueden llegar a",
        "start": 675.86,
        "end": 682.06
    },
    {
        "text": " ser aunque no lo consideramos acá en este modelo, pero digo porque alguno puede preguntarme",
        "start": 682.06,
        "end": 686.78
    },
    {
        "text": " cargos gerenciales, suponial administrativos, suponiales que no, un contador no va a tener",
        "start": 686.78,
        "end": 692.22
    },
    {
        "text": " más contadores porque obviamente la producción, pero olvidaremos del salario que acá no lo",
        "start": 692.22,
        "end": 697.26
    },
    {
        "text": " vamos a considerar, pero conceptualmente se lo menciona. Costos fijos, alquileres impuestos",
        "start": 697.26,
        "end": 705.4599999999999
    },
    {
        "text": " conceptualmente, el importante es que no no dependen de la producción, entonces el costo",
        "start": 705.4599999999999,
        "end": 713.06
    },
    {
        "text": " variable es justamente el costo que sí me incide cuando varía la producción y eso lo",
        "start": 713.06,
        "end": 719.52
    },
    {
        "text": " conceptualmente importante. Obviamente que va a tener madurez cantidad de insum, materias",
        "start": 719.52,
        "end": 725.02
    },
    {
        "text": " primas, etcétera, por cipificación acá para usar solo dos factores, vamos a tomar con",
        "start": 725.02,
        "end": 729.9799999999999
    },
    {
        "text": " el factor variable salario, el trabajador, aumento la producción, o diminucio la producción",
        "start": 729.9799999999999,
        "end": 735.54
    },
    {
        "text": " si aumento o diminucio el trabajo, para cipificar, pero en difícilmente, el factor",
        "start": 735.54,
        "end": 740.9399999999999
    },
    {
        "text": " variable es salario. Me siguen. Sí, claro, a ver, sabemos que la función de producción",
        "start": 740.94,
        "end": 756.34
    },
    {
        "text": " para cipificar no lo consideramos, tomamos dos factores, pero sabemos que está. De hecho",
        "start": 756.34,
        "end": 762.5400000000001
    },
    {
        "text": " nosotros pusimos como uno determinante de la oferta, los insumos y la matereprimos,",
        "start": 762.5400000000001,
        "end": 766.94
    },
    {
        "text": " el efecto de la función de producción, cuando yo digo che aumento la producción, voy",
        "start": 766.94,
        "end": 773.1400000000001
    },
    {
        "text": " a tomar varios más o menos trabajadores, es para no complicarnos, porque no cambia",
        "start": 773.1400000000001,
        "end": 778.1
    },
    {
        "text": " la cosa, conceptamente hablar, pero obviamente sabemos que hay otros elementos. Entonces",
        "start": 778.1,
        "end": 784.5400000000001
    },
    {
        "text": " y identificamos dos grupos de costos que lo importante acá para esto que estamos analizando,",
        "start": 784.5400000000001,
        "end": 790.5400000000001
    },
    {
        "text": " estamos analizando como define la empresa la cantidad de bienes que va a producir, va a",
        "start": 790.5400000000001,
        "end": 796.62
    },
    {
        "text": " resser al mercado, va a vender. Entonces, como yo le mencionaba, costo que no varía",
        "start": 796.62,
        "end": 803.1
    },
    {
        "text": " con el nivel de producción, costo pagado por una empresa que está abierta, independientemente",
        "start": 803.1,
        "end": 807.5
    },
    {
        "text": " de la cantidad que produzca, la empresa en marcha, como yo le mencionaba, bueno, la empresa",
        "start": 807.5,
        "end": 817.02
    },
    {
        "text": " sierra por licencia de personas una semana, la dos semana, perfecto, es una empresa en marcha,",
        "start": 817.02,
        "end": 822.0600000000001
    },
    {
        "text": " lo tanto la empresa que está abierta, no, me voy a dar una operativa, pero tiene que",
        "start": 822.06,
        "end": 824.6199999999999
    },
    {
        "text": " probar costos ficos, tiene que pagarle igual. Y el costo variable es el costo que varía",
        "start": 824.6199999999999,
        "end": 829.5999999999999
    },
    {
        "text": " cuando varía el nivel de producción, que es lo que mencionábamos recién los costos",
        "start": 829.5999999999999,
        "end": 833.4399999999999
    },
    {
        "text": " variables. Entonces, costo fico total, como yo le mencionaba, alquiler es la parte de",
        "start": 833.4399999999999,
        "end": 844.6199999999999
    },
    {
        "text": " fíjios y el costo variable total lo vamos a asociar a la mano de obra. Entonces, tenemos",
        "start": 844.62,
        "end": 855.42
    },
    {
        "text": " un componente de costos fijo que va a ser la suñada de físicas que yo voy a requerir",
        "start": 855.42,
        "end": 862.0600000000001
    },
    {
        "text": " para la producción y se caa de nota la suñada de físicas, capital físico, por un precio,",
        "start": 862.0600000000001,
        "end": 870.02
    },
    {
        "text": " el precio va tardado por esta sigla R, que es la remorrelación por cada unidad de capital",
        "start": 870.02,
        "end": 876.46
    },
    {
        "text": " físico. Te vieron la función de producción, tanto en macro, como vieron a todo el miércoles,",
        "start": 876.46,
        "end": 885.86
    },
    {
        "text": " que hay un componente, un factor mutuio K, capital y factor trabajo. Bueno, este K indica",
        "start": 885.86,
        "end": 893.9
    },
    {
        "text": " la suñidad de capital físico, capital financiero, no confunda eso, capital físico,",
        "start": 893.9,
        "end": 900.54
    },
    {
        "text": " maquinaria, edificio, herramienta, edificio, lo que yo requiero, unidad física, galpones,",
        "start": 900.54,
        "end": 906.1
    },
    {
        "text": " yo que se depende de qué productos estoy haciendo, por el precio. Es el costo fijo total,",
        "start": 906.1,
        "end": 913.42
    },
    {
        "text": " hay que ser el costo variable total, dado por el factor trabajo, el E, voy a contratar",
        "start": 913.42,
        "end": 919.46
    },
    {
        "text": " tantas unidades de trabajo, a un precio, el precio va a ser salario, el lolevé. Ese",
        "start": 919.46,
        "end": 926.1
    },
    {
        "text": " componente me va a dar el costo variable total, obviamente la suma me va a dar el costo",
        "start": 926.1,
        "end": 931.0400000000001
    },
    {
        "text": " total que tiene la empresa.",
        "start": 931.0400000000001,
        "end": 932.22
    },
    {
        "text": " overtime eh",
        "start": 932.22,
        "end": 959.82
    },
    {
        "text": " Bueno, pues tenés la consultoria de marketing o suponer, ¿no?",
        "start": 959.82,
        "end": 967.48
    },
    {
        "text": " Entonces, bueno, tengo un equipamiento, no sé, tecnológicamente, software, tablet,",
        "start": 967.48,
        "end": 976.94
    },
    {
        "text": " celulares, suponete, y bueno, y me he sido tanto personal para eso, pero siquiera",
        "start": 976.94,
        "end": 983.1400000000001
    },
    {
        "text": " ser más consultorías, le he sido más personal.",
        "start": 983.1400000000001,
        "end": 985.82
    },
    {
        "text": " Este sería este esquema, ¿no? En el corto plazo utilizo lo mismo, a la misma cantidad de",
        "start": 986.38,
        "end": 990.98
    },
    {
        "text": " equipos.",
        "start": 990.98,
        "end": 991.98
    },
    {
        "text": " ¿Pero si más contenidos deberían?",
        "start": 991.98,
        "end": 995.1800000000001
    },
    {
        "text": " Por ejemplo, hayba, por su momento que el filmo no se corto de propagada de publicidad,",
        "start": 995.1800000000001,
        "end": 1000.38
    },
    {
        "text": " y tengo no sé, equipo de filmación, luz, sonidos, no sé cuántos componentes físicos",
        "start": 1000.38,
        "end": 1005.62
    },
    {
        "text": " requieren, software, y un personal que me firma medita, no, me diagrama.",
        "start": 1005.62,
        "end": 1011.7
    },
    {
        "text": " Perfecto, mira, y puedo hacer con este equipo, puedo hacer tres producciones, ahora me",
        "start": 1011.7,
        "end": 1017.7
    },
    {
        "text": " aparecen más.",
        "start": 1017.7,
        "end": 1018.7
    },
    {
        "text": " Bueno, perfecto, mira, muy chacho, vamos a trabajar de dos turnos, perfecto, con la misma",
        "start": 1018.7,
        "end": 1024.6200000000001
    },
    {
        "text": " cantidad de unidades físicas, contrato más trabajadores y objetivas, o el duplico,",
        "start": 1024.6200000000001,
        "end": 1032.06
    },
    {
        "text": " trabaja más horas o contrato más gente, esa es la idea que era.",
        "start": 1032.06,
        "end": 1035.98
    },
    {
        "text": " En el corto plazo, en el largo plazo, ya estoy moviendo el CAS, o sea, ya compro",
        "start": 1035.98,
        "end": 1042.1
    },
    {
        "text": " más equipos, compro más equipo filmación, me compro más camiones, ahí ya muevo el CAS,",
        "start": 1042.1,
        "end": 1048.26
    },
    {
        "text": " en este modelo cada fijo, en el corto plazo, ¿sí?",
        "start": 1048.26,
        "end": 1054.14
    },
    {
        "text": " Lo que varía sería la cantidad de trabajo, horas de trabajo de contrato.",
        "start": 1054.14,
        "end": 1058.22
    },
    {
        "text": " ¿Ves a ir?",
        "start": 1058.22,
        "end": 1060.54
    },
    {
        "text": " Lo sigue en muchas, yo el ejemplo planteaba él, ¿sí?",
        "start": 1060.54,
        "end": 1066.22
    },
    {
        "text": " Bueno, entonces, CAS, el equipamiento físico, se entiende que el corto plazo no varía,",
        "start": 1066.22,
        "end": 1074.62
    },
    {
        "text": " y por supuesto, el precio que pago el CAS es un dato para la empresa, por lo tanto,",
        "start": 1074.62,
        "end": 1080.02
    },
    {
        "text": " el costo fijo total va a ser la cantidad de unidades que yo defina por mi análisis",
        "start": 1080.02,
        "end": 1085.22
    },
    {
        "text": " tecnológico, por el R.",
        "start": 1085.22,
        "end": 1089.1
    },
    {
        "text": " Lo leve también es un dato para la empresa, el salario está dado, me acaba competencia",
        "start": 1089.1,
        "end": 1093.98
    },
    {
        "text": " perfecta, y la cantidad de trabajadores o la cantidad de horas va a aumentar cuando",
        "start": 1093.98,
        "end": 1100.62
    },
    {
        "text": " se produce más y el minullo cuando se reduce la producción, o sea, en definitiva, va",
        "start": 1100.62,
        "end": 1105.02
    },
    {
        "text": " a variar según cuánto varía mi cantidad de producción.",
        "start": 1105.02,
        "end": 1110.3799999999999
    },
    {
        "text": " Obviamente, el costo de la idea de total es lo leve por él.",
        "start": 1110.3799999999999,
        "end": 1116.26
    },
    {
        "text": " El costo fijo es una constante, no depende de cu, el costo fijo es el costo que tengo.",
        "start": 1116.26,
        "end": 1125.06
    },
    {
        "text": " En este caso, el costo que yo tengo para mandar en los equipos de firmación y los",
        "start": 1125.06,
        "end": 1128.9
    },
    {
        "text": " hoguarestos, no?",
        "start": 1128.9,
        "end": 1130.42
    },
    {
        "text": " Constante, haga o no haga el corto publicitario o filme, algo, lo tengo un corto, no mantenimiento,",
        "start": 1130.42,
        "end": 1138.54
    },
    {
        "text": " no depende de cu.",
        "start": 1138.54,
        "end": 1143.62
    },
    {
        "text": " Entonces, vamos a vincular esto con el tema del costo de oportunidad.",
        "start": 1143.62,
        "end": 1148.86
    },
    {
        "text": " Me punto vista económicamente hablando porque es importante que la intelecta le hicimos",
        "start": 1148.86,
        "end": 1154.62
    },
    {
        "text": " este concepto, entonces veamos.",
        "start": 1154.62,
        "end": 1159.54
    },
    {
        "text": " Esperante ahí, ¿no?",
        "start": 1159.54,
        "end": 1164.1
    },
    {
        "text": " Porque si es recado, o sea, el costo fijo total, es la inauguración total que se depaga",
        "start": 1164.1,
        "end": 1171.62
    },
    {
        "text": " al capital fijo por sus servicios.",
        "start": 1171.62,
        "end": 1175.06
    },
    {
        "text": " Y si el caso de que el dueño sea el propietario de ese capital fijo, ¿por qué devo considerar",
        "start": 1175.06,
        "end": 1180.9399999999998
    },
    {
        "text": " eso como un costo para la empresa?",
        "start": 1180.9399999999998,
        "end": 1184.34
    },
    {
        "text": " Supongamos que en este ejemplo hipotético que recién ensalábamos con él y se ve, bueno,",
        "start": 1184.34,
        "end": 1188.34
    },
    {
        "text": " yo soy el dueño de la empresa de la consultoria, tengo estos equipos, no?",
        "start": 1188.34,
        "end": 1192.6999999999998
    },
    {
        "text": " ¿Por qué lo tengo que considerar como un costo?",
        "start": 1192.6999999999998,
        "end": 1196.1
    },
    {
        "text": " Por el costo oportunidad.",
        "start": 1196.1,
        "end": 1198.9399999999998
    },
    {
        "text": " Porque definitiva, si yo, en vez de utilizarlo para este tipo de cosas, lo arriendo, este",
        "start": 1198.94,
        "end": 1203.6200000000001
    },
    {
        "text": " equipo o otras consultoras, podría obtener un dinero.",
        "start": 1203.6200000000001,
        "end": 1208.74
    },
    {
        "text": " Vamos a ir a otro ejemplo.",
        "start": 1208.74,
        "end": 1209.74
    },
    {
        "text": " Tengo un camino en aquel gofletes.",
        "start": 1209.74,
        "end": 1211.3400000000001
    },
    {
        "text": " Bueno, está lo todo poniendo como un costo también, ¿no?",
        "start": 1211.3400000000001,
        "end": 1213.7
    },
    {
        "text": " Porque definitiva, si yo, ese camino, lo utilizo para otra cosa, no?",
        "start": 1213.7,
        "end": 1220.1000000000001
    },
    {
        "text": " Lo puedo tener un dinero.",
        "start": 1220.1000000000001,
        "end": 1222.7
    },
    {
        "text": " Y se le da el costo oportunidad que está incluida en el capital físico, ¿no?",
        "start": 1222.7,
        "end": 1227.18
    },
    {
        "text": " Es muy importante que vayamos internalizándolo porque vamos a entender después como cuando llegamos",
        "start": 1227.18,
        "end": 1233.8200000000002
    },
    {
        "text": " a maximización de la cantidad, cuál es la cantidad óptima, tiene que producir la empresa,",
        "start": 1233.8200000000002,
        "end": 1238.94
    },
    {
        "text": " porque juega y mucho este tipo de concepto del costo oportunidad.",
        "start": 1238.94,
        "end": 1244.22
    },
    {
        "text": " Conceptualmente entonces es lo que el dueño podría obtener con ese capital, si lo invirtiera",
        "start": 1244.22,
        "end": 1250.9
    },
    {
        "text": " en cualquier otra alternativa, ese sería un poco leídia.",
        "start": 1250.9,
        "end": 1255.98
    },
    {
        "text": " Si yo en vez de compáctose equipos o que lo pueda rendarlo, lo hubiera comprado otra",
        "start": 1255.98,
        "end": 1259.3
    },
    {
        "text": " cosa, bueno, eso es un poco leídia.",
        "start": 1259.3,
        "end": 1262.3
    },
    {
        "text": " ¿Se entiende mucho a yo?",
        "start": 1262.3,
        "end": 1273.02
    },
    {
        "text": " El costo variable total, bueno, el costo variable total ya sabemos conceptualmente que me",
        "start": 1273.02,
        "end": 1279.5
    },
    {
        "text": " está expresando la cantidad de horas o cantidad de trabajadores por su remorrelación,",
        "start": 1279.5,
        "end": 1285.14
    },
    {
        "text": " que sale a lo del V, ¿qué ocurre con esto?",
        "start": 1285.14,
        "end": 1290.6200000000001
    },
    {
        "text": " La protección marginal del factor este es de creciente, esto es, a medida que un golpe",
        "start": 1290.6200000000001,
        "end": 1295.7
    },
    {
        "text": " más trabajador es, me produce marginalmente menos que el otro.",
        "start": 1295.7,
        "end": 1304.14
    },
    {
        "text": " ¿Qué quiere decir que produzca menos que el otro?",
        "start": 1304.14,
        "end": 1308.98
    },
    {
        "text": " Imaginás me interblando que el anterior, ¿no?",
        "start": 1308.98,
        "end": 1312.74
    },
    {
        "text": " Quiere decir que contrate un trabajador y me va a producir más, sí, me va a producir",
        "start": 1312.74,
        "end": 1317.14
    },
    {
        "text": " más, pero con respecto al anterior me produce la cantidad marginal menor.",
        "start": 1317.14,
        "end": 1324.46
    },
    {
        "text": " Si yo tengo días trabajadores y me producen 100 unidades, ¿no?",
        "start": 1324.46,
        "end": 1329.7
    },
    {
        "text": " No quiere decir que si yo aumento a 11 me va a ser 110 la cantidad de vida, ¿no?",
        "start": 1329.7,
        "end": 1335.74
    },
    {
        "text": " ¿Qué es así?",
        "start": 1335.74,
        "end": 1338.5
    },
    {
        "text": " Me va a producir una cantidad marginal menor que el décimo que yo encorpore.",
        "start": 1338.5,
        "end": 1344.14
    },
    {
        "text": " ¿Por qué?",
        "start": 1344.14,
        "end": 1345.14
    },
    {
        "text": " Porque estamos asumiendo que el rendimiento, la protección marginal que me genera",
        "start": 1345.14,
        "end": 1349.38
    },
    {
        "text": " incorporar a un trabajador es menor, es de creciente, no menor, es de creciente.",
        "start": 1349.38,
        "end": 1355.58
    },
    {
        "text": " Lo vieron?",
        "start": 1355.58,
        "end": 1356.58
    },
    {
        "text": " Lo vieron esto dos días, ¿no?",
        "start": 1356.58,
        "end": 1359.38
    },
    {
        "text": " Entonces, ¿qué te lectura podemos hacer?",
        "start": 1359.38,
        "end": 1363.46
    },
    {
        "text": " ¿Qué te lectura podemos hacer?",
        "start": 1363.46,
        "end": 1364.46
    },
    {
        "text": " Lo que está acá, ¿qué me implica esto?",
        "start": 1364.46,
        "end": 1366.3400000000001
    },
    {
        "text": " Me implica mayor costo, mayor costunitario y final.",
        "start": 1366.3400000000001,
        "end": 1374.18
    },
    {
        "text": " Cada nueva unidad que produzco, cada una de una una una de la producción Q, me implica",
        "start": 1374.18,
        "end": 1379.46
    },
    {
        "text": " mayor cantidad de trabajo para producirlo.",
        "start": 1379.46,
        "end": 1382.7
    },
    {
        "text": " La otra forma de poder ver esto, si hay rendimiento a las imaginales de creciente que",
        "start": 1382.7,
        "end": 1385.82
    },
    {
        "text": " cada una de la que produjo más, marginalmente me requiere mayor cantidad de horas hombre.",
        "start": 1385.82,
        "end": 1392.82
    },
    {
        "text": " ¿Sí?",
        "start": 1392.82,
        "end": 1394.82
    },
    {
        "text": " Lo vén?",
        "start": 1394.82,
        "end": 1398.82
    },
    {
        "text": " Entonces, a medida que voy aumentando la incorporación de horas de trabajo, el factor L me rinde marginalmente",
        "start": 1398.82,
        "end": 1407.9399999999998
    },
    {
        "text": " menos.",
        "start": 1407.9399999999998,
        "end": 1411.82
    },
    {
        "text": " Una unidad adicional que voy a producir y vender, no olvidemos que producir y vender",
        "start": 1411.82,
        "end": 1416.22
    },
    {
        "text": " es sinónimo que necesitas mayor cantidad de trabajo adicional que el anterior para",
        "start": 1416.22,
        "end": 1423.5
    },
    {
        "text": " ser producida.",
        "start": 1423.5,
        "end": 1424.5
    },
    {
        "text": " En definitiva, el costo variable total va a crecer a una tasa creciente a medida que aumenta",
        "start": 1424.5,
        "end": 1430.62
    },
    {
        "text": " la cantidad Q.",
        "start": 1430.62,
        "end": 1434.8999999999999
    },
    {
        "text": " Y esta es la esencia en el núcleo para poder comprender, definitiva, como la decía",
        "start": 1434.9,
        "end": 1441.74
    },
    {
        "text": " en el personaje que tomar en cuenta lo que decíamos a su ratito, ojo, voy a vender",
        "start": 1441.74,
        "end": 1445.5400000000002
    },
    {
        "text": " más, ingresa más.",
        "start": 1445.5400000000002,
        "end": 1448.5400000000002
    },
    {
        "text": " Pero a medida que producís más, ¿eh?",
        "start": 1448.5400000000002,
        "end": 1451.3400000000001
    },
    {
        "text": " Claro, te cuesta más, marginalmente.",
        "start": 1451.3400000000001,
        "end": 1455.0600000000002
    },
    {
        "text": " Y esto es un poco lo que estamos fundamentando ahora, ¿no?",
        "start": 1455.0600000000002,
        "end": 1458.5
    },
    {
        "text": " Como hay rendimiento a las imaginales de creciente, producir más, me implica en definitiva",
        "start": 1458.5,
        "end": 1463.02
    },
    {
        "text": " marginalmente afectar mayor cantidad de factor trabajo con un capital fijo.",
        "start": 1463.02,
        "end": 1470.26
    },
    {
        "text": " ¿Se entiende a un salto?",
        "start": 1470.26,
        "end": 1472.26
    },
    {
        "text": " Sí.",
        "start": 1472.26,
        "end": 1473.26
    },
    {
        "text": " ¿Es la gráfica de la verdad?",
        "start": 1473.26,
        "end": 1476.26
    },
    {
        "text": " Bueno, no exactamente, no exactamente.",
        "start": 1476.26,
        "end": 1480.66
    },
    {
        "text": " La gráfica de pusimos hoy era de costo marginal.",
        "start": 1480.66,
        "end": 1484.06
    },
    {
        "text": " Bueno, entonces, simplemente que el costo variable es de que la verdadera verdadera",
        "start": 1484.06,
        "end": 1491.78
    },
    {
        "text": " que el costo variable es total, recorre la información sobre el ordenimiento del trabajo.",
        "start": 1491.78,
        "end": 1496.34
    },
    {
        "text": " Bueno, entonces ahora sí estamos ya mejor posicionados, ¿no?",
        "start": 1496.34,
        "end": 1500.74
    },
    {
        "text": " Para ir entendiendo de a poquito cómo la empresa va definiendo la cantidad de producir, ¿no?",
        "start": 1500.74,
        "end": 1507.94
    },
    {
        "text": " No olvidemos si lo conductor de esto, lo que conductor es el cuánto hay que producir,",
        "start": 1507.94,
        "end": 1512.34
    },
    {
        "text": " ¿cuál es la cantidad Q de producción donde la empresa maximiza?",
        "start": 1512.34,
        "end": 1519.46
    },
    {
        "text": " Si lo que tenemos que dar es despejar.",
        "start": 1519.46,
        "end": 1522.6200000000001
    },
    {
        "text": " Si viene intuitivamente, ya tenemos alguna pista, vamos a ir a finando el concepto, ¿no?",
        "start": 1522.6200000000001,
        "end": 1528.26
    },
    {
        "text": " Entonces, entramos ahora con el tema de los costos variables totales, que ya sabemos que",
        "start": 1528.26,
        "end": 1531.46
    },
    {
        "text": " son crecientes, a medida que produzco más, por este vínculo que contrato más factor variable",
        "start": 1531.46,
        "end": 1538.46
    },
    {
        "text": " al producir y los rendimientos son decrescientes.",
        "start": 1538.46,
        "end": 1543.98
    },
    {
        "text": " Este, a esto hay que llegar al costo fijo, ¿no?",
        "start": 1543.98,
        "end": 1549.9
    },
    {
        "text": " El costo fijo es una constante, por lo tanto la curva del costo total va a ser muy similar",
        "start": 1549.9,
        "end": 1555.34
    },
    {
        "text": " a esta con la diferencia de que hay un costo fijo.",
        "start": 1555.34,
        "end": 1562.34
    },
    {
        "text": " Ahora bien, esa es la forma que tendría la curva, pero vamos a asumir que a medida que",
        "start": 1574.34,
        "end": 1584.86
    },
    {
        "text": " voy aplicando un factor tiene impactos en los rendimientos.",
        "start": 1584.86,
        "end": 1589.62
    },
    {
        "text": " Entonces, si suponemos que al principio el impacto que tiene el aplicar mayor cantidad",
        "start": 1589.62,
        "end": 1596.26
    },
    {
        "text": " de trabajo es marginalmente creciente, bueno, tiene esta forma esta curva y si a partir",
        "start": 1596.26,
        "end": 1607.2199999999998
    },
    {
        "text": " de cierto punto ahí se torna de creciente. Esto es, este ejemplo hipotético que yo estaba",
        "start": 1607.22,
        "end": 1614.6200000000001
    },
    {
        "text": " poniendo al principio yo tengo un equipo físico de equipamiento para filmar, videos, no",
        "start": 1614.6200000000001,
        "end": 1621.26
    },
    {
        "text": " sé qué, y ciertas gente, bueno, con esa gente me salió un solo vídeo, bueno, bueno,",
        "start": 1621.26,
        "end": 1628.26
    },
    {
        "text": " pero tengo posibilidad de producir más, al principio barbaro, dentro de producir más y",
        "start": 1628.26,
        "end": 1634.26
    },
    {
        "text": " tengo rendimientos crecientes de esa gente, pero llega un momento que a medida que voy poniendo",
        "start": 1634.26,
        "end": 1639.1
    },
    {
        "text": " más personal y más personal, más sora y más sora, llega un momento que sacota eso y",
        "start": 1639.1,
        "end": 1644.66
    },
    {
        "text": " el rendimiento se torna de creciente, esa es la idea que está acá, por un momento me rinde",
        "start": 1644.66,
        "end": 1650.22
    },
    {
        "text": " mucho más y después me rinde menos y eso es definitiva de lo que está expresado en esta",
        "start": 1650.22,
        "end": 1654.3
    },
    {
        "text": " forma, a medida de esa largada que tiene estas curvas que lo que vamos a asumir en definitiva",
        "start": 1654.3,
        "end": 1659.02
    },
    {
        "text": " para este curso, hay un tramo en el cual a medida que produzco más los rendimientos",
        "start": 1659.02,
        "end": 1664.58
    },
    {
        "text": " son crecientes y después del punto de infección este, a partir de cierto punto los rendimientos",
        "start": 1664.58,
        "end": 1670.22
    },
    {
        "text": " se tornan siempre términos marginales, ¿no? Decresientes y ahí hay que tener cuidado,",
        "start": 1670.22,
        "end": 1676.26
    },
    {
        "text": " por supuesto que hay que tener cuidado con lo que hablábamos hoy, si estoy en el tramo",
        "start": 1676.26,
        "end": 1679.82
    },
    {
        "text": " del rendimiento marginales de crecientes, los costos son crecientes marginalmente hablando",
        "start": 1679.82,
        "end": 1686.26
    },
    {
        "text": " y hay que tener cuidado con el ingreso. Entonces se asume generalmente que las empresas",
        "start": 1686.26,
        "end": 1694.9
    },
    {
        "text": " presentan en esa altura de costos de este tipo, donde al principio el factor productivo",
        "start": 1694.9,
        "end": 1698.98
    },
    {
        "text": " variable al repito tiene rendimiento crecientes pero a partir de cierto punto no. Y eso",
        "start": 1698.98,
        "end": 1706.5
    },
    {
        "text": " es poco lo que está expresado en este cuadro, este cuadro es el único que indica esto,",
        "start": 1706.5,
        "end": 1710.3799999999999
    },
    {
        "text": " es decir a medida que voy produciendo qué pasa con los diferentes componentes de costos,",
        "start": 1710.38,
        "end": 1715.66
    },
    {
        "text": " bueno el costo fijo observa en ese igual, el costo fijo 50 produzca lo que produzca,",
        "start": 1715.66,
        "end": 1723.7800000000002
    },
    {
        "text": " el costo variable observa que va subiendo, cosa que es lógico, ¿no? A medida que voy aumentando",
        "start": 1723.7800000000002,
        "end": 1730.9
    },
    {
        "text": " la producción, estoy regiriendo mayor cantidad de horas de trabajo, por lo tanto el costo",
        "start": 1730.9,
        "end": 1734.9
    },
    {
        "text": " variable me sube, el costo total también, conceptualmente el costo marginal y la diferencia",
        "start": 1734.9,
        "end": 1743.5800000000002
    },
    {
        "text": " del costo total, entonces obviamente si yo produjo una unidad que impacto tuvo marginalmente",
        "start": 1743.5800000000002,
        "end": 1751.38
    },
    {
        "text": " hablando la diferencia 50, acá así, si es sencillamente vemos cómo podemos ir calculando",
        "start": 1751.38,
        "end": 1763.5
    },
    {
        "text": " los costos marginales, observen que esto no es que apricioso, o sea acá congide que va",
        "start": 1763.5,
        "end": 1770.06
    },
    {
        "text": " se va reduciendo los costos marginales, esta que se trata de después en cierto punto se dispara",
        "start": 1770.06,
        "end": 1773.82
    },
    {
        "text": " en el crece, y esto también está explicado por este supuesto que se asume, los rendimientos",
        "start": 1773.82,
        "end": 1782.1
    },
    {
        "text": " son crecientes y luego son decrescientes, el costo fijo medio, bueno no en imán y menos",
        "start": 1782.1,
        "end": 1789.18
    },
    {
        "text": " que el costo fijo total dividido en la cantidad perusida, esto podíamos decir que asint prácticamente",
        "start": 1789.18,
        "end": 1795.74
    },
    {
        "text": " tiene el dacero, es decir que produzco más, el costo fijo cada vez tiene menor peso en",
        "start": 1795.74,
        "end": 1801.18
    },
    {
        "text": " el componente del costo total, el costo variable medio, es conceptualmente el costo variable",
        "start": 1801.18,
        "end": 1807.98
    },
    {
        "text": " total dividido Q y la suma del costo variable medio, el costo fijo medio me da el costo total",
        "start": 1807.98,
        "end": 1813.46
    },
    {
        "text": " medio, el costo total medio es, como dice la palabra en promedio, ¿cuál es el costo",
        "start": 1813.46,
        "end": 1819.1000000000001
    },
    {
        "text": " del costo unitario de que en por unidad producido?",
        "start": 1819.82,
        "end": 1824.34
    },
    {
        "text": " este cuadro nos indica eso, el costo marginal, bueno el costo marginal lo decíamos hace un",
        "start": 1824.34,
        "end": 1836.1399999999999
    },
    {
        "text": " rato que es el costo marginal es, ¿cómo varía el costo total por aumentar una variedad digital",
        "start": 1836.1399999999999,
        "end": 1842.3799999999999
    },
    {
        "text": " más de producción? ¿Cuánto me impactan la estructura de costo en el costo total? El",
        "start": 1842.3799999999999,
        "end": 1847.74
    },
    {
        "text": " costo producido es unidad más, y por esto que tuvimos diciendo, bueno pues si el costo",
        "start": 1847.74,
        "end": 1853.5
    },
    {
        "text": " de fijo y el único elemento que juega cada vez es el costo variable, definitivamente hablar",
        "start": 1853.5,
        "end": 1857.58
    },
    {
        "text": " de costo marginal en este modelo de corto plazo, es decir, ¿cuánto varió el costo variable",
        "start": 1857.58,
        "end": 1863.54
    },
    {
        "text": " total respecto a unidad más de producción? Porque el único factor que estamos conseguiendo",
        "start": 1863.54,
        "end": 1868.34
    },
    {
        "text": " acá es el factor variable, en el caso del trabajo, me siguen, ¿no? O sea, conceptualmente",
        "start": 1868.34,
        "end": 1875.74
    },
    {
        "text": " el costo marginal es la diferencia del costo total entre dos puntos, ¿no? Como sabemos",
        "start": 1875.74,
        "end": 1883.1
    },
    {
        "text": " que estamos en un modelo de corto plazo, que es el único factor que varía, es el costo",
        "start": 1883.1,
        "end": 1887.7
    },
    {
        "text": " variable, bueno es equivalente a decir que es también cuánto varía el costo variable",
        "start": 1887.7,
        "end": 1891.58
    },
    {
        "text": " total respecto a la cantidad. Entonces ahora sí estamos ya, ¿no? En mejores condiciones",
        "start": 1891.58,
        "end": 1902.46
    },
    {
        "text": " para afirmar lo que tenemos hablando es lo que es el costo marginal, el costo marginal",
        "start": 1902.46,
        "end": 1906.78
    },
    {
        "text": " no es ni menos que esto que nos explica cuánto más cuenta producir una unidad y sonal,",
        "start": 1906.78,
        "end": 1912.8600000000001
    },
    {
        "text": " y esto es importante, ¿no? Medularmente importante, es decir, ¿qué me impacta a mí? ¿Cuál",
        "start": 1912.8600000000001,
        "end": 1919.26
    },
    {
        "text": " es el costo de aumentar el nivel de producción? ¿Cuánta sonía de trabajo tengo que",
        "start": 1919.26,
        "end": 1929.58
    },
    {
        "text": " contratar? Entonces bueno, matemáticamente el costo marginal es la derivada del costo",
        "start": 1929.58,
        "end": 1942.1799999999998
    },
    {
        "text": " total, ¿no? Como el costo total tiene un componente fijo que es una constante y esa derivada",
        "start": 1942.1799999999998,
        "end": 1954.1799999999998
    },
    {
        "text": " de cero, por lo tanto el costo marginal es la derivada del costo variable total. ¿Cómo",
        "start": 1954.18,
        "end": 1970.6200000000001
    },
    {
        "text": " estamos asumiendo que en definitiva, a partir de ese punto, los rendimientos son marginalmente",
        "start": 1970.6200000000001,
        "end": 1976.42
    },
    {
        "text": " de crecientes, o sea, los costos marginales son crecientes, ahora sí ya tenemos un poco",
        "start": 1976.42,
        "end": 1980.74
    },
    {
        "text": " más claro, la curva esta que yo les ponía antes de empezar a la charla, es decir, la",
        "start": 1980.74,
        "end": 1985.54
    },
    {
        "text": " curva de costo marginal presenta esta forma, ¿no? En un momento, un diminuye que acá no",
        "start": 1985.54,
        "end": 1989.98
    },
    {
        "text": " está, y después arranca creciendo y subiendo, ¿no? Los costos marginales son crecientes,",
        "start": 1989.98,
        "end": 1996.02
    },
    {
        "text": " ¿sí? Porque se impone los rendimientos marginales de crecientes. El costo medio conceptualmente",
        "start": 1996.02,
        "end": 2005.98
    },
    {
        "text": " en lo que yo mencionaba, el costo medio, si es importante en nivel estadístico para",
        "start": 2005.98,
        "end": 2010.06
    },
    {
        "text": " un montón de cosas, no es importante para definir la producción, lo que es importante",
        "start": 2010.06,
        "end": 2015.3799999999999
    },
    {
        "text": " es el costo marginal, la que yo no manen cuenta, ¿no? Costo medio, no, costo medio, sí,",
        "start": 2015.3799999999999,
        "end": 2020.46
    },
    {
        "text": " pero otras curzas, lo que hay que tomar en cuenta es si a un momento no la producción,",
        "start": 2020.46,
        "end": 2024.58
    },
    {
        "text": " el costo marginal, porque los costos son marginalmente crecientes, obviamente, matemáticamente,",
        "start": 2024.58,
        "end": 2032.06
    },
    {
        "text": " el costo medio, como mencionábamos hoy, es la cantidad del costo total y vidocú, ¿no?",
        "start": 2032.06,
        "end": 2038.1399999999999
    },
    {
        "text": " Este componente de costos fijo total sobre Q, tiene cero y esto, el costo total es",
        "start": 2038.14,
        "end": 2043.8600000000001
    },
    {
        "text": " dividido Q. Entonces, ahora sí, ya estamos en condiciones de expresar las curvas que",
        "start": 2043.8600000000001,
        "end": 2057.86
    },
    {
        "text": " nos interesa y son relevantes acá para ir aproximando, ¿no? Para ir definiendo cuánto",
        "start": 2057.86,
        "end": 2065.42
    },
    {
        "text": " tiene que producir la empresa, ¿no? Que ya tenemos bastantes elementos intuitivos o",
        "start": 2065.42,
        "end": 2070.58
    },
    {
        "text": " para ir viendo dónde la empresa se va a posicionar. Lo importante acá es ver estas curvas,",
        "start": 2070.58,
        "end": 2078.2200000000003
    },
    {
        "text": " ¿no? Bueno, primero, esta curva que está acá, de un color rojo naranja, es la cuba del costo",
        "start": 2078.2200000000003,
        "end": 2088.06
    },
    {
        "text": " marginal, la cuba del costo marginal, tienes este tramo donde los rendimientos son crecientes,",
        "start": 2088.06,
        "end": 2094.7000000000003
    },
    {
        "text": " pero tanto voy bajando los costos, llega un mínimo y después entra a subir y no se detiene.",
        "start": 2094.7,
        "end": 2099.98
    },
    {
        "text": " La cuba del costo varial medio y la cuba del costo medio, tiene estas formas de U, también",
        "start": 2104.22,
        "end": 2111.8199999999997
    },
    {
        "text": " explicado por este tema de los rendimientos, al principio son de crecientes, llegan un mínimo",
        "start": 2111.8199999999997,
        "end": 2119.18
    },
    {
        "text": " que coincide matemáticamente se puede demostrar, que coincide con el corte de la cuba del costo",
        "start": 2119.18,
        "end": 2125.14
    },
    {
        "text": " marginal, la cuba del costo medio es muy similar, la diferencia acá es la cuba del costo fijo medido.",
        "start": 2125.14,
        "end": 2131.2599999999998
    },
    {
        "text": " O sea que en definitiva vemos que los costos marginales son crecientes y depende que tramos,",
        "start": 2134.06,
        "end": 2148.18
    },
    {
        "text": " estamos hablando, los costos medios se lo valen, pueden ser de crecientes o no, pero es",
        "start": 2148.18,
        "end": 2152.58
    },
    {
        "text": " importante es analizar el costo marginal para tomar decisiones. Bueno, acá tenemos el cuadro,",
        "start": 2152.58,
        "end": 2160.02
    },
    {
        "text": " es que estaba ahí expresado acá, la cuba del costo fijo medio, como ustedes pueden ver,",
        "start": 2160.02,
        "end": 2163.7799999999997
    },
    {
        "text": " tiene acero, conceptualmente es similar. El costo fijo medio desciende, siempre, esto simplemente",
        "start": 2163.7799999999997,
        "end": 2177.54
    },
    {
        "text": " que cuando el costo marginal es menor que las cubas del costo barrio de medio o el costo total",
        "start": 2177.54,
        "end": 2183.22
    },
    {
        "text": " medio, el costo variable y el costo total medio diminuye y cuando es mayor el costo barrio de medio",
        "start": 2183.22,
        "end": 2191.54
    },
    {
        "text": " y el costo total medio aumenta, simplemente para explicarlo en la gráfica.",
        "start": 2191.54,
        "end": 2198.82
    },
    {
        "text": " La puntiada es el que en punto, la puntiada es el costo fijo medio, que obviamente es",
        "start": 2198.82,
        "end": 2208.6200000000003
    },
    {
        "text": " que es machiquito, es batender acero, ¿no? Sí, acá es el medio, el costo fijo medio, el costo fijo medio,",
        "start": 2208.6200000000003,
        "end": 2219.06
    },
    {
        "text": " ¿no? El costo fijo es una constante, yo que sé, el costo fijo medio, va a ser a sobre",
        "start": 2219.06,
        "end": 2232.58
    },
    {
        "text": " cubo, la medida que cubo aumenta está acá de machiquito, está razón, bueno,",
        "start": 2232.58,
        "end": 2241.14
    },
    {
        "text": " esto es un ejemplo cualquiera donde hay una cantidad de producción, el precio, peor cu,",
        "start": 2253.62,
        "end": 2258.86
    },
    {
        "text": " que es más ni menos que la cantidad por el precio, como el costo total va subiendo, como",
        "start": 2259.42,
        "end": 2264.38
    },
    {
        "text": " el costo marginal es constante, perdón, el ingreso marginal es constante, igual al precio y el",
        "start": 2264.38,
        "end": 2271.54
    },
    {
        "text": " ingreso marginal, el costo marginal que es la diferencia del costo total y la otra columna es la",
        "start": 2271.54,
        "end": 2278.42
    },
    {
        "text": " diferencia del ingreso total y el costo marginal. Observemos que conceptualmente lo que me interesa",
        "start": 2278.42,
        "end": 2287.42
    },
    {
        "text": " es que a medida que produzco más esta diferencia entre el ingreso marginal, que es el precio, menos",
        "start": 2287.42,
        "end": 2291.94
    },
    {
        "text": " el costo, cada vez se chica, hasta que se igualan y luego se torna negativo. Entonces, a medida que",
        "start": 2291.94,
        "end": 2303.34
    },
    {
        "text": " produzco más los costos marginales se incrementan por la ley de rendimiento de crecientes, la cuba de",
        "start": 2303.34,
        "end": 2309.9
    },
    {
        "text": " costo medio, como ya le mencionaba, tiene una forma de U, parecida U, ¿eh? Y la cuba de costo",
        "start": 2309.9,
        "end": 2315.2200000000003
    },
    {
        "text": " marginal corta la cuba de costo medio cuando está en el mínimo, ¿tacurgo?",
        "start": 2315.22,
        "end": 2321.22
    },
    {
        "text": " ¿Qué es el elemento que hay que tomar en cuenta? Si los mencionamos, pero vamos a desfaticizarlos",
        "start": 2325.3399999999997,
        "end": 2330.7
    },
    {
        "text": " un poco. El tema de cuando un costo es fijo y cuando se torna variable es el tema del corto plazo y",
        "start": 2330.7,
        "end": 2342.4599999999996
    },
    {
        "text": " el corto plazo acá no está asociado a un periodo de tiempo, sino que está asociado justamente",
        "start": 2342.46,
        "end": 2349.54
    },
    {
        "text": " a cuando ese capital, que en su momento no cambiaba era fijo, se torna variable. Entonces, en el",
        "start": 2349.54,
        "end": 2359.62
    },
    {
        "text": " corto plazo, algunos costos son fijos, el equipamiento y fijos, etcétera, pero luego ese",
        "start": 2359.62,
        "end": 2367.86
    },
    {
        "text": " equipamiento se tornó dinámico, se tornó y se tornó. Entonces ese modelo de los tamás, por",
        "start": 2368.86,
        "end": 2375.94
    },
    {
        "text": " esa largo plazo se habla que todos los costos fijos se convierten en costos variables. ¿Por qué le",
        "start": 2375.94,
        "end": 2380.6800000000003
    },
    {
        "text": " mencionó esto? Porque si bien conceptualmente nosotros manejamos en el corto plazo, está muy",
        "start": 2380.6800000000003,
        "end": 2386.1400000000003
    },
    {
        "text": " vinculado aquí una piensa que es un periodo de tiempo determinado o chico y puede ser muy grande.",
        "start": 2386.1400000000003,
        "end": 2392.46
    },
    {
        "text": " Quizás si pensamos en empresas tecnológicas, ahí el corto plazo sea mucho más acotado,",
        "start": 2393.42,
        "end": 2399.3
    },
    {
        "text": " empresa que labora el software o otro tipo de cosas donde la obsolescencia tecnológica es",
        "start": 2399.3,
        "end": 2405.7
    },
    {
        "text": " mucho más vertiginosa. Entonces ahí seguramente el corto plazo es muy corto plazo, pero otro tipo",
        "start": 2405.7,
        "end": 2411.7400000000002
    },
    {
        "text": " de empresas que no presentan este tipo de cambio tecnológico tan acelerado, bueno el corto plazo",
        "start": 2411.7400000000002,
        "end": 2419.42
    },
    {
        "text": " puede ser mucho más largo, ¿sí? conceptualmente el importante es eso, no está vinculado a un tiempo,",
        "start": 2419.42,
        "end": 2427.02
    },
    {
        "text": " si no está vinculado a cuando la empresa tiene que cambiar el equipamiento. Entonces retomando",
        "start": 2427.02,
        "end": 2436.1
    },
    {
        "text": " la delíla conductor de esto, sin el corto plazo el cae fijo y para aumentar la producción lo que",
        "start": 2436.1,
        "end": 2443.9
    },
    {
        "text": " tengo que hacer es contratar más trabajadores la variable clave acá es para determinar cuánta",
        "start": 2443.9,
        "end": 2450.58
    },
    {
        "text": " cantidad maximizo lo beneficio es cuánta unidad de trabajo de estego es contratar. Una vez",
        "start": 2450.58,
        "end": 2457.06
    },
    {
        "text": " definido en mi equipamiento de capital físico la variable clave acá asociada al nivel de producción",
        "start": 2457.06,
        "end": 2463.82
    },
    {
        "text": " de maximizo lo beneficio es cuántas unidades de élito es contratado. Es decir,",
        "start": 2463.82,
        "end": 2468.56
    },
    {
        "text": " conceptualmente hasta donde la empresa va a incorporar trabajadores, hasta donde la empresa",
        "start": 2469.52,
        "end": 2476.16
    },
    {
        "text": " le conviene racionalmente contratar un trabajador adicional y bueno hasta que el valor de la",
        "start": 2476.16,
        "end": 2483.88
    },
    {
        "text": " productividad marginal del trabajo es igual al salario, esto que quiere decir, recordemos un",
        "start": 2483.88,
        "end": 2492.44
    },
    {
        "text": " poquito los conceptos estos para que podamos conceptualmente hablando internalizando. Yo tengo",
        "start": 2492.44,
        "end": 2506.68
    },
    {
        "text": " que aumento un trabajador y me produce una unidad, una cantidad marginal, volumen de producción,",
        "start": 2506.68,
        "end": 2518.2400000000002
    },
    {
        "text": " productividad marginal, cantidad. Esa unidad es que me produce marginalmente de más ese trabajador,",
        "start": 2518.24,
        "end": 2530.6
    },
    {
        "text": " yo los voy a vender al mercado, a qué precio lo voy a vender al mercado, al precio del mercado,",
        "start": 2530.6,
        "end": 2535.3199999999997
    },
    {
        "text": " o sea que esta sonida de física, sí.",
        "start": 2538.68,
        "end": 2541.3199999999997
    },
    {
        "text": " ¿Está bien lo que pasa que ahí estamos en términos discreto? En realidad el tema ha sido el",
        "start": 2548.24,
        "end": 2560.64
    },
    {
        "text": " término discreto, lo que vos preguntás el lógico pero lo ves en términos infinitesimales,",
        "start": 2560.64,
        "end": 2566.12
    },
    {
        "text": " vas a contratar hasta que se iguale. Claro, me decimó en el que hay que contratar una parte",
        "start": 2566.12,
        "end": 2573.52
    },
    {
        "text": " de fentesiva en un trabajador, está bien, pero conceptualmente el tema de que vas a contratar hasta",
        "start": 2573.52,
        "end": 2579.2
    },
    {
        "text": " que tengas un margen marginal positivo. Ahora lo vemos, pero ese es la idea. Bueno, vuelvo,",
        "start": 2579.2,
        "end": 2590.48
    },
    {
        "text": " contrato un trabajador más y en definitiva me produce un volumen de unidades, marginalmente es lo",
        "start": 2590.48,
        "end": 2596.68
    },
    {
        "text": " que me engenera a mí de variación de unidades de producción y de venta. Lo multiplico por el",
        "start": 2596.68,
        "end": 2603.44
    },
    {
        "text": " P, que son el ingreso unitario, estos son unidades físicas, unidades. Por lo tanto esto me va a dar un",
        "start": 2603.44,
        "end": 2616.44
    },
    {
        "text": " dinero y este es el valor de la productividad marginal, el volumen de dinero marginal que me",
        "start": 2616.44,
        "end": 2631.92
    },
    {
        "text": " engenera a mí un trabajador adicional, contratar un trabajador adicional. Lo ven? Con qué lo todo",
        "start": 2631.92,
        "end": 2643.52
    },
    {
        "text": " de comparar este valor de la productividad marginal del trabajo, este dinero que me genera estas",
        "start": 2643.52,
        "end": 2653.08
    },
    {
        "text": " unidades físicas marginales que me da adicionalmente un trabajador, por el precio del bien,",
        "start": 2653.08,
        "end": 2657.84
    },
    {
        "text": " contraquilo todo que comparar, con el dole bien, que es el salario del trabajador. Por lo tanto,",
        "start": 2657.84,
        "end": 2669.2400000000002
    },
    {
        "text": " yo voy a contratar trabajadores en la medida que este valor sea mayor, ¿verdad? Acá contratos.",
        "start": 2669.2400000000002,
        "end": 2676.88
    },
    {
        "text": " Si este valor de la productividad marginal es menor, despido. Yo, obviamente, cuando sigualan,",
        "start": 2676.88,
        "end": 2699.6400000000003
    },
    {
        "text": " es cuando me detengo. Lo puedo ver en términos reales, también esto, no? Yo les puse",
        "start": 2699.64,
        "end": 2722.3599999999997
    },
    {
        "text": " y les recien que esto es por la productividad marginal, ¿verdad? O sea que en definitiva,",
        "start": 2722.36,
        "end": 2730.4
    },
    {
        "text": " eso paso este p dividiendo acá. Y digo, la productividad marginal, la cantidad de unidades",
        "start": 2730.4,
        "end": 2750.84
    },
    {
        "text": " físicas que un trabajador me genera, si yo lo contratos, si es mayor que el salario real,",
        "start": 2750.84,
        "end": 2756.1200000000003
    },
    {
        "text": " esto es el costo que tiene para la empresa, dividido el P, me va a dar unidad de físicas, ¿no?",
        "start": 2756.1200000000003,
        "end": 2761.2000000000003
    },
    {
        "text": " Un trabajador le pago mil pesos y yo vendo el producto así en, por lo tanto, para mi implica",
        "start": 2761.2000000000003,
        "end": 2769.04
    },
    {
        "text": " 10 unidades. Si esta pasó en las mejereras más de 10, contratos. Si en vez de genera adicionalmente",
        "start": 2769.04,
        "end": 2777.7200000000003
    },
    {
        "text": " menos de 10 lo he hecho. Por lo tanto, el equilibrio o hasta un de va a contratar, y bueno,",
        "start": 2777.72,
        "end": 2786.2799999999997
    },
    {
        "text": " va a contratar, una cantidad de trabajadores, el de forma tal que la productividad marginal",
        "start": 2786.2799999999997,
        "end": 2793.4399999999996
    },
    {
        "text": " del trabajo, se igual al salario real. O, si ustedes quieren, el valor de la productividad",
        "start": 2793.4399999999996,
        "end": 2800.7999999999997
    },
    {
        "text": " y voy a dole vea. A ver, pasar el P para tal. Esto por P es el valor, unidad de físicas",
        "start": 2800.8,
        "end": 2817.1400000000003
    },
    {
        "text": " y esto es en términos de dinero.",
        "start": 2817.1400000000003,
        "end": 2818.92
    },
    {
        "text": " Engana al final, cero. ¿Y ese con centrados en que voy a ganar dinero o que no voy a",
        "start": 2818.92,
        "end": 2840.5
    },
    {
        "text": " dar dinero? Por la última unidad, si bueno, que pasa que es lo que yo decía de 100. Como",
        "start": 2840.5,
        "end": 2846.22
    },
    {
        "text": " acá está marrando en términos discreto, ya es correcto, porque yo no contratos una parte",
        "start": 2846.22,
        "end": 2850.58
    },
    {
        "text": " de un trabajador o una parte infinitesima de un trabajador, pero claro, si yo lo mismo",
        "start": 2850.58,
        "end": 2855.5
    },
    {
        "text": " en términos infinitesimales, a mí me conviene contratar hasta la última parte cita,",
        "start": 2855.5,
        "end": 2860.78
    },
    {
        "text": " entonces en cero me detengo, más ya que la última no me agrega nada.",
        "start": 2860.78,
        "end": 2864.38
    },
    {
        "text": " ¿Eso es el valor de los que yo lo tengo en el balance? No, al contrario, no, el contrario,",
        "start": 2864.38,
        "end": 2870.94
    },
    {
        "text": " ahí maximizás. ¿Eso es el valor de los que va a tener más ganancias?",
        "start": 2870.94,
        "end": 2874.02
    },
    {
        "text": " Máganas, el máximo de ganancias. ¿Eso es la verdad? No más ganancias, el máximo. Porque",
        "start": 2874.02,
        "end": 2879.9
    },
    {
        "text": " si vos contratas acá, acá no es así que pierdo, no es así, no quiere decir que pierdas,",
        "start": 2879.9,
        "end": 2884.98
    },
    {
        "text": " lo que sí que dejás de ganar. Claro. ¿Lo quiere decir que si vos ganas 10, empiezo",
        "start": 2884.98,
        "end": 2894.14
    },
    {
        "text": " a hablar de teniendo? No, capaz de ganas 90, puede decir algo. Claro.",
        "start": 2894.14,
        "end": 2898.7
    },
    {
        "text": " Si no, no es racional. Pero no quiere decir que esté perdiendo. Entonces, hasta que con",
        "start": 2898.7,
        "end": 2908.62
    },
    {
        "text": " teoría de trabajadores contratos, hasta que el valor de la potencia marginal se iguala",
        "start": 2908.62,
        "end": 2912.98
    },
    {
        "text": " al salario. Hasta que si ustedes quieran el costo marginal, que es el salario, me iguala",
        "start": 2912.98,
        "end": 2921.58
    },
    {
        "text": " al ingreso marginal, que es lo que me genera de volumen de dinero, las unidades que producen",
        "start": 2921.58,
        "end": 2927.02
    },
    {
        "text": " y sonamente trabajador por el precio. Lo ve muchos de todos, hay dudas. Entonces ya",
        "start": 2927.02,
        "end": 2936.8599999999997
    },
    {
        "text": " definiendo la cantidad de trabajo que tenemos para contratar, ya vamos avanzando cada vez",
        "start": 2936.86,
        "end": 2942.78
    },
    {
        "text": " más, en ver cómo es la definición racional de una empresa de cuántas unidades va a producir,",
        "start": 2942.78,
        "end": 2947.86
    },
    {
        "text": " ¿no? Hasta donde la empresa va a incrementar la producción. Y bueno, asumiendo que hay",
        "start": 2947.86,
        "end": 2955.6200000000003
    },
    {
        "text": " rendimiento imaginares de crecientes, que ya sabemos que eso quiere decir costos imaginares",
        "start": 2955.6200000000003,
        "end": 2962.58
    },
    {
        "text": " crecientes va a producir donde el ingreso marginal es igual al costo marginal. El costo",
        "start": 2962.58,
        "end": 2972.8199999999997
    },
    {
        "text": " marginal ya sabemos que equivale a que… El ingreso marginal es igual a que de la unidad.",
        "start": 2972.8199999999997,
        "end": 2980.98
    },
    {
        "text": " Claro, el ingreso marginal de por unidad es el precio, ¿no? El precio, por unidad es el",
        "start": 2980.98,
        "end": 2988.98
    },
    {
        "text": " precio. Y el costo marginal es el costo que vos te implique contratar un factor más. El",
        "start": 2988.98,
        "end": 2997.86
    },
    {
        "text": " objetivo del empresa obviamente es maximizar las ganancias, por lo tanto la empresa va a",
        "start": 2997.86,
        "end": 3005.14
    },
    {
        "text": " tratar de producir en nivel de producción donde justamente la diferencia entre el ingreso",
        "start": 3005.14,
        "end": 3011.42
    },
    {
        "text": " total y el costo total sea la máxima, obviamente, ¿no? Por lo tanto el beneficio va a ser",
        "start": 3011.42,
        "end": 3020.5
    },
    {
        "text": " ni más y menos que la diferencia entre el ingreso total menos el costo total.",
        "start": 3020.5,
        "end": 3026.42
    },
    {
        "text": " El ingreso total es P por Q y el costo total ya sabemos que es R por K siendo K fijo, más",
        "start": 3026.42,
        "end": 3037.86
    },
    {
        "text": " L por W, donde L es variable. Maximizar, bueno, hay que hacer la derivada, igual a 0 y nos",
        "start": 3037.86,
        "end": 3053.7400000000002
    },
    {
        "text": " queda que va a maximizar los beneficios, la empresa en el nivel de producción en que el",
        "start": 3053.7400000000002,
        "end": 3062.1400000000003
    },
    {
        "text": " ingreso marginal es igual al costo marginal y esto es infinitiva lo importante acá, ¿no? El costo",
        "start": 3062.14,
        "end": 3071.62
    },
    {
        "text": " marginal es igual al ingreso marginal y como vimos recién asociado al costo variable, el costo",
        "start": 3071.62,
        "end": 3082.22
    },
    {
        "text": " marginal es el salario y el costo, el ingreso marginal que en el general trabajador es P por",
        "start": 3082.22,
        "end": 3090.02
    },
    {
        "text": " la potea marginal del trabajo. O sea que la importancia clave que tiene de terminar la cantidad",
        "start": 3090.02,
        "end": 3098.22
    },
    {
        "text": " de trabajadores está totalmente vinculada para determinar la cantidad de la empresa va a maximizar",
        "start": 3098.22,
        "end": 3103.98
    },
    {
        "text": " sus beneficios. La empresa que estamos analizando con un comportamiento racional está en un mercado",
        "start": 3103.98,
        "end": 3115.78
    },
    {
        "text": " competencia perfecta, el precio está dado, el precio viene dado por el mercado, la empresa",
        "start": 3115.78,
        "end": 3121.1000000000004
    },
    {
        "text": " es precio aceptante como dice ahí, el ingreso total no es ni menos que P por Q, por lo tanto",
        "start": 3121.1000000000004,
        "end": 3130.6600000000003
    },
    {
        "text": " es una recta que obviamente va a ser creciente en función de Q, pero ¿qué pasa? ¿A qué curva",
        "start": 3130.6600000000003,
        "end": 3138.26
    },
    {
        "text": " la demanda se enfrenta la empresa? La empresa es una empresa más en el mercado, recibe",
        "start": 3138.26,
        "end": 3147.0200000000004
    },
    {
        "text": " el precio que el mercado limpone, a este precio, a este precio la empresa va a ofrecer y vender",
        "start": 3147.0200000000004,
        "end": 3155.0800000000004
    },
    {
        "text": " todas las cantidades. Esta es la empresa, perdón, esta es la demanda del mercado que se va",
        "start": 3155.0800000000004,
        "end": 3165.5800000000004
    },
    {
        "text": " a enfrentar la empresa, a este precio vende todas sus unidades, observen que es una curva",
        "start": 3165.58,
        "end": 3174.54
    },
    {
        "text": " totalmente elástica, a este precio vende la cantidad de unidades, a un precio mayor ¿qué",
        "start": 3174.54,
        "end": 3185.1
    },
    {
        "text": " pasaría? ¿Seguro, ¿qué pasa? A vosotros es una pequeña empresa dentro de muchos, ponemos",
        "start": 3185.1,
        "end": 3193.58
    },
    {
        "text": " que hay que ir, voy a poner un precio mayor, no vendez, no vendez porque la gente va a",
        "start": 3193.58,
        "end": 3199.06
    },
    {
        "text": " otro lado, no sería racional vender a un precio menor, por lo tanto el precio que se va",
        "start": 3199.06,
        "end": 3205.14
    },
    {
        "text": " a vender es eso. Y además no solo el racional sino que tampoco podría satisfacizar la demanda,",
        "start": 3205.14,
        "end": 3220.46
    },
    {
        "text": " porque a un precio más chiquito la demanda se incrementaría y la empresa no está en condiciones",
        "start": 3220.46,
        "end": 3225.46
    },
    {
        "text": " de satisfacer la demanda del mercado, ya que no tiene sentido que la empresa venda a un precio",
        "start": 3225.46,
        "end": 3230.1
    },
    {
        "text": " menor. Entonces, está la demanda de la empresa, o sea, en definitiva, es el precio que el",
        "start": 3230.1,
        "end": 3240.2200000000003
    },
    {
        "text": " precio para la empresa es el ingreso marginal, es el ingreso medio también, el ingreso",
        "start": 3240.2200000000003,
        "end": 3246.98
    },
    {
        "text": " del promedio, cuánto el ingreso en promedio a la empresa por cada unidad que produce el precio.",
        "start": 3246.98,
        "end": 3252.78
    },
    {
        "text": " Pero ¿qué pasa? La suma de esa empresa pequeña con todas las empresas que ofrecen ese mismo",
        "start": 3255.02,
        "end": 3262.02
    },
    {
        "text": " producto, ¿qué pasa? Ahí hay una cosa cambia ¿no? Porque ahí se va a enfrentar a la demanda",
        "start": 3262.02,
        "end": 3271.94
    },
    {
        "text": " del mercado, la demanda del mercado ahí sí presenta lo que es la ley de demanda, a un precio",
        "start": 3271.94,
        "end": 3278.1
    },
    {
        "text": " mayor se consume menos y a un precio menor se consume más. O sea, la demanda que es una",
        "start": 3278.1,
        "end": 3283.58
    },
    {
        "text": " empresa individual es el precio del bien, la demanda del mercado hoyamente cumple con la ley",
        "start": 3283.58,
        "end": 3289.26
    },
    {
        "text": " de demanda, acá en el eje, acá la empresa de esta chiquita produce 200 kilos y acá el",
        "start": 3289.26,
        "end": 3295.06
    },
    {
        "text": " mercado son millones de kilos, entonces ahí sí entra a jugar el tema de la demanda. A los efectos",
        "start": 3295.06,
        "end": 3300.7400000000002
    },
    {
        "text": " de la empresa, entonces fijemos no que el precio es el ingreso medio de ingreso marginal y también",
        "start": 3300.74,
        "end": 3304.9399999999996
    },
    {
        "text": " la demanda de la empresa. Bueno, entonces ¿qué pasa? Este productor enfrenta una demanda de",
        "start": 3304.9399999999996,
        "end": 3313.9399999999996
    },
    {
        "text": " cuatro unidades ¿no? Cuatro es el precio del mercado del bien. Todas las unidades la bende a ese",
        "start": 3313.9399999999996,
        "end": 3321.1
    },
    {
        "text": " precio, todas, no importa e indifinitiva, ¿cuál es su volumen de preusión de la empresa?",
        "start": 3321.1,
        "end": 3327.66
    },
    {
        "text": " Lo que decíamos, si intenta subir el precio, no venden nada y si aumenta su producción,",
        "start": 3327.66,
        "end": 3336.5
    },
    {
        "text": " no va a variar el precio, no inicie en variedad del precio. El ingreso que preside por cada unidad",
        "start": 3336.5,
        "end": 3344.18
    },
    {
        "text": " obviamente es el precio, que coincide además como mencionaba recién con el ingreso medio y la",
        "start": 3344.18,
        "end": 3352.02
    },
    {
        "text": " demanda que se enfrenta la empresa. Entonces la empresa decíamos va a maximizar su nivel de",
        "start": 3352.02,
        "end": 3361.42
    },
    {
        "text": " producción en aquel volumen donde el ingreso marginal es igual al costo marginal y en mercado",
        "start": 3361.42,
        "end": 3370.34
    },
    {
        "text": " competencia perfecta igual al precio. Y esto es algo indifinitiva importante. Este es el punto",
        "start": 3370.34,
        "end": 3381.7400000000002
    },
    {
        "text": " de maximización de la empresa, el volumen de producción donde el costo marginal se",
        "start": 3381.7400000000002,
        "end": 3389.6200000000003
    },
    {
        "text": " iguala al ingreso marginal o al precio del bien. Definitiva, matemáticamente hablando donde",
        "start": 3389.62,
        "end": 3400.54
    },
    {
        "text": " siguan las pendientes de ingreso total y costo total, que es lo que está acá. Esta es la curva de costo",
        "start": 3400.54,
        "end": 3408.22
    },
    {
        "text": " total, esta es la curva de beneficio que va aumentando, llega un máximo y justamente coincide",
        "start": 3408.22,
        "end": 3414.14
    },
    {
        "text": " ese máximo cuando las pendientes del ingreso total es que la otra curva que está acá se iguala",
        "start": 3414.14,
        "end": 3419.06
    },
    {
        "text": " con la del costo total. Ese es el punto Q donde la cantidad Q donde la empresa maximiza su",
        "start": 3419.06,
        "end": 3425.14
    },
    {
        "text": " beneficio. Es si la cara pueda mirar con las curvas de costos totales, si lo miramos con las",
        "start": 3425.14,
        "end": 3435.5
    },
    {
        "text": " curvas de costo marginales es el punto de corte en el ingreso marginal y costo marginal. Entonces,",
        "start": 3435.5,
        "end": 3442.2999999999997
    },
    {
        "text": " ya estamos muy próximos a redondiar esto, es decir, la empresa maximiza donde el costo",
        "start": 3442.3,
        "end": 3451.54
    },
    {
        "text": " marginal es igual al ingreso marginal igual al precio y la variable que habla cada vez de terminar",
        "start": 3451.54,
        "end": 3456.5
    },
    {
        "text": " que cantidad de trabajadores hay que elegir para maximizar los beneficios, dado que el capital",
        "start": 3456.5,
        "end": 3464.1400000000003
    },
    {
        "text": " es fijo. Y bueno, lo que veíamos que en definitiva va a contratar con este concepto de que si la",
        "start": 3464.14,
        "end": 3476.02
    },
    {
        "text": " puntuidad marginal es superior a la salario contrata y si no, no va a contratar. Observemos esta gráfica",
        "start": 3476.02,
        "end": 3484.98
    },
    {
        "text": " que está acá, esta gráfica que está acá que nos permite vincular el tema de los costos,",
        "start": 3484.98,
        "end": 3493.42
    },
    {
        "text": " el tema de los costos marginales y los costos medios y el punto de maximización de beneficios.",
        "start": 3493.42,
        "end": 3499.78
    },
    {
        "text": " Entonces, ¿qué pasa? La empresa, yo bonito acá para que...",
        "start": 3499.78,
        "end": 3514.2200000000003
    },
    {
        "text": " La empresa tiene la curva de costo marginal que es la que está acá y el precio está acá.",
        "start": 3530.38,
        "end": 3536.78
    },
    {
        "text": " Este es el punto de máximo beneficio, coincide con la curva de costo medio,",
        "start": 3547.02,
        "end": 3552.2200000000003
    },
    {
        "text": " coincide con la curva del costo medio en su punto mínimo. Ahí es el punto máximo de",
        "start": 3552.22,
        "end": 3561.54
    },
    {
        "text": " producción, pero el punto de producción de maximiza lo beneficio de la empresa por todos los",
        "start": 3561.54,
        "end": 3567.08
    },
    {
        "text": " conceptos que tuvimos viendo. ¿Qué pasa en los tramos previos a llegar a ese punto máximo?",
        "start": 3567.08,
        "end": 3573.7599999999998
    },
    {
        "text": " Tenemos que incorporar las otras curvas que están acá. Entonces, acá tenemos la curva",
        "start": 3583.22,
        "end": 3598.54
    },
    {
        "text": " variable medio, la diferencia entre estas dos curvas es la curva de costos fijo medio. Bien,",
        "start": 3598.54,
        "end": 3608.5
    },
    {
        "text": " ¿qué pasa si la empresa está produciendo en un volumen de producción entre estas dos curvas?",
        "start": 3609.22,
        "end": 3614.54
    },
    {
        "text": " ¿O qué pasa si la empresa está produciendo en un volumen por debajo de esta curva?",
        "start": 3629.5,
        "end": 3634.26
    },
    {
        "text": " Y es lo que vamos a explicar ahí. ¿Qué pasa cuando la empresa está produciendo en un volumen",
        "start": 3638.5,
        "end": 3652.22
    },
    {
        "text": " de producción que coincide entre los mínimos de la curva de costo variable medio y la curva de costo",
        "start": 3652.22,
        "end": 3657.26
    },
    {
        "text": " medio? Bueno, ahí la empresa está obteniendo pérdidas.",
        "start": 3657.26,
        "end": 3666.54
    },
    {
        "text": " La empresa cubre los costos variables medios, pero no todos los fijo pedidos. La empresa",
        "start": 3668.5,
        "end": 3677.74
    },
    {
        "text": " si bien le conviene seguir produciendo porque supone que a medida que va a producir va a ir",
        "start": 3677.74,
        "end": 3683.98
    },
    {
        "text": " descontando esta pérdida, no es un punto de cierre, pero es un punto de corto plazo.",
        "start": 3683.98,
        "end": 3692.74
    },
    {
        "text": " No olvidemos que en definitiva el precio viene dado por el mercado, por lo tanto el precio va",
        "start": 3693.7,
        "end": 3701.8999999999996
    },
    {
        "text": " a determinar el volumen de producción acá, así justo coincide acá y bueno la empresa va a",
        "start": 3701.8999999999996,
        "end": 3707.2999999999997
    },
    {
        "text": " tratar de mantenerse en el mercado por un tiempo que pasa, de ahí que hay un corto plazo.",
        "start": 3707.2999999999997,
        "end": 3711.5
    },
    {
        "text": " Entonces, conceptualmente, si la nivel de producción está entre los mínimos de costos variables",
        "start": 3712.7,
        "end": 3717.74
    },
    {
        "text": " de medio y el costo medio, la empresa sigue produciendo pero tiene pérdidas y a medida que produce",
        "start": 3717.74,
        "end": 3723.14
    },
    {
        "text": " un poquito más va minimizando pérdidas. Ahora bien, la conceptualmente que va a recuperar parte",
        "start": 3723.14,
        "end": 3731.9399999999996
    },
    {
        "text": " de los costos fijo, ¿no? Ahora, cuando está acá, en este punto, me da un punto intermedio, pero está",
        "start": 3731.9399999999996,
        "end": 3738.7
    },
    {
        "text": " en un punto menor, en este punto al mínimo del costo variable, ahí la empresa directamente no le",
        "start": 3738.7,
        "end": 3743.3799999999997
    },
    {
        "text": " viene a producir, ahí la empresa cierre, ahí la empresa le combine a cerrar.",
        "start": 3743.38,
        "end": 3751.2200000000003
    },
    {
        "text": " ¿Por qué? Porque ni siquiera cubre los costos variables medios, entonces en definitiva,",
        "start": 3758.94,
        "end": 3766.38
    },
    {
        "text": " a medida que la empresa va produciendo, obviamente va a tener diferentes impactos en cuanto a su",
        "start": 3767.1800000000003,
        "end": 3775.46
    },
    {
        "text": " rentabilidad o su beneficio. O sea que definitiva la empresa, a un precio menor,",
        "start": 3775.46,
        "end": 3782.62
    },
    {
        "text": " a un precio menor dado por el punto mínimo del costo variable, no produce directamente cierra,",
        "start": 3786.2200000000003,
        "end": 3794.3
    },
    {
        "text": " el húmolo de producción entre los dos mínimos, está perdiendo en el costo plazo,",
        "start": 3795.3,
        "end": 3799.78
    },
    {
        "text": " se la va a bancar, acá en este punto hay donde maximiza beneficios.",
        "start": 3799.78,
        "end": 3804.7400000000002
    },
    {
        "text": " Beneficios? Beneficios nulos, es cuando maximiza, ¿qué pasa?",
        "start": 3806.7400000000002,
        "end": 3815.6200000000003
    },
    {
        "text": " La maximización de beneficios se da justamente cuando la empresa tiene beneficios igual",
        "start": 3815.6200000000003,
        "end": 3823.2000000000003
    },
    {
        "text": " a desacero y vamos a ver por qué. ¿Qué pasa? Beneficios 0, lo que está diciendo que la empresa",
        "start": 3823.2,
        "end": 3831.12
    },
    {
        "text": " está obteniendo la remuneración de su fator fijo, el costo de oportunidad de capital fijo.",
        "start": 3831.12,
        "end": 3838.8799999999997
    },
    {
        "text": " Ahí no tiene máximo beneficio, a pesar de que tramposo esto dice beneficios 0.",
        "start": 3840.8799999999997,
        "end": 3845.08
    },
    {
        "text": " No, hay lo que está diciendo beneficios nulos, justamente el punto donde la empresa logra",
        "start": 3845.08,
        "end": 3853.0
    },
    {
        "text": " recuperar la inversión de capital, es el punto de máximo beneficio. ¿Por qué que pasa?",
        "start": 3853.0,
        "end": 3859.8
    },
    {
        "text": " Consexualmente si la empresa estuviera justo en un nivel de producción acá tendría beneficios",
        "start": 3859.8,
        "end": 3870.96
    },
    {
        "text": " extra normales, beneficios positivos, lo que se dice en el mercado. ¿Más grande todavía?",
        "start": 3870.96,
        "end": 3880.24
    },
    {
        "text": " ¿Qué pasa? Me adelanta un poquito. Cuando se da esta situación extraordinaria, suponente",
        "start": 3880.24,
        "end": 3887.2
    },
    {
        "text": " que opones un negocio justo, en un medio competencia perfecta, ¿vos sabes que la rentabilidad",
        "start": 3887.2,
        "end": 3892.72
    },
    {
        "text": " normal, que yo recupero acá, mi inversión, donde tengo lo beneficio nulos, o sea más",
        "start": 3892.72,
        "end": 3899.2
    },
    {
        "text": " similio, lo beneficio, vamos a suponer que es el 5%, pero justo pasa con el mercado que",
        "start": 3899.2,
        "end": 3905.6
    },
    {
        "text": " la rentabilidad está por arriba de ese 5%, de 1.8% y vos estás vendiendo un puestito,",
        "start": 3905.6,
        "end": 3911.2
    },
    {
        "text": " ahí queríamos todos nosotros en el mercado competitivo, si veo que vos estás ganando",
        "start": 3911.2,
        "end": 3914.96
    },
    {
        "text": " 8, y yo 5, queríamos. Pongo tu negocio, ¿no? Agar, digo, mira, si ya está ganando",
        "start": 3914.96,
        "end": 3923.2799999999997
    },
    {
        "text": " más que yo, hago, voy a poner el negocio de ella, a la aumentar la inversión y aumentar",
        "start": 3923.2799999999997,
        "end": 3928.7599999999998
    },
    {
        "text": " la oferta que pasa con ese 8. Baja, ¿no? Entonces, cuando estos beneficios extraordinarios,",
        "start": 3928.76,
        "end": 3937.6800000000003
    },
    {
        "text": " superior, como decía vos más grandes, digamos, se da por un precio mayor, en el corto plazo",
        "start": 3937.6800000000003,
        "end": 3944.2200000000003
    },
    {
        "text": " se da una ganancia, pues después la movilidad de capital, va a ir que las inversiones producan",
        "start": 3944.2200000000003,
        "end": 3950.5200000000004
    },
    {
        "text": " este bien, aumenta la oferta baja hasta que vuelva un beneficio normal, que se beneficio,",
        "start": 3950.5200000000004,
        "end": 3958.1600000000003
    },
    {
        "text": " que se llama nulo, que es una palabra poco tramposa, pero lo que quiere decir es que está",
        "start": 3958.16,
        "end": 3964.2799999999997
    },
    {
        "text": " obteniendo la rentabilidad del capital Fijo, el RES, ¿no? Lo que pasa es que si ustedes",
        "start": 3964.2799999999997,
        "end": 3971.68
    },
    {
        "text": " analizan el por un lado, en una parte de la gráfica habría beneficio negativo, que sería",
        "start": 3971.68,
        "end": 3975.92
    },
    {
        "text": " todo anterior a esto, producir menos que este, es de beneficio negativo, acá directamente",
        "start": 3975.92,
        "end": 3981.48
    },
    {
        "text": " en el camino de producir, acá va minimizando de perdi, acá maximiza que cuando beneficio",
        "start": 3981.48,
        "end": 3985.3999999999996
    },
    {
        "text": " va a ser o y para arriba se da beneficio positivo. ¿Es el beneficio negativo a partir del punto",
        "start": 3985.4,
        "end": 3993.56
    },
    {
        "text": " que le hubieran? No, es tan mal, no, es negativo hasta el punto que le hubiera cacero,",
        "start": 3993.56,
        "end": 3999.96
    },
    {
        "text": " ahí es mas y mismo. ¿Es el beneficio que no tiene? No, a casi que beneficio",
        "start": 3999.96,
        "end": 4005.96
    },
    {
        "text": " es negativo, en esta parte directamente la empresa tiene que cerrar, porque no cubre,",
        "start": 4005.96,
        "end": 4010.6600000000003
    },
    {
        "text": " claro, lo cubre los costos variables, ¿no? Tachado, acá empieza a cubrir los costos",
        "start": 4010.66,
        "end": 4016.62
    },
    {
        "text": " fijos y acá lo recupera todos, ahí en el corto plazo, acá nada, acá en el corto plazo",
        "start": 4016.62,
        "end": 4023.54
    },
    {
        "text": " se supone que hay aguanta, pero el corto plazo, o muy corto plazo, acá citamos, ahora",
        "start": 4023.54,
        "end": 4027.3799999999997
    },
    {
        "text": " en un periodo el tiempo corto, no? No sea racional que usted está trabajando a perdias,",
        "start": 4027.3799999999997,
        "end": 4032.54
    },
    {
        "text": " como empresa, ¿no?",
        "start": 4032.54,
        "end": 4034.94
    },
    {
        "text": " Lo de la perdias es el si produjo o manzala, no, no, no, no, no, no, no, no, no, no, no,",
        "start": 4034.94,
        "end": 4046.02
    },
    {
        "text": " porque ¿qué pasa? El precio ha venido por el mercado, entonces vos producís, pero el",
        "start": 4046.02,
        "end": 4052.62
    },
    {
        "text": " precio que te paga el mercado ni siquiera te cubre tus costos de producción, eso es",
        "start": 4052.62,
        "end": 4056.06
    },
    {
        "text": " un poco la lectura medartezana, el que usted dice, ¿no? Entonces hay diferentes rangos,",
        "start": 4056.06,
        "end": 4060.94
    },
    {
        "text": " si no me cubre los variables directamente, os olvidate, si no me cubre los fijos, bueno,",
        "start": 4060.94,
        "end": 4066.54
    },
    {
        "text": " los medios, ¿no?",
        "start": 4066.54,
        "end": 4067.94
    },
    {
        "text": " Ahí la voy llevando, claro, ahí la voy llevando, hasta un punto que bueno sí está,",
        "start": 4067.94,
        "end": 4073.2200000000003
    },
    {
        "text": " ¿no? No está eternamente, no es amor y paz, esto acá es maximizar beneficio, fue",
        "start": 4073.2200000000003,
        "end": 4078.06
    },
    {
        "text": " que racional, ¿no? Luego lo maximizar en el punto de beneficio, ¿guala ser o si por",
        "start": 4078.06,
        "end": 4083.18
    },
    {
        "text": " el mercado justo me paga manzanas, por arriba de lo que es el barro, pero ahí se va",
        "start": 4083.18,
        "end": 4088.3
    },
    {
        "text": " a dar el por el mercadismo de mercado que la más gente va a producir manzanas y te va",
        "start": 4088.3,
        "end": 4092.94
    },
    {
        "text": " bajar el precio. Esto es definitiva, ¿no? En definitiva para que esto nos quede claro,",
        "start": 4092.94,
        "end": 4101.320000000001
    },
    {
        "text": " a cada nivel de precio, definitiva la empresa va a determinar el nivel de producción y",
        "start": 4101.320000000001,
        "end": 4107.78
    },
    {
        "text": " ese nivel de producción va a determinar si realmente la empresa tiene ganancias o no",
        "start": 4107.78,
        "end": 4112.7
    },
    {
        "text": " tiene ganancias, si le come en producir, o no le come en producir. ¿Dónde le come",
        "start": 4112.7,
        "end": 4118.58
    },
    {
        "text": " en producir? Bueno, le come en producir obviamente, por lo menos que cubra acá, que cubra",
        "start": 4118.58,
        "end": 4125.179999999999
    },
    {
        "text": " esta situación, pero esto es muy corto plazo, vamos a maximizar acá cuando matemáticamente",
        "start": 4125.179999999999,
        "end": 4130.139999999999
    },
    {
        "text": " la beneficio es un nulo y si para arriba, bueno sería beneficio extraordinario, está normal,",
        "start": 4130.139999999999,
        "end": 4136.099999999999
    },
    {
        "text": " una cosa también de corto plazo. En largo plazo va a ser el beneficio igual a cero,",
        "start": 4136.1,
        "end": 4142.54
    },
    {
        "text": " o dicho de otra forma, cuando el nivel de producción haga que el costo marginal, que es la",
        "start": 4142.54,
        "end": 4147.740000000001
    },
    {
        "text": " curva de esta caja, me igualia al precio, ese es el punto de maximización de beneficios,",
        "start": 4147.740000000001,
        "end": 4153.9800000000005
    },
    {
        "text": " el punto donde la empresa va realmente a procurar producir o vender. Con la salvedad de",
        "start": 4153.9800000000005,
        "end": 4162.700000000001
    },
    {
        "text": " que si la empresa está por acá abajo, cuando lo he dicho, cuando el precio del mercado",
        "start": 4162.7,
        "end": 4167.74
    },
    {
        "text": " haga que la empresa pueda producir este nivel de producción por debajo del mínimo del costo",
        "start": 4167.74,
        "end": 4171.9
    },
    {
        "text": " variable le comienes a rar, racionalmente. En el medio estamos hablando que no cierra,",
        "start": 4171.9,
        "end": 4180.0599999999995
    },
    {
        "text": " pero está perdiendo y no cierra, se te dio que bueno el corto plazo espera que la",
        "start": 4180.0599999999995,
        "end": 4185.26
    },
    {
        "text": " situación cambia, eso es un poco le dio. Maximiza en el punto este de corto, entre",
        "start": 4185.26,
        "end": 4191.42
    },
    {
        "text": " el costo marginal, igual al precio que congide con el punto mínimo del costo variable medio",
        "start": 4191.42,
        "end": 4197.14
    },
    {
        "text": " y que es donde es beneficio nulo, beneficio nulo retero no quiere decir que no tenga ganancia,",
        "start": 4197.14,
        "end": 4202.02
    },
    {
        "text": " quiere decir que está justamente obteniendo la remoración por el capital. El costo oportunidad,",
        "start": 4202.02,
        "end": 4210.38
    },
    {
        "text": " pero de quién lo está captando, por eso hablamos de beneficio conmigo, no? No beneficio",
        "start": 4210.38,
        "end": 4216.3
    },
    {
        "text": " contar. Bueno esto te explicaba acá, si el precio del bien está por arriba del costo variable",
        "start": 4216.3,
        "end": 4227.14
    },
    {
        "text": " medio, la empresa va a producir pero perdiendo. Si coincide justo el punto este,",
        "start": 4227.14,
        "end": 4239.9800000000005
    },
    {
        "text": " el mínimo del costo variable medio y hay un punto de indiferencia, hay un punto de cierre,",
        "start": 4240.98,
        "end": 4247.98
    },
    {
        "text": " de que bueno, producen a producen. Si el precio está menor que el costo variable medio,",
        "start": 4247.98,
        "end": 4255.58
    },
    {
        "text": " ahí la empresa no produce. Y lo que mencionábamos recién con ella, si el precio está por arriba",
        "start": 4255.58,
        "end": 4263.139999999999
    },
    {
        "text": " acá, por arriba del costo medio, ahí la empresa tiene beneficios extra-normales o beneficios",
        "start": 4263.139999999999,
        "end": 4269.299999999999
    },
    {
        "text": " positivos, y lo que beneficio positivos acá es decir por encima del normal. Beneficio normales",
        "start": 4269.3,
        "end": 4275.7
    },
    {
        "text": " quiere decir que recupera el costo de capital, el R o el beneficio nulo como dice acá, reto",
        "start": 4275.7,
        "end": 4281.34
    },
    {
        "text": " de panoco fundinos con eso. Hoy chato de forma, beneficio nulo al contrario no quiere decir que",
        "start": 4281.34,
        "end": 4286.9400000000005
    },
    {
        "text": " no ganes sino que está teniendo el máximo de beneficios normales. Porque vas copiarde por",
        "start": 4286.9400000000005,
        "end": 4294.18
    },
    {
        "text": " encima tiene beneficios extra-normales. Bueno, mira acá podemos verlo con esta gráfica. El",
        "start": 4294.18,
        "end": 4302.9800000000005
    },
    {
        "text": " precio de este bien está en 40, el máximo de producción, mejor dicho, el punto de maximización",
        "start": 4302.9800000000005,
        "end": 4311.66
    },
    {
        "text": " de producción estaría de acuerdo a lo que vimos en este punto, donde el costo marginal corta",
        "start": 4311.66,
        "end": 4318.900000000001
    },
    {
        "text": " a la curva del costo medio en sumínimo. La empresa tiene acá beneficios extra-normales,",
        "start": 4318.9,
        "end": 4329.139999999999
    },
    {
        "text": " beneficios extra-normales. Yo ya mente la empresa está bien que produzca acá, porque si produce",
        "start": 4329.139999999999,
        "end": 4338.179999999999
    },
    {
        "text": " menos dejaría de ganar este rango, no? No denleguyen que este es el ingreso marginal, que es el",
        "start": 4338.179999999999,
        "end": 4343.46
    },
    {
        "text": " precio y el costo marginal, este tiene engolito sería dejaría de vender si no produce este",
        "start": 4343.46,
        "end": 4348.139999999999
    },
    {
        "text": " punto ahí. Si produce más desde punto sin invierte el costo marginal, supera el ingreso",
        "start": 4348.14,
        "end": 4354.18
    },
    {
        "text": " marginal, tiene un ingreso marginal es negativo, no le comiene. O sea que la empresa siempre va a",
        "start": 4354.18,
        "end": 4361.18
    },
    {
        "text": " producir en el punto de un ingreso marginal es igual al costo marginal. En este caso particular,",
        "start": 4361.18,
        "end": 4366.820000000001
    },
    {
        "text": " que es profesamente si lo opongo es de beneficios super-gesas normales, pero con séctualmente no cambia",
        "start": 4366.820000000001,
        "end": 4373.14
    },
    {
        "text": " la decisión. La empresa siempre va a producir donde el costo marginal igual es al ingreso marginal.",
        "start": 4373.14,
        "end": 4379.700000000001
    },
    {
        "text": " Es un tramo creciente, ¿no? Algunos me persiguó porque no es un máximo, pero es el tramo",
        "start": 4379.700000000001,
        "end": 4384.700000000001
    },
    {
        "text": " creciente de la curva. Bueno, esto que está acá es justamente la numeración de esto que está acá,",
        "start": 4384.700000000001,
        "end": 4399.42
    },
    {
        "text": " ¿no? Y el gráfico éste. Lo que quería pasarles a ver es esto.",
        "start": 4399.42,
        "end": 4403.1
    },
    {
        "text": " A ver, no está vinculado acá, va vinculado. A ver, la empresa maximiza acá en",
        "start": 4429.42,
        "end": 4437.7
    },
    {
        "text": " a lo que dice acá, ¿no? Con un nivel de producción de cuas tenisco que ocho unidades que está acá.",
        "start": 4437.7,
        "end": 4441.82
    },
    {
        "text": " Ahí es el punto máximo de producción. Bien. Como yo le mencionaba, a un nivel de producción",
        "start": 4441.82,
        "end": 4448.78
    },
    {
        "text": " menor el costo marginal es menor al ingreso marginal, por lo tanto le comiene producir más como recién",
        "start": 4448.78,
        "end": 4454.9800000000005
    },
    {
        "text": " decíamos. Si el costo supera al ingreso marginal, o sea si el tipo de recién porque no producimos más",
        "start": 4454.98,
        "end": 4462.459999999999
    },
    {
        "text": " sonidades, cuas un dos no le conviene producir hasta ahí lo que tuvimos viendo. Bueno, muy bien.",
        "start": 4462.459999999999,
        "end": 4467.62
    },
    {
        "text": " En cuasus cero, en nivel de producción, cuasus cero se iguala los ingresos y costos marginales.",
        "start": 4469.459999999999,
        "end": 4474.86
    },
    {
        "text": " Y lo que está acá, yo les mencionaba que eso no es un punto máximo de producción.",
        "start": 4475.66,
        "end": 4479.82
    },
    {
        "text": " Porque le conviene seguir produciendo la empresa más porque aumenta su beneficio marginal.",
        "start": 4479.82,
        "end": 4488.58
    },
    {
        "text": " ¿Cusero está con tu mamá? No, cusero no es esa, cusero sacáme la.",
        "start": 4488.58,
        "end": 4492.38
    },
    {
        "text": " El V. Bueno, entonces en nivel de producción donde la empresa va a maximizar su beneficio,",
        "start": 4492.38,
        "end": 4502.0599999999995
    },
    {
        "text": " eso es el tramo creciente de los costos marginales. Muy bien. A, B y la diferencia entre el precio",
        "start": 4502.06,
        "end": 4511.860000000001
    },
    {
        "text": " y el costo medio. A, B y la diferencia entre el precio y el costo medio. El precio está bien",
        "start": 4511.860000000001,
        "end": 4524.38
    },
    {
        "text": " aranja y este es el costo medio. Perfecto. El área a B, B, es justamente el área de estos",
        "start": 4524.38,
        "end": 4537.82
    },
    {
        "text": " beneficios positivos, beneficios está normales. Vamos a ver. P, menos el costo medio por el cu.",
        "start": 4537.82,
        "end": 4544.86
    },
    {
        "text": " Toda esta área que está acá a B, es de dado por la cantidad cu y el precio, no?",
        "start": 4544.86,
        "end": 4554.219999999999
    },
    {
        "text": " De la diferencia entre el dinero más que el costo medio es los beneficios positivos,",
        "start": 4556.719999999999,
        "end": 4560.62
    },
    {
        "text": " esta normales. Perfecto.",
        "start": 4560.62,
        "end": 4562.219999999999
    },
    {
        "text": " Entonces en cuasterisco donde el ingreso marginal es igual a costo marginal",
        "start": 4566.219999999999,
        "end": 4572.42
    },
    {
        "text": " y el precio es menor que el costo medio, ahí la empresa tiene pérdidos o el área a B,",
        "start": 4573.3,
        "end": 4579.22
    },
    {
        "text": " B, en este gráfico que estamos viendo. Acá en este caso en esta empresa si está produciendo a",
        "start": 4579.22,
        "end": 4584.3
    },
    {
        "text": " este nivel, obtendrían pérdidas. Por lo tanto, no tendría sentido que la empresa",
        "start": 4584.3,
        "end": 4590.7
    },
    {
        "text": " mantenga esto indefinidamente. En el corto plazo la empresa puede tener pérdidas, pero no lo",
        "start": 4594.46,
        "end": 4599.58
    },
    {
        "text": " va a tener en términos indefinidos. ¿Cuál es la explicación de acá? Observe la diferencia",
        "start": 4599.58,
        "end": 4604.62
    },
    {
        "text": " en del costo variale en medio del costo total medio, los costos ficos son muy grandes. Y esto es lo que",
        "start": 4604.62,
        "end": 4609.0599999999995
    },
    {
        "text": " está aplicando que en este caso en la empresa, a este precio, a este precio en la empresa",
        "start": 4609.0599999999995,
        "end": 4614.86
    },
    {
        "text": " está teniendo pérdidas. Esto implica que la empresa va a cerrar, no implica que la empresa",
        "start": 4614.86,
        "end": 4619.7
    },
    {
        "text": " va a cerrar. A la empresa acama si mencionía, pero no es la situación óptimo. Tiene un ingreso",
        "start": 4619.7,
        "end": 4629.3
    },
    {
        "text": " inferior a los costos, el ingreso va tardado por P por Q, P es esto, mientras que las costos son",
        "start": 4629.3,
        "end": 4636.42
    },
    {
        "text": " estos. La diferencia acá en este caso es una pérdida. O sea, el P por Q sería todo el",
        "start": 4636.42,
        "end": 4644.78
    },
    {
        "text": " cubo esterisco por el peno, la línea amarilla y los costos son superiores, ahí está la pérdida.",
        "start": 4644.78,
        "end": 4650.860000000001
    },
    {
        "text": " La diferencia es gráfico anterior que vivíamos que era una ganancia, positivo. Entonces, en este caso",
        "start": 4652.14,
        "end": 4659.22
    },
    {
        "text": " los costos ficos son más altos, lo que leva el costo medio, obviamente los costos ficos",
        "start": 4659.22,
        "end": 4664.9800000000005
    },
    {
        "text": " no van a alterar la cuba de costo marginal y el costo variale en medio y la línea que pérdida",
        "start": 4664.9800000000005,
        "end": 4669.7
    },
    {
        "text": " en la empresa, ahí es a BCD. La empresa va a producir, como yo le mencionéaba, en este caso,",
        "start": 4669.7,
        "end": 4678.860000000001
    },
    {
        "text": " ya que si deja de producir, tiene que pagar todos los costos ficos y en este caso algo de",
        "start": 4678.860000000001,
        "end": 4684.3
    },
    {
        "text": " los costos ficos recupera. No produce si el precio es menor que el costo variale es mínimo y",
        "start": 4684.3,
        "end": 4691.74
    },
    {
        "text": " tiene beneficio positivo si el precio es superior al costo total medio. Entonces, ¿qué pasa?",
        "start": 4691.74,
        "end": 4696.900000000001
    },
    {
        "text": " Resumiendo, resumiendo para que nos queda más claro que esta gráfica nos puede mezclar",
        "start": 4696.900000000001,
        "end": 4707.74
    },
    {
        "text": " lo concepto, definiendo eso. ¿Cómo define la empresa o cómo toma laación de producción?",
        "start": 4707.74,
        "end": 4712.98
    },
    {
        "text": " ¿Dónde se va a maximizar los beneficios en el nivel de producción del costo marginal y",
        "start": 4714.48,
        "end": 4718.66
    },
    {
        "text": " sigo en el ingreso marginal? Si el precio, si el precio que viene por el mercado me supera el costo",
        "start": 4718.66,
        "end": 4729.7
    },
    {
        "text": " total medio, la empresa tiene beneficios superiores a normales, beneficios extraordinarios,",
        "start": 4729.7,
        "end": 4736.9
    },
    {
        "text": " beneficios positivos. Si el precio se sitúa entre el costo variale medio y el costo total medio,",
        "start": 4736.9,
        "end": 4745.66
    },
    {
        "text": " ahí la empresa está mimisando pergas, tiene beneficios negativos, en el corto plazo va a",
        "start": 4745.66,
        "end": 4753.339999999999
    },
    {
        "text": " producir pero no eternamente. Y si el precio es menor que el costo variale medio, obviamente menor",
        "start": 4753.339999999999,
        "end": 4761.42
    },
    {
        "text": " que el costo total también, ahí la empresa debe cerrar. Y esto es en definitiva lo que nos",
        "start": 4761.42,
        "end": 4768.02
    },
    {
        "text": " lleva, nos introduce a determinar la oferta de la empresa ¿no? Porque la oferta de la empresa",
        "start": 4768.02,
        "end": 4776.7
    },
    {
        "text": " veíamos que nos estaba indicando cuánto su idea va a producir a diferente nivel de precio.",
        "start": 4776.7,
        "end": 4781.66
    },
    {
        "text": " Y en este ejercicio que estuvimos viendo acá con estas gráficas un poquito que nos",
        "start": 4781.66,
        "end": 4787.42
    },
    {
        "text": " entreveraba, es bueno según el precio va a ser la cantidad que va a ofrecer la empresa y",
        "start": 4787.42,
        "end": 4793.54
    },
    {
        "text": " lo que decíamos recién en el resumen, según acá el resumen este. Entonces ¿qué pasa?",
        "start": 4793.54,
        "end": 4801.06
    },
    {
        "text": " La curva de oferta en la niña manimeno que la curva del costo marginal a partir del costo variable",
        "start": 4802.74,
        "end": 4812.7
    },
    {
        "text": " medio mínimo. Ahí la empresa va a empezar a producir en el muy corto plazo, en el corto plazo,",
        "start": 4812.7,
        "end": 4818.179999999999
    },
    {
        "text": " obtiene pérdida ¿no? Pero va recuperando los costos fijos. En nivel de producción donde está el",
        "start": 4818.179999999999,
        "end": 4826.26
    },
    {
        "text": " mínimo del costo medio ahí la empresa va a maximizar los beneficios y es un equilibrio de largo plazo",
        "start": 4826.26,
        "end": 4833.54
    },
    {
        "text": " porque cuando está perdiendo no va a ser sostenible, cuando está teniendo beneficios muy superior,",
        "start": 4833.54,
        "end": 4838.58
    },
    {
        "text": " la empresa va a normal de tampoco sostenible por el juego de mercado. Por lo tanto a partir del",
        "start": 4838.58,
        "end": 4844.18
    },
    {
        "text": " mínimo del costo total medio la empresa tiene los beneficios superiosos normales. Y acá en",
        "start": 4844.18,
        "end": 4850.1
    },
    {
        "text": " definitivas no ya estamos aproximándonos justamente a definir la curva de oferta ¿no? ¿Y qué tenemos acá?",
        "start": 4850.1,
        "end": 4856.7
    },
    {
        "text": " La empresa, como define su nivel de producción y la empresa va a definir su nivel de producción de",
        "start": 4858.7,
        "end": 4864.62
    },
    {
        "text": " forma tal que el ingreso de maginete igual al costo, el ingreso es el precio y el costo marginal.",
        "start": 4864.62,
        "end": 4869.74
    },
    {
        "text": " En la medida que la empresa puede acongrir su costo variable de producción, entonces",
        "start": 4871.5,
        "end": 4876.98
    },
    {
        "text": " observa al precio 2 o al precio 1 esto es superior al costo medio por lo tanto la empresa ahí tiene",
        "start": 4878.98,
        "end": 4886.9
    },
    {
        "text": " beneficios estalagumales. En el medio está perdiendo por debajo de este nivel de producción el",
        "start": 4886.9,
        "end": 4895.66
    },
    {
        "text": " mínimo de costo variable tiene que cerrar ahí no cubre los costos variables. Entonces,",
        "start": 4895.66,
        "end": 4901.339999999999
    },
    {
        "text": " ¿cómo se va a determinar la cantidad oferta? La cantidad ofrecida de la empresa y la cantidad",
        "start": 4903.139999999999,
        "end": 4910.259999999999
    },
    {
        "text": " ofrecida de la empresa va a ser justamente a partir del mínimo del costo variable medio de",
        "start": 4910.259999999999,
        "end": 4916.46
    },
    {
        "text": " que se llamó recién. ¿Por qué? Porque a partir del costo variable medio antes cerrar,",
        "start": 4916.46,
        "end": 4923.3
    },
    {
        "text": " cierra la empresa. A partir de este punto la empresa va minimizando perdias acá en este",
        "start": 4923.3,
        "end": 4929.26
    },
    {
        "text": " punto maximiza y si el precio llega a superar la empresa acá tiene beneficios estalagumales.",
        "start": 4929.26,
        "end": 4936.02
    },
    {
        "text": " Entonces, que ocurre, la curva de oferta va a tener pendiente positiva ya que hay rendimiento",
        "start": 4936.02,
        "end": 4945.22
    },
    {
        "text": " de crecientes, costos crecientes. Cuando sube el precio de la producción adicional obviamente va",
        "start": 4945.22,
        "end": 4954.46
    },
    {
        "text": " a repercutir a todas y eso es definitiva es que tiene un impacto en los beneficios sin ningún tipo",
        "start": 4954.46,
        "end": 4960.46
    },
    {
        "text": " de dudas. Entonces, ahora estamos en condiciones de a partir de esta gráfica definir un poquito más",
        "start": 4960.46,
        "end": 4974.14
    },
    {
        "text": " más. ¿Por qué la curva de oferta tiene la forma que tiene? Y eso es una cosa así, ¿no?",
        "start": 4975.22,
        "end": 4986.1
    },
    {
        "text": " O bueno o así si quiero. ¿Qué pasa? Por menos de este precio a un precio menor la empresa",
        "start": 4986.1,
        "end": 5004.02
    },
    {
        "text": " no produce, acá es círola oferta. ¿A qué es círola oferta? No le comienes producir, ¿no?",
        "start": 5004.02,
        "end": 5010.700000000001
    },
    {
        "text": " Es esto que está acá. Esta parte que está acá es círola oferta. Por eso es la curva oferta de",
        "start": 5010.7,
        "end": 5016.66
    },
    {
        "text": " esa línea raladita lila que está ahí. En el medio de la curva de costos, ahí la empresa, bueno,",
        "start": 5016.66,
        "end": 5024.179999999999
    },
    {
        "text": " ahí la empresa tiene un perdias, ¿no? Pues yo le decía, y por arriba a esos precios tiene beneficios",
        "start": 5024.179999999999,
        "end": 5030.34
    },
    {
        "text": " tan normales. De ahí que la curva de oferta de la empresa, es la curva de costos imaginares,",
        "start": 5030.34,
        "end": 5034.94
    },
    {
        "text": " el tramo creciente de la curva, partiendo de un punto donde la empresa produce cero.",
        "start": 5034.94,
        "end": 5042.0199999999995
    },
    {
        "text": " Entonces, resumiendo que estuvimos viendo, ¿cuál es el punto de la empresa va a producir?",
        "start": 5052.9,
        "end": 5061.5
    },
    {
        "text": " Una foca racional, la empresa, la empresa, la empresa, la beneficio va a tratar de terminar la",
        "start": 5062.5,
        "end": 5066.46
    },
    {
        "text": " cantidad de ganemás. Si hay un costo fijo, pues estamos en el corto plazo y para aumentar la",
        "start": 5066.46,
        "end": 5073.18
    },
    {
        "text": " producción o variar esa es la producción, tengo que aumentar o variar la cantidad de factores",
        "start": 5073.18,
        "end": 5077.54
    },
    {
        "text": " productivos, de casos trabajos, la variable clave acá en ese torno es que cantidad de trabajo",
        "start": 5077.54,
        "end": 5082.46
    },
    {
        "text": " tengo que contratar para obtener la base de ese nuevo beneficio. Ahí vimos que en la comparación,",
        "start": 5082.46,
        "end": 5087.86
    },
    {
        "text": " en costo marginal, en ingreso marginal, va a contratar en la medida que el valor de la",
        "start": 5087.86,
        "end": 5092.38
    },
    {
        "text": " putidad marginal, unidad de poner precio, supera el salario. El costo es salario. Perfecto.",
        "start": 5092.38,
        "end": 5098.099999999999
    },
    {
        "text": " Los costos son crecientes y dado que el precio vinado por el mercado, lo que entra a jugar acá",
        "start": 5098.099999999999,
        "end": 5105.46
    },
    {
        "text": " es esta análisis que yo le estoy mostrando acá para determinar la oferta de la empresa, la curva",
        "start": 5105.46,
        "end": 5110.78
    },
    {
        "text": " de la oferta de la empresa, que va a definir cuánta suena de la propuesta de diferentes niveles",
        "start": 5110.78,
        "end": 5115.66
    },
    {
        "text": " de precio. Si el precio de mercado está por debajo del costo variable medio mínimo, la empresa",
        "start": 5115.66,
        "end": 5121.9
    },
    {
        "text": " va a posir cero, la empresa no le conviene producir nada, no cubre los costos variables",
        "start": 5121.9,
        "end": 5129.66
    },
    {
        "text": " y lo fijo nada. Si el precio de mercado viene dado en un tramo entre el costo variable medio",
        "start": 5129.66,
        "end": 5137.74
    },
    {
        "text": " y el costo medio total, ahí la empresa le conviene producir aunque está perdiendo, porque",
        "start": 5137.74,
        "end": 5142.66
    },
    {
        "text": " no cubre todos los costos fijos. Pero le conviene producir porque si no produce nada,",
        "start": 5142.66,
        "end": 5148.9
    },
    {
        "text": " se absorbe todos los costos fijos. El punto de va a maximizar es el punto de corte en",
        "start": 5148.9,
        "end": 5156.139999999999
    },
    {
        "text": " el ingreso imaginar, el costo marginal que es acá y si llega a tener un precio superior",
        "start": 5156.139999999999,
        "end": 5161.34
    },
    {
        "text": " a este, la empresa tiene beneficios extraordinarios, que están normales o positivos. Como estamos",
        "start": 5161.34,
        "end": 5166.34
    },
    {
        "text": " en un mercado competencia perfecta, sabemos que esta situación es posible pero es corto",
        "start": 5166.34,
        "end": 5173.2
    },
    {
        "text": " plasista. Sabemos que si alguien tiene una rentabilidad superior a normal, otros van a",
        "start": 5173.2,
        "end": 5178.860000000001
    },
    {
        "text": " venir a producir, va a aumentar la oferta, baja el precio, por lo tanto me iluge ese beneficio",
        "start": 5178.860000000001,
        "end": 5184.82
    },
    {
        "text": " está normal. De ahí que es largo plazo en un mercado competitivo, lo que es esperable es",
        "start": 5184.82,
        "end": 5190.22
    },
    {
        "text": " que todas las empresas obtengan este beneficio, o beneficios nulos normales, que ninguno entage",
        "start": 5190.22,
        "end": 5197.780000000001
    },
    {
        "text": " el otro. Por este juego de mercado, si la empresa no cubre los costos, también estamos en el",
        "start": 5197.780000000001,
        "end": 5208.820000000001
    },
    {
        "text": " corto plazo, como decíamos, si no cubre todos los costos fijos tampoco va a producir mucho.",
        "start": 5208.820000000001,
        "end": 5214.54
    },
    {
        "text": " Por lo tanto, en el largo plazo lo que estamos hablando es que la empresa va a maximizar",
        "start": 5214.54,
        "end": 5220.42
    },
    {
        "text": " en este punto de producción, donde el precio es igual a costo marginal y es el igual al",
        "start": 5220.42,
        "end": 5228.7
    },
    {
        "text": " mínimo del costo medio. Y eso es el punto de maximizar la empresa su nivel de producción.",
        "start": 5228.7,
        "end": 5237.1
    },
    {
        "text": " Puede darse otro nivel, si seguramente se dé de otros niveles, pero siempre en el corto plazo.",
        "start": 5237.1,
        "end": 5242.98
    },
    {
        "text": " Si es un precio menor, la empresa va a perder y no le va a gastar mucho tiempo, si es un",
        "start": 5242.98,
        "end": 5246.419999999999
    },
    {
        "text": " precio mayor, otras empiezas a me haber producido y bajas esa ganancia está normal. Esto",
        "start": 5246.419999999999,
        "end": 5255.179999999999
    },
    {
        "text": " en definitiva, esta línea, lila, rayadita es la curva de oferta. Si yo borro todo, de",
        "start": 5255.179999999999,
        "end": 5262.4
    },
    {
        "text": " dejo solo la parte lila es la curva de oferta. ¿Qué es lo que intenté poner allá?",
        "start": 5262.4,
        "end": 5269.299999999999
    },
    {
        "text": " Debajo de el punto mínimo de esta rayita, no produce a partir de acá, mejor dicho de",
        "start": 5269.3,
        "end": 5274.06
    },
    {
        "text": " este precio. Lo ve mucha llor. Entonces, determinada y con esto terminamos, determinada la",
        "start": 5274.06,
        "end": 5285.22
    },
    {
        "text": " función de oferta, obviamente, ¿qué pasa si variara los precios de los factores? Bueno,",
        "start": 5285.22,
        "end": 5292.42
    },
    {
        "text": " obviamente si variara el peso de los factores, me tiene un impacto en los costos. Si",
        "start": 5292.42,
        "end": 5299.9400000000005
    },
    {
        "text": " sube el precio un factor, por ejemplo, si sube el factor trabajo, si me aumenta el precio",
        "start": 5299.9400000000005,
        "end": 5306.06
    },
    {
        "text": " del trabajo, si me sale más caro, me contató a trabajadores, si me sale más caro producir,",
        "start": 5306.06,
        "end": 5310.9400000000005
    },
    {
        "text": " tiene un impacto en los costos marginales. Por lo tanto, me va a impactar en el nivel de",
        "start": 5310.9400000000005,
        "end": 5316.9800000000005
    },
    {
        "text": " producción. Si yo estoy en esta curva de costo marginal, que es la curva de oferta de",
        "start": 5316.98,
        "end": 5320.58
    },
    {
        "text": " la empresa, ¿no? A este nivel de precio, que es el precio que viene dado por el mercado,",
        "start": 5320.58,
        "end": 5326.86
    },
    {
        "text": " me sube los costos, el precio no se modifica, el precio está dado, lo que pasa es que la",
        "start": 5326.86,
        "end": 5332.36
    },
    {
        "text": " oferta se corre hacia la izquierda. Por lo tanto, a este mismo precio produce menos.",
        "start": 5332.36,
        "end": 5337.98
    },
    {
        "text": " ¿Sí? Analogamente, si los costos se abaratan, produce más. En este caso estamos hablando",
        "start": 5337.98,
        "end": 5349.94
    },
    {
        "text": " de salario, que ese costo fue el trabajo. Se ve, muchos sectos. Entonces, la curva de oferta",
        "start": 5349.94,
        "end": 5365.86
    },
    {
        "text": " de la empresa está dado por esto que yo le decía, y la oferta del mercado es la suma",
        "start": 5365.86,
        "end": 5370.62
    },
    {
        "text": " de las ofertas individuales. Si por ejemplo tenemos tres empresas que están dado por",
        "start": 5370.62,
        "end": 5375.78
    },
    {
        "text": " estas curvas de ofertas, la suma me va a dar la oferta del mercado. El precio es menos",
        "start": 5375.78,
        "end": 5385.099999999999
    },
    {
        "text": " que pese 1, vemos que el mercado no produce nada, ¿no? O sea, vemos acá. Si el precio",
        "start": 5385.099999999999,
        "end": 5395.179999999999
    },
    {
        "text": " es menor que pese 1, nadie produce. Si el precio está en te pese 1 y pese 2, hay una",
        "start": 5395.18,
        "end": 5401.700000000001
    },
    {
        "text": " empresa tan interesada a producir, va a coger la oferta del mercado, y al precio pese",
        "start": 5401.700000000001,
        "end": 5409.42
    },
    {
        "text": " 1 y 2, ahí sí, la oferta es de las tres empresas. La oferta del mercado no es más que",
        "start": 5409.42,
        "end": 5422.02
    },
    {
        "text": " la suma de las ofertas individuales, y lo que está acá es referido a lo que vimos",
        "start": 5422.02,
        "end": 5433.740000000001
    },
    {
        "text": " en otro día, sobre la la esticidad. ¿Qué quiere decir una oferta totalmente inelástica?",
        "start": 5433.740000000001,
        "end": 5439.780000000001
    },
    {
        "text": " ¿Y qué quiere decir que no pongo producir más? O dicho técnicamente en forma mejor,",
        "start": 5439.780000000001,
        "end": 5446.9400000000005
    },
    {
        "text": " segurosos, por más que varía el precio del bien, la producción no varía. No tengo",
        "start": 5446.94,
        "end": 5454.219999999999
    },
    {
        "text": " posibilidad adaptarme a cambiar o aumentar, en este caso por ejemplo si sube el precio,",
        "start": 5454.219999999999,
        "end": 5462.7
    },
    {
        "text": " la producción oferta totalmente inelástica, y es totalmente elástica cuando un pequeño",
        "start": 5462.7,
        "end": 5467.259999999999
    },
    {
        "text": " variación del costo marginal hace que la producción varía muy significativamente. Bueno,",
        "start": 5467.26,
        "end": 5478.66
    },
    {
        "text": " entonces, a corto plazo los beneficios son positivos, si hay beneficios positivos, entra",
        "start": 5478.66,
        "end": 5493.26
    },
    {
        "text": " en la empresa producir, pues lo que yo decía anteriormente, lo otro que puede dar",
        "start": 5493.26,
        "end": 5500.5
    },
    {
        "text": " es que la empresa está perdida y a largo plazo lo que ocurre es que los beneficios son",
        "start": 5500.5,
        "end": 5504.74
    },
    {
        "text": " normales. Ahí no hay incentivos para que la empresa varía. Y es definitiva, si la empresa",
        "start": 5504.74,
        "end": 5512.74
    },
    {
        "text": " está en equilibrio, está más simisando, estamos en el mercado competitivo, donde nadie",
        "start": 5512.74,
        "end": 5515.84
    },
    {
        "text": " aumenta a nadie, todos están ganando esa rentabilidad razonable o normal, que entiende",
        "start": 5515.84,
        "end": 5521.14
    },
    {
        "text": " el mercado, por lo tanto no hay incentivos para que nadie se vaya a dar. Y eso es lo que",
        "start": 5521.14,
        "end": 5525.9400000000005
    },
    {
        "text": " es esperable en el largo plazo en el mercado competitivo como estamos hablando.",
        "start": 5525.9400000000005,
        "end": 5531.660000000001
    },
    {
        "text": " Pregunta a muchachos, dudas. Bueno, esto ya está subido en la página, cualquier cosa,",
        "start": 5531.660000000001,
        "end": 5540.3
    },
    {
        "text": " en la próxima podemos ver, lo retomamos en todo caso, la idea acá era justamente ver",
        "start": 5540.3,
        "end": 5545.700000000001
    },
    {
        "text": " cómo decidir la empresa, la capacidad, el su nivel de producir.",
        "start": 5545.700000000001,
        "end": 5548.780000000001
    }
]