[
    {
        "text": " Bueno gente, vieron lo del parcial, ¿no? Está fijado el viernes veintidós. Se adelantó,",
        "start": 0.0,
        "end": 25.52
    },
    {
        "text": " o sea no vamos a tener clase ese día, es parte del parcial y se ajusta el que se hizo. Y bueno,",
        "start": 25.52,
        "end": 30.4
    },
    {
        "text": " estamos tratando de meterle para llegar con todos los temas, pues vamos a tener una clase menos",
        "start": 30.4,
        "end": 35.16
    },
    {
        "text": " que el otro grupo y no nos va a quedar para dedicar toda una clase a duda, o sea que en realidad",
        "start": 35.16,
        "end": 41.36
    },
    {
        "text": " hay jueves, en el hogario de jueves es de 12, 30, 14, 30, es que le vamos a edicar a la clase",
        "start": 41.36,
        "end": 47.480000000000004
    },
    {
        "text": " de dudas, una parte de base de descriptiva, yo trae macro. Bien, bueno, estamos avanzando en los",
        "start": 47.48,
        "end": 55.559999999999995
    },
    {
        "text": " determinantes de la demanda agregada, ya habíamos visto dos de ellos, el consumo y la inversión,",
        "start": 55.559999999999995,
        "end": 60.44
    },
    {
        "text": " y hoy vamos a ver los otros tres, con eso tener un primer cierre de la demanda agregada y por lo tanto",
        "start": 60.44,
        "end": 66.47999999999999
    },
    {
        "text": " una aproximación al modelo de oferti de manda y cómo es que funciona. ¿Qué? Eso es lo que vamos a",
        "start": 66.47999999999999,
        "end": 72.08
    },
    {
        "text": " procurarle que he dado hoy, si nos da el tiempo capaz que arrancamos con algo del mercado de dinero,",
        "start": 72.08,
        "end": 76.47999999999999
    },
    {
        "text": " por lo menos para presentarlo. Bueno, estas dos variables ya habíamos visto, vamos a arrancar",
        "start": 76.48,
        "end": 82.60000000000001
    },
    {
        "text": " con la variable gasto público, con lo que habíamos ya señalado que iba a ser el recorrido para todos",
        "start": 82.60000000000001,
        "end": 88.80000000000001
    },
    {
        "text": " los componentes del PBI, definirlo a gente económico, cuánto pesa si varía mucho entre países,",
        "start": 88.80000000000001,
        "end": 95.04
    },
    {
        "text": " si varía mucho en el tiempo y cuáles son los factores determinantes. Bien, gasto público,",
        "start": 95.04,
        "end": 102.36
    },
    {
        "text": " ¿quién es el agente económico que está acá atrás? Govier, ¿sí? ¿Aquién le llamamos",
        "start": 102.36,
        "end": 108.0
    },
    {
        "text": " gasto público? Vamos a ponerlo por acá, es la demanda de bienes y servicios que realiza el",
        "start": 108.0,
        "end": 119.24
    },
    {
        "text": " gobierno y para qué demanda bienes y servicios del gobierno. ¿Para qué parte de los bienes",
        "start": 119.24,
        "end": 125.03999999999999
    },
    {
        "text": " producidos en Uruguay los demanda del Estado? Para producir otros, sí que es lo que produce el",
        "start": 125.04,
        "end": 138.6
    },
    {
        "text": " Estado. ¿Qué servicios? Salud, carreteras, ¿sí? Para todo eso es que demanda una parte de los",
        "start": 138.6,
        "end": 150.04000000000002
    },
    {
        "text": " bienes y servicios. O sea que estamos hablando del Estado, estamos hablando una parte de esos bienes",
        "start": 150.04,
        "end": 155.0
    },
    {
        "text": " y servicios producidos por todas las empresas, a la oferta agredada que ya habíamos definido,",
        "start": 155.0,
        "end": 159.39999999999998
    },
    {
        "text": " que son demandados por el Estado con algunos objetivos de política pública. ¿Cuánto pesa esto?",
        "start": 159.39999999999998,
        "end": 165.39999999999998
    },
    {
        "text": " ¿Cuánto ha pesado esto en el PBI? Estos números que poníamos por acá.",
        "start": 165.39999999999998,
        "end": 170.0
    },
    {
        "text": " 16 por ciento. Estos muchos, estos poco, depende de los países, hay países donde el Estado",
        "start": 170.0,
        "end": 183.84
    },
    {
        "text": " interviene más, hay otros países donde el Estado interviene menos. Este número bueno, si",
        "start": 183.84,
        "end": 188.68
    },
    {
        "text": " tenemos que ubicarlo en algunos rangos y estaría entre 10 y 30 por decir algo, dependiendo",
        "start": 188.68,
        "end": 194.84
    },
    {
        "text": " los países que veamos, ¿sí? Varía mucho a lo largo de los años, un año 16 al otro",
        "start": 194.84,
        "end": 203.0
    },
    {
        "text": " 30, al otro vuelve a 10 y depende de lo que hay ahí adentro y lo que hay adentro decimos que son",
        "start": 203.0,
        "end": 207.84
    },
    {
        "text": " servicios públicos, parte de la política pública y no parece razonable que un año se dan",
        "start": 207.84,
        "end": 213.2
    },
    {
        "text": " muchísimos servicios y otros menos. Por lo tanto, esta es una variable que no tiene grandes",
        "start": 213.2,
        "end": 218.4
    },
    {
        "text": " variaciones entre los años. Bien, vamos a los factores determinantes y antes de entrar en los",
        "start": 218.4,
        "end": 225.14000000000001
    },
    {
        "text": " factores determinantes, vamos a hacer alguna precisión sobre esta variada, ¿por qué cuando uno se",
        "start": 225.14000000000001,
        "end": 230.48000000000002
    },
    {
        "text": " mete con el gasto, con la demanda que le llamamos con la letra G, gasto del Estado, aparece la variable",
        "start": 230.48000000000002,
        "end": 238.44
    },
    {
        "text": " del gasto presupuestal. Y el gasto presupuestal, lo vamos a presentarlo en modo de definición, con una de las",
        "start": 238.44,
        "end": 263.0
    },
    {
        "text": " tantas categorías que se pueden hacer, que es una clasificación que básicamente es agrupa en el destino",
        "start": 263.0,
        "end": 272.08
    },
    {
        "text": " de eso que gasta el Estado. Entonces, por un lado, vamos a tener lo que se denomina el gasto en",
        "start": 272.08,
        "end": 277.24
    },
    {
        "text": " consumo del Estado, que lo diferenciamos del gasto en inversión y básicamente la diferencia entre",
        "start": 277.24,
        "end": 285.84
    },
    {
        "text": " estas dos categorías es que una se asocia más a algo que se gasta y el servicio o el bien está",
        "start": 285.84,
        "end": 292.76
    },
    {
        "text": " vinculado un año, un periodo un año, mientras que la parte de inversión está asociada un gasto que",
        "start": 292.76,
        "end": 297.2
    },
    {
        "text": " implica considerar más de un año, en caso de la carretera que decía la compañera. ¿Dónde vamos a",
        "start": 297.2,
        "end": 302.28
    },
    {
        "text": " clasificar los gastos que hace el Estado, la cerogaciones, lo que sale del bolsillo del Estado para",
        "start": 302.28,
        "end": 308.28
    },
    {
        "text": " pagar obras de infraestructura? Es un gasto de inversión. La construcción de un liceo, gasto de",
        "start": 308.28,
        "end": 313.5
    },
    {
        "text": " inversión. ¿Sí? Gastos en consumo, ¿cuál es el principio? ¿En qué gasta más el Estado?",
        "start": 313.5,
        "end": 320.9
    },
    {
        "text": " Si tenemos que ordenar los gastos del Estado, decimos el Estado en donde se le va la mayor parte de la",
        "start": 320.9,
        "end": 326.98
    },
    {
        "text": " plata es en qué? En los sueldos, en los aéreos públicos, no, acabamos a poner entonces obras como",
        "start": 326.98,
        "end": 334.9
    },
    {
        "text": " decíamos y acabamos a poner sueldos de funcionarios públicos, ¿Sí? Uno de los primeros gastos que",
        "start": 334.9,
        "end": 346.29999999999995
    },
    {
        "text": " tiene el Estado es en funcionarios públicos, ¿por qué les paga estos funcionarios? ¿Por qué les paga un",
        "start": 346.29999999999995,
        "end": 354.12
    },
    {
        "text": " sueldos? Porque le brindan un servicio que es lo que está queriendo en el Estado con eso,",
        "start": 354.12,
        "end": 360.41999999999996
    },
    {
        "text": " entonces lo que estamos considerando acá dentro es la demanda de un servicio que hace el Estado,",
        "start": 360.42,
        "end": 365.82
    },
    {
        "text": " que es a un funcionario público para que atiendan determinado ministerio o lo que sea. ¿Bien?",
        "start": 365.82,
        "end": 371.58000000000004
    },
    {
        "text": " Pero también tenemos materiales, también tenemos los insumos ahí adentro. Entonces la primera",
        "start": 371.58000000000004,
        "end": 378.66
    },
    {
        "text": " diferencia que tenemos entre gastos del Estado en consumo, inversiones, una parte más asociado,",
        "start": 378.66,
        "end": 386.82
    },
    {
        "text": " algo menos de un año, otra parte asociada algo más de un año. Y después hay dos gastos más",
        "start": 386.82,
        "end": 391.74
    },
    {
        "text": " importantes del Estado que uno está vinculado a lo que le podemos llamar las transferencias.",
        "start": 391.74,
        "end": 397.06
    },
    {
        "text": " Y acá por ejemplo, ponemos las jubilaciones o todos los planes de subsidios,",
        "start": 400.02,
        "end": 409.06
    },
    {
        "text": " ¿qué cuál es la diferencia con el jubilado? ¿Por qué al funcionario público decimos que es un",
        "start": 409.06,
        "end": 418.72
    },
    {
        "text": " gasto en consumo y el jubilado no es un gasto en consumo? Lo ponemos en una transferencia.",
        "start": 418.72,
        "end": 423.62
    },
    {
        "text": " Hoy, por lo menos hoy, recuerden que esto que estamos viendo tratando de medir son gastos con",
        "start": 425.62,
        "end": 430.22
    },
    {
        "text": " una referencia un año, estamos siendo al componente del PDI, el PDI lo medimos en un año, entonces en",
        "start": 430.22,
        "end": 436.18
    },
    {
        "text": " un año este funcionario público está brindando un servicio, que es lo que le está contratando el",
        "start": 436.18,
        "end": 442.14
    },
    {
        "text": " Estado y por eso le paga el sueldo. Ahora este jubilado en ese año que le brindó al Estado,",
        "start": 442.14,
        "end": 447.18
    },
    {
        "text": " nada, si le brindó aportes en un pasado, pero como este año no hay una demanda de un bien",
        "start": 447.18,
        "end": 453.74
    },
    {
        "text": " y servicio, estas jubilaciones entonces no tienen nada a cambio, y por eso se le ofacifica",
        "start": 453.74,
        "end": 459.18
    },
    {
        "text": " dentro de algo llamado transferencias. ¿Y qué pasa con los subsidios? Subsidios ha determinado",
        "start": 459.18,
        "end": 464.66
    },
    {
        "text": " grupo de la población, por ejemplo, o subsidios a la producción a empresarios para llevar adelante",
        "start": 464.66,
        "end": 469.82000000000005
    },
    {
        "text": " determinadas producciones. ¿Qué hace el Estado ahí? Les da fondos y está comprando algo a cambio,",
        "start": 469.82000000000005,
        "end": 476.66
    },
    {
        "text": " están dando un servicio a algo? No, es una transferencia también, sin nada a cambio. Por eso,",
        "start": 476.66,
        "end": 483.74
    },
    {
        "text": " cuando uno habla del gasto de la demanda, vamos a llamarle así, a ver si podemos aclararlo.",
        "start": 483.74,
        "end": 490.18
    },
    {
        "text": " Cuando uno habla del gasto de la demanda agregada, esto sí es considerado porque tiene algo a cambio,",
        "start": 491.18,
        "end": 499.06
    },
    {
        "text": " ese servicio, esto sí también es considerado parte de la demanda agregada, pero esto no lo vamos a",
        "start": 499.06,
        "end": 505.54
    },
    {
        "text": " considerar. ¿Qué quiero decir con esto? Que el día de mañana cuando agaremos y llegamos bueno,",
        "start": 505.54,
        "end": 510.74
    },
    {
        "text": " el Estado, una política donde paves más jubilaciones o donde autor que más subsidios,",
        "start": 510.74,
        "end": 516.5
    },
    {
        "text": " va a estar aumentando esta variable acá? No, este 16% está compuesto también con el mismo",
        "start": 516.5,
        "end": 524.86
    },
    {
        "text": " periodo que hablamos, en el 2018-2004, por estas cifras. Dentro de los gastos, estos de la demanda",
        "start": 524.86,
        "end": 536.22
    },
    {
        "text": " agregada, de este 16% que hablábamos, 13% es gasto en consumo en toda esa parte que hablábamos,",
        "start": 536.22,
        "end": 544.38
    },
    {
        "text": " de salarios, materiales, insumos que se vencen en un año y 3% está vinculado en versión.",
        "start": 544.38,
        "end": 550.5
    },
    {
        "text": " Las transferencias no forman parte de este número, pero sí forman parte del bolsillo que el",
        "start": 552.3,
        "end": 558.22
    },
    {
        "text": " Estado tiene que pagar todo el año. Por eso acá diferenciamos. Sí? El gasto de la demanda que",
        "start": 558.22,
        "end": 567.5
    },
    {
        "text": " hace el que nosotros estamos analizando acá, son solo estos dos, viene de consumo, inversión.",
        "start": 567.5,
        "end": 574.42
    },
    {
        "text": " Transferencias, nos va a servir para hablar otras cuestiones en términos de macroeconomía o globalidad",
        "start": 575.9,
        "end": 581.66
    },
    {
        "text": " una economía, pero no es parte de esto de alta. Una precisión muy detalle, pero que hace",
        "start": 581.66,
        "end": 589.98
    },
    {
        "text": " a no evitar errores cuando hablemos después de analizar una política que aumenta o disminuye el",
        "start": 589.98,
        "end": 596.14
    },
    {
        "text": " gasto. No va a pasar por acá porque esto no nos afecta a la demanda agregada. ¿Qué pasa cuando el",
        "start": 596.14,
        "end": 601.9
    },
    {
        "text": " Estado le paga la jubilación a estas personas? ¿Qué hacen las personas con esa jubilación?",
        "start": 601.9,
        "end": 608.54
    },
    {
        "text": " Consumbre y eso donde lo vamos a tener, la variable consumbre, ¿sí? Lo que hay ahí es el Estado,",
        "start": 610.9399999999999,
        "end": 619.78
    },
    {
        "text": " le paga una jubilación, eso no hay una demanda de ningún bien y servicio, pero que el jubilado,",
        "start": 619.78,
        "end": 625.1
    },
    {
        "text": " cuando con esa jubilación gastes compre algo, lo vamos a tener acá en el ingreso de los hogares,",
        "start": 625.1,
        "end": 630.26
    },
    {
        "text": " parte van a ser de jubilado. ¿Qué pasa con el pago de salarios? ¿Qué va a ser el trabajador con",
        "start": 630.26,
        "end": 638.34
    },
    {
        "text": " ese salario? Le manda bien, ¿dónde vamos a tener la demanda y bien es que hace en donde",
        "start": 638.34,
        "end": 643.46
    },
    {
        "text": " gasta el sueldo? Acá, pero acá que vamos a tener el servicio que brindó esa persona,",
        "start": 643.46,
        "end": 652.14
    },
    {
        "text": " ese funcionario público. Por eso acá sí bien, vamos a considerar dos veces, hay dos bien esis",
        "start": 652.14,
        "end": 658.26
    },
    {
        "text": " servicios, los alimentos que demandó el funcionario público y el servicio que le brindó el funcionario",
        "start": 658.26,
        "end": 666.3
    },
    {
        "text": " público al Estado, bien, pero son dos demandas distintos, con el jubilado tenemos una sola que la",
        "start": 666.3,
        "end": 673.14
    },
    {
        "text": " demanda de bien. Y hay un cuarto tipo de gastos que también salen del bolsillo del Estado,",
        "start": 673.14,
        "end": 680.54
    },
    {
        "text": " que son los intereses de deuda. ¿Qué pasa con los intereses de deuda? ¿Por qué el Estado hoy",
        "start": 680.54,
        "end": 690.92
    },
    {
        "text": " pongamos el ledos 2017, tiene que pagarle intereses a un grupo de la población? ¿Por qué esas",
        "start": 690.92,
        "end": 700.78
    },
    {
        "text": " personas le compraron deuda al Estado? En algún momento esas personas fueron y le dijeron el Estado,",
        "start": 700.78,
        "end": 706.76
    },
    {
        "text": " quería vender un papelito que prometía devolución y prometía intereses y esas personas le dieron la",
        "start": 706.76,
        "end": 713.14
    },
    {
        "text": " plata, le dijeron, bueno, te lo compro, el Estado recibió 100. Ahora este año que tiene que hacer el",
        "start": 713.14,
        "end": 718.4
    },
    {
        "text": " Estado y pagar el 3% de intereses, entonces ese 3% va a salir de acá, de las cuentas, de gasto",
        "start": 718.4,
        "end": 726.76
    },
    {
        "text": " presupuestal, ¿sí? Ahora, ¿qué pasa con ese 3%? ¿Está comprando, está demandando un bien",
        "start": 726.76,
        "end": 733.6
    },
    {
        "text": " y servicio ahí atrás de ese 3%? No, esa algo por una deuda que se colocó en algún momento,",
        "start": 733.6,
        "end": 739.32
    },
    {
        "text": " por lo tanto esto tampoco es parte de la demanda agregada, ¿sí? Entonces la demanda agregada,",
        "start": 739.32,
        "end": 749.6
    },
    {
        "text": " la que nosotros tenemos como componente del PBI y que vamos a analizar de acá en adelante,",
        "start": 749.6,
        "end": 754.9200000000001
    },
    {
        "text": " se diferencia de esto otro que es la visión presupuestal. Hoy por hoy en el Parlamento que se",
        "start": 754.9200000000001,
        "end": 760.4
    },
    {
        "text": " está discutiendo, ¿cómo ajustar esto? ¿cómo ajustar los gastos del Estado en las cuatro",
        "start": 760.4,
        "end": 768.24
    },
    {
        "text": " categorías? Que algunas de ellas impliquen después efectos sobre el PBI, efectos directos en el",
        "start": 768.24,
        "end": 775.36
    },
    {
        "text": " cálculo del PBI, barbaros, pero ahora se está discutiendo todo esto porque son los gastos del",
        "start": 775.36,
        "end": 779.88
    },
    {
        "text": " Estado. Por eso acá tenemos como una doble visión, visión del PBI de la demanda agregada y visión",
        "start": 779.88,
        "end": 786.3199999999999
    },
    {
        "text": " del PBI de la demanda agregada y visión de los gastos del Estado, con algunos rubros que están en los dos casos,",
        "start": 786.32,
        "end": 791.12
    },
    {
        "text": " pero otros que no, otros que son solo parte de las cuentas del Estado. Bien, queda claras idea.",
        "start": 791.12,
        "end": 797.9200000000001
    },
    {
        "text": " Cuando uno mira a las cuentas del Estado, mira a los gastos, pero también que debería de mirar.",
        "start": 801.0400000000001,
        "end": 806.5600000000001
    },
    {
        "text": " Los ingresos, ¿no?",
        "start": 806.56,
        "end": 811.56
    },
    {
        "text": " ¿Ve dónde se ha caplado el Estado para pagar estas cosas?",
        "start": 817.0,
        "end": 820.04
    },
    {
        "text": " De los impuestos, vamos a llamarle con la letra T a la recaudación de impuestos y de que",
        "start": 821.8399999999999,
        "end": 829.68
    },
    {
        "text": " otro lado? Caso de Uruguay, servicios, en realidad, ganancias de las empresas públicas.",
        "start": 829.68,
        "end": 836.4399999999999
    },
    {
        "text": " Sí, no es toda la venta, sino que es la ganancia que le quedó ante él después de haber dado",
        "start": 836.4399999999999,
        "end": 841.9599999999999
    },
    {
        "text": " recibido, no? Cobrado toda la factura ante él después de descontado los costos que le",
        "start": 841.9599999999999,
        "end": 846.3599999999999
    },
    {
        "text": " implicó, si le quedó un saldo, eso lo puede volcar para pagar estas transferencias, por decir algo.",
        "start": 846.3599999999999,
        "end": 852.3599999999999
    },
    {
        "text": " Entonces, vamos a llamarle ingresos operativos y estos son empresas públicas. ¿Cuál pesa más de estos?",
        "start": 853.36,
        "end": 865.44
    },
    {
        "text": " Los impuestos, ¿eh? De 90% para arriba, aunque depende también de cada año, si justo ese año en",
        "start": 866.44,
        "end": 874.32
    },
    {
        "text": " captur o no, ganancia, cianté, liúte, tuvieron, ¿sí? Vamos a hablar un poco de los impuestos,",
        "start": 874.32,
        "end": 885.1600000000001
    },
    {
        "text": " que también se pueden clasificar. Tenemos un tipo de impuestos que denominamos directos y otros",
        "start": 887.36,
        "end": 899.5600000000001
    },
    {
        "text": " indirectos. Directos tenemos el nombre y apellido para cobrarles, ¿qué tipo de impuestos son?",
        "start": 900.0799999999999,
        "end": 909.2399999999999
    },
    {
        "text": " Que van con nombre y apellido? Sí, pero esos son acá, ¿no? Esos no son impuestos, sino que son",
        "start": 909.2399999999999,
        "end": 920.7199999999999
    },
    {
        "text": " ingresos operativos. El IVA va con nombre y el repéfe, ¿no? Y el repéfe, ¿por qué?",
        "start": 920.7199999999999,
        "end": 929.0
    },
    {
        "text": " Es ese cobrado de impuestos, ¿a qué es ese impuesto? A las personas y personas que tienen",
        "start": 929.0,
        "end": 936.4
    },
    {
        "text": " determinado ingreso, ¿no? Entonces, acá uno de los impuestos directos podemos decir que son",
        "start": 936.4,
        "end": 941.88
    },
    {
        "text": " a las personas, ¿sí? Y ahí tenemos el IRPF y si es a una empresa, nombre apellido, pero de la",
        "start": 941.88,
        "end": 953.88
    },
    {
        "text": " empresa a las personas porque tienen determinados ingresos, ¿no? Tuvosuel, los rentas, lo que",
        "start": 953.88,
        "end": 960.08
    },
    {
        "text": " sea ingreso. Y en base a eso se calcula tantos impuestos, fulan o etal. Ahora, si hacemos eso mismo,",
        "start": 960.08,
        "end": 967.28
    },
    {
        "text": " pero sobre una empresa, es a las ganancias. Y ahí ya no es el IRPF, es un nombre, sí,",
        "start": 967.28,
        "end": 972.84
    },
    {
        "text": " lo que ha sido parecido, pero es a una empresa. O sea, son impuestos a los ingresos, ¿sí?",
        "start": 972.84,
        "end": 984.4
    },
    {
        "text": " Se identifica tal empresa, tal persona, por quiso de claración jurada que tienen determinados",
        "start": 986.0,
        "end": 993.12
    },
    {
        "text": " montos de ingreso, ahí se le aplica una tasa de impuestos y el Estado recaud. Fulanito de tal,",
        "start": 993.12,
        "end": 998.72
    },
    {
        "text": " sea persona, buena empresa, para impuestos. Pero después hay otro que no es a los ingresos,",
        "start": 998.72,
        "end": 1004.76
    },
    {
        "text": " sino que es a la propiedad. También tenemos identificado y por eso se llama en impuestos directos,",
        "start": 1004.76,
        "end": 1012.48
    },
    {
        "text": " pero es a la propiedad. No es por haber tenido determinados ingresos, sino es porque soy dueño de",
        "start": 1012.48,
        "end": 1019.84
    },
    {
        "text": " algo. ¿Y si hay ingresos? El ira es en que decíamos, no les quería tirar nombres, pero es el de las",
        "start": 1019.84,
        "end": 1025.96
    },
    {
        "text": " empresas, ¿no? Y a la propiedad, ¿qué impuestos se cobran a la propiedad de Uruguay?",
        "start": 1025.96,
        "end": 1035.24
    },
    {
        "text": " Primaria, ¿y por qué? Primaria por qué se cobra. ¿Por qué quien tenga un prédio, no?",
        "start": 1040.04,
        "end": 1049.28
    },
    {
        "text": " Rural o no rural. Uruguano también, ¿no? ¿Qué más? Por tener un prédio, por tener una casa que se paga,",
        "start": 1049.28,
        "end": 1059.16
    },
    {
        "text": " la contribución inmobiliaria. Hay un impuesto por ahí también que se llama el patrimonio,",
        "start": 1059.16,
        "end": 1065.48
    },
    {
        "text": " si bien no todos lo, hay que llegar a un montón mínimo que está bastante alto, pero es un impuesto",
        "start": 1065.48,
        "end": 1070.32
    },
    {
        "text": " también, Fulanito de tal, porque tiene tal bien, ¿sí? La patente podríamos poner acá también,",
        "start": 1070.32,
        "end": 1077.84
    },
    {
        "text": " es un impuesto por la propiedad, ¿no? Y, aunque ahí podríamos decir no tanto por la propiedad,",
        "start": 1077.84,
        "end": 1081.9199999999998
    },
    {
        "text": " sino por la circulación, ¿peré? Porque Fulanito tiene un auto, ¿y ¿eh? Y después tenemos los impuestos",
        "start": 1081.9199999999998,
        "end": 1088.6799999999998
    },
    {
        "text": " indirectos, ¿qué cuales son los que se cobran y no se pide cédula para cobrarse? El iba,",
        "start": 1088.6799999999998,
        "end": 1095.6
    },
    {
        "text": " acá parece entonces los impuestos como el iba a la compra venta, ¿no?",
        "start": 1095.6,
        "end": 1102.28
    },
    {
        "text": " Me viene si servicios y si son nacionales los ponemos acá y si son importados hablamos de un arancel.",
        "start": 1106.84,
        "end": 1114.24
    },
    {
        "text": " También, ¿por qué se viene? Entre a Uruguay y va a pagar un impuesto y el estado ahí lo cobra. El iba,",
        "start": 1117.24,
        "end": 1125.32
    },
    {
        "text": " bueno, no importa, Fulanito de tal, pero al hacer ese gasto, esa compra o esa venta del bien,",
        "start": 1125.32,
        "end": 1134.2
    },
    {
        "text": " hay que pagar el impuesto. Unos dependen de las personas, por eso se le llaman directos,",
        "start": 1134.2,
        "end": 1141.2
    },
    {
        "text": " otros de las ventas que se hagan determinados bien, ¿pueden ser nacionales o importados? O sea,",
        "start": 1141.2,
        "end": 1150.28
    },
    {
        "text": " la recaudación del estado viene por esta vía de distintos tipos de impuestos en Uruguay,",
        "start": 1150.28,
        "end": 1155.92
    },
    {
        "text": " ¿cual pesamos de todos estos? El iba, ¿por qué es el más fácil de cobrar?",
        "start": 1155.92,
        "end": 1167.08
    },
    {
        "text": " Sí, estos otros hay que montar los directos, si bien hay toda una cuestión de equidad que",
        "start": 1167.08,
        "end": 1172.6399999999999
    },
    {
        "text": " uno pueda hacer análisis, ¿no? De la contribución, si es más o menos equitativo, así los impuestos",
        "start": 1172.6399999999999,
        "end": 1179.76
    },
    {
        "text": " se concentran en los directos, son los indirectos, la facilidad de esa no se discute y es que",
        "start": 1179.76,
        "end": 1184.68
    },
    {
        "text": " los indirectos es más fácil de cobrar, se le dice a la empresa, cuando vendas bien,",
        "start": 1184.68,
        "end": 1188.64
    },
    {
        "text": " tiene que una parte de el impuesto cobrar lo que te lo compró, no le tome es dato de quién es ni nada,",
        "start": 1188.64,
        "end": 1195.16
    },
    {
        "text": " pero volcázos impuestos, ¿sí? Entonces, los indirectos son, a los gastos, compran ventas",
        "start": 1195.16,
        "end": 1206.16
    },
    {
        "text": " de bienes nacionales y a los gastos de bienes importados, a ranceles le llamamos cuando es un",
        "start": 1206.16,
        "end": 1211.5600000000002
    },
    {
        "text": " impuesto a que él viene entre el país, ahí pueden entrar también en tasas a baneras por decir",
        "start": 1211.5600000000002,
        "end": 1219.44
    },
    {
        "text": " alguno de los tantos tipos de esos impuestos que hoy se cobran en el ruelo. Bien, entonces en Uruguay",
        "start": 1219.44,
        "end": 1227.5600000000002
    },
    {
        "text": " hoy pesan más los indirectos, son que he ido cambiando a lo largo de estos últimos años con",
        "start": 1227.5600000000002,
        "end": 1231.48
    },
    {
        "text": " la introducción del IRPF, los directos han aumentado un poco supes. Pero bueno, esto de vuelta,",
        "start": 1231.48,
        "end": 1238.0
    },
    {
        "text": " seguimos con la lógica de la mirada presupuestal, seguimos con el paréntesis que nos alejamos de",
        "start": 1238.0,
        "end": 1245.6
    },
    {
        "text": " esto, que era ver cuáles son los factores determinantes para los gastos de la demanda, pero vale la pena,",
        "start": 1245.6,
        "end": 1250.8
    },
    {
        "text": " ya que hablamos de los gastos y hablamos de los ingresos, hablar de las dos cosas juntas,",
        "start": 1250.8,
        "end": 1255.72
    },
    {
        "text": " y cuando uno hace la cuenta de esta, de ingresos menos egresos en el estado o gasto,",
        "start": 1256.52,
        "end": 1265.56
    },
    {
        "text": " vamos a irla con la misma ingresos presupuestales, menos gastos presupuestales,",
        "start": 1265.56,
        "end": 1272.04
    },
    {
        "text": " o sea, la cuenta la hacemos sobre todo lo que tiene que pagar el estado, esto vamos a decir que",
        "start": 1276.52,
        "end": 1283.4
    },
    {
        "text": " podemos tener tres resultados posibles, cero, positivo y negativo. Vamos con el primero. Si el",
        "start": 1283.4,
        "end": 1297.92
    },
    {
        "text": " estado hizo sus cuentas y logró recaudar todo esto al cabo de un año, que depende muchas",
        "start": 1297.92,
        "end": 1304.72
    },
    {
        "text": " decisiones, depende de cuánta gente trabajó y cuántos aportaron de las declaraciones juradas,",
        "start": 1304.72,
        "end": 1310.3600000000001
    },
    {
        "text": " de las ventas que se hicieron de bienes, de los que se importaron, bueno, esto al final de un",
        "start": 1310.36,
        "end": 1315.1999999999998
    },
    {
        "text": " año llega un montón y es esto, y al final de un año son gastos que el estado había decidido hacer,",
        "start": 1315.1999999999998,
        "end": 1322.36
    },
    {
        "text": " capaz que algunos no se hacen, puede pasar que repente una obra, el estado decidió hacerla y al final",
        "start": 1322.36,
        "end": 1328.6
    },
    {
        "text": " no le pudo hacer, entonces no gastó todo lo previsto, pero pongamos las decisiones que se",
        "start": 1328.6,
        "end": 1334.6799999999998
    },
    {
        "text": " toman a principio año, pero que la efectividad o el valor real de eso, real no por cantidad de",
        "start": 1334.68,
        "end": 1341.3600000000001
    },
    {
        "text": " bienes sino por montos, se conoce a fin de año, entonces al fin de año que puede pasar y que sea",
        "start": 1341.3600000000001,
        "end": 1347.3600000000001
    },
    {
        "text": " cero exacto, y a esto se le denomina equilibrio fiscal. Va a aparecer la palabra fiscal porque atrás",
        "start": 1347.3600000000001,
        "end": 1357.0
    },
    {
        "text": " de estas cuentas del estado aparece como el Fiscal, como el Ministerio de Hacienda, el Ministerio",
        "start": 1357.0,
        "end": 1363.1200000000001
    },
    {
        "text": " de Economía, que se elge hace las veces de contador o de llevarle las cuentas al estado,",
        "start": 1363.12,
        "end": 1368.9199999999998
    },
    {
        "text": " entonces si esto da cero equilibrio fiscal, si esto da positivo o que quiere decir,",
        "start": 1368.9199999999998,
        "end": 1376.12
    },
    {
        "text": " que tuvo más ingresos que lo que gastó le sobró plata, vamos a llamarle a esto,",
        "start": 1382.28,
        "end": 1388.08
    },
    {
        "text": " superávit fiscal, y si da negativo le vamos a llamar de Fiscal, bien, por ejemplo,",
        "start": 1388.08,
        "end": 1409.8799999999999
    },
    {
        "text": " pongamos y mentemos unos números, si tuvo ingresos por 100 y tuvo gastos por 117, esto",
        "start": 1409.88,
        "end": 1421.3600000000001
    },
    {
        "text": " da cava vale, este déficit fiscal vale 17, ¿no? Los gastos superaron a los ingresos en 17,",
        "start": 1421.3600000000001,
        "end": 1433.88
    },
    {
        "text": " el estado quería contratar funcionarios públicos por determinada cantidad, cero horas pagar,",
        "start": 1434.8400000000001,
        "end": 1440.88
    },
    {
        "text": " papá, tiene que gastar 117, pero tiene 100, ¿qué hace? Le dice a un funcionario público,",
        "start": 1440.88,
        "end": 1449.3600000000001
    },
    {
        "text": " para esperar el mes que viene que me faltaron 17, entonces ahí lo que vamos a tener que ver es,",
        "start": 1449.3600000000001,
        "end": 1457.0400000000002
    },
    {
        "text": " el estado tiene que pagar estos 17, al funcionario público, a la empresa, eso les tiene que pagar",
        "start": 1457.0400000000002,
        "end": 1462.5200000000002
    },
    {
        "text": " la jubilidad, la tiene que pagar, entonces lo que vamos a hablar es que este déficit se financia,",
        "start": 1462.52,
        "end": 1468.68
    },
    {
        "text": " tiene que buscar financiamiento, y este financiamiento el estado tiene tres fuentes de financiamiento,",
        "start": 1470.92,
        "end": 1481.12
    },
    {
        "text": " tiene tres formas para financiar un les, ¿sí? Podríamos hablar de una especie de cuarta forma que",
        "start": 1481.12,
        "end": 1490.44
    },
    {
        "text": " es bajar el gasto, ¿no? Porque si el problema es que hay menos ingresos que gastos, una manera",
        "start": 1491.4,
        "end": 1498.2
    },
    {
        "text": " podría ser bajar los gastos, pero no hablemos ahí de financiamiento, sino que eso sería más",
        "start": 1498.2,
        "end": 1503.16
    },
    {
        "text": " una justa para evitar el déficit, vamos a sumir que tenemos el déficit y que no se pueden bajar",
        "start": 1503.16,
        "end": 1508.4
    },
    {
        "text": " los gastos, ¿qué sí se puede buscar a aumentar los ingresos, como dijo el compañero, vía más",
        "start": 1508.4,
        "end": 1514.64
    },
    {
        "text": " impuesto, entonces si el estado vía que está llegando fin de año y que no tiene esto y bueno,",
        "start": 1514.64,
        "end": 1521.68
    },
    {
        "text": " podría buscar la manera de aumentar los impuestos y supongamos que consigue cuatro más,",
        "start": 1521.68,
        "end": 1528.0
    },
    {
        "text": " sube, el IRPF, sube un poquito la franja, los montos, las tasas que se le aplican a cada franja,",
        "start": 1529.4,
        "end": 1536.3200000000002
    },
    {
        "text": " puede subir esto de la tasa consular, como pasó hace poco, si hay unos escuchos, podría tocar el",
        "start": 1536.3200000000002,
        "end": 1542.96
    },
    {
        "text": " lío o inventar un impuesto nuevo también, ¿sí? Entonces una fuente de financiamiento cobró más",
        "start": 1542.96,
        "end": 1552.92
    },
    {
        "text": " impuestos, pero todavía me están faltando 13, podríamos tarifas públicas vía más ingresos,",
        "start": 1552.92,
        "end": 1564.6000000000001
    },
    {
        "text": " pero pongamos el que como la parte está presupuestarla, asociamos más al principal impuesto ingreso,",
        "start": 1564.6000000000001,
        "end": 1570.64
    },
    {
        "text": " lo que es este, dejemos el loco, pero es muy válido lo que dice el compañero, consiguamos más por acá,",
        "start": 1570.64,
        "end": 1575.68
    },
    {
        "text": " porque lo que estamos diciendo es subir esto, bueno, pero hoy podríamos subir esto también, ¿sí?",
        "start": 1575.68,
        "end": 1580.44
    },
    {
        "text": " Pero esa no se considera como una de las tres fuentes de financiamiento, aunque podría cerrar",
        "start": 1580.44,
        "end": 1586.16
    },
    {
        "text": " las cuentas igual que lo de la reducción del gasto. ¿Qué pasa en una familia, si nos pasa esto,",
        "start": 1586.16,
        "end": 1592.88
    },
    {
        "text": " que tenemos ingresos por 7 y tuvimos que estar 117, ¿cómo hacemos? Impuesto no le podemos",
        "start": 1592.88,
        "end": 1598.0
    },
    {
        "text": " jugar a nadie. En deudarnos, ¿sí? Una familia y bueno, pide un préstamo o mete tarjetazo a algo,",
        "start": 1598.0,
        "end": 1606.64
    },
    {
        "text": " el estado, no es la tarjeta corporativa acá, ¿no? El tarjetazo va a majarlo afuera, pero sí,",
        "start": 1606.64,
        "end": 1613.44
    },
    {
        "text": " ¿cómo se pueden deudar? ¿Cómo se endeud al estado? No va a un banco a pedir préstado,",
        "start": 1613.44,
        "end": 1617.84
    },
    {
        "text": " bueno, en realidad puede ir al banco mundial, al bid, fondomonetario y pedir préstamo, pero vamos",
        "start": 1617.84,
        "end": 1625.12
    },
    {
        "text": " a ponerlo más ingenierico como más deuda. Y una de las que vamos a asociar acá para",
        "start": 1625.12,
        "end": 1633.0
    },
    {
        "text": " vincular al mercado financiero, pongámosle que es a través de bonos. El papelito que decíamos",
        "start": 1633.0,
        "end": 1639.04
    },
    {
        "text": " hoy es que había emitido y que después va a tener que pagar intereses. Bueno, es lo mismo",
        "start": 1639.04,
        "end": 1644.6799999999998
    },
    {
        "text": " acá que hace poco Uruguay emitió una nueva, unos nuevos títulos de deuda. Entonces,",
        "start": 1644.6799999999998,
        "end": 1650.04
    },
    {
        "text": " agar al estado dice, bueno, me faltan 17, cuatro los consigo por acá, pongamosle que",
        "start": 1650.04,
        "end": 1655.26
    },
    {
        "text": " puede conseguir 8 por acá. ¿Qué hace? Emite deuda, por 8 dice, comprenmesto, papelito,",
        "start": 1655.26,
        "end": 1663.24
    },
    {
        "text": " por un montón total de 8, que les voy a pagar un interés. ¿Sí? Entonces, ¿qué hace",
        "start": 1663.24,
        "end": 1669.2
    },
    {
        "text": " los que quieren les interesa ese activo financiero? Esto no es un bien, ¿no? Esto era parte",
        "start": 1669.2,
        "end": 1674.6399999999999
    },
    {
        "text": " de los activos financieros, otro mercado, pero para el mercado bien ese servicio como",
        "start": 1674.64,
        "end": 1679.72
    },
    {
        "text": " les sirve y porque el estado va a recibir 8, porque le compraron ese papelito y tienen",
        "start": 1679.72,
        "end": 1684.24
    },
    {
        "text": " los 8 para pagar esas obras, para pagar las jubilaciones funcionarios públicas. ¿Bien?",
        "start": 1684.24,
        "end": 1689.3600000000001
    },
    {
        "text": " ¿Qué va a pasar el año que viene? Cuando volvamos a hacer esta cuenta el año que viene.",
        "start": 1689.3600000000001,
        "end": 1696.64
    },
    {
        "text": " Esto de acá dijimos que vale 100, 117 y esto que vale 100, ¿qué va a pasar con esto",
        "start": 1696.64,
        "end": 1705.3200000000002
    },
    {
        "text": " 117 el año que viene? Y si estamos aumentando acá, va a ser más grande, o sea, hoy no sirve,",
        "start": 1705.3200000000002,
        "end": 1712.8400000000001
    },
    {
        "text": " lo que estamos buscando acá es financiar este 17, que bueno, nos tocó el año que viene,",
        "start": 1712.8400000000001,
        "end": 1717.68
    },
    {
        "text": " capaz que ajustamos por otro lado, ¿sí? Pero es cierto, esos que genera problemas a futuro,",
        "start": 1717.68,
        "end": 1724.24
    },
    {
        "text": " que podemos decir acá tiene el inconveniente de que nos incrementa los intereses. Estamos",
        "start": 1724.24,
        "end": 1732.28
    },
    {
        "text": " más en deudado y esto de acá, ¿qué pasa si cobra más impuestos? Vayamos a lo que ya",
        "start": 1732.28,
        "end": 1740.6
    },
    {
        "text": " habíamos visto, aquí en afecta a los hogares y los hogares, ¿y le cobran más impuestos?",
        "start": 1740.6,
        "end": 1747.52
    },
    {
        "text": " Consumen menos y si consumen menos y vengo acá a las cuentas esta que lo que nos está",
        "start": 1747.52,
        "end": 1752.52
    },
    {
        "text": " preocupando ahora, nos afecta a en algo que la gente consuma menos, que haga menos",
        "start": 1752.52,
        "end": 1759.48
    },
    {
        "text": " compras de bienes y servicios. ¿Qué pasa con estos impuestos? ¿Qué dijimos que",
        "start": 1759.48,
        "end": 1767.48
    },
    {
        "text": " eran los más importantes? Vana, bajar, porque si la gente compra menos, ¿qué pasa con",
        "start": 1767.48,
        "end": 1776.6
    },
    {
        "text": " el IVA que se dispara con esas menores compras? ¿Y va a ser menor? Entonces el año que viene",
        "start": 1776.6,
        "end": 1782.0
    },
    {
        "text": " que va a pasar con esta impuesta, con esta recaduación, ¿y va a ser menor? Entonces también",
        "start": 1782.0,
        "end": 1787.32
    },
    {
        "text": " esto, a través de que nos reduce el consumo va a reducir los ingresos de la población,",
        "start": 1787.32,
        "end": 1795.1599999999999
    },
    {
        "text": " ¿no? Y por lo tanto va a bajar la recaduación, por la parte de los impuestos indirectes.",
        "start": 1795.1599999999999,
        "end": 1803.36
    },
    {
        "text": " Oja lo así más directo. Por la parte de los impuestos indirectos va a bajar la recaduación.",
        "start": 1803.36,
        "end": 1815.4399999999998
    },
    {
        "text": " Entonces esto nos incrementa el gasto, esto nos baja los ingresos. Hoy nos sirven las dos para",
        "start": 1815.4399999999998,
        "end": 1826.24
    },
    {
        "text": " financiar el déficit, pero mañana las dos me están complicando. ¿Sí? Y nos queda una",
        "start": 1826.24,
        "end": 1834.0
    },
    {
        "text": " tercera forma que tiene el gobierno de financiar. Necesitaba a 17, cuatro cobromas impuestos,",
        "start": 1834.0,
        "end": 1841.56
    },
    {
        "text": " le dijo a la EJI, salía a recaburar más, ocho emitió de edad y consiguió. ¿Qué pasa con",
        "start": 1841.56,
        "end": 1847.48
    },
    {
        "text": " los otros cinco que le falta conseguir? Como no tiene otra forma va a barrar y va a decir bueno,",
        "start": 1847.48,
        "end": 1858.28
    },
    {
        "text": " pero tenemos la impresora de los billetes. Entonces imprimirme cinco, si estos son millones de",
        "start": 1858.28,
        "end": 1870.28
    },
    {
        "text": " pesos, imprimirme cinco millones de pesos y listo. Y ahí tenemos los 17 y podemos cubrir todos",
        "start": 1870.28,
        "end": 1881.48
    },
    {
        "text": " los pagos que el Estado se comprometió. Estas dos primeras tenían problemas, esta tercera",
        "start": 1881.48,
        "end": 1889.16
    },
    {
        "text": " y esta tercera vamos a ver que genera ciertos problemas también. ¿Puedes estar vinculado a la",
        "start": 1889.16,
        "end": 1897.3999999999999
    },
    {
        "text": " evaluación de la moneda o no? Porque de evaluación de la moneda es un concepto que todavía no vimos,",
        "start": 1897.4,
        "end": 1902.2800000000002
    },
    {
        "text": " entonces prefiero hoy no plasmarlos si esto no genera eso o no. Lo que sí genera es que si hay más",
        "start": 1902.2800000000002,
        "end": 1908.76
    },
    {
        "text": " dinero la gente que podríamos pensar que va a pasar, que los gaste y si los gasta y demanda más va a",
        "start": 1908.76,
        "end": 1916.2800000000002
    },
    {
        "text": " generar inflación. Entonces también esto no va a ser algo conveniente, entonces el gobierno para",
        "start": 1916.2800000000002,
        "end": 1927.2800000000002
    },
    {
        "text": " financiar su déficit puede recurrir a tres tipos de fuentes diferentes para financiarlo, una",
        "start": 1927.28,
        "end": 1934.72
    },
    {
        "text": " vez que ya tenemos el dato que es déficit, pero esas fuentes tienen todas problemas. Lo pueden",
        "start": 1934.72,
        "end": 1943.6399999999999
    },
    {
        "text": " hoy con las herramientas que tenemos el razonamiento es si hay más dinero la gente dice pa, pero hay más",
        "start": 1943.6399999999999,
        "end": 1950.68
    },
    {
        "text": " villetes circulando, vamos a dar tal y si los gasta demanda más y si demanda más bien es",
        "start": 1950.68,
        "end": 1957.28
    },
    {
        "text": " por el juego de dos fartiller manda, lleva que suban los precios, ¿sí? Vamos a ver que es parte del",
        "start": 1957.28,
        "end": 1965.44
    },
    {
        "text": " de uno de los tópicos que íbamos a analizar las causas de la inflación y ahí va a aparecer esta",
        "start": 1965.44,
        "end": 1970.68
    },
    {
        "text": " de la emisión de ganar. Bueno, entonces volvemos a acá. ¿De qué depende esta variable gasta del",
        "start": 1970.68,
        "end": 1991.04
    },
    {
        "text": " gobierno? Que es una parte de todos, pero que en el razonamiento del factor determinante lo podemos",
        "start": 1991.04,
        "end": 1995.78
    },
    {
        "text": " pensar como cualquiera de ellos. ¿De qué depende que el gobierno decida contratar más funcionarios",
        "start": 1995.78,
        "end": 2001.96
    },
    {
        "text": " públicos, hacer más obras? ¿De qué depende? De los ingresos de la población, de la tasa de",
        "start": 2001.96,
        "end": 2010.54
    },
    {
        "text": " interés, de los precios, ¿dónde se define esto? El parlamento y el parlamento que va a decir",
        "start": 2010.54,
        "end": 2022.0
    },
    {
        "text": " de la cantidad de funcionarios públicos en función de la inflación que hubo más bien va a",
        "start": 2022.0,
        "end": 2027.76
    },
    {
        "text": " tomar decisiones de qué quiere brindar, qué servicios brindar, por lo tanto esta variable a",
        "start": 2027.76,
        "end": 2033.16
    },
    {
        "text": " diferencia de las demás que hemos visto hasta ahora vamos a decir que no depende de ninguna variable",
        "start": 2033.16,
        "end": 2041.36
    },
    {
        "text": " macroconómica, sino que es una variable de política económica. Entonces la pensamos más en",
        "start": 2041.36,
        "end": 2049.62
    },
    {
        "text": " términos exógenos, es una decisión de política, no va a depender del tipo de cambio de la tasa",
        "start": 2049.62,
        "end": 2056.7599999999998
    },
    {
        "text": " de interés, de los precios, ni de los impuestos a depender, porque si el gobierno tiene déficit",
        "start": 2056.7599999999998,
        "end": 2063.24
    },
    {
        "text": " lo financio, ¿sí? Si una cosa que podemos analizar es esto que habíamos puesto acá, que si nos",
        "start": 2063.24,
        "end": 2076.7999999999997
    },
    {
        "text": " va a decir que los impuestos son una función de los ingresos de la población, porque con estos",
        "start": 2076.7999999999997,
        "end": 2084.9599999999996
    },
    {
        "text": " ingresos la población consume, ¿no? Entonces esto es una relación positivo. Cuando",
        "start": 2084.9599999999996,
        "end": 2093.12
    },
    {
        "text": " los hogares tengan más ingresos van a consumir más, eso ya lo habíamos visto, ¿no? Ahora cuando",
        "start": 2093.12,
        "end": 2099.2799999999997
    },
    {
        "text": " consumen más el IVA se dispara más todavía, entonces recauda más, esa es la relación que reflejamos",
        "start": 2099.2799999999997,
        "end": 2106.3199999999997
    },
    {
        "text": " acá. Una economía crece parte de ese crecimiento se va a reflejar en más consumo, el gobierno va a",
        "start": 2106.3199999999997,
        "end": 2114.48
    },
    {
        "text": " ver que sus cuentas, sus ingresos van a aumentar. Una economía que cae en transcritis menos ingresos",
        "start": 2114.48,
        "end": 2123.04
    },
    {
        "text": " los hogares, menos van a consumir, y si menos consumen el estado a su vez se va a dar más",
        "start": 2123.04,
        "end": 2129.64
    },
    {
        "text": " restringido con los ingresos que va a poder cobrar, porque el IVA en particular va a recaudarme bien,",
        "start": 2129.64,
        "end": 2135.12
    },
    {
        "text": " pero bueno, los impuestos no vienen acá, vienen al razonamiento pero no directamente acá en la",
        "start": 2135.12,
        "end": 2141.36
    },
    {
        "text": " demana. Entonces esto acá lo resumimos como una variable exógeno, ¿sí?",
        "start": 2141.36,
        "end": 2149.6800000000003
    },
    {
        "text": " En algún caso esta variable gasto se decía que era función del año electoral, no lo vamos a",
        "start": 2159.92,
        "end": 2167.52
    },
    {
        "text": " representar de esta manera, pero si ponemos los años electorales, ¿qué les parece que se",
        "start": 2167.52,
        "end": 2172.16
    },
    {
        "text": " gasto su cero es más alto o más bajo? En los primeros años de gobierno o en los últimos años,",
        "start": 2172.16,
        "end": 2177.36
    },
    {
        "text": " opongámoslo más estricto todavía, el primer año de gobierno en comparación con el quinto,",
        "start": 2177.36,
        "end": 2183.2
    },
    {
        "text": " en donde se gasta más, el primer año donde que llega llega o el último que no sabe si va a",
        "start": 2184.72,
        "end": 2195.52
    },
    {
        "text": " seguir o no. Hay un tema de ciclo electoral y cuestiones de poder que en la historia se ha mostrado",
        "start": 2195.52,
        "end": 2204.28
    },
    {
        "text": " que el gasto del gobierno aumenta, la variable gasto del gobierno aumenta en los últimos años",
        "start": 2204.28,
        "end": 2210.44
    },
    {
        "text": " de gobierno, los últimos años del prédio al periodo electoral. Ahora esa no es una variable",
        "start": 2210.44,
        "end": 2216.4
    },
    {
        "text": " macroeconómica, será una cuestión de ciencia política, ¿sí? Entonces acá, bueno, no tenemos",
        "start": 2216.4,
        "end": 2222.64
    },
    {
        "text": " como no pusimos función, no ponemos punto supercivo, pero hay cosas también, más allá de esto",
        "start": 2222.64,
        "end": 2227.52
    },
    {
        "text": " acá o capaz que está implícito en el sur cero, que es una decisión política, que sea más alta",
        "start": 2227.52,
        "end": 2233.0
    },
    {
        "text": " un año o más alta otra, bien? Pero bueno, lo dejamos por ahí, hay una duda de lo que hemos visto",
        "start": 2233.0,
        "end": 2241.56
    },
    {
        "text": " de la demanda en el caso del gobierno, vamos a la siguiente entonces.",
        "start": 2241.56,
        "end": 2251.0
    },
    {
        "text": " Vamos a analizar las exportaciones.",
        "start": 2271.56,
        "end": 2281.68
    },
    {
        "text": " Exportación, definición, agente económico, quién era el agente económico que estaba",
        "start": 2301.56,
        "end": 2318.68
    },
    {
        "text": " detrás, cómo definimos las exportaciones. Bienes y servicios producidos en donde? En Uruguay",
        "start": 2318.68,
        "end": 2332.3999999999996
    },
    {
        "text": " que son demandados por quién, por el resto del mundo, esa es la definición de la exportación,",
        "start": 2332.3999999999996,
        "end": 2337.96
    },
    {
        "text": " ¿sí? O sea, van a aparecer empresas uruguayas produciendo, empresas produciendo en Uruguay, mejor dicho,",
        "start": 2337.96,
        "end": 2344.8399999999997
    },
    {
        "text": " y agentes económicos de otros países, al resto del mundo, demandando esos bienes y servicios.",
        "start": 2344.84,
        "end": 2350.4
    },
    {
        "text": " ¿Cuánto pesa esto en el PBI de Uruguay 34 por cierto? En el mismo periodo que estamos tomando",
        "start": 2351.4,
        "end": 2361.28
    },
    {
        "text": " como referentes? Este porcentaje es mucho muy alto, muy bajo en la comparación internacional,",
        "start": 2361.28,
        "end": 2368.56
    },
    {
        "text": " depende de los países, hay países que son más abiertos, sí, países que son más cerrados,",
        "start": 2368.56,
        "end": 2374.7999999999997
    },
    {
        "text": " panama por ejemplo, es muy abierto, pues muy cerrado, muy abierto, entonces este número debería",
        "start": 2374.7999999999997,
        "end": 2383.84
    },
    {
        "text": " pesar más, Cuba, más cerrado, bloqueo, no, Cuba, bloqueo, este número es mucho más bajo,",
        "start": 2383.84,
        "end": 2393.16
    },
    {
        "text": " ¿Y ¿Y ¿Y? ¿Cuánto varía entre los años, ya la comparación entre países para",
        "start": 2393.7599999999998,
        "end": 2400.12
    },
    {
        "text": " darnos una idea, ya la hicimos? ¿Cuánto varía entre años? Y bueno Uruguay, un año capaz que",
        "start": 2400.12,
        "end": 2406.72
    },
    {
        "text": " pesaba 34, otro el otro 38, otro el otro 32, pero anda por ahí, salvo catástrofes, que se nos",
        "start": 2406.72,
        "end": 2414.2799999999997
    },
    {
        "text": " cierran mercados, ¿no? Tema de la hostosa, por ejemplo, en su momento, y bueno ahí las",
        "start": 2414.2799999999997,
        "end": 2419.3199999999997
    },
    {
        "text": " exportaciones, que ayer o más tan, o se nos abren mercados y bueno ahí las exportaciones van",
        "start": 2419.32,
        "end": 2424.1600000000003
    },
    {
        "text": " a aumentar, entonces depende también de otras variables de que esos números peguen un salto,",
        "start": 2424.1600000000003,
        "end": 2429.4
    },
    {
        "text": " o sea, ¿qué quiero decir con esto? Esta variable, este número tiene más flutuaciones que este",
        "start": 2429.4,
        "end": 2434.96
    },
    {
        "text": " otro, si este depende de factores externos, este más de decisiones internas, entonces los números",
        "start": 2434.96,
        "end": 2443.28
    },
    {
        "text": " tienen diferente flutuación, ¿Y qué es lo que es por Uruguay? Si tenemos que hacer un top",
        "start": 2443.28,
        "end": 2448.86
    },
    {
        "text": " five de productos, de bienes y servicios Uruguay. Carles, Soja, cuero, no tanto, históricamente sí.",
        "start": 2448.86,
        "end": 2460.52
    },
    {
        "text": " Tema de papeleras, hay una cuestión de cómo se registra, ¿no? Le hubieron con Mateo,",
        "start": 2463.28,
        "end": 2467.88
    },
    {
        "text": " si son franca o no, pero bueno aparece por ahí lo mismo la madera, si lo metemos todo en un",
        "start": 2467.88,
        "end": 2473.44
    },
    {
        "text": " bloque, capaz que aparece por ahí arriba, ¿qué va? Lácteos, arroz y todos bienes,",
        "start": 2473.44,
        "end": 2485.88
    },
    {
        "text": " internos, no están en el top five, en el top ten, tampoco, ¿no? Y el turismo es el principal",
        "start": 2488.52,
        "end": 2495.1600000000003
    },
    {
        "text": " servicio y uno de los principales de las principales exportaciones del país, ¿sí?",
        "start": 2495.16,
        "end": 2500.08
    },
    {
        "text": " Entonces para ver los factores determinantes vamos a poner un ejemplo, vamos a usar la carne que es",
        "start": 2502.08,
        "end": 2506.56
    },
    {
        "text": " uno de los principales históricamente de Uruguay. Vamos a suponer que lo que queremos ver es la",
        "start": 2506.56,
        "end": 2515.12
    },
    {
        "text": " exportación de una colita de cuadril, que vamos a ponerle, tiene un precio de 300 pesos",
        "start": 2515.12,
        "end": 2528.08
    },
    {
        "text": " el kilo de la colita de cuadril. En Uruguay, ¿no? Esto es Uruguay, produce este bien, colita de",
        "start": 2528.08,
        "end": 2536.7599999999998
    },
    {
        "text": " cuadril 300 pesos. Ahora, ¿quién era que comprado a la colita de cuadril? Resto del mundo,",
        "start": 2536.76,
        "end": 2549.2000000000003
    },
    {
        "text": " o sea, alemán, la alemán ya van a estar mirando, paba, mirada 300 pesos de la colita de cuadril,",
        "start": 2549.2000000000003,
        "end": 2555.8
    },
    {
        "text": " empezó la miden, no, en una moneda extranjera, vamos a ponerle que se al dola, entonces ¿cómo",
        "start": 2555.8,
        "end": 2562.6800000000003
    },
    {
        "text": " llevamos esto? A expresar el precio de Uruguay, pero en dólares, estos empezos, ¿cómo nos",
        "start": 2562.68,
        "end": 2571.7599999999998
    },
    {
        "text": " expresamos en dólares, estos 300 pesos la colita de cuadril? Yo quiero saber dólares por",
        "start": 2571.7599999999998,
        "end": 2580.16
    },
    {
        "text": " un kilo. ¿Qué cuenta tengo que hacer? La tasa de conversión, ¿a eso le vamos a llamar",
        "start": 2580.16,
        "end": 2592.64
    },
    {
        "text": " con la letra y tipo de cambio, vamos a ponerle 30 pesos por dólar hoy en Uruguay, ¿sí? Entonces,",
        "start": 2592.64,
        "end": 2603.8399999999997
    },
    {
        "text": " tengo el precio en Uruguay de la colita de cuadril, tengo el tipo de cambio y cómo llevo eso al",
        "start": 2603.84,
        "end": 2610.88
    },
    {
        "text": " precio de dólares? Al precio sobre el tipo de cambio, ¿no? Entonces, me queda 10 dólares, ¿sí?",
        "start": 2610.88,
        "end": 2627.32
    },
    {
        "text": " Ahí aparecen algunas variables que ya nos van a estar mostrando, que cambios en ellas van a estar",
        "start": 2627.32,
        "end": 2640.32
    },
    {
        "text": " afectando las exportaciones, por ejemplo, si suben los precios en Uruguay, ¿qué podemos decir que",
        "start": 2640.32,
        "end": 2651.36
    },
    {
        "text": " ocurran con las exportaciones? Si está variable en vez de ser 300 pesos, pasa a ser 450 pesos,",
        "start": 2651.36,
        "end": 2660.0
    },
    {
        "text": " se encarece la colita de cuadril en Uruguay por cualquier motivo, clima, salario, lo que sea.",
        "start": 2661.3,
        "end": 2668.84
    },
    {
        "text": " El tipo de cambio sigue siendo 30 pesos por dólar, ¿a cuánto se nos va a esto? 15 dólares, ¿no?",
        "start": 2668.84,
        "end": 2684.2000000000003
    },
    {
        "text": " ¿Y qué pasa entonces? En Alemania qué van a estar? Nos van a demandar menos toneladas de carne,",
        "start": 2685.7200000000003,
        "end": 2693.36
    },
    {
        "text": " recuerden que hablamos de variables en términos reales, ¿por qué nos van a comprar menos toneladas de",
        "start": 2694.08,
        "end": 2699.1200000000003
    },
    {
        "text": " carne? Porque acá, inclicitamente, nos está faltando comparar con un ágil, esto acá se compara con",
        "start": 2699.1200000000003,
        "end": 2709.6800000000003
    },
    {
        "text": " la carne que se produce también expresada en dólares, pongamos eléque, sea 12 dólares por",
        "start": 2709.6800000000003,
        "end": 2716.84
    },
    {
        "text": " kiló, que es la carne australiana. Alemania cuando sale a comprar carne, mira Uruguay, pero mira",
        "start": 2716.84,
        "end": 2725.92
    },
    {
        "text": " también Argentina, Australia, Estados Unidos, mira otros mercados. En su momento nos había decidido",
        "start": 2725.92,
        "end": 2731.6800000000003
    },
    {
        "text": " comprar nosotros, pongamos elé 100 toneladas de carne. Ahora si Uruguay se encarece y ahora ya",
        "start": 2731.6800000000003,
        "end": 2738.32
    },
    {
        "text": " Uruguay cuando habían decidido 100 toneladas de carne Uruguay, era con un precio de 10 dólares,",
        "start": 2738.32,
        "end": 2743.96
    },
    {
        "text": " la carne Uruguaya, ahora van a decir para, si me sale 15, la Uruguaya y la australiana sigue",
        "start": 2743.96,
        "end": 2749.96
    },
    {
        "text": " costando 12, ¿qué podemos pensar que pase con parte de esa 100 toneladas que nos demandaban a",
        "start": 2749.96,
        "end": 2755.2400000000002
    },
    {
        "text": " nosotros? Que se las compren? Australia, ¿sí? Por lo tanto, un aumento de precios nos va a llevar a",
        "start": 2755.2400000000002,
        "end": 2764.2
    },
    {
        "text": " una caída de las exportaciones, por un tema de esto, y esto básicamente es, ya lo habíamos",
        "start": 2764.2,
        "end": 2771.56
    },
    {
        "text": " adelantado la otra vez, competitividad, precio, ¿sí? Porque por más que ahí salgamos y digamos,",
        "start": 2771.56,
        "end": 2781.32
    },
    {
        "text": " no, pero nosotros tenemos la trazabilidad y puede saber de dónde vino sabaca, del churrasco,",
        "start": 2781.32,
        "end": 2785.7599999999998
    },
    {
        "text": " no sé cuánto, no van a decir sí, pero ahora sale 15 y en el otro lado 12, entonces ahora te voy",
        "start": 2785.7599999999998,
        "end": 2791.04
    },
    {
        "text": " a comprar menos Uruguay y un poco más a los demás países. Entonces dentro de este P",
        "start": 2791.04,
        "end": 2796.2799999999997
    },
    {
        "text": " asterisco nosotros tenemos dos precios, el P, que era en peso, porque es una variable Uruguay y",
        "start": 2796.28,
        "end": 2804.44
    },
    {
        "text": " P asterisco que es una variable de los demás países, entonces la variable Uruguay 300 pesos,",
        "start": 2804.44,
        "end": 2810.1200000000003
    },
    {
        "text": " o sea que compararla con los 12 dólares, ¿cómo llevamos el precio a dólares? Y en esta comparación se",
        "start": 2810.1200000000003,
        "end": 2817.36
    },
    {
        "text": " está jugando la competitividad de la producción Uruguay, competitividad, precio, cuestiones de calidad,",
        "start": 2817.36,
        "end": 2824.2000000000003
    },
    {
        "text": " la dejamos a un margen y van a estar adentro a estos puntos suspensivos, ¿mien?",
        "start": 2824.2,
        "end": 2828.8399999999997
    },
    {
        "text": " Entonces aumentan los precios, Uruguay es menos competitivo, nos van a comprar menos,",
        "start": 2830.04,
        "end": 2835.3199999999997
    },
    {
        "text": " podemos meter a cantonse la variable precios y cómo es esta relación,",
        "start": 2835.3199999999997,
        "end": 2839.72
    },
    {
        "text": " que signo al epongo, signo negativo por ser una relación invas, ¿sí?",
        "start": 2841.72,
        "end": 2848.6
    },
    {
        "text": " Ahora en este juego apareció el precio australiano, entonces también podríamos decir bueno,",
        "start": 2848.6,
        "end": 2855.44
    },
    {
        "text": " pero vamos a poner, vamos a analizar qué pasa, si en vez de que se hubieran crecido la carne Uruguay",
        "start": 2855.44,
        "end": 2861.48
    },
    {
        "text": " que se hubieran crecido la carne australiana, entonces ahora cambiamos el ejemplo,",
        "start": 2861.48,
        "end": 2867.4
    },
    {
        "text": " volvemos a los datos originales y tenemos que lo que cambia es que la carne australiana ahora",
        "start": 2867.4,
        "end": 2877.08
    },
    {
        "text": " suépresio, bien, entonces desde Alemania cuando antes habían decidido, siento en el lado de comprar",
        "start": 2879.08,
        "end": 2887.44
    },
    {
        "text": " Uruguay y tantas a Estados Unidos, tanto australes, etcétera, etcétera, ahora les cambió un dato",
        "start": 2887.44,
        "end": 2893.96
    },
    {
        "text": " cuando habían hecho el análisis que es que ya no es 12 dólares sino que 14 dólares, entonces qué",
        "start": 2893.96,
        "end": 2899.88
    },
    {
        "text": " podemos esperar que ocurra, que que hagan estos marcados internacionales, el caso de Alemania que",
        "start": 2899.88,
        "end": 2906.0
    },
    {
        "text": " sale a comprar carne, que nos compre más a nosotros porque nos abaratamos en términos relativos",
        "start": 2906.0,
        "end": 2913.56
    },
    {
        "text": " porque los competidores nuestros están encareciendo, entonces un mayor precio de la carne de nuestros",
        "start": 2913.56,
        "end": 2921.0
    },
    {
        "text": " competidores y adentro de este asterizco en realidad estoy haciendo como una selección,",
        "start": 2921.0,
        "end": 2926.12
    },
    {
        "text": " estoy poniendo solo los países que compiten contra Uruguay porque esto lo tengo que comparar,",
        "start": 2926.12,
        "end": 2932.12
    },
    {
        "text": " no me importa si acá dentro está el petróleo, no voy a comparar contra lo que pase con el",
        "start": 2932.92,
        "end": 2938.52
    },
    {
        "text": " petróleo, estoy tengo que comparar contra quienes producen bienes parecidos Uruguay, por eso ahí hay",
        "start": 2938.52,
        "end": 2944.0
    },
    {
        "text": " una cuestión de cómo usamos o cómo se estima en esos indicadores, pero nosotros con esta",
        "start": 2944.0,
        "end": 2949.3199999999997
    },
    {
        "text": " visión global y por tener pocas clases metemos ahí adentro todo y no nos complicamos y lo que decimos",
        "start": 2949.3199999999997,
        "end": 2955.48
    },
    {
        "text": " es, otros países se encaricen y estos otros países son los del asterizco, son competidores",
        "start": 2956.44,
        "end": 2961.72
    },
    {
        "text": " Uruguay y bueno si se encaricen y compiten con nosotros en los mercados nosotros ganamos en",
        "start": 2961.72,
        "end": 2966.88
    },
    {
        "text": " competitividad y por lo tanto aumentan nuestras exportaciones, aparece acá la variable precio de",
        "start": 2966.88,
        "end": 2975.44
    },
    {
        "text": " nuestros competidores y el signo positivo, son más caros, se joden ellos, ganamos nosotros en",
        "start": 2975.44,
        "end": 2983.76
    },
    {
        "text": " competitividad, bien, esta comparación que estamos haciendo acá, estamos haciendo esto,",
        "start": 2983.76,
        "end": 2999.0400000000004
    },
    {
        "text": " estamos comparando, el petásterizco contra peso sobre él, el petásterizco dijimos que en",
        "start": 2999.04,
        "end": 3013.2799999999997
    },
    {
        "text": " qué moneda estaba expresado, en dólar y esta acá esto es pesos y esto es pesos por dólar,",
        "start": 3013.2799999999997,
        "end": 3024.68
    },
    {
        "text": " o sea que todo esto en dólar, uno puede hacer un cociente entonces entre estos dos, entre el",
        "start": 3024.68,
        "end": 3032.7999999999997
    },
    {
        "text": " petásterizco y el peso sobre él, en el numerador que estamos poniendo entonces, el precio de la",
        "start": 3032.8,
        "end": 3041.5600000000004
    },
    {
        "text": " competencia y abajo, el precio uruguay, ¿sí? y si yo hago esto, ¿qué estoy haciendo ahora? Abajo que me",
        "start": 3041.5600000000004,
        "end": 3057.84
    },
    {
        "text": " queda el precio de uruguay, en pesos y acá arriba, estos son dólares y esto es pesos por dólar,",
        "start": 3062.8,
        "end": 3074.2000000000003
    },
    {
        "text": " o sea que acá arriba que me queda, pesos y que tengo acá arriba entonces, el precio de la",
        "start": 3074.2000000000003,
        "end": 3083.88
    },
    {
        "text": " competencia, de los demás países y abajo el precio uruguay, o sea en cualquiera de los casos,",
        "start": 3083.88,
        "end": 3089.2000000000003
    },
    {
        "text": " estoy comparando, precio en nuestros competidores, ¿no? acá pongo precio de los competidores de uruguay,",
        "start": 3089.2,
        "end": 3099.52
    },
    {
        "text": " competidores de uruguay y acá pongo el precio de la producción uruguaya, ¿sí?",
        "start": 3101.52,
        "end": 3111.52
    },
    {
        "text": " en nuestro primer ejemplo, ¿qué es lo que pasó? subió esto, nos bajó todo esto, no, subió todo esto,",
        "start": 3111.52,
        "end": 3124.7599999999998
    },
    {
        "text": " no, subió todo esto y por lo tanto estindicador, bajó, ¿qué era lo que habíamos dicho? Que si",
        "start": 3124.7599999999998,
        "end": 3136.24
    },
    {
        "text": " uruguay se encarece, ¿por qué nos comprar menos? Porque está subiendo esto y esto está",
        "start": 3136.24,
        "end": 3145.3199999999997
    },
    {
        "text": " quedando igual, ¿no? Porque decimos que perdemos exportaciones, porque somos menos competitivos,",
        "start": 3145.3199999999997,
        "end": 3155.72
    },
    {
        "text": " porque nos encarecimos en comparación con ellos, ¿sí? Lo puedo ver acá, dólar contra dólar o",
        "start": 3155.72,
        "end": 3162.52
    },
    {
        "text": " lo podía ver acá directamente, ¿no? Que esto aumentó, esto quedó igual y por lo tanto bajo,",
        "start": 3162.52,
        "end": 3167.4
    },
    {
        "text": " eso fue nuestro primer caso ¿verdad? El segundo caso, ¿qué lo que ocurrió, subió este de acá?",
        "start": 3167.4,
        "end": 3176.28
    },
    {
        "text": " subió este de acá, está subiendo esto y esto está quedando igual y entonces esto suben,",
        "start": 3176.28,
        "end": 3183.64
    },
    {
        "text": " en el segundo caso por qué decimos que uruguay va a exportar más cuando suben precio en nuestros",
        "start": 3183.64,
        "end": 3189.72
    },
    {
        "text": " competidores, porque los competidores se encarecen, es lo que ponemos en el numerador,",
        "start": 3189.72,
        "end": 3195.56
    },
    {
        "text": " nosotros seguimos con el mismo nivel de precios y por lo tanto ganamos competitividad, esto de acá",
        "start": 3195.56,
        "end": 3202.4399999999996
    },
    {
        "text": " se le llama el tipo de cambio real y es un indicador de la competitividad precios,",
        "start": 3202.44,
        "end": 3224.84
    },
    {
        "text": " no nos olvidemos que esto no está midiendo que un país sea de mejor calidad, lo que produce,",
        "start": 3224.84,
        "end": 3231.44
    },
    {
        "text": " lo que sea más eficiente, estamos hablando de precio y lo que decimos es el que se encarece va a",
        "start": 3231.44,
        "end": 3239.2000000000003
    },
    {
        "text": " perder porción del mercado, el que se abarata siempre es una comparación, ¿no? Por eso a veces decimos",
        "start": 3239.2000000000003,
        "end": 3245.7200000000003
    },
    {
        "text": " se encarece relativamente o en términos relativos, o se abarata en términos relativos, va ganar",
        "start": 3245.7200000000003,
        "end": 3251.08
    },
    {
        "text": " mercado. Tipo de cambio real entonces definido a través de estas comparaciones que con el juego",
        "start": 3251.08,
        "end": 3258.44
    },
    {
        "text": " que habíamos hecho de los números también llegábamos, es un indicador entonces de la",
        "start": 3258.44,
        "end": 3263.88
    },
    {
        "text": " competitividad y exclusivamente precio, ¿sí? Esta variable entonces ya vimos que es una variable",
        "start": 3263.88,
        "end": 3281.4
    },
    {
        "text": " determinante de las exportaciones, esta también es una variable determinante de las exportaciones,",
        "start": 3281.4,
        "end": 3287.1600000000003
    },
    {
        "text": " ¿qué otra variable determinante de las exportaciones tenemos ahí? El tipo de cambio,",
        "start": 3288.76,
        "end": 3294.6800000000003
    },
    {
        "text": " vamos a volver a los números originales,",
        "start": 3294.68,
        "end": 3305.7999999999997
    },
    {
        "text": " y vamos a ver qué pasa si subes el tipo de cambio, vamos a dar lo primero en términos así conceptuales",
        "start": 3305.8,
        "end": 3333.6800000000003
    },
    {
        "text": " en esta comparación y después lo hacemos lo mismo con los números, ¿qué pasa si subes el",
        "start": 3333.68,
        "end": 3339.72
    },
    {
        "text": " tipo de cambio? Vallamos primero con esta comparación que era precios en dólares contra precios en",
        "start": 3339.72,
        "end": 3345.8399999999997
    },
    {
        "text": " dólares, si subes acá ahí, ¿qué le pasa a todo esto? Al precio en dólares de los productos",
        "start": 3345.8399999999997,
        "end": 3354.48
    },
    {
        "text": " uruguayos, ¿se va a baratar? ¿qué pasa entonces con el precio de los productos uruguayos? ¿se",
        "start": 3354.48,
        "end": 3360.7599999999998
    },
    {
        "text": " va a baratar? ¿qué pasó con lo del precio en dólares de los competidores? ¿sí",
        "start": 3360.76,
        "end": 3364.76
    },
    {
        "text": " o igual? ¿qué pasó entonces con la competitividad? ¿aumentó? Y si somos más competitivos porque",
        "start": 3364.76,
        "end": 3373.0400000000004
    },
    {
        "text": " salimos, somos más baratos en dólares, ¿qué va a pasar con las export? van a aumentar,",
        "start": 3373.0400000000004,
        "end": 3379.5600000000004
    },
    {
        "text": " acá la comparación en peso sería lo mismo ¿no? Que es lo que ocurre cuando suba el tipo de cambio,",
        "start": 3379.5600000000004,
        "end": 3386.28
    },
    {
        "text": " el precio en peso de los productos, aumentar, entonces se encarcen, ganamos competitividad, ¿sí?",
        "start": 3387.2400000000002,
        "end": 3396.84
    },
    {
        "text": " En el ejemplo, ¿qué pasa 100 veces de 30? Ahora es 45 pesos por dólar el tipo de cambio,",
        "start": 3399.84,
        "end": 3409.7200000000003
    },
    {
        "text": " suba el tipo de cambio en uruguayos, ¿qué va a pasar con estos 300 pesos que costaba la",
        "start": 3409.7200000000003,
        "end": 3415.52
    },
    {
        "text": " ponita de cuadril cuando los expresamos en dólares? Divido 300 pesos, dividido 45 pesos por dólar",
        "start": 3415.52,
        "end": 3425.8
    },
    {
        "text": " y me quedan cuántos dólares por kilo, 7,5, ¿no? Y si uruguay sale más barato, la carne uruguaya,",
        "start": 3425.8,
        "end": 3437.24
    },
    {
        "text": " 6 con 6, ¿qué pasa con las exportaciones, con la cantidad de toneladas de carne uruguay",
        "start": 3437.24,
        "end": 3450.7599999999998
    },
    {
        "text": " que va a vender uruguay? Y van a aumentar porque la comparación no era lo mismo 10 contradoces,",
        "start": 3450.7599999999998,
        "end": 3456.56
    },
    {
        "text": " que nos determinaba una cantidad a comparar un 6,6, que somos más baratos aún contradoces,",
        "start": 3456.56,
        "end": 3462.08
    },
    {
        "text": " entonces las exportaciones uruguay van a aumentar, ¿cuál es el motivo de la competitividad que habíamos",
        "start": 3462.64,
        "end": 3468.96
    },
    {
        "text": " dicho ya la clase anterior y que ahora lo estamos resumiendo, lo estamos haciendo pasar por este",
        "start": 3468.96,
        "end": 3474.08
    },
    {
        "text": " indicador que nos compara, precio contra precio y nos dice quién se abarató, quién se encareció.",
        "start": 3474.08,
        "end": 3479.64
    },
    {
        "text": " Entonces, relación entre el tipo de cambio y las exportaciones, positivo, un aumento del tipo",
        "start": 3480.68,
        "end": 3490.0
    },
    {
        "text": " de cambio, hace entonces, curuguay se abarate, que cuando expresamos nuestros precios en pesos a dólares,",
        "start": 3490.0,
        "end": 3496.92
    },
    {
        "text": " se abarate y eso es una señal de que nos compren más, en cantidades.",
        "start": 3496.92,
        "end": 3501.8
    },
    {
        "text": " Bien, y entonces acá tenemos las distintas variables que juegan en los precios y cuando uno va",
        "start": 3504.8,
        "end": 3512.08
    },
    {
        "text": " a comprar algo, ¿no? Vamos a ir un lado y queremos comprar algo, miramos el precio, pero qué",
        "start": 3512.08,
        "end": 3517.16
    },
    {
        "text": " otra variable es importante para saber cuánto voy a poder comprar. La calidad podría ser,",
        "start": 3517.16,
        "end": 3528.0
    },
    {
        "text": " ¿cuánto puedo gastar? ¿Cuánto tengo para comprar a esos precios con la calidad que yo me",
        "start": 3532.48,
        "end": 3537.08
    },
    {
        "text": " definí? Y esa variable nos toca y es cuánto puede gastar quién, en la Alemania que estábamos",
        "start": 3537.08,
        "end": 3544.68
    },
    {
        "text": " viendo hoy, el resto del mundo y eso lo vamos a resumir en esta variable, el ingreso del resto del",
        "start": 3544.68,
        "end": 3552.72
    },
    {
        "text": " mundo. Porque ¿quién son los que están demandando estos bienes producidos en el UI? Digimos",
        "start": 3552.72,
        "end": 3559.7999999999997
    },
    {
        "text": " que son los hogares del resto del mundo, la empresa del resto del mundo, el estado del resto del",
        "start": 3559.7999999999997,
        "end": 3564.7599999999998
    },
    {
        "text": " mundo. Fijemos la atención en los hogares del resto del mundo. Si los hogares del resto del",
        "start": 3564.7599999999998,
        "end": 3569.8399999999997
    },
    {
        "text": " mundo tienen más ingresos, van a consumir más y dentro de ese mayor consumo van a traer la carne y",
        "start": 3569.84,
        "end": 3576.6400000000003
    },
    {
        "text": " dentro de la carne va a haber una parte de carne que sale mana, producían Alemania y otra parte",
        "start": 3576.6400000000003,
        "end": 3581.56
    },
    {
        "text": " en esa carne que la van a comprar a otros países. Entonces en ese mayor ingreso, ¿no?",
        "start": 3581.56,
        "end": 3585.92
    },
    {
        "text": " Estoy pensando en estos términos. Si suponemos que aumenta el ingreso del resto del mundo, parte de",
        "start": 3585.92,
        "end": 3593.1200000000003
    },
    {
        "text": " esto, parte, no digo todo, pero parte nos va a llevar a que les vendamos más. La misma lógica que",
        "start": 3593.12,
        "end": 3603.3599999999997
    },
    {
        "text": " decíamos más ingresos, más consumo de bienes nacionales, acá pasaron mismo con bienes que",
        "start": 3603.3599999999997,
        "end": 3610.98
    },
    {
        "text": " serían importados para el caso de Alemania que estamos analizados. Ogares alemanes tienen más",
        "start": 3610.98,
        "end": 3618.2
    },
    {
        "text": " ingresos, Uruguay va a recibir va a poder, ante ese cambio, solo de esa variable va a poder",
        "start": 3618.2,
        "end": 3625.2799999999997
    },
    {
        "text": " venderle más. Sí? Después dijimos, aceptamos que hay otras cosas, calidad, relaciones entre países,",
        "start": 3625.2799999999997,
        "end": 3644.48
    },
    {
        "text": " de desacuerdos comerciales, hay Mercosur, se hay zona libre comer, acuerdos comerciales en general,",
        "start": 3644.48,
        "end": 3651.16
    },
    {
        "text": " todas esas cosas seguro influyen en las exportaciones, pero las vamos a considerar como no variables macroeconómicas",
        "start": 3651.16,
        "end": 3659.0
    },
    {
        "text": " de estas que vamos a poder relacionar y decir, ¿pa el tipo de cambio de su o el precio? Si no, lo hacemos",
        "start": 3659.0,
        "end": 3664.12
    },
    {
        "text": " más en generico eso y lo reconocemos a través de esos puntos subvencibles. Está claro?",
        "start": 3664.12,
        "end": 3670.2400000000002
    },
    {
        "text": " ¿Duda comentarios de la seksport?",
        "start": 3670.24,
        "end": 3676.08
    },
    {
        "text": " ¿Importaciones? Vamos al último de los componentes.",
        "start": 3676.08,
        "end": 3696.2
    },
    {
        "text": " ¿A gente económico y definición de las importaciones? ¿Qué era esto? Son bienes y servicios",
        "start": 3736.08,
        "end": 3754.84
    },
    {
        "text": " producidos en donde? En el resto del mundo que son demandados por quienes? Por los hogares,",
        "start": 3754.84,
        "end": 3762.04
    },
    {
        "text": " empresas y el Estado. O sea, los hogares parte de sus ingresos lo destinan a este tipo bienes,",
        "start": 3762.04,
        "end": 3769.2799999999997
    },
    {
        "text": " que es consumo de bienes nacionales y otra parte la van a destinar a estos, que son los bienes",
        "start": 3769.2799999999997,
        "end": 3773.8
    },
    {
        "text": " importados. ¿Cuánto pesa esto? ¿Cuánto pesó en el histórico de Uruguay? 40% y ahí no se",
        "start": 3773.8,
        "end": 3783.16
    },
    {
        "text": " arroveso, ¿no? Es enúmero, en muy alto, muy bajo y depende que el país sea muy abierto,",
        "start": 3783.16,
        "end": 3792.68
    },
    {
        "text": " menos abierto, cuba, es enúmero, obviamente más chico, ¿viene? ¿Cuánto haría año a año y",
        "start": 3792.68,
        "end": 3800.3599999999997
    },
    {
        "text": " tiene algunas variaciones, pero tampoco hay grandes baivenes? ¿Sí? ¿De qué depende? Las",
        "start": 3800.36,
        "end": 3812.92
    },
    {
        "text": " importaciones, al igual que las exportaciones son frutos de intercambios entre países y",
        "start": 3812.92,
        "end": 3819.76
    },
    {
        "text": " hay competidores en el mundo a la hora de comprarle a uno o a otro. Entonces vamos a ver que",
        "start": 3819.76,
        "end": 3824.4
    },
    {
        "text": " por acá pasa algo parecido a las exportaciones en cuanto a qué variables son las que juegan en",
        "start": 3824.4,
        "end": 3829.76
    },
    {
        "text": " eso, porque hay un tema de competitividad que va a estar arriba de la mesa. Para ver eso vamos a",
        "start": 3829.76,
        "end": 3835.6400000000003
    },
    {
        "text": " tomar un ejemplo y antes que me había olvidado el top five, ¿de importaciones de Uruguay?",
        "start": 3835.6400000000003,
        "end": 3841.0400000000004
    },
    {
        "text": " Petróleo, en países sí, China, ¿suno? Testiles hay algunos, igual no está tan arriba como el",
        "start": 3841.0400000000004,
        "end": 3852.0400000000004
    },
    {
        "text": " petróleo y que otra cosa, temas de tecnología, tecnología vinculados a y capital a las maquinarias,",
        "start": 3852.0400000000004,
        "end": 3859.0
    },
    {
        "text": " a los equipos, ¿sí? O sea, aquella variable K que habíamos definido a la hora de producir,",
        "start": 3859.0,
        "end": 3864.92
    },
    {
        "text": " principalmente esa variable viene del exterior, o sea que es una de las importaciones. Entonces vamos a",
        "start": 3864.92,
        "end": 3871.72
    },
    {
        "text": " ponernos como ejemplo que tenemos entonces un bien importado que los presamos en dólares",
        "start": 3871.72,
        "end": 3882.24
    },
    {
        "text": " que cuesta 10.000 dólares, a una maquinaria, una automóvil si quiere, a un auto, un auto, lo traemos",
        "start": 3882.24,
        "end": 3894.9599999999996
    },
    {
        "text": " del exterior 10.000 dólares, pero como lo traemos en Uruguay vamos a hacer el mismo ejercicio de hoy,",
        "start": 3894.9599999999996,
        "end": 3901.08
    },
    {
        "text": " vamos a expresar este pedasterisco en pesos y cómo hacemos para expresarlo en pesos.",
        "start": 3901.08,
        "end": 3907.9199999999996
    },
    {
        "text": " Lo multiplicamos el pedasterisco por él, ¿sí? Entonces vamos a poner el tipo de cambio,",
        "start": 3912.7599999999998,
        "end": 3921.0
    },
    {
        "text": " los 30 pesos por dólar que hoy hablábamos y tenemos que ir la auto en realidad cuesta 300.000",
        "start": 3921.0,
        "end": 3929.56
    },
    {
        "text": " pesos, ¿sí? El auto importado 300.000 pesos, contra aquí le vamos a comparar contra el auto",
        "start": 3929.56,
        "end": 3943.92
    },
    {
        "text": " producido en Uruguay, el P, en pesos que es producido en Uruguay y vamos a ponerle que nos cuesta",
        "start": 3943.92,
        "end": 3954.7999999999997
    },
    {
        "text": " la magindra local 350.000, 325.000 pesos. Bien, y vamos a hacer la misma lógica de ir viendo",
        "start": 3954.8,
        "end": 3970.1600000000003
    },
    {
        "text": " estas variables que están jugando en la competitividad que es lo que le pasa.",
        "start": 3970.1600000000003,
        "end": 3978.1200000000003
    },
    {
        "text": " Si suba el precio de la magindra, ¿qué va a pasar con las importaciones?",
        "start": 3978.64,
        "end": 3988.74
    },
    {
        "text": " Gautos del exterior, ¿por qué? Porque en la comparación 300, contra 325, se va a haber más",
        "start": 3988.74,
        "end": 4000.12
    },
    {
        "text": " beneficiados, estos bien es importados, entonces van a aumentar las importaciones. ¿Qué estamos",
        "start": 4000.12,
        "end": 4006.4
    },
    {
        "text": " diciendo? Que si aumenta P, en cualquiera de estos casos, que es lo que ocurra con el indicador",
        "start": 4006.4,
        "end": 4012.8
    },
    {
        "text": " de competitividad. Esto aumenta, esto queda igual, Uruguay pierde competitividad, los productos",
        "start": 4012.8,
        "end": 4021.7200000000003
    },
    {
        "text": " uruguayos que compiten con los importados son más caros, se encarece y por lo tanto al resto del",
        "start": 4021.7200000000003,
        "end": 4028.1600000000003
    },
    {
        "text": " mundo le vamos a comprar menos, vamos a comprar más bienes al resto del mundo que se están",
        "start": 4028.1600000000003,
        "end": 4033.92
    },
    {
        "text": " abaratando en términos de los bienes nacionales que se encaricieron. O sea, si este aumenta,",
        "start": 4033.92,
        "end": 4044.16
    },
    {
        "text": " esta comparación sale beneficiado, los bienes importados, acá estamos comparando bienes",
        "start": 4044.16,
        "end": 4052.42
    },
    {
        "text": " nacionales, acá estamos con los bienes importados. Y esta comparación es la que nos va a indicar más",
        "start": 4052.42,
        "end": 4067.02
    },
    {
        "text": " de uno o más de otro. Y este signo entonces acá a mayor precio, mayores importaciones, ¿sí?",
        "start": 4067.02,
        "end": 4077.7000000000003
    },
    {
        "text": " También lo habíamos adelantado la clase anterior diciendo que era justamente el efecto competitividad.",
        "start": 4077.7,
        "end": 4085.8999999999996
    },
    {
        "text": " Nos encarcemos, competitividad precio, siempre la que estamos hablando. ¿Qué pasa 100",
        "start": 4088.1,
        "end": 4093.22
    },
    {
        "text": " veces el precio de los productos nacionales es el precio de los productos importados? 100",
        "start": 4093.22,
        "end": 4102.74
    },
    {
        "text": " veces de 10 mil dólares ahora cuesta 14 mil dólares. O sea, bueno, un nuevo fácil, 15 mil dólares.",
        "start": 4102.74,
        "end": 4111.099999999999
    },
    {
        "text": " Y este acaso nos va a encarecer, ¿no? 450 mil pesos, va a salir el auto importado, contra el",
        "start": 4116.5,
        "end": 4126.0199999999995
    },
    {
        "text": " 325 de la camioneta nacional se van a comprar más nacionales menos importados. De vuelta hay un tema",
        "start": 4126.02,
        "end": 4134.46
    },
    {
        "text": " competitividad que lo podemos hacer pasar por este juego de estas variables, ¿sí? Pero en definitiva",
        "start": 4134.46,
        "end": 4142.5
    },
    {
        "text": " estamos haciendo lo mismo, comparando el precio de lo importado contra el precio de lo nacional y",
        "start": 4142.5,
        "end": 4147.740000000001
    },
    {
        "text": " si hay uno que se vio de favorecido con el otro, bueno, ese bien se va a comprarme, va a perder",
        "start": 4147.740000000001,
        "end": 4153.1
    },
    {
        "text": " marcado. Por lo tanto, sentido puesto. Para ir rotando y haciendo uno y uno, ¿qué pasa ahora si lo",
        "start": 4153.1,
        "end": 4167.46
    },
    {
        "text": " miramos por este lado con el tipo de cambio? Solo lo hacemos pasar por esto de la competitividad,",
        "start": 4167.46,
        "end": 4172.42
    },
    {
        "text": " no cambiamos los números sino solo acá. Si suba el tipo de cambio, ¿qué pasa en esta",
        "start": 4172.42,
        "end": 4182.72
    },
    {
        "text": " comparación de precio de los competidores contra el precio de la producción Uruguay?",
        "start": 4182.72,
        "end": 4186.42
    },
    {
        "text": " El tipo de cambio suba.",
        "start": 4190.18,
        "end": 4191.7
    },
    {
        "text": " Este sube, esto queda igual, esto sube, esto queda igual. Sale más caro, si en la mirada",
        "start": 4191.7,
        "end": 4207.72
    },
    {
        "text": " pesos contra pesos, sale más caro los productos del exterior, los importados puestos en Uruguay,",
        "start": 4207.72,
        "end": 4215.42
    },
    {
        "text": " sale más caros que la producción Uruguay. ¿Y entonces? La decisión de los hogares que va a",
        "start": 4215.42,
        "end": 4224.46
    },
    {
        "text": " hacer comprar más bienes importados que se están encareciendo o más bienes nacionales, más bienes",
        "start": 4224.46,
        "end": 4231.34
    },
    {
        "text": " nacionales. Entonces las importaciones van a caer. Relación inversa, ¿sí?",
        "start": 4231.34,
        "end": 4245.9400000000005
    },
    {
        "text": " Tenemos el tipo de cambio a 30 pesos por dólar, los importadores que van a pedir que pase con",
        "start": 4252.66,
        "end": 4259.62
    },
    {
        "text": " ese tipo de cambio. Ustedes son importadores, tienen son empresarios que trabajan en una importadora,",
        "start": 4259.62,
        "end": 4265.54
    },
    {
        "text": " traen cosas del exterior y las venden acá en Uruguay. ¿Qué van a querer que ocurra con el",
        "start": 4265.54,
        "end": 4269.94
    },
    {
        "text": " tipo de cambio? ¿Qué baje? ¿Por qué? ¿Si baja el tipo de cambio? ¿Qué pasa con el precio",
        "start": 4269.94,
        "end": 4282.26
    },
    {
        "text": " de los productos importados? Va a bajar, entonces ustedes como empresarios importadores van a vender más",
        "start": 4282.26,
        "end": 4290.58
    },
    {
        "text": " bienes importados y menos nacionales, ¿sí? Ahora, ¿qué pasa con los empresarios productores de carne?",
        "start": 4290.58,
        "end": 4297.22
    },
    {
        "text": " ¿Qué van a querer? ¿Qué suba el tipo de cambio? Porque cuando suba el tipo de cambio,",
        "start": 4297.22,
        "end": 4303.34
    },
    {
        "text": " que le pasa al precio en dólares de la carne uruguaya. Baja el precio en dólares, presión",
        "start": 4303.34,
        "end": 4314.32
    },
    {
        "text": " peso dividido un tipo de cambio que se llama salto al exportador le sirve que suba ese tipo de cambio",
        "start": 4314.32,
        "end": 4319.82
    },
    {
        "text": " porque le abarata la carne uruguaya puesta en dólar. Entonces el importador que el tipo de cambio",
        "start": 4319.82,
        "end": 4327.54
    },
    {
        "text": " baje, el exportador que el tipo de cambio suba, ¿no? Lo que le pasa el tipo de cambio no los va",
        "start": 4327.54,
        "end": 4334.82
    },
    {
        "text": " a dejar contentos a los dos, ¿sí? La acción de uno se beneficia por la evolución en una dirección,",
        "start": 4334.82,
        "end": 4342.06
    },
    {
        "text": " la del otro, en la otro. ¿Qué pasa a ustedes tienen depósitos en dólares o compraron algún",
        "start": 4342.06,
        "end": 4348.58
    },
    {
        "text": " bono en dólares? ¿Qué van a querer que pase con el tipo de cambio? Que suba, porque eso",
        "start": 4348.58,
        "end": 4354.3
    },
    {
        "text": " mismo le va a rendir más y si no eran depósitos y yo era que tenían una deuda que habían comprado",
        "start": 4354.3,
        "end": 4360.1
    },
    {
        "text": " las casas en dólares o el auto en dólares. ¿Qué va? Entonces de vuelta lo que pase con el",
        "start": 4360.1,
        "end": 4366.0599999999995
    },
    {
        "text": " tipo de cambio, a uno le va a matar y a otro le va a beneficiar. Entonces esta variable",
        "start": 4366.0599999999995,
        "end": 4372.46
    },
    {
        "text": " tipo de cambio es una que vamos a ver, ahora nos quedó plasmada acá en la parte del mercado de",
        "start": 4372.46,
        "end": 4377.42
    },
    {
        "text": " quienes vienen en actores que están acá atrás, que son empresarios exportadores y actores",
        "start": 4377.42,
        "end": 4382.58
    },
    {
        "text": " que están acá atrás, que son importadores y la variable va a fritar a uno en una dirección",
        "start": 4382.58,
        "end": 4388.9800000000005
    },
    {
        "text": " y a otros en otro. Después igual la parte del mercado cambiado, le vamos a trabajar en la",
        "start": 4388.9800000000005,
        "end": 4395.82
    },
    {
        "text": " próxima clase. ¿Y por analogía? ¿Qué variable de ingresos la que nos va a interesar a",
        "start": 4395.82,
        "end": 4403.62
    },
    {
        "text": " acá en las importaciones? ¿Quiénes son los que están demandando estos bienes? Los",
        "start": 4403.62,
        "end": 4411.3
    },
    {
        "text": " Uruguayos, entonces acabamos a poner los ingresos de los Uruguayos y cómo es la relación",
        "start": 4411.3,
        "end": 4417.9
    },
    {
        "text": " acá? Si los hogares tienen más ingresos, repasemos cuál era el destino que le daba en los",
        "start": 4417.9,
        "end": 4429.58
    },
    {
        "text": " hogares a los ingresos. Logarte ni ingresos y una parte pagaba impuestos, ¿verdad? Y",
        "start": 4429.58,
        "end": 4436.58
    },
    {
        "text": " a esto le llamábamos el ingreso disponible y con esto tomaba decisiones, ¿cuál era",
        "start": 4436.58,
        "end": 4442.14
    },
    {
        "text": " la decisiones que tomaba? Guardar que le llamábamos a ahorrar y consumir. En realidad esto",
        "start": 4442.14,
        "end": 4453.46
    },
    {
        "text": " nos quedó medio incompleto a los otros días porque lo que tendríamos que haber dicho es",
        "start": 4453.46,
        "end": 4457.0599999999995
    },
    {
        "text": " consumo de bienes nacionales y también consumo de bienes importados. Igual nada nos",
        "start": 4457.06,
        "end": 4464.160000000001
    },
    {
        "text": " cambia el razonamiento que hicimos la otra vez. ¿Entonces qué podemos decir que si",
        "start": 4464.160000000001,
        "end": 4469.740000000001
    },
    {
        "text": " los hogares tienen mayores ingresos? Acá teníamos aquello que le llamábamos las propensiones",
        "start": 4469.740000000001,
        "end": 4479.740000000001
    },
    {
        "text": " pero que hablábamos de 80-20, pongamos el que cambiamos esos números y que yo les digo",
        "start": 4479.740000000001,
        "end": 4486.34
    },
    {
        "text": " bueno, ¿realidad? Esto pesa 78, ¿el diario? Esto pesa 40, no, ¿por qué no era el cien",
        "start": 4486.34,
        "end": 4498.78
    },
    {
        "text": " ahí? Y esto es el total del ingreso disponible o les cambia, no es complicada. Esto nos",
        "start": 4498.78,
        "end": 4511.38
    },
    {
        "text": " quedan cien, ¿sí? Y acá tenemos, pongamos el que estos 20. Entonces un aumento del ingreso",
        "start": 4511.38,
        "end": 4523.62
    },
    {
        "text": " que podemos esperar, que esto aumenten, que se dediquen, si hay un aumento del ingreso",
        "start": 4523.62,
        "end": 4529.22
    },
    {
        "text": " disponible de cien, que esto aumenten 20. Y el otro 80, ¿cómo lo repartimos acá? ¿A qué",
        "start": 4529.22,
        "end": 4539.7
    },
    {
        "text": " voy con esto? Un mayor ingreso nos va a llevar lo que nos interesa ahora a más consumo",
        "start": 4539.7,
        "end": 4546.22
    },
    {
        "text": " y más importaciones. Tengo más plata, consumo más de todo, tengo más ahorro, consumo",
        "start": 4546.22,
        "end": 4553.82
    },
    {
        "text": " más bien nacional, es más bien es importante. ¿Sí? Que demos nos con esta resultado ahora.",
        "start": 4553.82,
        "end": 4560.74
    },
    {
        "text": " Después, ahora volvemos a esto pero dejemos lo ahí. Entonces, si aumentan los ingresos",
        "start": 4560.74,
        "end": 4567.94
    },
    {
        "text": " y nos hogar y surguayos, van a aumentar las importaciones.",
        "start": 4567.94,
        "end": 4572.54
    },
    {
        "text": " Pues la acción directa, ¿verdad?",
        "start": 4572.54,
        "end": 4578.54
    },
    {
        "text": " ¿Cómo? ¿Alguna duda? Traigo estos resultados para acá, para sigo",
        "start": 4578.54,
        "end": 4608.18
    },
    {
        "text": " ese aparte del disarrón.",
        "start": 4608.18,
        "end": 4615.18
    },
    {
        "text": " Estamos terminando.",
        "start": 4638.18,
        "end": 4645.18
    },
    {
        "text": " El capítulo 3 del material binográfico. Como les decía, hay algunas partes que a veces les",
        "start": 4668.18,
        "end": 4678.3
    },
    {
        "text": " habéis dicho que no profundizamos y por lo tanto, no son necesarias, pero en particular,",
        "start": 4678.3,
        "end": 4683.700000000001
    },
    {
        "text": " sobre este capítulo 3 va a todo y me interesa resaltar que hay un anexo, que es lo que",
        "start": 4683.700000000001,
        "end": 4688.38
    },
    {
        "text": " vamos a ver ahora, que es el anexo que ya vemos le lecturas de la cuenta corriente y que",
        "start": 4688.38,
        "end": 4701.1
    },
    {
        "text": " por más que es un anexo, es algo importante. Y una de las 15 preguntas del parcial va a referir",
        "start": 4701.1,
        "end": 4710.7
    },
    {
        "text": " a este anex, ¿sí? ¿Cómo vimos exportaciones y vimos importaciones? ¿Qué era esto? Esta diferencia.",
        "start": 4710.7,
        "end": 4725.7
    },
    {
        "text": " El saldo de la balanza comercial. Pero yo quería acá el saldo de la cuenta corriente, que",
        "start": 4725.7,
        "end": 4738.22
    },
    {
        "text": " es el saldo de la cuenta corriente. ¿Cómo se definió? El de la balanza comercial.",
        "start": 4738.22,
        "end": 4745.22
    },
    {
        "text": " El saldo de la reex. Lo del reex, que hay sí como están las 6 por menos, las 6 por, hay",
        "start": 4745.22,
        "end": 4757.7
    },
    {
        "text": " un reex menos, un reex, las 6 por que refieren. Ingresos al país de divisas o salidas, cuando",
        "start": 4757.7,
        "end": 4767.42
    },
    {
        "text": " uno exporta ingresos. Entonces con el reex vamos a lo mismo. Rx es lo que ingresa al país, le",
        "start": 4767.42,
        "end": 4775.58
    },
    {
        "text": " llamamos cobrados menos pagados. Y acá tenemos reex. ¿Quién ha esto de rex? Las rentas, pagos de rentas",
        "start": 4775.58,
        "end": 4785.82
    },
    {
        "text": " o cobros, no, cobros menos pagos de rentas con el exterior y por qué son esos pagos de rentas.",
        "start": 4785.82,
        "end": 4791.18
    },
    {
        "text": " Intereses, por ejemplo, de deuda o ganancias de alguien que invirtió en el exterior,",
        "start": 4791.18,
        "end": 4799.62
    },
    {
        "text": " está obteniendo ganancia, agir a beneficios. Entonces esto de reex cobrado es, por ejemplo,",
        "start": 4799.62,
        "end": 4805.66
    },
    {
        "text": " un uruguayo que haya comprado un bono en Perú y esos intereses del bono me los registra acá,",
        "start": 4805.66,
        "end": 4813.26
    },
    {
        "text": " la cuenta corriente, la balanza de pagos. ¿Bien? ¿Por qué? ¿Por qué hice una ganancia?",
        "start": 4813.26,
        "end": 4820.62
    },
    {
        "text": " ¿Qué ha invirtiendo en el exterior? ¿Invirtiendo capital financiero en el exterior? Lo opuesto con esto",
        "start": 4820.62,
        "end": 4826.46
    },
    {
        "text": " de acá. Y después tenemos lo de las transferencias. Y esto es lo mismo. Las cobradas o las recibidas,",
        "start": 4826.46,
        "end": 4835.98
    },
    {
        "text": " menos las transferencias enviadas. Sí. Bueno, todo muy lindo, pero a esto nos le vamos a",
        "start": 4836.94,
        "end": 4851.099999999999
    },
    {
        "text": " reunir. Estamos tratando, decíamos, cuando arrancamos esto de macro, de ponerle algo conceptual,",
        "start": 4851.099999999999,
        "end": 4858.74
    },
    {
        "text": " algo más teórico, algunas interpretaciones. Entonces, cuando yo hablo y este anex analiza la",
        "start": 4859.54,
        "end": 4866.0199999999995
    },
    {
        "text": " lectura de la cuenta corriente, va a ser una lectura simplificada en el principal componente de la",
        "start": 4866.0199999999995,
        "end": 4871.82
    },
    {
        "text": " cuenta corriente, que es el saldo de la balanza comercial, que es esta diferencia de dos variables",
        "start": 4871.82,
        "end": 4878.0599999999995
    },
    {
        "text": " que ya sabemos de qué dependen cada una de ellas. ¿Sí? Entonces, vamos a hacer foco en",
        "start": 4878.0599999999995,
        "end": 4884.82
    },
    {
        "text": " simplificar que la cuenta corriente es esto. El saldo de la balanza comercial, x por menos y",
        "start": 4884.82,
        "end": 4891.139999999999
    },
    {
        "text": " y lo que vamos a ver es que tengamos un saldo en la cuenta corriente, que es esta cuenta,",
        "start": 4894.58,
        "end": 4903.58
    },
    {
        "text": " no, vamos a ponerlo acá. ¿Qué es? Ya vemos le, menos 2 500 millones de dólares,",
        "start": 4903.58,
        "end": 4913.46
    },
    {
        "text": " cómo interpretamos esto. ¿Qué explicación, qué argumentos conceptuales le podemos poner a esto?",
        "start": 4915.26,
        "end": 4923.1
    },
    {
        "text": " Esto dijimos, no le amo, y esto tiene cuatro lecturas, primera, mirando la definición del saldo",
        "start": 4923.1,
        "end": 4945.620000000001
    },
    {
        "text": " de la cuenta corriente, si el saldo de la cuenta corriente dijimos que es x por menos impon y que",
        "start": 4945.620000000001,
        "end": 4952.06
    },
    {
        "text": " esto da menos 2 millones y medio, ¿por qué? ¿Qué podemos decir? ¿Por qué tiene déficit un país?",
        "start": 4952.06,
        "end": 4966.3
    },
    {
        "text": " ¿Por qué? Importó más de lo que exportó, porque compró más bienes al exterior de los que",
        "start": 4969.46,
        "end": 4979.620000000001
    },
    {
        "text": " recibieron. ¿Sí? Entonces, primera lectura de la cuenta corriente, la explicación que da es",
        "start": 4979.62,
        "end": 4986.22
    },
    {
        "text": " decirnos que si hay un país que tiene déficit en cuenta corriente, es porque pasó esto.",
        "start": 4986.22,
        "end": 4990.54
    },
    {
        "text": " Más allá que en capaz que en descritivo a veces no, la explicación puede ser por la del rx,",
        "start": 4991.82,
        "end": 4996.38
    },
    {
        "text": " acá estamos yendo alo gran, y además a esto nos vamos a centrar.",
        "start": 4996.38,
        "end": 5000.099999999999
    },
    {
        "text": " Déficit en cuenta corriente, un país vendió menos de lo que le compró al resto del mundo, ¿Sí?",
        "start": 5002.099999999999,
        "end": 5007.9
    },
    {
        "text": " Recuerden que la balanza de paros nos medían entonces las transacciones entre Uruguay y el resto del mundo.",
        "start": 5008.7,
        "end": 5016.78
    },
    {
        "text": " Cuando Uruguay exporta, está dando algo a cambio que es la cantidad de carne, ¿Sí?",
        "start": 5017.9,
        "end": 5025.86
    },
    {
        "text": " Las exportaciones y están entrando divisas.",
        "start": 5026.379999999999,
        "end": 5029.86
    },
    {
        "text": " Bien. Pero además, si estamos vendiendo, están viniendo cantidades y bienes importados de",
        "start": 5030.86,
        "end": 5043.9
    },
    {
        "text": " automóviles que poníamos y estos son las importaciones y acá en Uruguay tiene que pagados.",
        "start": 5043.9,
        "end": 5049.78
    },
    {
        "text": " Balanza de paros recuerden que toda transacción, todo vinculo entre la economía y el resto del mundo se",
        "start": 5050.78,
        "end": 5060.38
    },
    {
        "text": " registra por partidado. Ahora vamos a retomar un poco. La primera lectura entonces tenemos déficit",
        "start": 5060.38,
        "end": 5067.219999999999
    },
    {
        "text": " porque le compramos más de lo que le vendimos. Segunda lectura, la segunda lectura nos plantea lo",
        "start": 5067.219999999999,
        "end": 5076.9
    },
    {
        "text": " siguiente. Tenemos que el PBI es consumo más inversión, más gasto, más sex por menos",
        "start": 5076.9,
        "end": 5084.78
    },
    {
        "text": " símbolo y tenemos que esto vale menos dos y medio. ¿Sí? Esto de acá es Cuba, es la producción",
        "start": 5084.78,
        "end": 5095.62
    },
    {
        "text": " del país ¿Verdad? Sí. Y esto de acá es demanda de bienes nacionales, hecha porque hay gente",
        "start": 5095.62,
        "end": 5108.34
    },
    {
        "text": " acá atrás de esta variable. Oganes uruguayos, acá empresas uruguayas y acá está uruguayo. A esto",
        "start": 5108.34,
        "end": 5118.0599999999995
    },
    {
        "text": " le vamos a llamar absorción interna, absorción de uruguayos. Esto es producción, uruguaya y esto es",
        "start": 5118.06,
        "end": 5130.660000000001
    },
    {
        "text": " absorción de uruguayos. ¿Qué conclusión podemos sacar? ¿Por qué tenemos este déficit de 2.5?",
        "start": 5130.66,
        "end": 5140.22
    },
    {
        "text": " ¿Por qué esto es negativo si tenemos estos dos términos? A esto es la producción y esto es lo que",
        "start": 5151.58,
        "end": 5157.34
    },
    {
        "text": " demandan los uruguayos. ¿Por qué uruguay? ¿Pero dijo a determinada cantidad que fue menor a lo que",
        "start": 5157.34,
        "end": 5165.7
    },
    {
        "text": " están demandando? Entonces si un país tiene una producción que es menor a su demanda interna,",
        "start": 5165.7,
        "end": 5175.9800000000005
    },
    {
        "text": " esto que le llamamos absorción interna, ¿Sí? Pero que a gran derragos es si demandas más de lo que",
        "start": 5175.9800000000005,
        "end": 5184.900000000001
    },
    {
        "text": " generaste vas a tener un déficit. Bien. Tercera lectura, saldo de balanza de pagos,",
        "start": 5184.9,
        "end": 5203.58
    },
    {
        "text": " ir al saldo en la cuenta capital, más que otra cosa. Perdón, cuenta capital, dije, cuenta",
        "start": 5203.58,
        "end": 5214.0199999999995
    },
    {
        "text": " corriente, más saldo en la cuenta capital, más errores y omisiones pero no le vamos a dar",
        "start": 5214.02,
        "end": 5219.9400000000005
    },
    {
        "text": " bolilla a esto para esta parte de hoy que simplifica y esto era igual a cero porque todos los registrábamos",
        "start": 5219.9400000000005,
        "end": 5228.22
    },
    {
        "text": " ahí adentro, toda transacciones estaba registrada en la cuenta corriente y en la cuenta capital.",
        "start": 5228.22,
        "end": 5233.3
    },
    {
        "text": " Entonces por ejemplo, ¿Cómo se registra cuando del resto del mundo vienen dólares para poner",
        "start": 5233.3,
        "end": 5254.7
    },
    {
        "text": " una empresa en uruguay, para la planta UPM, vienen los filandeses con millones de dólares para",
        "start": 5254.7,
        "end": 5261.02
    },
    {
        "text": " uruguay para contratar manoe de obra, contratar empresas? Los dólares vienen para acá y que se",
        "start": 5261.02,
        "end": 5268.740000000001
    },
    {
        "text": " registra esto, ¿Qué hay a cambio? ¿Cómo se registra esto? Los dólares vienen y a cambio que hay,",
        "start": 5268.740000000001,
        "end": 5276.02
    },
    {
        "text": " una especie de promesa denominada en versiones transgera directos, ¿Sí? Porque es plata que trajeron",
        "start": 5276.02,
        "end": 5283.860000000001
    },
    {
        "text": " ellos, la fábrica que instalará en la cana algún momento puede retornar, ¿Sí? O también puede",
        "start": 5283.86,
        "end": 5291.42
    },
    {
        "text": " ser denominado en versiones en cartera, si en vez de ser dólares que vinieron a poner una empresa,",
        "start": 5291.42,
        "end": 5296.299999999999
    },
    {
        "text": " son dólares que vinieron a comprar un bueno uruguayo, ¿Qué se llevó o qué derecho tiene la gente",
        "start": 5296.299999999999,
        "end": 5302.98
    },
    {
        "text": " del resto del mundo que vino el argentino que vino a comprar un bueno uruguayo y tiene el",
        "start": 5302.98,
        "end": 5308.259999999999
    },
    {
        "text": " derecho de ese papel que en algún momento lo va a cobrar, ¿Sí? Entonces, así como acá ponemos",
        "start": 5308.26,
        "end": 5315.26
    },
    {
        "text": " dentro de la cuenta corriente, tenemos export, menos import, ingresos de divisas, acá hacemos lo",
        "start": 5315.26,
        "end": 5324.900000000001
    },
    {
        "text": " mismo, acá ponemos inversiones transgera directa, recibida, inversión en cartera, recibida,",
        "start": 5324.900000000001,
        "end": 5334.820000000001
    },
    {
        "text": " menos la enviada, ¿No? Menos, inversión en cartera, enviada, hacemos el mismo ordenamiento,",
        "start": 5334.82,
        "end": 5348.38
    },
    {
        "text": " lo ingresado, lo ponemos positivo, lo que sale negativo, ahora vamos a ponerle el numerito",
        "start": 5348.38,
        "end": 5358.34
    },
    {
        "text": " y lo interpretador, si esto de acá da menos 2,5, ¿Qué puedo decir de esta lectura de la",
        "start": 5358.34,
        "end": 5368.66
    },
    {
        "text": " balanza de pagos? Que si tengo un déficit en cuenta corriente, este de acá como tiene que",
        "start": 5368.66,
        "end": 5377.34
    },
    {
        "text": " pensar, positivo, y esto de acá por ser positivo, ¿Qué quiere decir? Que están ingresando",
        "start": 5377.34,
        "end": 5387.14
    },
    {
        "text": " más o está saliendo más, están ingresando más, inversiones extranjeras o inversión",
        "start": 5387.14,
        "end": 5395.1
    },
    {
        "text": " en cartera, entonces a esto le vamos a llamar ingreso de capitales, de capitales financieros,",
        "start": 5395.1,
        "end": 5406.06
    },
    {
        "text": " bien en capitales del resto del mundo para poner la fabricaca, concepto de inversión",
        "start": 5406.06,
        "end": 5413.820000000001
    },
    {
        "text": " extranjera directa, acá habían visto con Mateo, o bien en capitales a banco, fondos de inversión,",
        "start": 5413.820000000001,
        "end": 5420.22
    },
    {
        "text": " bonos, lo que sea, activos financieros. Así que si tenemos un déficit en cuenta corriente,",
        "start": 5420.22,
        "end": 5429.02
    },
    {
        "text": " esta lectura, esta tercera lectura, que ahora le vamos a integrar en la cuarta, porque la",
        "start": 5429.02,
        "end": 5433.3
    },
    {
        "text": " cuarta, que es la acumulativa de las anteriores, es ahí donde va hasta la pregunta, ¿no?",
        "start": 5433.3,
        "end": 5437.860000000001
    },
    {
        "text": " en el parcial. Lo que nos está diciendo es la tercera lectura es, tenés de 50 corrientes,",
        "start": 5437.860000000001,
        "end": 5445.54
    },
    {
        "text": " lo tuviste que financiar de alguna manera, y si tenés de deficit, te están entrando capitales",
        "start": 5445.54,
        "end": 5450.7
    },
    {
        "text": " para financiar este deficit. Está vinculado al anterior, ¿Cómo hiciste para comprarle más",
        "start": 5450.7,
        "end": 5456.74
    },
    {
        "text": " de lo que le vendiste? ¿Cómo hiciste para demandar más de lo que fue tu producción? Y",
        "start": 5456.74,
        "end": 5463.0
    },
    {
        "text": " este están financianos. Y acá una cuestión con esto, inversión extranjera directa es ingreso",
        "start": 5463.0,
        "end": 5472.16
    },
    {
        "text": " de capitales al país, pero quién sigue siendo el dueño de estos capitales que vinieron",
        "start": 5472.16,
        "end": 5476.48
    },
    {
        "text": " en Uruguay? Los dueños de la inversión extranjera, el exterior, los dueños de la inversión",
        "start": 5476.48,
        "end": 5482.68
    },
    {
        "text": " extranjera, el exterior, entonces este ingreso de capitales puede ser visto como una deuda,",
        "start": 5482.68,
        "end": 5489.88
    },
    {
        "text": " ¿no? ¿Sí? O como algo que se puede ir en algún momento. Entonces, tabarbaro ingreso",
        "start": 5489.88,
        "end": 5497.4800000000005
    },
    {
        "text": " de capitales, tabarbaro que si nosotros algún día nos falta plata a nuestra casa y nos presta,",
        "start": 5497.4800000000005,
        "end": 5502.68
    },
    {
        "text": " pero nos presta, no está haciendo una donación. Estas empresas se extranjera a través de",
        "start": 5502.68,
        "end": 5509.6
    },
    {
        "text": " la inversión extranjera directa o los inversionistas que vienen a inviarte más en oportunidades",
        "start": 5509.6,
        "end": 5516.04
    },
    {
        "text": " financieras, no son donaciones, vienen con su capital a buscar determinados retornos,",
        "start": 5516.04,
        "end": 5522.44
    },
    {
        "text": " pero además se sableata después, se van a ir. Por eso es esa advertencia de que el ingreso",
        "start": 5522.44,
        "end": 5529.2
    },
    {
        "text": " de capitales, financian el déficit, pero ojo porque no son nuestros esos capitales. Y si",
        "start": 5529.2,
        "end": 5536.96
    },
    {
        "text": " recuerdan, acá hay una tercera forma, un tercer registro en la cuenta capital que es la",
        "start": 5536.96,
        "end": 5545.64
    },
    {
        "text": " inversión extranjera, la inversión en carteira y son la variación de recércoles, que por",
        "start": 5545.64,
        "end": 5557.360000000001
    },
    {
        "text": " el tema de que está en negativo, ¿no? Es como variación de recércoles. O sea, este 2x5 es",
        "start": 5557.360000000001,
        "end": 5565.88
    },
    {
        "text": " ingreso de capitales o puede ser uso de recércoles internacionales. Lo que decíamos recién,",
        "start": 5565.88,
        "end": 5575.200000000001
    },
    {
        "text": " una familia también puede tener déficit. ¿Cómo lo puede financiar? Con alguien que nos preste",
        "start": 5575.2,
        "end": 5580.36
    },
    {
        "text": " ingreso de capitales o vamos a la chanchita y sacamos ahorros. A nivel país en la balanza de pagos,",
        "start": 5580.36,
        "end": 5588.44
    },
    {
        "text": " esa chanchita es usar las resas. Por eso dentro de la cuenta capital y para que esto cierre en cero,",
        "start": 5588.44,
        "end": 5596.28
    },
    {
        "text": " la balanza de pagos se ponen inversión extranjera y inversión en carteira y por otro lado el uso",
        "start": 5596.28,
        "end": 5603.76
    },
    {
        "text": " de las resas. Por eso va como negativo, como uso, ¿sí? Porque es algo que tiene que financiar el",
        "start": 5603.76,
        "end": 5609.8
    },
    {
        "text": " otro de ellos. Bien. Entonces, vamos a la cuarta lectura de la cuenta corriente.",
        "start": 5609.8,
        "end": 5620.76
    },
    {
        "text": " La cuarta lectura de la cuenta corriente parte de lo siguiente, de decirnos.",
        "start": 5624.280000000001,
        "end": 5629.2
    },
    {
        "text": " El PBI, la misma definición de los componentes del PBI.",
        "start": 5629.2,
        "end": 5636.28
    },
    {
        "text": " Parte de esto. Y hace un par de cuentas sencillas. Dice, resto impuestos acá,",
        "start": 5639.4,
        "end": 5647.2
    },
    {
        "text": " resto impuestos acá. Es una igualdad, la definición del PBI nos dice,",
        "start": 5647.2,
        "end": 5654.28
    },
    {
        "text": " tenés una producción que va a parar algunas manos y esas manos son estas 5 posibles.",
        "start": 5654.84,
        "end": 5660.12
    },
    {
        "text": " Consumo hasta importación. Si yo es esa igualdad, le resto lo mismo. De cada lado se sigue cumpliendo.",
        "start": 5660.12,
        "end": 5667.96
    },
    {
        "text": " Detalle adicional. PBI era igual a ingreso sobre el tu interno.",
        "start": 5669.639999999999,
        "end": 5677.2
    },
    {
        "text": " Cuentas nacionales, la parte de economía descriptiva que vieron con más de.",
        "start": 5677.2,
        "end": 5683.5199999999995
    },
    {
        "text": " En ingreso sobre el tu interno es nuestra variable, no es otra cosa que nuestra variable ingreso.",
        "start": 5683.5199999999995,
        "end": 5691.28
    },
    {
        "text": " El ingreso sobre el tu interno es las distintas formas de ingreso de los agentes de conón.",
        "start": 5691.28,
        "end": 5696.28
    },
    {
        "text": " Y eso nosotros acá en esta clase de macro ya habíamos llamado ingreso de todos,",
        "start": 5696.28,
        "end": 5702.12
    },
    {
        "text": " los hogares que incluyen empresarios, ingresos como personas.",
        "start": 5702.12,
        "end": 5707.12
    },
    {
        "text": " Y hago una cuenta más. Resto consumo y resto consumo.",
        "start": 5709.12,
        "end": 5714.76
    },
    {
        "text": " Se sigue cumpliendo la igualdad. Entonces, este se me va con este.",
        "start": 5718.599999999999,
        "end": 5726.5199999999995
    },
    {
        "text": " Y si yo al ingreso le quito los impuestos y le quito la parte que se destina con su consumo.",
        "start": 5726.52,
        "end": 5737.6
    },
    {
        "text": " ¿Qué tengo ahí? Ahí voy a tener, de todo esto, voy a tener el amor.",
        "start": 5739.84,
        "end": 5750.040000000001
    },
    {
        "text": " Y de esa manera yo llego a esta ecuación que es la que quería llegar.",
        "start": 5751.04,
        "end": 5755.92
    },
    {
        "text": " Ahora la vamos a leer un poco.",
        "start": 5772.6,
        "end": 5774.76
    },
    {
        "text": " O sea, la cuarta leitura de la cuenta corriente es esta ecuación.",
        "start": 5775.76,
        "end": 5779.76
    },
    {
        "text": " Esto que hicimos es para saber que en realidad esta ecuación es algo que se cumple siempre.",
        "start": 5779.76,
        "end": 5783.76
    },
    {
        "text": " Claro, si al ingreso le sacamos los impuestos, le sacamos el consumo.",
        "start": 5787.76,
        "end": 5791.76
    },
    {
        "text": " Ahí tenemos la diferencia esa con las importaciones que es capaz de una precisión que para simplificar.",
        "start": 5793.76,
        "end": 5799.76
    },
    {
        "text": " Vamos con la idea más global. Ahora van a ver a qué refiere cada, porque esta agrupación,",
        "start": 5800.76,
        "end": 5806.76
    },
    {
        "text": " pero también es simplificador. No estaría con aquello valla, con aquel cumplimiento valla.",
        "start": 5806.76,
        "end": 5812.76
    },
    {
        "text": " Bien.",
        "start": 5814.76,
        "end": 5815.76
    },
    {
        "text": " ¿Qué tiene esto de acá? Y que incluso esta ecuación nosotros generalmente le vamos a poner unos paréntesis",
        "start": 5819.76,
        "end": 5826.76
    },
    {
        "text": " que no cortan nada matemáticamente, pero que sí nos ordenan ideas.",
        "start": 5826.76,
        "end": 5830.76
    },
    {
        "text": " ¿Qué agente económico tenemos detrás de esta primera variable? La inversión.",
        "start": 5840.76,
        "end": 5844.76
    },
    {
        "text": " ¿Quién está acá atrás?",
        "start": 5848.76,
        "end": 5850.76
    },
    {
        "text": " Empresas, Uruguayas. ¿Quién está acá atrás?",
        "start": 5851.76,
        "end": 5858.76
    },
    {
        "text": " ¿Quién son los que decidían cuanto ahorrar?",
        "start": 5862.76,
        "end": 5865.76
    },
    {
        "text": " ¿El agente económico o gares, Uruguayas? ¿Quién está acá atrás?",
        "start": 5867.76,
        "end": 5873.76
    },
    {
        "text": " ¿El gobierno? ¿El gobierno? ¿Quién está acá atrás? ¿Quién está acá atrás?",
        "start": 5874.76,
        "end": 5884.76
    },
    {
        "text": " ¿Quién está acá atrás? Re esto el mundo.",
        "start": 5884.76,
        "end": 5887.76
    },
    {
        "text": " A estos dos, Empresas, Ciudades, le podemos llamar el sector privado y este sería el sector público, ¿no?",
        "start": 5888.76,
        "end": 5896.76
    },
    {
        "text": " Entonces, en estos tres paréntesis qué es lo que estamos teniendo, una igualdad que nos muestra de alguna manera las cuentas de los tres grandes estos bloques de gente que en los que ordenamos o clasificamos a todo el mundo.",
        "start": 5897.76,
        "end": 5915.76
    },
    {
        "text": " Lo que le llamamos el sector privado, Empresas, Ciudades, en este primer paréntesis, lo que le llamamos el gobierno uruguayo",
        "start": 5916.76,
        "end": 5923.76
    },
    {
        "text": " y ahí tenemos en estos dos paréntesis a todos los uruguayos y en este otro paréntesis la relación con el resto de uno.",
        "start": 5924.76,
        "end": 5931.76
    },
    {
        "text": " Entonces, esta ecuación para que nos sirve para saber que si hay alguno de estas tres grandes personas, sector privado Uruguayo, gobierno uruguayo y resto del mundo, que le faltan fondos porque cada una de estas cuentas en realidad lo que están mirando son todas restas, ¿no?",
        "start": 5932.76,
        "end": 5949.76
    },
    {
        "text": " ¿no? ¿entre los paréntesis? Lo que está mirando cada paréntesis es un salvo, una especie de cuentas entre ingresos y regresos.",
        "start": 5949.76,
        "end": 5957.76
    },
    {
        "text": " Entonces, si hay alguno de estos agentes le faltan fondos, hay otro de ellos porque son solo tres en el mundo, le tienen que estar prestando.",
        "start": 5958.76,
        "end": 5967.76
    },
    {
        "text": " Entonces, vamos a verlo con un ejemplo, tal como se los pregundo en los parciales.",
        "start": 5967.76,
        "end": 5972.76
    },
    {
        "text": " Y ahí seguimos interpretando esto de esto.",
        "start": 5975.76,
        "end": 5979.76
    },
    {
        "text": " Entonces, una de las cinco preguntas le voy a decir, el gobierno tuvo déficit fiscal de un millón y medio de dólares,",
        "start": 5980.76,
        "end": 5996.76
    },
    {
        "text": " y el país tuvo déficit, o vamos con algo así, y les digo, y el saldo en la cuenta corriente fue menos dos millones y medio de dólares.",
        "start": 5997.76,
        "end": 6013.76
    },
    {
        "text": " Entonces, yo les doy dos datos y esta cuarta lectura de la cuenta corriente nos tiene que llevar a ver aquí en el sobre o plata, aquí está prestando aquí.",
        "start": 6014.76,
        "end": 6025.76
    },
    {
        "text": " Esa es la lógica de esta cuarta lectura de la cuenta corriente.",
        "start": 6026.76,
        "end": 6030.76
    },
    {
        "text": " Entonces, primero que nada, llevemos esos datos, empecemos por el saldo en la cuenta corriente de menos dos y medio, donde pongo ese número.",
        "start": 6031.76,
        "end": 6039.76
    },
    {
        "text": " Tarzarparentes, cuanto vale esto, menos dos millones y medio.",
        "start": 6040.76,
        "end": 6046.76
    },
    {
        "text": " Exportaciones, menos importaciones es la simplificación que dijimos que estamos trabajando de la cuenta corriente,",
        "start": 6051.76,
        "end": 6060.76
    },
    {
        "text": " deficitaria, expo menos import, dos millones y medio.",
        "start": 6060.76,
        "end": 6065.76
    },
    {
        "text": " Este dato entonces ya le use.",
        "start": 6066.76,
        "end": 6068.76
    },
    {
        "text": " Este otro dato, déficit fiscal de un millón y medio.",
        "start": 6069.76,
        "end": 6072.76
    },
    {
        "text": " Voy al paréntesis del medio del gobierno. ¿Cuánto vale esto?",
        "start": 6074.76,
        "end": 6078.76
    },
    {
        "text": " Menos uno como cinco. ¿Sí?",
        "start": 6079.76,
        "end": 6084.76
    },
    {
        "text": " O no. ¿Tiene duda ese compañero allá?",
        "start": 6086.76,
        "end": 6091.76
    },
    {
        "text": " ¿Cuál es el dato? ¿Deficit fiscal? Si es déficit fiscal, eso sobre todo le faltó plata.",
        "start": 6093.76,
        "end": 6100.76
    },
    {
        "text": " Le faltó. Entonces, cuando hacemos las cuentas del estado, tienen que ser negativos.",
        "start": 6101.76,
        "end": 6106.76
    },
    {
        "text": " Las cuentas del estado, como las hacemos, para ver siempre un saldo. ¿Oy cómo las habíamos hecho?",
        "start": 6106.76,
        "end": 6113.76
    },
    {
        "text": " Ingreso. Ingreso menos, agresos. ¿Cómo tenemos acá las cuentas?",
        "start": 6114.76,
        "end": 6118.76
    },
    {
        "text": " La variable gasto que es para el estado.",
        "start": 6119.76,
        "end": 6121.76
    },
    {
        "text": " Ingresos o agresos? ¿Egresos? ¿La variable impuestos?",
        "start": 6122.76,
        "end": 6127.76
    },
    {
        "text": " Ingresos. Entonces, si tenemos déficit fiscal, ¿quién tiene que ser más grande de estas dos?",
        "start": 6128.76,
        "end": 6133.76
    },
    {
        "text": " Los gastos. Y si tenemos déficit fiscal y los gastos son más grandes esto cuanto es.",
        "start": 6134.76,
        "end": 6139.76
    },
    {
        "text": " Uno con cinco, positivo o negativo.",
        "start": 6141.76,
        "end": 6144.76
    },
    {
        "text": " ¿Positivo? ¿Sí?",
        "start": 6145.76,
        "end": 6150.76
    },
    {
        "text": " Sí o no. ¿Alguno que todavía piensa negativo?",
        "start": 6154.76,
        "end": 6158.76
    },
    {
        "text": " Ahora, ¿cómo le podemos ayudar con otras palabras? ¿Por qué tiene que ir positivo eso?",
        "start": 6159.76,
        "end": 6164.76
    },
    {
        "text": " Que lo haya entendido así al toque, que lo explique.",
        "start": 6168.76,
        "end": 6171.76
    },
    {
        "text": " ¿Por qué un déficit fiscal acá se pone positivo?",
        "start": 6172.76,
        "end": 6175.76
    },
    {
        "text": " Porque acá estamos representando al revés el presupuesto, que como lo habíamos visto hoy.",
        "start": 6180.76,
        "end": 6185.76
    },
    {
        "text": " Acá estamos poniendo primero los gastos después los ingresos.",
        "start": 6185.76,
        "end": 6189.76
    },
    {
        "text": " Entonces, si es déficit, gasto tiene que superar a los impuestos.",
        "start": 6189.76,
        "end": 6193.76
    },
    {
        "text": " Bien, acá porque el déficit lo representamos negativo.",
        "start": 6194.76,
        "end": 6198.76
    },
    {
        "text": " Y por acá estamos hablando como siempre del déficit como expo menos impo.",
        "start": 6198.76,
        "end": 6204.76
    },
    {
        "text": " Bien, entonces, ya usamos los dos datos.",
        "start": 6205.76,
        "end": 6208.76
    },
    {
        "text": " Lo tercero que es, si esto es una igualdad y tiene que arno cero,",
        "start": 6209.76,
        "end": 6214.76
    },
    {
        "text": " sacamos el valor de esto acá.",
        "start": 6215.76,
        "end": 6217.76
    },
    {
        "text": " Bien, y este valor acá entonces cuanto es?",
        "start": 6218.76,
        "end": 6221.76
    },
    {
        "text": " Acá vamos a ponerle más para que quede claro.",
        "start": 6222.76,
        "end": 6224.76
    },
    {
        "text": " Y esto entonces acá es más 1.",
        "start": 6225.76,
        "end": 6227.76
    },
    {
        "text": " Y ahora interpretemos justamente esto que estábamos viendo.",
        "start": 6235.76,
        "end": 6238.76
    },
    {
        "text": " Aquí en le sobró y aquí en le faltó plata.",
        "start": 6238.76,
        "end": 6240.76
    },
    {
        "text": " Arranquemos por el estado que fuimos que vimos recién más detenidamente.",
        "start": 6241.76,
        "end": 6245.76
    },
    {
        "text": " Le faltó el sobror plata al estado.",
        "start": 6246.76,
        "end": 6248.76
    },
    {
        "text": " Le faltó, tuvo déficit.",
        "start": 6249.76,
        "end": 6251.76
    },
    {
        "text": " Y si tuvo déficit, que tenía que hacer financiar.",
        "start": 6251.76,
        "end": 6255.76
    },
    {
        "text": " ¿Cómo le podía financiar?",
        "start": 6255.76,
        "end": 6257.76
    },
    {
        "text": " Más impuestos, pero si acá ya tenemos impuestos, por ahí no lo financió.",
        "start": 6257.76,
        "end": 6261.76
    },
    {
        "text": " En misión de dinero, no nos metamos acá porque no aparece esa variada.",
        "start": 6262.76,
        "end": 6265.76
    },
    {
        "text": " Deuda.",
        "start": 6266.76,
        "end": 6267.76
    },
    {
        "text": " Tercer afuente, ¿no? La segunda que vimos hoy.",
        "start": 6267.76,
        "end": 6270.76
    },
    {
        "text": " Y si es deuda, alguien se la está comprando.",
        "start": 6271.76,
        "end": 6273.76
    },
    {
        "text": " A alguien le está trayendo fondos para acá.",
        "start": 6273.76,
        "end": 6275.76
    },
    {
        "text": " A ver, tenido un déficit implica que alguien le está prestando al gobierno de Uruguay.",
        "start": 6276.76,
        "end": 6282.76
    },
    {
        "text": " ¿Sí?",
        "start": 6283.76,
        "end": 6284.76
    },
    {
        "text": " ¿Qué pasa con el sector privado de Uruguay?",
        "start": 6285.76,
        "end": 6288.76
    },
    {
        "text": " Vayamos a estos agentes económicos.",
        "start": 6289.76,
        "end": 6291.76
    },
    {
        "text": " La inversión, la inversión era de las empresas.",
        "start": 6292.76,
        "end": 6294.76
    },
    {
        "text": " Y las empresas, ¿cómo es el funcionamiento de una empresa?",
        "start": 6295.76,
        "end": 6298.76
    },
    {
        "text": " Pensemos en las inversiones, los proyectos y inversiones de los otros días.",
        "start": 6298.76,
        "end": 6301.76
    },
    {
        "text": " La empresa tiene el negocio, tiene la idea del negocio y qué hace.",
        "start": 6302.76,
        "end": 6306.76
    },
    {
        "text": " Vay, pide, plat, pide fondos.",
        "start": 6307.76,
        "end": 6309.76
    },
    {
        "text": " Generalmente a dónde pide fondos es una empresa.",
        "start": 6309.76,
        "end": 6312.76
    },
    {
        "text": " A los bancos, al sistema financiero, entonces el accionar del empresario es,",
        "start": 6313.76,
        "end": 6317.76
    },
    {
        "text": " quiero invertir y voy a buscar fondos.",
        "start": 6317.76,
        "end": 6320.76
    },
    {
        "text": " Y en el banco, de donde saca los fondos el banco.",
        "start": 6321.76,
        "end": 6324.76
    },
    {
        "text": " De hogares, que generaron ahorros y los depositaron en el banco.",
        "start": 6325.76,
        "end": 6330.76
    },
    {
        "text": " El banco le ha funcionado tradicional era de intermediador financiero.",
        "start": 6331.76,
        "end": 6335.76
    },
    {
        "text": " Entre quién, entre estos que les obro y querían guardar para el futuro",
        "start": 6336.76,
        "end": 6339.76
    },
    {
        "text": " y estos que tienen necesidades para invertir.",
        "start": 6340.76,
        "end": 6343.76
    },
    {
        "text": " Entonces, en esa cuenta, el sector privado en su conjunto,",
        "start": 6344.76,
        "end": 6347.76
    },
    {
        "text": " donde la parte inversión viene a ser lo que gasta el sector privado",
        "start": 6348.76,
        "end": 6352.76
    },
    {
        "text": " y la parte de ahorros es lo que ahorro, lo que generó de ingresos el sector privado.",
        "start": 6353.76,
        "end": 6358.76
    },
    {
        "text": " ¿Qué le pasó al sector privado en su conjunto?",
        "start": 6358.76,
        "end": 6361.76
    },
    {
        "text": " Les sobraron o les faltaron fondos.",
        "start": 6361.76,
        "end": 6363.76
    },
    {
        "text": " Este banco le alcanzó, sin huir a banco y se conocen entre ellos.",
        "start": 6376.76,
        "end": 6381.76
    },
    {
        "text": " Los hogares con las empresas. Les alcanzaron los fondos.",
        "start": 6381.76,
        "end": 6385.76
    },
    {
        "text": " Las empresas que hicieron invertir un millón más que los ahorros.",
        "start": 6386.76,
        "end": 6392.76
    },
    {
        "text": " O sea que todo lo que invirtieron las empresas se financió una parte con estos ahorros",
        "start": 6392.76,
        "end": 6399.76
    },
    {
        "text": " pero otra parte ahí le está prestando.",
        "start": 6399.76,
        "end": 6402.76
    },
    {
        "text": " Entonces, si teníamos tres y hay uno de ellos que es el sector privado y le faltó plata.",
        "start": 6405.76,
        "end": 6410.76
    },
    {
        "text": " Hay un segundo que se le ha estado y le faltó plata.",
        "start": 6411.76,
        "end": 6414.76
    },
    {
        "text": " ¿Quién les está prestando a estos dos?",
        "start": 6414.76,
        "end": 6417.76
    },
    {
        "text": " Esto está viniendo al resto del mundo.",
        "start": 6419.76,
        "end": 6421.76
    },
    {
        "text": " Pero ¿cómo? Si el resto del mundo decíamos que tenía déficit en cuenta corriente.",
        "start": 6423.76,
        "end": 6427.76
    },
    {
        "text": " ¿Cuál era la tercera lectura? ¿Qué me decía?",
        "start": 6430.76,
        "end": 6433.76
    },
    {
        "text": " ¿Qué este déficit en cuenta corriente? ¿Qué es?",
        "start": 6433.76,
        "end": 6436.76
    },
    {
        "text": " Es un superávit en la cuenta capital y en un superávit en cuenta capital le llamábamos ingresos de capital.",
        "start": 6437.76,
        "end": 6448.76
    },
    {
        "text": " Entonces, lo que estamos teniendo es que como país usemos las primeras dos lecturas de la cuenta corriente.",
        "start": 6455.76,
        "end": 6463.76
    },
    {
        "text": " Como país, dos millones y medio de déficit porque compramos más importaciones que lo que vendimos, exportaciones.",
        "start": 6464.76,
        "end": 6473.76
    },
    {
        "text": " O dicho, otra manera, porque demandamos internamente más de lo que se produjo.",
        "start": 6473.76,
        "end": 6479.76
    },
    {
        "text": " Entonces, el país tuvo déficit en cuenta corriente.",
        "start": 6479.76,
        "end": 6483.76
    },
    {
        "text": " Metemos en el juego la tercera lectura.",
        "start": 6483.76,
        "end": 6486.76
    },
    {
        "text": " Pero si es un déficit en cuenta corriente nos financiaron de afuera.",
        "start": 6486.76,
        "end": 6490.76
    },
    {
        "text": " ¿Cómo nos financiaron de afuera viniendo capitales?",
        "start": 6490.76,
        "end": 6493.76
    },
    {
        "text": " Que no eran regalo dijimos. Es una deuda.",
        "start": 6493.76,
        "end": 6496.76
    },
    {
        "text": " Ingresaron capitales al país.",
        "start": 6496.76,
        "end": 6498.76
    },
    {
        "text": " ¿A dónde vinieron? A manos de quién vinieron esos capitales.",
        "start": 6498.76,
        "end": 6502.76
    },
    {
        "text": " A manos del Estado, que definió unos gastos por encima de sus impuestos.",
        "start": 6502.76,
        "end": 6507.76
    },
    {
        "text": " Entonces esos capitales de repente vinieron y compraron parte de los bonos que le estaba emitido.",
        "start": 6507.76,
        "end": 6513.76
    },
    {
        "text": " Pero otra parte vinieron a bancos y ahí fueron las empresas las que tomaron esos fondos.",
        "start": 6513.76,
        "end": 6521.76
    },
    {
        "text": " Entonces, a partir de esta lectura lo que tenemos es esa interpretación de quién está financiando a quién.",
        "start": 6521.76,
        "end": 6531.76
    },
    {
        "text": " ¿Sí?",
        "start": 6531.76,
        "end": 6533.76
    },
    {
        "text": " 5.5, ¿no?",
        "start": 6536.76,
        "end": 6538.76
    },
    {
        "text": " 1 para que ustedes...",
        "start": 6538.76,
        "end": 6543.76
    },
    {
        "text": " 1 para que ustedes vean y vamos a hacerlo ahora, los vende de ver si la clase que viene seguimos.",
        "start": 6549.76,
        "end": 6557.76
    },
    {
        "text": " No, vamos a trabajar uno con déficit fiscal.",
        "start": 6568.76,
        "end": 6579.76
    },
    {
        "text": " 2% del PBI.",
        "start": 6585.76,
        "end": 6588.76
    },
    {
        "text": " Esto lo podemos expresar en millones de dólares, son porcentaje del PBI, ¿no?",
        "start": 6588.76,
        "end": 6593.76
    },
    {
        "text": " Y tenemos SuperAvid, un saldo en la cuenta corriente, positivo de 3 puntos del PBI.",
        "start": 6599.76,
        "end": 6612.76
    },
    {
        "text": " Bien, lo ven ustedes, tratan de hacer este análisis que hicimos y la clase que viene retomamos con el final de la demanda que se nos fue un poco ahora.",
        "start": 6615.76,
        "end": 6627.76
    },
    {
        "text": " 1 para que no se afuera, que la clase que ha sido en la cuenta corriente, ¿no?",
        "start": 6628.76,
        "end": 6635.76
    },
    {
        "text": " No, si Uruguay tiene un déficit en la cuenta corriente, eso es para Uruguay, la balance de pagos de Uruguay, que la cuenta capital es positiva, superaivitaria.",
        "start": 6637.76,
        "end": 6647.76
    },
    {
        "text": " Pero este superaivitario más que hablar de superaividad de cuenta capital hablamos que si acá hay edificis estos positivos y si es positivo por la forma en que se define, es ingreso de capitales.",
        "start": 6648.76,
        "end": 6659.76
    },
    {
        "text": " Ingressos de capitales que habíamos dicho es considerado deuda porque en algún momento se pueden ir, no es que nos regalaron capitales.",
        "start": 6661.76,
        "end": 6668.76
    },
    {
        "text": " Porque entra plata, al tener déficit en cuenta corriente, están entrando fondos y a dónde entran.",
        "start": 6669.76,
        "end": 6678.76
    },
    {
        "text": " Acá lo vemos más concreto a aquel lugar, a comprar buenos del Estado por uno y medio y a comprar buenos privados o a poner plata en un banco y que la se empresa lo piden después, sector privado.",
        "start": 6679.76,
        "end": 6691.76
    }
]