[
    {
        "text": " El Mercosurco Motal es un proceso abierto y dinámico.",
        "start": 0.0,
        "end": 26.0
    },
    {
        "text": " En este tratado inicial no se acordaron todos los acuados, sino que se ha ido evolucionando en este acuerdo.",
        "start": 26.0,
        "end": 34.0
    },
    {
        "text": " Y lo que busca básicamente es fomentar un mercado común facilitando los intercambios comerciales y las inversiones en la región.",
        "start": 34.0,
        "end": 49.0
    },
    {
        "text": " Buscando una integración más competitiva de las economías en la región.",
        "start": 49.0,
        "end": 58.0
    },
    {
        "text": " De esta forma el Mercosur fue creado como un mecanismo que lo que buscaba era fomentar las condiciones de desarrollo de las economías del cono sur.",
        "start": 61.0,
        "end": 75.0
    },
    {
        "text": " Y se basaban en que se creaba un mercado ampliado en un contexto internacional donde cada vez más hay una tendencia a la creación de bloques y de procesos de integración.",
        "start": 79.0,
        "end": 94.0
    },
    {
        "text": " Imagínense que paralelo a esto se está dando el proceso de la UE de la Europea, del Mercado común europeo.",
        "start": 96.0,
        "end": 107.0
    },
    {
        "text": " La comunidad económica europea. Entonces, en términos ideales, estoy diciendo cómo hago para negociar con el gran bloque de todos los países europeos y desarrollados.",
        "start": 107.0,
        "end": 120.0
    },
    {
        "text": " Creo un bloque regional ampliando el mercado generando buenas condiciones y negociar en bloque debe ser hasta mejor.",
        "start": 120.0,
        "end": 129.0
    },
    {
        "text": " De esta forma lo que se busca decir, bueno, estoy creando una herramienta a nivel de la región que me ve mejores condiciones para el proceso de incertio internacional de los países del cono sur, de las economías vecinas de Natur.",
        "start": 129.0,
        "end": 154.0
    },
    {
        "text": " Y que esas mejores condiciones de incertio internacional puedan repercutir en mejores condiciones de desarrollo para las economías, con mercados más amplios, con mejores condiciones comerciales, con complementariedades de rubros, con facilidades en el proceso de inversión.",
        "start": 155.0,
        "end": 173.0
    },
    {
        "text": " Entonces, ahí me voy conduciendo hacia una política pública que es nacional pero que también es regional.",
        "start": 174.0,
        "end": 182.0
    },
    {
        "text": " ¿Centiendes?",
        "start": 183.0,
        "end": 185.0
    },
    {
        "text": " En esas bases, en esos supuestos, en esos criterios porque nació el marco sur como tal.",
        "start": 186.0,
        "end": 192.0
    },
    {
        "text": " Si miramos como bloque, el marco sur en conjunto ni tienen el mapa de América del Sur, ¿no?",
        "start": 193.0,
        "end": 215.0
    },
    {
        "text": " Y estamos involucrando a toda esta parte y se suma Venezuela y después se suma Bolivia. ¿Sí?",
        "start": 216.0,
        "end": 229.0
    },
    {
        "text": " En kilómetros cuadrados y en población son números bastante importantes. Imagínense, kilómetros cuadrados y población, superficie y población. Brasil.",
        "start": 230.0,
        "end": 248.0
    },
    {
        "text": " Son 8 millones, 514 mil, 880 kilómetros cuadrados. Son 200, 1.497 personas, aproximadamente. Pongo los grandes números. Argentina.",
        "start": 249.0,
        "end": 268.0
    },
    {
        "text": " Son 3 millones, 761 mil, 274 kilómetros y 41 millones de personas, casi 42. Para guay.",
        "start": 269.0,
        "end": 285.0
    },
    {
        "text": " 462 kilómetros cuadrados y 6 millones, 880 mil personas. Uruguay. 176,220 kilómetros cuadrados y 3 millones, 418 mil personas.",
        "start": 286.0,
        "end": 312.0
    },
    {
        "text": " Venezuela. 912 mil, 50 kilómetros cuadrados y 30 millones de personas. Bolivia. 1.988.581 kilómetros cuadrados y 10 millones de personas, 598 mil.",
        "start": 312.0,
        "end": 341.0
    },
    {
        "text": " Imagínense todo lo que es a superficie, todo lo que es enriquezas naturales en paisajes, en realidad productiva y en población.",
        "start": 343.0,
        "end": 354.0
    },
    {
        "text": " Por eso yo lo tenía les comentaba cuando Uruguay vende, a pesar de que somos chiquitos somos la boca adentrada a todo este gran mercado que es América del Sur.",
        "start": 354.0,
        "end": 364.0
    },
    {
        "text": " Entonces, si nosotros miramos los números del Mercosur es bueno, es sumamente interesante.",
        "start": 365.0,
        "end": 373.0
    },
    {
        "text": " El proyecto del Mercosur como tal en tales condiciones que acuerdan en el tratado de asunción el 26 de marzo del 91.",
        "start": 380.0,
        "end": 388.0
    },
    {
        "text": " Es el proyecto, no? Internacional más relevante en el cual se embarcan las economías en la región.",
        "start": 389.0,
        "end": 399.0
    },
    {
        "text": " No hay proceso de integración regional más importante para los países de América del Sur que el Mercosur.",
        "start": 399.0,
        "end": 406.0
    },
    {
        "text": " En este acuerdo los cuatro estados partes que confonan en el Mercosur comparten una comunión de valores, dicen.",
        "start": 407.0,
        "end": 418.0
    },
    {
        "text": " Y en que encuentra una expresión en sus sociedades democráticas, pluralistas, defensoras de las libertades fundamentales, de los derechos humanos, de la protección del medio ambiente y del desarrollo sustentable.",
        "start": 418.0,
        "end": 430.0
    },
    {
        "text": " Así como su compromiso con la consolidación de la democracia, la seguridad jurídica, el combate a la pobreza y el desarrollo económico y social con equidad.",
        "start": 431.0,
        "end": 439.0
    },
    {
        "text": " Si bien empiezan a conformar una acuerdo, que son de corte comercial, pero la declaración de valores del Mercosur trascían de la dimensión puramente comercial económica.",
        "start": 439.0,
        "end": 452.0
    },
    {
        "text": " Y va un poquito más allá. Entonces los estados integrantes del Mercosur para poder formar parte del Mercosur tienen que ser democracia consolidadas.",
        "start": 453.0,
        "end": 462.0
    },
    {
        "text": " Por eso se dió toda la crisis con el tema de Paraguay. Por eso con las crisis políticas son cuestionadas a nivel de la región.",
        "start": 462.0,
        "end": 472.0
    },
    {
        "text": " Porque existe un conjunto de instituciones que deben funcionar con determinadas características para poder formar parte del Mercosur.",
        "start": 472.0,
        "end": 481.0
    },
    {
        "text": " Entonces si bien las dimensiones primarias son de tipo comercial, después también hay un conjunto de valores y principios que los estados partes se comprometen a respetar.",
        "start": 482.0,
        "end": 497.0
    },
    {
        "text": " Entonces con esta base fundamental de coincidencias, con este conjunto de valores que tienen que ver con sociedades democráticas, que tienen que ver con la respecto de institucional y política, que tienen que ver con los derechos humanos, que tienen que ver con el desarrollo, con el combate a la pobreza.",
        "start": 498.0,
        "end": 521.0
    },
    {
        "text": " Los países buscaron una ampliación de las dimensiones, de los mercados nacionales a través de un proceso de integración regional, donde la condición fundamental debía ser, estos en términos de la teoría, los acordes firmados, el desarrollo económico a nivel de la región con justicia social.",
        "start": 522.0,
        "end": 543.0
    },
    {
        "text": " Entonces como mecanismo tal, decir, bueno acordamos un conjunto de valores, democracia, derechos humanos, combate a la pobreza, y desarrollo, este proceso de integración a través de ampliar las fronteras comerciales,",
        "start": 544.0,
        "end": 571.0
    },
    {
        "text": " como forma de un desarrollo con equidad social, etcétera, no?",
        "start": 571.0,
        "end": 593.0
    },
    {
        "text": " Desarrollo económico con justicia social.",
        "start": 594.0,
        "end": 600.0
    },
    {
        "text": " De esta forma, el tratado de asunción del 26 de marzo del 91, tuvo como objetivo principal, la integración, a través de un par de los medios de integración,",
        "start": 600.0,
        "end": 629.0
    },
    {
        "text": " de la libre circulación, de bienes, servicios y factores productivos.",
        "start": 629.0,
        "end": 654.0
    },
    {
        "text": " Estableciendo un arancel externo común y la adopción de una política comercial común, con coordinación de políticas macroeconómicas y sectoriales.",
        "start": 654.0,
        "end": 681.0
    },
    {
        "text": " Y eso es lo que tenía que tener una harmonización de las legislaciones en esas áreas. Esto se la acuerda.",
        "start": 685.0,
        "end": 694.0
    },
    {
        "text": " En los hechos eso se dio en forma imperfecta, ¿no?",
        "start": 701.0,
        "end": 707.0
    },
    {
        "text": " ¿A ver, hay hay realidad y procesos diferentes, no?",
        "start": 715.0,
        "end": 724.0
    },
    {
        "text": " Chile todavía no había salido al resto de democráticos, ahí tenía su...",
        "start": 724.0,
        "end": 729.0
    },
    {
        "text": " Y también está la comunidad andina, y todos esos países como en ese fono aparte la comunidad andina, que son realidades también diferentes, entonces se van a generar como bloques distintos.",
        "start": 729.0,
        "end": 739.0
    },
    {
        "text": " De hecho, va a pasar tan relevante que después de algunas formas se hacen, se empiezan el proceso de adhesión y también viene...",
        "start": 740.0,
        "end": 748.0
    },
    {
        "text": " Hay otras formas de vincularse al Mercosur. Chile tiene una forma de vincularse al Mercosur, que son como socios, que hay otros procesos que van de la mano.",
        "start": 748.0,
        "end": 758.0
    },
    {
        "text": " Bueno.",
        "start": 759.0,
        "end": 761.0
    },
    {
        "text": " El proceso del Mercosur, nace con el tratado asunción, pero después van surgiendo nuevos acuerdos y se va creando institucionalmente y se va estableciendo la estructura institucional del Mercosur.",
        "start": 766.0,
        "end": 778.0
    },
    {
        "text": " Este borameno.",
        "start": 779.0,
        "end": 781.0
    },
    {
        "text": " Entonces.",
        "start": 802.0,
        "end": 804.0
    },
    {
        "text": " Luego.",
        "start": 809.0,
        "end": 811.0
    },
    {
        "text": " Es la cumbre de presidentes.",
        "start": 814.0,
        "end": 817.0
    },
    {
        "text": " De...",
        "start": 823.0,
        "end": 825.0
    },
    {
        "text": " Ouropreto.",
        "start": 826.0,
        "end": 828.0
    },
    {
        "text": " En el cual se crea o se establece la estructura institucional del Mercosur.",
        "start": 829.0,
        "end": 842.0
    },
    {
        "text": " ¿Qué es lo que este establece acá y lo que se acuerdan? ¿Fundamentalmente los instrumentos? ¿Fundamentales?",
        "start": 843.0,
        "end": 863.0
    },
    {
        "text": " ¿De política comercial?",
        "start": 864.0,
        "end": 867.0
    },
    {
        "text": " ¿Qué rigen la zona de libre comercio y la unión aduana de ganera?",
        "start": 875.0,
        "end": 879.0
    },
    {
        "text": " ¿Y qué están encabezados por este arancel exerno común?",
        "start": 881.0,
        "end": 885.0
    },
    {
        "text": " ¿Para qué tengan una idea?",
        "start": 888.0,
        "end": 890.0
    },
    {
        "text": " Esto fue en el 91 y Europreto fue en 1994, tres años después.",
        "start": 891.0,
        "end": 898.0
    },
    {
        "text": " Europreto.",
        "start": 899.0,
        "end": 901.0
    },
    {
        "text": " Europreto.",
        "start": 914.0,
        "end": 915.0
    },
    {
        "text": " Lo que establece es como una nueva etapa cuando empieza realmente el proceso de integración.",
        "start": 915.0,
        "end": 919.0
    },
    {
        "text": " El otro había sido como un anuncio de voluntades, pero se había avanzado poco en este anuncio de voluntades.",
        "start": 919.0,
        "end": 924.0
    },
    {
        "text": " Porque hasta recién fue en el 94 que se empezaron a establecer, cuáles eran los instrumentos que iban al concreto de la rancel extra no común y la libre circulación en términos comerciales y efectores, así como la zona de libre comercio y la unión aduana.",
        "start": 925.0,
        "end": 941.0
    },
    {
        "text": " ¿Sí?",
        "start": 942.0,
        "end": 943.0
    },
    {
        "text": " Lo que se pretendía con esto era decir bueno, iba a lograr su una mayor especialización entre las economías y una mayor circulación lo que permitía que cada uno de las economías ampliar a sus marcados.",
        "start": 945.0,
        "end": 957.0
    },
    {
        "text": " ¿Aprovechando también como las economías más pequeñas podían de alguna manera hacerse de la especialización o de la multiplicación de las economías más grandes?",
        "start": 958.0,
        "end": 974.0
    },
    {
        "text": " Lo que buscaba de alguna forma era aquello de aprovechar de las diferencias entre las economías más chicas y las más grandes para ampliar los marcados y también hacerse de los mayores niveles de desarrollo y trabajar hacia la convergencia.",
        "start": 975.0,
        "end": 992.0
    },
    {
        "text": " Además de la cuestión estrictamente económica, el Mercosurco-Motal, ese el acuerdo político, más importante que tienen los países en la región.",
        "start": 993.0,
        "end": 1014.0
    },
    {
        "text": " ¿Por qué con estos principios lo que creas una red de seguridad política?",
        "start": 1015.0,
        "end": 1025.0
    },
    {
        "text": " Genera las reglas de juego necesarias para que las economías puedan tener interacciones económicas y comerciales que ya existen para el desarrollo de las interacciones.",
        "start": 1025.0,
        "end": 1047.0
    },
    {
        "text": " Establece las reglas de juego, estos instrumentos para el desarrollo de las relaciones comerciales. Genero marco.",
        "start": 1056.0,
        "end": 1062.0
    },
    {
        "text": " Entrarnos inmediatamente, porque siempre tenemos dos deslices.",
        "start": 1067.0,
        "end": 1073.0
    },
    {
        "text": " Y lo que busca generar con esto es un elemento de estabilidad, porque de alguna forma lo que hace es conducir un entramado de intereses y relaciones que se genera profundizando los vínculos tanto a nivel económico como político y neutralizando las tendencias que se dan despragmentación a nivel de los países.",
        "start": 1074.0,
        "end": 1096.0
    },
    {
        "text": " De esta forma, la integración lo que va a promover es un juego de interdependencia entre las economías, ¿no?",
        "start": 1097.0,
        "end": 1110.0
    },
    {
        "text": " Que va a llevar a los diferentes agentes económicos a los actores, empresas, trabajadores, organismos públicos a moverse en un escenario común y que excede los aparatos políticos nacionales.",
        "start": 1110.0,
        "end": 1124.0
    },
    {
        "text": " Entonces, esto es que tiene un desafío a nivel de la política pública, porque yo genero un acuerdo, una serie de acuerdos que están a nivel supera nacional y que de alguna manera tengo que empezar a considerar también en los procesos de los acuerdos nacionales.",
        "start": 1125.0,
        "end": 1138.0
    },
    {
        "text": " La política nacional de alguna forma se ve acotada, pero tiene un marco diferente en el cual actuar.",
        "start": 1138.0,
        "end": 1146.0
    },
    {
        "text": " Ejemplo, la libre circulación de trabajadores, si yo tengo gente de Brasil que me viene a trabajar Uruguay, Uruguay, o se van a trabajar a Brasil, los argentinos o para guayos, como hago para cuál es la ley laboral carrije.",
        "start": 1147.0,
        "end": 1161.0
    },
    {
        "text": " ¿Cómo esa persona hace su historia laboral?",
        "start": 1162.0,
        "end": 1165.0
    },
    {
        "text": " Compartir las bases de datos de la seguridad social ha sido un proceso que se ha desatado entre quienes entre los BPS de la región, porque si yo promuevo la libre circulación también de hogar las condiciones para que aquel que trabaja en Uruguay unos años, otros años en Argentina, puede hacer su historia laboral y que le sea relativamente sencilla.",
        "start": 1167.0,
        "end": 1189.0
    },
    {
        "text": " ¿Cosas sobre las cuales no se ha avanzado? Si yo soy un trabajador y aporto por mi cobertura de salud, me voy de turista, hoy tengo que tener un seguro de salud internacional, pero podría ser que tuvieron un tema de cobertura y que se se pudiera complementar.",
        "start": 1190.0,
        "end": 1205.0
    },
    {
        "text": " Les digo grados más avanzados.",
        "start": 1206.0,
        "end": 1208.0
    },
    {
        "text": " No solamente tengo por tener la cédula del marco azul de Uruguay, que es el de Uruguay del marco azul, puedo trabajar en otro lugar, sino que podría tener derechos y obligaciones que estuvieran compartidas.",
        "start": 1213.0,
        "end": 1222.0
    },
    {
        "text": " Estoy de poner un ejemplo en el ámito laboral.",
        "start": 1223.0,
        "end": 1225.0
    },
    {
        "text": " La libre circulación de trabajadores nos pone desafíos en las más diversas áreas, por ejemplo en la formación.",
        "start": 1225.0,
        "end": 1232.0
    },
    {
        "text": " Yo me recibo como economista en Uruguay, puedo ejercer mi título en Brasil.",
        "start": 1233.0,
        "end": 1237.0
    },
    {
        "text": " Un ingeniero. ¿En qué son ingenieros ustedes?",
        "start": 1239.0,
        "end": 1244.0
    },
    {
        "text": " No, no, no, no me tienen patrátil, me informate en sistemas. ¿Civil?",
        "start": 1246.0,
        "end": 1253.0
    },
    {
        "text": " ¿Qué imica el invento? ¿Eto?",
        "start": 1255.0,
        "end": 1258.0
    },
    {
        "text": " Y hay títulos más complicados, si son contadores, si son médicos, son más...",
        "start": 1261.0,
        "end": 1267.0
    },
    {
        "text": " Las carreras nuestras son más fáciles, más fácil que nos contraten como ingenieros o como... ¿No?",
        "start": 1268.0,
        "end": 1273.0
    },
    {
        "text": " De ejemplos de las facultades conozco un montón que están trabajando en la estrategia, más que en la mía de el día.",
        "start": 1274.0,
        "end": 1279.0
    },
    {
        "text": " Mi hermano, soy ingeniero el electricista y está en Holanda.",
        "start": 1280.0,
        "end": 1283.0
    },
    {
        "text": " Hace un año en Europa. Se recibió a los días de fuerza del doctorado y trabaja.",
        "start": 1284.0,
        "end": 1289.0
    },
    {
        "text": " Pero... ¿Qué desafío tenemos? ¿Cómo hacemos para revalir los títulos?",
        "start": 1296.0,
        "end": 1300.0
    },
    {
        "text": " Y para revalir los títulos, ¿cómo hacemos que los programas sean comunes y qué carreras están?",
        "start": 1301.0,
        "end": 1308.0
    },
    {
        "text": " No solo habilitadas en el Uruguay, sino que están habilitadas a nivel de la región.",
        "start": 1308.0,
        "end": 1312.0
    },
    {
        "text": " Entonces hay un proceso de habilitación y de acreditación de la formación profesional que no es menor.",
        "start": 1313.0,
        "end": 1318.0
    },
    {
        "text": " Por eso también, eso nos toco entre la Universidad de la República y la Universidad de la República.",
        "start": 1321.0,
        "end": 1325.0
    },
    {
        "text": " Teniendo un proceso para demostrar que están los estándares para que los profesionales que regresan puedan desempeñarse o jarsar sus títulos en el proceso de integración.",
        "start": 1326.0,
        "end": 1336.0
    },
    {
        "text": " Los marcos, los procesos de acreditación ayudan mucho a esto que tiene que ver con.",
        "start": 1339.0,
        "end": 1343.0
    },
    {
        "text": " ¿Cómo hago para conformar una currícula que no solo atienda a lo que es el mercado laboral nacional, sino que al mercado laboral regional?",
        "start": 1344.0,
        "end": 1352.0
    },
    {
        "text": " ¿Asentiendes? Bien.",
        "start": 1355.0,
        "end": 1358.0
    },
    {
        "text": " Entonces, la integración lo que genera es una independencia tal donde se juntan diversos intereses y que hacen jugar a los más diversos actores.",
        "start": 1358.0,
        "end": 1372.0
    },
    {
        "text": " Entonces, de alguna forma la conformación de un mercado económico como un crea una necesidad, un espacio político como.",
        "start": 1373.0,
        "end": 1384.0
    },
    {
        "text": " Y eso es un nuevo desafío a nivel de las políticas públicas, pero también en los más diversos actores.",
        "start": 1385.0,
        "end": 1390.0
    },
    {
        "text": " A nivel de las empresas, a nivel de los trabajadores, a nivel de la formación, el ejemplo que les puse respecto a la formación universitaria porque es muy significativo respecto a eso.",
        "start": 1391.0,
        "end": 1400.0
    },
    {
        "text": " Entonces, el proceso de integración no solo repercute a los que producen a nivel nacional y les pueden competir a los que exportan, sino que repercute en las más diversas áreas de la vida de la economía nacional.",
        "start": 1402.0,
        "end": 1414.0
    },
    {
        "text": " En este contexto, los cuatro estados parte, o bueno, los cuatro, más chiles y bolivia, forman lo que se llama el mecanismo de consulta y concertación.",
        "start": 1432.0,
        "end": 1458.0
    },
    {
        "text": " Este mecanismo de consulta y concertación política se implementa como forma de consensuar posiciones respecto a la política regional.",
        "start": 1462.0,
        "end": 1485.0
    },
    {
        "text": " Y con esto es que en el año 1996 surge en la décima reunión del Mercado común en Argentina, la declaración presidencial con el gestión social.",
        "start": 1485.0,
        "end": 1514.0
    },
    {
        "text": " Y con compromiso democrático, que se tiene un protocolo donde bolivia y chiles se unen a la declaración.",
        "start": 1515.0,
        "end": 1533.0
    },
    {
        "text": " Este documento se elabora de forma tal en el cual las instituciones lo que manejan es la plena vigencia de las instituciones democráticas para los países que forman parte de este acuerdo.",
        "start": 1534.0,
        "end": 1550.0
    },
    {
        "text": " Forman un protocolo aparte porque no forma en parte, lo que van ahí formando es un proceso de integración en paralelo que tiene que cumplir determinadas etapas porque no forma en parte del acuerdo original.",
        "start": 1551.0,
        "end": 1573.0
    },
    {
        "text": " Y que se complementa el 1998 con otro acuerdo, este es el de San Luis y este es el de Usoaya.",
        "start": 1573.0,
        "end": 1585.0
    },
    {
        "text": " Lo que hace es reforzar el anterior y lo que declaran es que la existencia y la constitución de instituciones democráticas es fundamental para formar parte del bloque.",
        "start": 1585.0,
        "end": 1605.0
    },
    {
        "text": " En caso de que haya un quiebre en la cuestión de la democracia se deja de formar parte del bloque.",
        "start": 1605.0,
        "end": 1615.0
    },
    {
        "text": " Lo primero que habíamos visto en el 1991 eran las declaraciones de los valores pero no había nada que fuera un compromiso como tal.",
        "start": 1615.0,
        "end": 1622.0
    },
    {
        "text": " Lo que permitió es que al resto, si a algunos se sale de los requisitos, lo puede de alguna forma vetar.",
        "start": 1622.0,
        "end": 1631.0
    },
    {
        "text": " Junto con esto, también se firma.",
        "start": 1631.0,
        "end": 1643.0
    },
    {
        "text": " Entre Bolivia y Chile, la declaración política de zona de paz,",
        "start": 1643.0,
        "end": 1671.0
    },
    {
        "text": " entre Bolivia y Chile, porque ya tienen zona de conflicto.",
        "start": 1671.0,
        "end": 1681.0
    },
    {
        "text": " Entonces, esto fue una declaración a través de la cual los seis países, los cuatro en Mercosur, más Bolivia y Chile, se declaran como zona de paz.",
        "start": 1681.0,
        "end": 1698.0
    },
    {
        "text": " Lo que ha dado a esto, lo que firman es un compromiso de consulta y cooperación en temas de seguridad nacional, defensa.",
        "start": 1698.0,
        "end": 1727.0
    },
    {
        "text": " Este forma tal le promover la progresiva articulación y avanzar en los acordos internacionales orientados a lograr el objetivo de desar, menuclar y no proliferación de todos los aspectos.",
        "start": 1727.0,
        "end": 1741.0
    },
    {
        "text": " Cuando formemos unificar posiciones respecto a otros mecanismos sobre los cuales también participan.",
        "start": 1741.0,
        "end": 1759.0
    },
    {
        "text": " Vestacamos todos estos aspectos para que vean como trasciende todo el económico,",
        "start": 1759.0,
        "end": 1763.34
    },
    {
        "text": " no vea mucho más allá.",
        "start": 1763.34,
        "end": 1764.62
    },
    {
        "text": " Vamos ahora un poco más a los temas más del tipo económico.",
        "start": 1764.62,
        "end": 1767.62
    },
    {
        "text": " El Mercosur como tal se constituye como una unión aduana.",
        "start": 1789.0,
        "end": 1817.52
    },
    {
        "text": " Este hecho provoca cambios en las economías de la región y le diría más las que",
        "start": 1817.52,
        "end": 1840.56
    },
    {
        "text": " forman parte de las que no forman parte.",
        "start": 1840.56,
        "end": 1848.04
    },
    {
        "text": " En primer lugar, a partir de los 4 estados parte, tienen un compromiso muy fuerte.",
        "start": 1848.04,
        "end": 1859.32
    },
    {
        "text": " Y ese compromiso genera una tendencia a la disciplina conjunta de las políticas económicas",
        "start": 1859.32,
        "end": 1886.2
    },
    {
        "text": " y fundamentalmente comerciales.",
        "start": 1886.2,
        "end": 1892.6000000000001
    },
    {
        "text": " Esto no solo ofrece declaras, sino que pasa a formar parte de, ¿no?",
        "start": 1892.6000000000001,
        "end": 1899.14
    },
    {
        "text": " Debería generar conductas que fueran previsible y que no perjudicaran a los estados parte, a los",
        "start": 1899.14,
        "end": 1906.8
    },
    {
        "text": " socios.",
        "start": 1906.8,
        "end": 1912.3999999999999
    },
    {
        "text": " Esto es como en primer lugar.",
        "start": 1912.3999999999999,
        "end": 1914.36
    },
    {
        "text": " En segundo lugar, existe un arance el externo común.",
        "start": 1914.36,
        "end": 1924.18
    },
    {
        "text": " Entonces, de alguna manera, surge la necesidad de eventuales modificaciones a los niveles",
        "start": 1924.18,
        "end": 1931.44
    },
    {
        "text": " de protección en sectores productivos que deban ser consensuados cuatro y partidamente,",
        "start": 1931.44,
        "end": 1938.44
    },
    {
        "text": " imponiendo así un nuevo estilo a las políticas comerciales nacionales.",
        "start": 1938.44,
        "end": 1945.72
    },
    {
        "text": " Hay una revisión de las políticas existentes porque existen nuevas condiciones que se imponen",
        "start": 1945.72,
        "end": 1951.52
    },
    {
        "text": " a las políticas nacionales, las cuales deben ser menos digresionales y más coordinadas",
        "start": 1951.52,
        "end": 1958.6000000000001
    },
    {
        "text": " entre los estados partes.",
        "start": 1958.6,
        "end": 1964.48
    },
    {
        "text": " Generando mayor certidumbre y más previsible a nivel de las agentes económicos, ¿no?",
        "start": 1964.48,
        "end": 1972.36
    },
    {
        "text": " Y de la región.",
        "start": 1972.36,
        "end": 1982.1599999999999
    },
    {
        "text": " Por eso de alguna forma, se pasa a formar parte de estos procesos, o cuando se adoptan medidas",
        "start": 1982.16,
        "end": 1990.24
    },
    {
        "text": " de política económica, también lo que hay que ver es cuáles son las consecuencias.",
        "start": 1990.24,
        "end": 1994.72
    },
    {
        "text": " No para todos, una medida de política económica, una medida de política pública, es igual, siempre",
        "start": 1994.72,
        "end": 1999.68
    },
    {
        "text": " y ganadores y paredadores, siempre hay algunos que sacrifican a algo que ganan.",
        "start": 1999.68,
        "end": 2004.64
    },
    {
        "text": " Y de ese en términos de los sectores, no fue para todos beneficiosos, esto que para",
        "start": 2004.64,
        "end": 2012.2
    },
    {
        "text": " algunos no lo fue.",
        "start": 2012.2,
        "end": 2013.92
    },
    {
        "text": " Y de hecho, en Uruguay hubo un modelo muy cambio de las estructuras sectoriales.",
        "start": 2013.92,
        "end": 2019.88
    },
    {
        "text": " Hay una procesos fuerte de industrialización, de desarrollo de los servicios, terminó",
        "start": 2019.88,
        "end": 2027.8000000000002
    },
    {
        "text": " repercutiendo, que se da junto con otro conjunto de medidas de nivel de política económica.",
        "start": 2027.8,
        "end": 2035.48
    },
    {
        "text": " Hay un ejemplo que se les ocurra de la década de los 90, que les hayan contado, que",
        "start": 2035.48,
        "end": 2040.08
    },
    {
        "text": " sepan, que de alguna manera sucede el proceso de integración.",
        "start": 2040.08,
        "end": 2045.84
    },
    {
        "text": " Esa va a poner un ejemplo, que ahora está reactivo de nuevo.",
        "start": 2045.84,
        "end": 2056.96
    },
    {
        "text": " El desarrollo de la caña azúcar en Uruguay, ustedes saben que es sumamente protegido.",
        "start": 2056.96,
        "end": 2061.96
    },
    {
        "text": " De hecho, la caña azúcar, si se analiza en Uruguay, no es viable.",
        "start": 2061.96,
        "end": 2067.08
    },
    {
        "text": " Si no es protegido, como no es de muchos lugares, no es un cultivo ni una industria que",
        "start": 2067.08,
        "end": 2072.2400000000002
    },
    {
        "text": " sea viable.",
        "start": 2072.2400000000002,
        "end": 2074.44
    },
    {
        "text": " Pero fue un foco de desarrollo muy fuerte a nivel de regional sobre todo en la zona de",
        "start": 2074.44,
        "end": 2080.56
    },
    {
        "text": " la caña de la caña de Uruguay.",
        "start": 2080.56,
        "end": 2082.56
    },
    {
        "text": " Y que tuvo su auge y que la década de los 90, casi desaparece de la caña de Uruguay.",
        "start": 2082.56,
        "end": 2089.56
    },
    {
        "text": " Hasta el 2005 por ahí, se decían a la caña de Uruguay, una tristeza, unos niveles de desempleo,",
        "start": 2089.56,
        "end": 2096.84
    },
    {
        "text": " tuvo su auge y después, cuando se empezó a competir, la azúcar brasileira era muchísima,",
        "start": 2096.84,
        "end": 2104.08
    },
    {
        "text": " más grata, no había forma de competir.",
        "start": 2104.08,
        "end": 2106.84
    },
    {
        "text": " El auge de nuevo fue por una medida fuerte de subsidios a esa zona donde hay todo un sistema",
        "start": 2106.84,
        "end": 2112.28
    },
    {
        "text": " de cultivos muy orientado por la empresa por alur, ¿no?",
        "start": 2112.28,
        "end": 2121.88
    },
    {
        "text": " Y que tiene todo un sistema de estigación de precios a los productores que de alguna",
        "start": 2121.88,
        "end": 2128.4
    },
    {
        "text": " forma reactivo de la caña.",
        "start": 2128.4,
        "end": 2130.88
    },
    {
        "text": " Pero si se careciera de esa, yo no estoy poniendo que si es bueno ni es malo, digo cómo",
        "start": 2130.88,
        "end": 2135.56
    },
    {
        "text": " funciona, y realmente, cambió notablemente y si ustedes van al líneo de bellaunión,",
        "start": 2135.56,
        "end": 2143.08
    },
    {
        "text": " puede irte en bellaun, bueno, si ustedes se acercan, tienen unos sistemas de riego y",
        "start": 2143.08,
        "end": 2147.68
    },
    {
        "text": " un modelo que está caminando por los campos el Andesio por bellauniones como lo mismo,",
        "start": 2147.68,
        "end": 2153.96
    },
    {
        "text": " es de una tecnología notable.",
        "start": 2153.96,
        "end": 2158.04
    },
    {
        "text": " Pero si se careciera de todo ese dispositivo, esa herramienta y bueno, parecería bravo",
        "start": 2159.04,
        "end": 2165.64
    },
    {
        "text": " que pudiera competir.",
        "start": 2165.64,
        "end": 2168.72
    },
    {
        "text": " Eso fue un ejemplo puntual y podemos seguir con otras industrias, con las que pasan a",
        "start": 2168.72,
        "end": 2175.2799999999997
    },
    {
        "text": " más o menos lo mismo y que, bueno, tuvieron un fuerte proceso.",
        "start": 2175.2799999999997,
        "end": 2178.24
    },
    {
        "text": " Hay toda una lógica después de las empresas que fueron recuperadas con los trabajadores",
        "start": 2178.24,
        "end": 2182.56
    },
    {
        "text": " que ahora el fónde se creó con esto, el fondo de desarrollo.",
        "start": 2182.56,
        "end": 2187.32
    },
    {
        "text": " El fondo de lo que se creó fue para apoyar todas las empresas que son las empresas",
        "start": 2187.32,
        "end": 2192.16
    },
    {
        "text": " recuperadas.",
        "start": 2192.16,
        "end": 2193.16
    },
    {
        "text": " Fueron a esas empresas que se fundieron y que pasaron a hacer autogestionadas por parte",
        "start": 2193.16,
        "end": 2198.24
    },
    {
        "text": " de los trabajadores.",
        "start": 2198.24,
        "end": 2200.04
    },
    {
        "text": " Cristalerías no fueron procesos automáticos, muchos de estos empezaron y se fueron",
        "start": 2200.04,
        "end": 2205.72
    },
    {
        "text": " generando en los 90 y terminaron los 2000.",
        "start": 2205.72,
        "end": 2210.72
    },
    {
        "text": " Funza, que ahora se llama funza, copo, cooperativa, funza, cooperativa.",
        "start": 2210.72,
        "end": 2217.72
    },
    {
        "text": " Cristalerías de Uruguay, voy otra.",
        "start": 2217.72,
        "end": 2221.04
    },
    {
        "text": " Tengo varios ejemplos que podríamos, hay en las más diversas áreas de imprentas,",
        "start": 2221.04,
        "end": 2225.9199999999996
    },
    {
        "text": " también en Vella Unión hay varias también.",
        "start": 2225.92,
        "end": 2234.32
    },
    {
        "text": " Pero el fondo es lo que fue, es un fondo que se crea con las ganancias que tienen el",
        "start": 2234.32,
        "end": 2238.8
    },
    {
        "text": " banco república y lo que se hace es prestar con fines sociales para promover las empresas",
        "start": 2238.8,
        "end": 2244.0
    },
    {
        "text": " autogestionadas.",
        "start": 2244.0,
        "end": 2245.76
    },
    {
        "text": " Lo que en teoría sosempresas de presentar es un proyecto que sea viable económicamente",
        "start": 2245.76,
        "end": 2251.16
    },
    {
        "text": " y hay varias discusiones porque en algún momento se dice que no son del todo viable",
        "start": 2251.16,
        "end": 2255.64
    },
    {
        "text": " así que en realidad sin el apoyo estatal no terminan siendo.",
        "start": 2255.64,
        "end": 2258.72
    },
    {
        "text": " Entonces, la discusión es prioritario para mantener las fuentes de empleo o es necesario",
        "start": 2258.72,
        "end": 2264.7999999999997
    },
    {
        "text": " la discusión que se puede, las posiciones se encontradas y se mueven.",
        "start": 2264.7999999999997,
        "end": 2268.4
    },
    {
        "text": " No, es bueno y es viable solo por el hecho de que mantiene las fuentes de empleo.",
        "start": 2268.4,
        "end": 2273.68
    },
    {
        "text": " A otros que dicen no, las empresas tienen que en algún manera llevar un momento que",
        "start": 2273.68,
        "end": 2277.6
    },
    {
        "text": " salgan de la protección del Estado y poder realmente competir con otras privadas.",
        "start": 2277.6,
        "end": 2283.0
    },
    {
        "text": " Entonces, las posiciones a veces se encontradas.",
        "start": 2283.0,
        "end": 2286.8
    },
    {
        "text": " Muchos de estos modelos fueron a través de cooperativos.",
        "start": 2286.8,
        "end": 2290.48
    },
    {
        "text": " Pero también esto fue en un proceso que nosotros vamos a ver más en detalle la semana que",
        "start": 2290.48,
        "end": 2294.32
    },
    {
        "text": " viene cuando vamos en Uruguay y nos dediquemos un rato a ver cuál fue la política la",
        "start": 2294.32,
        "end": 2299.96
    },
    {
        "text": " caja en el 90 procedió en el proceso de almercosegando.",
        "start": 2299.96,
        "end": 2305.2
    },
    {
        "text": " Bueno, lo otro es que esta política comercial de integración",
        "start": 2305.2,
        "end": 2329.4
    },
    {
        "text": " y que se la haran selectarnos común y las libres barreas en derregión, tiende a fortalecer",
        "start": 2329.4,
        "end": 2338.2400000000002
    },
    {
        "text": " o va de la mano con los procesos de apertura e incerción internacional.",
        "start": 2338.24,
        "end": 2366.4799999999996
    },
    {
        "text": " El Mercosurco, como tal, no fue una política para aislarse, sino que por el contrario",
        "start": 2366.48,
        "end": 2376.36
    },
    {
        "text": " fue una política para generar una cobertura para fortalecerse para que la región pudiera",
        "start": 2376.36,
        "end": 2382.72
    },
    {
        "text": " tener mejores condiciones para seguir el proceso de integración regional.",
        "start": 2382.72,
        "end": 2400.2799999999997
    },
    {
        "text": " Para estar mejores condiciones para poder adecuarse el proceso de incerción internacional.",
        "start": 2400.2799999999997,
        "end": 2406.4399999999996
    },
    {
        "text": " De ese punto fue relativamente exitoso y hoy a nivel del mundo entero las empresas",
        "start": 2406.44,
        "end": 2420.92
    },
    {
        "text": " de todo el mundo consideran el Mercosur.",
        "start": 2420.92,
        "end": 2432.7200000000003
    },
    {
        "text": " Ahora vamos a parte de la agenda a nivel internacional.",
        "start": 2432.72,
        "end": 2455.3599999999997
    },
    {
        "text": " Están la agenda de los más diversas empresas en el mundo porque la libre circulación en",
        "start": 2455.3599999999997,
        "end": 2460.48
    },
    {
        "text": " la región permite que al entrar en un país considera el mercado de la región.",
        "start": 2460.48,
        "end": 2465.64
    },
    {
        "text": " Yo me instalo en Uruguay y automáticamente el mercado de Brasil, para guay y argentina.",
        "start": 2465.64,
        "end": 2475.44
    },
    {
        "text": " Muchas veces se instalan para vender en la región o aprovechan determinados beneficios",
        "start": 2475.44,
        "end": 2481.16
    },
    {
        "text": " fiscales que hay.",
        "start": 2481.16,
        "end": 2482.64
    },
    {
        "text": " Yo me instalo en una zona franca en Uruguay, en un parque industrial en Uruguay, pero",
        "start": 2482.64,
        "end": 2488.56
    },
    {
        "text": " mi destino es producir para la región.",
        "start": 2488.56,
        "end": 2493.08
    },
    {
        "text": " Por eso, cuando Uruguay 21, ¿qué saben que es Uruguay 21?",
        "start": 2493.08,
        "end": 2500.8799999999997
    },
    {
        "text": " Uruguay 21 es una agencia que funciona como una para estatal para la promoción de inversiones",
        "start": 2500.88,
        "end": 2515.12
    },
    {
        "text": " y exportaciones que hay en la ciudad viaja.",
        "start": 2515.12,
        "end": 2521.6400000000003
    },
    {
        "text": " Entonces, si ustedes buscan Uruguay 21, van a ver que tienen todas las por qué hay que",
        "start": 2521.6400000000003,
        "end": 2526.88
    },
    {
        "text": " invertir en Uruguay.",
        "start": 2526.88,
        "end": 2529.6
    },
    {
        "text": " Entonces, porque Uruguay tiene, como estabilidad política, porque Uruguay tiene instituciones",
        "start": 2529.6,
        "end": 2534.24
    },
    {
        "text": " claras, ha venido en un proceso de crecimiento.",
        "start": 2534.24,
        "end": 2537.16
    },
    {
        "text": " Tiene niveles de bienestar importante, tiene determinadas condiciones para la promoción",
        "start": 2537.16,
        "end": 2541.36
    },
    {
        "text": " de la inversión y entre los systems es la puerta de entrada del Mercosur.",
        "start": 2541.36,
        "end": 2545.4
    },
    {
        "text": " Forma parte del Mercosur y entonces el mercado no es solo los 3 millones que somos nosotros,",
        "start": 2545.4,
        "end": 2550.16
    },
    {
        "text": " ni la 170, 16 mil kilómetros cuadrados.",
        "start": 2550.16,
        "end": 2553.16
    },
    {
        "text": " Estamos mucho más.",
        "start": 2553.16,
        "end": 2558.2
    },
    {
        "text": " Y básicamente, ponen el Mercosur como una de los atractivos para entrar en la región.",
        "start": 2558.2,
        "end": 2564.3999999999996
    },
    {
        "text": " Y además, como por la ubicación geográfica estratégica, y por los puertos en la logística",
        "start": 2564.3999999999996,
        "end": 2568.72
    },
    {
        "text": " de la región, digamos que funcionan.",
        "start": 2568.72,
        "end": 2574.08
    },
    {
        "text": " El crecimiento de la economía también ha saturado la cuestión logística, uno de los",
        "start": 2574.08,
        "end": 2577.7599999999998
    },
    {
        "text": " desafíos que tiene Uruguay para el crecimiento de la producción, no hoy, es acompañar",
        "start": 2577.7599999999998,
        "end": 2582.0
    },
    {
        "text": " con la estructura logística.",
        "start": 2582.0,
        "end": 2583.96
    },
    {
        "text": " Por eso la importancia del tren, porque el tren abarata enormemente los costos de transporte,",
        "start": 2583.96,
        "end": 2590.08
    },
    {
        "text": " traer granosa camión, traer granosa en tren, cuántos camiones son cinco vagones o madera.",
        "start": 2590.08,
        "end": 2598.04
    },
    {
        "text": " Y después lo otro que si ustedes comparan a nivel de costos, por ejemplo, el puerto de",
        "start": 2598.04,
        "end": 2607.04
    },
    {
        "text": " Montevideo está una ubicación estratégica, ha tenido un crecimiento que era notable",
        "start": 2607.04,
        "end": 2612.6
    },
    {
        "text": " si ustedes se me acuerdo hace cuando era chiga, estaba el puerto y era otra la realidad",
        "start": 2612.6,
        "end": 2617.1
    },
    {
        "text": " con lo que uno ve hoy, pero también se está pretando, ¿no?",
        "start": 2617.1,
        "end": 2619.8
    },
    {
        "text": " Entonces, por eso el puerto se está expandiendo.",
        "start": 2619.8,
        "end": 2622.56
    },
    {
        "text": " Y también es cierto que ha aumentado mucho los costos.",
        "start": 2622.56,
        "end": 2626.0
    },
    {
        "text": " Tener un contenedor hoy en el puerto, el aumento del año pasado este año, me estuve",
        "start": 2626.0,
        "end": 2632.96
    },
    {
        "text": " viendo el día, pero es costoso.",
        "start": 2632.96,
        "end": 2636.92
    },
    {
        "text": " Nosotros tenemos un tema de costos que nos está aprendiendo en tema de la competitividad",
        "start": 2636.92,
        "end": 2640.56
    },
    {
        "text": " y se está sintiendo.",
        "start": 2640.56,
        "end": 2642.56
    },
    {
        "text": " Eso es un poco de los desafíos que hay.",
        "start": 2642.56,
        "end": 2644.2400000000002
    },
    {
        "text": " Y como me adelanto un poco la semana pasada, pero la preocupación grande hoy a nivel",
        "start": 2644.2400000000002,
        "end": 2648.84
    },
    {
        "text": " macroeconómico, el año pasado está centrada en el leficifical en los ajustes de crecimiento",
        "start": 2648.84,
        "end": 2654.8
    },
    {
        "text": " y en inflación.",
        "start": 2654.8,
        "end": 2655.8
    },
    {
        "text": " Este año está en el empleo, porque el empleo no se ha reactivado al igual que se ha visto",
        "start": 2655.8,
        "end": 2661.04
    },
    {
        "text": " la reactivación económica, que además no se ha dado en forma uniforme en todos los",
        "start": 2661.04,
        "end": 2664.88
    },
    {
        "text": " sectores.",
        "start": 2664.88,
        "end": 2665.88
    },
    {
        "text": " Entonces hay sectores que son relevantes que están comprometidos.",
        "start": 2665.88,
        "end": 2670.2
    },
    {
        "text": " Bien.",
        "start": 2670.2,
        "end": 2672.2
    },
    {
        "text": " Bueno.",
        "start": 2672.2,
        "end": 2673.2
    },
    {
        "text": " El otro elemento es el tema de la inversión en términos que hay una baja en el riesgo",
        "start": 2673.2,
        "end": 2690.36
    },
    {
        "text": " de la inversión en el riesgo, ya que hay políticas que están acordadas y mucho más",
        "start": 2690.36,
        "end": 2697.08
    },
    {
        "text": " previsible.",
        "start": 2697.08,
        "end": 2698.08
    },
    {
        "text": " Los países tienen mayor compromiso porque están comprometidos a nivel de acuerdo internacional",
        "start": 2698.08,
        "end": 2706.48
    },
    {
        "text": " con lo vecino, generando una certidumbre sobre la estructura arancelaria, sobre el no",
        "start": 2706.48,
        "end": 2713.1600000000003
    },
    {
        "text": " el asionamiento de los flujos comerciales internacionales.",
        "start": 2713.1600000000003,
        "end": 2717.08
    },
    {
        "text": " Entonces, lo de eso genera un salto cualitativo en términos de lo adractivo que pasa a ser la",
        "start": 2717.08,
        "end": 2721.7599999999998
    },
    {
        "text": " región para el resto del mundo, porque le da una seguridad al marco institucional que",
        "start": 2721.7599999999998,
        "end": 2728.56
    },
    {
        "text": " hay en la región.",
        "start": 2728.56,
        "end": 2729.56
    },
    {
        "text": " Es decir, bueno, no va a ser tan fácil invertir en Argentina y que me cambia todo la",
        "start": 2729.56,
        "end": 2734.64
    },
    {
        "text": " media porque forma parte del marco sur y tiene unos compromisos asumidos que de alguna manera",
        "start": 2734.64,
        "end": 2739.24
    },
    {
        "text": " respalda.",
        "start": 2739.24,
        "end": 2740.24
    },
    {
        "text": " No quiere decir que no hagas el logre salir después, pero en los hechos, las regiones",
        "start": 2740.24,
        "end": 2744.4
    },
    {
        "text": " más seguras.",
        "start": 2744.4,
        "end": 2745.4
    },
    {
        "text": " Las empresas en las regionales y extra regionales pueden aprovechar esta mayor certidumbre",
        "start": 2746.4,
        "end": 2756.04
    },
    {
        "text": " para invertir en la región.",
        "start": 2756.04,
        "end": 2758.7200000000003
    },
    {
        "text": " No solamente los beneficios de la nueva política comercial y como han pido el mercado, sino",
        "start": 2758.7200000000003,
        "end": 2762.52
    },
    {
        "text": " que el marco institucional parece ser más estable.",
        "start": 2762.52,
        "end": 2771.52
    },
    {
        "text": " Enculado a esto, uno de los principales objetivos del marco sur es también la captación",
        "start": 2771.52,
        "end": 2777.96
    },
    {
        "text": " de inversiones.",
        "start": 2777.96,
        "end": 2779.96
    },
    {
        "text": " Generar toda esta estructura es una forma un incentivo a captar inversiones desde otros",
        "start": 2779.96,
        "end": 2785.48
    },
    {
        "text": " lugares en el mundo.",
        "start": 2785.48,
        "end": 2786.48
    },
    {
        "text": " Uruguay 21 les comenté por el ejemplo que puse.",
        "start": 2793.12,
        "end": 2796.44
    },
    {
        "text": " Uruguay 21 es un organismo, es del Estado, es una institución que tiene una forma de para",
        "start": 2796.44,
        "end": 2804.12
    },
    {
        "text": " estatal, pero que depende mucho del ministerio de relaciones y estereores y el Ministerio",
        "start": 2804.12,
        "end": 2809.12
    },
    {
        "text": " Economía y lo que hace es la promoción de inversiones.",
        "start": 2809.12,
        "end": 2812.48
    },
    {
        "text": " Y de, pero como tal, lo que hace por ejemplo es capacitar empresas para que puedan invertir",
        "start": 2812.48,
        "end": 2820.16
    },
    {
        "text": " en la salida al extranjero esportar, vender sus productos.",
        "start": 2820.16,
        "end": 2824.6
    },
    {
        "text": " Genera rondas de negocios y visitas, por ejemplo, el que organiza todas las visitas comerciales.",
        "start": 2826.44,
        "end": 2831.68
    },
    {
        "text": " Cuando fueron a China, acertó a la promoción de inversiones chinas en Uruguay y a generar",
        "start": 2831.68,
        "end": 2836.44
    },
    {
        "text": " exportaciones, el que organiza ese evento es Uruguay 21.",
        "start": 2836.44,
        "end": 2840.28
    },
    {
        "text": " Muy asociado a la cancillería porque aparte el país despleado en el mundo, esta través",
        "start": 2840.28,
        "end": 2845.16
    },
    {
        "text": " de las embajadas al Ministerio de Economía y después a los ministerios sectoriales que",
        "start": 2845.16,
        "end": 2850.48
    },
    {
        "text": " son los que tienen competencia.",
        "start": 2850.48,
        "end": 2851.88
    },
    {
        "text": " Si yo quiero ir a promover la venta de soja, carne y arroz en China y el Ministerio",
        "start": 2851.88,
        "end": 2858.12
    },
    {
        "text": " de Banadaria tiene que ver.",
        "start": 2858.12,
        "end": 2860.08
    },
    {
        "text": " Si quiero ir con alguna cuestión industrial, también si quiero traer inversiones para",
        "start": 2860.08,
        "end": 2864.84
    },
    {
        "text": " los temas energéticos, no entonces articula mucho con las instituciones nacionales, pero",
        "start": 2864.84,
        "end": 2870.7200000000003
    },
    {
        "text": " tiene un conjunto de programas destinados a apoyar la participación en ferias internacionales",
        "start": 2870.7200000000003,
        "end": 2877.08
    },
    {
        "text": " que se hacen un stand in Uruguay, generan agendas con empresarios, buscando oportunidades",
        "start": 2877.08,
        "end": 2882.6
    },
    {
        "text": " de negocio.",
        "start": 2882.6,
        "end": 2883.6
    },
    {
        "text": " Se ha de inversiones extranjeras en Uruguay o sea de exportaciones, pero tiene una cuestión",
        "start": 2883.6,
        "end": 2889.68
    },
    {
        "text": " muy de acompañamiento.",
        "start": 2889.68,
        "end": 2891.92
    },
    {
        "text": " Podías mejorarse, pero realmente ha estado algo que tenía una evolución interesante.",
        "start": 2891.92,
        "end": 2898.12
    },
    {
        "text": " Y si quieren leer muchas de estas cosas pueden entrar que hay muy buenos análisis y",
        "start": 2898.12,
        "end": 2902.2799999999997
    },
    {
        "text": " muy sencillos, muy didácticos y hay mucho curso de capacitación y internacionalización",
        "start": 2902.28,
        "end": 2907.52
    },
    {
        "text": " de empresas y de manejo de redes.",
        "start": 2907.52,
        "end": 2911.6000000000004
    },
    {
        "text": " Manejan buenas estadísticas.",
        "start": 2911.6000000000004,
        "end": 2914.44
    },
    {
        "text": " Tienen materiales armados por ejemplo la guía de inversión en Uruguay.",
        "start": 2914.44,
        "end": 2918.6400000000003
    },
    {
        "text": " Si yo imagínense cualquiera, un extranjero que quiere empezar a instalar una fábrica acá",
        "start": 2918.6400000000003,
        "end": 2924.84
    },
    {
        "text": " y empezar a vender para Uruguay en la región tiene una manual donde más o menos te dice",
        "start": 2924.84,
        "end": 2930.84
    },
    {
        "text": " que trámite, es que hacer, cuál es el costo, cuáles son las características de las",
        "start": 2930.84,
        "end": 2936.32
    },
    {
        "text": " leyes laborales.",
        "start": 2936.32,
        "end": 2937.32
    },
    {
        "text": " Los inversores siempre te hacen preguntas como muy claras, cuáles son los beneficios en",
        "start": 2937.32,
        "end": 2941.84
    },
    {
        "text": " que me va a apoyar el estaduro-guayo, cuáles son los costos y la normativa de mano de obra,",
        "start": 2941.84,
        "end": 2949.36
    },
    {
        "text": " existirá posibilidad acceder a algún tarreno público.",
        "start": 2949.36,
        "end": 2953.0
    },
    {
        "text": " Hay un montón de preguntas que se repiten, pero básicamente vienen por ahí.",
        "start": 2953.0,
        "end": 2956.7200000000003
    },
    {
        "text": " Es que trámite tengo que hacer como creer una empresa, como puedo mover dineros, ¿sí?",
        "start": 2956.72,
        "end": 2963.7999999999997
    },
    {
        "text": " ¿Cómo puede traer trabajadores del exterior?",
        "start": 2963.7999999999997,
        "end": 2966.08
    },
    {
        "text": " Entonces te van a decir no, puede traer un porcentaje.",
        "start": 2966.08,
        "end": 2970.08
    },
    {
        "text": " No puede traer todos.",
        "start": 2970.08,
        "end": 2972.12
    },
    {
        "text": " Si quiero hacer un puerto chino, no puede traer tof chino.",
        "start": 2972.12,
        "end": 2976.48
    },
    {
        "text": " Te voy a tener un porcentaje.",
        "start": 2976.48,
        "end": 2977.7599999999998
    },
    {
        "text": " Ahora estoy como en el proceso.",
        "start": 2977.76,
        "end": 2984.1600000000003
    },
    {
        "text": " Esto, yo lo he mencionado como un ejemplo de que existía esta institucionalidad.",
        "start": 2984.1600000000003,
        "end": 2988.5600000000004
    },
    {
        "text": " Ahora lo que decimos es, el proceso del Mercosur en temas económicos, estamos, tuvo un objetivo",
        "start": 2988.5600000000004,
        "end": 2996.92
    },
    {
        "text": " claro de la ración de decir, queremos traer inversiones, que exista un acuerdo de estas",
        "start": 2996.92,
        "end": 3002.96
    },
    {
        "text": " características, puede ser un instrumento fundamental para que, de otros lados del mundo,",
        "start": 3002.96,
        "end": 3007.7400000000002
    },
    {
        "text": " inviertan en el Mercosur.",
        "start": 3007.74,
        "end": 3010.06
    },
    {
        "text": " ¿Sí?",
        "start": 3010.06,
        "end": 3011.06
    },
    {
        "text": " Uno de los objetivos centrales es promover inversiones.",
        "start": 3011.06,
        "end": 3021.2599999999998
    },
    {
        "text": " ¿Qué se dan esta época?",
        "start": 3021.2599999999998,
        "end": 3022.5
    },
    {
        "text": " Se da un proceso muy fuerte, de mayor competencia a nivel internacional.",
        "start": 3022.5,
        "end": 3027.2999999999997
    },
    {
        "text": " Entonces, lo que se busca es, ¿cuáles son los instrumentos que se pueden desarrollar",
        "start": 3027.2999999999997,
        "end": 3031.7
    },
    {
        "text": " para que determinadas regiones sean atractivas para la tracción de inversiones?",
        "start": 3031.7,
        "end": 3036.74
    },
    {
        "text": " Hay un proceso reciente fuerte de inversiones en América Latina.",
        "start": 3037.58,
        "end": 3042.02
    },
    {
        "text": " La crisis financiera global posicionó mejor América Latina porque lo hizo un destino interesante",
        "start": 3042.02,
        "end": 3048.8999999999996
    },
    {
        "text": " de inversiones.",
        "start": 3048.8999999999996,
        "end": 3051.3799999999997
    },
    {
        "text": " Para los chinos que están creciendo, saliendo al mundo, América Latina ha sido un destino",
        "start": 3051.3799999999997,
        "end": 3054.9799999999996
    },
    {
        "text": " importante y han querido invertir en grandes volúmenes en infraestructura.",
        "start": 3054.9799999999996,
        "end": 3058.74
    },
    {
        "text": " Entonces, ahí hay como una lógica de ganar ganar.",
        "start": 3058.74,
        "end": 3062.22
    },
    {
        "text": " En el precuando se mantenga determinada institucionalidad y determinada soberanía de los países.",
        "start": 3062.22,
        "end": 3068.02
    },
    {
        "text": " Por eso eso se regula mucho.",
        "start": 3068.02,
        "end": 3070.02
    },
    {
        "text": " El tema de la extranjerización de la tierra, el tema de qué condiciones sean la infraestructura,",
        "start": 3070.02,
        "end": 3074.5
    },
    {
        "text": " las estándar las internacionales juegan mucho.",
        "start": 3074.5,
        "end": 3077.7799999999997
    },
    {
        "text": " El cuidado ambiental juega mucho, que no funciona en como una lógica de invertir para sacar",
        "start": 3077.7799999999997,
        "end": 3083.14
    },
    {
        "text": " beneficios para las economías.",
        "start": 3083.14,
        "end": 3085.8599999999997
    },
    {
        "text": " Hay un proceso que sea, por ejemplo, en Áxrica donde hay una especie de inversión enorme",
        "start": 3085.8599999999997,
        "end": 3090.66
    },
    {
        "text": " en China, pero que en realidad es casi un proceso colonizador como tuvieron los europeos,",
        "start": 3090.66,
        "end": 3097.46
    },
    {
        "text": " sacan los mejores beneficios, pero por otro lado se ha aprovechado de las infraestructuras",
        "start": 3097.46,
        "end": 3102.74
    },
    {
        "text": " que crean para poder realizar sus actividades.",
        "start": 3102.74,
        "end": 3105.5
    },
    {
        "text": " América Latina, como que ha intentado posicionarse diferente.",
        "start": 3105.5,
        "end": 3111.14
    },
    {
        "text": " A pesar de todas las dificultades que tuvo el Mercosur y de las internas y de los momentos",
        "start": 3111.14,
        "end": 3127.3399999999997
    },
    {
        "text": " que tenemos de íntimos amigos y los momentos de crisis, el Mercosur ha sido exitoso en",
        "start": 3127.3399999999997,
        "end": 3133.52
    },
    {
        "text": " la recepción de inversiones.",
        "start": 3133.52,
        "end": 3134.8199999999997
    },
    {
        "text": " Si se ven los indicadores, realmente ha sido un instrumento que ha servido y ha sido",
        "start": 3134.82,
        "end": 3139.5800000000004
    },
    {
        "text": " atractivo.",
        "start": 3139.5800000000004,
        "end": 3140.5800000000004
    },
    {
        "text": " Y básicamente, una de los aspectos que se han destacado es no sólo ha sido un mercado",
        "start": 3140.5800000000004,
        "end": 3147.94
    },
    {
        "text": " que ha sido ampliado, sino que ha generado mayores capacidades de negociación y mayores",
        "start": 3147.94,
        "end": 3152.1200000000003
    },
    {
        "text": " flexibilidades en los diferentes mecanismos instrumentos que tienen los estados de forma",
        "start": 3152.1200000000003,
        "end": 3158.38
    },
    {
        "text": " tal de promover y de facilitar las inversiones.",
        "start": 3158.38,
        "end": 3163.3
    },
    {
        "text": " Y también de alguna forma, esto es lo que ha ayudado a que se mantengan el resto de los",
        "start": 3163.3,
        "end": 3174.42
    },
    {
        "text": " acordos en los temas comerciales que a veces son los más sensibles porque es donde generamos",
        "start": 3174.42,
        "end": 3178.1000000000004
    },
    {
        "text": " mayores contradicciones.",
        "start": 3178.1000000000004,
        "end": 3179.7000000000003
    },
    {
        "text": " Trabajan en el tema de la unión advanera es el tema más difícil, porque en las internas",
        "start": 3179.7000000000003,
        "end": 3185.38
    },
    {
        "text": " de los países siempre hay presiones.",
        "start": 3185.38,
        "end": 3187.78
    },
    {
        "text": " De terminados sectores y ex sectores que tienen mayores hay pesos políticos o que forman",
        "start": 3188.5,
        "end": 3193.0600000000004
    },
    {
        "text": " parte de las télites políticas, pero de alguna manera el éxito en los temas de inversiones",
        "start": 3193.0600000000004,
        "end": 3198.02
    },
    {
        "text": " es lo que ha ayudado más a que hay los temas más difíciles o más que generan más",
        "start": 3198.02,
        "end": 3202.98
    },
    {
        "text": " respíces que todas las comerciales se han definido.",
        "start": 3202.98,
        "end": 3206.02
    },
    {
        "text": " Lo que sí se acordó el Mercosur es generar como un plazos para ir avanzando los procesos",
        "start": 3206.02,
        "end": 3211.02
    },
    {
        "text": " de integración.",
        "start": 3211.02,
        "end": 3212.02
    },
    {
        "text": " Entonces, para el logro de las temas de unión adanera, hay más avía plazos acordados.",
        "start": 3212.02,
        "end": 3216.34
    },
    {
        "text": " Desde el trado de asunción, casi que en el año 2000 se hace lo que se llama el",
        "start": 3217.2200000000003,
        "end": 3226.26
    },
    {
        "text": " relanzamiento del Mercosur.",
        "start": 3226.26,
        "end": 3232.54
    },
    {
        "text": " Y ¿qué coincide los años 2000 más o menos en esa época?",
        "start": 3235.58,
        "end": 3238.5
    },
    {
        "text": " La crisis en la región, Brasil había devaluado en el 98, Argentina de Valuán",
        "start": 3239.5,
        "end": 3248.74
    },
    {
        "text": " diciembre del 2001, nosotros en junio en 2002, estaba complicadísimo, estábamos",
        "start": 3248.74,
        "end": 3252.98
    },
    {
        "text": " tomados menos la misma, ¿no?",
        "start": 3252.98,
        "end": 3254.74
    },
    {
        "text": " Los planes de estabilidad de una de los 90 se habían desplomado.",
        "start": 3254.74,
        "end": 3258.86
    },
    {
        "text": " El objetivo era retomar la unión advanera.",
        "start": 3258.86,
        "end": 3263.38
    },
    {
        "text": " Y también se da justamente con un proceso de cambios de los gobiernos en la región,",
        "start": 3264.38,
        "end": 3272.7400000000002
    },
    {
        "text": " donde empiezan a haber determinadas afinidades y cercanías, que se dan a media, ¿no?",
        "start": 3272.7400000000002,
        "end": 3278.9
    },
    {
        "text": " Se busca en conjunto adoptar un conjunto de políticas fiscales y monetarias que garanticen",
        "start": 3278.9,
        "end": 3290.02
    },
    {
        "text": " la solvencia y la estabilidad de precios en la región.",
        "start": 3290.02,
        "end": 3292.9
    },
    {
        "text": " Para poder seguir con el trabajo en la unión advanera las políticas macroeconómicas",
        "start": 3292.9,
        "end": 3298.38
    },
    {
        "text": " en particular lo que hacen a la estabilidad y las economías son fundamentales.",
        "start": 3298.38,
        "end": 3302.22
    },
    {
        "text": " Entonces, en este marcan también en un acuerdo de orientar la política macroeconómica",
        "start": 3302.22,
        "end": 3306.98
    },
    {
        "text": " hacia la lógica de promover esto.",
        "start": 3306.98,
        "end": 3313.18
    },
    {
        "text": " Actualmente, el Mercosur se habla de una unión advanera imperfecta.",
        "start": 3320.02,
        "end": 3346.78
    },
    {
        "text": " Porque si bien es una unión advanera hay muchos aspectos que muy bien nos funcionan,",
        "start": 3346.78,
        "end": 3350.82
    },
    {
        "text": " o que tiene su fascia.",
        "start": 3350.82,
        "end": 3357.38
    },
    {
        "text": " ¿Por qué es una unión advanera imperfecta en primer lugar?",
        "start": 3357.38,
        "end": 3360.6600000000003
    },
    {
        "text": " Porque no todos los países adoptaron los mismos aranceles.",
        "start": 3360.6600000000003,
        "end": 3369.5400000000004
    },
    {
        "text": " El objetivo principal de un código advanero común era eliminar esas imperfecciones y",
        "start": 3369.5400000000004,
        "end": 3376.2200000000003
    },
    {
        "text": " generar las condiciones para llegar a la libre circulación de bienes y servicios,",
        "start": 3376.22,
        "end": 3383.2999999999997
    },
    {
        "text": " que se originaran en el bloque y tratar uniforme a los países que no eran de la sola.",
        "start": 3383.2999999999997,
        "end": 3392.02
    },
    {
        "text": " Todos los países que se producían en el Eto perdón, todos los bienes que se producían",
        "start": 3392.02,
        "end": 3395.4199999999996
    },
    {
        "text": " en la región tenían libre circulación y después tratábamos iguales a los que venían",
        "start": 3395.4199999999996,
        "end": 3399.18
    },
    {
        "text": " de afuera.",
        "start": 3399.18,
        "end": 3401.06
    },
    {
        "text": " Eso no es totalmente uniforme.",
        "start": 3401.06,
        "end": 3406.7
    },
    {
        "text": " ¿Por qué eso supone homogenerizar totalmente la política comercial entre los Estados",
        "start": 3406.7,
        "end": 3411.86
    },
    {
        "text": " parte?",
        "start": 3411.86,
        "end": 3412.86
    },
    {
        "text": " Y eso tiene que necesariamente eliminar todas las excepciones que existen muchas excepciones.",
        "start": 3412.86,
        "end": 3420.14
    },
    {
        "text": " Por eso es una unión advanera imperfecta.",
        "start": 3420.14,
        "end": 3421.9
    },
    {
        "text": " No se cumplen todas las condiciones para hacer lo que habíamos definido como una unión",
        "start": 3421.9,
        "end": 3425.54
    },
    {
        "text": " advanera.",
        "start": 3425.54,
        "end": 3430.9
    },
    {
        "text": " Lo que sí es cierto es que el Mercosur aumentó enormemente el comercio en la región y que",
        "start": 3430.9,
        "end": 3437.42
    },
    {
        "text": " fue atractivo de inversiones trasoras.",
        "start": 3437.42,
        "end": 3439.1
    },
    {
        "text": " O sea que en términos generales, más allá de los ganadores y paradedores, como yo",
        "start": 3439.1,
        "end": 3443.1800000000003
    },
    {
        "text": " necesaria la interna, tuvo su éxito y como proceso fue un proceso irreversible.",
        "start": 3443.1800000000003,
        "end": 3451.14
    },
    {
        "text": " Hoy en día, si bien hay idea, pero parece muy difícil que el Mercosur se deje de",
        "start": 3451.14,
        "end": 3456.9
    },
    {
        "text": " existir.",
        "start": 3456.9,
        "end": 3459.06
    },
    {
        "text": " Podemos tener hídas y vueltas, periodos de más crisis, periodos de retroceso, pero...",
        "start": 3459.06,
        "end": 3469.86
    },
    {
        "text": " Las exportaciones de los países a nivel del bloque crecieron muchísimo.",
        "start": 3469.86,
        "end": 3475.78
    },
    {
        "text": " Se aumentó la participación del comercio regional y para los países aumentó la participación",
        "start": 3475.78,
        "end": 3483.5
    },
    {
        "text": " de las exportaciones en la región.",
        "start": 3483.5,
        "end": 3485.38
    },
    {
        "text": " De hecho, de nuestras principales socios comerciales son argentinibrasil.",
        "start": 3485.38,
        "end": 3489.9
    },
    {
        "text": " Explican parte importante del comercio.",
        "start": 3489.9,
        "end": 3501.38
    },
    {
        "text": " Si analizamos, por ejemplo, las exportaciones del Mercosur según el país de origen, el",
        "start": 3501.38,
        "end": 3505.94
    },
    {
        "text": " año 2016, que lo que tenemos cerrado, Brasil explica el 64 por ciento, Argentina al 20, Venezuela",
        "start": 3505.94,
        "end": 3512.86
    },
    {
        "text": " el 10, Uruguay el 12 y para Guay el 3.",
        "start": 3512.86,
        "end": 3516.54
    },
    {
        "text": " Eso son con los datos de aduana.",
        "start": 3516.54,
        "end": 3520.06
    },
    {
        "text": " La participación de exportaciones totales en el Mercosur, combustible y energía,",
        "start": 3520.06,
        "end": 3525.1
    },
    {
        "text": " el 14 por ciento, manufacturas y de origen agropecuario, el 25, todo lo que la de Groindustria,",
        "start": 3525.1,
        "end": 3531.06
    },
    {
        "text": " las manufacturas industriales del 37 y los productos primarios del 25.",
        "start": 3531.06,
        "end": 3536.5
    },
    {
        "text": " Y el porcentaje es relativamente alto.",
        "start": 3536.5,
        "end": 3544.78
    },
    {
        "text": " Si analizamos las exportaciones de la región, incluyendo las exportaciones del bloque,",
        "start": 3544.78,
        "end": 3551.74
    },
    {
        "text": " hacia el bloque, el Mercosur, el principal destino de las exportaciones del Mercosur,",
        "start": 3551.74,
        "end": 3556.74
    },
    {
        "text": " extra bloque, son los países asiáticos.",
        "start": 3556.74,
        "end": 3560.18
    },
    {
        "text": " Y esencialmente lo que se vende son productos derivados de la agroindustria.",
        "start": 3560.18,
        "end": 3565.26
    },
    {
        "text": " Soja, maíz, hierro y algodón.",
        "start": 3565.26,
        "end": 3568.5
    },
    {
        "text": " Asia representa el 41 por ciento de las exportaciones del Mercosur fuera del bloque.",
        "start": 3568.5,
        "end": 3576.7400000000002
    },
    {
        "text": " Le sigue América del Norte, principalmente Estados Unidos, después la Unión Europea,",
        "start": 3576.7400000000002,
        "end": 3583.7000000000003
    },
    {
        "text": " más o menos comparten el 20 por ciento y África el 5 por ciento.",
        "start": 3583.7000000000003,
        "end": 3590.42
    },
    {
        "text": " El resto de América del Sur es el 8 por ciento, también es importante.",
        "start": 3590.42,
        "end": 3596.3
    },
    {
        "text": " Y el Mercosur en las exportaciones urugasas, desde el tubo un crecimiento importante en",
        "start": 3596.3,
        "end": 3602.9
    },
    {
        "text": " la década del 90, llegó del 47, 55 por ciento, se mantuvo en el año 2004, producto de las",
        "start": 3602.9,
        "end": 3610.3
    },
    {
        "text": " crisis bajó a un 25 por ciento y ahora se viene manteniendo entre el 23 y el 30 por ciento.",
        "start": 3610.3,
        "end": 3619.2200000000003
    },
    {
        "text": " Y en los últimos dos años se ha caído un poco y esto parte de esta tendencia compleja",
        "start": 3619.22,
        "end": 3624.02
    },
    {
        "text": " que se está dando en la región.",
        "start": 3624.02,
        "end": 3625.1
    },
    {
        "text": " Si nosotros analizamos las discusiones de los últimos años, pasamos de exportar el 28 por",
        "start": 3625.1,
        "end": 3631.14
    },
    {
        "text": " ciento al Mercosur a exportar el 23 en el último año.",
        "start": 3631.14,
        "end": 3641.2999999999997
    },
    {
        "text": " En esta agenda de relazamiento del Mercosur y en esta etapa del Mercosur que se dan el 2000,",
        "start": 3641.2999999999997,
        "end": 3646.58
    },
    {
        "text": " se vuela calácterística de que los aspectos comerciales fueron importantes, pero también",
        "start": 3646.58,
        "end": 3650.8199999999997
    },
    {
        "text": " se trabajaron otras dimensiones del Mercosur.",
        "start": 3650.8199999999997,
        "end": 3655.46
    },
    {
        "text": " ¿Cuáles fueron los temas que se trabajaron para profundizar el Mercosur?",
        "start": 3655.46,
        "end": 3660.22
    },
    {
        "text": " En primer lugar el acceso a mercados se buscó crear una agenda común de trabajo entre",
        "start": 3660.22,
        "end": 3666.22
    },
    {
        "text": " los países en temas comerciales y económicos y en otras dimensiones que ahora vamos a comentar.",
        "start": 3666.22,
        "end": 3671.94
    },
    {
        "text": " El último tema fue la agilización de los trámites de frontera.",
        "start": 3671.94,
        "end": 3677.7000000000003
    },
    {
        "text": " Los incentivos a las inversiones y la promoción de la producción, la exportación, incluyendo",
        "start": 3677.7000000000003,
        "end": 3682.9
    },
    {
        "text": " la existencia de zonas francas, empiezan a ver como símiles en las políticas y eso también",
        "start": 3682.9,
        "end": 3689.14
    },
    {
        "text": " ayuda.",
        "start": 3689.14,
        "end": 3691.14
    },
    {
        "text": " La admisión temporaria, la existencia de régimen especiales.",
        "start": 3691.14,
        "end": 3695.06
    },
    {
        "text": " El trabajar más en el arancel común, la defensa comercial y la competencia, todos los países",
        "start": 3695.06,
        "end": 3700.2200000000003
    },
    {
        "text": " empiezan a desarrollar leyes de competencia y de defensa comercial.",
        "start": 3700.22,
        "end": 3705.14
    },
    {
        "text": " Nosotros tenemos una ley de competencia y tenemos una comisión que regula la competencia.",
        "start": 3705.14,
        "end": 3709.58
    },
    {
        "text": " Entonces en los casos donde se vio la los temas de competencia se aplican multas, Brasil",
        "start": 3709.58,
        "end": 3715.2599999999998
    },
    {
        "text": " los tiene, Argentina los tiene, para guay los tiene.",
        "start": 3715.2599999999998,
        "end": 3718.7799999999997
    },
    {
        "text": " Con diferentes niveles de desarrollo, por ejemplo en Brasil están muy protocolizados y",
        "start": 3718.7799999999997,
        "end": 3724.54
    },
    {
        "text": " muy acordados, mucho más estricto y más previsible acá.",
        "start": 3724.54,
        "end": 3729.14
    },
    {
        "text": " Las cosas que acá se pueden hacer, pero Brasil no porque está mucho más reglamentado.",
        "start": 3729.14,
        "end": 3736.2999999999997
    },
    {
        "text": " Todos los mecanismos de solución de controversia a nivel del bloque, la incorporación de la",
        "start": 3736.2999999999997,
        "end": 3740.8799999999997
    },
    {
        "text": " normativa Mercosur y el fortalecimiento de la institucionalidad Mercosur, por ejemplo,",
        "start": 3740.8799999999997,
        "end": 3746.06
    },
    {
        "text": " el Parlamento del Mercosur.",
        "start": 3746.06,
        "end": 3747.54
    },
    {
        "text": " Si uno habla a nivel de la región, pocos saben que existe el Parlamento del Polo a menos",
        "start": 3747.54,
        "end": 3754.54
    },
    {
        "text": " en Uruguay que existe un Parlamento del Mercosur.",
        "start": 3754.54,
        "end": 3756.46
    },
    {
        "text": " Taca no más, está ahí.",
        "start": 3757.46,
        "end": 3759.5
    },
    {
        "text": " En los hechos, en Argentina, los ciudadanos, en las elecciones, eligen los parlamentarios",
        "start": 3759.5,
        "end": 3766.3
    },
    {
        "text": " del Mercosur.",
        "start": 3766.3,
        "end": 3767.46
    },
    {
        "text": " En Paraguay también, en Brasil, a partir de las próximas elecciones, en Uruguay es indirecto.",
        "start": 3767.46,
        "end": 3774.18
    },
    {
        "text": " Nosotros elegimos el Parlamento y algunos de los parlamentarios los destinan para formar",
        "start": 3774.18,
        "end": 3779.34
    },
    {
        "text": " parte del Parlamento del Mercosur.",
        "start": 3779.34,
        "end": 3781.38
    },
    {
        "text": " Parece que en algún momento vas a tener que acelerar directamente, pues si los otros",
        "start": 3781.38,
        "end": 3784.8
    },
    {
        "text": " los elegen, Uruguay nos puede estar ajeno a ese proceso.",
        "start": 3784.8,
        "end": 3789.0
    },
    {
        "text": " Ahora no sé, la verdad, tengo que fijarme.",
        "start": 3793.6800000000003,
        "end": 3796.88
    },
    {
        "text": " No sé, tampoco me fijé ante venir.",
        "start": 3796.88,
        "end": 3798.84
    },
    {
        "text": " Pero es una institución que hasta hace poco, tiene poco peso todavía.",
        "start": 3801.84,
        "end": 3809.6800000000003
    },
    {
        "text": " También se ha avanzado en otros temas, no?",
        "start": 3810.68,
        "end": 3814.68
    },
    {
        "text": " Y existe un Mercosur social donde se incorpora todos los temas de la dimensión social,",
        "start": 3814.68,
        "end": 3821.68
    },
    {
        "text": " existe un Mercosur trabajando en los temas educativos, o sea, se fueron hacia otras áreas también",
        "start": 3821.68,
        "end": 3826.68
    },
    {
        "text": " a trabajar.",
        "start": 3826.68,
        "end": 3827.68
    },
    {
        "text": " Cuando los temas comerciales y económicos están más complejos, las otras áreas avanzan más.",
        "start": 3827.68,
        "end": 3832.68
    },
    {
        "text": " Eso también es una realidad.",
        "start": 3832.68,
        "end": 3834.68
    },
    {
        "text": " Por ejemplo, se cree un instituto social del Mercosur y eso funciona en Paraguay.",
        "start": 3835.68,
        "end": 3842.68
    },
    {
        "text": " En general yo le decía, tratan de instalar las instituciones en los países más débiles,",
        "start": 3842.68,
        "end": 3849.68
    },
    {
        "text": " de forma tal de protegeras en los países más débiles.",
        "start": 3849.68,
        "end": 3852.68
    },
    {
        "text": " Bueno, ¿cuáles son las instituciones?",
        "start": 3854.68,
        "end": 3857.68
    },
    {
        "text": " Dentro de la estructura institucional del Mercosur, ¿cuáles son las instituciones relevantes?",
        "start": 3857.68,
        "end": 3864.68
    },
    {
        "text": " La secretaría del Mercosur.",
        "start": 3869.68,
        "end": 3871.68
    },
    {
        "text": " Se pagan entre todos los países, un fondo y se pagan en forma proporcional.",
        "start": 3887.68,
        "end": 3893.68
    },
    {
        "text": " La Secretaría del Mercosur.",
        "start": 3894.68,
        "end": 3896.68
    },
    {
        "text": " La Secretaría del Mercosur funciona ahí también.",
        "start": 3901.68,
        "end": 3904.68
    },
    {
        "text": " En el edificio Mercosur, no está todo distinado del Mercosur.",
        "start": 3907.68,
        "end": 3911.68
    },
    {
        "text": " No tiene algunos pisos que alquilan a los fiscinas también.",
        "start": 3911.68,
        "end": 3914.68
    },
    {
        "text": " Está liica que es el Instituto Internamericano de Agricola.",
        "start": 3914.68,
        "end": 3918.68
    },
    {
        "text": " Después está la UNESCO también ahí.",
        "start": 3918.68,
        "end": 3922.68
    },
    {
        "text": " No está todo el edificio destinado al Mercosur.",
        "start": 3922.68,
        "end": 3925.68
    },
    {
        "text": " Lo que sí han ampliado y lo sacaron en el casino hace un tiempo.",
        "start": 3925.68,
        "end": 3930.68
    },
    {
        "text": " Porque se dijeron que quedaba mal de en el casino.",
        "start": 3930.68,
        "end": 3934.68
    },
    {
        "text": " El edificio del Mercosur está bien.",
        "start": 3934.68,
        "end": 3936.68
    },
    {
        "text": " La cuestión en frente.",
        "start": 3936.68,
        "end": 3937.68
    },
    {
        "text": " Bien.",
        "start": 3937.68,
        "end": 3938.68
    },
    {
        "text": " La Secretaría del Mercosur fue creada en el año 1994 con el acuerdo europeo, con el protocolo de europeo.",
        "start": 3939.68,
        "end": 3946.68
    },
    {
        "text": " La Secretaría es el órgano operativo más importante que tiene el Mercosur.",
        "start": 3947.68,
        "end": 3951.68
    },
    {
        "text": " Es la ejecución del Mercosur.",
        "start": 3951.68,
        "end": 3953.68
    },
    {
        "text": " Es la responsable de la presentación de servicios a los demás órganos del Mercosur.",
        "start": 3954.68,
        "end": 3958.68
    },
    {
        "text": " Es como el ejecutivo.",
        "start": 3959.68,
        "end": 3960.68
    },
    {
        "text": " En diciembre del año 1996, se firmó que se instalaba que la CEDE va a ser en Uruguay.",
        "start": 3961.68,
        "end": 3969.68
    },
    {
        "text": " Por la decisión 0.4 en el 96.",
        "start": 3969.68,
        "end": 3974.68
    },
    {
        "text": " Y el gobierno de Uruguay lo asume en la ley 16.829 del 29 de mazo en el 1997,",
        "start": 3974.68,
        "end": 3981.68
    },
    {
        "text": " donde establece la CEDE permanente y la Secretaría del Mercosur en Montevideo.",
        "start": 3981.68,
        "end": 3986.68
    },
    {
        "text": " Al principio llevaba actividades más de corte administrativo.",
        "start": 3991.68,
        "end": 3995.68
    },
    {
        "text": " Por ejemplo, el archivo oficial de la documentación del Mercosur, la publicación y difusión de las decisiones que se adoptaban a nivel del Mercosur.",
        "start": 3995.68,
        "end": 4002.68
    },
    {
        "text": " Estas cosas medio son muy protocoladas y tienen muchas reuniones.",
        "start": 4002.68,
        "end": 4006.68
    },
    {
        "text": " La organización de los aspectos logísticos de las reuniones, la información regulada a los estados parte,",
        "start": 4007.68,
        "end": 4012.68
    },
    {
        "text": " con la evolución de los procesos, lo que se buscó fue transformar esa Secretaría Administrativa en una Secretaría técnica,",
        "start": 4013.68,
        "end": 4022.68
    },
    {
        "text": " que asumiera otro tipo de funciones donde pasó de ser una Secretaría Administrativa,",
        "start": 4022.68,
        "end": 4029.68
    },
    {
        "text": " a ser una Secretaría de Desesoramiento Técnico.",
        "start": 4029.68,
        "end": 4032.68
    },
    {
        "text": " Hoy cumple otro tipo de funciones y tiene otro conjunto de programas como es llevar los fondos estructurales.",
        "start": 4033.68,
        "end": 4042.68
    },
    {
        "text": " ¿Cómo se integra secretaría? ¿Se integra con personas de los diferentes estados parte?",
        "start": 4042.68,
        "end": 4048.68
    },
    {
        "text": " Se hacen llamados internacionales, pero ya se sabe que para tal cargo va a ser, tiene que ser un argentino,",
        "start": 4049.68,
        "end": 4056.68
    },
    {
        "text": " tiene que ser un paraguayo y siempre lo que se busca es compensar que todos están representados.",
        "start": 4057.68,
        "end": 4062.68
    },
    {
        "text": " Y cuando un país ocupa un cargo y se va después, tiene atrás otro, pero siempre manteniendo los porcentajes.",
        "start": 4062.68,
        "end": 4071.68
    },
    {
        "text": " Eso es una forma de dar pluralidad a la integración, porque se pueden entender de qué forma pueden jugar los intereses nacionales",
        "start": 4071.68,
        "end": 4082.68
    },
    {
        "text": " en la toma de decisiones. Entonces, es una forma de equilibrar de que no sea permanentemente en beneficio algunos,",
        "start": 4083.68,
        "end": 4090.68
    },
    {
        "text": " y que también aquellos más poderosos no tengan mayor espeso, se pueden generar esos de secretaría.",
        "start": 4090.68,
        "end": 4096.68
    },
    {
        "text": " ¿Qué otras organismos son los importantes en el Mercosura?",
        "start": 4098.68,
        "end": 4101.68
    },
    {
        "text": " Nivel de las decisiones políticas, el Consejo del Mercado Común, que está integrado por los presidentes,",
        "start": 4101.68,
        "end": 4107.68
    },
    {
        "text": " el Grupo de Mercado Común, que están integrados por los ministros, la Comisión de Comercio del Mercosur,",
        "start": 4108.68,
        "end": 4116.68
    },
    {
        "text": " el Parlamento del Mercosur, el Foro Consultivo del Mercosur, la Secretaría que era como no importante,",
        "start": 4116.68,
        "end": 4122.68
    },
    {
        "text": " el Tribunal Permanente de Revisión del Mercosur es como una cuestión de la análisis,",
        "start": 4122.68,
        "end": 4128.68
    },
    {
        "text": " el Tribunal Administrativo Laboral que se encarga mucho.",
        "start": 4128.68,
        "end": 4133.68
    },
    {
        "text": " Un tema muy importante ha sido cómo unificar la normativa en la oral o cómo se desatar medidas",
        "start": 4134.68,
        "end": 4140.68
    },
    {
        "text": " para que eso genera desigualdad es muy fuertes en los mercados de trabajo cuando hay libre circulación",
        "start": 4140.68,
        "end": 4145.68
    },
    {
        "text": " de trabajadores. El Centro del Mercosur para la promoción del Estado de derecho.",
        "start": 4145.68,
        "end": 4150.68
    },
    {
        "text": " Uno de los instrumentos más importantes que ha desarrollado es el fondo para la Convergencia Estructural",
        "start": 4150.68,
        "end": 4156.68
    },
    {
        "text": " en el Mercosur. El fondo para la Convergencia Estructural es un fondo que se crea con aportes de todos los países.",
        "start": 4156.68,
        "end": 4162.68
    },
    {
        "text": " Quiero hacían millones de dólares por año.",
        "start": 4163.68,
        "end": 4165.68
    },
    {
        "text": " El aportan más los más grandes, más o menos el 70% Brasil, el el 27% Argentina,",
        "start": 4165.68,
        "end": 4174.68
    },
    {
        "text": " el 2% Uruguay y el 1% para Uruguay y reciben inversamente proporcional.",
        "start": 4174.68,
        "end": 4179.68
    },
    {
        "text": " Entonces, los países lo que hacen es presentar proyectos de cuatro tipos,",
        "start": 4179.68,
        "end": 4184.68
    },
    {
        "text": " una de promoción comercial, infraestructuras que lo que buscan es generar intervenciones",
        "start": 4184.68,
        "end": 4191.68
    },
    {
        "text": " para achicar las diferencias estructurales entre los países.",
        "start": 4191.68,
        "end": 4198.68
    },
    {
        "text": " Muchas obras de infraestructuras se han promovido a través del Fosem,",
        "start": 4198.68,
        "end": 4202.68
    },
    {
        "text": " fondo para la Convergencia Estructural del Mercosur.",
        "start": 4202.68,
        "end": 4204.68
    },
    {
        "text": " Por ejemplo, el Arrilo de la Ruta 26, el Arrilo de la Ruta 12,",
        "start": 4204.68,
        "end": 4209.68
    },
    {
        "text": " por ejemplo, algunos de obras ferroviarias, la interconexión eléctrica Uruguay con Candiota,",
        "start": 4209.68,
        "end": 4218.68
    },
    {
        "text": " la interconexión eléctrica, al sur de Brasil.",
        "start": 4218.68,
        "end": 4224.68
    },
    {
        "text": " Y esos han sido fondos del Mercos, y hay muchos más, no hay ahora en montón,",
        "start": 4224.68,
        "end": 4229.68
    },
    {
        "text": " estos fueron los primeros. Y esos han sido fondos del Mercosur,",
        "start": 4229.68,
        "end": 4233.68
    },
    {
        "text": " que lo han bucado para eso.",
        "start": 4233.68,
        "end": 4235.68
    },
    {
        "text": " Es tan difícil el tema de la aprobación, que por ejemplo,",
        "start": 4235.68,
        "end": 4239.68
    },
    {
        "text": " en el año 2007-2008, 2006, cuando fueron los primeras presentaciones",
        "start": 4239.68,
        "end": 4246.68
    },
    {
        "text": " de los proyectos de los fondos estructurales, era en plena crisis de Uruguay",
        "start": 4246.68,
        "end": 4251.68
    },
    {
        "text": " con Argentina por el tema de UPM, en previentos.",
        "start": 4251.68,
        "end": 4255.68
    },
    {
        "text": " Entonces, como se aprobaban por consenso, Argentina no aprobaba los proyectos de Uruguay",
        "start": 4255.68,
        "end": 4263.68
    },
    {
        "text": " porque por el conflicto con el TEMO PM.",
        "start": 4263.68,
        "end": 4267.68
    },
    {
        "text": " Es más, hubo un art proyecto que estaba presentado y que decía,",
        "start": 4267.68,
        "end": 4270.68
    },
    {
        "text": " bueno, nos va a favorecer el transporte de madera, ni soñar.",
        "start": 4270.68,
        "end": 4276.68
    },
    {
        "text": " Pero hasta esas dificultades se manifiestan.",
        "start": 4276.68,
        "end": 4281.68
    },
    {
        "text": " Cuando se liberó un poco el tema del problema de Pocon UPM,",
        "start": 4281.68,
        "end": 4287.68
    },
    {
        "text": " Argentina provó los proyectos y los proyectos se aprobaban.",
        "start": 4287.68,
        "end": 4290.68
    },
    {
        "text": " Uruguay también ha tenido muchos desarrollo de proyectos",
        "start": 4290.68,
        "end": 4293.68
    },
    {
        "text": " y lo que se ha promovido en esta nueva etapa de los fondos de convergencia estructurales",
        "start": 4293.68,
        "end": 4297.68
    },
    {
        "text": " también generar proyectos que fueran comunes, que son muy difíciles de laborar y desarrollar,",
        "start": 4297.68,
        "end": 4302.68
    },
    {
        "text": " pero que no fueran solo presentados por un estado parte, que fueran presentados por más de un estado parte.",
        "start": 4302.68,
        "end": 4309.68
    },
    {
        "text": " Hay miles de ejemplos y hay muchos proyectos ya probados y en desarrollo,",
        "start": 4309.68,
        "end": 4314.68
    },
    {
        "text": " pero el lanzamiento de estos fondos estructurales fue muy lento,",
        "start": 4314.68,
        "end": 4318.68
    },
    {
        "text": " pero sí se desarrolló comunes herramientas muy importantes",
        "start": 4318.68,
        "end": 4322.68
    },
    {
        "text": " para la promoción de la convergencia de la región.",
        "start": 4322.68,
        "end": 4324.68
    },
    {
        "text": " La región es un complemento bien interesante a todo el proceso.",
        "start": 4324.68,
        "end": 4327.68
    },
    {
        "text": " Uruguay también tuvo mucha obra de infraestructura,",
        "start": 4327.68,
        "end": 4331.68
    },
    {
        "text": " través de rutas, de electrificación a través de los fondos estructurales",
        "start": 4331.68,
        "end": 4338.68
    },
    {
        "text": " y ahora, alguna nueva etapa donde se buscaban eso de los proyectos comunes.",
        "start": 4338.68,
        "end": 4342.68
    },
    {
        "text": " Las tareas de estos proyectos estaban definidas en tres lignamientos,",
        "start": 4342.68,
        "end": 4345.68
    },
    {
        "text": " una que era la infraestructura propiamente dicha,",
        "start": 4345.68,
        "end": 4348.68
    },
    {
        "text": " otra que era la inserción comercial y promoción",
        "start": 4348.68,
        "end": 4351.68
    },
    {
        "text": " y otra que era también el fortalecimiento de la estructura institucional del Mercosur.",
        "start": 4351.68,
        "end": 4355.68
    },
    {
        "text": " Eso fue los tres itens que estaban en principio.",
        "start": 4355.68,
        "end": 4360.68
    },
    {
        "text": " El Parlamento del Mercosur si bien no ha sido de los temas más relevantes,",
        "start": 4363.68,
        "end": 4367.68
    },
    {
        "text": " lo que se aporta es una institucionalidad.",
        "start": 4367.68,
        "end": 4369.68
    },
    {
        "text": " Se creó en el 6 de diciembre del 2006 y el Parlamento del Mercosur ya tiene 11 años.",
        "start": 4369.68,
        "end": 4377.68
    },
    {
        "text": " Como una sustituta de la comisión parlamentaria conjunta,",
        "start": 4378.68,
        "end": 4381.68
    },
    {
        "text": " que fue lo que era representativo de los intereses,",
        "start": 4381.68,
        "end": 4384.68
    },
    {
        "text": " es buscar en el Mercosur representar los intereses de los ciudadanos.",
        "start": 4384.68,
        "end": 4390.68
    },
    {
        "text": " De alguna forma, cuando nosotros tenemos una estructura institucional",
        "start": 4390.68,
        "end": 4395.68
    },
    {
        "text": " de un sistema democrático, cuando formamos parte de un bloque regional,",
        "start": 4395.68,
        "end": 4400.68
    },
    {
        "text": " hay que tener como un similitud o como un paralelo de forma tal",
        "start": 4400.68,
        "end": 4405.68
    },
    {
        "text": " de poder respetar los mecanismos que hacen a la democracia.",
        "start": 4405.68,
        "end": 4408.68
    },
    {
        "text": " Entonces, el Parlamento del Mercosur se crea como una estructura que lo que busca",
        "start": 4408.68,
        "end": 4411.68
    },
    {
        "text": " es representar en los ámbitos de decisión regional los intereses de los ciudadanos.",
        "start": 4411.68,
        "end": 4418.68
    },
    {
        "text": " De alguna forma, es una aporte más o es una institucionalidad más que busca",
        "start": 4421.68,
        "end": 4425.68
    },
    {
        "text": " contribuir a lo que son el equilibrio y la calidad institucional a nivel de la región.",
        "start": 4425.68,
        "end": 4431.68
    },
    {
        "text": " El Parlamento funciona con comisiones de trabajo donde los temas que están",
        "start": 4435.68,
        "end": 4440.68
    },
    {
        "text": " más tan destacados son los asuntos económicos, los asustos financieros,",
        "start": 4440.68,
        "end": 4443.68
    },
    {
        "text": " los comerciales, los de regionales y planificaciones estratégicas,",
        "start": 4443.68,
        "end": 4447.68
    },
    {
        "text": " o sea, donde la lógica territorial influya medio ambiente y turismo,",
        "start": 4447.68,
        "end": 4453.68
    },
    {
        "text": " ciudadanía y derechos vivienda y salud.",
        "start": 4453.68,
        "end": 4456.68
    },
    {
        "text": " La parte de agricultura y seguridad alimentaria,",
        "start": 4456.68,
        "end": 4459.68
    },
    {
        "text": " presupuestos y asuntos internos, o sea, es como la lógica al Parlamento",
        "start": 4459.68,
        "end": 4463.68
    },
    {
        "text": " acá que trabaja con sus comisiones y con sus temas.",
        "start": 4463.68,
        "end": 4466.68
    },
    {
        "text": " Otro proceso que no es menor son las negociaciones",
        "start": 4471.68,
        "end": 4476.68
    },
    {
        "text": " Mercosur, Cuyo en Europea.",
        "start": 4480.68,
        "end": 4484.68
    },
    {
        "text": " Si bien están en pleno amoda y en pleno auge y este año han sido muy importantes",
        "start": 4486.68,
        "end": 4491.68
    },
    {
        "text": " y se pretende llegar a firmar en diciembre un acuerdo entre el Mercosur y la Unión Europea",
        "start": 4491.68,
        "end": 4496.68
    },
    {
        "text": " entre los dos bloques, las negociaciones entre el Mercosur y la Unión Europea",
        "start": 4496.68,
        "end": 4501.68
    },
    {
        "text": " se iniciaron en el año 1995.",
        "start": 4501.68,
        "end": 4504.68
    },
    {
        "text": " Imagínense que el tratado del Mercosur se firmó en 1991 y la institucionalidad",
        "start": 4504.68,
        "end": 4510.68
    },
    {
        "text": " fuerte del Mercosur fue con el europeo en el 94, o sea, que hace muchos años.",
        "start": 4510.68,
        "end": 4514.68
    },
    {
        "text": " Tuvieron un impulso inicial y después se detuvieron durante mucho tiempo.",
        "start": 4514.68,
        "end": 4518.68
    },
    {
        "text": " También las propias crisis de la región de tuvo un poco esas negociaciones.",
        "start": 4519.68,
        "end": 4524.68
    },
    {
        "text": " Pero las primeras negociaciones que emprendió el Mercosur con la Unión Europea",
        "start": 4524.68,
        "end": 4529.68
    },
    {
        "text": " fueron el año 1995 y lo que buscaba en ir a promover la cooperación política y económica",
        "start": 4529.68,
        "end": 4535.68
    },
    {
        "text": " para estimular el mayor adercamiento entre los dos bloques.",
        "start": 4535.68,
        "end": 4539.68
    },
    {
        "text": " ¿La Unión Europea también se llevó a los dos bloques?",
        "start": 4540.68,
        "end": 4545.68
    },
    {
        "text": " La surgió la comunidad económica europea en los 80 y fue evolucionando hasta la mania común.",
        "start": 4545.68,
        "end": 4553.68
    },
    {
        "text": " Pero fue con la comunidad económica.",
        "start": 4553.68,
        "end": 4557.68
    },
    {
        "text": " Digo, unión europea para ponerle ahora, pero tienen deseantes de entre.",
        "start": 4557.68,
        "end": 4562.68
    },
    {
        "text": " O si querés el bloque que empezó, aquí terminó la Unión Europea.",
        "start": 4562.68,
        "end": 4566.68
    },
    {
        "text": " Las negociaciones fundamentales entre la Unión Europea y el Mercosur, la comunidad económica europea,",
        "start": 4566.68,
        "end": 4571.68
    },
    {
        "text": " bien aclarada está y el Mercosur, se dan para alcanzar el acuerdo de asociación internacional.",
        "start": 4571.68,
        "end": 4578.68
    },
    {
        "text": " Y que llevan aproximadamente 8 años en curso.",
        "start": 4578.68,
        "end": 4583.68
    },
    {
        "text": " O sea, empezaron en 1995, se dejaron y hace 8 años que se retomaron nuevamente.",
        "start": 4583.68,
        "end": 4589.68
    },
    {
        "text": " De los de los... desde... desde el 2010 más o menos, fue en 2009 y 2010.",
        "start": 4589.68,
        "end": 4600.68
    },
    {
        "text": " Han tenido como conversaciones exitosas, pero las mayores significultades se están dando en las cuotas de comercio.",
        "start": 4600.68,
        "end": 4608.68
    },
    {
        "text": " Fundamentalmente, en la parte agrícola, porque la Unión Europea tiene un mercado agrícola muy protegido.",
        "start": 4608.68,
        "end": 4614.68
    },
    {
        "text": " El tema de los lácteos en la Unión Europea, de Alemania y Francia, son mercados muy protegidos, por ejemplo.",
        "start": 4615.68,
        "end": 4621.68
    },
    {
        "text": " Entonces, en realidad, en los hechos hay como manifestación de voluntad, pero ha estado muy difícil.",
        "start": 4621.68,
        "end": 4626.68
    },
    {
        "text": " Lo que hicieron los países era acercar a un conversaciones, han sido muy lentas, no har avanzados,",
        "start": 4626.68,
        "end": 4631.68
    },
    {
        "text": " se dio un impulso fuerte este año.",
        "start": 4631.68,
        "end": 4633.68
    },
    {
        "text": " El objetivo llegó a llegar a un resultado de las negociaciones ahora en diciembre.",
        "start": 4633.68,
        "end": 4638.68
    },
    {
        "text": " En mayo de este año, el Mercosur presentó sus intenciones, tuvieron dos reuniones en Bruselas,",
        "start": 4638.68,
        "end": 4648.68
    },
    {
        "text": " una que fue por el 20 de junio, por ahí por el 23 de junio, otra que fue en septiembre,",
        "start": 4648.68,
        "end": 4654.68
    },
    {
        "text": " ahora una en Brasil, entre el 3 y el 5 de octubre, en Brasilia,",
        "start": 4654.68,
        "end": 4661.68
    },
    {
        "text": " otra que va a ser de nuevo en Brasilia, entre el 6 y el 10 de noviembre,",
        "start": 4661.68,
        "end": 4666.68
    },
    {
        "text": " y pretenden firmar un acuerdo en Argentina en diciembre.",
        "start": 4666.68,
        "end": 4673.68
    },
    {
        "text": " No se sabe si se va a llegar ese acuerdo, y básicamente lo que parece que estaría bloqueando más la cuota por los productos agrícolas,",
        "start": 4673.68,
        "end": 4684.68
    },
    {
        "text": " o los de la industria agroesportadora.",
        "start": 4684.68,
        "end": 4690.68
    },
    {
        "text": " Pero después lo que se hacen son como muchas monedas de cambio,",
        "start": 4690.68,
        "end": 4694.68
    },
    {
        "text": " y lo que pretendía Mercosur parece que la Ferte de Vellano europea,",
        "start": 4694.68,
        "end": 4698.68
    },
    {
        "text": " fue muy por debajo de lo que se pretendía.",
        "start": 4698.68,
        "end": 4702.68
    },
    {
        "text": " Pero no sé que mucho decirles porque la realidad es un poco sesa.",
        "start": 4702.68,
        "end": 4708.68
    },
    {
        "text": " Participan los gobiernos, participan los presidentes, participan los ministros de relaciones teriores,",
        "start": 4708.68,
        "end": 4713.68
    },
    {
        "text": " participan los embajadores, los de miserogonomía, participan los empresarios en otros ámbitos y hay equipos de negociación.",
        "start": 4713.68,
        "end": 4720.68
    },
    {
        "text": " Una cosa interesante, pero es más comanégdo, es cómo se negocia.",
        "start": 4720.68,
        "end": 4725.68
    },
    {
        "text": " La Unión Europea tiene sus negociadores por sectores,",
        "start": 4725.68,
        "end": 4729.68
    },
    {
        "text": " viene uno a negociar la parte agrícola, la industria al otro,",
        "start": 4729.68,
        "end": 4733.68
    },
    {
        "text": " el Mercosur lleva sus negociadores cada uno de su país.",
        "start": 4733.68,
        "end": 4736.68
    },
    {
        "text": " Hay un negociador por Uruguay, uno por Argentina, uno con Brasil, otro por Paraguay, y van todos.",
        "start": 4736.68,
        "end": 4741.68
    },
    {
        "text": " Cada uno, o sea, ahí se ve como el proceso es diferente.",
        "start": 4741.68,
        "end": 4745.68
    },
    {
        "text": " Y después otra desafío que va a tener para el Mercosur,",
        "start": 4745.68,
        "end": 4748.68
    },
    {
        "text": " esta negociación con el Unión Europea es,",
        "start": 4748.68,
        "end": 4750.68
    },
    {
        "text": " y una vez que alcanzemos el acuerdo europea,",
        "start": 4750.68,
        "end": 4752.68
    },
    {
        "text": " cómo nos vamos a distribuir entre nosotros,",
        "start": 4752.68,
        "end": 4754.68
    },
    {
        "text": " si es por cuota, lo agrarémos una cuota de carne y una cuota de lactos",
        "start": 4754.68,
        "end": 4758.68
    },
    {
        "text": " y después como la distribuimos.",
        "start": 4758.68,
        "end": 4760.68
    },
    {
        "text": " La idea inicial parece ser que se distribuya igual para todos,",
        "start": 4760.68,
        "end": 4764.68
    },
    {
        "text": " pero no sé cómo van a jugar los intereses.",
        "start": 4764.68,
        "end": 4769.68
    },
    {
        "text": " Bueno, el Mercosur y un poco Uruguay en la actualidad.",
        "start": 4774.68,
        "end": 4778.68
    },
    {
        "text": " En el 2017,",
        "start": 4778.68,
        "end": 4781.68
    },
    {
        "text": " se hubo una reunión de jefes de Estado, fue en Argentina.",
        "start": 4781.68,
        "end": 4785.68
    },
    {
        "text": " En julio de 2017 había hacia dos años que no había,",
        "start": 4785.68,
        "end": 4788.68
    },
    {
        "text": " fue Tavaere Basque, Salar reunión,",
        "start": 4788.68,
        "end": 4790.68
    },
    {
        "text": " se reunió con Mácrima en ese momento,",
        "start": 4790.68,
        "end": 4792.68
    },
    {
        "text": " se acuerdan de la prensa, fue en el marco eso de los acuerdos del Mercosur,",
        "start": 4792.68,
        "end": 4796.68
    },
    {
        "text": " tuvo un 10, vino al otro,",
        "start": 4796.68,
        "end": 4798.68
    },
    {
        "text": " creo que le dieron un premio en una universidad o algo así.",
        "start": 4798.68,
        "end": 4802.68
    },
    {
        "text": " Así me estoy confundiendo de viaje, pero creo que fue ese.",
        "start": 4802.68,
        "end": 4806.68
    },
    {
        "text": " El bloque lo que busca hoy es profundizar la integración interna",
        "start": 4806.68,
        "end": 4810.68
    },
    {
        "text": " y lograr acuerdos con nuevos mercados,",
        "start": 4810.68,
        "end": 4812.68
    },
    {
        "text": " además de afinar la estrategia que encara con la Unión Europea.",
        "start": 4812.68,
        "end": 4816.68
    },
    {
        "text": " Eso ha sido un poco la prioridad de este tiempo.",
        "start": 4816.68,
        "end": 4819.68
    },
    {
        "text": " Sin lugar a duda, la dificultad está muy grande,",
        "start": 4819.68,
        "end": 4821.68
    },
    {
        "text": " si el demabrasil hoy está muy presente.",
        "start": 4821.68,
        "end": 4823.68
    },
    {
        "text": " Y Argentina está con muchas ganas de firmar acuerdos",
        "start": 4823.68,
        "end": 4826.68
    },
    {
        "text": " como está en un proceso de liberalización muy fuerte.",
        "start": 4826.68,
        "end": 4828.68
    },
    {
        "text": " Los va a ir veniendo una de las problemas que tiene es que, bueno,",
        "start": 4828.68,
        "end": 4831.68
    },
    {
        "text": " que hay una posición clara de Brasil, hay una posición de Paraguay,",
        "start": 4831.68,
        "end": 4833.68
    },
    {
        "text": " pero Argentina está dispuesto a aceptar cualquier cuota de parte.",
        "start": 4833.68,
        "end": 4837.68
    },
    {
        "text": " Entonces, no hay una posición muy uniforme a nivel de la región.",
        "start": 4837.68,
        "end": 4841.68
    },
    {
        "text": " Hay una propuesta del presidente Uruguayo, el presidente Vasquez,",
        "start": 4842.68,
        "end": 4847.68
    },
    {
        "text": " para dinamizar que son seis puntos que se basan en,",
        "start": 4847.68,
        "end": 4850.68
    },
    {
        "text": " incrementar el comercio a nivel del bloque.",
        "start": 4850.68,
        "end": 4853.68
    },
    {
        "text": " En esta semana está como delicado eso, ¿no?",
        "start": 4853.68,
        "end": 4857.68
    },
    {
        "text": " Parece que no va por ahí.",
        "start": 4857.68,
        "end": 4859.68
    },
    {
        "text": " Tiene un bloqueo de esa propuesta.",
        "start": 4859.68,
        "end": 4862.68
    },
    {
        "text": " Incorporar a Bolivia como miembro pleno del Mercosur.",
        "start": 4862.68,
        "end": 4865.68
    },
    {
        "text": " Y el mercado de Bolivia es un mercado otra activo.",
        "start": 4865.68,
        "end": 4868.68
    },
    {
        "text": " Tiene buenos potenciales para el nivel de la región.",
        "start": 4869.68,
        "end": 4872.68
    },
    {
        "text": " Porque hay muchos productos que podían colocarse bien en Bolivia.",
        "start": 4872.68,
        "end": 4877.68
    },
    {
        "text": " Fortalecer el fondo para la convergencia estructural del Mercosur",
        "start": 4877.68,
        "end": 4881.68
    },
    {
        "text": " si a través de más proyectos, si a través de más agilidad,",
        "start": 4881.68,
        "end": 4884.68
    },
    {
        "text": " si a través de más yerefondos.",
        "start": 4884.68,
        "end": 4886.68
    },
    {
        "text": " Es un instrumento que ha tenido como éxito.",
        "start": 4886.68,
        "end": 4889.68
    },
    {
        "text": " Aposar mecanismos para interactuar con la alianza del Pacífico",
        "start": 4889.68,
        "end": 4892.68
    },
    {
        "text": " con otro proceso de integración del Guadaluro Uauay,",
        "start": 4892.68,
        "end": 4895.68
    },
    {
        "text": " esta por fuera, serrán un tratado comercial con la Vía de Europa.",
        "start": 4896.68,
        "end": 4899.68
    },
    {
        "text": " En eso estamos y sistematizar las relaciones comerciales con China.",
        "start": 4899.68,
        "end": 4903.68
    },
    {
        "text": " Y eso es un tema que, a mí hubiera gustado incorporarlo un poco más en este curso,",
        "start": 4903.68,
        "end": 4907.68
    },
    {
        "text": " pero el tema de la inversión China y los acordos comerciales con China para América,",
        "start": 4907.68,
        "end": 4911.68
    },
    {
        "text": " la Tina son sustanciales.",
        "start": 4911.68,
        "end": 4913.68
    },
    {
        "text": " Porque hoy en día explica mucho de la inversión en la región",
        "start": 4913.68,
        "end": 4916.68
    },
    {
        "text": " y también del comercio con la región.",
        "start": 4916.68,
        "end": 4918.68
    },
    {
        "text": " Sea a través de exportaciones o a través de importaciones.",
        "start": 4918.68,
        "end": 4921.68
    },
    {
        "text": " Donde China es un país que es diferente a lo que se llama.",
        "start": 4922.68,
        "end": 4925.68
    },
    {
        "text": " Porque se abrió el mercado chino, los chinos se están cambiando sus hábitos",
        "start": 4925.68,
        "end": 4930.68
    },
    {
        "text": " y también es cierto que no solo producen materias firmas con baja incorporación",
        "start": 4930.68,
        "end": 4934.68
    },
    {
        "text": " de valor agregado y asuelnos muy baratos.",
        "start": 4934.68,
        "end": 4936.68
    },
    {
        "text": " Hay de todo en eso.",
        "start": 4936.68,
        "end": 4937.68
    },
    {
        "text": " Entonces hay desafíos que son interesantes y las tendencias recientes en China.",
        "start": 4937.68,
        "end": 4941.68
    },
    {
        "text": " Es un tema que en ninguno de los profesionales que trabajamos",
        "start": 4941.68,
        "end": 4945.68
    },
    {
        "text": " en las más diversas áreas nos podemos dejar del lado.",
        "start": 4945.68,
        "end": 4948.68
    },
    {
        "text": " Es una lógica de perspectiva, de los sectores de producción,",
        "start": 4949.68,
        "end": 4953.68
    },
    {
        "text": " la nivel profesional, la nivel económica, la nivel tecnológico todos,",
        "start": 4953.68,
        "end": 4957.68
    },
    {
        "text": " tenemos un poco que mirara cómo se comporta el tema de China.",
        "start": 4957.68,
        "end": 4960.68
    },
    {
        "text": " El tema de los hábitos alimenticios de las chinas de relevante para saber",
        "start": 4960.68,
        "end": 4964.68
    },
    {
        "text": " la demanda de alimentos en nivel mundial.",
        "start": 4964.68,
        "end": 4966.68
    },
    {
        "text": " Si los chinos dejan comer arroz y pasan a comer carne,",
        "start": 4966.68,
        "end": 4971.68
    },
    {
        "text": " porque los volumes son la protección cambia notablemente.",
        "start": 4972.68,
        "end": 4978.68
    },
    {
        "text": " Estoy llevando un caso extremo, pero esas son las preocupaciones.",
        "start": 4978.68,
        "end": 4982.68
    },
    {
        "text": " La capacidad de producción que tienen y la capacidad de agregar valor",
        "start": 4982.68,
        "end": 4986.68
    },
    {
        "text": " y no siempre en las más diversas industrias bien interesantes.",
        "start": 4986.68,
        "end": 4991.68
    },
    {
        "text": " A nivel de Uruguay el marco sur es un proceso no solamente relevante",
        "start": 4995.68,
        "end": 4999.68
    },
    {
        "text": " sino que es determinante para nuestro país, a nivel de lo que es",
        "start": 5000.68,
        "end": 5003.68
    },
    {
        "text": " la estructura económica.",
        "start": 5003.68,
        "end": 5005.68
    },
    {
        "text": " En la última década el marco sur representó un cuarto de las exportaciones",
        "start": 5005.68,
        "end": 5011.68
    },
    {
        "text": " de bienes para Uruguay.",
        "start": 5011.68,
        "end": 5013.68
    },
    {
        "text": " Pero llegó a representar el 50% de las exportaciones de bienes",
        "start": 5013.68,
        "end": 5018.68
    },
    {
        "text": " en los primeros años de creación del marco sur, ha perdido peso",
        "start": 5018.68,
        "end": 5021.68
    },
    {
        "text": " y han cobrado peso otros destinos extraregión.",
        "start": 5021.68,
        "end": 5025.68
    },
    {
        "text": " Analizar ese proceso también es interesante.",
        "start": 5026.68,
        "end": 5030.68
    },
    {
        "text": " Brasil fue el segundo destino de las exportaciones Uruguayas",
        "start": 5030.68,
        "end": 5034.68
    },
    {
        "text": " en el 2016, mientras que Argentina subí en Quinto,",
        "start": 5034.68,
        "end": 5038.68
    },
    {
        "text": " el lugar para Y en el décimo tercero lugar.",
        "start": 5038.68,
        "end": 5042.68
    },
    {
        "text": " Entonces, imagínense si jodo lo rango de destino de exportaciones,",
        "start": 5042.68,
        "end": 5046.68
    },
    {
        "text": " los tres vecinos están en los primeros lugares.",
        "start": 5046.68,
        "end": 5050.68
    },
    {
        "text": " A su vez los vecinos en muchos de los rubros son competidores",
        "start": 5051.68,
        "end": 5055.68
    },
    {
        "text": " con nuestros en otros mercados.",
        "start": 5055.68,
        "end": 5058.68
    },
    {
        "text": " Competimos en los...",
        "start": 5058.68,
        "end": 5060.68
    },
    {
        "text": " Y para guay es un país que ha crecido mucho,",
        "start": 5060.68,
        "end": 5064.68
    },
    {
        "text": " que ha sido muy atractivo en la recepción de inversiones",
        "start": 5064.68,
        "end": 5067.68
    },
    {
        "text": " y que ha desarrollado a mejorado su calidad de carne",
        "start": 5067.68,
        "end": 5070.68
    },
    {
        "text": " y su producción de carne y de arroz y de otros productos",
        "start": 5070.68,
        "end": 5073.68
    },
    {
        "text": " que conviten con Uruguay que ha sido bien interesante.",
        "start": 5073.68,
        "end": 5076.68
    },
    {
        "text": " Su rendimiento, su productividad es un actor que está empezando a jugar.",
        "start": 5077.68,
        "end": 5082.68
    },
    {
        "text": " Y un socio importante que teníamos de nivel comercial era Venezuela.",
        "start": 5085.68,
        "end": 5089.68
    },
    {
        "text": " La situación compleja por ítica Venezuela está afectada directamente Uruguay.",
        "start": 5089.68,
        "end": 5094.68
    },
    {
        "text": " Sobre todos los lácteos, a muchos destinos de exportación que estaban muy atados.",
        "start": 5094.68,
        "end": 5100.68
    },
    {
        "text": " Si se analiza la composición de exportaciones uruguayas,",
        "start": 5100.68,
        "end": 5103.68
    },
    {
        "text": " es el Nercosurso, observa un aumento en el peso de los alimentos",
        "start": 5104.68,
        "end": 5107.68
    },
    {
        "text": " que pasaron del 38% en el año 94% al 50% en el 2016.",
        "start": 5107.68,
        "end": 5113.68
    },
    {
        "text": " Y de suministros industriales elaborados que aumentaron del 24%",
        "start": 5113.68,
        "end": 5118.68
    },
    {
        "text": " en el 94% al 30% en el 2016 con algunos baívenes en el medio.",
        "start": 5118.68,
        "end": 5123.68
    },
    {
        "text": " Después hay que mirar más del detalle rúbrio,",
        "start": 5123.68,
        "end": 5126.68
    },
    {
        "text": " por ejemplo, pero también es importante que sepa las grandes tendencias",
        "start": 5126.68,
        "end": 5132.68
    },
    {
        "text": " y todos los detalles era más complejo para capitalizar toda la información.",
        "start": 5132.68,
        "end": 5136.68
    },
    {
        "text": " Dentro de los procesos recientes del Mercosur, bueno,",
        "start": 5138.68,
        "end": 5141.68
    },
    {
        "text": " tienen un detalle sobre el tema de la cuota que quedó totalmente de moded",
        "start": 5141.68,
        "end": 5146.68
    },
    {
        "text": " en la presentación del domingo al Nércoles,",
        "start": 5146.68,
        "end": 5149.68
    },
    {
        "text": " pero ahí un poco se explicaba cómo era el planteo de la cuota",
        "start": 5149.68,
        "end": 5153.68
    },
    {
        "text": " y ahora con esto no sé cómo va a terminar,",
        "start": 5153.68,
        "end": 5156.68
    },
    {
        "text": " así que como no está en el material nos voy a preguntar la revisión,",
        "start": 5156.68,
        "end": 5160.68
    },
    {
        "text": " más importante que sepa mal a la procesa, pero queríamos ejemplo de Cica.",
        "start": 5160.68,
        "end": 5164.68
    },
    {
        "text": " Y después quería hablar de los otros procesos que habíamos de los mecanismos,",
        "start": 5166.68,
        "end": 5170.68
    },
    {
        "text": " eso es diferenciado con procesos de mecanismos porque esto es como integración,",
        "start": 5170.68,
        "end": 5173.68
    },
    {
        "text": " propiamente, dicha, los otros son parte de algunos mecanismos,",
        "start": 5173.68,
        "end": 5177.68
    },
    {
        "text": " pero no logran la profundización y la importancia que logran el resto.",
        "start": 5177.68,
        "end": 5181.68
    },
    {
        "text": " ¿Qué es la CEJIP?",
        "start": 5182.68,
        "end": 5183.68
    },
    {
        "text": " La CEJIP es básicamente una institución destinada al tema de cooperación internacional.",
        "start": 5184.68,
        "end": 5189.68
    },
    {
        "text": " Es la Secretaría General Iberoamericana, o sea que esa nivel de Iberoamerica",
        "start": 5190.68,
        "end": 5194.68
    },
    {
        "text": " es un proceso multilateral bastante amplio,",
        "start": 5194.68,
        "end": 5196.68
    },
    {
        "text": " que lo que hace es coordinar las cumbres Iberoamericanas de la comunidad Iberoamericana de Naciones.",
        "start": 5197.68,
        "end": 5203.68
    },
    {
        "text": " Tiene un papel central, no solamente en coordinar estas cumbres,",
        "start": 5204.68,
        "end": 5207.68
    },
    {
        "text": " sino que además tiene una lógica importante en todo lo que es el desarrollo",
        "start": 5207.68,
        "end": 5214.68
    },
    {
        "text": " de los sistemas instituciones de cooperación a nivel de Iberoamerica,",
        "start": 5214.68,
        "end": 5218.68
    },
    {
        "text": " internacional, multilateral, o sea, tiene una lógica muy fuerte en todo lo que son los temas de cooperación.",
        "start": 5218.68,
        "end": 5226.68
    },
    {
        "text": " La CEJIP, relativamente reciente, tiene ese de Madrid, la CEJIP.",
        "start": 5227.68,
        "end": 5233.68
    },
    {
        "text": " La CEJIP es la comunidad de Estados latinoamericanos y Caribeños, la barca.",
        "start": 5235.68,
        "end": 5242.68
    },
    {
        "text": " Todos los Estados latinoamericanos son mecanismos que se creó a nivel intergúbernamental",
        "start": 5243.68,
        "end": 5248.68
    },
    {
        "text": " para dialogar y la concertación política.",
        "start": 5249.68,
        "end": 5252.68
    },
    {
        "text": " Entonces, lo que busca la CEJIP es generar un compromiso para avanzar en un proceso gradual de integración,",
        "start": 5253.68,
        "end": 5259.68
    },
    {
        "text": " buscando un equilibrio y unidad entre los países que forman este bloque",
        "start": 5260.68,
        "end": 5264.68
    },
    {
        "text": " en términos de la política comercial, económica, política y social.",
        "start": 5264.68,
        "end": 5269.68
    },
    {
        "text": " Surgen el año 2011, súper reciente, la CEJIP.",
        "start": 5273.68,
        "end": 5276.68
    },
    {
        "text": " Y ha contribuido básicamente a un diálogo entre todos los países en temas de desarrollo social,",
        "start": 5277.68,
        "end": 5282.68
    },
    {
        "text": " participan muy activamente los ministerios de desarrollo social de la región, por ejemplo.",
        "start": 5283.68,
        "end": 5286.68
    },
    {
        "text": " La educación, los organismos de la educación también,",
        "start": 5287.68,
        "end": 5292.68
    },
    {
        "text": " también para ayudar a todo lo que es agricultura familiar, políticas de género,",
        "start": 5293.68,
        "end": 5298.68
    },
    {
        "text": " finanzas y microfinanzas, desarrollos energéticos, medio ambiente, desarmenuclear.",
        "start": 5298.68,
        "end": 5305.68
    },
    {
        "text": " Es el único interlocutor que puede promover y proyectar como una voz única de América Latina y el Caribe,",
        "start": 5307.68,
        "end": 5313.68
    },
    {
        "text": " que va bastante difícil, pero las reuniones con sus baivenes han tenido como objetivo una inserción",
        "start": 5314.68,
        "end": 5320.68
    },
    {
        "text": " y proyección de la región en el Amito Internacional a través de estos objetivos para la región.",
        "start": 5321.68,
        "end": 5325.68
    },
    {
        "text": " Asume interlocución con la Unión Europea, hay un foro de diálogo para comunicarse con Rusia.",
        "start": 5326.68,
        "end": 5332.68
    },
    {
        "text": " Entonces, una forma de que la región toda América Latina y el Caribe tiene para,",
        "start": 5333.68,
        "end": 5338.68
    },
    {
        "text": " de alguna forma, promover el desarrollo económico, social, política en la región y también",
        "start": 5339.68,
        "end": 5344.68
    },
    {
        "text": " insertarse en otros procesos más amplios y con otros bloques.",
        "start": 5345.68,
        "end": 5348.68
    },
    {
        "text": " De esta forma, la Celac puede decirse que es un mecanismo de diálogo y concertación",
        "start": 5349.68,
        "end": 5354.68
    },
    {
        "text": " política en la región, de unificación de criterios, de cooperación en la región,",
        "start": 5355.68,
        "end": 5359.68
    },
    {
        "text": " un mecanismo para articular y trabajar sobre la base del consenso, tratando de que las asimetrías",
        "start": 5360.68,
        "end": 5367.68
    },
    {
        "text": " no pese en estos diálogos, es un foro que avanza en la convergencia y en las acciones comunes",
        "start": 5368.68,
        "end": 5373.68
    },
    {
        "text": " entre las diferentes y buscar una plataforma para crear mayor presencia de nuestra región en el mundo.",
        "start": 5374.68,
        "end": 5379.68
    },
    {
        "text": " Son un espacio que lo que busca es hacer frente en forma de comunar todos los problemas que tenemos en común,",
        "start": 5383.68,
        "end": 5387.68
    },
    {
        "text": " un espacio de discusión, sin ni que hablar, ¿a qué grandes problemas en la región que tenemos?",
        "start": 5388.68,
        "end": 5394.68
    },
    {
        "text": " Por ejemplo, esto, Uruguay a veces, es tampoco ajeno porque por todo el tema de la violencia,",
        "start": 5395.68,
        "end": 5399.68
    },
    {
        "text": " el narcotráfico, a pesar de que nosotros a veces vemos como un deterioro en esos indicadores,",
        "start": 5400.68,
        "end": 5406.68
    },
    {
        "text": " a lo que pasa en la región, es bastante importante, si uno cuantifica, por ejemplo,",
        "start": 5407.68,
        "end": 5412.68
    },
    {
        "text": " la muerte de jóvenes en algunos países centros médicanos por los temas del narcotráfico,",
        "start": 5413.68,
        "end": 5417.68
    },
    {
        "text": " es casi un genocidio, son millones.",
        "start": 5418.68,
        "end": 5421.68
    },
    {
        "text": " Entonces, bueno, una cosa importante que tiene la ACELAC es una declaración que se firmó donde",
        "start": 5422.68,
        "end": 5431.68
    },
    {
        "text": " se resaltan los aspectos más importantes a trabajar y entre ellos destacan la seguridad alimentaria,",
        "start": 5432.68,
        "end": 5437.68
    },
    {
        "text": " la devolución de guantánamo a la apcuba, la necesidad de promover de poner final lo que de Estados Unidos con Cuba,",
        "start": 5438.68,
        "end": 5443.68
    },
    {
        "text": " la protección de los migrantes en América Latina y el Caribe, la lucha contra la corrupción,",
        "start": 5444.68,
        "end": 5448.68
    },
    {
        "text": " la reestructuración de la deuda soberana y el apoyo al proceso de paz en Colombia.",
        "start": 5448.68,
        "end": 5452.68
    },
    {
        "text": " Entonces, tiene una connotación de sobre las temas de políticos y paz que han como cobrado importancia a la agenda.",
        "start": 5453.68,
        "end": 5458.68
    },
    {
        "text": " Bien, el otro proceso, la LADY, que habíamos hablado que es el 80 y puedo de la permanece.",
        "start": 5460.68,
        "end": 5465.68
    },
    {
        "text": " La LADY, como que ha tenido relativamente poco peso pero está ahí.",
        "start": 5466.68,
        "end": 5469.68
    },
    {
        "text": " La LADY lo que sí crea es el mayor grupo latinoamericano de integración comercial y es puramente comercial.",
        "start": 5471.68,
        "end": 5477.68
    },
    {
        "text": " Son 13 países los que entera en la LADY. Argentina, Bolivia, Brasil, Chile, Colombia, Cuba, Ecuador, México,",
        "start": 5478.68,
        "end": 5485.68
    },
    {
        "text": " para Uyperur, Uybenesuela. Lo leí porque se me voy a olvidar de algunos.",
        "start": 5486.68,
        "end": 5490.68
    },
    {
        "text": " Les por lo tienen.",
        "start": 5491.68,
        "end": 5492.68
    },
    {
        "text": " Representan un conjunto de 20 millones de kilómetros cuadrados y más de 510 millones de habitantes,",
        "start": 5494.68,
        "end": 5499.68
    },
    {
        "text": " para que tengan idea de qué mercado estamos hablando.",
        "start": 5500.68,
        "end": 5502.68
    },
    {
        "text": " ¿Se crean por el tratado de Montevideo en 1980?",
        "start": 5504.68,
        "end": 5507.68
    },
    {
        "text": " Está ahí, cerquita. Le dije, ¿no? Le dije a la OLA VÑO en Postal, atrás de los Telivis.",
        "start": 5508.68,
        "end": 5514.68
    },
    {
        "text": " En frente al disco, que está ahí en la Rambla.",
        "start": 5515.68,
        "end": 5517.68
    },
    {
        "text": " Y bueno, lo que busca es mayor flexibilidad, tratamiento diferenciales en base en nivel de desarrollo de los miembros,",
        "start": 5520.68,
        "end": 5526.68
    },
    {
        "text": " tratar de cuidar los más protegidos, multiplicar instrumentos de estructuras comerciales.",
        "start": 5527.68,
        "end": 5532.68
    },
    {
        "text": " Lo que tiene un conjunto de acuerdos en términos comerciales que a veces sirven para salvar contra overse.",
        "start": 5532.68,
        "end": 5539.68
    },
    {
        "text": " De hecho, nosotros tenemos un problema con Perú. Perú nos pone unos aranceles a algunos productos, a híricolas.",
        "start": 5541.68,
        "end": 5548.68
    },
    {
        "text": " Ahora han bajado esto. Bajo casi a cero y subieron un poquito, pero tuvieron bastante alto.",
        "start": 5551.68,
        "end": 5556.68
    },
    {
        "text": " Hace un cuestión de un año o dos, tuvieron bastante alto.",
        "start": 5557.68,
        "end": 5559.68
    },
    {
        "text": " Entonces, ¿urgo ahí podía hacer dos cosas?",
        "start": 5560.68,
        "end": 5562.68
    },
    {
        "text": " Era la organización mundial de comercio y llegaron a controversia.",
        "start": 5563.68,
        "end": 5565.68
    },
    {
        "text": " No teníamos mucho, pues esos son procedimientos muy lentos, muy caros, y que general, las anciones se ponen en términos de cuantas comerciales.",
        "start": 5568.68,
        "end": 5575.68
    },
    {
        "text": " Y como nosotros le vendemos cosas, pero no le compramos nada.",
        "start": 5576.68,
        "end": 5578.68
    },
    {
        "text": " Prácticamente nada, en realidad después no se podía materializar.",
        "start": 5579.68,
        "end": 5581.68
    },
    {
        "text": " Entonces no teníamos de nada.",
        "start": 5582.68,
        "end": 5583.68
    },
    {
        "text": " No empezara a hacer negociaciones políticas y se optó por este camino.",
        "start": 5586.68,
        "end": 5590.68
    },
    {
        "text": " Por ahora viene bastante bien, pero el argumento era que se estaba violando una norma de la ladía.",
        "start": 5591.68,
        "end": 5598.68
    },
    {
        "text": " La ladía lo que propicia es la creación de una área de preferencia económica en la región con el objetivo final de lograr un mercado como un latinoamericano mediante tres mecanismos fundamentales.",
        "start": 5603.68,
        "end": 5613.68
    },
    {
        "text": " Que son preferencia de la ancelaria en la región, acuerdos de alcance regional, con todos los países miembros y acuerdos de alcance partial, donde están algunos de los países miembros.",
        "start": 5613.68,
        "end": 5623.68
    },
    {
        "text": " Entonces, tiene una serie de conjunto de mecanismos en el marco. No te he ido demasiado preso, pero sí existiendo.",
        "start": 5624.68,
        "end": 5629.68
    },
    {
        "text": " El otro proceso importante y también reciente es la UNASUR.",
        "start": 5631.68,
        "end": 5635.68
    },
    {
        "text": " La UNASUR es la unión de naciones sudamericanas. Es un ámbito más que el corte político.",
        "start": 5636.68,
        "end": 5640.68
    },
    {
        "text": " La UNASUR es un proyecto de integración y cooperación que busca incorporar muchas cejes o muchas dimensiones.",
        "start": 5641.68,
        "end": 5650.68
    },
    {
        "text": " De 12 países de independiente de Sudamérica y lo leo de nuevo.",
        "start": 5651.68,
        "end": 5656.68
    },
    {
        "text": " Argentina Bolivia, Brasil, Chile, Colombia, Ecuador, Gullana, Paraguay, Perú, Surinam, Uruguay y Venezuela.",
        "start": 5658.68,
        "end": 5665.68
    },
    {
        "text": " Vieron cómo conviven todas estas cosas. Hay muchos que van a todas las reuniones se encuentran.",
        "start": 5665.68,
        "end": 5670.68
    },
    {
        "text": " Hay temas que se superponen. Son de todo el Uruguay, son pocos y son siempre como los mismos.",
        "start": 5671.68,
        "end": 5676.68
    },
    {
        "text": " El objetivo consiste en construir una manera participativa y consensuada de integración en las dimensiones culturales, sociales, económico, político.",
        "start": 5678.68,
        "end": 5689.68
    },
    {
        "text": " Un tema importante ha sido la resolución de conflictos por la Vía Diplomática.",
        "start": 5690.68,
        "end": 5696.68
    },
    {
        "text": " Uno de los temas importantes que se ha puesto en la UNASUR son los temas del conflicto mantenido entre Colombia y Venezuela, que comenzó en el 2010.",
        "start": 5697.68,
        "end": 5707.68
    },
    {
        "text": " Otro punto importante es avanzar en la integración de Latinoamérica con la Unión Europea.",
        "start": 5708.68,
        "end": 5717.68
    },
    {
        "text": " Y después de otro tema, el que es Uruguay es importante también en 2007 fue las temas de energía en la región.",
        "start": 5718.68,
        "end": 5726.68
    },
    {
        "text": " De todos estos mecanismos, el más viejo de todos que tenemos es la OIA, que es una cuerda multilateral,",
        "start": 5728.68,
        "end": 5734.68
    },
    {
        "text": " la Organización de Estado Americano, que tiene un secretario, ahora son Uruguayos, el Excancillal íntimo amigo de Maduro.",
        "start": 5735.68,
        "end": 5743.68
    },
    {
        "text": " Es un abro man, porque el organismo regional más antiguo del mundo es, cuyo origen se remonta en la primera conferencia internacional americana que se dio un Washington y fue en octubre de 1889 y en abril de 1890.",
        "start": 5744.68,
        "end": 5762.68
    },
    {
        "text": " Fue una reunión en la cual se acordó crear una unión internacional de repúblicas americanas y lo que busca es generar una red de disposiciones y instituciones que segaría a conocerse como sistema interamericano, el más antiguo a nivel del sistema internacional.",
        "start": 5763.68,
        "end": 5780.68
    },
    {
        "text": " La carta de la OIA recién se suscribió en el año 48 en Colombia y entró en Vigencia en el año 51 y después hay algunos documentos que son los claves en la instalación de este mecanismo,",
        "start": 5781.68,
        "end": 5798.68
    },
    {
        "text": " uno que es el protocolo de Buenos Aires, el protocolo de Cartagena de Indias del año 85, el protocolo de Managua en el 93 y el protocolo de Washington en el 92,",
        "start": 5798.68,
        "end": 5807.68
    },
    {
        "text": " que recién entró en Vigencia en el año 97. Vieron que esto tiene mucha cuestión del acuerdo del protocolo de... Bueno, el objetivo de esta de la OIA es contribuir al orden y paz y la justicia para fomentar la solidaridad y abustesar la colaboración y defensa, la soberanía y la integridad territorial y la independencia entre las naciones partes.",
        "start": 5808.68,
        "end": 5834.68
    },
    {
        "text": " Tiene mucho que ver con el tema de la soberanía y la colaboración entre las partes. Son 35 a 2 miembro, no los puse, si quieren los fuzcan.",
        "start": 5834.68,
        "end": 5846.68
    },
    {
        "text": " Y tiene un observador permanente que son 59 de Estados y la Unión Europea y sus temas fundamentales tienen que ver con lo político, lo jurídico y lo social en la región.",
        "start": 5846.68,
        "end": 5862.68
    },
    {
        "text": " Son Uruguay, forma parte del tema, tiene ese en Washington y operan más a nivel de recomendaciones que... Estos mecanismos hay en pregunta cómo funcionan y funcionan con aportes de los Estados partes.",
        "start": 5862.68,
        "end": 5880.68
    },
    {
        "text": " Entonces, son esfuerzos a nivel de los presupuestos nacionales también y, generalmente, sean proporcionales.",
        "start": 5880.68,
        "end": 5886.68
    },
    {
        "text": " Y depende de cada uno. La verdad que no tengo mucha claridad exactamente cuál es cuál ni cuánto es, pero sí son cosas que pesan.",
        "start": 5892.68,
        "end": 5903.68
    },
    {
        "text": " Ya es pesa al máxico, es súper pón, en muchas cosas. Y hay ámbitos de unos que dan en pasis a otros, pero como procesos fuerte y como el que tiene peso y el marco sur.",
        "start": 5903.68,
        "end": 5915.68
    },
    {
        "text": " Bien. Bueno, se entendió ahora todo el proceso de integración regional.",
        "start": 5917.68,
        "end": 5923.68
    },
    {
        "text": " Con esto estaríamos un poco terminando de este módulo, van a tener un montón de conceptos, lo importante es que las pueda leer con atención.",
        "start": 5924.68,
        "end": 5932.68
    },
    {
        "text": " Y el material recomendado es la ficha del año que tienen. Y lo que sí nos preocupamos es que las presentaciones en la de Proyecto de Bóniteórico tengan todo, van a haber una cronología de los hechos históricos, van a tener una explicación detallada.",
        "start": 5933.68,
        "end": 5947.68
    },
    {
        "text": " Nosotros para el año que viene actualizamos todo el material, pero para el año que viene le dejas hacer una ficha anexa a la que estaba integración que es más general.",
        "start": 5948.68,
        "end": 5957.68
    },
    {
        "text": " La semana que viene nos vamos a explicar a Uruguay y le vamos a dar fuerte énfasis este año, más en el análisis de la cusuntura que en todo el proceso histórico.",
        "start": 5958.68,
        "end": 5966.68
    },
    {
        "text": " Pero si vamos a pasar un poquito más rápido por todo el proceso histórico, van a tener un conjunto de materiales recomendados, se lo pueden ir bajando, está todo colgado, además de las presentaciones.",
        "start": 5966.68,
        "end": 5975.68
    },
    {
        "text": " Bueno, tengo un buen fin de semana largo, nos vemos el miércoles.",
        "start": 5975.68,
        "end": 5980.68
    }
]