[
    {
        "text": " Bueno gente, arrancamos. Havimos quedado acá ¿no? Sí. Havamos tratado de hacer una primera",
        "start": 0.0,
        "end": 27.5
    },
    {
        "text": " aproximación con lo que hoy vamos a retomar, que era, ver qué relación tiene la",
        "start": 27.5,
        "end": 33.9
    },
    {
        "text": " oferta agregada de una economía con los precios. No, la oferta agregada que ya sabemos, depende",
        "start": 33.9,
        "end": 42.1
    },
    {
        "text": " de los factores productivos que definimos positivamente de todos, ahí no aparecen los precios",
        "start": 42.1,
        "end": 51.92
    },
    {
        "text": " directamente, pero como la oferta agregada, también lo va a hacer la demanda agregada,",
        "start": 51.92,
        "end": 58.2
    },
    {
        "text": " pero los dos, los vamos a representar o van a estar con estas dos variables como centro",
        "start": 58.2,
        "end": 64.04
    },
    {
        "text": " el análisis, que eran dos variables vinculadas a los grandes problemas macroeconómicos,",
        "start": 64.04,
        "end": 68.0
    },
    {
        "text": " inflación por este lado y por este lado crecimiento económico, tenemos que ver si hay algún",
        "start": 68.0,
        "end": 73.52000000000001
    },
    {
        "text": " tipo de relación entre los precios, lo que pase con estas variables precios y lo que decidan",
        "start": 73.52000000000001,
        "end": 78.76
    },
    {
        "text": " las empresas acerca de la producción de bienes y servicios. Entonces partimos de una situación",
        "start": 78.76,
        "end": 84.52000000000001
    },
    {
        "text": " inicial cualquiera y empezamos a razonar bueno, si bajan los precios, bajan suben, podemos",
        "start": 84.52000000000001,
        "end": 90.68
    },
    {
        "text": " hacerlo para cualquier lado. Si bajan los precios, la conclusión queremos saber qué va a pasar",
        "start": 90.68,
        "end": 95.88000000000001
    },
    {
        "text": " con la oferta agregada y esa manera se va a saber si en realidad vamos a tener una oferta",
        "start": 95.88000000000001,
        "end": 99.4
    },
    {
        "text": " agregada de peñente positiva, una que sea vertical o una de peñente negativo. Entonces,",
        "start": 99.4,
        "end": 104.32000000000001
    },
    {
        "text": " para ese razonamiento como acá no aparece directamente lo que ocurra con los precios,",
        "start": 104.32,
        "end": 110.19999999999999
    },
    {
        "text": " sino que aparecían estas variables, algunas fijas a corto plazo, otras determinantes a",
        "start": 110.19999999999999,
        "end": 116.19999999999999
    },
    {
        "text": " corto plazo es que también retome acá la relación entre mercado de trabajo, donde justamente",
        "start": 116.19999999999999,
        "end": 122.56
    },
    {
        "text": " se determina ese factor productivo clave a corto plazo y una vez que sabemos la cantidad",
        "start": 122.56,
        "end": 127.88
    },
    {
        "text": " empleo que se utilice, venimos y terminamos en la función de producción, poniéndole",
        "start": 127.88,
        "end": 134.84
    },
    {
        "text": " LL que el mercado de trabajo nos diga el nivel de producción. Entonces, el razonamiento",
        "start": 134.84,
        "end": 139.96
    },
    {
        "text": " que habíamos arrancado en los otros días es decir, bueno, pero sí, caen los precios,",
        "start": 139.96,
        "end": 145.0
    },
    {
        "text": " algo de lo de acá dentro se va a haber afectado y habíamos identificado que la variable L,",
        "start": 145.0,
        "end": 151.04
    },
    {
        "text": " la cantidad empleado, podía ser una variable que se va a afectar porque el cambio en los",
        "start": 151.04,
        "end": 155.76
    },
    {
        "text": " precios nos afectaba al salario real, de qué manera afecta el salario real que los precios",
        "start": 155.76,
        "end": 161.76
    },
    {
        "text": " caigan, que los vienes hayan más baratos. Y vamos a tener un mayor poder de compra, ese",
        "start": 161.76,
        "end": 171.12
    },
    {
        "text": " salario real lo hacía mayor, y si el salario es mayor, ¿qué pasa con la oferta de trabajo,",
        "start": 171.12,
        "end": 177.84
    },
    {
        "text": " las personas que hacen si ven esto, qué incentivo tienen, hacer qué cosa, trabajar más o trabajar",
        "start": 177.84,
        "end": 186.0
    },
    {
        "text": " menos. Si suba el salario, más ya que había decisiones",
        "start": 186.0,
        "end": 192.92000000000002
    },
    {
        "text": " contradictorianos que vamos con una, ¿no? ¿Cómo era la relación entre la oferta de trabajo",
        "start": 192.92000000000002,
        "end": 197.28
    },
    {
        "text": " y el salario real? Miremos las curvas, que de alguna manera también nos ayudan a eso,",
        "start": 197.28,
        "end": 203.72
    },
    {
        "text": " ¿qué relación tiene la oferta agregada en este gráfico? A medida que aumenta el salario",
        "start": 203.72,
        "end": 209.16
    },
    {
        "text": " real, ¿qué le pasa a la oferta de agregada? Cres, o sea, nos quedamos más con la relación",
        "start": 209.16,
        "end": 214.76
    },
    {
        "text": " directa, positivo, a mayor salario real entonces la gente va a ofrecer más horas porque les",
        "start": 214.76,
        "end": 221.5
    },
    {
        "text": " salía, pesaba más esto de que les salía más caro y lo ocio, ¿sí? Y la demanda de trabajo",
        "start": 221.5,
        "end": 228.16
    },
    {
        "text": " si suba el salario real, ¿cómo es la relación que nos representa a diégrafico de la demanda",
        "start": 228.16,
        "end": 239.0
    },
    {
        "text": " de trabajo? Negatío, o sea, que si suba el salario real, va a bajarla de mantras, porque",
        "start": 239.0,
        "end": 245.48
    },
    {
        "text": " el salario real aparece como un indicador vinculado a los costos pero que inciden esas ganancias",
        "start": 245.48,
        "end": 251.38
    },
    {
        "text": " y ese empresario entonces va a querer contratar menos gente. Y entonces en el mercado de trabajo",
        "start": 251.38,
        "end": 256.8
    },
    {
        "text": " que vamos a tener, si partimos de una situación de equilibrio y ocurre esto, que la oferta aumenta",
        "start": 256.8,
        "end": 263.96000000000004
    },
    {
        "text": " y la demanda baja. ¿Y eso? ¿Cómo le llamamos? De se empleo. Si vamos a este gráfico entonces",
        "start": 263.96000000000004,
        "end": 283.52
    },
    {
        "text": " ese aumento, perdón, ese descenso de los precios que nos llevó por la caída de los precios,",
        "start": 283.52,
        "end": 292.71999999999997
    },
    {
        "text": " nos llevó un salario real más alto y que ocurrió entonces, que bajó la demanda de trabajo",
        "start": 292.71999999999997,
        "end": 303.91999999999996
    },
    {
        "text": " y que subió la oferta de trabajo y se enojeneró este desempleo. ¿Sí? Entonces ahora, con",
        "start": 303.92,
        "end": 314.8
    },
    {
        "text": " esta situación aparecen dos tipos de ideas. La de los autores clásicos y la de los autores",
        "start": 314.8,
        "end": 327.20000000000005
    },
    {
        "text": " que hay iniciales. ¿Sí? Vamos a arrancar por la de los clásicos. ¿Qué es lo que nos planteaban",
        "start": 327.2,
        "end": 336.92
    },
    {
        "text": " los clásicos? Nos plantean que los mercados tienden al equilibrio. Entonces, algunas características",
        "start": 336.92,
        "end": 343.59999999999997
    },
    {
        "text": " que nos dicen los clásicos es equilibrios y en particular nos hablan de que el mercado de trabajo",
        "start": 343.59999999999997,
        "end": 350.56
    },
    {
        "text": " va a estar en equilibrio. Bien, ¿cuál es el fundamento de estos autores? Dice, bueno, una situación",
        "start": 350.56,
        "end": 357.6
    },
    {
        "text": " de desempleo es insostenible, el largo plazo. Porque hay gente, el número que sea, lo el número que",
        "start": 357.6,
        "end": 364.08
    },
    {
        "text": " habíamos puesto que eran estos acá, que quieren trabajar, no tienen trabajo, entonces cuando van a su",
        "start": 364.08,
        "end": 369.6
    },
    {
        "text": " casa no tienen un mango y si no tienen un mango van a seguir buscando trabajo, hasta que llegue un",
        "start": 369.6,
        "end": 374.24
    },
    {
        "text": " momento que esa desesperación aquí les va a llevar a trabajar por menos plata. Y era aquella",
        "start": 374.24,
        "end": 381.2
    },
    {
        "text": " primera solución, que es una solución mirándole gráfico, nada más, decíamos, bueno, que esto",
        "start": 381.2,
        "end": 388.0
    },
    {
        "text": " va a irse solución. Bueno, de alguna manera, ese es el ajuste que plantean los clásicos.",
        "start": 388.0,
        "end": 392.32
    },
    {
        "text": " Una ajuste de precios y salarios que lleva al salario de equilibrio. Entonces, si hay una situación",
        "start": 393.04,
        "end": 406.04
    },
    {
        "text": " como la que elegimos ahora, porque todo este análisis parte de que supusimos esto, que aumentan",
        "start": 406.04,
        "end": 413.76
    },
    {
        "text": " los precios. Si queramos supuesto al revés, acá el razonamiento, estas grandes ideas se mantienen,",
        "start": 413.76,
        "end": 419.36
    },
    {
        "text": " pero no es que va a bajar el salario, sino que ahí hubiera sido al revés. Entonces, cuál es el",
        "start": 419.36,
        "end": 427.24
    },
    {
        "text": " fundamento y bueno, que los precios y los salarios se van a ajustar, si estamos en una situación",
        "start": 427.24,
        "end": 431.08000000000004
    },
    {
        "text": " de ese equilibrio, del tipo por ejemplo en la que tenemos acá, que es de ese empleo y hay trabajadores",
        "start": 431.08000000000004,
        "end": 436.52000000000004
    },
    {
        "text": " que van a aceptar trabajar por menos, entonces en el mercado del salario baja y en ese caso se ajusta.",
        "start": 436.52000000000004,
        "end": 441.32
    },
    {
        "text": " Si precios y salarios se ajustan y siempre vamos a estar en pleno pleno. Esto es una visión",
        "start": 441.88,
        "end": 447.92
    },
    {
        "text": " del largo plazo.",
        "start": 450.08,
        "end": 451.28
    },
    {
        "text": " Bien, los clásicos no dicen que esto se da de acá fin de año. Dicen al largo plazo,",
        "start": 456.71999999999997,
        "end": 462.88
    },
    {
        "text": " ponen foco en el largo plazo y por eso estas variables precios y salarios son las que nos van a",
        "start": 462.88,
        "end": 467.92
    },
    {
        "text": " auto-regular el mercado, las variables que permiten ese ajuste, una ajuste que nos va a llevar",
        "start": 467.92,
        "end": 475.76
    },
    {
        "text": " siempre a pleno pleno, siempre al salario equilibrio. Entonces, en este caso, la situación de ese empleo,",
        "start": 475.76,
        "end": 483.88
    },
    {
        "text": " que es lo que va a ocurrir, que va a bajar el salario hasta el salario real de equilibrio.",
        "start": 483.88,
        "end": 493.36
    },
    {
        "text": " Subieron los precios, perfecto, bajaron los precios, perfecto, van a bajarlos al salario también y vamos a",
        "start": 494.36,
        "end": 503.52000000000004
    },
    {
        "text": " volver acá. Y si volvemos acá, ¿cuál va a hacer el nivel del empleo? El de pleno pleno. Y si",
        "start": 503.52000000000004,
        "end": 514.6800000000001
    },
    {
        "text": " vamos a estar el nivel del pleno pleno, metemos todos los numeritos dentro de la función de producción y",
        "start": 514.6800000000001,
        "end": 520.6
    },
    {
        "text": " qué nivel de producción vamos a tener el de pleno pleno. Por lo tanto, lo que nos dicen los",
        "start": 520.6,
        "end": 530.32
    },
    {
        "text": " autores clásicos es que la producción es independiente de los precios. Los clásicos ponen foco",
        "start": 530.32,
        "end": 543.28
    },
    {
        "text": " en el largo plazo, variaciones de precios, van a generar ajustes, los clásicos dicen a través",
        "start": 543.28,
        "end": 549.6
    },
    {
        "text": " de los salarios, pero en variables reales, cómo la producción, cómo la empleo no se ven modificados.",
        "start": 549.6,
        "end": 557.0
    },
    {
        "text": " Cambia una variable nominal que fueron los precios, se ajusta a través de otra variable",
        "start": 557.0,
        "end": 562.64
    },
    {
        "text": " enomenada y que es el salario. De manera que el salario real no se toca, no se toca el empleo,",
        "start": 562.64,
        "end": 567.84
    },
    {
        "text": " no se toca la producción. Lo hicimos con una baja de precios. Si lo hubiéramos hecho con una",
        "start": 567.84,
        "end": 572.9200000000001
    },
    {
        "text": " suba de precios y vamos a encontrarlo mismo. Entonces podemos representar a través de una",
        "start": 572.92,
        "end": 581.0799999999999
    },
    {
        "text": " curva vertical lo que es la oferta de los autores clásicos. Que es la oferta y bueno, es esa",
        "start": 581.0799999999999,
        "end": 594.04
    },
    {
        "text": " relación en ese gráfico entre producción y precios, que nos está diciendo que los precios",
        "start": 594.04,
        "end": 600.8399999999999
    },
    {
        "text": " pueden variar, pero que las empresas tomaron sus decisiones en función de otras cosas y por",
        "start": 600.84,
        "end": 605.72
    },
    {
        "text": " lo tanto la producción va a ser siempre a ese nivel. Focaliza en el largo plazo,",
        "start": 605.72,
        "end": 611.0
    },
    {
        "text": " porque estamos en pleno empleo, estamos pensando en la máxima utilización de los factores productivos.",
        "start": 611.0,
        "end": 616.84
    },
    {
        "text": " Recuerden que si estamos en una situación de ese empleo, quién me determina el LL a mí acá.",
        "start": 616.84,
        "end": 622.48
    },
    {
        "text": " La demanda o la oferta, ¿quién es el LL que yo vengo para arriba a ver qué producción?",
        "start": 622.48,
        "end": 630.9200000000001
    },
    {
        "text": " En este caso la demanda. Si hubiéramos estado con un por acá abajo, la oferta, la",
        "start": 630.9200000000001,
        "end": 640.36
    },
    {
        "text": " de acuerdo. Entonces siempre vamos a subir a la función de producción, con valores de empleo",
        "start": 640.36,
        "end": 647.6800000000001
    },
    {
        "text": " que siempre van a ser inferiores al de pleno empleo, nunca van a estar de acá para la derecha.",
        "start": 647.68,
        "end": 651.8399999999999
    },
    {
        "text": " Por lo tanto lo que dicen los clásicos es la máxima producción, es la de pleno empleo y la",
        "start": 651.8399999999999,
        "end": 657.52
    },
    {
        "text": " economía va a producir eso. Aquello de la primera clase, hay algunas marcos teóricos que quieren",
        "start": 657.52,
        "end": 665.3599999999999
    },
    {
        "text": " ver la fluctuación, es analizar con yunturas, hay otros que quieren ver a el largo plazo.",
        "start": 665.3599999999999,
        "end": 669.8399999999999
    },
    {
        "text": " Este es un planteo del largo plazo. Solo la interesa, a el largo plazo que nos puede modificar",
        "start": 669.8399999999999,
        "end": 676.64
    },
    {
        "text": " la oferta agregada. Entonces resumen de esto de acá, tenemos una relación entre la oferta",
        "start": 676.64,
        "end": 682.76
    },
    {
        "text": " agregada, la producción de una economía y sus precios, que es vertical. Autores clásicos entonces",
        "start": 682.76,
        "end": 690.88
    },
    {
        "text": " estas situaciones, estos supuestos de que las variables nominales se ajustan y no llevan",
        "start": 694.84,
        "end": 700.52
    },
    {
        "text": " siempre equilibrio, por lo tanto pleno empleo, máxima producción de una economía, ese podemos",
        "start": 700.6,
        "end": 707.0799999999999
    },
    {
        "text": " ponerlo acá también, entonces la economía va a estar con la máxima producción, que es esta que",
        "start": 707.0799999999999,
        "end": 712.52
    },
    {
        "text": " le llamamos la de pleno empleo. Sí? Bien, aparece este otro autor, Caines.",
        "start": 712.52,
        "end": 729.52
    },
    {
        "text": " Caines se hace famoso con la crisis del 29, el marco teórico del Caines es en los 30,",
        "start": 730.52,
        "end": 743.4
    },
    {
        "text": " que es lo que plantea que existen desequilibrios y en particular uno el desempleo.",
        "start": 744.4,
        "end": 755.92
    },
    {
        "text": " Caines piensa algo distinto, pone el foco en otro lado, en otro en un período de una visión de",
        "start": 761.88,
        "end": 767.88
    },
    {
        "text": " corto plazo. Entonces a la verde se empleo lo que podemos tener es una producción que es menor",
        "start": 767.88,
        "end": 783.88
    },
    {
        "text": " a la del pleno empleo, porque si estamos en desempleo, el lado corto que dijimos recién, vamos",
        "start": 783.88,
        "end": 789.24
    },
    {
        "text": " a estar en alguna situación como está acá, no se la economía produce menos de los 50 mil millones",
        "start": 789.24,
        "end": 794.5600000000001
    },
    {
        "text": " de dólares. ¿Por qué no se da a cuál es el fundamento que plantea Caines? ¿De por qué no se da",
        "start": 794.5600000000001,
        "end": 804.44
    },
    {
        "text": " lo que la hegemonía teórica, no de pensamiento económico planteaba hasta ese entonces que era que había",
        "start": 804.44,
        "end": 810.6
    },
    {
        "text": " equilibrio, que había que pensar en términos de pleno empleo? Bueno, crítica a esto acá, lo que dice",
        "start": 810.6,
        "end": 816.72
    },
    {
        "text": " Caines es que la caída es salarios, en frente, rigidezes. La diferencia con los clásicos más allá del",
        "start": 816.72,
        "end": 834.28
    },
    {
        "text": " resultado final que es lo que acabamos de contar es el supuesto. Uno dice, salarios se ajustan de",
        "start": 834.28,
        "end": 841.76
    },
    {
        "text": " manera automática para poner los cambios en los precios, que ahí nadie dice no, los salarios",
        "start": 841.76,
        "end": 848.08
    },
    {
        "text": " no se pueden ajustar de manera automática, porque enfrentan rigidezes, en que se sustentan esas",
        "start": 848.08,
        "end": 853.8
    },
    {
        "text": " rigidezes y algunas las mencionamos los otros días, acuerdos de salarios, ¿sí? No es lo mismo",
        "start": 853.8,
        "end": 860.3199999999999
    },
    {
        "text": " de civilidad y mira, te vamos a pagar menos, los ajustes a la baja de los salarios son más difíciles",
        "start": 860.3199999999999,
        "end": 864.4399999999999
    },
    {
        "text": " de aceptar, entonces hay ciertas rigidezes en una economía que llevan a suponer esto,",
        "start": 864.44,
        "end": 871.2800000000001
    },
    {
        "text": " entonces a lo sumo lo que podemos plantear acá es que bajen los salarios, ¿sí?",
        "start": 871.2800000000001,
        "end": 878.8000000000001
    },
    {
        "text": " pero que no se llega o vamos a ponerlo por la positiva, pero igual el salario reala y que se",
        "start": 880.8800000000001,
        "end": 892.6
    },
    {
        "text": " llega es menor, es mayor, perdón, al de pleno empleo, al equilibrio, sí, capaz que se",
        "start": 892.6,
        "end": 902.44
    },
    {
        "text": " pueda dar un poquito de ajuste de salarios, o sea, ¿qué es lo que nos dice que hay en ese?",
        "start": 902.44,
        "end": 906.76
    },
    {
        "text": " No es que esto vuelve con la caída de salario y volvemos al mismo nivel,",
        "start": 907.5600000000001,
        "end": 911.52
    },
    {
        "text": " sino que nos dice, bueno, capaz que se da una caída de salarios,",
        "start": 913.72,
        "end": 916.9200000000001
    },
    {
        "text": " pues traen los clásicos, ¿no? clásicos volvemos al mismo nivel,",
        "start": 916.92,
        "end": 924.12
    },
    {
        "text": " ¿qué plantea acá y en es que se pueda dar una caída de salarios? Pero siempre vamos a estar a",
        "start": 926.4399999999999,
        "end": 930.36
    },
    {
        "text": " carribo, no vamos a llegar al equilibrio, y entonces cuál es el resultado que la economía",
        "start": 930.36,
        "end": 942.48
    },
    {
        "text": " igual va a tener desempleo, fruto de la economía que está viviendo caines, que es de crisis,",
        "start": 942.48,
        "end": 948.64
    },
    {
        "text": " que hay gente desocupada, y si están desempleo, cuál es el nivel de empleo que llevamos arriba para la",
        "start": 948.64,
        "end": 955.8000000000001
    },
    {
        "text": " función de producción, en este caso es de la demanda que es menor y por lo tanto la producción",
        "start": 955.8000000000001,
        "end": 964.96
    },
    {
        "text": " va a ser menor a la de pleno empleo, entonces en este caso nos venimos a 42,",
        "start": 964.96,
        "end": 975.6
    },
    {
        "text": " ante una baja de los precios las empresas deciden producir menos, ¿sí? Esto acá vamos a",
        "start": 979.52,
        "end": 987.5600000000001
    },
    {
        "text": " terminarlo entonces, entonces L de demanda va a ser L y va a ser menor al de pleno empleo y entonces",
        "start": 987.56,
        "end": 998.3199999999999
    },
    {
        "text": " vamos a tener una nivel de producción que es menor al de pleno empleo,",
        "start": 998.3199999999999,
        "end": 1002.3599999999999
    },
    {
        "text": " caines entonces y de las diferentes sustentadas en que los salarios no se pueden ajustar para volver al",
        "start": 1006.5999999999999,
        "end": 1014.4399999999999
    },
    {
        "text": " mismo nivel que teníamos al principio, puede haber un pequeño ajuste, podemos aceptar un",
        "start": 1014.44,
        "end": 1018.84
    },
    {
        "text": " pequeño ajuste o no o no aceptarlo, en cualquier caso nos vamos a quedar con un nivel de empleo menor,",
        "start": 1018.84,
        "end": 1025.04
    },
    {
        "text": " al que teníamos antes de la baja de precios y si hay un nivel de empleo menor, la producción es",
        "start": 1025.04,
        "end": 1030.44
    },
    {
        "text": " menor, por lo tanto nuestra pregunta que era ¿qué pasa con la producción de una economía si bajan",
        "start": 1030.44,
        "end": 1035.1200000000001
    },
    {
        "text": " los precios?, ¿cuál es la respuesta con la visión cainesiana? ¿Van a bajar las producción?",
        "start": 1035.1200000000001,
        "end": 1040.0
    },
    {
        "text": " Lo contrario ocurriría si aumentamos los precios y entonces la oferta agregada que",
        "start": 1040.0,
        "end": 1055.36
    },
    {
        "text": " inesiana va a tener un apendiente positivo mostrando en esa relación de que si bajan los precios",
        "start": 1055.36,
        "end": 1062.64
    },
    {
        "text": " van a bajar la producción, la cantidad de producidas.",
        "start": 1063.3600000000001,
        "end": 1067.2
    },
    {
        "text": " Sí, clásicos equilibrios, caines de ese equilibrio, uno en especial en el mercado de trabajo,",
        "start": 1076.96,
        "end": 1086.88
    },
    {
        "text": " ¿por qué en especial? Porque estamos analizando la oferta de bienes y servicios y la oferta de bienes y",
        "start": 1086.88,
        "end": 1091.96
    },
    {
        "text": " servicios tiene el LN como uno de sus factores clavos, entonces para saber qué le pasa de la",
        "start": 1091.96,
        "end": 1098.4
    },
    {
        "text": " producción miramos qué pasa en el mercado de trabajo y en el mercado de trabajo uno dice que",
        "start": 1098.4,
        "end": 1102.72
    },
    {
        "text": " siempre vamos a estar en pleno empleo y por lo tanto siempre vamos a tener la misma nivel de",
        "start": 1102.72,
        "end": 1106.6000000000001
    },
    {
        "text": " producción y los otros no dicen que no, que va a depender de lo que pasa en el mercado de trabajo",
        "start": 1106.6000000000001,
        "end": 1110.72
    },
    {
        "text": " y si bajan los precios, suben salario real, tenemos de ese empleo, se produce, se contratan",
        "start": 1111.28,
        "end": 1117.2
    },
    {
        "text": " menos gente, se produce menos, por lo tanto relación directa. Sí, unos, foco en el corto plazo,",
        "start": 1117.2,
        "end": 1124.8
    },
    {
        "text": " otros, foco en el largo plazo. Esto que acabamos de ver ahora es lo que se le denomina la visión",
        "start": 1124.8,
        "end": 1138.0
    },
    {
        "text": " básica de caines, básica o intermedia, ¿por qué? Porque tenemos también una visión extrema",
        "start": 1138.0,
        "end": 1152.16
    },
    {
        "text": " de caines y la visión extrema déjenme marcarle esto también acá, esto de las",
        "start": 1152.16,
        "end": 1169.0
    },
    {
        "text": " rigidezes en el ajuste es fundamental, ¿no? Para uno dijimos que son ajustes automáticos que",
        "start": 1169.0,
        "end": 1175.96
    },
    {
        "text": " no llevan al equilibrio, el otro dice que se enfrenta a rigidezes, en la visión extrema que es",
        "start": 1175.96,
        "end": 1181.92
    },
    {
        "text": " lo que dice caines, no que enfrentan rigidezes sino que estas dos variables son fijas, ¿sí?",
        "start": 1181.92,
        "end": 1193.56
    },
    {
        "text": " No rígidas, no que bajan pero no tanto, no, rígidas, fijas, totalmente, ¿por qué? Porque estamos en",
        "start": 1195.08,
        "end": 1203.8
    },
    {
        "text": " una crisis y esa crisis además la causa de esto es que estamos en una crisis y en una crisis de demanda.",
        "start": 1203.8,
        "end": 1214.68
    },
    {
        "text": " ¿Por qué no produce en las empresas? ¿Por qué hay desempleo? Y porque la gente está en",
        "start": 1217.1599999999999,
        "end": 1221.94
    },
    {
        "text": " medio de una crisis y no consume muchos bienes y servicios, por lo tanto no demanda muchos bienes",
        "start": 1221.94,
        "end": 1227.3999999999999
    },
    {
        "text": " y servicios y hay empresas que entonces no producen todo lo que su capacidad les permitiría,",
        "start": 1227.3999999999999,
        "end": 1232.68
    },
    {
        "text": " imaginemos no que ese también es otro concepto de esta visión, un precio de cizareario fijo y",
        "start": 1232.68,
        "end": 1240.0
    },
    {
        "text": " capacidad ociosa. O sea, estamos con fábricas que hay algunas líneas de producción que nos",
        "start": 1240.0,
        "end": 1250.52
    },
    {
        "text": " están utilizando, tenemos la mitad de la fábrica parada, ¿por qué? Y porque si la ponemos a producir,",
        "start": 1250.52,
        "end": 1256.8400000000001
    },
    {
        "text": " no le vamos a vender a nadie, pues estamos en una crisis. Entonces como eso ocurre así, lo que",
        "start": 1256.84,
        "end": 1262.04
    },
    {
        "text": " dice es, si hubiera que producir más, eso no va a implicar mayor expresión, mayor esalario.",
        "start": 1262.04,
        "end": 1268.12
    },
    {
        "text": " ¿Por qué hay desempleo? Entonces, ¿por qué no hay que pagarle más? Si en realidad hay gente que",
        "start": 1268.12,
        "end": 1272.76
    },
    {
        "text": " la podemos conseguir al mismo precio y salir a producir más que eso requiera vender más caro,",
        "start": 1272.76,
        "end": 1278.84
    },
    {
        "text": " tampoco, porque hay crisis, tengo la fábrica parada, entonces puedo producir más. Con lo cual,",
        "start": 1278.84,
        "end": 1284.24
    },
    {
        "text": " esta visión nos termina diciendo que producir más, si quiero producir 42 o si quiero producir 44,",
        "start": 1284.24,
        "end": 1296.68
    },
    {
        "text": " no me va a modificar acá el nivel de precios. Los costos de producción no se van a haber afectados",
        "start": 1296.68,
        "end": 1302.8
    },
    {
        "text": " por esta razón que decíamos, la fábrica la tengo ahí, tengo todo ahí, es cuestión de prendarlo",
        "start": 1302.8,
        "end": 1307.6
    },
    {
        "text": " para si tengo las señales que puedo vender lo que produzca. Entonces, para cualquier nivel,",
        "start": 1307.6,
        "end": 1314.4399999999998
    },
    {
        "text": " para el mismo nivel de precios yo puedo producir más sin necesidad de eso de que cambie los costos",
        "start": 1314.4399999999998,
        "end": 1321.6799999999998
    },
    {
        "text": " y por lo tanto cambiar los precios. Es una visión extrema y extrema porque, y porque que hay",
        "start": 1321.6799999999998,
        "end": 1328.3999999999999
    },
    {
        "text": " que vivir en un mundo, el cual esto era lo que primado. Entonces esto rompía los ojos de que",
        "start": 1328.3999999999999,
        "end": 1334.9199999999998
    },
    {
        "text": " en una crisis pensaron estos términos, ya quedaron arriba a algo. Entonces, ¿cómo salió a",
        "start": 1334.92,
        "end": 1339.64
    },
    {
        "text": " derribar esto? Y bueno, ¿qué es lo que dicen los clásicos? ¿Qué se ajusta automáticos?",
        "start": 1339.64,
        "end": 1344.48
    },
    {
        "text": " Yo digo, todo lo contrario, ¿sí? Son fijos, ninguna justiña, hable ajuste. Fijos. Y ahí",
        "start": 1344.48,
        "end": 1351.8400000000001
    },
    {
        "text": " aparece esta visión, bien para explicar periódos que en este caso son de muy corto plazo, ¿no?",
        "start": 1351.8400000000001,
        "end": 1358.24
    },
    {
        "text": " Entonces, nosotros con qué estamos terminando con una relación, con ideas de la oferta agregada,",
        "start": 1364.92,
        "end": 1376.96
    },
    {
        "text": " que en este último caso estamos agregando el dato de ¿qué plazo es que queremos mirar? Si",
        "start": 1376.96,
        "end": 1386.8400000000001
    },
    {
        "text": " es de largo, de corto, de muy corto plazo y en función de esa visión del plazo es que vamos",
        "start": 1386.8400000000001,
        "end": 1392.44
    },
    {
        "text": " a ver cuál usamos, si usamos la ciudad de los clásicos, la ciudad de los que iniciaron. Y acá",
        "start": 1392.44,
        "end": 1397.8400000000001
    },
    {
        "text": " estamos terminando lo que es una especie de abordaje o de presentación de esta primera",
        "start": 1397.8400000000001,
        "end": 1403.48
    },
    {
        "text": " mitad del modelo de oferta y demanda que era la oferta. ¿Cómo se comporta la oferta? ¿Sí? En",
        "start": 1403.48,
        "end": 1410.56
    },
    {
        "text": " términos resumen, depende de estos factores productivos, con todo lo que hablamos, tienes esas",
        "start": 1410.56,
        "end": 1415.92
    },
    {
        "text": " relaciones con los precios que pasan por acá, por ver lo que ocurren en el mercado de trabajo,",
        "start": 1415.92,
        "end": 1420.76
    },
    {
        "text": " y ahí hay cosas que hemos visto, y ese mercado de trabajo se enquien definitivo nos está",
        "start": 1420.76,
        "end": 1425.24
    },
    {
        "text": " poniendo el dato acá de NL para que con los demás factores productivos veamos que le pasan",
        "start": 1425.24,
        "end": 1429.4
    },
    {
        "text": " la producción. Y ahí tenemos cierta conducta a nivel macro, a nivel global de una economía,",
        "start": 1429.4,
        "end": 1434.76
    },
    {
        "text": " de por qué las empresas terminan produciendo más o menos. En función de algunas variables macro,",
        "start": 1434.76,
        "end": 1440.36
    },
    {
        "text": " ¿no? De esta que pusimos acá dentro, pero ya vimos de los precios el juego del salario real",
        "start": 1440.36,
        "end": 1445.8799999999999
    },
    {
        "text": " ahí. ¿Sí? ¿Qué es claro?",
        "start": 1445.88,
        "end": 1451.64
    },
    {
        "text": " Una cuestión final y con esto sí cerramos el capítulo dos de la ficha.",
        "start": 1458.8000000000002,
        "end": 1465.92
    },
    {
        "text": " Si nosotros tenemos acá el nivel de pleno empleo, ¿no?",
        "start": 1476.48,
        "end": 1479.68
    },
    {
        "text": " Y acá tenemos la oferta agregada, según la visión clásica. ¿Cómo podemos incrementar",
        "start": 1483.2,
        "end": 1491.96
    },
    {
        "text": " el PBI? ¿Cómo con esta visión a largo plazo podemos pensar que la economía es crezca?",
        "start": 1493.16,
        "end": 1499.72
    },
    {
        "text": " ¿Qué cosas podemos hacer para que en vez de 60 tengamos un PBI de 70 a largo plazo?",
        "start": 1500.32,
        "end": 1510.3600000000001
    },
    {
        "text": " Uno de pleno empleo, pero a nivel de 70. ¿Qué nos puede llevar esta curva para acá?",
        "start": 1510.3600000000001,
        "end": 1517.16
    },
    {
        "text": " O sea, que al mismo nivel de precios, porque ya vimos que los precios no le afectan a la producción,",
        "start": 1517.16,
        "end": 1526.2
    },
    {
        "text": " según la visión clásica, pero que al mismo nivel de precios ya obtenga más producción.",
        "start": 1526.2,
        "end": 1531.1200000000001
    },
    {
        "text": " ¿Cuáles son los factores que a largo plazo van a explicar el crecimiento según los autores clásicos?",
        "start": 1535.2,
        "end": 1541.3600000000001
    },
    {
        "text": " Los factores productivos, ¿el cu? ¿Qué es lo que estoy preguntando pensando en términos de",
        "start": 1543.76,
        "end": 1549.72
    },
    {
        "text": " este gráfico? ¿Cómo que es lo que quiero hacer con este gráfico acá yo? Es plazar esto para",
        "start": 1549.72,
        "end": 1556.2
    },
    {
        "text": " acá riem. O sea, lo que estoy buscando es que esos crezca, que para un mismo nivel de empleo,",
        "start": 1556.2,
        "end": 1562.32
    },
    {
        "text": " por ejemplo, produzca más. Y eso como dice compañero como lo puedo lograr y a través de esta variable,",
        "start": 1562.32,
        "end": 1568.4
    },
    {
        "text": " cambios tecnológicos, ¿sí? Un incremento entonces acá de la tecnología me va a modificar el nivel",
        "start": 1568.4,
        "end": 1578.16
    },
    {
        "text": " máximo de producción, porque tengo todo el agente trabajando, una economía plena o empleo,",
        "start": 1578.16,
        "end": 1583.48
    },
    {
        "text": " pero tengo mayor tecnología para combinar los factores productivos. Eso me va a dar como resultado",
        "start": 1583.48,
        "end": 1589.5600000000002
    },
    {
        "text": " más bien es y servicios. Pero ¿qué más también puedo usar? Invertir más, el maquinario.",
        "start": 1589.5600000000002,
        "end": 1597.92
    },
    {
        "text": " Entonces, sin vierto más en maquinarias tengo el mismo resultado y lo mismo con los recursos",
        "start": 1598.92,
        "end": 1605.6000000000001
    },
    {
        "text": " naturales. Bien, cualquiera de esos factores productivos entonces con la mirada del largo plazo nos",
        "start": 1605.6,
        "end": 1615.36
    },
    {
        "text": " van a estar haciendo crecer. Dicho otra manera, por más que ya estemos en plena o empleo que los",
        "start": 1615.36,
        "end": 1621.3999999999999
    },
    {
        "text": " clásicos nos digan que cualquier cambio de precios o salarios no nos vamos a modificar la producción",
        "start": 1621.3999999999999,
        "end": 1628.1999999999998
    },
    {
        "text": " de plena o empleo si podemos pensar en términos de crecimiento, cuáles son los factores. Y ahí pasa",
        "start": 1628.1999999999998,
        "end": 1634.6399999999999
    },
    {
        "text": " por esto. Y hay que os similar, sólo que concurro a que nos representan de esto otro que habíamos",
        "start": 1634.64,
        "end": 1643.88
    },
    {
        "text": " hablado antes de manera diferente, o sea de que las empresas reaccionan de antecamios en los precios,",
        "start": 1643.88,
        "end": 1650.1200000000001
    },
    {
        "text": " pero también puedo pensar, esta es la que inesiana básica, también puedo pensar lo mismo.",
        "start": 1650.1200000000001,
        "end": 1658.5200000000002
    },
    {
        "text": " ¿Qué pasa a un mismo nivel de precios y yo incremento el uso de la tecnología?",
        "start": 1658.52,
        "end": 1668.84
    },
    {
        "text": " Sin cremento, tecnología, capital, recursos naturales. Y bueno, mismo, tengo que representar que eso",
        "start": 1671.72,
        "end": 1682.08
    },
    {
        "text": " me va a implicar más producción, que aún mismo siempre pensando en desempleo, por eso los números",
        "start": 1682.08,
        "end": 1688.4399999999998
    },
    {
        "text": " que acá invento tienen esa particularidad, que acá no pongo el nivel de pleno empleo, acá me",
        "start": 1688.4399999999998,
        "end": 1694.1599999999999
    },
    {
        "text": " pongo un 48, que es menor al de pleno empleo, porque estamos con la idea que inesiana, la idea que",
        "start": 1694.1599999999999,
        "end": 1701.08
    },
    {
        "text": " inesiana se sustenta en esa mirada de corto plazo con desempleo. Entonces lo que me dice es bueno,",
        "start": 1701.08,
        "end": 1706.48
    },
    {
        "text": " ¿cómo puedo ir desde el desempleo a pleno empleo o a otro menor todavía 55? ¿Cómo hizo los",
        "start": 1706.48,
        "end": 1713.8600000000001
    },
    {
        "text": " factores productivos en los mismos? Bien.",
        "start": 1713.8600000000001,
        "end": 1719.96
    },
    {
        "text": " Acabamos de determinar entonces con este tema el capítulo 2 del material bibliográfico.",
        "start": 1728.3600000000001,
        "end": 1734.72
    },
    {
        "text": " Yo les había dicho, diré anunciando a medida que vamos avanzando en los énfasis, ¿no?",
        "start": 1735.24,
        "end": 1740.0
    },
    {
        "text": " Realía los énfasis y los van viendo ustedes. Lo que vamos a ir avanzando son puntos que están",
        "start": 1740.0,
        "end": 1745.0
    },
    {
        "text": " en la bibliografía, que no los vimos y quedado que no los vimos, quedado no, que además de no",
        "start": 1745.0,
        "end": 1751.0
    },
    {
        "text": " verlos tampoco los vamos a preguntar, o sea que sugerencia para no llenarse de tantos temas,",
        "start": 1751.0,
        "end": 1756.64
    },
    {
        "text": " déjenlos del agua, no tená hora que esto no lo vamos a ver. El capítulo 2 tiene cinco capítulos,",
        "start": 1756.64,
        "end": 1762.72
    },
    {
        "text": " hay un cuarto, su capítulo, sus secciones, hay un cuarto capítulo ahí, el 2.4 de la curva",
        "start": 1762.72,
        "end": 1768.8
    },
    {
        "text": " de oferta agregada, que en la sección 4 y habla de explicaciones más recientes de la oferta agregada,",
        "start": 1768.8,
        "end": 1777.28
    },
    {
        "text": " o sea en ese su capítulo 2.4 van a tener el caso clásico, que es lo que vimos acá,",
        "start": 1777.28,
        "end": 1782.44
    },
    {
        "text": " el caso que inesea no básico, el caso que inesea no extremo y hay un cuarto, que es lo que no",
        "start": 1782.44,
        "end": 1788.56
    },
    {
        "text": " vamos a dar, que son esas explicaciones más recientes de la oferta agregada. Eso es un tema que hace",
        "start": 1788.56,
        "end": 1795.76
    },
    {
        "text": " ya un par de años que no ve.",
        "start": 1795.76,
        "end": 1798.52
    },
    {
        "text": " Bueno, en alguna consulta, antes de pasar a la demanda agregada,",
        "start": 1825.76,
        "end": 1853.6
    },
    {
        "text": " no va quedando clar a la cosa.",
        "start": 1853.6,
        "end": 1868.6
    },
    {
        "text": " Compañero, pregunta si la visión actual es la que inesea en la básica, la visión de quién,",
        "start": 1868.6,
        "end": 1879.28
    },
    {
        "text": " te preguntaría yo. Con que se maneja, repito para las cámaras, depende si hoy lo que queremos",
        "start": 1879.28,
        "end": 1891.12
    },
    {
        "text": " analizar es con el modelo, no, nos falta la demanda, pero cuando se remo, queremos analizar,",
        "start": 1891.12,
        "end": 1897.1599999999999
    },
    {
        "text": " ¿qué le va a pasar con Nueva Uruguay? Ya, acá fin de año, tenemos que ir a usar herramientas",
        "start": 1897.16,
        "end": 1901.48
    },
    {
        "text": " que inesean. Ahora sí, hoy queremos pensar en Uruguay al 2040 y ahí vamos a tener que pensar",
        "start": 1901.48,
        "end": 1907.72
    },
    {
        "text": " con las cidades clásicas, poco nos va a importar esto de las rigidezes, o sea es como que uno tiene",
        "start": 1907.72,
        "end": 1912.5600000000002
    },
    {
        "text": " que hacer el foco, ¿qué es lo que quiero ver? Quiero ver Uruguay al 2040 por donde puede crecer y el",
        "start": 1912.5600000000002,
        "end": 1918.72
    },
    {
        "text": " tema de ajustes de salario no me preocuparía, si me preocuparía por introducir cambios tecnológicos,",
        "start": 1918.72,
        "end": 1925.16
    },
    {
        "text": " o sea, el tema no es cuál sirve y cuál no sino que, cuál usamos para pensar de una manera y",
        "start": 1925.16,
        "end": 1931.1200000000001
    },
    {
        "text": " cuál de otro, ¿sí? Es la compañía pregunta si la diferenciación entre una autor y otro es",
        "start": 1931.1200000000001,
        "end": 1942.52
    },
    {
        "text": " por lo de los ciclos, no, en realidad los que inesean nos van a preocuparse más por la parte de",
        "start": 1942.52,
        "end": 1948.5600000000002
    },
    {
        "text": " ciclos de estudiar cortoplaso y los clásicos a los ciclos no le dan bolilla, porque quieren",
        "start": 1948.5600000000002,
        "end": 1953.8000000000002
    },
    {
        "text": " pensar en largo plazo, entonces van a la de la tendencia, me paro hoy en el 2017 y quiero",
        "start": 1953.8,
        "end": 1958.96
    },
    {
        "text": " ver en el 2040 que tengo que hacer si quiero que Uruguay tenga más bien necesarios, crezca, un",
        "start": 1958.96,
        "end": 1964.44
    },
    {
        "text": " pedí mayor, entonces me he olvidado de determinadas cosas que no me afecten o que no son relevantes para",
        "start": 1964.44,
        "end": 1970.44
    },
    {
        "text": " ver. Bueno, demanda agregar, ahora vamos entonces ya no en el Isaac, ¿cómo esto también lo",
        "start": 1970.44,
        "end": 1985.88
    },
    {
        "text": " asuciamos al PBI, ¿no? demanda agregar es también el PBI, porque la misma producción que las",
        "start": 1985.88,
        "end": 1993.04
    },
    {
        "text": " empresas logran generar, hay gente que la quiere comprar, están los soferentes que lo que vimos",
        "start": 1993.04,
        "end": 1999.48
    },
    {
        "text": " hasta ahora, ahora vamos a ver, bueno, ¿cuáles son las factores, los determinantes que hacen que los",
        "start": 1999.48,
        "end": 2004.68
    },
    {
        "text": " agentes económicos quieran comprar esa producción? Y a eso le llamamos la demanda agregada y la demanda",
        "start": 2004.68,
        "end": 2011.32
    },
    {
        "text": " agregada la vamos a definir a partir de los cinco componentes del PBI y que la diferenciación de",
        "start": 2011.32,
        "end": 2023.88
    },
    {
        "text": " los componentes del PBI está vinculada a la gente económico que está detrás, o sea, cada uno de",
        "start": 2023.88,
        "end": 2031.5600000000002
    },
    {
        "text": " estos lo que hacen es demandar bienes y servicios, de la oferta agregada, la producción, cuando la",
        "start": 2031.5600000000002,
        "end": 2039.0800000000002
    },
    {
        "text": " demandan un conjunto de actores que nosotros vamos a enlobar diciendo son los hogares, a eso le",
        "start": 2039.0800000000002,
        "end": 2045.3600000000001
    },
    {
        "text": " vamos a llamar el consumo, la variable consumo dentro del PBI, el componente denominado consumo,",
        "start": 2045.3600000000001,
        "end": 2052.12
    },
    {
        "text": " hace referencia a la demanda de bienes y servicios producidos en Uruguay que son demandados por",
        "start": 2052.68,
        "end": 2059.96
    },
    {
        "text": " hogares Uruguay, ¿sí? Nosotros como familia cuando demandamos bienes y servicios nos contabiliza",
        "start": 2059.96,
        "end": 2068.6
    },
    {
        "text": " eso, nos estima en eso de alguna manera y eso es lo que se pone acá, lo que se calcula acá.",
        "start": 2068.6,
        "end": 2073.24
    },
    {
        "text": " Después, cuando esos bienes y servicios son demandados por empresas, a eso lo vamos a",
        "start": 2074.24,
        "end": 2082.6
    },
    {
        "text": " incluir dentro del componente del PBI denominado inversión, la AID de inversión son todos los bienes",
        "start": 2082.6,
        "end": 2092.52
    },
    {
        "text": " y ahora después lo vamos a definir mejor, pero son los bienes aparte y los bienes producidos en",
        "start": 2092.52,
        "end": 2096.8399999999997
    },
    {
        "text": " Uruguay que las empresas los demandan, los hogares para que demandan bienes, para satisfazar",
        "start": 2096.84,
        "end": 2104.6800000000003
    },
    {
        "text": " necesidades, las empresas para que compraran a algunos bienes, para producir otros y vender",
        "start": 2104.6800000000003,
        "end": 2111.56
    },
    {
        "text": " y hacer sus ganantes, ¿sí? Por eso como son agentes económicos, tienen lógicas distintas,",
        "start": 2111.56,
        "end": 2116.96
    },
    {
        "text": " es que lo separamos para interpretar cuáles son los factores que afectan a cada uno.",
        "start": 2116.96,
        "end": 2121.1200000000003
    },
    {
        "text": " Después acá tenemos al gobierno, ¿cuál es estado?",
        "start": 2122.0,
        "end": 2124.96
    },
    {
        "text": " ¿sí? Y hablamos del gasto del gobierno, la variable del, la del componente del PBI",
        "start": 2127.08,
        "end": 2134.0
    },
    {
        "text": " denominado gasto del gobierno, que también después vamos a ver que es, pero es todo tipo de gasto",
        "start": 2134.0,
        "end": 2140.16
    },
    {
        "text": " del gobierno y parte de ese gasto puede ser de consumo o de inversión, están adentro de",
        "start": 2140.16,
        "end": 2145.7999999999997
    },
    {
        "text": " esta variable, las obras que realiza el gobierno, ¿sí? Construcción de puentes, carreteras,",
        "start": 2145.88,
        "end": 2152.28
    },
    {
        "text": " lo que sea vía, de tren, todo lo que sea, pero también el pago de sueldo, funcionan",
        "start": 2152.28,
        "end": 2157.2400000000002
    },
    {
        "text": " a los públicos, todo lo metemos ahí. Por eso la diferenciación no está tanto en",
        "start": 2157.2400000000002,
        "end": 2161.6800000000003
    },
    {
        "text": " si es algo más duradero o menos duradero, ¿sí? sino quién es el que está demandando esos bienes.",
        "start": 2161.6800000000003,
        "end": 2168.36
    },
    {
        "text": " Y hay algunos bienes producidos en Uruguay que no son demandados por Uruguay, sino que son",
        "start": 2169.5600000000004,
        "end": 2174.96
    },
    {
        "text": " demandados por el resto del mundo, y a eso se le llama las exportaciones.",
        "start": 2174.96,
        "end": 2179.52
    },
    {
        "text": " Y como esto tiene en términos de balance, viene de las cuentas nacionales que ustedes miraron",
        "start": 2185.08,
        "end": 2190.44
    },
    {
        "text": " en Descriptiva, para que esto cierre tenemos que restarle una parte de bienes que no son bienes",
        "start": 2190.44,
        "end": 2196.32
    },
    {
        "text": " uruguayos, sino que son bienes producidos en el resto del mundo y demandados por Uruguay.",
        "start": 2196.32,
        "end": 2203.0
    },
    {
        "text": " O sea que acá tenemos al resto del mundo produciendo bienes y servicios que son demandados por",
        "start": 2203.52,
        "end": 2210.16
    },
    {
        "text": " cualquiera de nuestros agentes, ¿no? Bienes, al resto del mundo que son demandados por hogares,",
        "start": 2210.16,
        "end": 2215.44
    },
    {
        "text": " empresas y govian. Cuando los hogares uruguayos demandan a algún bien importado,",
        "start": 2217.0,
        "end": 2226.28
    },
    {
        "text": " y bueno, lo registramos ahí en las importaciones.",
        "start": 2226.28,
        "end": 2229.6000000000004
    },
    {
        "text": " Nuestro objetivo final va a ser tratar de ver cuáles son las variables que influyen en esta demanda",
        "start": 2234.4,
        "end": 2246.0800000000004
    },
    {
        "text": " agregada, en realidad le vamos a ver para cada uno de los cinco, y tratar de razonar como resultado",
        "start": 2246.0800000000004,
        "end": 2253.0
    },
    {
        "text": " final y por una variable importante que es los precios pero van a aparecer otras, ¿cómo es la",
        "start": 2253.0,
        "end": 2258.64
    },
    {
        "text": " relación entre los precios y la demanda agregada? Entonces por ejemplo, supongamos que los hogares",
        "start": 2258.64,
        "end": 2265.08
    },
    {
        "text": " uruguayos demandan 48 para un IPSD70, ¿qué pasa si el IPSE sube? ¿Qué podemos esperar que ocurra?",
        "start": 2265.08,
        "end": 2272.88
    },
    {
        "text": " Que se demande menos, que se demanden la misma cantidad de bienes y servicios que se demanden más.",
        "start": 2273.76,
        "end": 2278.2
    },
    {
        "text": " Vamos a razonarlo a partir de los de estos cinco.",
        "start": 2279.2,
        "end": 2282.7599999999998
    },
    {
        "text": " Vamos a plantearnos así. Si sube en los precios, vamos a pensar ¿qué pasa con el consumo,",
        "start": 2287.9199999999996,
        "end": 2296.2
    },
    {
        "text": " con la inversión, el gasto, la seks por la simple, y una vez que sepamos por separado concluimos,",
        "start": 2296.2,
        "end": 2305.08
    },
    {
        "text": " y decimos que le paso entonces a la demanda agregada. Bien, uno a uno, ¿qué le pasa a los hogares?",
        "start": 2306.08,
        "end": 2318.48
    },
    {
        "text": " A aclaración previa, vinculado a una de las de las de la primera clase, siempre estamos hablando",
        "start": 2318.48,
        "end": 2325.2799999999997
    },
    {
        "text": " de variables reales, este consumo de acá es una variable real, es la suma de todas sumas en",
        "start": 2325.2799999999997,
        "end": 2332.7999999999997
    },
    {
        "text": " valor, como dijimos que hay que sumar, pero la suma de todos los alimentos, los boletos,",
        "start": 2332.8,
        "end": 2338.8
    },
    {
        "text": " centradas al cine, todos los bienes y servicios que consumen los hogares. No estamos hablando de la",
        "start": 2338.8,
        "end": 2344.1200000000003
    },
    {
        "text": " plata que gastan, si no, cantidad de bienes y servicios. Si sube en los precios, ¿qué pasa con",
        "start": 2344.1200000000003,
        "end": 2351.6400000000003
    },
    {
        "text": " esa cantidad de bienes y servicios que consumen los hogares? Y les va a dar para menos cuál es el",
        "start": 2351.6400000000003,
        "end": 2357.96
    },
    {
        "text": " razonamiento, ¿por qué pensamos en que si sube en los precios, si se encarecen los bienes y",
        "start": 2357.96,
        "end": 2362.7200000000003
    },
    {
        "text": " servicios que compra, va a tener que comprar menos? ¿Por qué asumimos que quiero ver el impacto",
        "start": 2362.7200000000003,
        "end": 2369.7200000000003
    },
    {
        "text": " de esto, y si quiero ver el impacto de un aumento de precio, y no voy a pensar que ya me",
        "start": 2369.7200000000003,
        "end": 2374.76
    },
    {
        "text": " aumentaron el sueldo, que como inflación me aumentaron el sueldo, entonces no perdí por",
        "start": 2374.76,
        "end": 2379.36
    },
    {
        "text": " lo de comprar, no, quiero ver el impacto de esto, entonces asumo que no cambió nada más,",
        "start": 2379.36,
        "end": 2384.2400000000002
    },
    {
        "text": " y si lo único que pasó fue que subieron la precio, voy a poder comprar menos bienes.",
        "start": 2384.24,
        "end": 2389.24
    },
    {
        "text": " Resultado entonces, cae el consumo, y esto se denomina el efecto saldos reales, poder de compra.",
        "start": 2389.24,
        "end": 2405.52
    },
    {
        "text": " La relación que tiene el consumo sea la cantidad de bienes y servicios que los hogares demandan,",
        "start": 2405.52,
        "end": 2417.7599999999998
    },
    {
        "text": " bienes y de servicios nacionales, ¿no? Uruguayos que demandan, se relacionan con los precios de manera",
        "start": 2417.7599999999998,
        "end": 2426.0
    },
    {
        "text": " inversa debido al efecto saldos reales a esto que hablábamos el poder de compra. Bien, ¿qué pasa con",
        "start": 2426.0,
        "end": 2434.64
    },
    {
        "text": " la inversión de las empresas? Con la cantidad de bienes y servicios que las empresas compran o",
        "start": 2434.64,
        "end": 2441.6
    },
    {
        "text": " quieren comprar cuando sube en los precios, donde le pega en la suba de precios a una empresa.",
        "start": 2441.6,
        "end": 2450.2
    },
    {
        "text": " Una empresa, habíamos manejado algunas, ¿cuál es el indicador de una empresa? El que",
        "start": 2452.2,
        "end": 2458.0
    },
    {
        "text": " le buscaba el empresario beneficio y el beneficio como se componía, como lo calcula a vos.",
        "start": 2458.0,
        "end": 2464.48
    },
    {
        "text": " Ingresos y egresos, ventas y costos, ¿todos le pega que aumenten los precios? En los costos",
        "start": 2466.48,
        "end": 2475.92
    },
    {
        "text": " y en las ventas, ¿por qué pasa se aumenta en los precios? La empresa está movilciendo o algunas,",
        "start": 2478.6,
        "end": 2483.08
    },
    {
        "text": " si es generalizado todas, ¿no? Pero se aumenta en los precios, ¿qué pasa con lo que vende? Es",
        "start": 2483.56,
        "end": 2488.92
    },
    {
        "text": " más caro, le da más ventas, más ingresos. Entonces, ¿sacan realidad? ¿Qué tendríamos que hacer para",
        "start": 2488.92,
        "end": 2494.36
    },
    {
        "text": " ver qué hace una, cómo reacciona una empresa? ¿Verdón de pego más? Si en la estructura de costos",
        "start": 2494.36,
        "end": 2499.7599999999998
    },
    {
        "text": " son las ventas. Entonces, como no lo sabemos y pega contraditoriamente, dejémoslo sin respuesta a esto.",
        "start": 2499.7599999999998,
        "end": 2509.16
    },
    {
        "text": " Sí, asumimos que queda igual porque no sabemos, no vamos a inventar nada. No sé cómo en las",
        "start": 2510.12,
        "end": 2515.7599999999998
    },
    {
        "text": " estructuras y pega más los precios en los costos son las ventas. ¿Gastos del gobierno? ¿Qué pasa con",
        "start": 2515.7599999999998,
        "end": 2523.2
    },
    {
        "text": " las inversiones con los pagos de salarios del gobierno si sube en los precios? Sube en los precios",
        "start": 2523.2,
        "end": 2530.24
    },
    {
        "text": " y llaman y hecha en algún maestro, hacen menos recorridos de limpieza, los conteneros, le",
        "start": 2530.7999999999997,
        "end": 2540.52
    },
    {
        "text": " avisa no, venga, subió la inflación, nos subió en los precios, levanten un día menos a la",
        "start": 2540.52,
        "end": 2545.4799999999996
    },
    {
        "text": " semana. ¿Parecería que esta variable decisión de qué de cuántos maestros, de cuántas obras,",
        "start": 2545.4799999999996,
        "end": 2556.08
    },
    {
        "text": " de qué servicios de ar depende más de otras cosas, capaz de los precios? ¿Sí? Tiene otras",
        "start": 2556.6,
        "end": 2563.36
    },
    {
        "text": " herramientas del gobierno como para que se sube en los precios contra restar esto. Por lo tanto,",
        "start": 2563.36,
        "end": 2568.6
    },
    {
        "text": " también esto, vamos a decir, no se ve afectado, no hay algo así abrumador como dijimos para el",
        "start": 2568.6,
        "end": 2575.64
    },
    {
        "text": " caso del consumo de los soldales que ahí sí, no había duda, sube en los precios, puedo comprar",
        "start": 2575.64,
        "end": 2580.08
    },
    {
        "text": " menos. Ahora el gobierno tiene otros instrumentos, sube en los precios, capaz que tiene otra forma para",
        "start": 2580.08,
        "end": 2585.7999999999997
    },
    {
        "text": " seguir pagando de los maestros, seguir pagando de los servicios públicos que brindan. ¿Qué",
        "start": 2585.8,
        "end": 2591.36
    },
    {
        "text": " pasa con las exportaciones? Con la cantidad de bienes que nos compran desde el resto del mundo.",
        "start": 2591.36,
        "end": 2596.6800000000003
    },
    {
        "text": " Si Uruguay, los precios de los bienes uruguayos son mascaros. ¿Por qué?",
        "start": 2597.6800000000003,
        "end": 2605.1200000000003
    },
    {
        "text": " Porque si somos mascaros van a haber otros que en realidad la comparación se están abaratando y",
        "start": 2606.96,
        "end": 2612.5600000000004
    },
    {
        "text": " se asumimos que son de igual calidad, que hacemos. Si en el armazen de una esquina nos cobraron",
        "start": 2612.56,
        "end": 2618.4
    },
    {
        "text": " una parte y en el otro se encarece y estaban los dos iguales y vamos a ir al que se mantuvo de",
        "start": 2618.4,
        "end": 2623.72
    },
    {
        "text": " precio. ¿Sí? Entonces, ha sacado ocurre lo mismo en el comercio internacional. Y esto de acá,",
        "start": 2623.72,
        "end": 2629.56
    },
    {
        "text": " usando la palabra que mencionó el compañero, es denominado o incluido adentro de lo que es el",
        "start": 2629.56,
        "end": 2636.6
    },
    {
        "text": " efecto competitividad. ¿Qué es la competitividad? Sencillo, miro precios, asumo calidad",
        "start": 2636.6,
        "end": 2647.68
    },
    {
        "text": " de siguales y miro precios. Entonces, si Uruguay se encarece de Estados Unidos van a comprar",
        "start": 2647.68,
        "end": 2655.92
    },
    {
        "text": " más bienes argentinos y menos uruguayos. Y con las importaciones, ¿qué pasa con la cantidad",
        "start": 2655.92,
        "end": 2666.48
    },
    {
        "text": " de bienes y servicios chinos que compran los uruguayos cuando los bienes, uruguayos son mascaros?",
        "start": 2666.48,
        "end": 2672.92
    },
    {
        "text": " Y por la misma razón, ¿no? Si tengo los productos uruguayos que se encarecen y tengo los del resto",
        "start": 2675.16,
        "end": 2680.52
    },
    {
        "text": " del mundo que no se le pasó nada en la comparación se abarataron. Por eso se habla siempre de encaricimiento",
        "start": 2680.52,
        "end": 2687.28
    },
    {
        "text": " relativo o baratamiento relativo, porque comparo el PST, que es de Uruguay, con un PEC, es del resto del",
        "start": 2687.28,
        "end": 2693.92
    },
    {
        "text": " mundo. Si uno sube, el otro se mantiene, hay una variación en términos relativos. Entonces,",
        "start": 2693.92,
        "end": 2700.04
    },
    {
        "text": " ¿qué lo que decimos? Que aumentan las importaciones. Y esto es por la misma razón.",
        "start": 2700.04,
        "end": 2709.4
    },
    {
        "text": " ¿Importaciones?",
        "start": 2714.96,
        "end": 2716.0
    },
    {
        "text": " Detrás de las importaciones tenemos los agentes económicos uruguayos con",
        "start": 2716.32,
        "end": 2722.84
    },
    {
        "text": " cualquier a estos, no hogares, empresas y gobernantes. Esta gente tiene o lo obtenemos que asumir",
        "start": 2722.84,
        "end": 2728.8
    },
    {
        "text": " que tiene la posibilidad de comprar en Uruguay fue el resto del mundo. Entonces, suponemos que",
        "start": 2728.8,
        "end": 2733.88
    },
    {
        "text": " hay un conjunto de bienes que se venían comprando en Uruguay, pero ahora se encareció en Uruguay.",
        "start": 2733.88,
        "end": 2740.72
    },
    {
        "text": " Entonces, si en el resto del mundo existe la posibilidad de comprar ese mismo bien y ahora",
        "start": 2741.24,
        "end": 2745.4399999999996
    },
    {
        "text": " este se encareció y el resto del mundo que doy igual prefiero comprar un poco más",
        "start": 2745.4399999999996,
        "end": 2750.16
    },
    {
        "text": " de los del resto del mundo.",
        "start": 2750.16,
        "end": 2751.04
    },
    {
        "text": " Entonces, la relación entre los precios y la demanda agregada en realidad va a estar determinada",
        "start": 2755.08,
        "end": 2766.24
    },
    {
        "text": " por la combinación del efecto de los saldos reales y el efecto competitividad. O sea, por lo",
        "start": 2766.24,
        "end": 2771.7999999999997
    },
    {
        "text": " que pase con el consumo, con la sex por y la simpo. ¿Y qué es lo que podemos concluir ahí?",
        "start": 2771.7999999999997,
        "end": 2776.7999999999997
    },
    {
        "text": " ¿Qué baja la demanda agregada?",
        "start": 2781.72,
        "end": 2783.6
    },
    {
        "text": " ¿Por qué? ¿Por qué bajó el consumo? ¿Por qué? ¿Por qué bajaron la sex? ¿Por qué?",
        "start": 2785.68,
        "end": 2793.0
    },
    {
        "text": " ¿Por qué subieron la simpo? ¿Por qué van consignos negativos? Los tres evoluciones esta que estamos",
        "start": 2793.52,
        "end": 2799.76
    },
    {
        "text": " que le marcamos recién con estos conceptos las treban en la misma dirección. Suben los precios,",
        "start": 2799.76,
        "end": 2807.6
    },
    {
        "text": " la demanda acá. O sea, que la demanda agregada de una economía va a tener una relación inversa",
        "start": 2807.6,
        "end": 2816.96
    },
    {
        "text": " con los precios. Si los precios suben, que fue el ejemplo que manejamos hoy, la demanda va a bajar.",
        "start": 2816.96,
        "end": 2822.28
    },
    {
        "text": " Los hogares terminan consumiendo menos, el resto del mundo nos demanda menos y compramos más",
        "start": 2823.12,
        "end": 2828.0
    },
    {
        "text": " bien es importado. Entonces el PBI gruayo va a bajar.",
        "start": 2828.0,
        "end": 2831.08
    },
    {
        "text": " El Estado puede hacer recortes, pero no es porque haya subido esta variable macro, sino que es",
        "start": 2835.68,
        "end": 2840.4
    },
    {
        "text": " porque decidió bajar esta. Que eso es cuando ahora empecemos a ver cada una de qué depende y esto",
        "start": 2840.4,
        "end": 2846.52
    },
    {
        "text": " va a depender de una decisión política como decir vos querés recortar el gasto, pero no es por esto.",
        "start": 2846.52,
        "end": 2852.28
    },
    {
        "text": " El recorte de gasto no viene detrás de estas flechas, sino que sale solo recorte de gasto o antes",
        "start": 2853.28,
        "end": 2858.64
    },
    {
        "text": " por una decisión parlamentaria, decisión política.",
        "start": 2858.64,
        "end": 2861.32
    },
    {
        "text": " Bueno, vamos entonces ahora a hacer un camino que es ir recorriendo cada uno de estos parecido",
        "start": 2867.56,
        "end": 2873.96
    },
    {
        "text": " a lo que hicimos con la oferta agregada. Entonces vamos a arrancar ahora con la variable consumo,",
        "start": 2873.96,
        "end": 2879.76
    },
    {
        "text": " pero vamos a hacer el esquema, va a ser el mismo para el a cinco, lo cinco componente del PBI.",
        "start": 2880.76,
        "end": 2885.6800000000003
    },
    {
        "text": " Vamos a repasar la definición, vamos a repasar el agente económico que está detrás,",
        "start": 2885.6800000000003,
        "end": 2892.48
    },
    {
        "text": " vamos a ver cuánto pesa y qué variación tiene ese peso y vamos a ver los factores determinantes.",
        "start": 2892.48,
        "end": 2901.5200000000004
    },
    {
        "text": " O sea de qué depende esta variable, vamos a tratar de identificar cuáles son las variables que nos",
        "start": 2901.52,
        "end": 2911.04
    },
    {
        "text": " determinan la evolución del consumo de los hogares. Entonces arranquemos con esta, consumo de los",
        "start": 2911.04,
        "end": 2921.4
    },
    {
        "text": " hogares, dijimos que la agente económico que estaba detrás era los hogares, la variable consumo",
        "start": 2921.4,
        "end": 2928.0
    },
    {
        "text": " de los hogares, está del PBI, hogares es el agente económico.",
        "start": 2928.0,
        "end": 2930.56
    },
    {
        "text": " ¿Cómo lo definimos? Y él son los bien, la cantidad, bienes y servicios, porque pensamos en términos",
        "start": 2932.56,
        "end": 2937.0
    },
    {
        "text": " reales, por eso uso la palabra cantidad, bienes y servicios que demanan los hogares,",
        "start": 2937.0,
        "end": 2941.64
    },
    {
        "text": " bienes y servicios nacionales, que demanan los hogares. ¿Para qué satisfazar necesidad",
        "start": 2941.64,
        "end": 2946.88
    },
    {
        "text": " de dijeron hoy ustedes? ¿Sí? ¿Cuánto pesa esto?",
        "start": 2946.88,
        "end": 2950.56
    },
    {
        "text": " Si usamos ese periodo, largo como tendencia, como reflejo de la tendencia de",
        "start": 2950.56,
        "end": 2963.04
    },
    {
        "text": " Uruguay, periodo, ocho y ocho, mil cuatro. El PBI uruguayo, el consumo en términos del PBI",
        "start": 2963.04,
        "end": 2975.24
    },
    {
        "text": " uruguayo, representó el 78%, o sea la mayor parte de los bienes y servicios producidos en un país",
        "start": 2975.24,
        "end": 2984.0
    },
    {
        "text": " van a manos de los hogares, ¿sí? En Uruguay es 78 y en otros países que es 20, 39, en otros países",
        "start": 2984.0,
        "end": 2991.68
    },
    {
        "text": " también es 60 y pico, 70% anda ahí, es la mayor, el componente que pesa más en el PBI",
        "start": 2991.68,
        "end": 2999.12
    },
    {
        "text": " de los países. No tengo el número ahora, pero ponerle que sea 60 y pico, no va a ser menos, ¿sí?",
        "start": 2999.12,
        "end": 3008.68
    },
    {
        "text": " Y entre años, este número cambia un año 78, el otro año baja 60, después vuelve 80, no,",
        "start": 3014.96,
        "end": 3020.96
    },
    {
        "text": " entre años mantiene una estabilidad, ¿sí? No es una variable que sea muy volátil, sino que",
        "start": 3020.96,
        "end": 3027.32
    },
    {
        "text": " justamente esto depende de pautas de consumo y esas pautas de consumo generalmente, más ya que",
        "start": 3027.32,
        "end": 3033.4
    },
    {
        "text": " entra bienes nuevos, no aparecen bienes nuevos, uno empieza a consumir más de una cosa, menos de",
        "start": 3033.4,
        "end": 3037.96
    },
    {
        "text": " otra, pero en global esos números se mantienen. ¿De qué depende esta variable? ¿Cómo es que uno",
        "start": 3037.96,
        "end": 3048.08
    },
    {
        "text": " toma la decisión de cuántos bienes y servicios consumidos? ¿Qué variable miramos?",
        "start": 3048.08,
        "end": 3052.52
    },
    {
        "text": " Básicamente los ingresos que tiene uno, ¿verdad? Por ingresos vamos a considerar los sueldos,",
        "start": 3053.84,
        "end": 3064.48
    },
    {
        "text": " pero vamos a tener una mirada más amplia, por eso en el llamado sin ingresos, también están",
        "start": 3064.48,
        "end": 3069.56
    },
    {
        "text": " las jubilaciones, también están los beneficios, porque estamos mirando al hogar, acá cuando decíamos",
        "start": 3069.56,
        "end": 3078.64
    },
    {
        "text": " en la inversión está la empresa, está el empresario con la cabeza de empresa, pero es empresario,",
        "start": 3078.64,
        "end": 3085.48
    },
    {
        "text": " cuando va para su casa, eso guarda también, o sea la misma persona toma decisiones, acá",
        "start": 3085.48,
        "end": 3092.04
    },
    {
        "text": " hay toma decisiones acá, entonces hay algunos que no reciben sueldos, que tienen beneficios,",
        "start": 3092.04,
        "end": 3097.7999999999997
    },
    {
        "text": " porque son los empresarios, pero a la hora de consumir lo vamos a mirar como hogares, entonces acá",
        "start": 3097.8,
        "end": 3103.1200000000003
    },
    {
        "text": " generalizamos, también hay quienes tienen propiedades, entonces no viven de un salario, viven de",
        "start": 3103.1200000000003,
        "end": 3109.8
    },
    {
        "text": " rentas, por eso es la mirada más amplia y hablamos de ingresos, todo tipo de ingresos, ¿sí?",
        "start": 3109.8,
        "end": 3117.36
    },
    {
        "text": " Y entonces, un hogar tiene su ingreso o una persona tiene su ingreso y qué hace?",
        "start": 3117.36,
        "end": 3126.7200000000003
    },
    {
        "text": " Lo gasta todo, lo consume todo, compra bien ese servicio,",
        "start": 3128.1600000000003,
        "end": 3131.2400000000002
    },
    {
        "text": " aparece el tema de consumo o guarda una parte, entonces la decisiones,",
        "start": 3133.7200000000003,
        "end": 3141.2000000000003
    },
    {
        "text": " mi ingreso lo destino a consumir o ahorrar, que ese ahorro es un no consumo presente",
        "start": 3141.2,
        "end": 3157.8799999999997
    },
    {
        "text": " para tener un mayor consumo futuro, sí tengo determinado nivel de ingresos,",
        "start": 3157.8799999999997,
        "end": 3170.64
    },
    {
        "text": " una parte de sido consumirla, otra parte de sido ahorrado, para poner números 20 por ciento,",
        "start": 3170.64,
        "end": 3179.96
    },
    {
        "text": " 80 por ciento de sido consumirla, 20 por ciento de mi ingreso lo destino a la hora,",
        "start": 3181.96,
        "end": 3188.24
    },
    {
        "text": " estos numeritos a veces se les denomina en las propensiones,",
        "start": 3189.7599999999998,
        "end": 3193.48
    },
    {
        "text": " propensiones marginales a consumir, propensión, marginal ahorrar,",
        "start": 3193.48,
        "end": 3205.92
    },
    {
        "text": " simplemente un guarismo, un indicador que me vive como en una economía los hogares,",
        "start": 3205.92,
        "end": 3214.2400000000002
    },
    {
        "text": " el colectivo, ¿no? No es de cada hogar, no estamos en una análisis individual,",
        "start": 3214.2400000000002,
        "end": 3219.36
    },
    {
        "text": " sino la globalidad de una economía, bueno hay números gruesos que muestran que 80 por ciento",
        "start": 3219.36,
        "end": 3225.56
    },
    {
        "text": " de los ingresos, los hogares lo destinan a demandar bien ese servicio y hay un 20 por ciento que",
        "start": 3225.56,
        "end": 3232.28
    },
    {
        "text": " prefieren hoy no gastarlo en consumo de bienes, sino que compran, depositan en un banco,",
        "start": 3232.28,
        "end": 3239.28
    },
    {
        "text": " compran un bono, un activo financiero, lo que sea, pero no es parte de esta CUP,",
        "start": 3239.28,
        "end": 3245.4
    },
    {
        "text": " no están demandando bienes y servicios, están demandando activos financieros y por qué",
        "start": 3245.4,
        "end": 3252.0
    },
    {
        "text": " lo guardan, porque tiene la expectativa de que en el futuro hoy es una especie sacrificio de hoy,",
        "start": 3252.0,
        "end": 3258.12
    },
    {
        "text": " hoy no lo gasto en consumo, porque espero que en un futuro voy a consumir más, porque la gente espera",
        "start": 3258.12,
        "end": 3265.48
    },
    {
        "text": " que si hoy no consumo algo mañana voy a tener más,",
        "start": 3265.48,
        "end": 3268.56
    },
    {
        "text": " ¿cómo hace esto? ¿Cómo lo guarda, cómo guarda este 20 por ciento de los ingresos?",
        "start": 3268.56,
        "end": 3277.12
    },
    {
        "text": " ¿Cómo lo guardan en el colchón, la mesa de luz?",
        "start": 3282.4,
        "end": 3284.44
    },
    {
        "text": " Generalmente uno val, depende del monto, pero acude a un sistema financiero y en el sistema",
        "start": 3284.44,
        "end": 3293.04
    },
    {
        "text": " financiero entonces pasar de algo que soy de ingreso al futuro, acá parece una variable que es",
        "start": 3293.04,
        "end": 3300.8
    },
    {
        "text": " la taza de interés, entonces la visión o la expectativa de que a futuro voy a tener mayor",
        "start": 3300.8,
        "end": 3309.16
    },
    {
        "text": " consumo es porque ese ahorro que hice hoy me va a rendir determinado interés y voy a tener un",
        "start": 3309.16,
        "end": 3317.4
    },
    {
        "text": " valor más alto ¿sí? Entonces vamos a ir repasando algunas variables que aparecen o que",
        "start": 3317.4,
        "end": 3332.2000000000003
    },
    {
        "text": " podríamos decir nos van a influir en esta decisión del consumo, ya aparecieron dos,",
        "start": 3332.2000000000003,
        "end": 3338.36
    },
    {
        "text": " bueno en realidad hay una tercera que ya la vimos ¿no? Vamos arrancar por la que ya vimos,",
        "start": 3339.7200000000003,
        "end": 3344.6800000000003
    },
    {
        "text": " ¿cómo era la relación con los precios?",
        "start": 3345.24,
        "end": 3347.16
    },
    {
        "text": " ¿Qué fue lo que dijimos? Que si suben los precios, diminuye el consumo y eso es porque era",
        "start": 3351.8799999999997,
        "end": 3360.3599999999997
    },
    {
        "text": " polo del poder de compra ¿verdad? Y entonces que sí no pongo acá para que nos quede después",
        "start": 3362.96,
        "end": 3369.44
    },
    {
        "text": " sólo esta ecuación con represumiendo las ideas está, un signo de menos para representar esa",
        "start": 3369.44,
        "end": 3376.52
    },
    {
        "text": " relación invaso ¿qué pasa con el ingreso? Si suben el ingreso de los soganes,",
        "start": 3376.52,
        "end": 3384.7200000000003
    },
    {
        "text": " ¿qué podemos esperar que ocurra con el consumo de los soganes? ¿Por qué?",
        "start": 3388.44,
        "end": 3394.2000000000003
    },
    {
        "text": " Porque estamos hablando de que suben el ingreso entonces no juntemos de que suben el ingreso y",
        "start": 3395.2,
        "end": 3403.04
    },
    {
        "text": " además cambia la conducta de pensamiento, filosofía, lo que sea de las personas, asumimos como",
        "start": 3403.04,
        "end": 3408.48
    },
    {
        "text": " dicen compañero, reparto 80 20 entonces si tengo que repartir acá un aumento ¿no? Si esto acá me",
        "start": 3408.48,
        "end": 3416.2799999999997
    },
    {
        "text": " aumenta en 100 pesos que puedo esperar que ocurra con el consumo, que aumenta 80 pesos y que",
        "start": 3416.2799999999997,
        "end": 3422.64
    },
    {
        "text": " esto aumenta ahí ¿sí? Entonces el aumento de ingreso va a implicarnos un aumento en consumo",
        "start": 3422.64,
        "end": 3431.0
    },
    {
        "text": " por esa relación de que el ingreso uno lo reparte según también determinadas pautas y",
        "start": 3433.0,
        "end": 3439.7599999999998
    },
    {
        "text": " estas pautas no son tan cambiantes a lo largo del tiempo y entonces",
        "start": 3439.7599999999998,
        "end": 3444.7999999999997
    },
    {
        "text": " signo positivo en esta relación entre el ingreso y el consumo hay dos planteos que vamos a dar",
        "start": 3444.8,
        "end": 3459.1200000000003
    },
    {
        "text": " lo simplemente para repasar a alguna idea.",
        "start": 3459.1200000000003,
        "end": 3461.0800000000004
    },
    {
        "text": " Hay un planteo que nos dice según la edad cómo es la relación entre el consumo y el ingreso",
        "start": 3461.08,
        "end": 3483.64
    },
    {
        "text": " entonces nos habla de los jóvenes que no trabaja o los que no trabaja en edad de no trabajo ¿sí?",
        "start": 3484.2,
        "end": 3492.7999999999997
    },
    {
        "text": " desde que nací hasta el momento preguió empezar a trabajar ¿cómo es la relación entre el consumo",
        "start": 3497.92,
        "end": 3504.68
    },
    {
        "text": " de esa persona y el ingreso de esa persona? ¿Cómo es el ingreso de esa persona si no trabaja?",
        "start": 3504.68,
        "end": 3510.7999999999997
    },
    {
        "text": " Cere, consume algo, sí, entonces ¿cómo es esta relación? El consumo es mayor al ingreso,",
        "start": 3511.36,
        "end": 3519.36
    },
    {
        "text": " negativo ¿por qué? ¿a qué vamos con el negativo que dijo el compañero? ¿Por qué para consumir",
        "start": 3519.36,
        "end": 3527.1600000000003
    },
    {
        "text": " precisó comprarlos? Y si no tengo ingreso es una relación negativa y negativa que lo asociamos",
        "start": 3527.1600000000003,
        "end": 3533.04
    },
    {
        "text": " en este término que estamos hablando, a que le estamos pidiendo a ella ¿no? ¿a quién le pedimos?",
        "start": 3533.04,
        "end": 3538.6800000000003
    },
    {
        "text": " a los padres y los padres nos van anotando una libre tita, me debe ser esto porque cuando",
        "start": 3538.68,
        "end": 3545.9199999999996
    },
    {
        "text": " tenías tres años me pediste para el show ur, no, pero también esto se extiende a uno por ejemplo",
        "start": 3545.9199999999996,
        "end": 3553.9199999999996
    },
    {
        "text": " en un sistema más desarrollado universitarios que para estudiar piden prestado de la universidad",
        "start": 3553.9199999999996,
        "end": 3560.3999999999996
    },
    {
        "text": " entonces yo todavía no estoy trabajando pero me voy en leudando y tengo un consumo,",
        "start": 3560.3999999999996,
        "end": 3566.3599999999997
    },
    {
        "text": " por ejemplo el desarrollo universitario y me estoy en leudando con la institución",
        "start": 3566.36,
        "end": 3571.6
    },
    {
        "text": " esa educativa con un banco que me está financiando pagando los estudios pero estoy en una relación",
        "start": 3571.6,
        "end": 3578.1200000000003
    },
    {
        "text": " donde consumos más que los ingresos. Después llega la edad más activa de trabajo y ahí",
        "start": 3578.1200000000003,
        "end": 3587.6400000000003
    },
    {
        "text": " qué es lo que ocurre. Acá nos plantean que esto se da vuelta ¿por qué? Y porque hay que empezar",
        "start": 3587.64,
        "end": 3597.52
    },
    {
        "text": " a pagar lo anterior ¿sí? las dedudas que uno contrajo también con una filosofía muy",
        "start": 3597.52,
        "end": 3602.8799999999997
    },
    {
        "text": " y y y que estoy estudiando me deudo con la universidad entonces poco cuando piso trabajar",
        "start": 3602.8799999999997,
        "end": 3610.24
    },
    {
        "text": " empiezo a pagar y no consumo tanto pues tengo que pagar las dedas anterior y además porque tengo",
        "start": 3610.24,
        "end": 3616.52
    },
    {
        "text": " que generar ingresos para la próxima edad acá que es la edad de retiros ¿sí? y el",
        "start": 3616.52,
        "end": 3628.36
    },
    {
        "text": " edad de retiros que ocurre y vuelvo a consumir más que los ingresos si pudiera ser el cálculo",
        "start": 3628.36,
        "end": 3639.7599999999998
    },
    {
        "text": " exacto me deca el culo a ver en el calendario cuando se me acaba ¿no? ¿Voy a ir mover? y que ahí",
        "start": 3639.7599999999998,
        "end": 3645.28
    },
    {
        "text": " quede con cero peso ¿sí? si quiere dejarle a alguien a los que me siga bueno que apaga el culo",
        "start": 3645.28,
        "end": 3651.28
    },
    {
        "text": " que ahí se amenos ¿qué se haga positivo? bueno capaz que alguien también lo quiere dejarme",
        "start": 3651.28,
        "end": 3655.6000000000004
    },
    {
        "text": " ativo ¿no? pero el planteo es acá se empiezan a utilizar los recursos generados en esta fase",
        "start": 3655.6000000000004,
        "end": 3663.0400000000004
    },
    {
        "text": " simplemente esto para ver qué es lo que va ocurriendo con el ahorro ¿qué pasa en el primer",
        "start": 3663.0400000000004,
        "end": 3669.6400000000003
    },
    {
        "text": " grupo de edad con el ahorro? es negativo ¿qué pasa en la edad activa con el ahorro? y acá es",
        "start": 3669.64,
        "end": 3681.12
    },
    {
        "text": " donde se generan los ahorros el 80 20 aquí el 20 se forma acá en esta por esta parte de la",
        "start": 3681.12,
        "end": 3687.56
    },
    {
        "text": " población ¿sí? y acá de vuelta vuelven a ser negativos nuevamente aparece con esta relación",
        "start": 3687.56,
        "end": 3696.8799999999997
    },
    {
        "text": " con consumo ingreso ahorro decisiones intertemporales decisiones que uno tiene que estar mirando más allá",
        "start": 3696.88,
        "end": 3704.44
    },
    {
        "text": " del periodo de tiempo nosotros estamos hablando falta agregada demanda agregada y eso era pbí y pbí",
        "start": 3704.44,
        "end": 3710.4
    },
    {
        "text": " tiene una medición anual bueno estas decisiones de consumo si bien son decisiones que vamos a tomar en",
        "start": 3710.4,
        "end": 3716.76
    },
    {
        "text": " un año el cuántos bien necesarios de mandar en un año tienen implicancias o tienen en ese análisis",
        "start": 3716.76,
        "end": 3722.2000000000003
    },
    {
        "text": " cálculo mirar para adelante hay otro planteo que es el que se denomina el de la teoría",
        "start": 3722.72,
        "end": 3731.56
    },
    {
        "text": " del ingreso permanente",
        "start": 3733.06,
        "end": 3735.0
    },
    {
        "text": " ¿sí? que nos plantea también todas giran sobre esta relación ingreso con sumo",
        "start": 3739.0,
        "end": 3745.7599999999998
    },
    {
        "text": " ¿sí? entonces que nos plantea esta teoría que no es lo mismo que aumenten los ingresos porque",
        "start": 3745.76,
        "end": 3752.44
    },
    {
        "text": " por ejemplo aumentó el sueldo de la persona a que aumenten los ingresos porque me dieron un",
        "start": 3752.44,
        "end": 3758.32
    },
    {
        "text": " bono por única vez o porque me gané la lotería y tengo más plata ¿sí? que es lo que se supone",
        "start": 3758.32,
        "end": 3765.5200000000004
    },
    {
        "text": " o lo planteó este también con una mirada macro global que acá por ejemplo si una aumenta de",
        "start": 3765.5200000000004,
        "end": 3773.0
    },
    {
        "text": " sueldo y capaz que sí estaba comiendo moñitas 12 veces por semana y si me aumentaron el sueldo",
        "start": 3773.0,
        "end": 3779.56
    },
    {
        "text": " capaz que empiezo a comer sustituyó la moñita y metó un par de veces en un restaurante ¿sí?",
        "start": 3779.56,
        "end": 3785.76
    },
    {
        "text": " ahora ¿qué pasa si lo que me ocurrió fue un bono? una vez sola un montón de dinero por",
        "start": 3785.76,
        "end": 3792.74
    },
    {
        "text": " única vez voy a volver voy a meter restauranas y dentro de un mes vuelvo llorando a las moñitas",
        "start": 3792.74,
        "end": 3800.6
    },
    {
        "text": " hago un cambio de pauta de consumo si sólo me hicieron un aumento de ingresos por única vez",
        "start": 3801.16,
        "end": 3807.52
    },
    {
        "text": " también depende de cada persona ¿no? de cómo quiera quemárselo o me lo quemos y hago esto",
        "start": 3807.52,
        "end": 3812.64
    },
    {
        "text": " lo otro pero la globalidad lo que se ve es que es el ingreso permanente el que está relacionado",
        "start": 3812.64,
        "end": 3819.36
    },
    {
        "text": " al consumo si no es permanente no se da una relación o un cambio en las pautas de consumo",
        "start": 3819.36,
        "end": 3831.56
    },
    {
        "text": " ¿sí? de todas maneras ninguno de esos dos análisis nos invalida no nos afectan este positivo",
        "start": 3831.56,
        "end": 3839.08
    },
    {
        "text": " de acá solamente manejamos algunas cuestiones adicionales pero la relación más ingreso más consumo",
        "start": 3839.08,
        "end": 3847.52
    },
    {
        "text": " es la que ya habla ¿qué pasa con esta otra que teníamos anotada acá que era la tasa de",
        "start": 3847.52,
        "end": 3855.36
    },
    {
        "text": " interés? ¿qué pasa si sube la tasa de interés? ¿qué juego que incentivo genera sobre el hogar,",
        "start": 3855.36,
        "end": 3868.04
    },
    {
        "text": " sobre la persona que tenía esos ingresos y repartida entre consumo y ahorro? ¿qué pasa si sube la",
        "start": 3868.04,
        "end": 3874.7599999999998
    },
    {
        "text": " tasa de interés? ¿qué podríamos esperar que ocurra? es un incentivo la variable tasa de interés es",
        "start": 3874.76,
        "end": 3883.84
    },
    {
        "text": " un incentivo a tener un mayor consumo de futuro entonces la persona puede decir ¿pa si yo me estoy",
        "start": 3883.84,
        "end": 3890.2000000000003
    },
    {
        "text": " comiendo esta plata capaz que me la guardo en el futuro puedo comar más todavía entonces con esa",
        "start": 3890.2000000000003,
        "end": 3895.92
    },
    {
        "text": " mirada intertemporal considerando más de un periodo de tiempo una suba en la tasa de interés me",
        "start": 3895.92,
        "end": 3902.76
    },
    {
        "text": " va a llevar si quiere acá gámonos como por fases me va a llevar a que yo que haga con el ahorro",
        "start": 3902.76,
        "end": 3909.0800000000004
    },
    {
        "text": " laumenta y al aumentar el ahorro reduzco el consumo bien",
        "start": 3910.36,
        "end": 3917.7200000000003
    },
    {
        "text": " y entonces ese signo como es relación inverse acá hay también algunas salvedades que están",
        "start": 3917.72,
        "end": 3935.4399999999996
    },
    {
        "text": " menculadas a los mercados financieros ¿qué pasa si yo tenía depósitos?",
        "start": 3935.44,
        "end": 3948.98
    },
    {
        "text": " yo tenía unos buenos ahorros depositados en el banco y sube la tasa de interés como me afecta",
        "start": 3953.8,
        "end": 3960.76
    },
    {
        "text": " pongemos tiene razón en compañía están depositados a la tasa de marca a lo que evolucione la",
        "start": 3966.44,
        "end": 3971.96
    },
    {
        "text": " tasa de marca entonces la tasa sube ¿qué pasa con esos depósitos que yo tenía? me van a rendir más",
        "start": 3971.96,
        "end": 3980.2400000000002
    },
    {
        "text": " me van a dar más intereses entonces yo no hice nada y en la suba de la tasa de interés hace que",
        "start": 3980.2400000000002,
        "end": 3987.52
    },
    {
        "text": " yo tenga más ingresos por mayores rendimientos y entonces antes a suba de la tasa de interés que",
        "start": 3987.52,
        "end": 3996.28
    },
    {
        "text": " me generó intereses adicionales que no lo se esperaba si dejamos del lado de esto de que",
        "start": 3996.28,
        "end": 4001.88
    },
    {
        "text": " estos son momentáneos que fuera algo más permanente que puede llevarla a la a la a la a la",
        "start": 4001.88,
        "end": 4007.08
    },
    {
        "text": " a la tasa de interés a consumir más entonces esto hace que con los mismos depósitos por un",
        "start": 4007.08,
        "end": 4019.44
    },
    {
        "text": " incremento en la tasa de interés tengo un incremento de ingresos y por lo tanto con suma más",
        "start": 4019.44,
        "end": 4025.04
    },
    {
        "text": " bien pero también en un mercado financiero hay gente que tiene depósitos pero hay gente que tiene",
        "start": 4026.52,
        "end": 4034.04
    },
    {
        "text": " deudas y unas deudas con una tasa que sube ¿qué pasa con el que te niña la deuda?",
        "start": 4034.04,
        "end": 4042.56
    },
    {
        "text": " y va a tener que pagar más y si tiene que pagar más capa que tiene que chicarse su consumo",
        "start": 4043.68,
        "end": 4051.16
    },
    {
        "text": " entonces saca lo que va a tener que pasar es esto",
        "start": 4051.16,
        "end": 4054.68
    },
    {
        "text": " sí con lo cual dependiendo del mercado financiero y bueno podemos tener dudas de que es lo que",
        "start": 4054.68,
        "end": 4064.3999999999996
    },
    {
        "text": " ocurra a qué hoy con esto porque en algún momento en términos teóricos hay una relación discutida",
        "start": 4064.3999999999996,
        "end": 4071.2799999999997
    },
    {
        "text": " entre la tasa de interés esto que pusimos acá había ahorro como algo más más directo y que lo",
        "start": 4071.2799999999997,
        "end": 4076.7999999999997
    },
    {
        "text": " podríamos representar de esa manera hay algunos que lo discuten por este lado que dicen que en",
        "start": 4076.7999999999997,
        "end": 4084.08
    },
    {
        "text": " realidad la relación es directo y eso depende de los sistemas financieros depende de cómo",
        "start": 4084.08,
        "end": 4089.0
    },
    {
        "text": " estén organizados y cómo funcione si están muy o poco desarrollados dejando del lado de esto",
        "start": 4089.0,
        "end": 4097.08
    },
    {
        "text": " que hay algunos autores que solo discuten nosotros esta relación para este esquema de en pocas",
        "start": 4097.08,
        "end": 4102.22
    },
    {
        "text": " clases poder llegar a manejar cómo se conectan distintas variables macro nos vamos a quedar con",
        "start": 4102.22,
        "end": 4108.4
    },
    {
        "text": " esa lógica tasa de interés ahorro con su por ahí circula esa razonamiento bien otra variable",
        "start": 4108.4,
        "end": 4120.639999999999
    },
    {
        "text": " bueno una que está en la ficha y la ponemos al lado de los precios las expectativas de precios",
        "start": 4122.24,
        "end": 4130.36
    },
    {
        "text": " que es la expectativa de precios tener la expectativa sea por información o por qué bueno",
        "start": 4131.36,
        "end": 4137.799999999999
    },
    {
        "text": " intuición lo que sea de que los precios van a subir si cuando en Uruguay por ejemplo se genera",
        "start": 4137.799999999999,
        "end": 4145.0
    },
    {
        "text": " expectativa que los precios van a subir con algún bien pensemontáminos de bien es concreto no de",
        "start": 4145.0,
        "end": 4154.08
    },
    {
        "text": " inflación de IPC tema de la NAFTA en Uruguay se avisa cuando se va a aumentar la NAFTA entonces",
        "start": 4154.08,
        "end": 4163.16
    },
    {
        "text": " que podemos esperar que ocurra cuando nos dicen mañana la cero hora hoy en ocho a la 24 o",
        "start": 4163.16,
        "end": 4169.24
    },
    {
        "text": " 599 a las 23 59 va a aumentar el precio de la NAFTA y vamos llenamos el tan o sea esperamos que",
        "start": 4169.24,
        "end": 4179.44
    },
    {
        "text": " impie aumenten y entonces que hacemos tratamos de mandar más bien antes de que aumenten para",
        "start": 4179.44,
        "end": 4185.639999999999
    },
    {
        "text": " no comer no se cambio de precio entonces ahí cómo sería esta relación con la expectativa de precios",
        "start": 4185.639999999999,
        "end": 4191.44
    },
    {
        "text": " ante la expectativa de mayor expresión que los precios suban que podríamos decir que ocurra",
        "start": 4192.08,
        "end": 4197.679999999999
    },
    {
        "text": " que se va a consumir más relación directo igual esto a nivel macro capaz que en otros contextos",
        "start": 4198.679999999999,
        "end": 4205.679999999999
    },
    {
        "text": " cuando la inflación era muy gran de 100% a no al bueno capaz que eso a nivel macro tenía algún sentido",
        "start": 4205.68,
        "end": 4211.6
    },
    {
        "text": " ahora esta relación entre expectativa de precios y demanda de bien es es más bien una relación",
        "start": 4211.6,
        "end": 4216.76
    },
    {
        "text": " micro si que lo van a retomar en el cuarto bloque de costa pero hay otra variable que yo quería",
        "start": 4216.76,
        "end": 4223.4400000000005
    },
    {
        "text": " traer que son los impuestos como afectan los impuestos a la decisión de consumo que teníamos",
        "start": 4223.44,
        "end": 4237.5199999999995
    },
    {
        "text": " por acá en realidad hoy tendríamos que haber a esto le tendríamos que llamar el ingreso disponible",
        "start": 4237.52,
        "end": 4259.76
    },
    {
        "text": " que es el ingreso disponible es el ingreso menos los impuestos sí a para ventragar",
        "start": 4259.76,
        "end": 4270.72
    },
    {
        "text": " detrás de eso hay cierta ideología de que uno lo primero que hace con los ingresos es separar",
        "start": 4280.92,
        "end": 4287.72
    },
    {
        "text": " la parte que es pagó de impuestos bien y después que paga los impuestos ahí si decide",
        "start": 4287.72,
        "end": 4294.280000000001
    },
    {
        "text": " de haber cuanto consumo cuanto decidó destinar el agro entonces aparece esa idea del ingreso",
        "start": 4294.280000000001,
        "end": 4301.88
    },
    {
        "text": " disponible entonces si el gobierno aumenta los impuestos en donde nos afreita esto",
        "start": 4301.88,
        "end": 4309.360000000001
    },
    {
        "text": " que le va a pasar el ingreso disponible a esta cuenta va a ser menor y si el ingreso disponible",
        "start": 4309.679999999999,
        "end": 4318.92
    },
    {
        "text": " es menor y asumimos que el 80 de ahí lo mantenemos que lo que ocurre con el consumo va a bajar",
        "start": 4318.92,
        "end": 4326.96
    },
    {
        "text": " entonces a mayor taza o impuestos cogrados vamos a tener un nivel de consumo menor y acá tenemos",
        "start": 4326.96,
        "end": 4336.0
    },
    {
        "text": " una relación inversa entre esas dos variables bien una última cuestión",
        "start": 4336.0,
        "end": 4357.48
    },
    {
        "text": " vamos a analizar el impacto que tenga un aumento del ingreso sobre la demanda de agregada",
        "start": 4366.0,
        "end": 4381.2
    },
    {
        "text": " como ya dijimos el aumento del ingreso una parte va a ir consumo y otra parte va a la hora para",
        "start": 4382.68,
        "end": 4390.08
    },
    {
        "text": " ver por dónde viene esto que estoy tratando de decir vamos a suponer que los ingresos de una",
        "start": 4390.08,
        "end": 4395.96
    },
    {
        "text": " economía aumentan el sien entonces esto aumenta el 80 y esto aumentan bien por lo tanto el impacto",
        "start": 4395.96,
        "end": 4402.92
    },
    {
        "text": " que tiene esto que ocurrió en la economía que se la aumentó el ingreso me va a hacer que esto",
        "start": 4402.92,
        "end": 4408.04
    },
    {
        "text": " aumenta en 80 si ahora en realidad este aumento del ingreso de 100 que me llegó a que los hogares",
        "start": 4408.04,
        "end": 4421.36
    },
    {
        "text": " que tenían estos mayores ingresos decidieran consumir 80 más en realidad esto me va a llevar a",
        "start": 4422.2,
        "end": 4428.64
    },
    {
        "text": " un aumento de 300 no de 80 ni de 100 de 300 esto es lo que se denomina el efecto multiplicado",
        "start": 4428.64,
        "end": 4441.52
    },
    {
        "text": " el efecto no al multiplicador del ingreso y vamos a razonar y si quieren pongamos el en",
        "start": 4441.52,
        "end": 4456.64
    },
    {
        "text": " condimento antes que es porque razon estos ingresos aumentar a raíz de que los hogares son grupos",
        "start": 4456.64,
        "end": 4464.12
    },
    {
        "text": " de hogares puede tener más ingresos porque aumentó a un salario porque hay más empleos porque pongamos",
        "start": 4464.12,
        "end": 4474.88
    },
    {
        "text": " el bien una inversión al país que aumenta los ingresos de los hogares vamos a suponer entonces",
        "start": 4474.88,
        "end": 4482.96
    },
    {
        "text": " que hay una inversión podría ser también una obra pública si cualquiera las dos pero si damos con",
        "start": 4482.96,
        "end": 4487.72
    },
    {
        "text": " la inversión imagínemos no tiene un pm 2 la planta no entonces van a invertir más y parte de",
        "start": 4487.72,
        "end": 4495.4800000000005
    },
    {
        "text": " esta inversión más que capaz que estos mil no genera 100 más de ingresos en realidad mil hay",
        "start": 4495.4800000000005,
        "end": 4508.04
    },
    {
        "text": " cosas importadas ahí adentro ese millo ponerle que estos son cuatro siete entonces por",
        "start": 4508.04,
        "end": 4516.68
    },
    {
        "text": " alguna razón es que me cambiara cada color para diferenciar bien incremento la inversión en",
        "start": 4516.68,
        "end": 4524.92
    },
    {
        "text": " cuatrocientos que implica gasto de maquinaria sobre contratación de empresas pero también una",
        "start": 4524.92,
        "end": 4534.08
    },
    {
        "text": " parte que es pago de salarios empleados y esos pago de salarios empleados son 100 con esos 100",
        "start": 4534.08,
        "end": 4542.72
    },
    {
        "text": " que hicieron esos trabajadores gastaron 80 ahorraron 20 en qué gastaron 80 tratemos",
        "start": 4542.72,
        "end": 4551.8
    },
    {
        "text": " imaginarnos esos 80 que son supermercado alquiler capaz que algunos se mudó o camionó de casa",
        "start": 4551.8,
        "end": 4563.24
    },
    {
        "text": " cine viajes entonces acá este aumento del consumo es una serie de demandas de bienes y",
        "start": 4565.08,
        "end": 4575.08
    },
    {
        "text": " servicios que qué va a generar los que no venden a esos bienes y servicios el del supermercado",
        "start": 4575.08,
        "end": 4583.0
    },
    {
        "text": " el del almacén el del cine de la agencia de viajes el dueño no digo el empresario ahí y va",
        "start": 4583.0,
        "end": 4590.5599999999995
    },
    {
        "text": " a tener más beneficios entonces esto mayor beneficio le van a generar más ingresos a otras",
        "start": 4590.56,
        "end": 4596.88
    },
    {
        "text": " personas esto viene ni gastaron 80 pongamos el eje una parte son costos entonces beneficio pongamos",
        "start": 4596.88,
        "end": 4604.080000000001
    },
    {
        "text": " que acá son 30 los mismos 100 que fularito tuvo en el bolsillo en momento terminan en qué gene y",
        "start": 4604.080000000001,
        "end": 4618.280000000001
    },
    {
        "text": " eso le hizo consumir más bienes y servicios por 100 por 80 así que hay otro menganito que tenga",
        "start": 4618.28,
        "end": 4624.759999999999
    },
    {
        "text": " 30 más ahora en el bolsillo y ese menganito entonces que va a ser cuando llega a la casa le van a",
        "start": 4624.759999999999,
        "end": 4630.5199999999995
    },
    {
        "text": " decir agonátele 80 20 no le dice la familia y qué hace entonces con el 80 de este 30 lo va a consumir",
        "start": 4630.5199999999995,
        "end": 4640.44
    },
    {
        "text": " y otra parte la va a ahorrar",
        "start": 4641.639999999999,
        "end": 4643.24
    },
    {
        "text": " entonces tenemos 24 más que los consumen entonces acá esto en realidad cuando miramos el",
        "start": 4648.599999999999,
        "end": 4655.0
    },
    {
        "text": " pb iba a ser el aumento de 80 y el aumento de lo 24 porque el empresario de este supermercado del",
        "start": 4655.0,
        "end": 4663.5199999999995
    },
    {
        "text": " cine etcétera también van a querer rastarlo y demandaron bienes y servicios y cuando demandaron",
        "start": 4663.5199999999995,
        "end": 4671.5599999999995
    },
    {
        "text": " esto viene sin servicio aparece otra demanda más y acá seguimos el mismo razonamiento",
        "start": 4671.56,
        "end": 4678.52
    },
    {
        "text": " podemos todos los pizarrones y en algo entonces esto aumenta 24 después aumenta en 18 después",
        "start": 4678.52,
        "end": 4685.88
    },
    {
        "text": " aumenta en 12 y así a qué se le denomina esto a que toda esta sumatoria terminan siendo esos",
        "start": 4685.88,
        "end": 4695.56
    },
    {
        "text": " 300 que la demanda va a aumentar por los 400 de la inversión y por 300 adicionales vía mayor",
        "start": 4695.56,
        "end": 4705.72
    },
    {
        "text": " consumo que se genera esa secuencia de encadenamiento de que uno tiene más ingresos de",
        "start": 4705.72,
        "end": 4711.56
    },
    {
        "text": " más bien pero el que le vendió eso viene y tiene más ingresos entonces le demanda más a otros y así",
        "start": 4711.56,
        "end": 4717.160000000001
    },
    {
        "text": " así por eso cuando viene un pm cuando viene cualquier empresa grande y quiere mostrarle no al",
        "start": 4717.16,
        "end": 4727.8
    },
    {
        "text": " govierma miralo bueno que es que yo venga y te invierta en tu país le va a decir mirar voy a",
        "start": 4727.8,
        "end": 4732.28
    },
    {
        "text": " invertir 400 pero te voy a generar 700 en realidad los multiplicadores no son ser épico o no sea",
        "start": 4732.28,
        "end": 4741.92
    },
    {
        "text": " son uno un poco adió sino que son más cerca de 2 de 3 a pm 1 la de fraivento será como 3 el",
        "start": 4741.92,
        "end": 4752.4
    },
    {
        "text": " multiplicado 3.2 y más lo recuerda porque todos esos otros encadenamientos no sólo por el",
        "start": 4752.4,
        "end": 4761.4
    },
    {
        "text": " ingreso esto lo podríamos hacer hasta más fuerte diciendo el que también parte de estos 400",
        "start": 4761.4,
        "end": 4767.84
    },
    {
        "text": " son acá dijimos que eran los empleados que esto era a través de salarios pero también haya",
        "start": 4767.84,
        "end": 4772.64
    },
    {
        "text": " través de venta de insumos de servicios empresas de transporte entonces esos también son empresarios",
        "start": 4772.64,
        "end": 4780.96
    },
    {
        "text": " que generan un aumento del ingreso y también nos van a generar toda esa cadena del multiplicado",
        "start": 4780.96,
        "end": 4785.76
    },
    {
        "text": " está claro",
        "start": 4787.04,
        "end": 4787.96
    },
    {
        "text": " hay una consulta acerca de esto que acabamos de ver que es el consumo de los soldares",
        "start": 4787.96,
        "end": 4794.28
    },
    {
        "text": " vamos a la segunda vamos a la inversión",
        "start": 4805.96,
        "end": 4808.12
    },
    {
        "text": " esto entonces cómo nos va a quedar resumido",
        "start": 4808.12,
        "end": 4817.44
    },
    {
        "text": " que el día de mañana llevamos a plantearlo de esta manera",
        "start": 4828.44,
        "end": 4832.2
    },
    {
        "text": " que pusimos después de esta interés aceptamos que hay otras variables",
        "start": 4832.72,
        "end": 4842.84
    },
    {
        "text": " aceptamos que hay otras variables por eso ponemos los puntos suspensivos pero nos quedamos más",
        "start": 4845.8,
        "end": 4850.44
    },
    {
        "text": " es más esta ni la vamos a poner a lo pero nos quedamos más con las que son las variables",
        "start": 4850.44,
        "end": 4857.5199999999995
    },
    {
        "text": " económicas",
        "start": 4858.360000000001,
        "end": 4859.52
    },
    {
        "text": " no tasas de interés precios impuestos",
        "start": 4872.88,
        "end": 4876.56
    },
    {
        "text": " pero cómo puede atraves los impuestos en gobierno",
        "start": 4878.76,
        "end": 4882.080000000001
    },
    {
        "text": " o sea lo que tenemos acá la relación pero si baja ésta si baja ésta si baja ésta no sube con su",
        "start": 4883.08,
        "end": 4889.04
    },
    {
        "text": " esos signos recuerden que sólo en la relación lo que tenemos ahí",
        "start": 4889.04,
        "end": 4893.84
    },
    {
        "text": " bueno inversión",
        "start": 4912.08,
        "end": 4913.64
    },
    {
        "text": " qué agente económico dijimos que estaba acá atrás",
        "start": 4920.2,
        "end": 4922.4
    },
    {
        "text": " de este componente del pb",
        "start": 4926.0,
        "end": 4927.4
    },
    {
        "text": " empresas empresas privadas y de la economía la gente privado generalmente los agentes privado",
        "start": 4928.68,
        "end": 4935.36
    },
    {
        "text": " una economía o los agentes son estado y después los privados y los privados le llamamos",
        "start": 4935.36,
        "end": 4940.16
    },
    {
        "text": " hogares y empresas atrás de la variabilidad la inversión están las empresas empresas que por qué",
        "start": 4940.16,
        "end": 4947.08
    },
    {
        "text": " demandan bienes y servicios no estamos metiendo con esta parte de la definición la inversión es la",
        "start": 4947.08,
        "end": 4951.88
    },
    {
        "text": " demanda de bienes y servicios por parte de las empresas para qué para producir",
        "start": 4951.88,
        "end": 4960.08
    },
    {
        "text": " beneficios en realidad para producir otros bienes y servicios que le generen beneficios ahora como",
        "start": 4961.72,
        "end": 4967.76
    },
    {
        "text": " estos demanda de bienes y servicios finales esta demanda en esta definición no incluye",
        "start": 4967.76,
        "end": 4974.320000000001
    },
    {
        "text": " insumos y aparece esto que la definición es demandar bienes y servicios para incrementar o",
        "start": 4974.320000000001,
        "end": 4984.08
    },
    {
        "text": " mantener el stock de capital del economía aparece nuestra cada y la oferta agregada estamos",
        "start": 4984.08,
        "end": 4992.08
    },
    {
        "text": " hablando de empresas que demandan bienes para producir y obtener beneficios estamos casi que",
        "start": 4992.08,
        "end": 4998.4
    },
    {
        "text": " tomando cosas de la oferta agregada que ya analizamos estamos viendo a una empresa y la empresa",
        "start": 4998.4,
        "end": 5003.4
    },
    {
        "text": " produce entonces es parte de lo que ya vimos aquí le llamamos demanda y lo incluimos dentro de la",
        "start": 5003.4,
        "end": 5011.5599999999995
    },
    {
        "text": " inversión a una parte de esos bienes y servicios que están vinculados a el capital a que el concepto",
        "start": 5011.5599999999995,
        "end": 5019.5199999999995
    },
    {
        "text": " de capital que decíamos es capital físico ¿sí? aquí lo asociábamos este capital físico",
        "start": 5019.52,
        "end": 5033.0
    },
    {
        "text": " maquinarias equipos instalaciones ¿sí? entonces la inversión que está acá atrás del componente del",
        "start": 5033.0,
        "end": 5055.68
    },
    {
        "text": " PBI la tenemos que asociar al capital que ya habíamos manejado y es inversión maquinarias y equipos",
        "start": 5055.68,
        "end": 5064.68
    },
    {
        "text": " no va cualquier tipo de inversión acá insumos no va por la misma lógica que vimos con la oferta de",
        "start": 5064.68,
        "end": 5071.92
    },
    {
        "text": " que a nivel macro sí sí bien son costos que tienen que hacer a nivel macro eso desaparece",
        "start": 5071.92,
        "end": 5076.72
    },
    {
        "text": " precisiones para hacer perdón antes ¿cuánto pesa esto? ¿cuánto pesó? en el periodo 88 2004",
        "start": 5076.72,
        "end": 5094.4400000000005
    },
    {
        "text": " 12 por ciento",
        "start": 5096.6,
        "end": 5098.88
    },
    {
        "text": " 12 por ciento de los bienes y servicios fueron a parar a manos de empresas porque tenían que",
        "start": 5107.72,
        "end": 5115.360000000001
    },
    {
        "text": " aumentar o mantener su stock de capital hay maquinarias que se desgastan por eso hablamos de mantener",
        "start": 5115.360000000001,
        "end": 5122.56
    },
    {
        "text": " el stock de capital ese 12 por ciento en la sumatoria de esto hubo un 5 por ciento de ese 12",
        "start": 5122.56,
        "end": 5132.88
    },
    {
        "text": " esto se le denomina la inversión bruta esta es la inversión neta y esta es la reposición",
        "start": 5133.84,
        "end": 5144.04
    },
    {
        "text": " estamos poniendo datos para tener una referencia de cuánto pesa de Uruguay del PBI Uruguay durante los",
        "start": 5148.92,
        "end": 5157.2
    },
    {
        "text": " años 88 2004 que era un periodo de largo que mostraba una especie de estructura de tendencia a largo",
        "start": 5157.2,
        "end": 5163.96
    },
    {
        "text": " plazo si vienen esta en consumo decíamos que no ha variado mucho esta inversión sí ha variado",
        "start": 5163.96,
        "end": 5169.679999999999
    },
    {
        "text": " mucho y hace necesario actualizar este dato para el material y lograr ¿qué? porque este número",
        "start": 5169.679999999999,
        "end": 5175.24
    },
    {
        "text": " en Uruguay ha aumentado andaba cerca del 20 ahora que del 10 como estaba en ese periodo de largo",
        "start": 5175.24,
        "end": 5181.76
    },
    {
        "text": " de tiempo que habíamos manejado pero vuelvo al concepto inversión es compra de maquinarias y equipos",
        "start": 5181.76,
        "end": 5190.280000000001
    },
    {
        "text": " sí que se hacen en un año demanda y bienes y servicios de un año porque hay que mantener",
        "start": 5190.280000000001,
        "end": 5196.56
    },
    {
        "text": " las maquinarias que tenían perdón a dar hay que mantener las maquinarias que teníamos",
        "start": 5198.24,
        "end": 5202.56
    },
    {
        "text": " algunas se rompieron y a que traen una nueva otra se ha desarrollado y que ponen respuestas bueno",
        "start": 5202.56,
        "end": 5206.4800000000005
    },
    {
        "text": " eso está dentro de este 7 por 7 eso es inversión también y hay aumento de maquinarias y eso le",
        "start": 5206.48,
        "end": 5214.759999999999
    },
    {
        "text": " llamamos la inversión neta si viene el 12 es lo que ponemos acá porque toda la que nos interesa",
        "start": 5214.759999999999,
        "end": 5220.959999999999
    },
    {
        "text": " no es lo mismo a la hora de la oferta agregada que se doce este compuesto por mucha inversión nueva",
        "start": 5220.959999999999,
        "end": 5227.5199999999995
    },
    {
        "text": " o por más bien reposición importante hay otros conceptos de capital que existen por ejemplo el",
        "start": 5227.52,
        "end": 5240.360000000001
    },
    {
        "text": " leí capital financiero ¿sí qué es invertir en capital financiero o hacer una inversión financiera",
        "start": 5240.360000000001,
        "end": 5251.52
    },
    {
        "text": " que es un término que se usa a qué hace referencia a eso hice una inversión financiera",
        "start": 5251.52,
        "end": 5259.88
    },
    {
        "text": " comprar bonos de positar plata en un banco acciones ¿sí eso son inversiones financieras cuando",
        "start": 5261.72,
        "end": 5271.200000000001
    },
    {
        "text": " un hogar o una empresa haga ese tipo de inversiones en capital financiero eso está barbaro lo",
        "start": 5271.200000000001,
        "end": 5277.320000000001
    },
    {
        "text": " aplaudimos pero no es esta acá que tenemos acá o sea porque alguien compre bonos eso no va a",
        "start": 5277.32,
        "end": 5285.84
    },
    {
        "text": " estar aumentando esta variable del PBI esta variable del PBI no tiene nada que ver con el capital",
        "start": 5285.84,
        "end": 5293.12
    },
    {
        "text": " financiero está vinculada hay capital físico y hay otro concepto que también se utiliza que es",
        "start": 5293.12,
        "end": 5301.96
    },
    {
        "text": " lo que se refiere al capital humano hay invertir en capital humano y este otro que hace referencia",
        "start": 5301.96,
        "end": 5308.12
    },
    {
        "text": " lo han escuchado sí capacitación formación de la mano de obra perfecto otro aplauso me da",
        "start": 5308.12,
        "end": 5316.36
    },
    {
        "text": " ayer eso pero tampoco es inversión porque ese capital humano no es el ca de las maquinarias",
        "start": 5316.36,
        "end": 5325.24
    },
    {
        "text": " equipos que hablaban es capital humano es personas y eso no vaca si viene a cada cierta",
        "start": 5325.24,
        "end": 5331.8
    },
    {
        "text": " discusión sin las cuentas nacionales no lo deberían incorporar como parte del componente del",
        "start": 5331.8,
        "end": 5338.0
    },
    {
        "text": " PBI eso no vaca y esto que estamos marcando acá entonces que hay tres tipos de ascepciones de este",
        "start": 5338.0,
        "end": 5345.0
    },
    {
        "text": " concepto de capital pero que como nosotros venimos desarrollando una idea solo tenemos que hacer",
        "start": 5345.0,
        "end": 5350.28
    },
    {
        "text": " referencia una pues las otras no nos siguen en el hilo conductor del razonamiento y como esto",
        "start": 5350.28,
        "end": 5356.4
    },
    {
        "text": " es importante está seguro yo cuando haré como las preguntas para los parciales armocatorce",
        "start": 5356.4,
        "end": 5362.759999999999
    },
    {
        "text": " preguntas hay una que ya la toma del parcial anterior y es esta sí esto de acá es una pregunta",
        "start": 5362.759999999999,
        "end": 5372.679999999999
    },
    {
        "text": " cantada porque hace a esto de que estamos entendiendo lo que estamos hablando la inversión esta",
        "start": 5372.679999999999,
        "end": 5378.16
    },
    {
        "text": " tenemos que tener claro que es lo que está ya bien",
        "start": 5378.16,
        "end": 5381.72
    },
    {
        "text": " hay un concepto que aparece cuando uno entonces hace una inversión que es el de un proyecto de inversión",
        "start": 5389.72,
        "end": 5396.88
    },
    {
        "text": " antes de llevar adelante una inversión uno de lo que el amor es esto de un proyecto de inversión",
        "start": 5408.16,
        "end": 5429.72
    },
    {
        "text": " que es un proyecto de inversión arranca con una idea esa idea se va agregando la información",
        "start": 5430.72,
        "end": 5440.92
    },
    {
        "text": " estudiando el analizando el a y se termina analizando si esa idea conviene o no conviene",
        "start": 5440.92,
        "end": 5447.72
    },
    {
        "text": " entonces para ver insisto mucho lo en tener en cuenta para que hablamos a veces cosas no estamos",
        "start": 5447.72,
        "end": 5457.12
    },
    {
        "text": " hablando para ver qué ponemos acá dentro o sea que es lo que lleva a que haya más demanda de",
        "start": 5457.12,
        "end": 5464.76
    },
    {
        "text": " bienes y servicios de estos para reponer o aumentar el capital por parte de las empresas cuáles",
        "start": 5464.76,
        "end": 5469.84
    },
    {
        "text": " son esos factores que llevan a que se invierta más en un país eso es lo que estamos tratando",
        "start": 5469.84,
        "end": 5474.36
    },
    {
        "text": " a buscar entonces para eso hace unos años se me ocurrió bueno y esto no está el todo en la fincha",
        "start": 5474.36,
        "end": 5482.0
    },
    {
        "text": " pero como método para acercarnos a eso y no yo tirarles la variable pensemos a algunas ideas",
        "start": 5482.0,
        "end": 5489.24
    },
    {
        "text": " de negocio y después elaborando o traciendo alguna otra información tratemos de buscar cuál",
        "start": 5489.24,
        "end": 5495.84
    },
    {
        "text": " es esa variable que nos determina las inversiones entonces propuesta que ustedes me planten 5 ideas de",
        "start": 5495.84,
        "end": 5505.4
    },
    {
        "text": " negocio a ustedes si vamos a sumir a suponer que yo tengo 100 mil dólares que se los voy a prestar",
        "start": 5505.4,
        "end": 5515.759999999999
    },
    {
        "text": " para que ustedes lleven adelante una idea de negocio si entonces les pido que piensen y que me",
        "start": 5515.759999999999,
        "end": 5522.879999999999
    },
    {
        "text": " digan 5 a ustedes ideas de negocio escucho",
        "start": 5522.88,
        "end": 5531.6
    },
    {
        "text": " tenemos uno",
        "start": 5541.6,
        "end": 5542.64
    },
    {
        "text": " otro que quiera 100 mil es préstamo",
        "start": 5545.4800000000005,
        "end": 5548.72
    },
    {
        "text": " a ver",
        "start": 5552.88,
        "end": 5553.6
    },
    {
        "text": " cómo",
        "start": 5561.76,
        "end": 5562.32
    },
    {
        "text": " bueno pero si tienen buenas ideas",
        "start": 5564.08,
        "end": 5566.0
    },
    {
        "text": " si por poner algo no me acuerdo si no en el 2007 han puesto el prostículo 1 la",
        "start": 5574.88,
        "end": 5580.92
    },
    {
        "text": " casa funeraria otro por poner algo",
        "start": 5580.92,
        "end": 5584.04
    },
    {
        "text": " pero después cuando analizábamos algunas cosas por ejemplo parte de las ideas hay que analizar el",
        "start": 5589.4800000000005,
        "end": 5594.64
    },
    {
        "text": " mercado y que salimos en una encuesta para pagar que potencial de mercado está bravo",
        "start": 5594.64,
        "end": 5600.92
    },
    {
        "text": " hasta me había atentado en esa oportunidad pero bueno por eso cosas que tienen que darles con lo que",
        "start": 5600.92,
        "end": 5606.04
    },
    {
        "text": " estudió en gente",
        "start": 5606.04,
        "end": 5606.72
    },
    {
        "text": " 2 más",
        "start": 5610.92,
        "end": 5617.96
    },
    {
        "text": " una pisería cada compañera lo que está estudiando",
        "start": 5621.28,
        "end": 5624.16
    },
    {
        "text": " y genera un argumento",
        "start": 5626.24,
        "end": 5627.56
    },
    {
        "text": " una pisería",
        "start": 5630.36,
        "end": 5631.24
    },
    {
        "text": " y la quinta idea",
        "start": 5637.4800000000005,
        "end": 5638.52
    },
    {
        "text": " perfecto tenemos la idea del negocio hay que ir",
        "start": 5641.12,
        "end": 5647.92
    },
    {
        "text": " más ticándole un poquito ese más ticándole a que quiere decir que es lo que preciso",
        "start": 5647.92,
        "end": 5653.92
    },
    {
        "text": " si para llevar adelante este proyecto no donde me voy a instalar aquí en le voy a vender",
        "start": 5653.92,
        "end": 5661.12
    },
    {
        "text": " cuestiones de regulaciones que haya que cumplir costos precios competidores un montón",
        "start": 5662.28,
        "end": 5669.4
    },
    {
        "text": " de información que hay que ir analizando verdad para cada una de estas va a ir a mirar eso",
        "start": 5669.4,
        "end": 5674.4
    },
    {
        "text": " hay que juntar información que exista otra vez que inventarla suponerla en algún caso va a",
        "start": 5674.4,
        "end": 5680.08
    },
    {
        "text": " implicarse una encuesta perfecto todo perfecto pero esto termina en que para ver si nos conviene o no",
        "start": 5680.08,
        "end": 5687.0
    },
    {
        "text": " hay que mirar la viabilidad y generalmente se termina bueno si es viabilidad jurídica",
        "start": 5688.0,
        "end": 5693.24
    },
    {
        "text": " si no lo podemos hacer lo podemos hacer pero después si se puede hacer cuál es la viabilidad que nos",
        "start": 5693.24,
        "end": 5699.08
    },
    {
        "text": " dice si lo vamos a hacer o no la viabilidad financiera las sin nos da ganancia o no y eso hay un",
        "start": 5699.08,
        "end": 5707.48
    },
    {
        "text": " indicador que muestra o que resumen de esa viabilidad que es una tasa es un simple 18 por ciento",
        "start": 5707.48,
        "end": 5716.76
    },
    {
        "text": " me mate buscando información inventando una consiguiendo otra análisis de mercado no sé qué y",
        "start": 5716.76,
        "end": 5724.76
    },
    {
        "text": " todo se va a decir con un número 18 por ciento que quiere decir ese 18 por ciento como se",
        "start": 5724.76,
        "end": 5733.84
    },
    {
        "text": " interpreta si ese 18 es un atir anual tiene esta se interna de retorno la calcula el excel",
        "start": 5733.84,
        "end": 5740.6
    },
    {
        "text": " que nos muestra en función de cuánta plata vamos a invertir 100 mil dólares que la tasa",
        "start": 5740.6,
        "end": 5747.400000000001
    },
    {
        "text": " interna de retorno en la rentabilidad que voy a obtener es 18 por ciento como interpretamos eso",
        "start": 5747.400000000001,
        "end": 5752.96
    },
    {
        "text": " que entra el negocio de este motoceléctricas con 100 mil dólares y pongamos lea el cabo un año",
        "start": 5752.96,
        "end": 5758.84
    },
    {
        "text": " cuánto tengo 118 mil nos juntamos de vuelta me devuelve en los 100 y ganó el compañero 18 mil",
        "start": 5758.84,
        "end": 5768.88
    },
    {
        "text": " dólares eso es lo que dice esto acá vas a tener un 18 por ciento por encima de lo que invertiste vamos",
        "start": 5768.88,
        "end": 5777.44
    },
    {
        "text": " a lo del trambía y da 4 por ciento si el compañero que tuvo la idea del trambía se llegó a",
        "start": 5777.44,
        "end": 5786.08
    },
    {
        "text": " los 100 mil dólares después de la clase y el año que viene nos juntamos de vuelta y el compañero me trajo",
        "start": 5786.08,
        "end": 5792.0
    },
    {
        "text": " 4, ay me trajo no me trajo los 100 mil se clonco 4, vamos de la energía sustentable 16 por ciento",
        "start": 5792.0,
        "end": 5802.96
    },
    {
        "text": " lo mismo vino el compañero se llegó lo 100 volvimos el cabo un año ganó 16 mil",
        "start": 5802.96,
        "end": 5812.78
    },
    {
        "text": " dólares bien desde la pisería y vamos a matarlo por no no es lo que está estudiando menos 3",
        "start": 5812.78,
        "end": 5819.96
    },
    {
        "text": " que quiere decir esto se llevó los 100 mil dólares y con cuántos volvimos el cabo un año con 97",
        "start": 5819.96,
        "end": 5830.84
    },
    {
        "text": " mil dólares sí me metí a carcién a mí bien entonces un negocio el compañero tenía esta",
        "start": 5830.84,
        "end": 5842.0
    },
    {
        "text": " idea que tendría que haber hecho se llevó los 100 y eso esta idea le daba menos 3 puso la pisería",
        "start": 5842.56,
        "end": 5853.92
    },
    {
        "text": " no con qué volvimos el compañero con los 100 y pues se llevó los 100 vio que esto no daba dijo no",
        "start": 5855.36,
        "end": 5864.52
    },
    {
        "text": " esto ni a palo lo pongo puedo ir a perder plata después no voy a tener me van a faltar",
        "start": 5864.52,
        "end": 5869.68
    },
    {
        "text": " 3 mil dólares para devolválea a este flaco qué hizo con estos se los quedó en la casa",
        "start": 5869.68,
        "end": 5877.6
    },
    {
        "text": " puso en el banco y compañero vio menos tren no pisería no pasó y estaba en el banco",
        "start": 5881.6,
        "end": 5887.52
    },
    {
        "text": " santandera que a la vuelta y el banco santandario decía 5 por ciento o sea que en realidad con",
        "start": 5887.52,
        "end": 5893.56
    },
    {
        "text": " cuanto vino cuando nos juntamos vuelta con 105 mil dólares y acá hay compañero el",
        "start": 5893.56,
        "end": 5902.64
    },
    {
        "text": " también que cuando presentó el proyecto de la pisería se le quedó de risa en la cara el",
        "start": 5902.64,
        "end": 5906.52
    },
    {
        "text": " hijo mirada vos 3 no sé qué yo voy a ganar 4 en realidad el año que hacía último río mejor",
        "start": 5906.52,
        "end": 5912.88
    },
    {
        "text": " ¿no? quién se reía el año es de la idea de la pisería que si bien tuvo mala idea después",
        "start": 5912.88,
        "end": 5920.88
    },
    {
        "text": " encontró esta de pasada y sin hacer nada mirándole a tele todo el año el compañero que hizo",
        "start": 5920.88,
        "end": 5926.64
    },
    {
        "text": " ganó 5 mil dólares y este otro se agarró un estrés barba durante todo un año y ganó 4 mil",
        "start": 5926.64,
        "end": 5933.4400000000005
    },
    {
        "text": " entonces este otro que debería haber hecho cuando también se estaba yendo de acá y pasó por",
        "start": 5936.36,
        "end": 5942.04
    },
    {
        "text": " la puerta del santandario y vio que pagaban 5 y tendría que haber puesto en el banco por más",
        "start": 5942.04,
        "end": 5949.56
    },
    {
        "text": " que esto era viado el financieramente que le iba a dar ganancias de 4 por ciento este tampoco",
        "start": 5949.56,
        "end": 5955.6
    },
    {
        "text": " lo debería haber hecho por la razón de que era menor al 5 por ciento y para completar estos",
        "start": 5955.6,
        "end": 5966.76
    },
    {
        "text": " números pongamos el que este de acá es 7 por ciento entonces que teníamos que acá el compañero",
        "start": 5966.76,
        "end": 5975.52
    },
    {
        "text": " de las motos eléctricas cuando vio esa rentabilidad y vio que eso superaba esto de acá",
        "start": 5975.52,
        "end": 5982.64
    },
    {
        "text": " debería haber hecho el proyecto este también y este también",
        "start": 5986.64,
        "end": 5990.76
    },
    {
        "text": " capaz que a uno ahí tiene que manejar otra variable que es en realidad no sólo ésta sino que",
        "start": 5995.4400000000005,
        "end": 6001.0
    },
    {
        "text": " también habría que mirar otra variable que es la del riesgo que la del riesgo también se",
        "start": 6001.0,
        "end": 6007.84
    },
    {
        "text": " resumen base a la tasa rentabilidad porque capaz que el 18 mil el 18 por ciento capaz que para",
        "start": 6007.84,
        "end": 6013.96
    },
    {
        "text": " este se mueve entre 10 por ciento y 26 por ciento mientras que este 16 y acá se mueve entre 15 y",
        "start": 6013.96,
        "end": 6026.04
    },
    {
        "text": " 17 a poner ejemplo bien grosero en términos de rentabilidad este mayor pero en términos del",
        "start": 6026.04,
        "end": 6033.12
    },
    {
        "text": " riesgo también es mayor entonces ahí uno tiene que jugar justamente viendo eso tabarba",
        "start": 6033.12,
        "end": 6041.4
    },
    {
        "text": " este número pero también hay que manejar recuerden que estos números salen de un montón de datos",
        "start": 6041.4,
        "end": 6046.56
    },
    {
        "text": " de información que uno manejó capaz que hay una de esos datos tamales capaz que hay una de esos",
        "start": 6046.56,
        "end": 6050.88
    },
    {
        "text": " datos cambia entonces tener esto hacer algunos rango ahí es importante pero entonces qué es lo que",
        "start": 6050.88,
        "end": 6058.32
    },
    {
        "text": " tenemos por acá que hay una variable que es esta la tasa interés que esta no se está jugando",
        "start": 6058.32,
        "end": 6066.12
    },
    {
        "text": " como el costo de oportunidad de los fondos sí yo lo 100 mil dólares de los tenías",
        "start": 6066.12,
        "end": 6083.12
    },
    {
        "text": " porque no puedo poner un negocio que me da un 4 por ciento de rentabilidad si lo 100 mil dólares",
        "start": 6084.48,
        "end": 6089.28
    },
    {
        "text": " los tengo yo en el bolsillo porque decimos que no porque pierdo de ganar ese es el concepto de",
        "start": 6089.28,
        "end": 6101.0
    },
    {
        "text": " costo oportuno pierdo de ganar algo y si soy racional no debería de perder de me de ganar algo bien",
        "start": 6101.0,
        "end": 6109.36
    },
    {
        "text": " entonces la tasa interés del mercado que es una tasa hablamos de tasa interés macro y cuál es",
        "start": 6109.36,
        "end": 6116.639999999999
    },
    {
        "text": " porque vamos a un banco y un montón de tasas en una moneda en otra a un plazo a otro sí entonces",
        "start": 6116.64,
        "end": 6124.64
    },
    {
        "text": " esto es un promedio y en general las tasas de interés evolucionan parecidas entonces acá que",
        "start": 6124.64,
        "end": 6129.92
    },
    {
        "text": " vemos no que es una tasa promedio de la economía y están las que las que nos cobran las que paga",
        "start": 6129.92,
        "end": 6135.360000000001
    },
    {
        "text": " pero esta es una tasa promedio entonces cómo juega la hora de alguien que tiene 100 mil dólares que",
        "start": 6135.360000000001,
        "end": 6141.04
    },
    {
        "text": " tiene fondos fondos propios se denomina tengo los 100 mil dólares como juega eso y que yo",
        "start": 6141.04,
        "end": 6148.72
    },
    {
        "text": " tengo que mirar qué alternativa tengo para darle esos 100 mil dólares y esta tasa interés",
        "start": 6148.72,
        "end": 6154.92
    },
    {
        "text": " juega como la alternativa sin riesgo si R o el banco en realidad se denomina la alternativa",
        "start": 6154.92,
        "end": 6164.48
    },
    {
        "text": " libre de riesgo en el 2002 cuando damos esto con el tema bank como un tributo habrá o hablar",
        "start": 6164.48,
        "end": 6177.08
    },
    {
        "text": " no el banco no miren la tasa interés el banco y pongan ahí que es la alternativa libre de riesgo",
        "start": 6177.08,
        "end": 6182.32
    },
    {
        "text": " pero bueno en el sistema financiero y en términos económicos de positar en un banco es lo que se",
        "start": 6182.32,
        "end": 6189.639999999999
    },
    {
        "text": " denomina la alternativa libre de riesgo entonces yo tengo que comparar si me conviene a sebar",
        "start": 6189.64,
        "end": 6195.400000000001
    },
    {
        "text": " adelante este proyecto que me da 4 por ciento rentabilidad o la alternativa que me quedó mirando",
        "start": 6195.400000000001,
        "end": 6201.160000000001
    },
    {
        "text": " la tele y donde el banco me pade más yo no me voy a perder de ganar entonces de posito en el",
        "start": 6201.160000000001,
        "end": 6207.12
    },
    {
        "text": " banco pero si de posito en el banco no estoy llevando adelante el proyecto y si no estoy llevando",
        "start": 6207.12,
        "end": 6212.240000000001
    },
    {
        "text": " adelante el proyecto no estoy invirtiendo en capital y si no estoy invirtiendo en capital en",
        "start": 6212.240000000001,
        "end": 6218.88
    },
    {
        "text": " este capital en el físico estoy invirtiendo acá pero si no invierto acá y no va a aumentar la",
        "start": 6218.88,
        "end": 6225.04
    },
    {
        "text": " inversión no va a aumentar el PD pero bueno es la decisión de cada individuo de si ganas no",
        "start": 6225.04,
        "end": 6230.56
    },
    {
        "text": " ganas aquellos al resultado de una economía",
        "start": 6230.56,
        "end": 6233.2
    },
    {
        "text": " ¿Qué pasa 100 veces los 100 mil donas es que yo les daba? Yo no les doy un mango",
        "start": 6236.72,
        "end": 6242.36
    },
    {
        "text": " inconsciénse lo ustedes les digo donde pueden conseguirlo y van a un banco a pedirlo y para ir a un",
        "start": 6243.32,
        "end": 6251.92
    },
    {
        "text": " banco a pedirlo que van a ir con su idea capaz que les piden algunos avales sí pero van con su idea",
        "start": 6251.92,
        "end": 6257.759999999999
    },
    {
        "text": " entonces imaginémonos esa situación compañero tiene su idea 18 por ciento pero tiene que",
        "start": 6257.759999999999,
        "end": 6267.12
    },
    {
        "text": " pedir a pedir préstamo por 100 mil dólares cuánto va a tener que pagar de intereses",
        "start": 6267.12,
        "end": 6271.16
    },
    {
        "text": " 5 por ciento le sirve no le sirve",
        "start": 6272.5599999999995,
        "end": 6275.32
    },
    {
        "text": " sí ganas 18 pero tiene que pagar 5 de intereses",
        "start": 6277.5199999999995,
        "end": 6281.72
    },
    {
        "text": " le sirve no le sirve",
        "start": 6284.5199999999995,
        "end": 6285.64
    },
    {
        "text": " ¿Qué pasa con él del trambía?",
        "start": 6286.68,
        "end": 6288.16
    },
    {
        "text": " va a pedir a el banco tiene que pagar 5 por ciento intereses y cuánto gana él 4",
        "start": 6289.68,
        "end": 6296.599999999999
    },
    {
        "text": " no le sirve, estamos haciendo lo mismo que hicimos contra esto solo que en vez de mirarlo como el costo",
        "start": 6297.12,
        "end": 6303.32
    },
    {
        "text": " oportunidad lo miramos como el costo del préstamo",
        "start": 6303.32,
        "end": 6306.44
    },
    {
        "text": " por eso los proyectos de inversión no interesa si se financia no no de una manera o de otra",
        "start": 6309.84,
        "end": 6315.96
    },
    {
        "text": " si se financia con la plata de uno o se financia con plata del banco porque en realidad siempre",
        "start": 6315.96,
        "end": 6322.0
    },
    {
        "text": " voy a comparar contra el atasad interesa",
        "start": 6322.0,
        "end": 6324.0
    },
    {
        "text": " comparo contra el atasad interesa tenga la plata yo porque si no me estoy perdiendo de ganar algo",
        "start": 6325.6,
        "end": 6331.24
    },
    {
        "text": " acá en el banco o lo incluyo lo comparo contra lo que tengo de paro de los intereses por el préstamo",
        "start": 6331.24,
        "end": 6337.36
    },
    {
        "text": " la lógica es exactamente la misma sea que tengo los fondos propios o que no tengo los fondos propios",
        "start": 6338.92,
        "end": 6345.12
    },
    {
        "text": " mire mi proyecto de inversión mi rentabilidad contra una atasad interesa",
        "start": 6345.48,
        "end": 6350.5199999999995
    },
    {
        "text": " entonces apareció",
        "start": 6351.5199999999995,
        "end": 6353.5199999999995
    },
    {
        "text": " acá",
        "start": 6354.0,
        "end": 6355.0
    },
    {
        "text": " está variable",
        "start": 6355.0,
        "end": 6357.0
    },
    {
        "text": " atasad interesa y con un ejemplo bien choto que pasa si la atasad interesa no es 5",
        "start": 6357.0,
        "end": 6363.2
    },
    {
        "text": " sino que pasa a ser 9 por ciento",
        "start": 6363.599999999999,
        "end": 6366.4
    },
    {
        "text": " el compañero de las motos lo va a seguir haciendo",
        "start": 6371.16,
        "end": 6373.76
    },
    {
        "text": " ganan 18 pero tiene que pagar 9 de interesa o 9 de costo propio pero ganan",
        "start": 6376.12,
        "end": 6381.5199999999995
    },
    {
        "text": " este ya habíamos dicho que no y si no energía sustentable si este ya habíamos dicho que no y la",
        "start": 6383.24,
        "end": 6390.36
    },
    {
        "text": " constructora que antes sí ahora no entonces en vez de tener tres proyectos cuando subió la",
        "start": 6390.36,
        "end": 6396.76
    },
    {
        "text": " atasad interesa el 9 este se nos cayó",
        "start": 6396.76,
        "end": 6399.84
    },
    {
        "text": " entonces como es la relación entre la atasad interés y la inversión",
        "start": 6403.4400000000005,
        "end": 6407.400000000001
    },
    {
        "text": " inversa a mayor tasa de interés",
        "start": 6409.84,
        "end": 6413.24
    },
    {
        "text": " menos proyectos de inversión van a ser atractivos menos entonces inversión",
        "start": 6414.76,
        "end": 6421.320000000001
    },
    {
        "text": " en capital",
        "start": 6423.6,
        "end": 6425.12
    },
    {
        "text": " acá vamos a sumir en estos puntos suspensivos otros otros argumentos que generalmente se manejan como",
        "start": 6427.76,
        "end": 6442.24
    },
    {
        "text": " factores determinantes de la inversión hace unos años y su estudio con inversores en Uruguay y con",
        "start": 6442.24,
        "end": 6448.88
    },
    {
        "text": " empresa ya instaladas y entre fall en orden no una especie de ranking de los factores que",
        "start": 6448.88,
        "end": 6455.280000000001
    },
    {
        "text": " destacaban se huría jurídica estabilidad política de uruguay no estabilidad político social",
        "start": 6455.28,
        "end": 6461.12
    },
    {
        "text": " estabilidad macroeconómica ubicación geográfica estratégica esto de estar no entre al gente",
        "start": 6461.12,
        "end": 6465.96
    },
    {
        "text": " ni Brasil percepción de corrupción disponible a mano de obra calificada etcétera etcétera",
        "start": 6465.96,
        "end": 6472.12
    },
    {
        "text": " ahora todo eso está barbaro pero si todo eso da cuatro por ciento van a invertir no o sea",
        "start": 6473.08,
        "end": 6484.8
    },
    {
        "text": " todos esos factores son factores atractores de inversión pero los tenemos resumidos acá dentro",
        "start": 6484.8,
        "end": 6491.36
    },
    {
        "text": " porque que haya manor a disponible y calificada va a hacer que las cuentas quisimos para llegar a",
        "start": 6492.2,
        "end": 6497.5599999999995
    },
    {
        "text": " los costos a casa una u otra entonces todos estos otros factores los podemos poner acá no tema",
        "start": 6497.56,
        "end": 6504.4800000000005
    },
    {
        "text": " de los impuestos el costo del estado los podemos poner acá siquiera pero en definitivo van a",
        "start": 6504.4800000000005,
        "end": 6510.240000000001
    },
    {
        "text": " estar van a pasar por esta comparación taza interna retorno con taza interés si me supera la",
        "start": 6510.240000000001,
        "end": 6516.280000000001
    },
    {
        "text": " taza interés barbaro sino no se hace la inversión",
        "start": 6516.280000000001,
        "end": 6519.6
    },
    {
        "text": " capital físico dijimos que eran las maquinarias equipos las instalaciones agreguemos",
        "start": 6519.6,
        "end": 6530.4800000000005
    },
    {
        "text": " lesa estas instalaciones la cuestión de inversión residencial",
        "start": 6530.4800000000005,
        "end": 6534.240000000001
    },
    {
        "text": " la obra no la construcción",
        "start": 6537.52,
        "end": 6539.200000000001
    },
    {
        "text": " eso también se considera inversión",
        "start": 6542.4400000000005,
        "end": 6544.64
    },
    {
        "text": " y lo último y con esto vamos a terminar lo que se denomina la variación de stock",
        "start": 6544.64,
        "end": 6557.400000000001
    },
    {
        "text": " o sea el capital físico forma está formado por tres tipos",
        "start": 6559.400000000001,
        "end": 6564.22
    },
    {
        "text": " maquinarias y equipos lo ponemos por un lado más estilo maquinaria no instalaciones físicas",
        "start": 6564.22,
        "end": 6575.9800000000005
    },
    {
        "text": " fábrica la o la el edificio también edificios residenciales y una tercera que es la variación de",
        "start": 6575.9800000000005,
        "end": 6585.860000000001
    },
    {
        "text": " stock y vamos a hablar con un ejemplo esto vamos a suponer que nos compramos",
        "start": 6585.86,
        "end": 6591.7
    },
    {
        "text": " compramos una vaca preñada y nace un tarnero 100 kilos",
        "start": 6600.099999999999,
        "end": 6604.5
    },
    {
        "text": " qué hacemos con el tarnero lo carneamos a van a guardarlo un poco",
        "start": 6604.5,
        "end": 6615.86
    },
    {
        "text": " a fin del año que viene 300 kilos lo carneamos",
        "start": 6621.22,
        "end": 6625.7
    },
    {
        "text": " vamos un poquito más",
        "start": 6626.7,
        "end": 6628.22
    },
    {
        "text": " 450 kilos",
        "start": 6632.22,
        "end": 6634.0599999999995
    },
    {
        "text": " vamos a frío rífico pongamos el éxito para no alargar el ejemplo yo quiero medir el",
        "start": 6635.34,
        "end": 6643.179999999999
    },
    {
        "text": " pwe de cada año",
        "start": 6643.179999999999,
        "end": 6645.5
    },
    {
        "text": " este tarnero cuando le limpiamos acá en el 2019",
        "start": 6647.7,
        "end": 6651.0599999999995
    },
    {
        "text": " cuál fue el esfuerzo productivo en 2019 qué tenemos que poner el pwe de 2019 que generamos",
        "start": 6651.580000000001,
        "end": 6658.820000000001
    },
    {
        "text": " 450 kilos de carne no cuánto generamos en el 2019 generamos 150 kilos",
        "start": 6658.820000000001,
        "end": 6668.22
    },
    {
        "text": " cuánto generamos en el 2018 200 kilos",
        "start": 6669.700000000001,
        "end": 6673.580000000001
    },
    {
        "text": " entonces el pwe de 2019 nos debería medir solo el esfuerzo productivo de ese año",
        "start": 6674.58,
        "end": 6681.66
    },
    {
        "text": " que fue haber aumentado 150 kilos",
        "start": 6682.54,
        "end": 6685.94
    },
    {
        "text": " qué pasa con esto esto es una maquinaria el tarnero este el tarnero garranco siendo",
        "start": 6687.54,
        "end": 6693.5
    },
    {
        "text": " chiquito no lo vamos a incluir acá dentro de la variación de stock porque qué pasa en el",
        "start": 6693.5,
        "end": 6699.26
    },
    {
        "text": " 2017 nosotros teníamos algo tira parecido a la función de una maquinaria nos estaba",
        "start": 6699.26,
        "end": 6705.18
    },
    {
        "text": " sirviendo para producir más teníamos un tarnero que lo íbamos a producir más entonces este",
        "start": 6705.18,
        "end": 6710.62
    },
    {
        "text": " 100 que valía 100 acá y lo vamos a medir adentro la inversión",
        "start": 6710.62,
        "end": 6716.06
    },
    {
        "text": " y en el 2018 cuando se cae cuáles el pwe se va a medir a ver cuál es el pwe de 2018 y en el 2018",
        "start": 6717.66,
        "end": 6725.820000000001
    },
    {
        "text": " tenemos que poner que hay 200 de pwe porque se aumentó esa maquinaria ese capital que",
        "start": 6725.82,
        "end": 6733.74
    },
    {
        "text": " tenemos representado a través de este tarnero entonces en Uruguay hay dos tipos de bienes",
        "start": 6733.74,
        "end": 6740.86
    },
    {
        "text": " sí la parte toda la parte pecuaria y la parte forestal que también forma parte de la inversión",
        "start": 6740.86,
        "end": 6749.78
    },
    {
        "text": " porque ni el tarnero ni el árbol lo vamos a tener que cuantificar solo cuando lo matamos",
        "start": 6750.34,
        "end": 6756.62
    },
    {
        "text": " tenemos que ir viviendo año a año ver cuánto está aumentando de valor esos bienes que nos van",
        "start": 6756.62,
        "end": 6764.719999999999
    },
    {
        "text": " a servir para producir otros bienes que en el caso del tarnero es un bien de 450 kilos pero que",
        "start": 6764.719999999999,
        "end": 6770.66
    },
    {
        "text": " lo vamos aumentando de a poco entonces ese de a poco también forma parte de este capital",
        "start": 6770.66,
        "end": 6775.66
    },
    {
        "text": " como se le llama eso y aparece un concepto más de variación de esto que también aplica acá",
        "start": 6775.66,
        "end": 6781.42
    },
    {
        "text": " la lógica de producir y guardar la más la más favorí si yo produjo algo pero todavía no",
        "start": 6781.42,
        "end": 6787.0
    },
    {
        "text": " lo vendo y bueno eso también le consigue la inversión pero para el caso uruguayo estos dos",
        "start": 6787.0,
        "end": 6792.5
    },
    {
        "text": " resultan más interesantes que hablar de la de la fábrica que produce y guardó justo en",
        "start": 6792.5,
        "end": 6798.18
    },
    {
        "text": " no vendió sea entonces inversión todo lo que estuvimos hablando lo resumimos en que hay una",
        "start": 6798.18,
        "end": 6806.02
    },
    {
        "text": " variable sola que va a ser la que nos va a quedar acá determinando la inversión",
        "start": 6806.02,
        "end": 6812.66
    },
    {
        "text": " con estas lógicas de separar bien que es el capital que está detrás de la inversión que es",
        "start": 6814.42,
        "end": 6821.14
    },
    {
        "text": " este no es estos otros dos y que a su vez ese bueno hicimos esta desagregación de que hay otros",
        "start": 6821.14,
        "end": 6828.160000000001
    },
    {
        "text": " tipos de capital más allá de la maquinaria y equipos tradicionales la clase próxima seguimos con",
        "start": 6828.160000000001,
        "end": 6834.9400000000005
    },
    {
        "text": " los tres factores que nos queda bien nos estamos bien",
        "start": 6834.9400000000005,
        "end": 6840.5
    }
]