[
    {
        "text": " Bueno, vamos a comenzar la clase. Si se acuerdan la última clase definimos la noción",
        "start": 0.0,
        "end": 25.080000000000002
    },
    {
        "text": " operadores autoaljuntos, aquellos operadores que coinciden con su transformación al junta y",
        "start": 25.08,
        "end": 31.959999999999997
    },
    {
        "text": " vimos alguna, empezamos a ver algunas propiedades. En la clase de hoy vamos a seguir con",
        "start": 31.959999999999997,
        "end": 37.72
    },
    {
        "text": " con eso, con operadores autoaljuntos, vamos a ver que características tienen su valores",
        "start": 37.72,
        "end": 44.08
    },
    {
        "text": " propios y vamos a ver si podemos anunciar al final algún resultado referido a los",
        "start": 44.08,
        "end": 51.04
    },
    {
        "text": " espacios propios de operadores autoaljuntos. Así que repasando un poco, uno tiene como siempre",
        "start": 51.04,
        "end": 62.44
    },
    {
        "text": " un espacio vectorial sobre acá y ese espacio vectorial tiene producto interno, un espacio vectorial",
        "start": 62.44,
        "end": 74.48
    },
    {
        "text": " sobre un cuerpo con producto interno. Y ahí tenemos definido un operador lineal que es una",
        "start": 74.48,
        "end": 89.24000000000001
    },
    {
        "text": " transformación T de BMW. Bien, entonces ya hemos hecho varias veces este dibujito, yo tengo el espacio",
        "start": 89.24,
        "end": 104.36
    },
    {
        "text": " vectorial acá, V, tengo una transformación T que va a de V, en V eso es un operador lineal,",
        "start": 104.36,
        "end": 111.88
    },
    {
        "text": " tengo acá definido un producto interno y decimos que T es autoaljuntos y coincide con su operador",
        "start": 112.6,
        "end": 120.8
    },
    {
        "text": " aljunto que viene el rigor desde acá para acá. Bien, entonces T es autoaljuntos",
        "start": 120.8,
        "end": 128.07999999999998
    },
    {
        "text": " sí solo sí, T coincide con T estrella que es el operador aljunto que ya definimos en",
        "start": 128.08,
        "end": 141.64000000000001
    },
    {
        "text": " clases pasadas y esto lo mismo que decirlo siguiente, si yo acá agar un vector V y lo transformo por",
        "start": 141.64000000000001,
        "end": 149.8
    },
    {
        "text": " este lado y tengo Tmb y acá agar un vector V y lo transformo por este lado con T estrella y",
        "start": 149.8,
        "end": 156.32000000000002
    },
    {
        "text": " tengo T estrella en V, entonces se cumple que el producto interno de estos dos vectores es igual",
        "start": 156.32,
        "end": 163.64
    },
    {
        "text": " al producto interno de estos vectoros. Acá estamos en el mismo espacio, sí para todo V y para",
        "start": 163.64,
        "end": 169.84
    },
    {
        "text": " todo V que ponga aquí, o sea esto lo mismo que decir",
        "start": 169.84,
        "end": 172.35999999999999
    },
    {
        "text": " que T es autoaljuntos, sí solo sí se cumple lo siguiente, si yo hago TdB con W, que es lo que tengo",
        "start": 172.92000000000002,
        "end": 191.12
    },
    {
        "text": " dibujado ahí, eso me da lo mismo que el producto interno debe contendo W en este orden,",
        "start": 191.12,
        "end": 197.20000000000002
    },
    {
        "text": " sí recuerden que el aljunto pasa para este lado el producto interno como T estrella y como",
        "start": 198.2,
        "end": 204.04
    },
    {
        "text": " el autoaljuntos T estrella es lo mismo que decir esto, o sea Tmb con W es igual a V contendo W para",
        "start": 204.04,
        "end": 211.35999999999999
    },
    {
        "text": " todo V y W en el espacio vectorial donde estamos trabajando. Estamos esa es la definición de",
        "start": 211.35999999999999,
        "end": 219.04
    },
    {
        "text": " autoaljuntos vamos a trabajar en el clases de hoy todo el tiempo con esto y habíamos visto un",
        "start": 219.04,
        "end": 225.23999999999998
    },
    {
        "text": " par de propiedades que tenían que ver con la representación matricial de un operado autojunto en",
        "start": 225.24,
        "end": 230.4
    },
    {
        "text": " una base orto normal del espacio vectorial que estamos considerando, sí yo le había comentado los",
        "start": 230.4,
        "end": 236.44
    },
    {
        "text": " guientes, convíense para el caso real del caso complejo, o sea comienzo separar el caso en el",
        "start": 236.44,
        "end": 244.8
    },
    {
        "text": " cuerpo de los reales, aquel caso en el cuerpo, en el que el cuerpo son los complejos,",
        "start": 244.8,
        "end": 249.96
    },
    {
        "text": " por motivos que ya van a quedar clavos en un ratito, si, acá tenemos entonces,",
        "start": 249.96,
        "end": 257.44
    },
    {
        "text": " con los trabajamos con los reales, vimos que T autoaljuntos",
        "start": 257.44,
        "end": 262.52
    },
    {
        "text": " es lo mismo que decir que en cualquier base orto normal que yo esté trabajando,",
        "start": 270.56,
        "end": 275.6
    },
    {
        "text": " esta matria sociedad tenda base orto normal es, se cuesta simétrica, si traspongo me da la",
        "start": 276.16,
        "end": 284.84000000000003
    },
    {
        "text": " misma matriz, esto es simétrica, es simétrica, no olvide hacer esto, en toda vez base orto normal,",
        "start": 284.84000000000003,
        "end": 297.32000000000005
    },
    {
        "text": " base orto normal del espacio en que estamos trabajados, en tanto que en este otro caso tenemos",
        "start": 297.32,
        "end": 308.84
    },
    {
        "text": " que T autoaljunto, sí solo sí en toda base orto normal se cumple que la matria sociedad T en",
        "start": 308.84,
        "end": 322.03999999999996
    },
    {
        "text": " esa base es sermítica, es decir, es igual a la matriz traspuesta conjugada, conjudo todas las",
        "start": 322.04,
        "end": 330.72
    },
    {
        "text": " entradas de la matriz traspongo y me da la misma matrizqueta, para toda base orto normal también,",
        "start": 330.72,
        "end": 335.20000000000005
    },
    {
        "text": " estamos, eso lo habíamos visto y además queda claro que se para del caso real, del caso complejo",
        "start": 335.2,
        "end": 355.48
    },
    {
        "text": " por lo siguiente, cuando yo estoy trabajando en el caso complejo, cuando estamos acá,",
        "start": 355.48,
        "end": 360.71999999999997
    },
    {
        "text": " ¿qué pasa ahí? si yo me fijo el polidónio característico asociado en otra formación",
        "start": 361.72,
        "end": 366.40000000000003
    },
    {
        "text": " lineal, ese siempre va a tener raíces en el cuerpo, o sea, yo sabía un por el teorema fundamental",
        "start": 366.40000000000003,
        "end": 372.56
    },
    {
        "text": " de la algebra que el polinomio característico asociado en una operadora ola ola es un polinomio",
        "start": 372.56,
        "end": 379.84000000000003
    },
    {
        "text": " vibrado en, que como estamos en el cuerpo complejo tiene al menos una raíz, todas las raíces",
        "start": 379.84000000000003,
        "end": 384.56
    },
    {
        "text": " están en el cuerpo complejo, y como estamos trabajando en el cuerpo complejo, todas las raíces",
        "start": 384.56,
        "end": 388.88000000000005
    },
    {
        "text": " el polinomio característico son valores propios, o sea, acá todo operador tiene valores propios,",
        "start": 388.88,
        "end": 394.96
    },
    {
        "text": " todo operador en general, si entonces acá tenemos que todas las raíces, acá tenemos que",
        "start": 394.96,
        "end": 404.76
    },
    {
        "text": " todo las raíces, el polinomio característico están en caas y por lo tanto, y por lo tanto",
        "start": 404.76,
        "end": 419.84
    },
    {
        "text": " son valores propios, en general digo, para cualquier operador, y acá en cambio para cualquier",
        "start": 419.84,
        "end": 433.52
    },
    {
        "text": " operador, cuando trabajamos con los reales hay que tener cuidado, para que una raíz sea valor",
        "start": 433.52,
        "end": 440.15999999999997
    },
    {
        "text": " propio tiene que estar en los reales, estoy hablando de operador en general, no de autoadjuntos,",
        "start": 440.15999999999997,
        "end": 444.15999999999997
    },
    {
        "text": " ya veremos propiedades del autoadjuntos, acá tenemos que para que una raíz, una raíz",
        "start": 444.15999999999997,
        "end": 454.12
    },
    {
        "text": " el polinomio característico es valor propio, si está en caas, y en principio acá podemos tener",
        "start": 454.84000000000003,
        "end": 468.04
    },
    {
        "text": " operadores lineales en el cuerpo real que no tenga valores propios, de hecho hemos visto",
        "start": 468.04,
        "end": 473.44
    },
    {
        "text": " ya varios ejemplos en el curso, entonces esta distinción es importante, cuando trabajamos con",
        "start": 473.44,
        "end": 479.88
    },
    {
        "text": " los complejos, con un operador cualquiera, todas las raíces están en el cuerpo, todas las raíces",
        "start": 479.88,
        "end": 485.71999999999997
    },
    {
        "text": " el polinomio característico y por lo tanto son valores propios, y acá con trabajamos con el cuerpo",
        "start": 485.71999999999997,
        "end": 490.44
    },
    {
        "text": " real, para que una raíz del polinomio característico sea valor propio tiene que estar en el cuerpo,",
        "start": 490.44,
        "end": 494.6
    },
    {
        "text": " pero una raíz de siete es valor propio, si está en R, si está en el cuerpo, se los reales.",
        "start": 494.6,
        "end": 500.2
    },
    {
        "text": " Si una observación tonta que ya hemos visto anteriormente, y obviamente acá por definición",
        "start": 500.76,
        "end": 515.12
    },
    {
        "text": " todos los valores propios son reales, y acá tenemos por el tenemos fundamental del álgebra",
        "start": 515.12,
        "end": 520.76
    },
    {
        "text": " de que existe al menos un valor propio, eso lo sabemos, si lo que vamos a ver ahora es que en el",
        "start": 520.76,
        "end": 525.36
    },
    {
        "text": " caso particular de que un operador sea auto adjunto, acá todas las raíces son reales, es decir,",
        "start": 525.36,
        "end": 534.76
    },
    {
        "text": " todos los valores propios acá son reales, esa es una particularidad que tienen los operadores",
        "start": 534.76,
        "end": 540.0
    },
    {
        "text": " auto adjunto, aun cuando uno trabaje con el cuerpo complejo, eso lo vamos a ver en un ratito,",
        "start": 540.0,
        "end": 545.92
    },
    {
        "text": " y acá cuando trabajemos con el cuerpo real, obviamente por definición todo el",
        "start": 545.92,
        "end": 552.08
    },
    {
        "text": " propio real, lo que vamos a ver es que todas las raíces del polinomio característico son reales",
        "start": 552.08,
        "end": 556.8000000000001
    },
    {
        "text": " cuando usted es auto adjunto, es decir que todas las raíces del polinomio característico son valores",
        "start": 556.8000000000001,
        "end": 562.5200000000001
    },
    {
        "text": " propios en esta situación cuando usted es auto adjunto, y acá todas las raíces son reales y por lo",
        "start": 562.5200000000001,
        "end": 569.1
    },
    {
        "text": " tanto todos los valores propios son reales, se entiende eso, eso es lo que vamos a probar en la",
        "start": 569.1,
        "end": 573.64
    },
    {
        "text": " primera parte de la clase de hoy. Entonces, empecemos con la siguiente situación, nos concentremos acá,",
        "start": 574.1999999999999,
        "end": 593.28
    },
    {
        "text": " en esta situación, y veamos que si usted es auto adjunto, entonces todos los valores propios son",
        "start": 593.28,
        "end": 599.2
    },
    {
        "text": " reales, esto significa que estamos trabajando en el cuerpo complejo, pero todos los valores propios coinciden con su",
        "start": 599.76,
        "end": 605.1600000000001
    },
    {
        "text": " conjugada, o es decir, es tan sobrelegio real, tienen parte imaginaria, nubla, eso lo primero que vamos a",
        "start": 605.1600000000001,
        "end": 610.72
    },
    {
        "text": " que se ha probado. Estas demostraciones son lindas porque salen en un renglón, ya vamos a ver",
        "start": 610.72,
        "end": 622.5200000000001
    },
    {
        "text": " la estructura geométrica importante y tienen los operadores auto adjunto. Así que vamos a",
        "start": 622.52,
        "end": 629.88
    },
    {
        "text": " empezar entonces con el siguiente teoreno. Lo copio como siempre.",
        "start": 629.88,
        "end": 639.32
    },
    {
        "text": " Bien, esto es lo primero que vamos a empezar probando, insisto, estamos trabajando en un espacio",
        "start": 690.6,
        "end": 702.84
    },
    {
        "text": " electoral con producto interno sobre el cuerpo complejo y vamos a ver, bueno, que si no considero un",
        "start": 702.84,
        "end": 708.52
    },
    {
        "text": " operador auto adjunto, en ese caso si lambda es un valor propio de T, entonces lambda es real,",
        "start": 708.52,
        "end": 714.0
    },
    {
        "text": " es ni este contexto, quiere decir que lambda con jugado me da la misma cosa y por lo tanto,",
        "start": 714.56,
        "end": 722.12
    },
    {
        "text": " entonces vamos a ver que toda raíz del polínomo característico es real en el caso de que",
        "start": 722.12,
        "end": 727.56
    },
    {
        "text": " este hemos trabajando con auto adjunto, todas estas raíces son reales y son todas ellas valores propios.",
        "start": 727.56,
        "end": 732.24
    },
    {
        "text": " Bueno, vamos a la demostración de ese resultado, entonces vamos a considerar un valor propio,",
        "start": 735.48,
        "end": 740.32
    },
    {
        "text": " lambda valor propio de T, que sea un valor propio, que significa que existe un vector distinto",
        "start": 744.0,
        "end": 759.32
    },
    {
        "text": " en uno, tan que T aplicado a B me da lambda por B, entonces existe un vector B distinto de cero,",
        "start": 759.32,
        "end": 769.8000000000001
    },
    {
        "text": " tan que T aplicado a B es lambda por B, esa es la definición de valor propio.",
        "start": 775.1600000000001,
        "end": 781.6
    },
    {
        "text": " Entonces vamos a usar ahora que T es un operador auto adjunto,",
        "start": 781.6,
        "end": 789.84
    },
    {
        "text": " se acuerdan que sea un operador auto adjunto, quiere decir lo que haremos escrito hace un ratito,",
        "start": 799.6800000000001,
        "end": 806.76
    },
    {
        "text": " ¿qué quiere decir que sea auto adjunto? Que teme propios de lo que es cuando B es lo mismo que B",
        "start": 807.3199999999999,
        "end": 816.76
    },
    {
        "text": " contendo B, pero vamos a tomar B y B iguales a este vector propio que tenemos acá,",
        "start": 816.76,
        "end": 822.3199999999999
    },
    {
        "text": " entonces por ser te auto adjunto se cumple lo siguiente, se cumple el sillo hago, T,",
        "start": 822.3199999999999,
        "end": 828.72
    },
    {
        "text": " B con el propio B es un caso particular, esto pasa por el otro lado como T3 y como auto adjunto,",
        "start": 828.72,
        "end": 837.52
    },
    {
        "text": " me queda lo mismo que T, esto es lo mismo que B contendo B, esta es una conclusión que se deduce",
        "start": 837.52,
        "end": 845.5600000000001
    },
    {
        "text": " a el hecho de que estés auto adjunto, estamos tomando la definición auto adjunto y volvamos",
        "start": 845.5600000000001,
        "end": 852.0
    },
    {
        "text": " con un vector acá y un vector diferente acá, pero estamos tomando acá y acá el mismo vector como",
        "start": 852.0,
        "end": 856.12
    },
    {
        "text": " el caso particular y estamos tomando, eligiendo este vector que es vector propio,",
        "start": 856.12,
        "end": 860.16
    },
    {
        "text": " sí, entonces por un lado esto que me dice, apliquemos que B es vector propio,",
        "start": 860.16,
        "end": 869.8
    },
    {
        "text": " esto es con B vector propio, por un lado de este lado tenemos que esto me da lo mismo,",
        "start": 869.8,
        "end": 886.08
    },
    {
        "text": " como que lambda por B con B y el lambda como está en la primera entrada sale para afuera,",
        "start": 886.08,
        "end": 895.1600000000001
    },
    {
        "text": " sale para afuera el producto interno, entonces me queda lambda, producto 9B con B y de ese",
        "start": 895.1600000000001,
        "end": 903.8000000000001
    },
    {
        "text": " otro lado hago lo mismo nada más que ahora, nada más que ahora me queda B por lambda",
        "start": 903.8000000000001,
        "end": 912.4000000000001
    },
    {
        "text": " de B y el lambda está en la segunda entrada y por lo tanto sale para afuera con el producto",
        "start": 912.4,
        "end": 917.16
    },
    {
        "text": " como conjugado, estamos, esto es de la definición auto adjunto, aplico que B es un vector propio",
        "start": 917.16,
        "end": 930.8
    },
    {
        "text": " asociado a lambda, entonces me da lo mismo que esto, la vamos a sale para afuera y acá la",
        "start": 930.8,
        "end": 936.86
    },
    {
        "text": " vamos a sale para afuera pero conjugado, entonces tengo que esta cantidad, sigo a la esta,",
        "start": 936.86,
        "end": 942.26
    },
    {
        "text": " si agrupo todo esto me dice que lambda, menos lambda conjugado multiplicado por el producto",
        "start": 942.26,
        "end": 953.02
    },
    {
        "text": " interno de B consigo mismo, esto me da cero y ¿qué pasa ahí? Como hemos elegido B vector",
        "start": 953.02,
        "end": 968.56
    },
    {
        "text": " propio, lo hemos elegido en partidero en vector propio es distinto del nulo, definición",
        "start": 968.56,
        "end": 973.9399999999999
    },
    {
        "text": " de vector propio, B distinto de cero por lo tanto esta cantidad que tengo acá, esto que",
        "start": 973.9399999999999,
        "end": 980.78
    },
    {
        "text": " tengo acá este producto interno es distinto de cero, entonces la única forma que se cumpla,",
        "start": 980.78,
        "end": 985.8199999999999
    },
    {
        "text": " que este producto me da cero es que este factor sea nulo, o sea que saco que lambda,",
        "start": 985.8199999999999,
        "end": 995.74
    },
    {
        "text": " menos lambda conjugado, tiene que ser igual a cero y por lo tanto lambda, el valor propio",
        "start": 995.74,
        "end": 1007.76
    },
    {
        "text": " que tiene que ser igual a su conjugado, esto es lambda tiene que ser real, sí, sí,",
        "start": 1007.76,
        "end": 1014.96
    },
    {
        "text": " ¿a dónde acá? Hace lo mismo, sí, sí, el agrupo para que quede claro que es lo que",
        "start": 1014.96,
        "end": 1026.28
    },
    {
        "text": " es distinto de cero y por lo tanto ¿qué necesariamente tiene que ser igual a cero? Bien, entonces",
        "start": 1026.28,
        "end": 1031.0
    },
    {
        "text": " lambda menos lambda conjugado tiene que ser igual a cero, entonces lambda es igual a su",
        "start": 1031.0,
        "end": 1035.7
    },
    {
        "text": " conjugado, por lo tanto tiene que ser real, bien o sea su parte imaginaria es cero, sí",
        "start": 1035.7,
        "end": 1049.32
    },
    {
        "text": " entonces cuando trabajamos sobre el cuerpo complejo, si uno operado al todo junto sacamos",
        "start": 1049.32,
        "end": 1055.98
    },
    {
        "text": " que los valores propios son reales y por lo tanto todas las raíces del ponenimo característico",
        "start": 1055.98,
        "end": 1061.3400000000001
    },
    {
        "text": " son reales, esa es una particularidad de los operadores autoarjuntos y como siempre",
        "start": 1061.34,
        "end": 1067.4599999999998
    },
    {
        "text": " exista al menos una raíz, sacamos que siempre existe un valor propio al menos y real,",
        "start": 1067.4599999999998,
        "end": 1075.6999999999998
    },
    {
        "text": " estamos, se vamos a abordar al final de la clase el tema de la diagonalización, por",
        "start": 1075.6999999999998,
        "end": 1086.3799999999999
    },
    {
        "text": " lo pronto estamos dando características de los valores propios, después veremos características",
        "start": 1086.38,
        "end": 1092.38
    },
    {
        "text": " de los subespacios propios, asociados valores propios distintos y al final iremos el tema",
        "start": 1092.38,
        "end": 1098.0200000000002
    },
    {
        "text": " de la diagonalización de operadores autoarjuntos.",
        "start": 1098.0200000000002,
        "end": 1102.42
    },
    {
        "text": " Pero preguntas hasta acá, entonces como un coloario todo esto, como un coloario tenemos",
        "start": 1102.42,
        "end": 1127.94
    },
    {
        "text": " así, ¿qué es lo que les acabo así?",
        "start": 1127.94,
        "end": 1133.94
    },
    {
        "text": " ¿qué es lo que es lo que es lo que es lo que es lo que es lo que es lo que es lo que es lo que es lo que es lo que es lo que es lo que es lo que es lo que es lo que es lo que es lo que es lo que es lo que es lo que es lo que es lo que es lo que es lo que es lo que es lo que es lo que es lo que es lo que es lo que es lo que es lo que es lo que es lo que es lo que es lo que es lo que es lo que es lo que es lo que es lo que es lo que es lo que es lo que es lo que es lo que es lo que es lo que es lo que es lo que es lo que es lo que es lo que es lo que es lo que es lo que es lo que es lo que es lo que es lo que es lo que es lo que es lo que es lo que es lo que es lo que es lo que es lo que es lo que es lo que es lo que es lo que",
        "start": 1157.94,
        "end": 1187.94
    },
    {
        "text": " de lo que tenemos es como coranciado que nos veamos a la",
        "start": 1187.94,
        "end": 1212.1000000000001
    },
    {
        "text": " y lo que como vimos allá, todos los valores propios son reales y como todas las raíces",
        "start": 1217.94,
        "end": 1223.14
    },
    {
        "text": " características, son valores propios, concluimos que todas las raíces características son reales.",
        "start": 1223.14,
        "end": 1230.74
    },
    {
        "text": " Y lo que vamos a ver ahora es un resultado analogo, para el caso real, vamos a ver que si",
        "start": 1230.74,
        "end": 1244.14
    },
    {
        "text": " usted autodajuntó, todas las raíces características también son reales, todas las raíces características",
        "start": 1244.14,
        "end": 1249.98
    },
    {
        "text": " del polinomo característico, recuerden que si estamos trabajando con los reales por definición,",
        "start": 1249.98,
        "end": 1255.94
    },
    {
        "text": " los valores propios son reales, una cosa son los valores propios, otras cosas son las",
        "start": 1255.94,
        "end": 1259.94
    },
    {
        "text": " raíces características, lo que vamos a ver ahora que en el caso real, todas las raíces",
        "start": 1259.94,
        "end": 1264.7
    },
    {
        "text": " características del poliromio de este son reales, estamos y por lo tanto todas son valores",
        "start": 1264.7,
        "end": 1273.5800000000002
    },
    {
        "text": " propios. Es una sutileza lo que voy a decir, lo que voy a probar. Acá probamos que todos los",
        "start": 1273.58,
        "end": 1288.74
    },
    {
        "text": " valores propios son reales y por lo tanto todas las raíces son reales, acá por definición",
        "start": 1288.74,
        "end": 1292.78
    },
    {
        "text": " en el caso real, todos los valores propios son reales, vamos a probar que las raíces características",
        "start": 1292.78,
        "end": 1297.78
    },
    {
        "text": " también son reales, eso es lo que vamos a ver. Bueno, a ver dónde puedo borrar. Es un detalle",
        "start": 1297.78,
        "end": 1308.34
    },
    {
        "text": " técnico, hay que haber con cuidado, pero es bien natural una vez que ha visto uno, el caso",
        "start": 1308.34,
        "end": 1314.66
    },
    {
        "text": "",
        "start": 1314.66,
        "end": 1315.46
    },
    {
        "text": " No sé si algunas van a ver mecánica, cuántica en su carrera,",
        "start": 1344.66,
        "end": 1350.1000000000001
    },
    {
        "text": " de la parte más linda de la física.",
        "start": 1350.1000000000001,
        "end": 1353.3000000000002
    },
    {
        "text": " Ahí uno trabaja con el espacio vectorial,",
        "start": 1353.3000000000002,
        "end": 1357.0600000000002
    },
    {
        "text": " ves reemplazado por un espacio de funciones de onda,",
        "start": 1357.0600000000002,
        "end": 1360.3000000000002
    },
    {
        "text": " con una estructura un poco más compleja,",
        "start": 1360.3000000000002,
        "end": 1363.98
    },
    {
        "text": " un espacio de dimensión infinita.",
        "start": 1363.98,
        "end": 1365.7
    },
    {
        "text": " Y uno trabaja con cada cantidad física,",
        "start": 1365.7,
        "end": 1370.02
    },
    {
        "text": " esta sociedad, a un operador autoadjunto.",
        "start": 1370.02,
        "end": 1372.18
    },
    {
        "text": " Nos vemos sentido que lo definimos recién.",
        "start": 1372.18,
        "end": 1374.02
    },
    {
        "text": " Los cada cantidad física, el momento, la energía, etcétera,",
        "start": 1374.02,
        "end": 1378.5800000000002
    },
    {
        "text": " tiene asociación operadora ahí y es un operador autoadjunto.",
        "start": 1378.5800000000002,
        "end": 1382.66
    },
    {
        "text": " Entonces, lo que son los valores propios de esos operadores,",
        "start": 1382.66,
        "end": 1386.78
    },
    {
        "text": " que son cantidades reales, son lo que se asumen,",
        "start": 1386.78,
        "end": 1389.98
    },
    {
        "text": " las cantidades que uno mide cuando es un experimento,",
        "start": 1389.98,
        "end": 1393.0600000000002
    },
    {
        "text": " o el valor propio que uno mide, la energía, etcétera, etcétera.",
        "start": 1393.0600000000002,
        "end": 1396.46
    },
    {
        "text": " O sea, este tipo operador,",
        "start": 1396.46,
        "end": 1398.54
    },
    {
        "text": " fue un papel importantísimo en física,",
        "start": 1398.54,
        "end": 1400.8200000000002
    },
    {
        "text": " como un montón de contextos bien diferentes.",
        "start": 1400.82,
        "end": 1405.3799999999999
    },
    {
        "text": " Bien, en esta distiga también aparece.",
        "start": 1405.3799999999999,
        "end": 1409.22
    },
    {
        "text": " Entonces, vamos a probar el resultado equivalente",
        "start": 1409.22,
        "end": 1411.74
    },
    {
        "text": " para el caso real, que es un detalle técnico,",
        "start": 1411.74,
        "end": 1414.02
    },
    {
        "text": " pero lo vamos a ver con cuidado.",
        "start": 1414.02,
        "end": 1415.62
    },
    {
        "text": " Entonces, vamos a ir al caso en que ves",
        "start": 1431.82,
        "end": 1434.1799999999998
    },
    {
        "text": " un espacio vectorial con producto interno,",
        "start": 1434.1799999999998,
        "end": 1437.82
    },
    {
        "text": " y ahora es sobreerre, sobre el cuerpo los reales.",
        "start": 1437.82,
        "end": 1447.4199999999998
    },
    {
        "text": " Entonces, de nuevo, como vamos a trabajar con el polimino característico,",
        "start": 1447.4199999999998,
        "end": 1451.26
    },
    {
        "text": " vamos a suponer que la dimensión debe finita,",
        "start": 1451.26,
        "end": 1456.26
    },
    {
        "text": " y que te que va de BMW es autoarjunto.",
        "start": 1456.26,
        "end": 1461.82
    },
    {
        "text": " Repito por en S&M, en S&B.",
        "start": 1461.82,
        "end": 1469.66
    },
    {
        "text": " Acá ya sabemos por definición que los valores propios son reales.",
        "start": 1469.66,
        "end": 1473.5
    },
    {
        "text": " Lo que vamos a probar es que las raíces,",
        "start": 1473.5,
        "end": 1475.86
    },
    {
        "text": " todas las raíces características,",
        "start": 1475.86,
        "end": 1477.06
    },
    {
        "text": " todas las raíces polimino característicos son reales.",
        "start": 1477.06,
        "end": 1479.3
    },
    {
        "text": " Por lo tanto, que existe necesariamente,",
        "start": 1479.3,
        "end": 1482.46
    },
    {
        "text": " al menos un valor propio.",
        "start": 1482.46,
        "end": 1484.26
    },
    {
        "text": " Entonces, te autoarjunto, vamos a probar que todas las raíces,",
        "start": 1485.26,
        "end": 1495.06
    },
    {
        "text": " el polimino característico, sí subte son reales.",
        "start": 1495.06,
        "end": 1503.86
    },
    {
        "text": " Estamos.",
        "start": 1503.86,
        "end": 1508.6599999999999
    },
    {
        "text": " Y ahí la idea es llevar el problema al caso complejo,",
        "start": 1515.6599999999999,
        "end": 1519.4599999999998
    },
    {
        "text": " y usar lo que acabamos a probar.",
        "start": 1519.4599999999998,
        "end": 1523.6599999999999
    },
    {
        "text": " Sí.",
        "start": 1523.6599999999999,
        "end": 1524.6599999999999
    },
    {
        "text": " Porque en general, cuando voten en un operador en el caso real,",
        "start": 1528.6599999999999,
        "end": 1532.6599999999999
    },
    {
        "text": " las raíces ponemos característico pueden ser complejos.",
        "start": 1533.66,
        "end": 1537.46
    },
    {
        "text": " Ah, en el cuerpo lo complejo, no hay ningún problema.",
        "start": 1540.66,
        "end": 1543.26
    },
    {
        "text": " En el cuerpo los complejos, las raíces características son complejas",
        "start": 1543.26,
        "end": 1547.26
    },
    {
        "text": " y son todos valores propios.",
        "start": 1547.26,
        "end": 1548.8600000000001
    },
    {
        "text": " El problema está en el caso real.",
        "start": 1548.8600000000001,
        "end": 1550.66
    },
    {
        "text": " En el caso real, para que una raíz característica sea valor propio,",
        "start": 1550.66,
        "end": 1555.46
    },
    {
        "text": " tiene que ser real.",
        "start": 1555.46,
        "end": 1556.46
    },
    {
        "text": " Y eso es lo que vamos a probar,",
        "start": 1556.46,
        "end": 1557.46
    },
    {
        "text": " que todas las raíces características son reales cuando usted autoarjunto.",
        "start": 1557.46,
        "end": 1560.8600000000001
    },
    {
        "text": " Y por lo tanto, todas son valores propios.",
        "start": 1560.86,
        "end": 1563.6599999999999
    },
    {
        "text": " En el caso complejo lo que probamos es que todas las raíces características",
        "start": 1563.6599999999999,
        "end": 1568.6599999999999
    },
    {
        "text": " que sabemos que son valores propios son reales.",
        "start": 1568.6599999999999,
        "end": 1571.6599999999999
    },
    {
        "text": " ¿Se entiende?",
        "start": 1571.6599999999999,
        "end": 1573.6599999999999
    },
    {
        "text": " Sí, pero acá estamos trabajando en los complejos y estamos trabajando en los reales.",
        "start": 1573.6599999999999,
        "end": 1581.6599999999999
    },
    {
        "text": " El tema primero, déjame,",
        "start": 1581.6599999999999,
        "end": 1585.6599999999999
    },
    {
        "text": " el tema primero que escribí que dice si la andas al propio atentos es la andas real,",
        "start": 1585.6599999999999,
        "end": 1590.4599999999998
    },
    {
        "text": " pero eso lo probamos para el caso complejo.",
        "start": 1590.46,
        "end": 1597.06
    },
    {
        "text": " Sí, porque en el caso real estamos haciendo una afirmación sobre los valores propios.",
        "start": 1603.06,
        "end": 1607.8600000000001
    },
    {
        "text": " En el caso real ya sabemos que los valores propios son reales,",
        "start": 1607.8600000000001,
        "end": 1610.8600000000001
    },
    {
        "text": " porque por definición son reales.",
        "start": 1610.8600000000001,
        "end": 1613.26
    },
    {
        "text": " Para que algo sea valor propio, tiene que estar en el cuerpo.",
        "start": 1613.26,
        "end": 1616.26
    },
    {
        "text": " ¿Se entiende?",
        "start": 1616.66,
        "end": 1618.66
    },
    {
        "text": " En el caso complejo todas las raíces son valor propio.",
        "start": 1618.66,
        "end": 1621.66
    },
    {
        "text": " En el caso complejo todas las raíces son valores propios.",
        "start": 1621.66,
        "end": 1626.06
    },
    {
        "text": " ¿Se tiene más raíces? ¿Se va a dar propios reales?",
        "start": 1626.06,
        "end": 1628.06
    },
    {
        "text": " ¿Y que lo haría y las raíces son reales?",
        "start": 1628.06,
        "end": 1631.06
    },
    {
        "text": " No, lo que dice...",
        "start": 1631.06,
        "end": 1633.06
    },
    {
        "text": " Sí.",
        "start": 1633.06,
        "end": 1636.06
    },
    {
        "text": " Sí, sí, sí.",
        "start": 1636.06,
        "end": 1641.06
    },
    {
        "text": " Espero un poquito. Me están diciendo, me están comparando el teoremo original con el coro de la Ario Este.",
        "start": 1641.06,
        "end": 1655.06
    },
    {
        "text": " ¿No?",
        "start": 1655.06,
        "end": 1656.06
    },
    {
        "text": " Ah, está, está, ahora entiendo. No, pensé que me estaban hablando de este teoremo.",
        "start": 1656.06,
        "end": 1660.06
    },
    {
        "text": " No, no, no, de este...",
        "start": 1660.06,
        "end": 1662.06
    },
    {
        "text": " Sí, sí, tienen razón.",
        "start": 1662.06,
        "end": 1665.06
    },
    {
        "text": " Es lo mismo, solamente acá estamos poniendo, acá estamos haciendo una, por ejemplo, el teoremo,",
        "start": 1665.06,
        "end": 1672.06
    },
    {
        "text": " no necesitamos que la dimensión sea finita, porque lo que estamos diciendo es que sea un valor propio,",
        "start": 1672.06,
        "end": 1676.6599999999999
    },
    {
        "text": " entonces real.",
        "start": 1676.6599999999999,
        "end": 1677.6599999999999
    },
    {
        "text": " Y eso es válido, en dimensión finita o infinita.",
        "start": 1677.6599999999999,
        "end": 1680.6599999999999
    },
    {
        "text": " Acá estamos...",
        "start": 1680.6599999999999,
        "end": 1681.6599999999999
    },
    {
        "text": " Cuando hacemos una afirmación que involucra, al ponerno que era el periodístico,",
        "start": 1681.6599999999999,
        "end": 1685.26
    },
    {
        "text": " nos vamos a la dimensión finita.",
        "start": 1685.26,
        "end": 1686.86
    },
    {
        "text": " Es una tontera, pero es... es la misma cosa.",
        "start": 1686.86,
        "end": 1691.86
    },
    {
        "text": " Estamos...",
        "start": 1691.86,
        "end": 1692.86
    },
    {
        "text": " Lo otro me dice que aún, cuando la dimensión sea infinita, si algo es autoadjunto,",
        "start": 1692.86,
        "end": 1698.86
    },
    {
        "text": " y si tengo un operado autoadjunto y la anda es un valor propio, entonces necesariamente real.",
        "start": 1698.86,
        "end": 1703.86
    },
    {
        "text": " Esa es la diferencia.",
        "start": 1703.86,
        "end": 1704.86
    },
    {
        "text": " Esto es una diferencia muy, muy chiquita, pero vale la pena remarcarlo.",
        "start": 1704.86,
        "end": 1712.86
    },
    {
        "text": " Bueno, se entendió alguna pregunta.",
        "start": 1712.86,
        "end": 1715.86
    },
    {
        "text": " Entonces, vamos a llevar este problema al caso anterior y vamos a concluir que todas las raíces",
        "start": 1715.86,
        "end": 1722.86
    },
    {
        "text": " en el ponemos característicos son reales.",
        "start": 1722.86,
        "end": 1729.86
    },
    {
        "text": " Son todas las diferencias sutiles las que hay.",
        "start": 1729.86,
        "end": 1731.86
    },
    {
        "text": " Entre el primer teorema, el corolario y este teorema que escribimos recién.",
        "start": 1731.86,
        "end": 1738.86
    },
    {
        "text": " Bueno, definitiva, la conclusión final de todo esto es que si uno trabaja con operado",
        "start": 1738.86,
        "end": 1742.86
    },
    {
        "text": " autoadjunto, ya sea en el cuerpo real o en el cuerpo complejo, los valores propios son reales",
        "start": 1742.86,
        "end": 1749.86
    },
    {
        "text": " y si no están dimensión finita y puede construir el ponemos característico,",
        "start": 1749.86,
        "end": 1752.86
    },
    {
        "text": " todas las raíces ponemos característicos son reales.",
        "start": 1752.86,
        "end": 1754.86
    },
    {
        "text": " Eso es todo.",
        "start": 1754.86,
        "end": 1755.86
    },
    {
        "text": " Vamos.",
        "start": 1755.86,
        "end": 1756.86
    },
    {
        "text": " Entonces, vamos a aprobar, a demostrar esto último.",
        "start": 1756.86,
        "end": 1761.86
    },
    {
        "text": " Estamos en dimensión finita, entonces.",
        "start": 1767.86,
        "end": 1771.86
    },
    {
        "text": " Vamos a agarrar una base ortonormal.",
        "start": 1772.86,
        "end": 1774.86
    },
    {
        "text": " Vamos a agarrar una base ortonormal.",
        "start": 1781.86,
        "end": 1783.86
    },
    {
        "text": " Entonces, como sabemos que este autoadjunto,",
        "start": 1783.86,
        "end": 1786.86
    },
    {
        "text": " sabemos que la matriz asociada a T en esa base ortonormal es simétrica.",
        "start": 1791.86,
        "end": 1796.86
    },
    {
        "text": " Esa matriz le vamos a llamar a.",
        "start": 1797.86,
        "end": 1800.86
    },
    {
        "text": " Entonces, esto es lo que vimos.",
        "start": 1810.86,
        "end": 1812.86
    },
    {
        "text": " Cuando yo tengo una autoadjunto y una base ortonormal y estoy trabajando en el cuerpo",
        "start": 1812.86,
        "end": 1816.86
    },
    {
        "text": " los reales, la matriz asociada a T es simétrica.",
        "start": 1816.86,
        "end": 1819.86
    },
    {
        "text": " Y además, obviamente es una matriz real porque estamos trabajando",
        "start": 1819.86,
        "end": 1822.86
    },
    {
        "text": " en el cuerpo los reales.",
        "start": 1823.86,
        "end": 1826.86
    },
    {
        "text": " Ahora me voy el espacio de los complejos para poder usar el resultado anterior.",
        "start": 1828.86,
        "end": 1834.86
    },
    {
        "text": " Me voy el espacio de los complejos, construyo una nueva transformación,",
        "start": 1834.86,
        "end": 1837.86
    },
    {
        "text": " un nuevo operador sobre ese cuerpo complejo de dimensiones,",
        "start": 1837.86,
        "end": 1840.86
    },
    {
        "text": " y trato de sacar conclusiones ahí.",
        "start": 1840.86,
        "end": 1842.86
    },
    {
        "text": " Entonces, vamos a considerar el espacio vectorial que tenga la misma dimensión de este,",
        "start": 1842.86,
        "end": 1848.86
    },
    {
        "text": " espero un segundo y la llamamos.",
        "start": 1849.86,
        "end": 1853.86
    },
    {
        "text": " Dimensión finita, le vamos a llamar más a un, le vamos a poner dimensión n,",
        "start": 1853.86,
        "end": 1858.86
    },
    {
        "text": " le vamos a poner nombre a la dimensión, número, la dimensión es n.",
        "start": 1858.86,
        "end": 1863.86
    },
    {
        "text": " Entonces, vamos a pasar este espacio vectorial real de dimensión n,",
        "start": 1865.86,
        "end": 1871.86
    },
    {
        "text": " vamos a construir un espacio vectorial complejo y dimensión n,",
        "start": 1871.86,
        "end": 1874.86
    },
    {
        "text": " y nada más fácil de construir que las n uplas de números complejos,",
        "start": 1874.86,
        "end": 1878.86
    },
    {
        "text": " o sea, sea la n.",
        "start": 1878.86,
        "end": 1880.86
    },
    {
        "text": " Entonces, vamos a considerar.",
        "start": 1880.86,
        "end": 1883.86
    },
    {
        "text": " Vectorial c a la n, como cuerpo vamos a tomar los complejos sobre el cuerpo c,",
        "start": 1895.86,
        "end": 1902.86
    },
    {
        "text": " y como producto interno vamos a tomar el producto interno usual.",
        "start": 1905.86,
        "end": 1910.86
    },
    {
        "text": " El producto interno usual en sea la n, y que ustedes ya saben cuál es.",
        "start": 1916.86,
        "end": 1919.86
    },
    {
        "text": " Bien, nos olvidamos del espacio vectorial que tiene dimensión n,",
        "start": 1926.86,
        "end": 1929.86
    },
    {
        "text": " nos vamos a la espacio de los complejos de las n uplas de números complejos,",
        "start": 1929.86,
        "end": 1933.86
    },
    {
        "text": " sea la n.",
        "start": 1933.86,
        "end": 1934.86
    },
    {
        "text": " Es espacio vectorial, trabajamos con el cuerpo de los complejos y trabajamos con el producto interno usual.",
        "start": 1934.86,
        "end": 1939.86
    },
    {
        "text": " Y ahora vamos a definir ahí un nuevo operador lineal que va a estar obviamente relacionado con este,",
        "start": 1939.86,
        "end": 1945.86
    },
    {
        "text": " que les vamos a llamar Tetilde.",
        "start": 1945.86,
        "end": 1947.86
    },
    {
        "text": " Entonces, vamos a hacer lo siguiente, vamos a considerar primero.",
        "start": 1948.86,
        "end": 1953.86
    },
    {
        "text": " Por ejemplo, una base ortonormal de CN, por ejemplo la base canónica,",
        "start": 1953.86,
        "end": 1960.86
    },
    {
        "text": " esto es la base canónica acá, el 1, 0, 0, 0, 0, 0, 0, etc.",
        "start": 1971.86,
        "end": 1975.86
    },
    {
        "text": " Eso es una base de CN y la base canónica.",
        "start": 1975.86,
        "end": 1978.86
    },
    {
        "text": " Y vamos a definir el siguiente operador.",
        "start": 1979.86,
        "end": 1983.86
    },
    {
        "text": " Definimos el operador TN, que acá es CN, en CN,",
        "start": 1987.86,
        "end": 1993.86
    },
    {
        "text": " tal que TN, que en esa base ortonormal que estoy considerando la canónica,",
        "start": 1994.86,
        "end": 2006.86
    },
    {
        "text": " pongamos por caso, coincide con la matriz A que tenemos definida más arriba.",
        "start": 2007.86,
        "end": 2012.86
    },
    {
        "text": " Esto es una sutileza que consiste en llevar aquel problema y caso complejo que vamos a ver.",
        "start": 2019.86,
        "end": 2026.86
    },
    {
        "text": " Entonces, repasamos.",
        "start": 2026.86,
        "end": 2028.86
    },
    {
        "text": " Yo consigo una base ortonormal de mi espacio B, que es real.",
        "start": 2028.86,
        "end": 2031.86
    },
    {
        "text": " Tengo ahí T autoadjunta, por lo tanto la matria asociada a T en la base ortonormal",
        "start": 2032.86,
        "end": 2038.86
    },
    {
        "text": " es simétrica, es una matriz con entras reales y simétrica,",
        "start": 2038.86,
        "end": 2043.86
    },
    {
        "text": " estoy trabajando con los reales.",
        "start": 2043.86,
        "end": 2045.86
    },
    {
        "text": " Ahora, voy por otro lado, me considero el espacio vectorial sea la N que tiene la misma dimension que este,",
        "start": 2045.86,
        "end": 2050.8599999999997
    },
    {
        "text": " es un espacio complejo, sobre el cuerpo complejo y considero ahí el producto interno usual.",
        "start": 2050.8599999999997,
        "end": 2055.8599999999997
    },
    {
        "text": " Ahora me tomo una base, la base canónica, por ejemplo,",
        "start": 2055.8599999999997,
        "end": 2059.8599999999997
    },
    {
        "text": " en este y de fin, tenio que te tilde una transformación operada o línea de CNN,",
        "start": 2059.86,
        "end": 2066.86
    },
    {
        "text": " tal que T tilde en esta base coincida con la matriz A, eso lo puede hacer.",
        "start": 2066.86,
        "end": 2074.86
    },
    {
        "text": " Me da una matriz y yo me construy un operador definiendo cuál es su matriz o si es una base.",
        "start": 2074.86,
        "end": 2080.86
    },
    {
        "text": " Lo defino, te tilde tal que en esta base coincida con A.",
        "start": 2080.86,
        "end": 2084.86
    },
    {
        "text": " Entonces, ahora qué se cumple.",
        "start": 2084.86,
        "end": 2089.86
    },
    {
        "text": " Veamos que cumple ese te tilde, ahora estamos en el caso complejo que acabamos de ver el asulcratito.",
        "start": 2089.86,
        "end": 2096.86
    },
    {
        "text": " Entonces, ese cumple lo siguiente,",
        "start": 2096.86,
        "end": 2102.86
    },
    {
        "text": " se cumple que si yo agarro la matriz A, te tilde,",
        "start": 2102.86,
        "end": 2109.86
    },
    {
        "text": " que defiere el operador, la matriz o si es la te tilde en la base C.",
        "start": 2110.86,
        "end": 2116.86
    },
    {
        "text": " Agarro sus entradas, las conjudo, como la complejo con jugado y transpongo.",
        "start": 2116.86,
        "end": 2123.86
    },
    {
        "text": " Eso, como esta matriz a la matriz A, es lo mismo que la matriz A,",
        "start": 2128.86,
        "end": 2134.86
    },
    {
        "text": " compleja con jugada, transpuesta.",
        "start": 2134.86,
        "end": 2137.86
    },
    {
        "text": " Tomo el complejo con jugado todas las entradas de A y transpongo.",
        "start": 2137.86,
        "end": 2142.86
    },
    {
        "text": " Pero como la matriz A es real, la operación de tomar el complejo con jugado ahí me da lo mismo que A, esto es a transpuesto.",
        "start": 2142.86,
        "end": 2153.86
    },
    {
        "text": " Esto es porque A es real.",
        "start": 2155.86,
        "end": 2159.86
    },
    {
        "text": " Y además, como A es simétrica,",
        "start": 2160.86,
        "end": 2165.86
    },
    {
        "text": " porque la matriz O sea uno para otro junto, una base ortonomal,",
        "start": 2165.86,
        "end": 2169.86
    },
    {
        "text": " sacamos que a transpuesta es lo mismo que A,",
        "start": 2169.86,
        "end": 2172.86
    },
    {
        "text": " pues A es simétrica.",
        "start": 2176.86,
        "end": 2179.86
    },
    {
        "text": " Y A usamos finalmente que A es igual a esto.",
        "start": 2181.86,
        "end": 2185.86
    },
    {
        "text": " ¿Cuál es la conclusión de toda esta construcción?",
        "start": 2196.86,
        "end": 2200.86
    },
    {
        "text": " La conclusión es que la matriz A a te tilde, que es un operador definido sobre un espacio tutorial complejo,",
        "start": 2200.86,
        "end": 2209.86
    },
    {
        "text": " la matriz A a te tilde en la base C, que es una base ortonomal,",
        "start": 2209.86,
        "end": 2214.86
    },
    {
        "text": " es igual a su transpuesta, a su transpuesta, compleja con jugado, o sea, es una matriz armítica.",
        "start": 2214.86,
        "end": 2222.86
    },
    {
        "text": " Entonces la conclusión de todo esto es que,",
        "start": 2222.86,
        "end": 2226.86
    },
    {
        "text": " que T es armítica, te tilde esta, es armítica,",
        "start": 2228.86,
        "end": 2233.86
    },
    {
        "text": " es armítica, y además,",
        "start": 2236.86,
        "end": 2240.86
    },
    {
        "text": " es una base ortonomal del espacio auditorial en el que estamos trabajando.",
        "start": 2240.86,
        "end": 2246.86
    },
    {
        "text": " Es decir, tengo una matriz armítica",
        "start": 2246.86,
        "end": 2251.86
    },
    {
        "text": " cuando la represe cuando represento, tengo la matriz a su operador,",
        "start": 2252.86,
        "end": 2256.86
    },
    {
        "text": " que es armítico cuando represento el operador en una base ortonomal.",
        "start": 2256.86,
        "end": 2260.86
    },
    {
        "text": " Por lo tanto, ¿qué es este operador? Autodad junto.",
        "start": 2260.86,
        "end": 2264.86
    },
    {
        "text": " Por lo tanto, esto me implica que,",
        "start": 2264.86,
        "end": 2268.86
    },
    {
        "text": " te tilde autoadjunto,",
        "start": 2268.86,
        "end": 2272.86
    },
    {
        "text": " pero este es un operador definido en un espacio auditorial sobre el cuerpo complejo.",
        "start": 2272.86,
        "end": 2284.86
    },
    {
        "text": " Entonces yo había arrancado con un T definido sobre un espacio auditorial real,",
        "start": 2284.86,
        "end": 2290.86
    },
    {
        "text": " que era autoadjunto, y me construy un te tilde definido sobre un espacio auditorial complejo,",
        "start": 2290.86,
        "end": 2296.86
    },
    {
        "text": " que es autoadjunto, pero ya vimos el caso que pasa cuando tengo un operador autoadjunto",
        "start": 2296.86,
        "end": 2303.86
    },
    {
        "text": " en un espacio auditorial definido sobre el cuerpo complejo.",
        "start": 2303.86,
        "end": 2307.86
    },
    {
        "text": " ¿Qué pasa ahí? ¿Tú a las reyes características de este?",
        "start": 2307.86,
        "end": 2310.86
    },
    {
        "text": " Esos reales. Entonces,",
        "start": 2310.86,
        "end": 2313.86
    },
    {
        "text": " las reyes características de te tilde por el coloralio,",
        "start": 2313.86,
        "end": 2320.86
    },
    {
        "text": " de este te tilde son reales,",
        "start": 2326.86,
        "end": 2333.86
    },
    {
        "text": " este por el coloralio,",
        "start": 2333.86,
        "end": 2339.86
    },
    {
        "text": " en el cabo de escribiras un ratito coloralio.",
        "start": 2339.86,
        "end": 2343.86
    },
    {
        "text": " O sea, pasa el problema de T en un cuerpo real,",
        "start": 2343.86,
        "end": 2348.86
    },
    {
        "text": " al te tilde,",
        "start": 2348.86,
        "end": 2350.86
    },
    {
        "text": " uno para autoadjunto, son un cuerpo complejo.",
        "start": 2350.86,
        "end": 2353.86
    },
    {
        "text": " Ahí sabemos que, como esta buena dimensión finita,",
        "start": 2353.86,
        "end": 2356.86
    },
    {
        "text": " las reyes características de te tilde son todas reales.",
        "start": 2356.86,
        "end": 2362.86
    },
    {
        "text": " Y además, el polinomio característico asociado a te tilde,",
        "start": 2362.86,
        "end": 2370.86
    },
    {
        "text": " el polinomio característico asociado a te tilde,",
        "start": 2370.86,
        "end": 2374.86
    },
    {
        "text": " fíjense, si yo considero la matriz A,",
        "start": 2374.86,
        "end": 2376.86
    },
    {
        "text": " que las matrias asociadas a te tilde en una base,",
        "start": 2376.86,
        "end": 2378.86
    },
    {
        "text": " es el mismo que el polinomio característico de A,",
        "start": 2378.86,
        "end": 2381.86
    },
    {
        "text": " que me construyó con la matriz A,",
        "start": 2381.86,
        "end": 2382.86
    },
    {
        "text": " o sea, el polinomio característico asociado a te tilde,",
        "start": 2382.86,
        "end": 2385.86
    },
    {
        "text": " es lo mismo que el polinomio característico asociado a la matriz A,",
        "start": 2385.86,
        "end": 2389.86
    },
    {
        "text": " y si voy para arriba,",
        "start": 2389.86,
        "end": 2392.86
    },
    {
        "text": " el polinomio característico asociado a la matriz A,",
        "start": 2392.86,
        "end": 2395.86
    },
    {
        "text": " es igual al polinomio característico asociado a la matriz T,",
        "start": 2395.86,
        "end": 2398.86
    },
    {
        "text": " al operador T.",
        "start": 2398.86,
        "end": 2402.86
    },
    {
        "text": " Bien, entonces, tenemos que las raíces características de este,",
        "start": 2405.86,
        "end": 2411.86
    },
    {
        "text": " son todas reales,",
        "start": 2411.86,
        "end": 2413.86
    },
    {
        "text": " pero el polinomio característico de te tilde coincide con el polinomio característico T,",
        "start": 2413.86,
        "end": 2418.86
    },
    {
        "text": " por lo tanto, las raíces características de T son todas reales.",
        "start": 2418.86,
        "end": 2422.86
    },
    {
        "text": " Entonces, esto implica",
        "start": 2422.86,
        "end": 2427.86
    },
    {
        "text": " la raíces características de T,",
        "start": 2427.86,
        "end": 2432.86
    },
    {
        "text": " son reales,",
        "start": 2433.86,
        "end": 2438.86
    },
    {
        "text": " ¿qué era lo que queríamos probar?",
        "start": 2438.86,
        "end": 2442.86
    },
    {
        "text": " Es una subtil E, pero hay que hacerlo bien.",
        "start": 2442.86,
        "end": 2446.86
    },
    {
        "text": " ¿Se entendió?",
        "start": 2453.86,
        "end": 2455.86
    },
    {
        "text": " Si vamos a el problema a un operador T tilde que es autoadjuntos",
        "start": 2455.86,
        "end": 2458.86
    },
    {
        "text": " o un cuerpo complejo,",
        "start": 2459.86,
        "end": 2461.86
    },
    {
        "text": " y acá vamos a ver ahí que todas las raíces características de un operador",
        "start": 2461.86,
        "end": 2464.86
    },
    {
        "text": " con esas características son reales.",
        "start": 2464.86,
        "end": 2466.86
    },
    {
        "text": " Como el polinomio característico de te tilde y el DT coinciden,",
        "start": 2466.86,
        "end": 2469.86
    },
    {
        "text": " estamos viendo que las raíces características de T son reales,",
        "start": 2469.86,
        "end": 2474.86
    },
    {
        "text": " donde T estaba definido sobre un espacio territorial real.",
        "start": 2474.86,
        "end": 2479.86
    },
    {
        "text": " Conclusión, entonces,",
        "start": 2479.86,
        "end": 2482.86
    },
    {
        "text": " siempre que uno tenga un operador autoadjunto,",
        "start": 2482.86,
        "end": 2486.86
    },
    {
        "text": " en dimensión finita,",
        "start": 2486.86,
        "end": 2489.86
    },
    {
        "text": " el polinomio característico tiene raíces reales,",
        "start": 2489.86,
        "end": 2492.86
    },
    {
        "text": " aún que estemos trabajando en el caso complejo, en el caso real,",
        "start": 2492.86,
        "end": 2496.86
    },
    {
        "text": " y por lo tanto, todos los valores propios siempre son reales,",
        "start": 2496.86,
        "end": 2499.86
    },
    {
        "text": " trabajando en el caso complejo, en el caso real,",
        "start": 2499.86,
        "end": 2501.86
    },
    {
        "text": " y por lo menos siempre existe uno por lo que te oremos fundamental de la otra.",
        "start": 2501.86,
        "end": 2505.86
    },
    {
        "text": " Estamos,",
        "start": 2505.86,
        "end": 2508.86
    },
    {
        "text": " esa agotadora esto,",
        "start": 2508.86,
        "end": 2511.86
    },
    {
        "text": " pasó la parte más pesada de la clase.",
        "start": 2511.86,
        "end": 2514.86
    },
    {
        "text": " ¿Cómo coronario? ¿No qué viene? Ahora es más lindo que vamos a meter un poco de geometría.",
        "start": 2516.86,
        "end": 2520.86
    },
    {
        "text": " ¿Cómo coronario este?",
        "start": 2528.86,
        "end": 2529.86
    },
    {
        "text": " Estos resultados que escribimos para operadores líneas,",
        "start": 2529.86,
        "end": 2531.86
    },
    {
        "text": " obviamente lo podemos llevar a matrices,",
        "start": 2531.86,
        "end": 2534.86
    },
    {
        "text": " y lo escriba eso ahí al final para que quede escrito.",
        "start": 2534.86,
        "end": 2537.86
    },
    {
        "text": " Es este coronario todo esto que hagamos.",
        "start": 2538.86,
        "end": 2542.86
    },
    {
        "text": " Bueno, entonces, el coronario todo esto,",
        "start": 2547.86,
        "end": 2549.86
    },
    {
        "text": " fallamos a matrices.",
        "start": 2549.86,
        "end": 2551.86
    },
    {
        "text": " Si yo tengo matrices,",
        "start": 2551.86,
        "end": 2553.86
    },
    {
        "text": " n por n definidas son los reales.",
        "start": 2554.86,
        "end": 2556.86
    },
    {
        "text": " Entonces, cumple lo siguiente,",
        "start": 2556.86,
        "end": 2558.86
    },
    {
        "text": " si hay simétrica que es el equivalente a operadores autoadjuntos,",
        "start": 2558.86,
        "end": 2561.86
    },
    {
        "text": " en una base ortonormal, si hay simétrica,",
        "start": 2561.86,
        "end": 2564.86
    },
    {
        "text": " sobre todo vamos a volver más adelante.",
        "start": 2568.86,
        "end": 2570.86
    },
    {
        "text": " Si hay simétrica,",
        "start": 2570.86,
        "end": 2572.86
    },
    {
        "text": " todas las reyes del polínimo característico son reales,",
        "start": 2572.86,
        "end": 2575.86
    },
    {
        "text": " el caso de recién adaptado a matrices,",
        "start": 2578.86,
        "end": 2581.86
    },
    {
        "text": " si hay simétricas todas,",
        "start": 2581.86,
        "end": 2583.86
    },
    {
        "text": " si hay simétricas.",
        "start": 2583.86,
        "end": 2585.86
    },
    {
        "text": " The characteristics are reales",
        "start": 2593.86,
        "end": 2596.86
    },
    {
        "text": " esto es cuando estamos trabajando con matrices reales,",
        "start": 2599.86,
        "end": 2603.86
    },
    {
        "text": " y si la matrices tienen entradas complejas,",
        "start": 2603.86,
        "end": 2610.86
    },
    {
        "text": " O sea tengo matrices cuadradas con entradas complejas, entonces ahí tengo que",
        "start": 2610.86,
        "end": 2618.36
    },
    {
        "text": " repasar si métrica por el mística, si una matrices a esermítica o sea igual a",
        "start": 2618.36,
        "end": 2624.02
    },
    {
        "text": " su conjugada transpuesta, lo mismo, entonces todas las raíces del pollo",
        "start": 2624.02,
        "end": 2634.7400000000002
    },
    {
        "text": " y lo mismo característico sorreales, esto casi sigue exactamente igual.",
        "start": 2634.74,
        "end": 2643.74
    },
    {
        "text": " Bien y con eso terminamos entonces esta cuestión de los de los valores propios",
        "start": 2652.14,
        "end": 2658.06
    },
    {
        "text": " de un operado de otro junto, estamos trabajando con dimensiones finitas, vamos a",
        "start": 2658.06,
        "end": 2662.8999999999996
    },
    {
        "text": " ver en el ejemplo que hay en las notas en PDF y un ejemplo de dimensiones infinitas,",
        "start": 2662.9,
        "end": 2669.46
    },
    {
        "text": " que aún cuando el cuerpo sea complejo no necesariamente un operado de",
        "start": 2669.46,
        "end": 2674.14
    },
    {
        "text": " otro junto tiene valores propios, eso lo vamos a ver es ejemplo la clase que",
        "start": 2674.14,
        "end": 2678.7400000000002
    },
    {
        "text": " viene, o sea con dimensiones infinitas siempre que tener ahí algún cuidado, pero",
        "start": 2678.7400000000002,
        "end": 2684.86
    },
    {
        "text": " en dimensiones finitas por lo pronto todas estas cosas, vale. Entonces lo que",
        "start": 2684.86,
        "end": 2690.34
    },
    {
        "text": " vamos a hacer ahora para terminar la clase es ver características geométricas",
        "start": 2690.34,
        "end": 2694.86
    },
    {
        "text": " de los operadores de los subespacios propios de operadores autod juntos y en un",
        "start": 2694.86,
        "end": 2698.92
    },
    {
        "text": " siar si nos queda tiempo el favorísimo teorema espectral para operadores",
        "start": 2698.92,
        "end": 2704.06
    },
    {
        "text": " autodajuntos, bien eso vamos a hacer el resto de la clase. Bien, lo al ejemplo es",
        "start": 2704.06,
        "end": 2711.7200000000003
    },
    {
        "text": " de un operador en una espacio de dimensiones infinitas que es autodajunto y no",
        "start": 2711.7200000000003,
        "end": 2716.26
    },
    {
        "text": " tiene valores propios, eso es un lindo ejemplo. Bueno, ¿qué vamos a hacer?",
        "start": 2716.26,
        "end": 2727.92
    },
    {
        "text": " ¿Qué vamos a ver ahora? Vamos a ver lo siguiente, vamos a concentrarnos en los",
        "start": 2727.92,
        "end": 2731.1200000000003
    },
    {
        "text": " aspectos geométricos los subespacios propios y vamos a ver que si yo tengo acá",
        "start": 2731.1200000000003,
        "end": 2737.46
    },
    {
        "text": " un espacio vectorial B sobre el cual está definido un operador auto adjunto,",
        "start": 2737.46,
        "end": 2742.98
    },
    {
        "text": " que sabemos que tiene al menos un valor propio, porque tiene al menos una",
        "start": 2742.98,
        "end": 2747.22
    },
    {
        "text": " raíz característica que es real, lo que vamos a ver es que si yo tengo más de",
        "start": 2747.22,
        "end": 2754.34
    },
    {
        "text": " un valor propio y considero los subespacios es el anda 1, asociado un valor",
        "start": 2754.34,
        "end": 2759.1
    },
    {
        "text": " propio y es el anda dado asociado a otro valor propio, lo que vamos a ver es",
        "start": 2759.1,
        "end": 2765.22
    },
    {
        "text": " que esto si te auto adjunta, esto su espacios propio es un ortogonal, así que",
        "start": 2765.22,
        "end": 2770.86
    },
    {
        "text": " todo vector acá es ortogonal a todo vector de forma y considero los subespacios",
        "start": 2770.86,
        "end": 2775.42
    },
    {
        "text": " propios de valores propios de itinto. Entonces vamos a ver como proposición que",
        "start": 2775.42,
        "end": 2780.94
    },
    {
        "text": " también es una demostración muy linda y sencilla.",
        "start": 2780.94,
        "end": 2785.1400000000003
    },
    {
        "text": " Entonces ahora vamos a considerar espacios vectoriales con producto interno sobre un cuerpo",
        "start": 2800.86,
        "end": 2823.7400000000002
    },
    {
        "text": " generio, sobre el cuerpo real o complejo, ahora ya no vamos a hacer más de esa",
        "start": 2823.7400000000002,
        "end": 2827.1800000000003
    },
    {
        "text": " distinción. Ve espacio vectorial con producto interno sobre acá.",
        "start": 2827.18,
        "end": 2831.5
    },
    {
        "text": " Este operador auto adjunto.",
        "start": 2831.5,
        "end": 2844.38
    },
    {
        "text": " Vamos trabajando en el contexto de operadores auto adjunto. Me dice la",
        "start": 2844.38,
        "end": 2858.54
    },
    {
        "text": " proposición que si anda 1 y anda 2 son valores propios distintos de t.",
        "start": 2858.54,
        "end": 2865.54
    },
    {
        "text": " Lo que pasa es que si tengo 2 valores propios distintos de t y lo considero la anda",
        "start": 2865.54,
        "end": 2886.54
    },
    {
        "text": " 2. Entonces su espacio propio es ortogonal a su espacio propio es ortogonal.",
        "start": 2886.54,
        "end": 2898.54
    },
    {
        "text": " Y esto quiere decir que cualquier vector que yo agarre en ese anda 1 es ortogonal a cualquier",
        "start": 2898.54,
        "end": 2912.5
    },
    {
        "text": " vector que yo agarre en el silencio de la anda 2. O sea esto lo que vamos a probar.",
        "start": 2912.5,
        "end": 2925.5
    },
    {
        "text": " El producto interno de un vector acá con un vector acá me da cero.",
        "start": 2925.5,
        "end": 2944.5
    },
    {
        "text": " La demostración es bien sencillo. Vamos a considerar un B en este espacio vectorial y un W en ese otro.",
        "start": 2944.5,
        "end": 2951.5
    },
    {
        "text": " Entonces vamos a considerar",
        "start": 2951.5,
        "end": 2959.5
    },
    {
        "text": " que en ese anda 1 y W en ese anda 2. Y vamos a ver que el producto interno de ellos 2 es 0.",
        "start": 2959.5,
        "end": 2971.5
    },
    {
        "text": " Bueno, entonces vamos a usarlo a empezar usando la condición que define que un operador sea auto adjunto usando como vectores",
        "start": 2972.5,
        "end": 2980.5
    },
    {
        "text": " este B y este W. Entonces por ser t auto adjunto, por ser t auto adjunto el producto interno de t en B con W",
        "start": 2980.5,
        "end": 2996.5
    },
    {
        "text": " es lo mismo que el producto interno de B con t en W. Si, rapito por el acima vez.",
        "start": 2997.5,
        "end": 3005.5
    },
    {
        "text": " Por definición de adjunto, el operador de este lado se pasa acá como el t estrella y por ser auto adjunto, ese t estrella es igual a t.",
        "start": 3005.5,
        "end": 3012.5
    },
    {
        "text": " Entonces yo agarre un vector B acá y un vector W acá y se tiene que cumplir que t en B con W es lo mismo que B con t en W.",
        "start": 3012.5,
        "end": 3020.5
    },
    {
        "text": " Esto es lo mismo que el producto interno de los 2. Esto es por ser auto adjunto.",
        "start": 3020.5,
        "end": 3025.5
    },
    {
        "text": " Uso que B es esta acá y quedó la B esta acá.",
        "start": 3026.5,
        "end": 3031.5
    },
    {
        "text": " Bien, esto acá como B es vector, como ve esta en ese lambda 1, t en B es lambda 1 por B.",
        "start": 3031.5,
        "end": 3055.5
    },
    {
        "text": " Lo mismo que el lambda 1 por B con W y el lambda sale para afuera, me queda lambda 1 por B con W.",
        "start": 3056.5,
        "end": 3069.5
    },
    {
        "text": " Y acá vamos a estar aquí hasta en su espacio propio y se ha dado lambda 2.",
        "start": 3069.5,
        "end": 3081.5
    },
    {
        "text": " O sea que T en W es lambda 2 por W. Esto es lo mismo que B lambda 2 por W.",
        "start": 3081.5,
        "end": 3090.5
    },
    {
        "text": " El lambda 2 sale para afuera, pero como complejo con jugado pues está en la segunda entrada.",
        "start": 3091.5,
        "end": 3097.5
    },
    {
        "text": " Y como acabamos de ver que los valores propios de los de un auto adjunto son reales, lambda 2 con jugado me da lo mismo que lambda 2 por ser real.",
        "start": 3101.5,
        "end": 3110.5
    },
    {
        "text": " Esto lo mismo que lambda 2 por B es calorable.",
        "start": 3110.5,
        "end": 3117.5
    },
    {
        "text": " Y esto es porque lambda 2 es real.",
        "start": 3118.5,
        "end": 3124.5
    },
    {
        "text": " Landa 1 también obviamente.",
        "start": 3124.5,
        "end": 3129.5
    },
    {
        "text": " Landa 1 y el lambda 2 está en el aire.",
        "start": 3132.5,
        "end": 3135.5
    },
    {
        "text": " Bien, entonces de un lado me queda lambda 1 por el producto interno de B con W y el otro lado me queda lambda 2 por el producto interno de B con W.",
        "start": 3135.5,
        "end": 3144.5
    },
    {
        "text": " Si paso esto para este lado restando y agrupo las cosas eso me implica que lambda 1 menos lambda 2 por el producto interno de B con W y el otro lado me queda 0.",
        "start": 3144.5,
        "end": 3159.5
    },
    {
        "text": " Estamos ahora, lambda 1 y lambda 2 eran valores propios distintos. Por lo tanto esto acá es distinto de 0.",
        "start": 3159.5,
        "end": 3177.5
    },
    {
        "text": " La conclusión entonces es que esto tiene que ser igual a 0.",
        "start": 3177.5,
        "end": 3182.5
    },
    {
        "text": " Bien, o sea que sacamos que el producto interno de cualquier vector que yo agarre en el subespacio propio es la lambda 1 con cualquier vector que yo agarre en su espacio de suciedad lambda 2, eso me tiene que dar 0.",
        "start": 3183.5,
        "end": 3201.5
    },
    {
        "text": " Por lo tanto este subespacio y este son autobonales.",
        "start": 3201.5,
        "end": 3207.5
    },
    {
        "text": " Esa es una propiedad importante de los autos al junto.",
        "start": 3208.5,
        "end": 3214.5
    },
    {
        "text": " Ya vimos una que los valores propios eran reales, ahora vemos una segunda propiedad que los subespacios propios sociados a valores propios distintos son autobonales.",
        "start": 3214.5,
        "end": 3223.5
    },
    {
        "text": " Este y este son autobonales entre ellos.",
        "start": 3223.5,
        "end": 3226.5
    },
    {
        "text": " Estamos en una demostración bien sencilla.",
        "start": 3226.5,
        "end": 3231.5
    },
    {
        "text": " Ahora sí estamos en condiciones o casi denunciar el famoso teoreo espectral para operar las autobonales juntos.",
        "start": 3238.5,
        "end": 3252.5
    },
    {
        "text": " Que la clase que viene ya le voy a comentar un poco de dónde viene ese nombre teoreo espectral. Es que significa espectro suele llamarse en físico al conjunto de valores propios.",
        "start": 3253.5,
        "end": 3267.5
    },
    {
        "text": " Lo que me hizo el toreo espectral es que uno proveo todo junto, he diagonalizable, es decir existe una base de vectores propios, pero además esa base puede elegirse orto normal.",
        "start": 3267.5,
        "end": 3280.5
    },
    {
        "text": " Es decir, si te auto adjunto existe una base orto normal de vectores propios.",
        "start": 3280.5,
        "end": 3287.5
    },
    {
        "text": " Ya vamos a ver lo que significa eso. En la clase está lo bien anunciar por lo menos, creo que estamos con tiempo.",
        "start": 3287.5,
        "end": 3294.5
    },
    {
        "text": " Sí, todavía tenemos poquito tiempo.",
        "start": 3294.5,
        "end": 3297.5
    },
    {
        "text": " Pero antes de anunciar eso, déjenme probar un resultado menor que vamos a necesitar por la demostración del teoreo y la clase que viene.",
        "start": 3297.5,
        "end": 3307.5
    },
    {
        "text": " Qué es bien sencillo? Un pueblo raro esto, ¿no?",
        "start": 3311.5,
        "end": 3317.5
    },
    {
        "text": " Antes de anunciar el teoreo espectral que probaremos y explicaremos en detalle la clase producida,",
        "start": 3326.5,
        "end": 3332.5
    },
    {
        "text": " vamos a escribir un lema muy muy sencillo que vamos a usar, que me dice lo siguiente.",
        "start": 3333.5,
        "end": 3340.5
    },
    {
        "text": " Como siempre esta cosa que hay que repetir hasta el bobo, amito.",
        "start": 3346.5,
        "end": 3350.5
    },
    {
        "text": " Yo tengo un espacio vectorial.",
        "start": 3350.5,
        "end": 3355.5
    },
    {
        "text": " Es espacio vectorial con producto interno sobre acá.",
        "start": 3355.5,
        "end": 3362.5
    },
    {
        "text": " Yo tengo un suespacio S, un suespacio de B.",
        "start": 3372.5,
        "end": 3378.5
    },
    {
        "text": " Y tengo un operador lineal.",
        "start": 3386.5,
        "end": 3392.5
    },
    {
        "text": " No, ponés directamente en V, en V, auto adjunto. ¿Qué es el caso que me interesa?",
        "start": 3397.5,
        "end": 3403.5
    },
    {
        "text": " Tengo T, auto adjunto.",
        "start": 3403.5,
        "end": 3408.5
    },
    {
        "text": " Entonces lo que se cumple es que si es invariante bajo T,",
        "start": 3408.5,
        "end": 3415.5
    },
    {
        "text": " vamos a escribir así, el lema dice lo siguiente.",
        "start": 3439.5,
        "end": 3444.5
    },
    {
        "text": " Si es invariante bajo T, entonces el complemento ortagonal de S también es invariante bajo T.",
        "start": 3444.5,
        "end": 3453.5
    },
    {
        "text": " Y si acuerdan ustedes que cuando yo tengo un espacio vectorial y un suespacio S,",
        "start": 3468.5,
        "end": 3475.5
    },
    {
        "text": " lo que probamos ya se varias clases atrás es que el complemento ortagonal de esto,",
        "start": 3499.5,
        "end": 3505.5
    },
    {
        "text": " me permite escribir V como suma directa de este, masé.",
        "start": 3505.5,
        "end": 3512.5
    },
    {
        "text": " Lo que vamos a ver es que en el caso de que esté ese auto adjunto, como estamos trabajando,",
        "start": 3512.5,
        "end": 3517.5
    },
    {
        "text": " si yo 7 es un suespacio invariante bajo T, ¿qué quiere decir que sea invariante?",
        "start": 3517.5,
        "end": 3522.5
    },
    {
        "text": " En otras palabras, si le aplico T a cualquier vector acá, quedo en ese conjunto.",
        "start": 3523.5,
        "end": 3529.5
    },
    {
        "text": " Si esto es invariante bajo la acción de T, entonces también se cumple que el complemento ortagonal",
        "start": 3529.5,
        "end": 3534.5
    },
    {
        "text": " es invariante bajo la acción de T. Eso lo vas a usar en la prueba del teorema spectral que llevo en un Seattle.",
        "start": 3534.5,
        "end": 3538.5
    },
    {
        "text": " O sea se cumple que si acade dentro yo le aplico T y quedo acade dentro,",
        "start": 3538.5,
        "end": 3543.5
    },
    {
        "text": " entonces cualquier cosa que yo le aplico acade dentro, si le aplico T quedo ahí.",
        "start": 3543.5,
        "end": 3547.5
    },
    {
        "text": " Bien, la demostración es también una línea.",
        "start": 3548.5,
        "end": 3552.5
    },
    {
        "text": " Lo que queremos ver, entonces que yo agarro cualquier vector acá, que le vamos a llamar W,",
        "start": 3561.5,
        "end": 3567.5
    },
    {
        "text": " lo que queremos ver es que cualquier W acá si le aplico T sigo quedando ahí.",
        "start": 3567.5,
        "end": 3572.5
    },
    {
        "text": " Entonces vamos a tomar un W acá dentro, le vamos a aplicar T y vamos a ver que si están hoy ahora.",
        "start": 3573.5,
        "end": 3578.5
    },
    {
        "text": " Entonces, vamos a considerar",
        "start": 3579.5,
        "end": 3584.5
    },
    {
        "text": " un vector cualquiera en ese y un vector cualquiera en ese ortagonal.",
        "start": 3593.5,
        "end": 3600.5
    },
    {
        "text": " Voy a tomar acá un vector, entonces V que está en ese y un vector W que está en ese ortagonal.",
        "start": 3603.5,
        "end": 3614.5
    },
    {
        "text": " Ahora, como es ese invariante bajo la acción de T, sabemos que por hipótesis",
        "start": 3614.5,
        "end": 3622.5
    },
    {
        "text": " que está en ese ortagonal,",
        "start": 3623.5,
        "end": 3626.5
    },
    {
        "text": " este aplicado AB está en ese, porque ese invariante bajo la acción de T,",
        "start": 3629.5,
        "end": 3634.5
    },
    {
        "text": " si le aplico T a cualquier vector que está en ese sigo estando en ese.",
        "start": 3634.5,
        "end": 3639.5
    },
    {
        "text": " Y entonces ahora se cumple lo siguiente.",
        "start": 3643.5,
        "end": 3646.5
    },
    {
        "text": " ¿Cuánto me da el producto interno de TDB con WB?",
        "start": 3652.5,
        "end": 3661.5
    },
    {
        "text": " Este TDB, como dijimos, esto está en ese y el otro está en ese ortagonal.",
        "start": 3661.5,
        "end": 3669.5
    },
    {
        "text": " Por lo tanto, este producto interno tiene que dar cero.",
        "start": 3669.5,
        "end": 3673.5
    },
    {
        "text": " Este producto interno es cero.",
        "start": 3674.5,
        "end": 3677.5
    },
    {
        "text": " Y ahora uso la propiedad que me define a un auto adjunto.",
        "start": 3679.5,
        "end": 3683.5
    },
    {
        "text": " La propiedad que me define a un auto adjunto es que este T lo puede pasar a este lado y me da lo mismo.",
        "start": 3683.5,
        "end": 3696.5
    },
    {
        "text": " Pues aquí esto lo mismo que V por TNW.",
        "start": 3697.5,
        "end": 3702.5
    },
    {
        "text": " Y esto es porque este es auto adjunto.",
        "start": 3705.5,
        "end": 3708.5
    },
    {
        "text": " Entonces, fíjense lo que estamos diciendo.",
        "start": 3713.5,
        "end": 3716.5
    },
    {
        "text": " Estamos diciendo este V está en el espacio S.",
        "start": 3716.5,
        "end": 3722.5
    },
    {
        "text": " Estamos diciendo que TNW es ortagonal AB para cualquier V que yo tomen ese.",
        "start": 3723.5,
        "end": 3729.5
    },
    {
        "text": " Estamos diciendo que esté aplicado a esto, esto es una de las cualquier vector que yo tomen ese.",
        "start": 3731.5,
        "end": 3736.5
    },
    {
        "text": " O sea lo que estamos diciendo como el V es arbitrario, estamos diciendo que TNW es ortagonal AB para todo V que yo tomen ese.",
        "start": 3736.5,
        "end": 3750.5
    },
    {
        "text": " Entonces, donde tiene que estar TNW?",
        "start": 3751.5,
        "end": 3753.5
    },
    {
        "text": " Por definición, si es ortagonal a todos los elementos que están en ese, es un elemento de ese ortagonal.",
        "start": 3753.5,
        "end": 3762.5
    },
    {
        "text": " Entonces, esto me implica que por lo tanto TNW esté en ese ortagonal.",
        "start": 3762.5,
        "end": 3777.5
    },
    {
        "text": " O sea que estamos probando que si W está en ese ortagonal TNW está en ese ortagonal.",
        "start": 3778.5,
        "end": 3784.5
    },
    {
        "text": " Entonces, estamos probando que ese ortagonal es invariante bajo la acción del TNW.",
        "start": 3784.5,
        "end": 3791.5
    },
    {
        "text": " Sí, siempre estas en las motociones son lindas y son muy sencillas.",
        "start": 3796.5,
        "end": 3800.5
    },
    {
        "text": " Es escribir la condición de auto adjunto y trabajar la vida.",
        "start": 3800.5,
        "end": 3805.5
    },
    {
        "text": " Se entendió, ¿no?",
        "start": 3806.5,
        "end": 3807.5
    },
    {
        "text": " Bueno, la vamos a la clase que viene, ahora les voy a enunciar sin prueba y con eso terminamos la clase.",
        "start": 3813.5,
        "end": 3820.5
    },
    {
        "text": " El famoso teorema espectral para operadores auto adjunto, la clase que viene a tratar de explicar un poquito de quiere decir al nombre teorema espectral y veremos la demostración.",
        "start": 3821.5,
        "end": 3836.5
    },
    {
        "text": " ¿Qué dice el teorema espectral para operadores auto adjunto?",
        "start": 3838.5,
        "end": 3841.5
    },
    {
        "text": " Ya va a haber que linda interpretación que tiene todo esto.",
        "start": 3842.5,
        "end": 3846.5
    },
    {
        "text": " La dejó picando por la clase que viene pero vamos a escribir por lo menos el teorema.",
        "start": 3846.5,
        "end": 3853.5
    },
    {
        "text": " Lo mismo es siempre, estaré en contra de una sigla para todo esto.",
        "start": 3871.5,
        "end": 3878.5
    },
    {
        "text": " Entonces, las hipótesis son las siguientes por el teorema espectral. Es que yo tengo un espacio auditorial con producintón o sobrecá.",
        "start": 3932.5,
        "end": 3953.5
    },
    {
        "text": " Ahora cap puede ser los regalos o los complejos, tanto daña, la distinción no es necesaria.",
        "start": 3953.5,
        "end": 3959.5
    },
    {
        "text": " Y si presiamos que el espacio este tenga dimensión finita porque vamos a trabajar justo, es una afirmación sobre base de este espacio auditorial.",
        "start": 3960.5,
        "end": 3968.5
    },
    {
        "text": " Yo tengo un operador auto adjunto y el teorema espectral me dice lo siguiente.",
        "start": 3970.5,
        "end": 3973.5
    },
    {
        "text": " Y si no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no",
        "start": 3989.5,
        "end": 3990.5
    },
    {
        "text": " ok.",
        "start": 4019.5,
        "end": 4021.5
    },
    {
        "text": " Entonces ¿qué me hice el terreno espectral? me dice que los bemos de losrze, que estamos viendo.",
        "start": 4028.62,
        "end": 4034.84
    },
    {
        "text": " Lo espació a Victoria en el componente de la sauce que vamos a ver,米 de definito.",
        "start": 4034.84,
        "end": 4039.08
    },
    {
        "text": " Y te operaba antes, tr Alien Means.",
        "start": 4039.08,
        "end": 4042.0
    },
    {
        "text": " Me dice que existe una base orto normal baby formdrums por grind.",
        "start": 4042.0,
        "end": 4046.68
    },
    {
        "text": " entre una cosa que quiere decir, primero que tedia gonalizable, si es autoarjunto,",
        "start": 4046.68,
        "end": 4051.58
    },
    {
        "text": " e diagonalizable, porque tengo una base de la ectores propios y además por esta",
        "start": 4051.58,
        "end": 4056.7599999999998
    },
    {
        "text": " condición que vimos de los subespacios propios que son ortogonales y tienen",
        "start": 4056.7599999999998,
        "end": 4060.72
    },
    {
        "text": " corresponde a diferentes valores propios, esa base de ectores propios se",
        "start": 4060.72,
        "end": 4064.64
    },
    {
        "text": " puede elegir de manera que sea una base ortogonal. Y la demostración de eso va",
        "start": 4064.64,
        "end": 4070.2
    },
    {
        "text": " a ser una demostración, no vamos a usar inducción sobre esto, sobre la",
        "start": 4070.2,
        "end": 4073.44
    },
    {
        "text": " dimensión del espacio de la espacial. La clase que viene, vamos a ver esta",
        "start": 4073.44,
        "end": 4078.12
    },
    {
        "text": " demostración y vamos a sacar algunos resultados que se predonde ellas, en particular",
        "start": 4078.12,
        "end": 4082.86
    },
    {
        "text": " voy a dar algo que no está en las notas ahí en PDF, pero que es una",
        "start": 4082.86,
        "end": 4089.96
    },
    {
        "text": " es una salación importante, porque es el nombre de este teorema espectras.",
        "start": 4090.2400000000002,
        "end": 4095.52
    },
    {
        "text": " Bueno, preguntas, paramos acá.",
        "start": 4095.52,
        "end": 4102.04
    }
]