[
    {
        "text": " Bueno, buenas tardes.",
        "start": 0.0,
        "end": 3.0
    },
    {
        "text": " Vamos a comenzar esta segunda parte de los teóricos, pero es muy cortita.",
        "start": 3.0,
        "end": 9.0
    },
    {
        "text": " O sea, son cuatro clases, básicamente.",
        "start": 9.0,
        "end": 12.0
    },
    {
        "text": " Están quedando así que pongan así.",
        "start": 12.0,
        "end": 14.0
    },
    {
        "text": " 4 o 5 clases de teórico después quedan 2 más de prácticos.",
        "start": 14.0,
        "end": 18.0
    },
    {
        "text": " Pasezamos adelantar un poquito a algunos temas que no son tan largos",
        "start": 18.0,
        "end": 21.0
    },
    {
        "text": " para que los puedan tener más tiempo para hacer el laboratorio y nos te encorriéndola.",
        "start": 21.0,
        "end": 25.0
    },
    {
        "text": " Estas segunda partes es más corta.",
        "start": 26.0,
        "end": 29.0
    },
    {
        "text": " No vamos a focalizar hoy, digamos, ya en variantes de lo que hemos estudiado hasta ahora,",
        "start": 29.0,
        "end": 36.0
    },
    {
        "text": " que son estructuras de lineales, tipo listas.",
        "start": 36.0,
        "end": 39.0
    },
    {
        "text": " Llistas pilascolas son distintas variantes de estructuras que tienen distintas políticas de ingreso,",
        "start": 39.0,
        "end": 46.0
    },
    {
        "text": " de grisos, de elementos, pero basada es una noción de secuencia.",
        "start": 46.0,
        "end": 49.0
    },
    {
        "text": " Se ha caído, vamos a empezar a hablar de colecciones.",
        "start": 50.0,
        "end": 52.0
    },
    {
        "text": " Está bien.",
        "start": 52.0,
        "end": 53.0
    },
    {
        "text": " Y una colección, digamos, muy utilizada de la noción de conjunto.",
        "start": 53.0,
        "end": 57.0
    },
    {
        "text": " Está bien.",
        "start": 57.0,
        "end": 58.0
    },
    {
        "text": " Y de hecho, vamos a asociar nois, pero si ya la clase que viene,",
        "start": 58.0,
        "end": 62.0
    },
    {
        "text": " la noción de conjunto con la noción de base de datos.",
        "start": 62.0,
        "end": 65.0
    },
    {
        "text": " Entonces ahí yo no le empieza a ver un contexto un poquito más interesante.",
        "start": 65.0,
        "end": 69.0
    },
    {
        "text": " Por más que ya los conjuntos lo puede ver con una base de datos,",
        "start": 69.0,
        "end": 72.0
    },
    {
        "text": " vamos a ver una variante la semana que viene, que es más lo que nos llamaría una base de datos.",
        "start": 72.0,
        "end": 77.0
    },
    {
        "text": " En memoria, pero después si la persisto y alguna clase o alguna pequeña chala,",
        "start": 78.0,
        "end": 82.0
    },
    {
        "text": " les voy a dar de cómo persistir esa cosa en disco,",
        "start": 82.0,
        "end": 85.0
    },
    {
        "text": " uno ya tiene una implementación de una base de datos,",
        "start": 85.0,
        "end": 88.0
    },
    {
        "text": " usando de árboles balanceados y lo que vamos a ver hoy que se maja allí.",
        "start": 88.0,
        "end": 91.0
    },
    {
        "text": " Entonces vamos a empezar a ver conjuntos y vamos a continuar la semana que viene con variantes de estos.",
        "start": 93.0,
        "end": 99.0
    },
    {
        "text": " Y hoy también nos vamos a centrar y la clase que viene en dos estructuras nuevas.",
        "start": 99.0,
        "end": 104.0
    },
    {
        "text": " Vamos a estudiar tres, básicamente tres cuatro estructuras de acá,",
        "start": 105.0,
        "end": 108.0
    },
    {
        "text": " al final y curso nueva, además de tipos de estructuras.",
        "start": 108.0,
        "end": 111.0
    },
    {
        "text": " De estructuras más la delistas de árboles y hoy vamos a centrarnos particularmente",
        "start": 111.0,
        "end": 116.0
    },
    {
        "text": " en dos una muy simple, se llama Railovitz y otra que se llama Hashin.",
        "start": 116.0,
        "end": 120.0
    },
    {
        "text": " No sé si han escuchado Hashin, se usa mucho,",
        "start": 120.0,
        "end": 123.0
    },
    {
        "text": " también no solo para base de datos, sino también en aplicaciones de seguridad,",
        "start": 123.0,
        "end": 126.0
    },
    {
        "text": " por ejemplo, ¿no? De hecho muchas veces no sé si le han dicho en medellía,",
        "start": 126.0,
        "end": 130.0
    },
    {
        "text": " guardense el numerito, que es un número de Hashin, no sé qué, de inscripción,",
        "start": 130.0,
        "end": 134.0
    },
    {
        "text": " a ese tipo de cosas.",
        "start": 134.0,
        "end": 136.0
    },
    {
        "text": " Los árboles balanceados de solta estructura, pero vamos a ver la semana que viene.",
        "start": 136.0,
        "end": 139.0
    },
    {
        "text": " Entonces sin más introducción, vamos a ver qué son los conjuntos.",
        "start": 139.0,
        "end": 145.0
    },
    {
        "text": " Y en uno lo que quiere capturar acá como tipo de estar de datos,",
        "start": 145.0,
        "end": 149.0
    },
    {
        "text": " es algo similar, lo que uno llama los conjuntos de la matemática,",
        "start": 149.0,
        "end": 152.0
    },
    {
        "text": " o sea, colecciones de datos.",
        "start": 152.0,
        "end": 154.0
    },
    {
        "text": " Entonces la primera pregunta sería, ¿creen diferenciéndote en conjunto y una lista?",
        "start": 154.0,
        "end": 157.0
    },
    {
        "text": " A priori, ¿qué les parece? ¿No?",
        "start": 158.0,
        "end": 160.0
    },
    {
        "text": " ¿Cómo colección de datos? ¿Qué les parece en qué se va a distinguir?",
        "start": 160.0,
        "end": 164.0
    },
    {
        "text": " Bien, las listas tienen orden posicional de elemento.",
        "start": 166.0,
        "end": 171.0
    },
    {
        "text": " No, tiene sentido una lista de decirle, ¿le está primero, está segundo?",
        "start": 171.0,
        "end": 174.0
    },
    {
        "text": " Por eso habla muchas veces insertar la opción N de la lista.",
        "start": 174.0,
        "end": 177.0
    },
    {
        "text": " Tiene sentido porque es un orden posicional.",
        "start": 177.0,
        "end": 179.0
    },
    {
        "text": " En los conjuntos no, es como tuviera una bolsa mezclada.",
        "start": 179.0,
        "end": 182.0
    },
    {
        "text": " También no hay orden posicional.",
        "start": 182.0,
        "end": 184.0
    },
    {
        "text": " Ese es una diferencia y hay otra más importante.",
        "start": 185.0,
        "end": 187.0
    },
    {
        "text": " ¿El tipo de datos?",
        "start": 187.0,
        "end": 189.0
    },
    {
        "text": " El tipo de datos no puede ser cualquier cosa.",
        "start": 189.0,
        "end": 191.0
    },
    {
        "text": " Tanto en lista como en conjunto no diría...",
        "start": 191.0,
        "end": 193.0
    },
    {
        "text": " ¿No se repide en qué? ¿Qué no se repide?",
        "start": 193.0,
        "end": 195.0
    },
    {
        "text": " La lista uno puede tener secuencias con elementos repetidos",
        "start": 195.0,
        "end": 199.0
    },
    {
        "text": " y los conjuntos de las colecciones en principio no, como una variante que sí.",
        "start": 199.0,
        "end": 204.0
    },
    {
        "text": " Entonces para ver esta diferencia,",
        "start": 204.0,
        "end": 208.0
    },
    {
        "text": " y fíjense que la notación de conjunto a veces usamos la matemática,",
        "start": 208.0,
        "end": 212.0
    },
    {
        "text": " como la llavecitas, para referirnos en más que los coches de las listas.",
        "start": 212.0,
        "end": 217.0
    },
    {
        "text": " Las listas, si las comparo con los sets acá como les conjuntos,",
        "start": 217.0,
        "end": 221.0
    },
    {
        "text": " son esas dos principales diferencias.",
        "start": 221.0,
        "end": 223.0
    },
    {
        "text": " En la lista y orden posicional, en los conjuntos no,",
        "start": 223.0,
        "end": 226.0
    },
    {
        "text": " en la lista puede haber repetido, se los conjuntos no.",
        "start": 226.0,
        "end": 229.0
    },
    {
        "text": " Y en el medio parece un híbrido que lo vamos a dejar para la semana que viene",
        "start": 229.0,
        "end": 233.0
    },
    {
        "text": " que son los múlti conjuntos o múlti sets.",
        "start": 233.0,
        "end": 236.0
    },
    {
        "text": " Tienen una de cada una de esas dos diferencias.",
        "start": 236.0,
        "end": 239.0
    },
    {
        "text": " Entonces al igual que las listas, los múlti set pueden tener repetidos.",
        "start": 240.0,
        "end": 244.0
    },
    {
        "text": " Pero al igual que los conjuntos no tienen orden posicional.",
        "start": 244.0,
        "end": 248.0
    },
    {
        "text": " Es como si fuera una bolsita mezclada, pero donde puede haber repetidos.",
        "start": 248.0,
        "end": 252.0
    },
    {
        "text": " Un ejemplo podría ser un stock de productos.",
        "start": 252.0,
        "end": 255.0
    },
    {
        "text": " Yo digo, mira, tengo el stock de Yerba, hoy en día hasta de moda la guaminerad,",
        "start": 255.0,
        "end": 260.0
    },
    {
        "text": " pero el stock me dice que es casi cero, digamos menos uno.",
        "start": 260.0,
        "end": 264.0
    },
    {
        "text": " Entonces puedo tener repetido los productos ciertas cantidad de veces.",
        "start": 264.0,
        "end": 268.0
    },
    {
        "text": " No puede decir, tengo una colección de productos en mi almacén",
        "start": 268.0,
        "end": 271.0
    },
    {
        "text": " y tengo cantidades que son las repeticiones de ese elemento.",
        "start": 271.0,
        "end": 274.0
    },
    {
        "text": " Pero eso lo vamos a dejar para la semana que viene, esa y otra variante.",
        "start": 274.0,
        "end": 278.0
    },
    {
        "text": " Hoy nos vamos a entrar más en los sets, los que no tienen repetidos.",
        "start": 278.0,
        "end": 282.0
    },
    {
        "text": " ¿Qué operaciones pueden tener los sets cuando uno piensa en el tipo de astronauta?",
        "start": 284.0,
        "end": 287.0
    },
    {
        "text": " Bueno, igual que todos los tipos de astronauta,",
        "start": 287.0,
        "end": 289.0
    },
    {
        "text": " los recuerdo porque capaz de que con el parate de los parciales nos olvidamos",
        "start": 289.0,
        "end": 293.0
    },
    {
        "text": " y ver ciertas categorías operaciones que uno quisiera que todos los tipos de astronauta",
        "start": 293.0,
        "end": 297.0
    },
    {
        "text": " de datos quimbente o que cree o variantes los tengan.",
        "start": 297.0,
        "end": 300.0
    },
    {
        "text": " Que se llama las constructoras, operaciones que me permitan generar",
        "start": 300.0,
        "end": 304.0
    },
    {
        "text": " todos los elementos de esa cosa nueva que yo quiero crear en este caso de los conjuntos.",
        "start": 304.0,
        "end": 308.0
    },
    {
        "text": " Después venían las selectoras que es al revés que las constructoras para sacar información.",
        "start": 308.0,
        "end": 313.0
    },
    {
        "text": " En esos conjuntos, selectoras y a veces lo llaman también destructoras",
        "start": 313.0,
        "end": 317.0
    },
    {
        "text": " porque si borran elementos a veces los libros la consideran como selectora de estructura",
        "start": 317.0,
        "end": 321.0
    },
    {
        "text": " como una categoría única. Y después están los predicados.",
        "start": 321.0,
        "end": 325.0
    },
    {
        "text": " Porque muchas veces no puedo seleccionar, por ejemplo, si no hay elementos,",
        "start": 326.0,
        "end": 330.0
    },
    {
        "text": " dame el top de la pila. Si la pila es vacía no puedo,",
        "start": 330.0,
        "end": 332.0
    },
    {
        "text": " entonces pone precondiciones para chequear las precondiciones,",
        "start": 332.0,
        "end": 336.0
    },
    {
        "text": " uno pone predicados.",
        "start": 336.0,
        "end": 338.0
    },
    {
        "text": " Entonces, este debería tener esas categorías de operaciones.",
        "start": 338.0,
        "end": 342.0
    },
    {
        "text": " Pero además, y fíjense que se usan a veces símbolos similares a la matemática",
        "start": 342.0,
        "end": 347.0
    },
    {
        "text": " para conjuntos como el pertenece, el conjunto vacío,",
        "start": 347.0,
        "end": 351.0
    },
    {
        "text": " uno también es muy habitual considerar en los conjuntos operaciones binarias entre dos conjuntos.",
        "start": 351.0,
        "end": 358.0
    },
    {
        "text": " Por ejemplo, la unión, la intersección, la diferencia de conjuntos.",
        "start": 358.0,
        "end": 362.0
    },
    {
        "text": " ¿Y por qué? Porque es muy habitual pensar que un conjunto ya lo voy asimilando",
        "start": 365.0,
        "end": 369.0
    },
    {
        "text": " como una colección de datos, donde los datos no se repiten.",
        "start": 369.0,
        "end": 372.0
    },
    {
        "text": " Entonces, ahí empieza como la noción de base datos.",
        "start": 372.0,
        "end": 374.0
    },
    {
        "text": " Cada estudiante en la base de la todelia es único por su número de estudiantes.",
        "start": 374.0,
        "end": 379.0
    },
    {
        "text": " Entonces, yo a veces quiero hacer la unión de dos conjuntos,",
        "start": 380.0,
        "end": 383.0
    },
    {
        "text": " el conjunto de los que hacen lógica y el conjunto de los que hacen programación 2",
        "start": 383.0,
        "end": 386.0
    },
    {
        "text": " para hacer una consulta, también, o la intersección,",
        "start": 386.0,
        "end": 389.0
    },
    {
        "text": " los que están en común, los que están haciendo ambas cursos a la vez,",
        "start": 389.0,
        "end": 392.0
    },
    {
        "text": " o la diferencia de los que están haciendo este curso,",
        "start": 392.0,
        "end": 394.0
    },
    {
        "text": " pero no están haciendo este otro.",
        "start": 394.0,
        "end": 396.0
    },
    {
        "text": " Entonces, aparecen operaciones binarias que suelen ser las que a veces",
        "start": 396.0,
        "end": 399.0
    },
    {
        "text": " yo tiro nombres por un un curso de base datos,",
        "start": 399.0,
        "end": 402.0
    },
    {
        "text": " pero en lo que uno se les llamaba las consultas o las queries que uno hace las base datos.",
        "start": 402.0,
        "end": 407.0
    },
    {
        "text": " Muchos son los operadores, son binarios.",
        "start": 407.0,
        "end": 409.0
    },
    {
        "text": " Hay otros, pero estos son algunos de los más simples o comunes.",
        "start": 409.0,
        "end": 413.0
    },
    {
        "text": " Entonces, lo vamos a incluir en el práctico de las implementaciones",
        "start": 413.0,
        "end": 416.0
    },
    {
        "text": " para dar la eficiencia como hacer estas cosas esficiente,",
        "start": 416.0,
        "end": 418.0
    },
    {
        "text": " porque uno después quiere trabajar con colecciones.",
        "start": 418.0,
        "end": 421.0
    },
    {
        "text": " Entonces, acá les pongo con una especificación en lenguaje natural,",
        "start": 421.0,
        "end": 427.0
    },
    {
        "text": " pero traducida en el mismo formato que la lista, la pira en la cola,",
        "start": 427.0,
        "end": 430.0
    },
    {
        "text": " va a aparecer en un punto H, de lo que podría ser como un conjunto minimalista.",
        "start": 430.0,
        "end": 434.0
    },
    {
        "text": " Y sobre todo, minimalistas y sacó lo azul de abajo.",
        "start": 435.0,
        "end": 438.0
    },
    {
        "text": " Entonces, una diría, las dos primeras que categoría operaciones serían para ustedes.",
        "start": 438.0,
        "end": 445.0
    },
    {
        "text": " Constructoras.",
        "start": 445.0,
        "end": 448.0
    },
    {
        "text": " Las dos del medio parecen predicados y el borrar claramente",
        "start": 448.0,
        "end": 456.0
    },
    {
        "text": " y el destruir serían selectoras de estructuras.",
        "start": 456.0,
        "end": 459.0
    },
    {
        "text": " Fíjense que no hay una operación que me retombe un elemento.",
        "start": 460.0,
        "end": 464.0
    },
    {
        "text": " Capa que uno pensaría que el borrar, pero si el borrar ya el elemento es un parámetro",
        "start": 464.0,
        "end": 467.0
    },
    {
        "text": " para que me lo retornara. Entonces, en un sentido.",
        "start": 467.0,
        "end": 471.0
    },
    {
        "text": " Es raro, porque en la pira la lista de la cola hay operaciones que dan el elemento.",
        "start": 471.0,
        "end": 476.0
    },
    {
        "text": " De que esta es la oposición N, el último que ingresó,",
        "start": 476.0,
        "end": 478.0
    },
    {
        "text": " el primero que ingresó, dependiendo de la pira, y acá no hay.",
        "start": 478.0,
        "end": 481.0
    },
    {
        "text": " Les parece raro eso.",
        "start": 481.0,
        "end": 484.0
    },
    {
        "text": " No hay orden posicional, justamente.",
        "start": 484.0,
        "end": 486.0
    },
    {
        "text": " No puedo hablar de él que llegó primero, el que está primero, que está.",
        "start": 487.0,
        "end": 490.0
    },
    {
        "text": " No hay una orden posicional.",
        "start": 490.0,
        "end": 492.0
    },
    {
        "text": " Podría hablar y a veces uno piensa que una variante dame un elemento arbitrario,",
        "start": 492.0,
        "end": 496.0
    },
    {
        "text": " como cualquiera.",
        "start": 496.0,
        "end": 498.0
    },
    {
        "text": " Arvitorio no es lo mismo que el atorio.",
        "start": 498.0,
        "end": 500.0
    },
    {
        "text": " Arvitorio es, la especialidad se dice, retornamos en elementos y no es vacía, no importa cuál.",
        "start": 500.0,
        "end": 504.0
    },
    {
        "text": " Entonces, el implementador puede elegir el que quiera, de acuerdo a la eficiencia",
        "start": 504.0,
        "end": 508.0
    },
    {
        "text": " y el que va a usar la aplicación de esto no sabe que elemento le va a venir,",
        "start": 508.0,
        "end": 511.0
    },
    {
        "text": " pero algún elemento le va a venir.",
        "start": 511.0,
        "end": 513.0
    },
    {
        "text": " Pero no es muy común, por eso no la puse.",
        "start": 513.0,
        "end": 515.0
    },
    {
        "text": " Pero en algún ejercicio, en algún parcia, a lo largo aparece como una aplicación agregada,",
        "start": 515.0,
        "end": 519.0
    },
    {
        "text": " dame en elemento cualquiera.",
        "start": 519.0,
        "end": 521.0
    },
    {
        "text": " Pero no puedo hablar de una orden porque si no estoy rompiendo la idea de conjunto,",
        "start": 521.0,
        "end": 524.0
    },
    {
        "text": " donde no hay una orden.",
        "start": 524.0,
        "end": 526.0
    },
    {
        "text": " De esta que la roja, el insertar como constructora.",
        "start": 526.0,
        "end": 531.0
    },
    {
        "text": " También porque yo dije que había dos diferencias entre conjuntos y listas.",
        "start": 531.0,
        "end": 535.0
    },
    {
        "text": " Hay unas que es bastante clara ahí en el texto del rojo, cuelga diferencia, cuáles.",
        "start": 535.0,
        "end": 540.0
    },
    {
        "text": " ¿Qué no tiene que estar?",
        "start": 541.0,
        "end": 543.0
    },
    {
        "text": " La repetición es bastante de spílle, voy a decir lo agrega si no estaba.",
        "start": 543.0,
        "end": 546.0
    },
    {
        "text": " Entonces ya no va a agregar repetido.",
        "start": 546.0,
        "end": 548.0
    },
    {
        "text": " Y la otra, la otra cual era la diferencia.",
        "start": 548.0,
        "end": 552.0
    },
    {
        "text": " ¿Y cómo digo que no he ido de imposicional?",
        "start": 552.0,
        "end": 555.0
    },
    {
        "text": " ¿No le he ido de imposición?",
        "start": 555.0,
        "end": 557.0
    },
    {
        "text": " Exacto.",
        "start": 557.0,
        "end": 559.0
    },
    {
        "text": " Ella dice, no le digo dónde insertar.",
        "start": 559.0,
        "end": 562.0
    },
    {
        "text": " ¿Cómo uno, digamos de alguna manera, en una especificación, dice que no hay restricción para algo,",
        "start": 562.0,
        "end": 567.0
    },
    {
        "text": " que no hay orden, o sea que no no puede asumir algo, no puede ninguna condición.",
        "start": 567.0,
        "end": 571.0
    },
    {
        "text": " ¿Qué dice esto? Agrega el elemento. ¿Dónde no sé?",
        "start": 571.0,
        "end": 574.0
    },
    {
        "text": " Entonces el que va a usar la aplicación cuando después agrega esa orden no puede asumir",
        "start": 574.0,
        "end": 578.0
    },
    {
        "text": " que va a estar primero, según lo tercer.",
        "start": 578.0,
        "end": 580.0
    },
    {
        "text": " El que le va a implementar a su vez tiene la libertad ahora, porque dice, ¿lo tengo que agregar?",
        "start": 580.0,
        "end": 584.0
    },
    {
        "text": " Yo he dicho donde lo agrego.",
        "start": 584.0,
        "end": 586.0
    },
    {
        "text": " Entonces voy a poder hacer cosas más eficientes acá que enlista.",
        "start": 586.0,
        "end": 589.0
    },
    {
        "text": " Quizás.",
        "start": 590.0,
        "end": 591.0
    },
    {
        "text": " ¿También?",
        "start": 592.0,
        "end": 593.0
    },
    {
        "text": " Pero porque no tengo esa restricción de decir dónde lo agrego.",
        "start": 593.0,
        "end": 596.0
    },
    {
        "text": " Entonces una de las dos diferencias es explícita la repetición, porque me lo dice ahí,",
        "start": 596.0,
        "end": 600.0
    },
    {
        "text": " y la otra es implícita, no decir dónde lo agrega, quiere decir que no podemos asumir nada de dónde lo agrega.",
        "start": 600.0,
        "end": 607.0
    },
    {
        "text": " Entonces no hay un orden, sí.",
        "start": 607.0,
        "end": 609.0
    },
    {
        "text": " Eso sería si pensamos implementaciones, sí.",
        "start": 611.0,
        "end": 613.0
    },
    {
        "text": " De hecho, el arrovinario ebuque va a ser una implementación posible de esto.",
        "start": 613.0,
        "end": 617.0
    },
    {
        "text": " Sí.",
        "start": 621.0,
        "end": 622.0
    },
    {
        "text": " El arrovinario ebuque va a ser una posible implementación, pero no es la única.",
        "start": 622.0,
        "end": 625.0
    },
    {
        "text": " De hecho, no va a ser, quizás siempre la mejor.",
        "start": 625.0,
        "end": 628.0
    },
    {
        "text": " Pero sí va a ser adecuada y ya si quieren me voy adelantando la pregunta, ¿por qué te parece que una reivunaria ebuquea puede ser una implementación adecuada esto?",
        "start": 628.0,
        "end": 637.0
    },
    {
        "text": " ¿Por qué?",
        "start": 637.0,
        "end": 639.0
    },
    {
        "text": " ¿Por qué no se repiten y la reivunaria ebuquea no se repetían los elementos? Bien.",
        "start": 641.0,
        "end": 645.0
    },
    {
        "text": " No le decís pregi un orden implícito que te lo determina, ¿no?",
        "start": 648.0,
        "end": 652.0
    },
    {
        "text": " La otra razón puede ser porque uno supone que no en el peor caso, pero en el caso de promedio es mejor que las listas para insertar buscar y borrar.",
        "start": 652.0,
        "end": 661.0
    },
    {
        "text": " Pero lo más pendiente por ahora la implementación, pero vamos a tratar de separar siempre en los tal que nos queden tipo de datos lo que es la especificación, o sea, el comportamiento de las posibles implementaciones.",
        "start": 661.0,
        "end": 672.0
    },
    {
        "text": " Porque uno va a ser aplicaciones después, lo que quiere es va a interactuar yo un diseño de aplicaciones con este módulo sin saber cómo está implementado.",
        "start": 673.0,
        "end": 681.0
    },
    {
        "text": " De hecho, yo capa que lo implemento este módulo con ABB.",
        "start": 681.0,
        "end": 684.0
    },
    {
        "text": " Pero después veo que es muy lento y ahora que aprendí Hagen, lo implemento con Hagen, pero la aplicación que usaba este contratón no la toco, porque sí interactuando con las operaciones insertar o buscar borrar.",
        "start": 685.0,
        "end": 696.0
    },
    {
        "text": " Entonces, una de las implementaciones nuevas, muy simple por eso la voy a introducir primero, es pensar que un conjunto, la más eficiente de todas en tiempo de ejecución es esta, que un conjunto A, pensemoslo así, este conjunto A,",
        "start": 697.0,
        "end": 716.0
    },
    {
        "text": " voy a decir que un elemento está o no está en el conjunto, un elemento X, si el arreglo A en la posicion X tiene 1 o 1 o 1 0 o true y false, depende si lo pienso en bits o bulianos.",
        "start": 717.0,
        "end": 729.0
    },
    {
        "text": " ¿Qué quiero decir con eso? Yo voy a pensar que mi conjunto es un arreglo A y que voy a poner 1, en todos los lugares donde ese elemento está.",
        "start": 730.0,
        "end": 741.0
    },
    {
        "text": " Entonces, si pienso acá diciendo, mira, el 1 está porque tiene 1 o 1 acá, pero el 0 no está, el 3 no está, el 1 está, se entiende, el N sí está porque está aprendido el vídeo 1, es como que prenda los bits o los...",
        "start": 741.0,
        "end": 756.0
    },
    {
        "text": " los trubo, si quieren pensarlo así como bulianos, de los lugares donde está.",
        "start": 757.0,
        "end": 763.0
    },
    {
        "text": " ¿Ok? Se entiende la idea.",
        "start": 763.0,
        "end": 766.0
    },
    {
        "text": " Bien, les parece que esto tiene aplicación, ¿sí? Para implementar un conjunto de números reales, me sirve. ¿Qué serían los elementos acá?",
        "start": 768.0,
        "end": 780.0
    },
    {
        "text": " Naturales, ¿qué son los elementos los X? ¿No? Y los X y yo te va accidento un arreglo en una posicion X, ¿Equí no? Pues es un real, no tengo arreglos indizados por reales.",
        "start": 781.0,
        "end": 793.0
    },
    {
        "text": " No puede ser un estrina arbitrario, tiene que ser, me sirve acá, un entero, un natural, de 0 a un N, un subrango de los naturales.",
        "start": 793.0,
        "end": 805.0
    },
    {
        "text": " Eso es una restricción, será muy eficiente, vamos a ver por qué, pero ya tienes la restricción fuerte.",
        "start": 805.0,
        "end": 811.0
    },
    {
        "text": " Los elementos tienen que ser de 0 a un N o más piables de 0 a un N, ¿Por qué digo? Porque puede pensar días de la semana y pienso que el lunes es el 0 o el 1, el martes, ¿no?",
        "start": 811.0,
        "end": 824.0
    },
    {
        "text": " Puedo pensar en el código ágil o es un conjunto de carácter y pienso que en vez de carácter tengo el código ágil en el carácter.",
        "start": 824.0,
        "end": 830.0
    },
    {
        "text": " Pero parece muy desjugete, ¿no? Porque no es una idea, pero no es poder tener estrina arbitrario, reales, arbitrarios, entero, arbitrarios porque no te van a entrar.",
        "start": 832.0,
        "end": 840.0
    },
    {
        "text": " Y tiene que tener un arreglo infinito, o incluso no tienes índices reales o lo que sea para acceder ahí.",
        "start": 840.0,
        "end": 846.0
    },
    {
        "text": " Entonces, eso es una restricción, sino el dominio, los elementos y el conjunto, no lo puedo mapear a un subrango de los naturales, esta no sirve.",
        "start": 846.0,
        "end": 854.0
    },
    {
        "text": " No lo puedo usar siempre. Ahora supongamos que sí, que la puedo usar, ¿veamos para qué me sirve y qué tan arficientes?",
        "start": 854.0,
        "end": 862.0
    },
    {
        "text": " Bueno, operaciones que vimos recién, por ejemplo, quiero insertar un elemento, ¿qué haría acá?",
        "start": 862.0,
        "end": 868.0
    },
    {
        "text": " Sí, dale. ¿Bien? ¿Qué quieres ir a buscar? ¿Buscadre a recorrar?",
        "start": 868.0,
        "end": 888.0
    },
    {
        "text": " No, voy a acceder al directo. Esa es la gran venta, querido.",
        "start": 888.0,
        "end": 892.0
    },
    {
        "text": " Voy a insertar el elemento y, voy a la arregla en la posición y, y si tiene un cero le pongo uno.",
        "start": 892.0,
        "end": 897.0
    },
    {
        "text": " Tiempo constante, orden uno ¿no? Y si tenía un uno, dice, ¿o les escribo el uno total, no pasa nada o lo dejo igual?",
        "start": 897.0,
        "end": 904.0
    },
    {
        "text": " O sea que insertar podría ser orden uno. ¿Borrar?",
        "start": 904.0,
        "end": 909.0
    },
    {
        "text": " El lo mismo, pero al revés, voy a esa posición, si tiene un uno lo paso cero, y si un cero lo dejo, ¿sabes si un elemento está en los táquios, el pertenece?",
        "start": 909.0,
        "end": 919.0
    },
    {
        "text": " También. O sea que puedo insertar, buscar y borrar en orden uno.",
        "start": 919.0,
        "end": 925.0
    },
    {
        "text": " ¿Más rápido que eso? ¿No existe? No, no, no, podría ser. Ahora vamos a ver eso y sobre escribir con la siguiente pregunta.",
        "start": 925.0,
        "end": 937.0
    },
    {
        "text": " Porque había dos predicados, uno era el pertenece y el otro es saber si el conjunto es vacío. ¿Cómo sabría si este conjunto es vacío?",
        "start": 937.0,
        "end": 946.0
    },
    {
        "text": " Si todos son cero, ¿sabes? Entonces, uniría recorro. ¿Cómo haría para hacer el predicado es vacío en orden uno?",
        "start": 947.0,
        "end": 957.0
    },
    {
        "text": " Exacto, en la representación, además de llevarme este arreglo, me llevo un contador. La pregunta es ¿cómo cambiese contador? Entonces, ¿cuándo o qué?",
        "start": 960.0,
        "end": 968.0
    },
    {
        "text": " ¿Y ahí viene el sobre escribir? Cuando inserto dice, le aumenta su uno de contador. ¿Siempre? No. Si estaba en serio y pasa uno, le aumentaba. Pero si estaba en uno y sobre escribir el uno, no puede aumentar el contador, porque no hay un elemento más. ¿Entiendes?",
        "start": 969.0,
        "end": 987.0
    },
    {
        "text": " Entonces, no está mal sobre escribir, pero ojo con el contador. Si no me va a quedar inconsistente la cantidad con los unos que hay en la regla, lo mismo el borrar, ¿no?",
        "start": 988.0,
        "end": 996.0
    },
    {
        "text": " El borrar cuando pasa de un acero y contador de crece, pero si estaba en serio no, no de crece, bueno, estoy borrando nada.",
        "start": 996.0,
        "end": 1002.0
    },
    {
        "text": " Con ese, ver, la representación y conjunto más ese atributo cantidad podría hacer que, chequear si el conjunto es vacío también en orden uno.",
        "start": 1002.0,
        "end": 1012.0
    },
    {
        "text": " Y mantenerlo al insertar el borrar no le insume más que una constante, porque es una asignación, digamos, un sumaro rectal. Entonces, esto es mejor que esto, o sea, una base de debería ser esto, ¿no?",
        "start": 1013.0,
        "end": 1025.0
    },
    {
        "text": " Insertar, buscar, borrar todo en orden uno, pero hay uno dice las limitaciones, ¿no? O sea, yo quiero tener base de datos de personas que son strings, que se te da tanta olvidate.",
        "start": 1025.0,
        "end": 1034.0
    },
    {
        "text": " No puedo con todo esto, me voy a querer aproximar a esto, oye, mismo. Si no puedo siempre, como me aproximo en los casos que realmente son útiles, a esto.",
        "start": 1035.0,
        "end": 1046.0
    },
    {
        "text": " Pero tiene otra desventaja, ¿cuál es la otra desventaja? Porque la ventaja es el tiempo de ejecución de esas operaciones, ¿no?",
        "start": 1046.0,
        "end": 1052.0
    },
    {
        "text": " La otra desventaja es que el tamaño, yo dije, tiene su rango en la naturaleza, pero ¿cabéis, ese inicio es muy grande?",
        "start": 1052.0,
        "end": 1060.0
    },
    {
        "text": " Está bien, y en realidad, en el muy grande yo tengo poquitos bit de unos prendidos, que son los elementos que realmente están.",
        "start": 1061.0,
        "end": 1067.0
    },
    {
        "text": " Entonces, estoy desperdiciando capas mucho, pero yo dije, mira, voy a tener, no sé, capa que 100.000, pero en la práctica después tengo 500.",
        "start": 1067.0,
        "end": 1075.0
    },
    {
        "text": " Entonces, estoy desperdiciando un montón de espacios en blanco por los que podrían venir para ser rápido.",
        "start": 1075.0,
        "end": 1081.0
    },
    {
        "text": " Se entiende? Entonces, eso lo puedo, ahora vamos a ir a este disparicio de memoria con un ejemplo concreto.",
        "start": 1082.0,
        "end": 1088.0
    },
    {
        "text": " Pero antes de ir a este ejemplo concreto, veamos algunas de estas operaciones binarias que yo le dije que no, porque en el sartado cari borrar, esta acceso directo y no tiene complicación.",
        "start": 1088.0,
        "end": 1099.0
    },
    {
        "text": " ¿Cómo sería, por ejemplo, si uno quisiera, daos dos conjuntos, ahí ve, por ejemplo, hacer alguno de esto, que es o le unión o la intersección o la diferencia.",
        "start": 1099.0,
        "end": 1108.0
    },
    {
        "text": " Pensamos, por ejemplo, la primera que es la unión, uno diría que te onguiera haciendo y bueno, ahora te ongué recorriendo y quiera poniendo acá, preguntando.",
        "start": 1109.0,
        "end": 1120.0
    },
    {
        "text": " Si hago la unión, cuando va un uno acá, cuando alguno de los dos éstos eran uno, por ejemplo, en este caso va un uno porque ve tiene un uno aunque ha tenido cero.",
        "start": 1123.0,
        "end": 1133.0
    },
    {
        "text": " ¿No? ¿Y qué operaciones es esa entre a su B y B su B?",
        "start": 1133.0,
        "end": 1137.0
    },
    {
        "text": " ¿La unión que es operación buliana? ¿Eh? El or. ¿Está bien? Entonces, voy haciendo para algún for y para cada I a su B o B su B.",
        "start": 1138.0,
        "end": 1152.0
    },
    {
        "text": " Entonces, si uno de los dos le da trucha va a poner el tru y abajo. Recorra una sola pasada y hago la unión de las dos conjuntos.",
        "start": 1152.0,
        "end": 1160.0
    },
    {
        "text": " Y si quieres hacer la intersección, el ant. Ah, y ahora bien la la. Y si quiero hacer la diferencia que sería A menos B en la posición I que lo que va.",
        "start": 1160.0,
        "end": 1171.0
    },
    {
        "text": " Recuerda que la diferencia, lo que están en A pero no están en B. ¿Tú te están haciendo lógica, no? Vamos, les tengo ferro lógico.",
        "start": 1172.0,
        "end": 1181.0
    },
    {
        "text": " Lo que están en A pero no están en B. ¿Y a eso? Esa que están en A pero no están en B. A de I, Ant, not B de I, por ejemplo, o Poponif también.",
        "start": 1181.0,
        "end": 1201.0
    },
    {
        "text": " Pero eso queda más elegante. Y eso loitero, no? El I es el for y me va generando la diferencia.",
        "start": 1202.0,
        "end": 1208.0
    },
    {
        "text": " O sea que es una sola recorrida del universo que se suele llamar, que es el N, de todos los que podrían estar. Fíjense que es una diferencia porque digo porque desperdicia más memoria que la lista. ¿Por qué la lista?",
        "start": 1208.0,
        "end": 1221.0
    },
    {
        "text": " Esa, uno dice cuántos no tienen la lista para los elementos que suincierten. ¿Están lo que tienen que estar?",
        "start": 1222.0,
        "end": 1229.0
    },
    {
        "text": " Acá están más de los que podrían estar, porque todos los cero son podrían venir pero no están. O sea, lo que están son los uno, se entiende.",
        "start": 1229.0,
        "end": 1237.0
    },
    {
        "text": " Entonces yo me reservo el espacio para todo el universo, tengo que tener como un universo de todos los que podrían venir. Y voy setiendo con uno los que vinieron.",
        "start": 1237.0,
        "end": 1246.0
    },
    {
        "text": " Por ejemplo, yo podría decir si todos tienen un número de estudiantes, paso el lista, está bien. Y a cada número de estudiantes le pongo el presente, digamos, ¿no? Entonces, es la asistencia de hoy.",
        "start": 1247.0,
        "end": 1257.0
    },
    {
        "text": " Y podría hacerlo todo el día y después decir el orden de todos o el ande de todo o la sumatoria de todo, pasa de cuánta vez se vinieron, si vinieron alguna vez, etc.",
        "start": 1257.0,
        "end": 1266.0
    },
    {
        "text": " ¿Está bien? Ok. O sea que también uno diría para este tipo de operaciones es eficiente hacer esto y es simple, es muy fácil de programar esto, eso es lo que quiero que veamos.",
        "start": 1267.0,
        "end": 1277.0
    },
    {
        "text": " Pero la limitación y el disparillo de memoria parecen ser condicionantes para esta estructura, ¿no?",
        "start": 1277.0,
        "end": 1284.0
    },
    {
        "text": " Entonces le voy a poner un ejemplito para ver eso del disparillo de memoria. Y para ver que no es tan dejuelte. ¿Está bien? Entonces digo, en este universidad, ¿no?",
        "start": 1284.0,
        "end": 1295.0
    },
    {
        "text": " Uno puede pensar que cada estudiante, una diría por más que tiene nombre todo, tiene un número de estudiantes. Eso es un número. Y puedo pensar que ese número no es negativo, o sea que va de 0 a un máximo.",
        "start": 1295.0,
        "end": 1306.0
    },
    {
        "text": " Y cada curso, si se vieron, el curso no es tan mejor si es 13, 21, o algo así, también tiene un número.",
        "start": 1306.0,
        "end": 1313.0
    },
    {
        "text": " Entonces, tengo un número para estudiante, el número para curso, de hecho hay un número para funcionario, o sea que nadie identificaba mucho con número.",
        "start": 1314.0,
        "end": 1323.0
    },
    {
        "text": " Y si no hay un número inventado, la se doy. El número grande, pero es un número.",
        "start": 1323.0,
        "end": 1328.0
    },
    {
        "text": " Entonces yo podría pensar cómo hago, por ejemplo, la correlación de ese, un estudiante esté inscripto en un curso.",
        "start": 1328.0,
        "end": 1333.0
    },
    {
        "text": " O la nota que saco un estudiante en un curso, no sé, un estudiante en un curso. Entonces podría pensar, por ejemplo, una matriz.",
        "start": 1334.0,
        "end": 1342.0
    },
    {
        "text": " Vamos a poner reglo de bits, pero de dos dimensiones. Pienso las columnas son números de cursos y pienso que las filas son números de estudiantes.",
        "start": 1342.0,
        "end": 1353.0
    },
    {
        "text": " Me va a decir usar el cosito, porque si no nos sale. Número de estudiantes acá y número de cursos acá.",
        "start": 1354.0,
        "end": 1359.0
    },
    {
        "text": " Y cuando pongo un 1, un 0, cuando el estudiante esté, está haciendo el curso este, por ejemplo.",
        "start": 1359.0,
        "end": 1367.0
    },
    {
        "text": " Si pienso en estado o no está haciendo el 1, si pienso en nota, ya vamos a perder la variante la semana que viene y se va a mapping.",
        "start": 1367.0,
        "end": 1373.0
    },
    {
        "text": " Ahí voy a poder guardar más que la información de si está o no está, algo más.",
        "start": 1373.0,
        "end": 1378.0
    },
    {
        "text": " Ok, simple, porque entonces digo, el estudiante esté inscripto en un curso, voy a esta posición de la matriz, en orden 1, veo si tiene un 1, un 0.",
        "start": 1379.0,
        "end": 1389.0
    },
    {
        "text": " Inscribirlo también, voy a esa posición y chanto el 1, si se va a inscribir o si lo voy a borrar, le pongo un 0.",
        "start": 1389.0,
        "end": 1396.0
    },
    {
        "text": " Muy eficiente. Ahora vamos a la realidad. ¿Cuántos estudiantes, por ejemplo, tiene activo la faculde ingeniería? ¿Aquí tiene una idea?",
        "start": 1396.0,
        "end": 1406.0
    },
    {
        "text": " Un poquito más, 10.000. Activo quiere decir, con alguna actividad de los últimos dos años, 10.000 estudiantes.",
        "start": 1407.0,
        "end": 1415.0
    },
    {
        "text": " Un poquito, 10.000 quiniéndole o no cosas así. ¿Cuántos cursos hay? Y bueno, vari, porque uno tiene la carrera, pues en montón de electivos,",
        "start": 1415.0,
        "end": 1425.0
    },
    {
        "text": " lo está haciendo con mutación, tienen como 100 electivos en total, vamos a poder hacer ahora fuera de la carrera, fuera de la facultad.",
        "start": 1425.0,
        "end": 1430.0
    },
    {
        "text": " Supongamos para poner un número así que podría hacer de todo, incluso hasta puede hacer más avanzado hasta alguno de pogrado que le sirve de grado,",
        "start": 1431.0,
        "end": 1439.0
    },
    {
        "text": " o sea, mil cursos, para pasar un número redón. ¿Cuántas celdas tiene esta matriz? Y tengo 10.000 estudiantes y mil cursos, por ejemplo.",
        "start": 1439.0,
        "end": 1447.0
    },
    {
        "text": " ¿Rápido la cuenta? 10.000 millones, muy bien. 10.000 millones, una hería pa, ahí ya la memoria. No sé.",
        "start": 1447.0,
        "end": 1456.0
    },
    {
        "text": " Y pensemos cuántos disto van a ser uniseros. ¿Te vamos a la realidad? En este mes, en este momento. ¿Cuántos cursos te inscripto cuatro? ¿Qué quiere decir que si lo tomo a él, van a aparecer en algún lugar de acá, cuatro unos, y está haciendo cuatro, ¿no?",
        "start": 1457.0,
        "end": 1472.0
    },
    {
        "text": " Y todo, pero todos los demás van a ser ceros. Capacán, ella está haciendo tres, y no los mismos, o sí lo mismo, y va a aparecer acá.",
        "start": 1474.0,
        "end": 1482.0
    },
    {
        "text": " Pero la mayoría que van a ser, ceros. Si tomo un curso, programación dos, de los 10.000 estudiantes activos, ¿cuántos vamos a tener? ¿Cuántos creen que somos?",
        "start": 1483.0,
        "end": 1492.0
    },
    {
        "text": " 600, ¿no? Por lo menos solo que arrancamos, ahora de los somos menos. Y lo que viene a teórico, menos de menos, o sea, de acá.",
        "start": 1492.0,
        "end": 1500.0
    },
    {
        "text": " Sí. ¿Déjate que son cinco muchos, cinco, uno, uno, uno, cero, no? ¿Eh?",
        "start": 1501.0,
        "end": 1506.0
    },
    {
        "text": " Sí. De hecho, hay técnicas para esto colapsar lo menos, me voy a dar más matrices dispersas. Esto es un matriz, toda representa el poda colapsar y tener matrices dispersas.",
        "start": 1506.0,
        "end": 1519.0
    },
    {
        "text": " Pero vamos a dejarlo a la parte. Y quiero decir, 600 y dije 10.000, o sea, de nuevo su fragmento muy chiquito de uno, respeto a todos los ceros.",
        "start": 1520.0,
        "end": 1528.0
    },
    {
        "text": " Multipliquen esos ceros de firas y columna, hace que la matriz tengan menos del 2% con unos, en una situación real, y todos los demás, 98% son ceros.",
        "start": 1528.0,
        "end": 1539.0
    },
    {
        "text": " La pregunta es, ¿pago esa eficiencia de ir a saber si una estudiante en el concurso en orden 1, desperdiciando al 98% de la memoria?",
        "start": 1540.0,
        "end": 1549.0
    },
    {
        "text": " Y bueno, depende. Si estoy en un servidor, la memoria tengo que ser 2, sí, si estoy en una aplicación en un celular y va a correr esto en el celular, no.",
        "start": 1549.0,
        "end": 1557.0
    },
    {
        "text": " Todo va a depender en qué contexto voy a ejecutar esto. Entonces, eso para que vean el impacto que puede tener, uno dice la velocidad que quiero tener en tiempo de ejecución respecto a la memoria que necesito para esto.",
        "start": 1558.0,
        "end": 1570.0
    },
    {
        "text": " Entonces hay que, a veces ver si vale una pena no vale. ¿Qué otra opción hay? Bueno, todas las que vimos hasta ahora me sirven para implementar conjunto. Una simple lista.",
        "start": 1570.0,
        "end": 1581.0
    },
    {
        "text": " Dista de nodos. ¿Qué ventajas, a priori, le ven a la lista respecto al dibujito de la regla de bits?",
        "start": 1582.0,
        "end": 1589.0
    },
    {
        "text": " La memoria, voy a tener un nodito solo para los que vaya agregando. ¿Otra ventaja?",
        "start": 1590.0,
        "end": 1596.0
    },
    {
        "text": " No está cotada, muy bien. Acá no tengo que imponer un ene de un universo.",
        "start": 1599.0,
        "end": 1603.0
    },
    {
        "text": " ¿No puedo guardar lo que quiere? Muy bien. Puedo guardar lo que quiere. El tipo de datos del nodito, pues una persona, un estrín, un real, no tengo ninguna restricción.",
        "start": 1604.0,
        "end": 1614.0
    },
    {
        "text": " Esto me es más su sable, tiene más aplicaciones. Hasta ahí le voy ganando claramente la regla de bits.",
        "start": 1614.0,
        "end": 1623.0
    },
    {
        "text": " Pero si quiero insertar, buscar y borrar una lista, ustedes lo saben.",
        "start": 1624.0,
        "end": 1628.0
    },
    {
        "text": " Insertar, buscar y borrar un elemento en el lista que ahora entiene. ¿En qué? Puedo recordar la lista.",
        "start": 1630.0,
        "end": 1636.0
    },
    {
        "text": " No me salvo de recordar la lista. Entonces paso de orden 1 a orden 1.",
        "start": 1637.0,
        "end": 1642.0
    },
    {
        "text": " Entonces lo que gano por un lado lo pierdo por el otro.",
        "start": 1642.0,
        "end": 1646.0
    },
    {
        "text": " Y ya vayan quedando con esto porque ya me vine ahora la segunda parte, el curso haciendo.",
        "start": 1647.0,
        "end": 1652.0
    },
    {
        "text": " Las listas son buenas para una cosa. No, no tienen cota, tipo el elemento lo que quiera, manejan bien la memoria.",
        "start": 1652.0,
        "end": 1659.0
    },
    {
        "text": " Los arregle bits son muy buenas en la eficiencia. ¿Qué es lo que uno quiere después?",
        "start": 1659.0,
        "end": 1663.0
    },
    {
        "text": " En la vida, qué es lo que quiere. Lo mejor de todo. Entonces, ¿cómo convino esto para tener algo aproximado a las dos?",
        "start": 1664.0,
        "end": 1672.0
    },
    {
        "text": " Que tenga todas las ventaja de la lista y lo posible toda la ventaja de la regla de bits.",
        "start": 1673.0,
        "end": 1677.0
    },
    {
        "text": " Lo dejo pendiente ahí, eso se va a dar marjashi.",
        "start": 1678.0,
        "end": 1680.0
    },
    {
        "text": " Sigamos un poquito más con las listas.",
        "start": 1682.0,
        "end": 1684.0
    },
    {
        "text": " Insertar, bueno, es vacío si la puedo hacer en orden 1 porque es chequear una lista simple en cada nada, a ver si el punter es null.",
        "start": 1686.0,
        "end": 1692.0
    },
    {
        "text": " O sea, es fácil. Perteneci borrar orden n.",
        "start": 1693.0,
        "end": 1695.0
    },
    {
        "text": " Y estas operaciones, unión, intersección y diferencia.",
        "start": 1696.0,
        "end": 1698.0
    },
    {
        "text": " ¿Ferencia?",
        "start": 1698.0,
        "end": 1699.0
    },
    {
        "text": " Si tengo dos listas como las haría.",
        "start": 1701.0,
        "end": 1703.0
    },
    {
        "text": " Bien, él dice si tengo un unión, no las puedo concatenar.",
        "start": 1714.0,
        "end": 1717.0
    },
    {
        "text": " Los repetidos que pasa.",
        "start": 1718.0,
        "end": 1720.0
    },
    {
        "text": " Y pero cada una zip puede no tener repetido ahora cuando las uní, pasan a tener.",
        "start": 1721.0,
        "end": 1727.0
    },
    {
        "text": " De hecho, los elementos de repetir a filtrar los repetidos y eso es ya más costoso.",
        "start": 1728.0,
        "end": 1732.0
    },
    {
        "text": " Parece que no me salvo de recorrer las listas para ver.",
        "start": 1734.0,
        "end": 1737.0
    },
    {
        "text": " Y si no están ordenadas, ¿qué tendría que hacer?",
        "start": 1738.0,
        "end": 1740.0
    },
    {
        "text": " Porque de elemento una lista, buscamos la otra.",
        "start": 1741.0,
        "end": 1743.0
    },
    {
        "text": " Segundo, busco en la otra. Entonces, va a ser si esta tiene enelementos, si esta tiene enelementos,",
        "start": 1745.0,
        "end": 1749.0
    },
    {
        "text": " y va a ser enelementos.",
        "start": 1750.0,
        "end": 1751.0
    },
    {
        "text": " Es como se fue un wild dentro, un wild.",
        "start": 1752.0,
        "end": 1754.0
    },
    {
        "text": " Entonces, eso ya ha comparado con lo que vimos antes, es muy ineficiente.",
        "start": 1756.0,
        "end": 1759.0
    },
    {
        "text": " Pero, ahí viene donde capaz con venga, en vez de tener este enelemento,",
        "start": 1761.0,
        "end": 1767.0
    },
    {
        "text": " mantener las listas ordenadas.",
        "start": 1768.0,
        "end": 1770.0
    },
    {
        "text": " No dice, para insertar, buscar y borrar que este eneor de nada no me importa mucho,",
        "start": 1772.0,
        "end": 1775.0
    },
    {
        "text": " pero si les quiero hacerle unión intersección de diferencia,",
        "start": 1775.0,
        "end": 1778.0
    },
    {
        "text": " ya ya hemos visto tenia con el Mars, ¿no?",
        "start": 1780.0,
        "end": 1782.0
    },
    {
        "text": " Que tenía dos listas ordenadas y tenías que hacer como la unión si se quiere de la lista ordenada.",
        "start": 1783.0,
        "end": 1788.0
    },
    {
        "text": " Es que han ido mirando cada elemento, ¿tabía?",
        "start": 1788.0,
        "end": 1791.0
    },
    {
        "text": " Avar si recuerdan eso. Si yo tenía una lista, el 1.",
        "start": 1792.0,
        "end": 1795.0
    },
    {
        "text": " Y acá tengo un elemento.",
        "start": 1796.0,
        "end": 1798.0
    },
    {
        "text": " No voy a poner que elemento para que no me digan, y no pongo el resto, ¿no?",
        "start": 1799.0,
        "end": 1802.0
    },
    {
        "text": " Y el 2, acá tiene un x2, pero están ordenadas,",
        "start": 1802.0,
        "end": 1808.0
    },
    {
        "text": " menor estricto por un repetido, ¿no?",
        "start": 1809.0,
        "end": 1811.0
    },
    {
        "text": " Mirando este y este, ¿qué podría decir?",
        "start": 1812.0,
        "end": 1816.0
    },
    {
        "text": " X1 y x2, ¿qué puede pasar?",
        "start": 1818.0,
        "end": 1821.0
    },
    {
        "text": " Si x1 es menor que x2, ¿qué sabes? Empalabra.",
        "start": 1822.0,
        "end": 1825.0
    },
    {
        "text": " Que no te ha repetido para más que c, ¿dex1? ¿Algo más c?",
        "start": 1827.0,
        "end": 1830.0
    },
    {
        "text": " Hay algo que tiene que ver con el pertenece, ¿qué lo que sé?",
        "start": 1830.0,
        "end": 1833.0
    },
    {
        "text": " O sea, del pertenece que lo que sé.",
        "start": 1835.0,
        "end": 1837.0
    },
    {
        "text": " Si x1 es más chiquito que x2, es acto. ¿Qué x1 no pertenece a el 2?",
        "start": 1838.0,
        "end": 1844.0
    },
    {
        "text": " Porque si es más chiquito que el primero, es más chiquito que todos.",
        "start": 1844.0,
        "end": 1847.0
    },
    {
        "text": " Entonces, ¿no está?",
        "start": 1847.0,
        "end": 1848.0
    },
    {
        "text": " Sin aplicarle el pertenece, ya sé que no pertenece. Eso es rápido.",
        "start": 1849.0,
        "end": 1852.0
    },
    {
        "text": " El más chiquito no puede pertenecer a la otra.",
        "start": 1854.0,
        "end": 1856.0
    },
    {
        "text": " Y lo sé, sin aplicarle la operación pertenece.",
        "start": 1857.0,
        "end": 1860.0
    },
    {
        "text": " Entonces, ahí voy ganando tiempo.",
        "start": 1860.0,
        "end": 1862.0
    },
    {
        "text": " Entonces, digo el más chiquito, si voy a hacer un unión,",
        "start": 1862.0,
        "end": 1864.0
    },
    {
        "text": " lo agrego, si voy a hacer una intersección, lo avance,",
        "start": 1864.0,
        "end": 1866.0
    },
    {
        "text": " o pueden haber una interesa, hasta que llegue algo igual,",
        "start": 1866.0,
        "end": 1868.0
    },
    {
        "text": " voy avanzando así.",
        "start": 1868.0,
        "end": 1870.0
    },
    {
        "text": " Habíamos visto, ya eso, por eso que no me voy a detener mucho",
        "start": 1870.0,
        "end": 1873.0
    },
    {
        "text": " en cosas que ya hemos visto.",
        "start": 1873.0,
        "end": 1874.0
    },
    {
        "text": " Eso me llevaba orden en en más m, porque recorría cada lista una sola vez,",
        "start": 1874.0,
        "end": 1878.0
    },
    {
        "text": " haciendo un unión, una intersección, una diferencia.",
        "start": 1879.0,
        "end": 1881.0
    },
    {
        "text": " Es ejercicio que van a tener el práctico, ¿no?",
        "start": 1881.0,
        "end": 1883.0
    },
    {
        "text": " Pero es la misma lógica, dir avanzando, siempre sabiendo que el más chiquito de ellos",
        "start": 1884.0,
        "end": 1887.0
    },
    {
        "text": " no está en la otra.",
        "start": 1887.0,
        "end": 1888.0
    },
    {
        "text": " Es la vivada, digamos.",
        "start": 1888.0,
        "end": 1890.0
    },
    {
        "text": " Entonces, si tengo mil por mil, es un millón, mil más mil, es dos mil.",
        "start": 1890.0,
        "end": 1895.0
    },
    {
        "text": " O sea, ahí digo, mantener las listas ordenadas,",
        "start": 1895.0,
        "end": 1898.0
    },
    {
        "text": " tiene una ventaja si quiero hacer operaciones binarias.",
        "start": 1898.0,
        "end": 1901.0
    },
    {
        "text": " Si no quiero hacer operaciones binarias, me da lo mismo.",
        "start": 1902.0,
        "end": 1905.0
    },
    {
        "text": " Si solo voy a hacer insertar, buscar y borrar,",
        "start": 1905.0,
        "end": 1907.0
    },
    {
        "text": " que son las básicas, altas, baje y consultas,",
        "start": 1907.0,
        "end": 1909.0
    },
    {
        "text": " y campagano hace falta que esté ordenada.",
        "start": 1909.0,
        "end": 1911.0
    },
    {
        "text": " Ok, sí.",
        "start": 1914.0,
        "end": 1915.0
    },
    {
        "text": " Vamos bien.",
        "start": 1918.0,
        "end": 1919.0
    },
    {
        "text": " Podría usar alguna reglo con tope también,",
        "start": 1922.0,
        "end": 1925.0
    },
    {
        "text": " y sí, también, podría hacer todo lo que vimos hasta ahora lo puso",
        "start": 1925.0,
        "end": 1928.0
    },
    {
        "text": " para, si lo podria usar, para una colección.",
        "start": 1928.0,
        "end": 1930.0
    },
    {
        "text": " ¿Qué te puede saber?",
        "start": 1932.0,
        "end": 1934.0
    },
    {
        "text": " Bueno, supongo que yo tengo este arreglo y acabo guardo",
        "start": 1934.0,
        "end": 1937.0
    },
    {
        "text": " para ver si entiendo sobre todo la diferencia con la reglo de bits,",
        "start": 1938.0,
        "end": 1940.0
    },
    {
        "text": " porque después, visto que muchas tuyentes se confunden,",
        "start": 1941.0,
        "end": 1943.0
    },
    {
        "text": " después habéis visto la reglo de bits que tenía los unos y cero prendidos,",
        "start": 1943.0,
        "end": 1946.0
    },
    {
        "text": " se confunden con este, y son cosas distinta.",
        "start": 1946.0,
        "end": 1949.0
    },
    {
        "text": " El arreglo con tope, si bien acá tengo un m,",
        "start": 1949.0,
        "end": 1952.0
    },
    {
        "text": " es, no tiene nada que hacer con el universo,",
        "start": 1952.0,
        "end": 1954.0
    },
    {
        "text": " acá pueden ser strings, si quieren.",
        "start": 1954.0,
        "end": 1956.0
    },
    {
        "text": " Pero yo digo, a lo sumo m strings,",
        "start": 1957.0,
        "end": 1959.0
    },
    {
        "text": " pero el universo, lo que quieras, reales, reales,",
        "start": 1959.0,
        "end": 1963.0
    },
    {
        "text": " pero vas a tener a lo sumo m reales,",
        "start": 1963.0,
        "end": 1965.0
    },
    {
        "text": " por eso es una cota, pero no de todo el universo,",
        "start": 1965.0,
        "end": 1968.0
    },
    {
        "text": " sino de cuántos quiero del universo.",
        "start": 1968.0,
        "end": 1970.0
    },
    {
        "text": " Y el tope me dice, ¿cuántos tenés en este momento?",
        "start": 1971.0,
        "end": 1974.0
    },
    {
        "text": " ¿Tanto de todos los que cargué, por ejemplo, tan allá?",
        "start": 1974.0,
        "end": 1976.0
    },
    {
        "text": " Y supongo que sé que yo los mantengo ordenado,",
        "start": 1976.0,
        "end": 1978.0
    },
    {
        "text": " para darle alguna utilidad un poquito a esto.",
        "start": 1978.0,
        "end": 1981.0
    },
    {
        "text": " Si lo mantuviera ordenado,",
        "start": 1983.0,
        "end": 1984.0
    },
    {
        "text": " el pertenece puede ser mejor acá que en la lista, ¿por qué?",
        "start": 1985.0,
        "end": 1988.0
    },
    {
        "text": " Porque el pertenece una lista,",
        "start": 1993.0,
        "end": 1994.0
    },
    {
        "text": " por más que esté ordenado, tengo que recordar la lista, ¿no?",
        "start": 1994.0,
        "end": 1997.0
    },
    {
        "text": " O sea, es ordené, ¿pero acá?",
        "start": 1997.0,
        "end": 1999.0
    },
    {
        "text": " ¿Qué dijo?",
        "start": 2002.0,
        "end": 2003.0
    },
    {
        "text": " La búsqueda binaria, ¿no?",
        "start": 2005.0,
        "end": 2006.0
    },
    {
        "text": " Es que ve escuchado binaria, o sea, la búsqueda binaria.",
        "start": 2006.0,
        "end": 2009.0
    },
    {
        "text": " Si está ordenado, una reglo que tengo posiciona",
        "start": 2009.0,
        "end": 2011.0
    },
    {
        "text": " y podría la mitad a la mitad a la mitad, ¿no?",
        "start": 2011.0,
        "end": 2013.0
    },
    {
        "text": " Y eso es el logaritmo.",
        "start": 2013.0,
        "end": 2014.0
    },
    {
        "text": " Y por qué digo, el pertenece no es menor,",
        "start": 2016.0,
        "end": 2019.0
    },
    {
        "text": " porque muchas veces, mismo,",
        "start": 2019.0,
        "end": 2021.0
    },
    {
        "text": " pensemos a la VLIA, ¿cuándo se carga fuertemente",
        "start": 2021.0,
        "end": 2023.0
    },
    {
        "text": " la información a los comienzos de los emestres",
        "start": 2023.0,
        "end": 2026.0
    },
    {
        "text": " en los parciales, pero después, después,",
        "start": 2026.0,
        "end": 2028.0
    },
    {
        "text": " los restos son consultas que hacen la VLIA, como el pertenece.",
        "start": 2028.0,
        "end": 2030.0
    },
    {
        "text": " Entonces, ¿qué le insarción se un poco más costos?",
        "start": 2031.0,
        "end": 2033.0
    },
    {
        "text": " El borrado, que se hace en puntos aislados,",
        "start": 2033.0,
        "end": 2036.0
    },
    {
        "text": " capa que no importa tanto como el pertenece que van todos los días",
        "start": 2037.0,
        "end": 2040.0
    },
    {
        "text": " a pedir consultas a ver si un instrumento está,",
        "start": 2040.0,
        "end": 2042.0
    },
    {
        "text": " no está, yo quiero agilizar eso.",
        "start": 2042.0,
        "end": 2044.0
    },
    {
        "text": " Entonces, una simple amenadación con esto,",
        "start": 2044.0,
        "end": 2046.0
    },
    {
        "text": " que me permite acceso directo a posiciones,",
        "start": 2046.0,
        "end": 2047.0
    },
    {
        "text": " puede hacer que el pertenece sea rápido.",
        "start": 2047.0,
        "end": 2049.0
    },
    {
        "text": " Para que vean que no hay una implementación",
        "start": 2050.0,
        "end": 2052.0
    },
    {
        "text": " que es mejor que otra siempre,",
        "start": 2052.0,
        "end": 2053.0
    },
    {
        "text": " porque si no, la otra no existiría.",
        "start": 2053.0,
        "end": 2055.0
    },
    {
        "text": " Hay contexto, entonces, ¿y ustedes ya están",
        "start": 2056.0,
        "end": 2058.0
    },
    {
        "text": " en el capa del curso que van a empezar",
        "start": 2058.0,
        "end": 2060.0
    },
    {
        "text": " a hacer humanalista de estructuras, ¿no?",
        "start": 2060.0,
        "end": 2062.0
    },
    {
        "text": " En este escenario te conviene tal cosa,",
        "start": 2062.0,
        "end": 2064.0
    },
    {
        "text": " en este... ¿no? ¿Y van a asesorar a alguien y si no?",
        "start": 2064.0,
        "end": 2066.0
    },
    {
        "text": " Podemos implementar la necesidad, y si no funciona,",
        "start": 2066.0,
        "end": 2068.0
    },
    {
        "text": " y usé la especificación y esta implementación es muy lenta,",
        "start": 2069.0,
        "end": 2072.0
    },
    {
        "text": " no importa, porque si la aplicación está funcionando,",
        "start": 2072.0,
        "end": 2074.0
    },
    {
        "text": " bueno, te preocupes, y eso,",
        "start": 2074.0,
        "end": 2075.0
    },
    {
        "text": " te cambio la implementación,",
        "start": 2075.0,
        "end": 2076.0
    },
    {
        "text": " la aplicación sigue funcionando,",
        "start": 2076.0,
        "end": 2078.0
    },
    {
        "text": " o sea, se puede reparar o corregir o mejorar.",
        "start": 2078.0,
        "end": 2080.0
    },
    {
        "text": " ¿También?",
        "start": 2081.0,
        "end": 2082.0
    },
    {
        "text": " Si el escenario cambia, porque a veces uno hace un software",
        "start": 2083.0,
        "end": 2086.0
    },
    {
        "text": " por una empresa, bajo un escenario chico,",
        "start": 2086.0,
        "end": 2088.0
    },
    {
        "text": " y la empresa empieza a crecer,",
        "start": 2088.0,
        "end": 2090.0
    },
    {
        "text": " y ya todo lo que pensé para ese escenario chico,",
        "start": 2091.0,
        "end": 2093.0
    },
    {
        "text": " empieza a hacer agua por todos lados,",
        "start": 2093.0,
        "end": 2095.0
    },
    {
        "text": " entonces, hay que mejorar, por ejemplo, las implementaciones.",
        "start": 2095.0,
        "end": 2097.0
    },
    {
        "text": " Entonces ahí tengo que cambiar, ¿ok?",
        "start": 2098.0,
        "end": 2100.0
    },
    {
        "text": " Esta podría ser una ventaja de nuevo,",
        "start": 2102.0,
        "end": 2104.0
    },
    {
        "text": " si adecuas más una versión acotada, ¿por qué?",
        "start": 2104.0,
        "end": 2106.0
    },
    {
        "text": " Y vamos, tengo una regla.",
        "start": 2107.0,
        "end": 2109.0
    },
    {
        "text": " La dijieron hace un ratito, ¿no?",
        "start": 2112.0,
        "end": 2114.0
    },
    {
        "text": " Los salvo del dinero y busque a también,",
        "start": 2114.0,
        "end": 2115.0
    },
    {
        "text": " son una opción para conjuntos.",
        "start": 2115.0,
        "end": 2117.0
    },
    {
        "text": " Y acá yo te he intentado preguntar, ¿son mejores opiores que las listas?",
        "start": 2119.0,
        "end": 2122.0
    },
    {
        "text": " Los ABB.",
        "start": 2123.0,
        "end": 2124.0
    },
    {
        "text": " ¿Quién dijo de Peña?",
        "start": 2126.0,
        "end": 2127.0
    },
    {
        "text": " ¿Por qué?",
        "start": 2129.0,
        "end": 2130.0
    },
    {
        "text": " Porque el sistema de la lista está ordenado,",
        "start": 2132.0,
        "end": 2136.0
    },
    {
        "text": " que es más fácil,",
        "start": 2136.0,
        "end": 2138.0
    },
    {
        "text": " pero la lista está ordenada de uno a dos veces.",
        "start": 2139.0,
        "end": 2142.0
    },
    {
        "text": " ¿Y si quieres poner una revolu en los países?",
        "start": 2142.0,
        "end": 2145.0
    },
    {
        "text": " ¿Siete o se le han visto cualquier?",
        "start": 2145.0,
        "end": 2147.0
    },
    {
        "text": " Recorrer un camino del árbol no es más rápido",
        "start": 2147.0,
        "end": 2149.0
    },
    {
        "text": " que recordó todo en la lista.",
        "start": 2149.0,
        "end": 2151.0
    },
    {
        "text": " Y vuelve encantado la respuesta depende,",
        "start": 2154.0,
        "end": 2156.0
    },
    {
        "text": " porque lo que yo esperaba, ¿vale?",
        "start": 2156.0,
        "end": 2158.0
    },
    {
        "text": " Uno te atentó a decir que los árboles son mejores que las listas, ¿sí?",
        "start": 2158.0,
        "end": 2161.0
    },
    {
        "text": " ¿Pero no lees una cosa sea muy situacional?",
        "start": 2161.0,
        "end": 2165.0
    },
    {
        "text": " Bueno, vamos a ver, ¿en qué situaciones son mejores?",
        "start": 2165.0,
        "end": 2169.0
    },
    {
        "text": " ¿En qué casos no son mejores?",
        "start": 2169.0,
        "end": 2171.0
    },
    {
        "text": " Bueno, acá me dice que agregar en un árbol es más lento a una lista.",
        "start": 2179.0,
        "end": 2182.0
    },
    {
        "text": " En principio, ¿deuría que no?",
        "start": 2182.0,
        "end": 2184.0
    },
    {
        "text": " Que eso va a ser una ventaja del árbol respecto a la lista.",
        "start": 2184.0,
        "end": 2187.0
    },
    {
        "text": " Vamos a ver, ¿en qué escenario sí, en qué escenario no?",
        "start": 2187.0,
        "end": 2190.0
    },
    {
        "text": " Primero, ¿veamos por qué se ha adecuado?",
        "start": 2190.0,
        "end": 2192.0
    },
    {
        "text": " Yo le dije, no, pero vamos a repetir.",
        "start": 2192.0,
        "end": 2194.0
    },
    {
        "text": " ¿Por qué es un conjunto? Supongo que hay este conjunto.",
        "start": 2194.0,
        "end": 2197.0
    },
    {
        "text": " También lo puedo representar con más de una bebé.",
        "start": 2197.0,
        "end": 2201.0
    },
    {
        "text": " Por ejemplo, puede ser este, pero puede haber otro.",
        "start": 2201.0,
        "end": 2204.0
    },
    {
        "text": " Raid 12, al izquierdo el 8, a derecha 18, siempre menor y es mayor.",
        "start": 2204.0,
        "end": 2209.0
    },
    {
        "text": " Es la consigna. ¿Está bien?",
        "start": 2209.0,
        "end": 2212.0
    },
    {
        "text": " ¿Por qué es adecuado? ¿Por qué no es repetido?",
        "start": 2212.0,
        "end": 2214.0
    },
    {
        "text": " Ya primera cosa de Dios que es adecuado.",
        "start": 2214.0,
        "end": 2217.0
    },
    {
        "text": " Y uno diría, a priori, los algoritmos que voy a correr sobre una bebé,",
        "start": 2217.0,
        "end": 2221.0
    },
    {
        "text": " ¿cuál es el ainsertar o buscar borrar, son los mismos que tienen el conjunto?",
        "start": 2221.0,
        "end": 2225.0
    },
    {
        "text": " Entonces, ¿de una iría de el mismo código?",
        "start": 2225.0,
        "end": 2227.0
    },
    {
        "text": " Ni siquiera parecido, es el mismo código.",
        "start": 2227.0,
        "end": 2230.0
    },
    {
        "text": " También.",
        "start": 2230.0,
        "end": 2231.0
    },
    {
        "text": " Yo dije y acabamos a ver esa cuestión de ¿por qué quizás no está ineficiente?",
        "start": 2231.0,
        "end": 2236.0
    },
    {
        "text": " Fíjense que, por ejemplo, el conjunto 1, 2, 3.",
        "start": 2236.0,
        "end": 2239.0
    },
    {
        "text": " Hay muchos a bebé que lo puedan representar. No hay solo uno.",
        "start": 2239.0,
        "end": 2244.0
    },
    {
        "text": " Por ejemplo, podría ser este, ¿no?",
        "start": 2244.0,
        "end": 2246.0
    },
    {
        "text": " El 1, 2, 3.",
        "start": 2246.0,
        "end": 2247.0
    },
    {
        "text": " O el que tiene raíz 2 al izquierdo el 1, el derecha el 3,",
        "start": 2248.0,
        "end": 2251.0
    },
    {
        "text": " o el 1, 3, 2, así, o el 3, 1, 2, o el 3, 2, 1.",
        "start": 2251.0,
        "end": 2256.0
    },
    {
        "text": " Cualquiera de estos tiene los mismos elementos que el conjunto uno estén.",
        "start": 2256.0,
        "end": 2260.0
    },
    {
        "text": " No hay un solo bebé.",
        "start": 2260.0,
        "end": 2261.0
    },
    {
        "text": " ¿Y uniría esos malos o esos buenos?",
        "start": 2261.0,
        "end": 2264.0
    },
    {
        "text": " Vamos a mover.",
        "start": 2264.0,
        "end": 2265.0
    },
    {
        "text": " Yo creo que no es tan bueno.",
        "start": 2265.0,
        "end": 2266.0
    },
    {
        "text": " Yo creo que no es tan bueno.",
        "start": 2268.0,
        "end": 2269.0
    },
    {
        "text": " ¿Cuál le gustaría? Una diría y me gustaría este, ¿no?",
        "start": 2269.0,
        "end": 2272.0
    },
    {
        "text": " ¿Por qué?",
        "start": 2272.0,
        "end": 2273.0
    },
    {
        "text": " ¿Por qué sé que va a tener que recorrer menos?",
        "start": 2274.0,
        "end": 2277.0
    },
    {
        "text": " Recuernes que cuando inserto busco borro yo recorro un camino del árbol.",
        "start": 2277.0,
        "end": 2281.0
    },
    {
        "text": " ¿Qué me gustaría que ese camino sea lo más cortito posible?",
        "start": 2281.0,
        "end": 2284.0
    },
    {
        "text": " O sea que mientras el árbol esté más balanceado,",
        "start": 2284.0,
        "end": 2287.0
    },
    {
        "text": " o sea, vamos a decir así, o sea que tengan menos profundidad,",
        "start": 2287.0,
        "end": 2290.0
    },
    {
        "text": " es mejor, porque entonces va a recorrer menos pasos.",
        "start": 2290.0,
        "end": 2293.0
    },
    {
        "text": " Pero bueno, ¿de qué depende en qué árbol caiga de estos?",
        "start": 2293.0,
        "end": 2297.0
    },
    {
        "text": " Muy bien. De lo ordenen que una vez que ya escribí la corrimos insertar,",
        "start": 2299.0,
        "end": 2302.0
    },
    {
        "text": " depende el orden que lo caiga.",
        "start": 2302.0,
        "end": 2303.0
    },
    {
        "text": " Por si insic cargo.",
        "start": 2303.0,
        "end": 2304.0
    },
    {
        "text": " Primero el uno, después el dos y después el tres, ¿cuál es el dibujito?",
        "start": 2304.0,
        "end": 2308.0
    },
    {
        "text": " El primero.",
        "start": 2308.0,
        "end": 2309.0
    },
    {
        "text": " El primero.",
        "start": 2309.0,
        "end": 2310.0
    },
    {
        "text": " El peor caso que te vengan ordenada.",
        "start": 2310.0,
        "end": 2313.0
    },
    {
        "text": " El peor caso que te vengan ordenada.",
        "start": 2313.0,
        "end": 2315.0
    },
    {
        "text": " El peor caso de una bebé es que vamos a cargar los datos en el lado de hace datos.",
        "start": 2315.0,
        "end": 2318.0
    },
    {
        "text": " Por eso, a veces, si hace aliatoriza la entrada,",
        "start": 2318.0,
        "end": 2322.0
    },
    {
        "text": " también para que no tenga el cejo de cargar toda la información.",
        "start": 2322.0,
        "end": 2326.0
    },
    {
        "text": " Por ejemplo, cargo todos los estudiantes de todo ordenado en una bebé,",
        "start": 2326.0,
        "end": 2329.0
    },
    {
        "text": " me queda una lista.",
        "start": 2329.0,
        "end": 2330.0
    },
    {
        "text": " Entonces hay que mezclarlos un poco ante cargarlos para que más o menos",
        "start": 2331.0,
        "end": 2335.0
    },
    {
        "text": " en promedio me quede la altura logarín.",
        "start": 2335.0,
        "end": 2337.0
    },
    {
        "text": " Entonces depende el orden en que yo cargue los datos,",
        "start": 2337.0,
        "end": 2340.0
    },
    {
        "text": " va a ser el orden que va a salir esto que está acá.",
        "start": 2340.0,
        "end": 2343.0
    },
    {
        "text": " ¿Qué ordenes este, por ejemplo, van?",
        "start": 2343.0,
        "end": 2345.0
    },
    {
        "text": " Este.",
        "start": 2345.0,
        "end": 2346.0
    },
    {
        "text": " Carga el uno, me dicen ahí.",
        "start": 2351.0,
        "end": 2352.0
    },
    {
        "text": " El tres.",
        "start": 2354.0,
        "end": 2355.0
    },
    {
        "text": " Y después el dos, ¿no?",
        "start": 2356.0,
        "end": 2357.0
    },
    {
        "text": " Porque es mayor y es menor.",
        "start": 2357.0,
        "end": 2359.0
    },
    {
        "text": " O sea, que depende de eso.",
        "start": 2361.0,
        "end": 2362.0
    },
    {
        "text": " Bien.",
        "start": 2363.0,
        "end": 2364.0
    },
    {
        "text": " Acabo de decir, perdón.",
        "start": 2365.0,
        "end": 2367.0
    },
    {
        "text": " ¿Puedo domino esto?",
        "start": 2370.0,
        "end": 2371.0
    },
    {
        "text": " No, me ciel de algo.",
        "start": 2374.0,
        "end": 2375.0
    },
    {
        "text": " Acá.",
        "start": 2377.0,
        "end": 2378.0
    },
    {
        "text": " Insertar, buscar y borrar el lo mismo que una bebé.",
        "start": 2380.0,
        "end": 2382.0
    },
    {
        "text": " Entonces no lo voy a, no vamos a ver el algoritmo, pero ya lo vimos.",
        "start": 2382.0,
        "end": 2385.0
    },
    {
        "text": " Por más que el borrar era más complicado,",
        "start": 2385.0,
        "end": 2387.0
    },
    {
        "text": " porque cuando tenía un odito y era no vacío,",
        "start": 2387.0,
        "end": 2389.0
    },
    {
        "text": " tengo que el mínimo del suervo el derecho,",
        "start": 2389.0,
        "end": 2391.0
    },
    {
        "text": " el máximo el equipo, pero ya lo vimos.",
        "start": 2391.0,
        "end": 2393.0
    },
    {
        "text": " O sea, ese es el algoritmo.",
        "start": 2393.0,
        "end": 2394.0
    },
    {
        "text": " También será complicado, pero es lo que vimos.",
        "start": 2395.0,
        "end": 2397.0
    },
    {
        "text": " Ahora, ¿qué pasa con las operaciones binarias?",
        "start": 2397.0,
        "end": 2399.0
    },
    {
        "text": " Unión, intersección o diferencia, ¿no?",
        "start": 2401.0,
        "end": 2403.0
    },
    {
        "text": " Si tengo dos ABB, también,",
        "start": 2403.0,
        "end": 2406.0
    },
    {
        "text": " y quiero hacer la unión o la intersección de dos árboles.",
        "start": 2406.0,
        "end": 2411.0
    },
    {
        "text": " ¿Cómo haría?",
        "start": 2411.0,
        "end": 2412.0
    },
    {
        "text": " ¿Cara en el cargo o el elemento?",
        "start": 2415.0,
        "end": 2418.0
    },
    {
        "text": " Porque hasta ahora, yo creo que insertar,",
        "start": 2419.0,
        "end": 2422.0
    },
    {
        "text": " buscar y borrar uno diría en el peor caso,",
        "start": 2422.0,
        "end": 2424.0
    },
    {
        "text": " lo mismo que la lista, pero en el promedio parece ser mejor,",
        "start": 2424.0,
        "end": 2427.0
    },
    {
        "text": " porque la altura es más chica.",
        "start": 2427.0,
        "end": 2429.0
    },
    {
        "text": " Hasta ahí, hasta que diría que los árboles son mejores",
        "start": 2429.0,
        "end": 2431.0
    },
    {
        "text": " que la lista, me llamaría decir.",
        "start": 2431.0,
        "end": 2433.0
    },
    {
        "text": " Veamos ahora, siquiera hace un unión intersección de árbol,",
        "start": 2433.0,
        "end": 2436.0
    },
    {
        "text": " ¿cómo como haría intersección?",
        "start": 2436.0,
        "end": 2438.0
    },
    {
        "text": " Por ejemplo, ya que vimos el unión ahora, la intersección.",
        "start": 2438.0,
        "end": 2440.0
    },
    {
        "text": " ¿Cómo sé si tengo que cargar en este árbol?",
        "start": 2440.0,
        "end": 2443.0
    },
    {
        "text": " Un elemento dado estos dos árboles, ahí ve.",
        "start": 2443.0,
        "end": 2447.0
    },
    {
        "text": " ¿Eh?",
        "start": 2452.0,
        "end": 2453.0
    },
    {
        "text": " En la lista, ¿qué hacíamos?",
        "start": 2455.0,
        "end": 2456.0
    },
    {
        "text": " Mirábamos el primero y estábamos seguro de algo, ¿no?",
        "start": 2456.0,
        "end": 2459.0
    },
    {
        "text": " Si está ordenado, pues lo sabe que está en ordenado.",
        "start": 2459.0,
        "end": 2462.0
    },
    {
        "text": " Pero mirando del primero que se decíamos,",
        "start": 2462.0,
        "end": 2464.0
    },
    {
        "text": " el más chiquito no está en todo el otro conjunto.",
        "start": 2464.0,
        "end": 2466.0
    },
    {
        "text": " Y eso es la certeza absoluta.",
        "start": 2466.0,
        "end": 2468.0
    },
    {
        "text": " Ahora, ¿puedo hacer eso?",
        "start": 2468.0,
        "end": 2470.0
    },
    {
        "text": " No, porque no hay.",
        "start": 2470.0,
        "end": 2473.0
    },
    {
        "text": " Mirando, pues, una raíz es de A y B, ¿puedo decir algo?",
        "start": 2473.0,
        "end": 2476.0
    },
    {
        "text": " No, no.",
        "start": 2477.0,
        "end": 2479.0
    },
    {
        "text": " Y ese es el problema.",
        "start": 2479.0,
        "end": 2481.0
    },
    {
        "text": " El problema que tengo yo con esto.",
        "start": 2481.0,
        "end": 2484.0
    },
    {
        "text": " Pero está loco, tiene vida propia, va a dar ahí adelante.",
        "start": 2488.0,
        "end": 2491.0
    },
    {
        "text": " Todo va en paz adelante, ahora.",
        "start": 2496.0,
        "end": 2498.0
    },
    {
        "text": " Bueno, terminó la clase, ¿cuál es todo el final de la clase?",
        "start": 2498.0,
        "end": 2501.0
    },
    {
        "text": " Fíjense que si yo miró la raíz de un árbol, ¿por qué la raíz no me dice nada?",
        "start": 2503.0,
        "end": 2507.0
    },
    {
        "text": " Fíjense el conjunto 2-3. ¿Quién puede hacer la raíz de 1-2-3?",
        "start": 2507.0,
        "end": 2511.0
    },
    {
        "text": " O sea, ¿quién quiere?",
        "start": 2511.0,
        "end": 2513.0
    },
    {
        "text": " O sea, mirando el primer elemento no sea nada.",
        "start": 2513.0,
        "end": 2516.0
    },
    {
        "text": " Porque depende del orden que se cargaron,",
        "start": 2516.0,
        "end": 2518.0
    },
    {
        "text": " podrían llegar a hacer el 1 o el 2 o el 3.",
        "start": 2518.0,
        "end": 2520.0
    },
    {
        "text": " Entonces, ya perdí esa gran ventaja que tenía para saber eso que decían.",
        "start": 2520.0,
        "end": 2524.0
    },
    {
        "text": " Entonces, ya, si quiero hacer operaciones binarias,",
        "start": 2524.0,
        "end": 2527.0
    },
    {
        "text": " difícil que el árbol sea mejor con una lista.",
        "start": 2527.0,
        "end": 2530.0
    },
    {
        "text": " ¿Y una idea? ¿Bueno, ¿qué puedes hacer?",
        "start": 2530.0,
        "end": 2532.0
    },
    {
        "text": " Pasa el árbol a una lista ordenada y lo puedo hacer en orden N, a planar.",
        "start": 2532.0,
        "end": 2536.0
    },
    {
        "text": " ¿Ago lo mismo que el V, después de que le pongo la intersección?",
        "start": 2537.0,
        "end": 2541.0
    },
    {
        "text": " Sí, voy a saber que le he vendido la intersección en el mismo orden que la lista.",
        "start": 2541.0,
        "end": 2546.0
    },
    {
        "text": " Pero ¿qué quiero yo?",
        "start": 2546.0,
        "end": 2548.0
    },
    {
        "text": " Después voy a tener que transformar esa lista en un árbol, porque si quiero el árbol,",
        "start": 2548.0,
        "end": 2553.0
    },
    {
        "text": " quiero el árbol intersección en una lista.",
        "start": 2553.0,
        "end": 2555.0
    },
    {
        "text": " Entonces, sí.",
        "start": 2555.0,
        "end": 2557.0
    },
    {
        "text": " ¿Punto medio?",
        "start": 2562.0,
        "end": 2564.0
    },
    {
        "text": " Sí.",
        "start": 2564.0,
        "end": 2567.0
    },
    {
        "text": " No entendí.",
        "start": 2570.0,
        "end": 2572.0
    },
    {
        "text": " El punto medio sí lo puedo encontrar, pero después que hago con eso para una intersección.",
        "start": 2573.0,
        "end": 2578.0
    },
    {
        "text": " ¿Ago qué hacer como una bipartición bien equitativa?",
        "start": 2579.0,
        "end": 2582.0
    },
    {
        "text": " Sí, pero pasa que ahí cada vez buscar el punto medio del medio te va a costar, no es orden 1.",
        "start": 2582.0,
        "end": 2588.0
    },
    {
        "text": " Ya iba a perder la eficiencia de un ordené.",
        "start": 2588.0,
        "end": 2591.0
    },
    {
        "text": " O sea, lo puedo hacer, pero ya ese son.",
        "start": 2592.0,
        "end": 2595.0
    },
    {
        "text": " Entonces, la respuesta de la zona del árbol es mejor que elito, o sea, depende.",
        "start": 2595.0,
        "end": 2599.0
    },
    {
        "text": " Y claramente depende.",
        "start": 2599.0,
        "end": 2601.0
    },
    {
        "text": " En operaciones básicas, el árbol es mejor que una lista en el caso promedio,",
        "start": 2601.0,
        "end": 2605.0
    },
    {
        "text": " en el pieco caso, si igual.",
        "start": 2605.0,
        "end": 2607.0
    },
    {
        "text": " Pero en operaciones binarias es al revés.",
        "start": 2607.0,
        "end": 2609.0
    },
    {
        "text": " Entonces, no es que siempre le va a ganar un árbol bien en el busque a una lista ordenada.",
        "start": 2609.0,
        "end": 2613.0
    },
    {
        "text": " Entonces, depende para que la quiero usar.",
        "start": 2613.0,
        "end": 2615.0
    },
    {
        "text": " Si me conviene, no.",
        "start": 2615.0,
        "end": 2617.0
    },
    {
        "text": " ¿Sabía?",
        "start": 2617.0,
        "end": 2619.0
    },
    {
        "text": " Pensando en árboles, ¿qué son los mejores árboles?",
        "start": 2619.0,
        "end": 2622.0
    },
    {
        "text": " Y ya voy una mini introducción, pero esto va a continuar la clase que viene, porque voy a ir a Hashina ore.",
        "start": 2622.0,
        "end": 2627.0
    },
    {
        "text": " ¿Qué quisiera un árbol bien en el busque?",
        "start": 2627.0,
        "end": 2629.0
    },
    {
        "text": " Hay una quisiera que sea a medida que lo va cargando lo más perfecto posible.",
        "start": 2629.0,
        "end": 2633.0
    },
    {
        "text": " Una árbol perfecta de altura a la tercera sería bueno decir, tengo todos estos nodos, ¿no?",
        "start": 2633.0,
        "end": 2638.0
    },
    {
        "text": " O sea, tan todos cargados y no tengo ninguna...",
        "start": 2638.0,
        "end": 2640.0
    },
    {
        "text": " Entonces, una diría se distribuye en lo mejor posible.",
        "start": 2640.0,
        "end": 2643.0
    },
    {
        "text": " Si no tiene una árbol perfecta de altura H, es fácil contar los nodos, ponéis de cuántos nodos...",
        "start": 2643.0,
        "end": 2649.0
    },
    {
        "text": " O sea, el N acá, ¿no? ¿Cuántos nodos tiene este árbol?",
        "start": 2649.0,
        "end": 2651.0
    },
    {
        "text": " Y uno diría la raíz, es uno.",
        "start": 2651.0,
        "end": 2653.0
    },
    {
        "text": " Después la raíz tiene dos hijos, dos a la uno.",
        "start": 2653.0,
        "end": 2657.0
    },
    {
        "text": " Cada uno de estos, si están los dos tiene dos a la dos, o sea, cuatro.",
        "start": 2657.0,
        "end": 2660.0
    },
    {
        "text": " ¿No? Acá cuatro. Después que tiene ocho.",
        "start": 2660.0,
        "end": 2663.0
    },
    {
        "text": " O sea, que si está todo perfecto hasta la altura H, es la sumatoria de los dos a la I.",
        "start": 2663.0,
        "end": 2668.0
    },
    {
        "text": " ¿Y la sumatoria de los dos a la I?",
        "start": 2669.0,
        "end": 2672.0
    },
    {
        "text": " Hasta H es dos a la H más uno, menos uno.",
        "start": 2672.0,
        "end": 2675.0
    },
    {
        "text": " ¿No? La pueden hacer en lógica que se lló.",
        "start": 2675.0,
        "end": 2678.0
    },
    {
        "text": " O sea, que la sumatoria de todo esto me dice, mira, N en lo mismo que esto.",
        "start": 2678.0,
        "end": 2683.0
    },
    {
        "text": " Pero si de espejo el H de la carrera, claramente ahí sí, aplicó el lugar y me queda...",
        "start": 2683.0,
        "end": 2687.0
    },
    {
        "text": " Entonces, el altura es el lugar y me pasó de N, más o menos constantemente,",
        "start": 2687.0,
        "end": 2690.0
    },
    {
        "text": " no importa el lugar y me pasó de N.",
        "start": 2690.0,
        "end": 2692.0
    },
    {
        "text": " Secilá, lo que tiene este formato, lo que quiero mostrar es que el camino más largo es el lugar y N.",
        "start": 2692.0,
        "end": 2696.0
    },
    {
        "text": " Unisí, ¿cómo mantengo este formato?",
        "start": 2697.0,
        "end": 2699.0
    },
    {
        "text": " Y cuando agreguen uno más, se me rompe.",
        "start": 2699.0,
        "end": 2701.0
    },
    {
        "text": " Vamos a ver qué tanto lo puedo romper manteniendo casi la perfección.",
        "start": 2701.0,
        "end": 2705.0
    },
    {
        "text": " ¿Tá?",
        "start": 2706.0,
        "end": 2707.0
    },
    {
        "text": " El otro escenario es el peor.",
        "start": 2707.0,
        "end": 2709.0
    },
    {
        "text": " La lista, ¿no? Cuando inserto todo ordenado, le mostré el mejor y ahora le mostré el peor.",
        "start": 2710.0,
        "end": 2715.0
    },
    {
        "text": " Está bien, el cual uno no quiere caer.",
        "start": 2715.0,
        "end": 2717.0
    },
    {
        "text": " Entonces, lo que vamos a ver, la clase que viene es cómo acercarme esa perfección.",
        "start": 2717.0,
        "end": 2722.0
    },
    {
        "text": " Con algo que se llama los árboles balanceados, vamos a ver un tipo que se llama los árboles ABL.",
        "start": 2722.0,
        "end": 2727.0
    },
    {
        "text": " Lo sabe ABL que van a hacer lo mismo que una AB, va a tener una propiedad de orden,",
        "start": 2728.0,
        "end": 2733.0
    },
    {
        "text": " los menor de un lado y los mayores del otro, pero van a agregar una segunda propiedad,",
        "start": 2733.0,
        "end": 2737.0
    },
    {
        "text": " una propiedad de la estructura, no de orden.",
        "start": 2737.0,
        "end": 2740.0
    },
    {
        "text": " Que para cada uno del árbol la altura de su árbol izquierdo y derecho pueden diferir a los sumos en un unidad.",
        "start": 2741.0,
        "end": 2746.0
    },
    {
        "text": " O son iguales o más menos uno.",
        "start": 2747.0,
        "end": 2749.0
    },
    {
        "text": " No es la perfección, pero se acercan.",
        "start": 2750.0,
        "end": 2753.0
    },
    {
        "text": " Y vamos a ver que los algoritmos que van a tener eso aquí en eso.",
        "start": 2753.0,
        "end": 2757.0
    },
    {
        "text": " El agrear y el borrar van a hacerlo responsable, no solo de mantenerlo como ABB,",
        "start": 2758.0,
        "end": 2765.0
    },
    {
        "text": " como ya les costaba el insertario al borrar hacerlo,",
        "start": 2766.0,
        "end": 2769.0
    },
    {
        "text": " si no ahora mantení esta segunda propiedad que cada vez que inserte no borre para cada nodo,",
        "start": 2769.0,
        "end": 2773.0
    },
    {
        "text": " no me modifique ese balanceo, la diferencia de alturas.",
        "start": 2773.0,
        "end": 2779.0
    },
    {
        "text": " ¿Por qué? Porque yo puedo demostrar como acá que si yo le doy más menos el margen de uno a cada altura de cada nodo,",
        "start": 2779.0,
        "end": 2787.0
    },
    {
        "text": " la altura sigue siendo logaritmo.",
        "start": 2787.0,
        "end": 2789.0
    },
    {
        "text": " En el peor caso, insertar o buscar y borrar va a hacerlo.",
        "start": 2789.0,
        "end": 2792.0
    },
    {
        "text": " Los algoritmos son un poquito más complicados.",
        "start": 2793.0,
        "end": 2795.0
    },
    {
        "text": " ¿Pues se le voy a dejar para la clase que viene?",
        "start": 2796.0,
        "end": 2798.0
    },
    {
        "text": " Y bueno, ese tipo de algoritmos balanceados que lo vamos a ver a la clase bien,",
        "start": 2802.0,
        "end": 2805.0
    },
    {
        "text": " después si uno lo generaliza,",
        "start": 2805.0,
        "end": 2807.0
    },
    {
        "text": " en vez de tener dos binarios, le doy una amplitude, por ejemplo, 256,",
        "start": 2807.0,
        "end": 2812.0
    },
    {
        "text": " que es lo que pueden entrar en un bloque de disco.",
        "start": 2812.0,
        "end": 2814.0
    },
    {
        "text": " Para eso, a su vez, otro lo que he disco,",
        "start": 2815.0,
        "end": 2817.0
    },
    {
        "text": " capas que en tres niveles, llevo guardar 1,000,000 de nodos,",
        "start": 2817.0,
        "end": 2821.0
    },
    {
        "text": " y entonces capas que las dos primeras nodos capas, que son pocas,",
        "start": 2821.0,
        "end": 2826.0
    },
    {
        "text": " 400 nodos que se lo tengo en memoria y lo otro que es más pesado lo tengo en disco.",
        "start": 2826.0,
        "end": 2832.0
    },
    {
        "text": " Entonces, para acceder en un camino hacia algo tengo 3, 4 nodos,",
        "start": 2832.0,
        "end": 2836.0
    },
    {
        "text": " 3, 4 acceso, 2 en memoria y a lo sumo unos 2 en disco,",
        "start": 2836.0,
        "end": 2840.0
    },
    {
        "text": " accedo a un dato en un millón de datos.",
        "start": 2840.0,
        "end": 2842.0
    },
    {
        "text": " Eso es una base de datos.",
        "start": 2843.0,
        "end": 2845.0
    },
    {
        "text": " Pero vamos a arrancar con los binarios simple primero que lo dejo para la clase bien.",
        "start": 2845.0,
        "end": 2850.0
    },
    {
        "text": " Vamos, entonces, la segunda hora, a ver la técnica esa que va a tratar de captar",
        "start": 2853.0,
        "end": 2860.0
    },
    {
        "text": " lo mejor de la lista y lo mejor de la reload bits.",
        "start": 2860.0,
        "end": 2863.0
    },
    {
        "text": " Está bien, tratando de ver cómo generó algo que se llama Hashin.",
        "start": 2864.0,
        "end": 2869.0
    },
    {
        "text": " Entonces, vamos a focalizarnos fuertemente en estas 3 operaciones para explicar",
        "start": 2870.0,
        "end": 2875.0
    },
    {
        "text": " porque las otras se pueden agregar e anot, insertar, borrar y pertenirse.",
        "start": 2875.0,
        "end": 2878.0
    },
    {
        "text": " Altas bajas y consultas.",
        "start": 2878.0,
        "end": 2880.0
    },
    {
        "text": " Entonces, lo que vimos hasta ahora, como opciones son las más simples,",
        "start": 2880.0,
        "end": 2885.0
    },
    {
        "text": " terminalista, pero para insertar algo que hay borrar inicomparaciones, orden en in,",
        "start": 2885.0,
        "end": 2891.0
    },
    {
        "text": " una bebé, también en promedio y logarismo, pero peor caso igual que la lista, orden en in,",
        "start": 2891.0,
        "end": 2898.0
    },
    {
        "text": " y la otra que vimos en el otro extremo de mejor, en la reload bits,",
        "start": 2899.0,
        "end": 2903.0
    },
    {
        "text": " donde prendía los unos y los 0, por ejemplo digo si ese de 0 estuvo,",
        "start": 2903.0,
        "end": 2908.0
    },
    {
        "text": " entonces 0 está en el conjunto S, si me da false no está, ¿no?",
        "start": 2908.0,
        "end": 2914.0
    },
    {
        "text": " Esa tiene la ventaja que tiene orden 1 para toda esa, pero con las restricciones.",
        "start": 2914.0,
        "end": 2920.0
    },
    {
        "text": " Recorremos la restricción, entonces, de esta implementación, ¿cuál es Seran?",
        "start": 2920.0,
        "end": 2924.0
    },
    {
        "text": " La memoria, el acotado y me está falando la más importante.",
        "start": 2925.0,
        "end": 2932.0
    },
    {
        "text": " No puedo guardar, el tipo de los elementos tiene que ser un subrango de las naturales.",
        "start": 2932.0,
        "end": 2938.0
    },
    {
        "text": " No puede ser estrina, reales, arritrarios, enteros, arritrarios.",
        "start": 2938.0,
        "end": 2942.0
    },
    {
        "text": " Por otro lado, tiene la eficiencia de todo eso los en orden 1.",
        "start": 2942.0,
        "end": 2947.0
    },
    {
        "text": " Las listas, a su vez, el elemento de lo que vos quiera, también,",
        "start": 2947.0,
        "end": 2951.0
    },
    {
        "text": " la memoria, la manejo proporcional a lo que se va a cargar y no a lo que podría venir,",
        "start": 2951.0,
        "end": 2956.0
    },
    {
        "text": " pero soy media lenta para insertar buscar y borrar.",
        "start": 2956.0,
        "end": 2960.0
    },
    {
        "text": " ¿Qué quiero combinar las dos? ¿Qué quiere decir combinar las dos?",
        "start": 2960.0,
        "end": 2964.0
    },
    {
        "text": " ¿Tipo elemento lo que sea? Porque si una base de datos quiero poder cargar lo que sea.",
        "start": 2964.0,
        "end": 2970.0
    },
    {
        "text": " Se va a aparecer entonces era lista. ¿Verdad?",
        "start": 2970.0,
        "end": 2974.0
    },
    {
        "text": " En principio no acotado, o da una acota y se flexible.",
        "start": 2974.0,
        "end": 2978.0
    },
    {
        "text": " Vamos a ver cómo es eso, también acota y se flexible.",
        "start": 2978.0,
        "end": 2982.0
    },
    {
        "text": " Estimáme la base de datos y va a empezar a la primera estructura donde yo he tenido que empezar a aproximarme con cosas probabilísticas.",
        "start": 2982.0,
        "end": 2989.0
    },
    {
        "text": " Decime el tamaño en tu base de datos, después la ajustamos, pero decime para que yo la creéis y después va creciendo,",
        "start": 2989.0,
        "end": 2995.0
    },
    {
        "text": " yo te lo voy ajustando, vamos a ver cómo. Pero va a haber una medida de estimación.",
        "start": 2995.0,
        "end": 3000.0
    },
    {
        "text": " ¿Verdad? Y la eficiencia que quiero, y bueno, acercate al orden 1",
        "start": 3000.0,
        "end": 3005.0
    },
    {
        "text": " para insertar buscar y borrar, pero no es el percaso en el promedio.",
        "start": 3005.0,
        "end": 3009.0
    },
    {
        "text": " Entonces vamos a ver qué depende que yo en promedio pueda insertar buscar y borrar en orden 1.",
        "start": 3009.0,
        "end": 3014.0
    },
    {
        "text": " Entonces, ahí tengo casi lo mejor de los de lado, ¿no? ¿Tipo elemento?",
        "start": 3014.0,
        "end": 3017.0
    },
    {
        "text": " Y en la memoria, un balance.",
        "start": 3017.0,
        "end": 3021.0
    },
    {
        "text": " Agamos un uso de la memoria, lo más cercano a la lista, pero tampoco voy a poder conseguir toda la lista.",
        "start": 3021.0,
        "end": 3026.0
    },
    {
        "text": " Ahí el gobé tiene que desperdiciar.",
        "start": 3026.0,
        "end": 3028.0
    },
    {
        "text": " Bueno, empecemos a ver eso. Entonces, en vez de tener que consiste la técnica de hash, bueno, voy a tener una rai.",
        "start": 3029.0,
        "end": 3037.0
    },
    {
        "text": " Como si fuera la reloviz, voy a tener una rai. Voy a tener acceso directo sí, pero no por elemento.",
        "start": 3037.0,
        "end": 3044.0
    },
    {
        "text": " Es como que voy a tener, de alguna manera, una rai, lo que voy a llamar la tabla de hash o buckets o lo que viene a llamar.",
        "start": 3044.0,
        "end": 3053.0
    },
    {
        "text": " Y voy a tener una función, ya vemos la h, la función de hash, que acá de elemento,",
        "start": 3054.0,
        "end": 3059.0
    },
    {
        "text": " si es el elemento, clave elemento, le va a asignar una posición de esa rai.",
        "start": 3059.0,
        "end": 3064.0
    },
    {
        "text": " Antes, cada elemento iba con un único lugar.",
        "start": 3064.0,
        "end": 3066.0
    },
    {
        "text": " No, decía el día lunes va a la posición 1 porque no había 2 que colisionar acá.",
        "start": 3066.0,
        "end": 3074.0
    },
    {
        "text": " Voy a pensar que cada elemento le va a tocar una posición de este...",
        "start": 3074.0,
        "end": 3078.0
    },
    {
        "text": " Entonces, para dar un ejemplo, aunque no sea eficiente para visualizar, supongan seguir que quiero guardar strings.",
        "start": 3078.0,
        "end": 3084.0
    },
    {
        "text": " Y mi función de hash va a decir, todos los que empiezan con A, toma la primera letra de la palabra,",
        "start": 3084.0,
        "end": 3090.0
    },
    {
        "text": " le asina la misma posición, todos los que empiezan con B, otra, C, otra.",
        "start": 3090.0,
        "end": 3095.0
    },
    {
        "text": " Cuando yo vi instarta, te toca A, andata el lugar, toca B, es para mal que no es eficiente eso, pero para tener una idea clara",
        "start": 3095.0,
        "end": 3102.0
    },
    {
        "text": " que puede haber dos nombres distintos con A y la función de hash le dicen ustedes dos o ya juntos.",
        "start": 3102.0,
        "end": 3108.0
    },
    {
        "text": " Los clasificados.",
        "start": 3108.0,
        "end": 3109.0
    },
    {
        "text": " Los clasificados.",
        "start": 3109.0,
        "end": 3111.0
    },
    {
        "text": " La forma de clasificar que es tan simple, que es la primera letra, es muy eficiente, pero es fácil de visualizar que...",
        "start": 3111.0,
        "end": 3119.0
    },
    {
        "text": " ¿Está bien? ¿Qué quiere decir que los clasificados y que pueden colisionar A, A y Alejandro le va a tocar el mismo lugar?",
        "start": 3119.0,
        "end": 3125.0
    },
    {
        "text": " Se llama una colisión, porque son dos elementos distintos, no hay que estar repetidos.",
        "start": 3125.0,
        "end": 3129.0
    },
    {
        "text": " A, a, a, a, Alejandro no son dos elementos distintos, los免is que hayan dices, ustedes van juntos.",
        "start": 3129.0,
        "end": 3133.0
    },
    {
        "text": " Es como que...",
        "start": 3133.0,
        "end": 3135.0
    },
    {
        "text": " Me voy a borrar un poquito acá.",
        "start": 3135.0,
        "end": 3137.0
    },
    {
        "text": " ¿Pues que voy a dar acá?",
        "start": 3141.0,
        "end": 3143.0
    },
    {
        "text": " Es como que lo que estoy haciendo es que...",
        "start": 3146.0,
        "end": 3149.0
    },
    {
        "text": " Pense masino, el conjunto o el universo,",
        "start": 3149.0,
        "end": 3152.0
    },
    {
        "text": " yo lo voy a como a particionar.",
        "start": 3152.0,
        "end": 3155.0
    },
    {
        "text": " En pedacitos.",
        "start": 3156.0,
        "end": 3158.0
    },
    {
        "text": " Y voy a tener una función de hash que acá de elemento, cadestrín, posible supongan C,",
        "start": 3162.0,
        "end": 3167.0
    },
    {
        "text": " le va a decir ustedes todos los que empiecen con A bien en acá, cada vez que se insertan uno con A bien acá,",
        "start": 3167.0,
        "end": 3173.0
    },
    {
        "text": " todos los que empiecen con B, con C, con Z, ¿tabían?",
        "start": 3173.0,
        "end": 3177.0
    },
    {
        "text": " Y lo particiona, si pienso en la letra, veintiséis letras, ¿tabían?",
        "start": 3177.0,
        "end": 3181.0
    },
    {
        "text": " Después vamos a ver que me comienes tener muchas más, pero para que sea una idea,",
        "start": 3181.0,
        "end": 3184.0
    },
    {
        "text": " que voy a tener entonces una estrategia de resolución de colisiones,",
        "start": 3184.0,
        "end": 3188.0
    },
    {
        "text": " ¿qué pasa cuando inserto dos palabras que empiezan con las mismas letras,",
        "start": 3188.0,
        "end": 3191.0
    },
    {
        "text": " que les toca el mismo lugar que hago, como el arreglo se los mete a los dos.",
        "start": 3191.0,
        "end": 3196.0
    },
    {
        "text": " Vamos a ver qué es lo que puede hacer, hay más de una solución.",
        "start": 3196.0,
        "end": 3201.0
    },
    {
        "text": " Primera recondicion, a ver si los en poco tiempo logros que entiendan la idea,",
        "start": 3201.0,
        "end": 3206.0
    },
    {
        "text": " todavía no está la idea, sabemos que es esto que es, vamos a ver.",
        "start": 3206.0,
        "end": 3210.0
    },
    {
        "text": " Esta función de hash, primera de esta función, tiene que ser rápida,",
        "start": 3210.0,
        "end": 3214.0
    },
    {
        "text": " si no no voy a llegar al orden de los momentos, entonces tiene que depender solamente de la clave,",
        "start": 3214.0,
        "end": 3218.0
    },
    {
        "text": " no puede hacer cuentas complicadas, una condición, fácil de computar rápida",
        "start": 3218.0,
        "end": 3223.0
    },
    {
        "text": " y debe minimizar las colisiones, ahí ya se puso complicada.",
        "start": 3223.0,
        "end": 3227.0
    },
    {
        "text": " ¿Qué quiere decir, debe minimizar las colisiones?",
        "start": 3227.0,
        "end": 3230.0
    },
    {
        "text": " Que cuando yo voy agregando elementos, piensen así, uno diría,",
        "start": 3230.0,
        "end": 3234.0
    },
    {
        "text": " minimizar las colisiones que la probabilidad que le toque cualquiera de estos lugares",
        "start": 3234.0,
        "end": 3238.0
    },
    {
        "text": " sea el mismo, cualquier estrés.",
        "start": 3238.0,
        "end": 3241.0
    },
    {
        "text": " Y ya veo que mi función es a que toma la primera letra, no es porque,",
        "start": 3241.0,
        "end": 3246.0
    },
    {
        "text": " y hay que saber que miren la lista de contactos que tienen este celular,",
        "start": 3246.0,
        "end": 3250.0
    },
    {
        "text": " no son la misma cantidad de contactos de una letra que queda otra,",
        "start": 3250.0,
        "end": 3254.0
    },
    {
        "text": " y letras mucho más repetidas, la W seguramente tendrán un contacto con su arte,",
        "start": 3254.0,
        "end": 3259.0
    },
    {
        "text": " pero hay otras que tienen mucho más, la distribución es diferente.",
        "start": 3259.0,
        "end": 3264.0
    },
    {
        "text": " De tomar su de la primera letra, puede hacer que sea muy poco equitativo, digamos.",
        "start": 3264.0,
        "end": 3270.0
    },
    {
        "text": " La distribución no sea uniforme, es su de la decidenya en probabilidad.",
        "start": 3270.0,
        "end": 3273.0
    },
    {
        "text": " Entonces, vamos a ver cómo hago para minimizar las condiciones.",
        "start": 3273.0,
        "end": 3277.0
    },
    {
        "text": " ¿Por qué? Y vamos a mover, porque después cuando voy a buscar un elemento",
        "start": 3277.0,
        "end": 3281.0
    },
    {
        "text": " dentro de esa colisión, como le encuentro rápido, este es un poco el idea.",
        "start": 3281.0,
        "end": 3285.0
    },
    {
        "text": " Condiciones, por ahora condiciones, ya vamos a llegar al mapita a eso.",
        "start": 3285.0,
        "end": 3290.0
    },
    {
        "text": " Bien, una posible función de hash, supongan que yo le digo que las claves son de dos tipos,",
        "start": 3290.0,
        "end": 3297.0
    },
    {
        "text": " en general, con los elementos, son o números o estrins.",
        "start": 3297.0,
        "end": 3301.0
    },
    {
        "text": " En una base de datos, en un banco, lo que sea siempre números o strings.",
        "start": 3301.0,
        "end": 3306.0
    },
    {
        "text": " Entonces, pensemos por ahora que son números.",
        "start": 3306.0,
        "end": 3309.0
    },
    {
        "text": " Y supongan que todos los números son igualmente probables.",
        "start": 3309.0,
        "end": 3312.0
    },
    {
        "text": " La probabilidad que yo voy a iniciar cualquier número de un elemento,",
        "start": 3312.0,
        "end": 3317.0
    },
    {
        "text": " no ha cotado, por eso cualquier entero es la misma.",
        "start": 3317.0,
        "end": 3320.0
    },
    {
        "text": " Entonces, yo podría decir, si tengo una tabla de tamaño m,",
        "start": 3320.0,
        "end": 3323.0
    },
    {
        "text": " yo destimo que voy a tener m, el elemento es mi conjunto,",
        "start": 3323.0,
        "end": 3327.0
    },
    {
        "text": " entonces, mi simple función de hash, lo que va a hacer es al número que te venga,",
        "start": 3327.0,
        "end": 3331.0
    },
    {
        "text": " acelé módulo m, el porcentaje es en semas más.",
        "start": 3331.0,
        "end": 3336.0
    },
    {
        "text": " ¿Qué hace eso? Se queda con el resto de la división entera al dividirlo por m,",
        "start": 3336.0,
        "end": 3340.0
    },
    {
        "text": " hace me dar un número entre 0 y m menos 1.",
        "start": 3340.0,
        "end": 3343.0
    },
    {
        "text": " Me da 0 si es división exacta, o el resto.",
        "start": 3344.0,
        "end": 3347.0
    },
    {
        "text": " Entonces, imitable, la tiene tamaño m justo y lo que necesito,",
        "start": 3347.0,
        "end": 3350.0
    },
    {
        "text": " una posición de 0 a m menos 1.",
        "start": 3350.0,
        "end": 3352.0
    },
    {
        "text": " O sea, para cualquier entero, lo que dice esto es de hoy,",
        "start": 3352.0,
        "end": 3355.0
    },
    {
        "text": " una posición calculándola con el módulo.",
        "start": 3355.0,
        "end": 3358.0
    },
    {
        "text": " Si son todos igualmente probables los caques me pueden venir,",
        "start": 3358.0,
        "end": 3361.0
    },
    {
        "text": " alguno le toca la posición 5 o otra 20.",
        "start": 3361.0,
        "end": 3364.0
    },
    {
        "text": " Lo peor que me puede pasar es que todos vengan, por ejemplo,",
        "start": 3364.0,
        "end": 3367.0
    },
    {
        "text": " múltiples del mismo m. Entonces, ahí sí, van a todos colisionar,",
        "start": 3367.0,
        "end": 3370.0
    },
    {
        "text": " porque todo le va a tocar, le va a decir, andad la posición 5",
        "start": 3370.0,
        "end": 3372.0
    },
    {
        "text": " o la posición 5 o la posición 5.",
        "start": 3372.0,
        "end": 3374.0
    },
    {
        "text": " Bueno, ahí tengo un problema.",
        "start": 3374.0,
        "end": 3377.0
    },
    {
        "text": " ¿Por qué? Porque quiero que minimise colisiones.",
        "start": 3377.0,
        "end": 3379.0
    },
    {
        "text": " Es decir, ¿por qué? Vamos a ver, ¿por qué quiero minimizar colisiones?",
        "start": 3379.0,
        "end": 3382.0
    },
    {
        "text": " ¿Presentí en el que todavía se podría hacer una función de hash",
        "start": 3382.0,
        "end": 3384.0
    },
    {
        "text": " para simplemente para enteros?",
        "start": 3384.0,
        "end": 3387.0
    },
    {
        "text": " ¿Qué podría tener el caso de que sean caracteres?",
        "start": 3388.0,
        "end": 3391.0
    },
    {
        "text": " Y bueno, yo recién dije, el código aquí, el primer caracter.",
        "start": 3391.0,
        "end": 3394.0
    },
    {
        "text": " Pero eso puede ser muy poco equitativo,",
        "start": 3394.0,
        "end": 3396.0
    },
    {
        "text": " porque la distribución no es uniforme.",
        "start": 3396.0,
        "end": 3399.0
    },
    {
        "text": " Entonces, ¿qué puedo tomar? Y toma todos los caracteres.",
        "start": 3400.0,
        "end": 3402.0
    },
    {
        "text": " No te quede con el primero.",
        "start": 3402.0,
        "end": 3404.0
    },
    {
        "text": " Su mal código aquí, de todos los caracteres la palabra,",
        "start": 3404.0,
        "end": 3406.0
    },
    {
        "text": " entonces ahí ya se empiezan a equipar, ¿no?",
        "start": 3406.0,
        "end": 3408.0
    },
    {
        "text": " La con la B, entonces ya A, la y Alejandro son distintos.",
        "start": 3408.0,
        "end": 3412.0
    },
    {
        "text": " ¿Estab bien?",
        "start": 3412.0,
        "end": 3414.0
    },
    {
        "text": " Se entiende, y ahí funciona y haya libros entera",
        "start": 3414.0,
        "end": 3417.0
    },
    {
        "text": " de escrita de función de hash, porque incluso depende del idioma.",
        "start": 3417.0,
        "end": 3419.0
    },
    {
        "text": " La frecuencia de currencia de letras en palabra",
        "start": 3419.0,
        "end": 3422.0
    },
    {
        "text": " español inglés es un distinto.",
        "start": 3422.0,
        "end": 3424.0
    },
    {
        "text": " ¿Estab bien?",
        "start": 3425.0,
        "end": 3426.0
    },
    {
        "text": " La probabilidad de currencia de una letra,",
        "start": 3426.0,
        "end": 3428.0
    },
    {
        "text": " una posición de una palabra, un idioma es distinta,",
        "start": 3428.0,
        "end": 3430.0
    },
    {
        "text": " entonces está tabulado, entonces eso puede usar funciones",
        "start": 3430.0,
        "end": 3433.0
    },
    {
        "text": " y los manejabales usan funciones bastante sofisticadas,",
        "start": 3433.0,
        "end": 3437.0
    },
    {
        "text": " digamos, que tienen que ver con la probabilidad de",
        "start": 3437.0,
        "end": 3439.0
    },
    {
        "text": " currencia de letras y todo.",
        "start": 3439.0,
        "end": 3441.0
    },
    {
        "text": " Pero a priori piensen así, sumo los códigos aquí",
        "start": 3442.0,
        "end": 3445.0
    },
    {
        "text": " de la característica y me da un número.",
        "start": 3445.0,
        "end": 3446.0
    },
    {
        "text": " Eso puede ser una posición.",
        "start": 3446.0,
        "end": 3447.0
    },
    {
        "text": " Y después si tengo una tal tamaño M,",
        "start": 3447.0,
        "end": 3449.0
    },
    {
        "text": " hago Modulo M, me da un valor entre 0 y M-1.",
        "start": 3449.0,
        "end": 3452.0
    },
    {
        "text": " Para que caiga, por ahora, por mis objetivos,",
        "start": 3453.0,
        "end": 3455.0
    },
    {
        "text": " por lo menos que cuando voy a decir a dónde te toca,",
        "start": 3455.0,
        "end": 3457.0
    },
    {
        "text": " que me diga entre 0 y M-1.",
        "start": 3457.0,
        "end": 3459.0
    },
    {
        "text": " Si la tabla es tamaño M, para que sea una posición",
        "start": 3459.0,
        "end": 3462.0
    },
    {
        "text": " de la regla. ¿Sentiendes?",
        "start": 3462.0,
        "end": 3463.0
    },
    {
        "text": " Vamos a ver cómo logro que eso sea justamente",
        "start": 3463.0,
        "end": 3467.0
    },
    {
        "text": " minimise colisiones.",
        "start": 3467.0,
        "end": 3468.0
    },
    {
        "text": " La estrategia que vamos a ver hay dos,",
        "start": 3471.0,
        "end": 3474.0
    },
    {
        "text": " pero la más común y la más frecuente,",
        "start": 3474.0,
        "end": 3476.0
    },
    {
        "text": " la otra más histórica, es cuando hay colisiones",
        "start": 3476.0,
        "end": 3479.0
    },
    {
        "text": " y acá donde empieza a ver el libro entre",
        "start": 3480.0,
        "end": 3482.0
    },
    {
        "text": " el Arrelo bits y las listas.",
        "start": 3482.0,
        "end": 3484.0
    },
    {
        "text": " Cuando colisionan dos en este lugar,",
        "start": 3485.0,
        "end": 3488.0
    },
    {
        "text": " a dos le dio esta posición, los pongo como noditos",
        "start": 3488.0,
        "end": 3491.0
    },
    {
        "text": " de una lista.",
        "start": 3491.0,
        "end": 3492.0
    },
    {
        "text": " O sea que el Arrelo es un Arrelo de listas.",
        "start": 3492.0,
        "end": 3493.0
    },
    {
        "text": " Y ala y Alejandro, si los dos tenía la función de",
        "start": 3494.0,
        "end": 3498.0
    },
    {
        "text": " jage que tomaba solo la primera letra,",
        "start": 3498.0,
        "end": 3500.0
    },
    {
        "text": " les tocó este lugar.",
        "start": 3500.0,
        "end": 3502.0
    },
    {
        "text": " ¿Sentiendes? ¿Por qué están acá?",
        "start": 3502.0,
        "end": 3504.0
    },
    {
        "text": " No porque son iguales,",
        "start": 3504.0,
        "end": 3505.0
    },
    {
        "text": " sino porque la función de jage dijo que ustedes",
        "start": 3505.0,
        "end": 3507.0
    },
    {
        "text": " dos van ahí.",
        "start": 3507.0,
        "end": 3508.0
    },
    {
        "text": " ¿Sentiendes?",
        "start": 3508.0,
        "end": 3510.0
    },
    {
        "text": " acá estará solito el que le tocó esta posición",
        "start": 3510.0,
        "end": 3514.0
    },
    {
        "text": " y acá si hay tres nuevos, ¿es por qué?",
        "start": 3514.0,
        "end": 3517.0
    },
    {
        "text": " ¿Por qué?",
        "start": 3517.0,
        "end": 3520.0
    },
    {
        "text": " A tres elementos distintos, la función de jage",
        "start": 3520.0,
        "end": 3524.0
    },
    {
        "text": " y la signón mismo lugar.",
        "start": 3524.0,
        "end": 3526.0
    },
    {
        "text": " ¿Ok?",
        "start": 3526.0,
        "end": 3527.0
    },
    {
        "text": " Ahora si vamos ahora entendiendo, ¿qué les gustaría",
        "start": 3527.0,
        "end": 3531.0
    },
    {
        "text": " de estas listas?",
        "start": 3531.0,
        "end": 3532.0
    },
    {
        "text": " Que no sean muy grandes.",
        "start": 3532.0,
        "end": 3535.0
    },
    {
        "text": " Porque porque yo después cuando voy a buscar un elemento,",
        "start": 3536.0,
        "end": 3539.0
    },
    {
        "text": " ¿qué le voy a aplicar la función de jage",
        "start": 3539.0,
        "end": 3541.0
    },
    {
        "text": " y si no si estás, estás, por ejemplo,",
        "start": 3541.0,
        "end": 3544.0
    },
    {
        "text": " acá.",
        "start": 3544.0,
        "end": 3547.0
    },
    {
        "text": " Y entonces vengo y busco esta lista, si esta lista es chiquita,",
        "start": 3547.0,
        "end": 3550.0
    },
    {
        "text": " es más, si hay uno solo, en orden uno,",
        "start": 3550.0,
        "end": 3552.0
    },
    {
        "text": " puedo saber si está un etal de elemento.",
        "start": 3552.0,
        "end": 3554.0
    },
    {
        "text": " Acá tendré que chequear entre dos, pero ¿sabes?",
        "start": 3554.0,
        "end": 3559.0
    },
    {
        "text": " Es poco.",
        "start": 3559.0,
        "end": 3560.0
    },
    {
        "text": " Entonces, ¿qué me gustaría?",
        "start": 3560.0,
        "end": 3561.0
    },
    {
        "text": " El dijo que las listas sean lo más chicas posible.",
        "start": 3561.0,
        "end": 3566.0
    },
    {
        "text": " ¿Estab bien?",
        "start": 3566.0,
        "end": 3569.0
    },
    {
        "text": " ¿Estab bien?",
        "start": 3569.0,
        "end": 3572.0
    },
    {
        "text": " Una de ellas que las listas apribicían parejas en largo.",
        "start": 3572.0,
        "end": 3576.0
    },
    {
        "text": " ¿Cómo el oro que las listas tengan más o menos",
        "start": 3576.0,
        "end": 3579.0
    },
    {
        "text": " todas el mismo largo de quién depende eso?",
        "start": 3579.0,
        "end": 3582.0
    },
    {
        "text": " ¿De la función de jage que te usan?",
        "start": 3582.0,
        "end": 3587.0
    },
    {
        "text": " O sea, ¿cómo el oro?",
        "start": 3587.0,
        "end": 3588.0
    },
    {
        "text": " Obiense de que sean cortitas, pero ¿cómo el oro que las listas",
        "start": 3588.0,
        "end": 3590.0
    },
    {
        "text": " tengan largo similar?",
        "start": 3590.0,
        "end": 3592.0
    },
    {
        "text": " ¿Tú todas tengan más o menos tres o todas tengan cinco o todas tengan",
        "start": 3592.0,
        "end": 3595.0
    },
    {
        "text": " si? ¿De qué va a depender cuando empiezo a cargar, cargar, cargar, cargar?",
        "start": 3595.0,
        "end": 3598.0
    },
    {
        "text": " ¿De quién depende eso?",
        "start": 3598.0,
        "end": 3600.0
    },
    {
        "text": " ¿De la función de jage?",
        "start": 3600.0,
        "end": 3602.0
    },
    {
        "text": " Si la función de jage es buena, los largos de la lista deberían ser",
        "start": 3602.0,
        "end": 3606.0
    },
    {
        "text": " todos similares.",
        "start": 3606.0,
        "end": 3608.0
    },
    {
        "text": " Una función de jage muy mala es, por ejemplo, una función constante",
        "start": 3608.0,
        "end": 3611.0
    },
    {
        "text": " que todo le dicen, todos vayan a la función cero.",
        "start": 3611.0,
        "end": 3613.0
    },
    {
        "text": " Entonces, es como estuviera en la función cero la lista de",
        "start": 3613.0,
        "end": 3617.0
    },
    {
        "text": " todos los elementos, sería el peor caso, es como transformar todo",
        "start": 3617.0,
        "end": 3620.0
    },
    {
        "text": " esto en una lista.",
        "start": 3620.0,
        "end": 3622.0
    },
    {
        "text": " ¿Está bien?",
        "start": 3622.0,
        "end": 3623.0
    },
    {
        "text": " Entonces, ¿me difunción de qué depende que los largos sean",
        "start": 3623.0,
        "end": 3627.0
    },
    {
        "text": " equitativos, digamos, de qué me le asinó, de la función de jage?",
        "start": 3627.0,
        "end": 3632.0
    },
    {
        "text": " ¿Y de qué depende eso de los datos?",
        "start": 3632.0,
        "end": 3635.0
    },
    {
        "text": " O sea, que ahí depende, bueno, si los datos son todo igualmente",
        "start": 3635.0,
        "end": 3639.0
    },
    {
        "text": " probables, son numérico, aplicale simplemente el módulo",
        "start": 3639.0,
        "end": 3643.0
    },
    {
        "text": " te alcanza.",
        "start": 3643.0,
        "end": 3644.0
    },
    {
        "text": " Ahora, si no son todo equivalentes, buscamos una función de jage",
        "start": 3644.0,
        "end": 3646.0
    },
    {
        "text": " un poco más equitativa.",
        "start": 3646.0,
        "end": 3647.0
    },
    {
        "text": " Vamos a ver que hay algunas variantes.",
        "start": 3647.0,
        "end": 3649.0
    },
    {
        "text": " Igual no se preocupen en este curso como no tiene como previa,",
        "start": 3649.0,
        "end": 3653.0
    },
    {
        "text": " probabilidad estadística o no vamos a entrar en funciones de jage",
        "start": 3653.0,
        "end": 3657.0
    },
    {
        "text": " sofisticadas.",
        "start": 3657.0,
        "end": 3658.0
    },
    {
        "text": " Y, o sea, no las buscas en los libros.",
        "start": 3658.0,
        "end": 3659.0
    },
    {
        "text": " Lo que queremos ver es cómo implemento en estructuras,",
        "start": 3659.0,
        "end": 3661.0
    },
    {
        "text": " si yo ya tengo una función de jage.",
        "start": 3661.0,
        "end": 3663.0
    },
    {
        "text": " Como implemento toda la maquinaria, los algoritmos,",
        "start": 3663.0,
        "end": 3666.0
    },
    {
        "text": " el jage, la insación, como restructura en la estable, etcétera.",
        "start": 3666.0,
        "end": 3670.0
    },
    {
        "text": " Pero la función de jage depende de factores probabilísticos de",
        "start": 3670.0,
        "end": 3674.0
    },
    {
        "text": " elegir la bien.",
        "start": 3674.0,
        "end": 3675.0
    },
    {
        "text": " Y a veces hay más, lo manejo de base a topo,",
        "start": 3675.0,
        "end": 3678.0
    },
    {
        "text": " venir al tardando entre distintas funciones a medida que se va",
        "start": 3678.0,
        "end": 3681.0
    },
    {
        "text": " degradando el sistema.",
        "start": 3681.0,
        "end": 3682.0
    },
    {
        "text": " Vamos a ver que eso lo puedo medir.",
        "start": 3682.0,
        "end": 3683.0
    },
    {
        "text": " Yo mismo puedo decir que el sistema se actualice si se está",
        "start": 3683.0,
        "end": 3686.0
    },
    {
        "text": " degradando.",
        "start": 3686.0,
        "end": 3687.0
    },
    {
        "text": " Ya vamos a ver que paráretro son lo que se usan para eso.",
        "start": 3687.0,
        "end": 3690.0
    },
    {
        "text": " ¿Tú qué queremos?",
        "start": 3690.0,
        "end": 3691.0
    },
    {
        "text": " Que los largos sean parecidos, pero además parecidos y cortos.",
        "start": 3691.0,
        "end": 3697.0
    },
    {
        "text": " Y eso de quién depende que sean cortos.",
        "start": 3697.0,
        "end": 3700.0
    },
    {
        "text": " No solo parecidos de la función de jage.",
        "start": 3700.0,
        "end": 3702.0
    },
    {
        "text": " Pero yo puedo decir parecido, mirad, tengo una tabla de tamaño 2,",
        "start": 3703.0,
        "end": 3706.0
    },
    {
        "text": " 2 y yo inserto 10.000 elementos y mi función de jage es muy buena.",
        "start": 3706.0,
        "end": 3711.0
    },
    {
        "text": " ¿Cuántos elementos va a ver en una lista y en la otra lista?",
        "start": 3711.0,
        "end": 3714.0
    },
    {
        "text": " La mitad.",
        "start": 3714.0,
        "end": 3716.0
    },
    {
        "text": " Y igual eso es mucho, porque cada vez que voy a buscar es n sobre 2",
        "start": 3716.0,
        "end": 3721.0
    },
    {
        "text": " y n sobre 2 ordené, o sea, por más que sea la función de jage",
        "start": 3721.0,
        "end": 3725.0
    },
    {
        "text": " muy buena e quitativa, pero si las litas son muy largas, no me sirven.",
        "start": 3725.0,
        "end": 3728.0
    },
    {
        "text": " Entonces, ¿cómo logró que las litas sean equitativos y cortitas?",
        "start": 3728.0,
        "end": 3731.0
    },
    {
        "text": " ¿Quién depende?",
        "start": 3731.0,
        "end": 3734.0
    },
    {
        "text": " Y la lado del arrilo de quién depende.",
        "start": 3734.0,
        "end": 3737.0
    },
    {
        "text": " La cantidad de elementos que crees.",
        "start": 3737.0,
        "end": 3739.0
    },
    {
        "text": " Entonces, acá viene el segundo factor que tengo que estimar.",
        "start": 3739.0,
        "end": 3742.0
    },
    {
        "text": " ¿Cuántos elementos vos querés estimar este conjunto que está acá?",
        "start": 3742.0,
        "end": 3746.0
    },
    {
        "text": " ¿Cuántos vas a cargar?",
        "start": 3746.0,
        "end": 3748.0
    },
    {
        "text": " Una base de productos. ¿Cuántos productos?",
        "start": 3748.0,
        "end": 3751.0
    },
    {
        "text": " 10.000. Bueno, 10.000 yo diría, ¿haciste una tabla de un arrilo de tamaño? 10.000.",
        "start": 3751.0,
        "end": 3757.0
    },
    {
        "text": " Si tu función de jage es buena, bastante buena en promedio cuantos no dos tiene cada lista.",
        "start": 3758.0,
        "end": 3763.0
    },
    {
        "text": " Una.",
        "start": 3763.0,
        "end": 3765.0
    },
    {
        "text": " Y ahí digo orden 1 promedio.",
        "start": 3765.0,
        "end": 3768.0
    },
    {
        "text": " O sea, que el tamaño de la tabla no es hacer la grande porque me gusta que sea grande la tabla.",
        "start": 3768.0,
        "end": 3774.0
    },
    {
        "text": " Es hacer la proporcionar la cuantos elementos esperas.",
        "start": 3774.0,
        "end": 3779.0
    },
    {
        "text": " Está bien, entonces ahí hay un estimativo, una vez de lado para cuantos.",
        "start": 3779.0,
        "end": 3783.0
    },
    {
        "text": " Ahí va la tabla, ¿no? Y después sí, elegí la función de jage para que no te mande todos a un sol lugar y se distribuye.",
        "start": 3784.0,
        "end": 3789.0
    },
    {
        "text": " Entonces, en promedio y es fácil de visualizar si la cantidad de elementos esperado es aproximadamente el tamaño de la tabla.",
        "start": 3789.0,
        "end": 3796.0
    },
    {
        "text": " Y la función de jage distribuye equitativamente en promedio cada lista va a tener un nodo.",
        "start": 3796.0,
        "end": 3801.0
    },
    {
        "text": " Entonces, voy a dar para insaltar buscar y borrar, voy a tener un orden 1 promedio.",
        "start": 3801.0,
        "end": 3807.0
    },
    {
        "text": " O a la función de jage el dominio puede ser un string, un real, lo único que el pido es que el resultado de la función sea un número natural.",
        "start": 3807.0,
        "end": 3815.0
    },
    {
        "text": " O sea que ahí gané lo que no tenía la releviz.",
        "start": 3815.0,
        "end": 3819.0
    },
    {
        "text": " Está bien, elemento es lo que vos quiera, pero traducíme lo a un natural con esa probabilidad de distribución.",
        "start": 3819.0,
        "end": 3825.0
    },
    {
        "text": " Está bien?",
        "start": 3825.0,
        "end": 3827.0
    },
    {
        "text": " La memoria y la memoria es más parecida a las listas, ¿verdad?",
        "start": 3827.0,
        "end": 3830.0
    },
    {
        "text": " Porque cuantos noditos se llegan, los que suincierté.",
        "start": 3830.0,
        "end": 3834.0
    },
    {
        "text": " ¿Qué estoy desperdiciando un poco?",
        "start": 3834.0,
        "end": 3837.0
    },
    {
        "text": " La tabla.",
        "start": 3837.0,
        "end": 3839.0
    },
    {
        "text": " Si me dijiste que vas una basata de 10.000 y después te va muy mal y tenés 1.000 y está desperdiciando el 90% de la tabla.",
        "start": 3839.0,
        "end": 3849.0
    },
    {
        "text": " Y la regla sí, estoy desperdiciando, pero el nodo de la lista, que es lo que va a crezar más, es proporcionar la cuantos yo agrega.",
        "start": 3849.0,
        "end": 3857.0
    },
    {
        "text": " Entonces, es muy níbrido ahí entre la memoria de la releviz y la memoria de la lista.",
        "start": 3857.0,
        "end": 3861.0
    },
    {
        "text": " Insaltar o carivorrar en promedio se aproxima la releviz y el tipo elemento se parece a las listas.",
        "start": 3862.0,
        "end": 3869.0
    },
    {
        "text": " Se entiende?",
        "start": 3869.0,
        "end": 3871.0
    },
    {
        "text": " Pero hay dos decisiones diseño.",
        "start": 3871.0,
        "end": 3873.0
    },
    {
        "text": " Una es la función de hash y la otra es estimar la cantidad de elementos.",
        "start": 3873.0,
        "end": 3879.0
    },
    {
        "text": " Ejemplos para visualizar esto un poquito más terrenal.",
        "start": 3879.0,
        "end": 3883.0
    },
    {
        "text": " Supongan seguir tu vida y ver un ejemplo, un pequeño complemento.",
        "start": 3883.0,
        "end": 3886.0
    },
    {
        "text": " Supongan que tengo una tabla de tamaño 10 para hacer la cuenta fácil.",
        "start": 3886.0,
        "end": 3891.0
    },
    {
        "text": " Y mi función de hash, dado un entero, me da un entero.",
        "start": 3891.0,
        "end": 3895.0
    },
    {
        "text": " Entonces, y supongan que son todo igualmente probable, entonces mi función de hash simplemente hace al número que me venga y hace el m.",
        "start": 3895.0,
        "end": 3900.0
    },
    {
        "text": " Se me va a dar un valor entre 0 y 10.",
        "start": 3900.0,
        "end": 3904.0
    },
    {
        "text": " Ok?",
        "start": 3904.0,
        "end": 3906.0
    },
    {
        "text": " Y yo insarto, no miren por ahora esto porque capa que nada, pero sin sarto, el 0 donde va.",
        "start": 3906.0,
        "end": 3911.0
    },
    {
        "text": " 0, módulo 10, cuento es 0.",
        "start": 3911.0,
        "end": 3916.0
    },
    {
        "text": " 5 módulo 10, 5.",
        "start": 3916.0,
        "end": 3919.0
    },
    {
        "text": " 10 módulo 10, 0.",
        "start": 3919.0,
        "end": 3921.0
    },
    {
        "text": " 15, 5.",
        "start": 3921.0,
        "end": 3923.0
    },
    {
        "text": " 20, 0.",
        "start": 3923.0,
        "end": 3925.0
    },
    {
        "text": " O sea, uno dice acá no hay una, no son muy equitativos, los números que le dijiste.",
        "start": 3925.0,
        "end": 3930.0
    },
    {
        "text": " Hay un patrón, en la realidad muchas veces patrónes.",
        "start": 3930.0,
        "end": 3933.0
    },
    {
        "text": " Y ese patrón, ese tamaño de tabla hace que vayan todo o al 0 o al 5.",
        "start": 3933.0,
        "end": 3938.0
    },
    {
        "text": " Y ahí esas dos listas empiezan a crecer, la toda la resta de la tabla vacía y esas dos crecen.",
        "start": 3938.0,
        "end": 3943.0
    },
    {
        "text": " Y uno dice, ¿y pasa de un sesgo?",
        "start": 3943.0,
        "end": 3946.0
    },
    {
        "text": " Ahí no me digas que hay mucha proteína y uniforme porque lo veo claramente al sesgo.",
        "start": 3946.0,
        "end": 3950.0
    },
    {
        "text": " En la realidad uno puede decir, no, fíjate que van a hacer todo igualmente probablemente, pero ahí hay algo que a veces compensa un poco.",
        "start": 3950.0,
        "end": 3956.0
    },
    {
        "text": " ¿Cuál es el que compensa un poco?",
        "start": 3956.0,
        "end": 3958.0
    },
    {
        "text": " Elejir el tamaño de la tabla un número prima.",
        "start": 3958.0,
        "end": 3961.0
    },
    {
        "text": " Entonces si yo le dijo el tamaño de la tabla 13 por ejemplo,",
        "start": 3961.0,
        "end": 3965.0
    },
    {
        "text": " ¿Qué es el tamaño de la tabla 13?",
        "start": 3966.0,
        "end": 3968.0
    },
    {
        "text": " Es más difícil que haya un múltiplo de mismo primo porque los primos son raros.",
        "start": 3968.0,
        "end": 3971.0
    },
    {
        "text": " Ya sabemos que los primos son raros, pero en particular los números primos son raros.",
        "start": 3971.0,
        "end": 3978.0
    },
    {
        "text": " Por ejemplo, inserto 3 módulo 13 o mismo, pensemos los mismos números que están acá,",
        "start": 3978.0,
        "end": 3984.0
    },
    {
        "text": " que están antes de poner eso, ¿no?",
        "start": 3984.0,
        "end": 3985.0
    },
    {
        "text": " 0 módulo 13 va a dar 0, ¿no? 5, 5, 10 módulo 13, 10, 15 módulo 13, 2,",
        "start": 3985.0,
        "end": 3994.0
    },
    {
        "text": " porque es la diferencia, ¿no?",
        "start": 3994.0,
        "end": 3996.0
    },
    {
        "text": " Ya venon que los cuatro primero que hay en lugar de distinto.",
        "start": 3996.0,
        "end": 3999.0
    },
    {
        "text": " 20 módulo 13, 7, 25...",
        "start": 3999.0,
        "end": 4004.0
    },
    {
        "text": " Ah, 12, ¿saben más difícil?",
        "start": 4004.0,
        "end": 4007.0
    },
    {
        "text": " Pero todos que hay en el número distinto.",
        "start": 4007.0,
        "end": 4010.0
    },
    {
        "text": " Entonces acá les muestro en el ejemplo si el m fuera 13 y cargar a todos estos valores, donde irían acá, cargado, ¿no?",
        "start": 4010.0,
        "end": 4017.0
    },
    {
        "text": " El 3 módulo 13 viene acá...",
        "start": 4017.0,
        "end": 4021.0
    },
    {
        "text": " Bueno, el 3 debería estar acá, acá.",
        "start": 4021.0,
        "end": 4024.0
    },
    {
        "text": " Sí.",
        "start": 4024.0,
        "end": 4025.0
    },
    {
        "text": " Está bien.",
        "start": 4025.0,
        "end": 4026.0
    },
    {
        "text": " El 0 va acá, el 7 módulo 13 va a dar 7, ¿no?",
        "start": 4026.0,
        "end": 4031.0
    },
    {
        "text": " El 16 módulo 13 va a la posición 3, cosiente 1, resto 3, ¿no?",
        "start": 4031.0,
        "end": 4036.0
    },
    {
        "text": " Entonces se va cargando...",
        "start": 4036.0,
        "end": 4037.0
    },
    {
        "text": " Esta son las líquitas como se van cargando.",
        "start": 4037.0,
        "end": 4039.0
    },
    {
        "text": " Es la medida que uno ve...",
        "start": 4039.0,
        "end": 4041.0
    },
    {
        "text": " Los largos de la lista veis que ve...",
        "start": 4041.0,
        "end": 4043.0
    },
    {
        "text": " De alguna manera si esto va funcionando bien o no, si se va degradando o no.",
        "start": 4043.0,
        "end": 4047.0
    },
    {
        "text": " Y lo puedo ir mirando, sí, lo puedo ir mirando, porque el N que es el contador de cantidad de elemento, lo puedo calcular,",
        "start": 4047.0,
        "end": 4053.0
    },
    {
        "text": " es un atributo de la representación, cuantos elementos carguen, el tamaño de todo lo que también lo tengo.",
        "start": 4053.0,
        "end": 4058.0
    },
    {
        "text": " Entonces, el factor N sobre D lo que puedo ir mirando, se suele llamar el factor de carga.",
        "start": 4058.0,
        "end": 4065.0
    },
    {
        "text": " Hay otra, perdón, hay otra estrategia pero no la vamos a ver acá, que es hash insarrado,",
        "start": 4065.0,
        "end": 4071.0
    },
    {
        "text": " y por qué no, porque paso de moda.",
        "start": 4071.0,
        "end": 4074.0
    },
    {
        "text": " También, se usaba en serio.",
        "start": 4074.0,
        "end": 4076.0
    },
    {
        "text": " Se usaba mucho, en veas a la dispersión como listas, la hacia dentro del mismo arreglo.",
        "start": 4076.0,
        "end": 4082.0
    },
    {
        "text": " Entonces, las colisiones es como que se segmento pero cada vez encontrar lugares libres,",
        "start": 4082.0,
        "end": 4086.0
    },
    {
        "text": " o sea, por ejemplo digo que todos los que colisionen los voy poniendo consecutivos,",
        "start": 4086.0,
        "end": 4091.0
    },
    {
        "text": " pero entonces después sí, por ejemplo, cargón 1 acá y esto yo estoy ocupado para seguir con la colision de este,",
        "start": 4091.0,
        "end": 4096.0
    },
    {
        "text": " me tengo que saltear todo este blog y venir acá.",
        "start": 4096.0,
        "end": 4098.0
    },
    {
        "text": " ¿Por qué se usaba más esto? Porque la memoria dinámica no era tan común,",
        "start": 4098.0,
        "end": 4102.0
    },
    {
        "text": " o tan de uso tan frecuente, o tan accesible.",
        "start": 4102.0,
        "end": 4106.0
    },
    {
        "text": " Hoy en día uno usa más la memoria dinámica y minimiza más las colisiones que la tabla cerrada.",
        "start": 4108.0,
        "end": 4114.0
    },
    {
        "text": " Lo comento, pues las libres estaban pero el que más se usa es la otra.",
        "start": 4114.0,
        "end": 4118.0
    },
    {
        "text": " Hay un valor que es justamente para la eficiencia que es el factor de carga,",
        "start": 4118.0,
        "end": 4122.0
    },
    {
        "text": " que es el cociente entre la cantidad de elementos que yo cargué,",
        "start": 4122.0,
        "end": 4125.0
    },
    {
        "text": " o sea, bolcita, no, yo voy insertando, insertando, insertando, ese es el ene y el ene es el tamaño de la tabla,",
        "start": 4125.0,
        "end": 4132.0
    },
    {
        "text": " el que yo estime. Entonces, si el ene y el ene son parecidos,",
        "start": 4132.0,
        "end": 4137.0
    },
    {
        "text": " ese factor de carga aproximadamente es 1.",
        "start": 4137.0,
        "end": 4140.0
    },
    {
        "text": " Si yo estime bien, ahora si el factor de carga empieza a hacer 2, 3, 4.",
        "start": 4140.0,
        "end": 4145.0
    },
    {
        "text": " ¿Qué quiere decir? Que el ene empieza a aumentar y mi tabla se queda chica.",
        "start": 4145.0,
        "end": 4149.0
    },
    {
        "text": " Entonces uno dice en promedio, por más que mi función dejasse a perfecta,",
        "start": 4149.0,
        "end": 4153.0
    },
    {
        "text": " la elita está creciendo. Entonces ahí es cuando uno dice cuando el ene,",
        "start": 4153.0,
        "end": 4157.0
    },
    {
        "text": " el factor de carga es muy grande, tengo que hacer algo. ¿Qué harían?",
        "start": 4157.0,
        "end": 4161.0
    },
    {
        "text": " Si podés aumentarse. Aumento el ene.",
        "start": 4161.0,
        "end": 4165.0
    },
    {
        "text": " Me ha gustado la más grande, paso todos los elementos,",
        "start": 4165.0,
        "end": 4169.0
    },
    {
        "text": " ahora vamos a ver cómo hacer eso en código, la bien, y a rank.",
        "start": 4169.0,
        "end": 4173.0
    },
    {
        "text": " Típicamente la base de a todos los bancos entre las 3 de la mañana cortan,",
        "start": 4173.0,
        "end": 4177.0
    },
    {
        "text": " una hora, restructuran, las archivos díntices, exceso de la base de data,",
        "start": 4177.0,
        "end": 4180.0
    },
    {
        "text": " la base de data, la esta, la ayuda, y la repone cuando arranca de nuevo,",
        "start": 4180.0,
        "end": 4184.0
    },
    {
        "text": " está todo mejorado, ponel. ¿Sí?",
        "start": 4184.0,
        "end": 4188.0
    },
    {
        "text": " Podrías también que podamos necesitar el enejar si no puede ser un tlm.",
        "start": 4188.0,
        "end": 4193.0
    },
    {
        "text": " Sí, la otra es ir estudiando el comportamiento de la función dejas",
        "start": 4193.0,
        "end": 4197.0
    },
    {
        "text": " y ir cambiando a la función dejas.",
        "start": 4197.0,
        "end": 4199.0
    },
    {
        "text": " ¿Sabes? En cuando no está funcionando.",
        "start": 4199.0,
        "end": 4202.0
    },
    {
        "text": " Hoy en día los maestradores de base de a todos tienen funciones dejas meneas genericas ahí,",
        "start": 4202.0,
        "end": 4205.0
    },
    {
        "text": " pero las podés ir al tarman.",
        "start": 4205.0,
        "end": 4207.0
    },
    {
        "text": " Lo más simple a veces corregirlo haciendo crecer el tamaño de la tabla.",
        "start": 4207.0,
        "end": 4211.0
    },
    {
        "text": " Si, si, si, si, la dos son varios los que podés ajustar,",
        "start": 4211.0,
        "end": 4218.0
    },
    {
        "text": " la función dejas y el tamaño de tabla.",
        "start": 4218.0,
        "end": 4221.0
    },
    {
        "text": " Bueno, esto es lo que les decía, si el factor de cargas aproximadamente",
        "start": 4221.0,
        "end": 4226.0
    },
    {
        "text": " igual a uno quiere decir que en promedio tengo un nodo en cada lista",
        "start": 4226.0,
        "end": 4229.0
    },
    {
        "text": " y por eso una habla de orden 1 promedio para insertar buscar y borra.",
        "start": 4229.0,
        "end": 4232.0
    },
    {
        "text": " Es como fácil, más fácil de entender que el logarismo promedio",
        "start": 4232.0,
        "end": 4236.0
    },
    {
        "text": " en el ABB, uno dice, sí, lo creo, pero no lo veo.",
        "start": 4236.0,
        "end": 4239.0
    },
    {
        "text": " Acá es más fácil de la cuentita, ¿no?",
        "start": 4239.0,
        "end": 4241.0
    },
    {
        "text": " Pues si tenés en elemento y promedio cuando tienen cada uno, uno.",
        "start": 4241.0,
        "end": 4245.0
    },
    {
        "text": " Está, es más fácil de la cuenta, es más redondita.",
        "start": 4245.0,
        "end": 4248.0
    },
    {
        "text": " Vamos a ver un poquito detalle con esto nos vamos a ir de código de esto, ¿no?",
        "start": 4248.0,
        "end": 4253.0
    },
    {
        "text": " Porque está bueno que vean cacho de código y porque también se va a usar bastante.",
        "start": 4253.0,
        "end": 4258.0
    },
    {
        "text": " Entonces, voy a terreno conocido.",
        "start": 4258.0,
        "end": 4260.0
    },
    {
        "text": " Como vimos la lista de la pila de la cola,",
        "start": 4260.0,
        "end": 4263.0
    },
    {
        "text": " una h, por ejemplo, que van a tener que hacer la tarea,",
        "start": 4263.0,
        "end": 4267.0
    },
    {
        "text": " no en la tarea 3, pero sin la tarea 4.",
        "start": 4267.0,
        "end": 4270.0
    },
    {
        "text": " Un jashin, yo me despeurei todo el mal material,",
        "start": 4270.0,
        "end": 4273.0
    },
    {
        "text": " puedo dir que yo era la tarea 3 y ahora me dije, no, no, no.",
        "start": 4273.0,
        "end": 4276.0
    },
    {
        "text": " Lo sacamos, lo pasamos a la 4.",
        "start": 4276.0,
        "end": 4277.0
    },
    {
        "text": " Pues ya quedo acá.",
        "start": 4277.0,
        "end": 4278.0
    },
    {
        "text": " ¿Sashin?",
        "start": 4278.0,
        "end": 4280.0
    },
    {
        "text": " No, no está en la tarea 3.",
        "start": 4280.0,
        "end": 4282.0
    },
    {
        "text": " ¿Tú?",
        "start": 4282.0,
        "end": 4283.0
    },
    {
        "text": " ¿Ema sí?",
        "start": 4283.0,
        "end": 4284.0
    },
    {
        "text": " Es más simple, tarea 3.",
        "start": 4284.0,
        "end": 4286.0
    },
    {
        "text": " Bueno, pensemos en esta, ¿no?",
        "start": 4287.0,
        "end": 4289.0
    },
    {
        "text": " Tengo recuerdo en la especificación de un tab, tengo el nombre conjunto",
        "start": 4289.0,
        "end": 4292.0
    },
    {
        "text": " que es punter una representación que en el h no se define justamente",
        "start": 4292.0,
        "end": 4296.0
    },
    {
        "text": " y pensemos que tengo estas operaciones, ¿no?",
        "start": 4296.0,
        "end": 4299.0
    },
    {
        "text": " Un crear conjunto, insertar conjunto, eliminar, pertenece, es vacío destruir.",
        "start": 4299.0,
        "end": 4305.0
    },
    {
        "text": " Fíjense que acá, cuando creo el conjunto, le pongo una cota.",
        "start": 4305.0,
        "end": 4311.0
    },
    {
        "text": " Y fíjense lo que dice, devuelve el conjunto vacío para una cantidad estimada cota.",
        "start": 4311.0,
        "end": 4318.0
    },
    {
        "text": " No es una cota estricta, no quiere decir que no pude insertar si no supera la cota.",
        "start": 4319.0,
        "end": 4325.0
    },
    {
        "text": " Es como un indicador de, mira, van a venir como cota, voy a oficate que haces.",
        "start": 4325.0,
        "end": 4330.0
    },
    {
        "text": " Si te vienen más, te dejo insertar.",
        "start": 4330.0,
        "end": 4333.0
    },
    {
        "text": " También, pero es como una directiva para justamente pensar las implementaciones",
        "start": 4333.0,
        "end": 4337.0
    },
    {
        "text": " que tratan de ajustar pensando que pasar cota al máximo.",
        "start": 4337.0,
        "end": 4342.0
    },
    {
        "text": " No es lo mismo que yo digo, pila de tamaño 100 y 101 no van.",
        "start": 4342.0,
        "end": 4347.0
    },
    {
        "text": " Cota estricta, este es como un estimado, por eso se habla de cantidad estimada cota en rojo.",
        "start": 4348.0,
        "end": 4354.0
    },
    {
        "text": " Bueno, en la cota son lo que dijimos, insertar, agrega si no estaba,",
        "start": 4354.0,
        "end": 4359.0
    },
    {
        "text": " en caso cuando no tiene efecto, eliminar el iminasi está, en caso cuando tiene efecto,",
        "start": 4359.0,
        "end": 4363.0
    },
    {
        "text": " pertenece, voletrusi está, es vacío.",
        "start": 4363.0,
        "end": 4366.0
    },
    {
        "text": " Es esto lo que queremos implementar, pero usando jachik.",
        "start": 4366.0,
        "end": 4370.0
    },
    {
        "text": " Una representación de una posible implementación de jachik,",
        "start": 4371.0,
        "end": 4374.0
    },
    {
        "text": " podría ser más o menos esta estructura.",
        "start": 4374.0,
        "end": 4377.0
    },
    {
        "text": " Uniría bueno acá, pondría la función de jachik, voy a usar.",
        "start": 4377.0,
        "end": 4380.0
    },
    {
        "text": " Supongo que sé que es un jach de entero, entonces podría ser que mi función",
        "start": 4380.0,
        "end": 4384.0
    },
    {
        "text": " jach da un entero, hace la identidad, si son todos de entero igualmente probable,",
        "start": 4384.0,
        "end": 4389.0
    },
    {
        "text": " hace retorn i.",
        "start": 4389.0,
        "end": 4391.0
    },
    {
        "text": " Si son todos igualmente probable, si no, podría usar otra función de jachik.",
        "start": 4391.0,
        "end": 4397.0
    },
    {
        "text": " Y ahí no le llama la atención algo.",
        "start": 4398.0,
        "end": 4400.0
    },
    {
        "text": " S i.",
        "start": 4402.0,
        "end": 4403.0
    },
    {
        "text": " Claro, dice, ¿cómo o el i, una entero y el tamaño de la tabla donde está?",
        "start": 4406.0,
        "end": 4411.0
    },
    {
        "text": " ¿Cómo sabe que va a caer dentro de la tabla?",
        "start": 4411.0,
        "end": 4413.0
    },
    {
        "text": " Y cuando hago la función de jachik, no lo sé, porque la tabla no la tengo todavía.",
        "start": 4413.0,
        "end": 4418.0
    },
    {
        "text": " Entonces, dos formas de trabajar con esto.",
        "start": 4418.0,
        "end": 4421.0
    },
    {
        "text": " Una es que la función de j se independiente del tamaño de la tabla, como acá.",
        "start": 4421.0,
        "end": 4425.0
    },
    {
        "text": " Y si quiere tener un tamaño de tabla, bueno, agregarlo un segundo parámetro acá.",
        "start": 4426.0,
        "end": 4429.0
    },
    {
        "text": " Que va a ser el tamaño de la tabla.",
        "start": 4429.0,
        "end": 4431.0
    },
    {
        "text": " Entonces, por ejemplo, gases, retorn y módulo de este tamaño.",
        "start": 4431.0,
        "end": 4434.0
    },
    {
        "text": " Entonces ahí te da un valor en tecer.",
        "start": 4434.0,
        "end": 4436.0
    },
    {
        "text": " Yo lo que voy a hacer acá es la alternativa, es decir, hago la función de jachik,",
        "start": 4436.0,
        "end": 4440.0
    },
    {
        "text": " pura, me da un entero y cuando la vas a aplicar y conozca la tabla,",
        "start": 4440.0,
        "end": 4444.0
    },
    {
        "text": " ahí hago el módulo.",
        "start": 4444.0,
        "end": 4445.0
    },
    {
        "text": " Pero las dos opciones son válidas.",
        "start": 4446.0,
        "end": 4448.0
    },
    {
        "text": " O hago, pero si quieras el módulo de arriba, tengo que pasar el tamaño de la tabla como parámetro.",
        "start": 4448.0,
        "end": 4452.0
    },
    {
        "text": " Te fijemos como es esta opción de acá.",
        "start": 4453.0,
        "end": 4455.0
    },
    {
        "text": " Bueno, me defino este dibujito, es el que quiero, ¿no?",
        "start": 4455.0,
        "end": 4458.0
    },
    {
        "text": " Esta es la tabla de jachik, y me va a decir, la representación que tiene una tabla, que es un arreglo,",
        "start": 4458.0,
        "end": 4464.0
    },
    {
        "text": " por eso es el asterisco negro, de qué, de punteros anudos, por eso es el asterisco rojo.",
        "start": 4464.0,
        "end": 4473.0
    },
    {
        "text": " Por eso tiene dos asterisco, ¿no?",
        "start": 4473.0,
        "end": 4476.0
    },
    {
        "text": " El asterico negro me dice, es un arreglo de algo.",
        "start": 4476.0,
        "end": 4479.0
    },
    {
        "text": " Y el rojo me dice, el algo son punteros anudos.",
        "start": 4479.0,
        "end": 4482.0
    },
    {
        "text": " Es el no dojás, tiene en este caso el dato y un siguiente.",
        "start": 4484.0,
        "end": 4487.0
    },
    {
        "text": " O sea, ese es el dibujito que está acá.",
        "start": 4488.0,
        "end": 4490.0
    },
    {
        "text": " ¿Qué más tengo la cantidad?",
        "start": 4490.0,
        "end": 4492.0
    },
    {
        "text": " O sea, a medida que voy insartando para decir este n total, que yo decía, es la cantidad,",
        "start": 4493.0,
        "end": 4498.0
    },
    {
        "text": " y la cota es, bueno, justamente lo que me permite decir el tamaño de la tabla.",
        "start": 4498.0,
        "end": 4503.0
    },
    {
        "text": " Sí.",
        "start": 4503.0,
        "end": 4504.0
    },
    {
        "text": " Sí.",
        "start": 4505.0,
        "end": 4506.0
    },
    {
        "text": " El asterisco es este negro que pinte acá, o sea, tabla asterisco, pensaba que es este arreglo.",
        "start": 4506.0,
        "end": 4512.0
    },
    {
        "text": " Cuando yo defino un arreglo, lo defino como puntero, ¿no?",
        "start": 4512.0,
        "end": 4516.0
    },
    {
        "text": " Porque el núcleo voy a hacer en el crear.",
        "start": 4516.0,
        "end": 4518.0
    },
    {
        "text": " Ahora, como el tipo de los elementos de este arreglo, si fuera entero sería tabla asterisco int.",
        "start": 4518.0,
        "end": 4525.0
    },
    {
        "text": " Es un arreglo de enteros.",
        "start": 4525.0,
        "end": 4527.0
    },
    {
        "text": " Ahora, mi arreglo va a ser de punteros anudos, porque es un arreglo, este es el arreglo de listas.",
        "start": 4527.0,
        "end": 4533.0
    },
    {
        "text": " Entonces, por eso viene el segundo, como tipo de elementos me pone entero, pongo no jage asterisco.",
        "start": 4533.0,
        "end": 4539.0
    },
    {
        "text": " Ahí viene el segundo asterisco.",
        "start": 4539.0,
        "end": 4541.0
    },
    {
        "text": " El asterico me dice, es un arreglo de qué de punteros, el segundo asterisco.",
        "start": 4541.0,
        "end": 4547.0
    },
    {
        "text": " ¿Ok?",
        "start": 4548.0,
        "end": 4549.0
    },
    {
        "text": " Sí.",
        "start": 4549.0,
        "end": 4550.0
    },
    {
        "text": " ¿Si tuvieras más fuerte?",
        "start": 4553.0,
        "end": 4555.0
    },
    {
        "text": " Sí.",
        "start": 4555.0,
        "end": 4556.0
    },
    {
        "text": " ¿No podrías tener type D y poner el segundo?",
        "start": 4556.0,
        "end": 4561.0
    },
    {
        "text": " Acá no sé type D fuera nada y por eso lo hago prens.",
        "start": 4561.0,
        "end": 4565.0
    },
    {
        "text": " Pero lo señale con color de distinto para que vean que uno es el arreglo y el otro es el tipo de elementos del arreglo.",
        "start": 4565.0,
        "end": 4571.0
    },
    {
        "text": " Bueno, fíjense entonces mi representación lo que va a manejar minudo representaciones sexto, ¿no?",
        "start": 4571.0,
        "end": 4576.0
    },
    {
        "text": " Un puntero a y tiene tres campos.",
        "start": 4576.0,
        "end": 4578.0
    },
    {
        "text": " Tabla, cantidad y cota.",
        "start": 4578.0,
        "end": 4580.0
    },
    {
        "text": " La operación lo que voy a tener que actualizando es esa representación, por ejemplo.",
        "start": 4581.0,
        "end": 4585.0
    },
    {
        "text": " El crear conjunto que hacía.",
        "start": 4585.0,
        "end": 4587.0
    },
    {
        "text": " Residí este tamaño estimado y me va a dar un conjunto.",
        "start": 4587.0,
        "end": 4590.0
    },
    {
        "text": " Entonces quiero que hace, bueno, nub representación y dice la tabla, así no, un arreglo, nub de nodo hash asterisco, de tamaño cota,",
        "start": 4590.0,
        "end": 4602.0
    },
    {
        "text": " que es el parámetro de acá, ahora sí, es el tamaño de la tabla.",
        "start": 4602.0,
        "end": 4605.0
    },
    {
        "text": " Inicializo todo ese arreglo en null, o sea, las listas son todas vacías y comienzo.",
        "start": 4605.0,
        "end": 4611.0
    },
    {
        "text": " Cantidad la pongo en cero y cota en el parámetro que me vino acá.",
        "start": 4612.0,
        "end": 4616.0
    },
    {
        "text": " Y retorno, sí, o sea, el conjunto que tiene el arreglo este con todos punteros nulos, cantía en cero y cota el parámetro.",
        "start": 4616.0,
        "end": 4625.0
    },
    {
        "text": " O sea, eso sería mi conjunto vacío, ¿sí entiende?",
        "start": 4625.0,
        "end": 4628.0
    },
    {
        "text": " El insertar que va a ser.",
        "start": 4630.0,
        "end": 4632.0
    },
    {
        "text": " La cantidad la aumentar en uno si no estaba.",
        "start": 4634.0,
        "end": 4637.0
    },
    {
        "text": " ¿Qué más?",
        "start": 4637.0,
        "end": 4638.0
    },
    {
        "text": " La cota no se va a cambiar.",
        "start": 4639.0,
        "end": 4641.0
    },
    {
        "text": " Le va a aplicar el hash para saber dónde lo va a insertar, ¿no? Para eso tenemos la función de hash.",
        "start": 4641.0,
        "end": 4646.0
    },
    {
        "text": " Aplicar la función de hash, a ver qué lugar va esa listita y si no está, lo agrega la listita, donde lo puede agregar la lista.",
        "start": 4646.0,
        "end": 4654.0
    },
    {
        "text": " Y por ejemplo, el principio, no hay orden posicional así que lo más fácil agrega lo comienzo, no nos vamos a complicar.",
        "start": 4655.0,
        "end": 4660.0
    },
    {
        "text": " Veamos eso que está acá.",
        "start": 4661.0,
        "end": 4663.0
    },
    {
        "text": " El insertar un elemento en el conjunto, entonces dice, uso el partenés y si no, si no, partenés y así.",
        "start": 4663.0,
        "end": 4671.0
    },
    {
        "text": " Pues si partenés, me voy.",
        "start": 4671.0,
        "end": 4673.0
    },
    {
        "text": " Que lo que hago, bueno, hago este nuevo nodito verde. Supongan que la posición que le toca es esta.",
        "start": 4674.0,
        "end": 4679.0
    },
    {
        "text": " Entonces hago new node hash, cargo el dato y lo inserto al comienzo de esta lista. ¿Cuál es esta lista? Lo puse en rojo acá.",
        "start": 4680.0,
        "end": 4689.0
    },
    {
        "text": " Lo que tiene, se tabla en la posición hash de y y acá le aplica el módulo.",
        "start": 4690.0,
        "end": 4697.0
    },
    {
        "text": " Módulo, porque ahora conozco como tengo el parámetro sé que en la tabla digo seflechita cotra.",
        "start": 4697.0,
        "end": 4702.0
    },
    {
        "text": " Entonces, esta, todo lo que está en rojo, lo que dice en este arreglo, en esta posición, este puntero que sale acá.",
        "start": 4703.0,
        "end": 4710.0
    },
    {
        "text": " ¿Entiendes?",
        "start": 4710.0,
        "end": 4712.0
    },
    {
        "text": " O sea, y hash es ese rojo, lo que marque acá, ¿no?",
        "start": 4713.0,
        "end": 4716.0
    },
    {
        "text": " El arreglo se tabla en esta posición. ¿Cuál es la posición hash de y?",
        "start": 4717.0,
        "end": 4722.0
    },
    {
        "text": " Pero módulo, el tamaño de la tabla, porque un entero puede ser cualquier entero. ¿Cómo hago que caiga en el tamaño de la tabla?",
        "start": 4722.0,
        "end": 4727.0
    },
    {
        "text": " Módulo, el tamaño de la tabla. Entonces me da un valor entre cero y cotamina suro.",
        "start": 4727.0,
        "end": 4732.0
    },
    {
        "text": " ¿Ve bien?",
        "start": 4733.0,
        "end": 4734.0
    },
    {
        "text": " Entonces digo, el siguiente del nodo que acabo de crear es el comienzo de la lista y el comienzo de la lista",
        "start": 4734.0,
        "end": 4740.0
    },
    {
        "text": " O sea, insertar el comienzo de esta lista. Si era null, es null, el siguiente y si no, lo que esté ahí.",
        "start": 4741.0,
        "end": 4748.0
    },
    {
        "text": " Y como acabo de insertar un nodo, cantidad como decía recién le sumo uno.",
        "start": 4748.0,
        "end": 4752.0
    },
    {
        "text": " Si partenecía, no entre acá y me voy sin sumar la cantidad ni nada.",
        "start": 4752.0,
        "end": 4758.0
    },
    {
        "text": " Eso es hash. ¿Qué orden tiene eso?",
        "start": 4758.0,
        "end": 4762.0
    },
    {
        "text": " Es difícil, ¿no? Saca en el pertenece que estoy chequeando acá. Si no ven esto acá, ¿qué orden tiene todo este código?",
        "start": 4763.0,
        "end": 4774.0
    },
    {
        "text": " ¿Por de nuno? No hay ningún guay, ninguna recursión, son asignaciones, o sea, todo orden uno.",
        "start": 4776.0,
        "end": 4781.0
    },
    {
        "text": " Unirse de la duda que me queda es el pertenece.",
        "start": 4781.0,
        "end": 4783.0
    },
    {
        "text": " Vamos a emover bien. Vamos a ver el pertenece que está entiendo.",
        "start": 4784.0,
        "end": 4790.0
    },
    {
        "text": " Entonces, ¿cómo ceso un elemento estado no está? Y debería ser similar al insertarlo porque el lugar tiene ese mismo.",
        "start": 4790.0,
        "end": 4796.0
    },
    {
        "text": " Entonces digo, vamos a hacer lo mismo.",
        "start": 4796.0,
        "end": 4798.0
    },
    {
        "text": " Voy, por eso lo puse en rojo de nuevo. Voy a la tabla a la posición que le toca Ellie.",
        "start": 4798.0,
        "end": 4803.0
    },
    {
        "text": " Está bien, y eso es un puntero, se las inno la varió la lista.",
        "start": 4804.0,
        "end": 4807.0
    },
    {
        "text": " Y ahora que hago recorre esa lista,",
        "start": 4808.0,
        "end": 4829.52
    },
    {
        "text": " y después retorno lista distinto de null, porque si lista distinto de null quiere decir que el dato es igual al Ali.",
        "start": 4829.52,
        "end": 4836.52
    },
    {
        "text": " Eso entiendo, ¿eh? Y uno y si quiero denes esto. ¿Aquí un Guayl?",
        "start": 4836.52,
        "end": 4841.52
    },
    {
        "text": " ¿Encluye el corcazo o el clánsito?",
        "start": 4841.52,
        "end": 4843.52
    },
    {
        "text": " Claro, y acá donde viene si yo esti y se viene el diseño, lo que decía él.",
        "start": 4843.52,
        "end": 4847.52
    },
    {
        "text": " Si la cantidad de elementos esperado es el tamaño de la tabla y tu función de J distribuye bien,",
        "start": 4847.52,
        "end": 4853.52
    },
    {
        "text": " este Guayl en promedio hace una sola vez.",
        "start": 4853.52,
        "end": 4857.52
    },
    {
        "text": " Pero en caso no diría muy mal diseño del hash, tan todos los elementos ahí en esa lista,",
        "start": 4857.52,
        "end": 4863.52
    },
    {
        "text": " está bien, ordené, pero eso no debería pasar un hash.",
        "start": 4863.52,
        "end": 4867.52
    },
    {
        "text": " Entonces como yo digo en promedio esto acaba de haber un nodo en la práctica,",
        "start": 4867.52,
        "end": 4872.52
    },
    {
        "text": " pues se que haya dos o tres, pero en promedio y uno todo esto igual es ordeno uno promedio.",
        "start": 4872.52,
        "end": 4877.52
    },
    {
        "text": " Entonces no se confunda cuando vean un Guayl a veces en un lado y dice eso es ordeno uno.",
        "start": 4878.52,
        "end": 4882.52
    },
    {
        "text": " ¿Cómo que es ordeno uno? Porque en promedio está diseñada la estructura,",
        "start": 4882.52,
        "end": 4886.52
    },
    {
        "text": " porque ahí recorra una vez. ¿Por qué ponen un Guayl? Porque el promedio puede hacer que uno tenga cero,",
        "start": 4886.52,
        "end": 4892.52
    },
    {
        "text": " todo tenga dos, todo tenga tres y sin certidumbre, te va a poner un Guayl.",
        "start": 4892.52,
        "end": 4895.52
    },
    {
        "text": " ¿Ya entiende?",
        "start": 4895.52,
        "end": 4898.52
    },
    {
        "text": " ¿Se entiende?",
        "start": 4898.52,
        "end": 4899.52
    },
    {
        "text": " ¿Se entiende el que se ha tenido cuidado cuando ve su Guayl y así?",
        "start": 4899.52,
        "end": 4903.52
    },
    {
        "text": " Sí, hay gente que ve la dos buenas niidades en el cuadrado, pero a veces empezó a saber",
        "start": 4903.52,
        "end": 4908.52
    },
    {
        "text": " y hay un flag que los escondless hace la primera vez sale, entonces todo eso se ordené.",
        "start": 4908.52,
        "end": 4913.52
    },
    {
        "text": " Aquí está la recuerda.",
        "start": 4913.52,
        "end": 4916.52
    },
    {
        "text": " Bueno, última y ahora sí, última y con esta no vamos a ir.",
        "start": 4916.52,
        "end": 4921.52
    },
    {
        "text": " Clon conjunto, bueno, algo que a veces lo voy a usar para dos cosas,",
        "start": 4923.52,
        "end": 4928.52
    },
    {
        "text": " es lo que es una media copia.",
        "start": 4928.52,
        "end": 4930.52
    },
    {
        "text": " Dame una copia y el conjunto. A veces con una copia y la lista, una copia y la pila",
        "start": 4930.52,
        "end": 4934.52
    },
    {
        "text": " para que, porque yo la copia, la puedo destrozar, puedo hacer, puedo borrar,",
        "start": 4934.52,
        "end": 4938.52
    },
    {
        "text": " también, y no pierdo el original. Eso es un clon.",
        "start": 4938.52,
        "end": 4941.52
    },
    {
        "text": " ¿Cómo podría ser un clon? Bueno, hay varias formas en un clon.",
        "start": 4941.52,
        "end": 4944.52
    },
    {
        "text": " Pero una forma podría ser esta, de hacer un clon de una pila, de una cola, de una lista,",
        "start": 4944.52,
        "end": 4949.52
    },
    {
        "text": " más o menos el mismo molde.",
        "start": 4949.52,
        "end": 4951.52
    },
    {
        "text": " ¿Cómo, como uno crearía una copia? Bueno, una forma sería decir, mira,",
        "start": 4951.52,
        "end": 4955.52
    },
    {
        "text": " me hago una variable que va a hacer lo que voy a retornar abajo, le llamó clon, por ejemplo,",
        "start": 4955.52,
        "end": 4959.52
    },
    {
        "text": " y la creo con la operación crear vacío, en este caso con la cota que ya tenía.",
        "start": 4959.52,
        "end": 4965.52
    },
    {
        "text": " En el caso de esta implementación, como es una reglo, una tabla, recorro la tabla,",
        "start": 4965.52,
        "end": 4974.52
    },
    {
        "text": " de cero a cota menos uno, está bien, obtengo la lista en esa posición,",
        "start": 4974.52,
        "end": 4980.52
    },
    {
        "text": " y recorro la distita con un wine y cada dato que está acá,",
        "start": 4980.52,
        "end": 4987.52
    },
    {
        "text": " lo voy insertando en el clon, usando que el insertar conjunto.",
        "start": 4987.52,
        "end": 4992.52
    },
    {
        "text": " Está bien? Abansó la lista, entonces inserta este, este, este,",
        "start": 4992.52,
        "end": 4999.52
    },
    {
        "text": " después el y pasa el otro, inserta a lo que esté acá, inserta a lo que esté acá,",
        "start": 4999.52,
        "end": 5003.52
    },
    {
        "text": " o termina insertar todo, retornar el clon, ya está.",
        "start": 5003.52,
        "end": 5006.52
    },
    {
        "text": " No borronada, no modificó el conjunto C, porque eso sería destructivo,",
        "start": 5007.52,
        "end": 5012.52
    },
    {
        "text": " sería una mala política, para ejemplo, clon, y me generó un conjunto de",
        "start": 5012.52,
        "end": 5018.52
    },
    {
        "text": " más clon, que si tienen lo mismo elementos. ¿Por qué en serio?",
        "start": 5018.52,
        "end": 5024.52
    },
    {
        "text": " ¿Copias? No entendí la pregunta, ¿por qué no es necesario? ¿Por qué es necesario?",
        "start": 5024.52,
        "end": 5033.52
    },
    {
        "text": " ¿Hazar copias? Y por muchas veces vos querés borrar,",
        "start": 5034.52,
        "end": 5039.52
    },
    {
        "text": " que eres buscar algo, y como tenés estado, no tenés la estructura,",
        "start": 5039.52,
        "end": 5043.52
    },
    {
        "text": " crees, no sé, hacer algo, pero no en el original, entonces,",
        "start": 5043.52,
        "end": 5047.52
    },
    {
        "text": " en la base a tovelía, no digan nada, pero nosotros no hacemos copias,",
        "start": 5047.52,
        "end": 5051.52
    },
    {
        "text": " en la unidad en señanza, y sacamos cosas, a veces borramos cosas,",
        "start": 5051.52,
        "end": 5054.52
    },
    {
        "text": " pero es una copia, para que no se toque el original,",
        "start": 5054.52,
        "end": 5057.52
    },
    {
        "text": " vemos aquí esta distia, a veces la única forma de sacar cosas,",
        "start": 5057.52,
        "end": 5060.52
    },
    {
        "text": " para que no quede lo que filtrar lo que queremos y poder hacerlo.",
        "start": 5060.52,
        "end": 5063.52
    },
    {
        "text": " También, entonces lo hacemos siempre en un clon,",
        "start": 5063.52,
        "end": 5066.52
    },
    {
        "text": " para no tocar los autorginais, porque si no me diría, no nos deja,",
        "start": 5066.52,
        "end": 5069.52
    },
    {
        "text": " para hacer consultas de cosas que no están programadas en la base de ato,",
        "start": 5069.52,
        "end": 5072.52
    },
    {
        "text": " entonces nos copiaban la base de ato, la destrozamos y sacamos lo que queremos.",
        "start": 5072.52,
        "end": 5077.52
    },
    {
        "text": " Bueno, Abar, y con esta pregunta o con esta respuesta de ustedes nos vamos a ir.",
        "start": 5080.52,
        "end": 5085.52
    },
    {
        "text": " Este clon tiene esa función, hace una copia de tai cosa,",
        "start": 5085.52,
        "end": 5089.52
    },
    {
        "text": " pero yo le digo, en una empresa lo que puede pasar es que yo estime mil,",
        "start": 5089.52,
        "end": 5095.52
    },
    {
        "text": " mi costa es mil, de peín pienso que voy a arrancar, mi negocio, no sé qué,",
        "start": 5095.52,
        "end": 5099.52
    },
    {
        "text": " y me va a abarbar, también, a los pocos meses, diez mil.",
        "start": 5099.52,
        "end": 5103.52
    },
    {
        "text": " Entonces, empiezo a ver milistas, crecen, como lo puedo estimar fácil,",
        "start": 5103.52,
        "end": 5107.52
    },
    {
        "text": " el atributo cantidad y el atributo tabla, las relaciones diez, por ejemplo.",
        "start": 5107.52,
        "end": 5113.52
    },
    {
        "text": " Ya dejó de ser una, pasó ser diez. Me sirve esto,",
        "start": 5113.52,
        "end": 5119.52
    },
    {
        "text": " para algo, partimos una decisión para mejorar algo.",
        "start": 5119.52,
        "end": 5123.52
    },
    {
        "text": " ¿Sara la copia?",
        "start": 5123.52,
        "end": 5125.52
    },
    {
        "text": " Me hago una copia.",
        "start": 5125.52,
        "end": 5126.52
    },
    {
        "text": " Y a ver, verdad, se hace una nueva punto de 10 mil.",
        "start": 5126.52,
        "end": 5131.52
    },
    {
        "text": " Sí.",
        "start": 5131.52,
        "end": 5132.52
    },
    {
        "text": " ¿Y van a ir?",
        "start": 5132.52,
        "end": 5134.52
    },
    {
        "text": " Sí, y este te sirve más o menos.",
        "start": 5134.52,
        "end": 5136.52
    },
    {
        "text": " Hay algo que cambiaría yo, ¿qué cambiaría, vos?",
        "start": 5136.52,
        "end": 5139.52
    },
    {
        "text": " ¿Qué haces?",
        "start": 5140.52,
        "end": 5142.52
    },
    {
        "text": " ¿Qué haces?",
        "start": 5142.52,
        "end": 5144.52
    },
    {
        "text": " La función de jací viene bien y distribuye bien la dejaría.",
        "start": 5144.52,
        "end": 5148.52
    },
    {
        "text": " ¿El tamaño?",
        "start": 5148.52,
        "end": 5149.52
    },
    {
        "text": " ¿Dónde está el tamaño ahí?",
        "start": 5149.52,
        "end": 5151.52
    },
    {
        "text": " En Cota.",
        "start": 5155.52,
        "end": 5156.52
    },
    {
        "text": " Cuando me crea Calclone,",
        "start": 5156.52,
        "end": 5158.52
    },
    {
        "text": " bueno, se canso el...",
        "start": 5160.52,
        "end": 5162.52
    },
    {
        "text": " Cuando me creé el Clone, lo hice del mismo tamaño que sé.",
        "start": 5162.52,
        "end": 5166.52
    },
    {
        "text": " Yo podría decir lo hago de tamaño C por 2.",
        "start": 5167.52,
        "end": 5169.52
    },
    {
        "text": " Entonces, ¿y quién se va a encargar de distribuir lo elemento",
        "start": 5171.52,
        "end": 5174.52
    },
    {
        "text": " en una tabla de tamaño el doble?",
        "start": 5174.52,
        "end": 5175.52
    },
    {
        "text": " El insertar con Junto.",
        "start": 5175.52,
        "end": 5176.52
    },
    {
        "text": " Que lo haga él.",
        "start": 5176.52,
        "end": 5177.52
    },
    {
        "text": " Entonces, cuando yo me hago una copia, pues es una copia,",
        "start": 5177.52,
        "end": 5180.52
    },
    {
        "text": " pero con una tabla más grande, entonces se distribuye.",
        "start": 5180.52,
        "end": 5182.52
    },
    {
        "text": " Entonces, la lita está muy larga.",
        "start": 5182.52,
        "end": 5183.52
    },
    {
        "text": " A insertarse una tabla más grande,",
        "start": 5183.52,
        "end": 5185.52
    },
    {
        "text": " le va a tocar posición de distinta,",
        "start": 5185.52,
        "end": 5187.52
    },
    {
        "text": " porque el módulo va a ser distinto, por ejemplo, ahora.",
        "start": 5187.52,
        "end": 5189.52
    },
    {
        "text": " Entonces, van a toda la lita, van a regresar.",
        "start": 5189.52,
        "end": 5191.52
    },
    {
        "text": " Entonces, esta misma,",
        "start": 5191.52,
        "end": 5193.52
    },
    {
        "text": " pero sin respetar la misma Cota,",
        "start": 5193.52,
        "end": 5195.52
    },
    {
        "text": " haciendo que Cota por un valor, ¿vale?",
        "start": 5195.52,
        "end": 5198.52
    },
    {
        "text": " Puede ser que eso me mejore justamente la distribución de elemento.",
        "start": 5198.52,
        "end": 5202.52
    },
    {
        "text": " Entonces, esto le puedo usar para reestructurar la tabla.",
        "start": 5202.52,
        "end": 5205.52
    },
    {
        "text": " Eso le llama.",
        "start": 5205.52,
        "end": 5206.52
    },
    {
        "text": " ¿Vale?",
        "start": 5206.52,
        "end": 5207.52
    },
    {
        "text": " Si, esto es el preguito de la...",
        "start": 5207.52,
        "end": 5208.52
    },
    {
        "text": " Esa Cota por el mayor de distinta,",
        "start": 5208.52,
        "end": 5210.52
    },
    {
        "text": " es el que es el que es el mejor de distinta.",
        "start": 5210.52,
        "end": 5211.52
    },
    {
        "text": " Sí, puedo tomar algo así.",
        "start": 5211.52,
        "end": 5213.52
    },
    {
        "text": " Hay gente que, como le dije,",
        "start": 5213.52,
        "end": 5215.52
    },
    {
        "text": " usa el tamaño Primo.",
        "start": 5215.52,
        "end": 5216.52
    },
    {
        "text": " Número Primo.",
        "start": 5216.52,
        "end": 5217.52
    },
    {
        "text": " Entonces, los números primos están tabulados.",
        "start": 5217.52,
        "end": 5220.52
    },
    {
        "text": " O sea, hay tablas que...",
        "start": 5220.52,
        "end": 5221.52
    },
    {
        "text": " No, supone de...",
        "start": 5221.52,
        "end": 5223.52
    },
    {
        "text": " Supone de...",
        "start": 5223.52,
        "end": 5224.52
    },
    {
        "text": " Dice el primer Primo, como fue un arreglo con todos los primos cargados.",
        "start": 5224.52,
        "end": 5227.52
    },
    {
        "text": " Está cierto valor.",
        "start": 5227.52,
        "end": 5228.52
    },
    {
        "text": " Entonces, yo digo, a mira, mi tamaño va a ser 10.000.",
        "start": 5228.52,
        "end": 5230.52
    },
    {
        "text": " Entonces, trato de buscar un Primo cercano de 10.000.",
        "start": 5230.52,
        "end": 5233.52
    },
    {
        "text": " Y cuando lo multiplico por 2, voy a esa tabla,",
        "start": 5233.52,
        "end": 5236.52
    },
    {
        "text": " y lo multiplico por 2,",
        "start": 5236.52,
        "end": 5237.52
    },
    {
        "text": " y voy con un Primo cercano a ese valor.",
        "start": 5237.52,
        "end": 5239.52
    },
    {
        "text": " Entonces, tomo eso que es un search en la tabla de Primos.",
        "start": 5239.52,
        "end": 5242.52
    },
    {
        "text": " También, de el valor por 2.",
        "start": 5242.52,
        "end": 5244.52
    },
    {
        "text": " Y me da una próxima para que sea rápido.",
        "start": 5244.52,
        "end": 5246.52
    },
    {
        "text": " Entonces, yo tengo una tabla.",
        "start": 5246.52,
        "end": 5247.52
    },
    {
        "text": " Entonces, esta misma que sirve para copiar algo idéntico,",
        "start": 5247.52,
        "end": 5250.52
    },
    {
        "text": " me sirve para reestructurar una tabla.",
        "start": 5250.52,
        "end": 5252.52
    },
    {
        "text": " Y yo agranda la cota.",
        "start": 5252.52,
        "end": 5254.52
    },
    {
        "text": " ¿Un control?",
        "start": 5254.52,
        "end": 5256.52
    },
    {
        "text": " ¿Un control?",
        "start": 5256.52,
        "end": 5257.52
    },
    {
        "text": " ¿Un control?",
        "start": 5257.52,
        "end": 5258.52
    },
    {
        "text": " ¿Sí?",
        "start": 5258.52,
        "end": 5259.52
    },
    {
        "text": " ¿Un control?",
        "start": 5259.52,
        "end": 5260.52
    },
    {
        "text": " ¿Sí?",
        "start": 5260.52,
        "end": 5261.52
    },
    {
        "text": " ¿Un control?",
        "start": 5261.52,
        "end": 5262.52
    },
    {
        "text": " ¿Un control?",
        "start": 5262.52,
        "end": 5263.52
    },
    {
        "text": " ¿Un control?",
        "start": 5263.52,
        "end": 5264.52
    },
    {
        "text": " ¿Un control?",
        "start": 5264.52,
        "end": 5265.52
    },
    {
        "text": " ¿Un control?",
        "start": 5265.52,
        "end": 5266.52
    },
    {
        "text": " ¿Un control?",
        "start": 5266.52,
        "end": 5267.52
    },
    {
        "text": " ¿Un control?",
        "start": 5267.52,
        "end": 5268.52
    },
    {
        "text": " ¿Sí? ¿Cómo tendrías un control?",
        "start": 5268.52,
        "end": 5270.52
    },
    {
        "text": " ¿Un control?",
        "start": 5270.52,
        "end": 5271.52
    },
    {
        "text": " ¿Un control?",
        "start": 5271.52,
        "end": 5272.52
    },
    {
        "text": " ¿Un control?",
        "start": 5272.52,
        "end": 5273.52
    },
    {
        "text": " Es exact.",
        "start": 5273.52,
        "end": 5274.52
    },
    {
        "text": " La forma de saber si está bien o mal la función de jaz,",
        "start": 5274.52,
        "end": 5277.52
    },
    {
        "text": " es si la letra está muy desparejada.",
        "start": 5277.52,
        "end": 5279.52
    },
    {
        "text": " La forma, ¿no?",
        "start": 5279.52,
        "end": 5281.52
    },
    {
        "text": " La práctica, puedo decir, no, yo te convenzo que sí,",
        "start": 5281.52,
        "end": 5283.52
    },
    {
        "text": " pero después que mire la lista,",
        "start": 5283.52,
        "end": 5285.52
    },
    {
        "text": " si la letra está muy desparejada, es entre sí, o decir,",
        "start": 5285.52,
        "end": 5287.52
    },
    {
        "text": " la función de jaz está, ¿no?",
        "start": 5287.52,
        "end": 5289.52
    },
    {
        "text": " Para esa realidad no está funcionando.",
        "start": 5289.52,
        "end": 5291.52
    },
    {
        "text": " Ahora, si son todas parejas y todas largas,",
        "start": 5291.52,
        "end": 5294.52
    },
    {
        "text": " uno diría, la función de jaz no es la culpable.",
        "start": 5294.52,
        "end": 5296.52
    },
    {
        "text": " El culpable es la cantidad esperada de elementos.",
        "start": 5296.52,
        "end": 5299.52
    },
    {
        "text": " Si todas tienen 10 nodos,",
        "start": 5299.52,
        "end": 5302.52
    },
    {
        "text": " y todos tienen 10 nodos,",
        "start": 5302.52,
        "end": 5304.52
    },
    {
        "text": " la función de jaz no es la culpable.",
        "start": 5304.52,
        "end": 5306.52
    },
    {
        "text": " El tema es que la tabla es muy chiquita para esa dimensión.",
        "start": 5306.52,
        "end": 5309.52
    },
    {
        "text": " Ahí sí, el restructura la tabla.",
        "start": 5309.52,
        "end": 5311.52
    },
    {
        "text": " Entonces, cuando vos detectas que las listas son desparejas,",
        "start": 5311.52,
        "end": 5314.52
    },
    {
        "text": " y eso también lo puedes hacer una inspección entre las dos",
        "start": 5314.52,
        "end": 5317.52
    },
    {
        "text": " y la trela mañana, ¿no?",
        "start": 5317.52,
        "end": 5319.52
    },
    {
        "text": " Así como, restructura las tablas.",
        "start": 5319.52,
        "end": 5321.52
    },
    {
        "text": " En un momento, pues es costoso esta operación.",
        "start": 5321.52,
        "end": 5323.52
    },
    {
        "text": " Tiene que recorrer e insertar todos los nuevos elementos en un caso.",
        "start": 5323.52,
        "end": 5326.52
    },
    {
        "text": " No es orden uno.",
        "start": 5326.52,
        "end": 5327.52
    },
    {
        "text": " Pero lo hace cuando está fuera de línea el sistema,",
        "start": 5327.52,
        "end": 5329.52
    },
    {
        "text": " lo hace de alta, entonces ya después se ve todo esto,",
        "start": 5329.52,
        "end": 5332.52
    },
    {
        "text": " mucho más hachicado acá,",
        "start": 5332.52,
        "end": 5334.52
    },
    {
        "text": " porque está distribuido para abajo.",
        "start": 5334.52,
        "end": 5336.52
    },
    {
        "text": " Entonces, ahí queda mejor.",
        "start": 5336.52,
        "end": 5339.52
    },
    {
        "text": " ¿Cómo lo sabes? ¿Es que sabes?",
        "start": 5339.52,
        "end": 5340.52
    },
    {
        "text": " Inspeccionándoles listas. No hay forma.",
        "start": 5340.52,
        "end": 5342.52
    },
    {
        "text": " No hay otra forma.",
        "start": 5342.52,
        "end": 5343.52
    },
    {
        "text": " En los largos de la lista,",
        "start": 5343.52,
        "end": 5344.52
    },
    {
        "text": " vean que se son muy desparejas.",
        "start": 5344.52,
        "end": 5346.52
    },
    {
        "text": " Podéis llevarte un mini max.",
        "start": 5346.52,
        "end": 5348.52
    },
    {
        "text": " También para ver la lista más grande y la más chiquita.",
        "start": 5348.52,
        "end": 5351.52
    },
    {
        "text": " Es un estimativo medio.",
        "start": 5351.52,
        "end": 5353.52
    },
    {
        "text": " Podéis llevarte una media y después tenéis que buscar.",
        "start": 5353.52,
        "end": 5356.52
    },
    {
        "text": " El tema es que otra función de jaz provés parece dominio.",
        "start": 5356.52,
        "end": 5360.52
    },
    {
        "text": " Ahí no hay funciones de jaz que siempre sean las mejores.",
        "start": 5361.52,
        "end": 5365.52
    },
    {
        "text": " No hay funciones de jaz siempre.",
        "start": 5366.52,
        "end": 5368.52
    },
    {
        "text": " El tamaño primo ayuda un poco.",
        "start": 5368.52,
        "end": 5370.52
    },
    {
        "text": " Está bien para distribuir aunque haya de un séjo.",
        "start": 5370.52,
        "end": 5374.52
    },
    {
        "text": " Está bien, porque es muy raro que sean todos múltiples de mismo primo",
        "start": 5374.52,
        "end": 5377.52
    },
    {
        "text": " que caigan todos los mismos valores.",
        "start": 5377.52,
        "end": 5379.52
    },
    {
        "text": " Está bien.",
        "start": 5379.52,
        "end": 5380.52
    },
    {
        "text": " Pero ahí ya entra una cuestión más probabilista.",
        "start": 5380.52,
        "end": 5383.52
    },
    {
        "text": " Es decir, el hijo otra que...",
        "start": 5383.52,
        "end": 5385.52
    },
    {
        "text": " Está bien.",
        "start": 5385.52,
        "end": 5386.52
    },
    {
        "text": " Lo cierto es que siempre es conveniente,",
        "start": 5386.52,
        "end": 5388.52
    },
    {
        "text": " por ejemplo, en una string no desperdiciar información.",
        "start": 5388.52,
        "end": 5391.52
    },
    {
        "text": " No quedarte con el primer carácter.",
        "start": 5391.52,
        "end": 5393.52
    },
    {
        "text": " Esa toma lo máximo que puedas.",
        "start": 5393.52,
        "end": 5395.52
    },
    {
        "text": " Si hay probabilidad o currencia en los primeros carácter,",
        "start": 5395.52,
        "end": 5398.52
    },
    {
        "text": " es multiplicarlo por un coeficiente.",
        "start": 5398.52,
        "end": 5400.52
    },
    {
        "text": " Pero ustedes no van a entrar en eso.",
        "start": 5400.52,
        "end": 5402.52
    },
    {
        "text": " Pero lo que digo es la realidad pasa eso.",
        "start": 5402.52,
        "end": 5404.52
    },
    {
        "text": " Multiplica el primer dígito por un valor,",
        "start": 5404.52,
        "end": 5407.52
    },
    {
        "text": " el otro cuadráticamente por otro valor.",
        "start": 5407.52,
        "end": 5409.52
    },
    {
        "text": " Y eso se ve que en una distribución de probabilidad",
        "start": 5409.52,
        "end": 5412.52
    },
    {
        "text": " es mejor que el original.",
        "start": 5412.52,
        "end": 5414.52
    },
    {
        "text": " Entonces uno lo va aproximando.",
        "start": 5414.52,
        "end": 5415.52
    },
    {
        "text": " Pero después depende del uso que uno le dé.",
        "start": 5415.52,
        "end": 5417.52
    },
    {
        "text": " Está bien.",
        "start": 5417.52,
        "end": 5418.52
    },
    {
        "text": " O sea, que tan raro, que tan poco raro son los datos.",
        "start": 5418.52,
        "end": 5422.52
    },
    {
        "text": " Pero ven que Hase no es más que una regla de lista",
        "start": 5422.52,
        "end": 5426.52
    },
    {
        "text": " con esas dos decisiones.",
        "start": 5426.52,
        "end": 5427.52
    },
    {
        "text": " Una función que tiene que distribuir más o menos bien.",
        "start": 5427.52,
        "end": 5431.52
    },
    {
        "text": " Pero después, de insertar, buscar y borrar son el conmigo",
        "start": 5431.52,
        "end": 5433.52
    },
    {
        "text": " que ustedes vieron, acceder a un arreglo y después recordar una lista.",
        "start": 5433.52,
        "end": 5437.52
    },
    {
        "text": " La clave es que la función de Hase,",
        "start": 5437.52,
        "end": 5440.52
    },
    {
        "text": " la primera estructura que vemos que tiene que tener dos condiciones.",
        "start": 5440.52,
        "end": 5443.52
    },
    {
        "text": " Distribuir bien y yo tengo que estimar cuántos elementos voy a tener.",
        "start": 5444.52,
        "end": 5448.52
    },
    {
        "text": " Si yo no estimo bien y esto puede crecer mucho y degradarse.",
        "start": 5448.52,
        "end": 5453.52
    },
    {
        "text": " Entonces son...",
        "start": 5453.52,
        "end": 5455.52
    },
    {
        "text": " Esa es más fácil de corregir con esta, con el clone.",
        "start": 5455.52,
        "end": 5458.52
    },
    {
        "text": " La otra, si la función de Hase no es buena,",
        "start": 5458.52,
        "end": 5460.52
    },
    {
        "text": " no es tan fácil de corregir siempre.",
        "start": 5460.52,
        "end": 5463.52
    },
    {
        "text": " Ahí depende de estudiar un poco más el dominio",
        "start": 5463.52,
        "end": 5465.52
    },
    {
        "text": " y ver qué función de Hase adapta mejor a ese dominio.",
        "start": 5465.52,
        "end": 5469.52
    },
    {
        "text": " Bueno, hoy dejamos acá, vamos bien en hora,",
        "start": 5470.52,
        "end": 5474.52
    },
    {
        "text": " se ha de tener alguna pregunta y seguimos la semana que viene",
        "start": 5474.52,
        "end": 5479.52
    },
    {
        "text": " con árboles balanceado y un complemento de esto.",
        "start": 5479.52,
        "end": 5483.52
    }
]