[
    {
        "text": " que si me cuentan qué fue lo que dijimos al final de la última clase.",
        "start": 0.0,
        "end": 4.16
    },
    {
        "text": " Bien, ese lo hicimos, ese nos costó un montón, no costó pila.",
        "start": 11.040000000000001,
        "end": 15.8
    },
    {
        "text": " Después viene ahí una sección que le iba a dar ya la desechera de la sección 1.3,",
        "start": 17.56,
        "end": 23.32
    },
    {
        "text": " que habla de su conoce extremales y caras, es muy interesante digamos,",
        "start": 23.32,
        "end": 29.12
    },
    {
        "text": " porque se acerca de una cuestión geométrica, presenta una cuestión geométrica,",
        "start": 29.12,
        "end": 33.04
    },
    {
        "text": " generalizada que está bueno, pero bueno, eso no lo podemos dar, vamos a hacer.",
        "start": 33.04,
        "end": 38.6
    },
    {
        "text": " Y me voy directamente a la sección 2, esto es lo de Jurratito por si viene",
        "start": 38.6,
        "end": 43.400000000000006
    },
    {
        "text": " algún compañero más tarde, después lo borramos, nos vamos a la sección 2 del",
        "start": 43.400000000000006,
        "end": 48.120000000000005
    },
    {
        "text": " capítulo, no estaba recordando el que cuando les presenté el concepto de cono,",
        "start": 48.12,
        "end": 52.519999999999996
    },
    {
        "text": " cuando les dije la definición de conoce tener, esencialmente si se acuerdan,",
        "start": 52.519999999999996,
        "end": 60.04
    },
    {
        "text": " les dije el cono prototípico es el cono positivo, el cono prototípico es el",
        "start": 60.04,
        "end": 65.0
    },
    {
        "text": " cono positivo, o sea dentro de RN, el conjunto de vectores que tiene todas sus",
        "start": 65.0,
        "end": 70.24
    },
    {
        "text": " coordenadas mayor igual que 0, es el cono prototípico. Pensémoslo siempre,",
        "start": 70.24,
        "end": 74.03999999999999
    },
    {
        "text": " los ejemplos prototípicos son lo que te dejan pensar en un ejemplo como si fuera",
        "start": 74.04,
        "end": 79.08000000000001
    },
    {
        "text": " la teoría todo, y les decía una matriz tiene entradas positivas, mayor",
        "start": 79.08000000000001,
        "end": 89.12
    },
    {
        "text": " y igual es que 0, si solamente sí cuando transforma el cono prototípico, el",
        "start": 89.12,
        "end": 94.4
    },
    {
        "text": " cono positivo, lo deja dentro del cono positivo, se acuerdan esa presentación",
        "start": 94.4,
        "end": 99.44000000000001
    },
    {
        "text": " que hicimos, por eso se entendíamos la importancia de los coros, entonces",
        "start": 99.44,
        "end": 104.44
    },
    {
        "text": " va a ir a pena contarles, el perrón, el terreno de perrón provenius es para ese",
        "start": 104.44,
        "end": 112.96
    },
    {
        "text": " cono, el cono positivo y el de Virkhoff que vamos a dar que es más general es para",
        "start": 112.96,
        "end": 118.96
    },
    {
        "text": " cualquier cono, lo hacemos para cualquier cono y lo aplicamos al cono positivo, ese es el",
        "start": 118.96,
        "end": 124.6
    },
    {
        "text": " salto que se da esa generalización, bien les iba a decir algo más, bueno entonces en",
        "start": 124.6,
        "end": 135.44
    },
    {
        "text": " especial está el concepto que deja invariante, o sea ahí mismo cuando le",
        "start": 135.44,
        "end": 139.48
    },
    {
        "text": " presenta el concepto del cono surge el tema que deja invariante, eso es exactamente",
        "start": 139.48,
        "end": 145.35999999999999
    },
    {
        "text": " el concepto que empieza ahora, que vamos a empezar a utilizar, o sea si tenés una",
        "start": 145.35999999999999,
        "end": 150.04
    },
    {
        "text": " matriz en vez de R, tenés un cono en B igual a R N, un cono como hemos definido",
        "start": 150.04,
        "end": 163.84
    },
    {
        "text": " el azúcar, el clases decimos que ha deja invariante, acá si ha de K está incluido",
        "start": 163.84,
        "end": 177.68
    },
    {
        "text": " en K, ok, incluido amplio, bien, está perfecto, eso es, ya lo habíamos manejado, ese",
        "start": 177.68,
        "end": 195.64000000000001
    },
    {
        "text": " concepto, produce un par de ejemplos, veamos un par de ejemplos para amenizar y para",
        "start": 195.64000000000001,
        "end": 204.64000000000001
    },
    {
        "text": " entendernos, el primero es el que acabo de mencionar que es el ejemplo incluso que",
        "start": 204.64,
        "end": 210.0
    },
    {
        "text": " use para atraer la noción de cono, entonces si tenemos que a es una matriz positiva, la",
        "start": 210.0,
        "end": 222.32
    },
    {
        "text": " notación ya estamos acostumbrados, a mayor igual que cero, entonces ya sabemos que más",
        "start": 222.32,
        "end": 232.11999999999998
    },
    {
        "text": " que entonces es un ciso de los sí, pero por ahora quiero destacar el ejemplo como tal,",
        "start": 232.12,
        "end": 237.68
    },
    {
        "text": " adeca más, pero adeve más, está incluido, ve más, siendo ve más el cono positivo de R N,",
        "start": 237.68,
        "end": 250.4
    },
    {
        "text": " que también lo presentamos, y como dijimos recién, esto es el ejemplo, está ahí está",
        "start": 250.4,
        "end": 255.88
    },
    {
        "text": " el ejemplo, pero como dijimos recién, esto es un ciso de los sí, y está bueno saberlo,",
        "start": 255.88,
        "end": 261.28
    },
    {
        "text": " ¿no? También lo dijimos en la clase pasada, que es un ciso de los sí, bueno, que es el ejemplo",
        "start": 261.28,
        "end": 266.24
    },
    {
        "text": " 1, ejemplo 2, si tenemos la matriz, por ejemplo 1 a menos 1, con a mayor que cero, entonces",
        "start": 266.24,
        "end": 284.0
    },
    {
        "text": " resulta que si multiplicamos, a por un vector xc, esto nos queda x, x más ahí, el coro positivo,",
        "start": 284.0,
        "end": 304.48
    },
    {
        "text": " el coro positivo, x más ahí, x menos sí, ahora si te acuentes también, x más ahí,",
        "start": 304.48,
        "end": 313.36
    },
    {
        "text": " x menos sí, perfecto, ¿no? Entonces, ¿qué pasa? Si ahora considero, estoy en este ejemplo,",
        "start": 313.36,
        "end": 321.24
    },
    {
        "text": " ¿no? Si considero este el cono, acá los x y perteneciente a R 2, tal que 0,",
        "start": 321.24,
        "end": 335.36
    },
    {
        "text": " menor igual que i, menor igual que x, si vimos para acá arriba voy a dibujar ese cono,",
        "start": 335.36,
        "end": 342.84000000000003
    },
    {
        "text": " tiene R 2, voy a cambiar este, o sea, son los x y tal que la i, menor igual que x, a ver,",
        "start": 342.84,
        "end": 359.84
    },
    {
        "text": " ¿cómo es la cosa? Acá, y todo, y todo mayor igual que cero, pero no me olvides decir,",
        "start": 359.84,
        "end": 368.64
    },
    {
        "text": " la i y todo mayor igual que cero, que acá y acá no, ¿no? Este sería el cono,",
        "start": 368.64,
        "end": 381.56
    },
    {
        "text": " no lo llamamos acá, este sería R 2, ahí va, esto se que pasa, cuando esto sucede fíjense,",
        "start": 381.56,
        "end": 401.84000000000003
    },
    {
        "text": " es verdad que x menos y es menor igual que x más ahí y que x menos y es mayor igual que cero,",
        "start": 401.84000000000003,
        "end": 408.72
    },
    {
        "text": " o sea, quiero probar que a transforma el cono en el cono, ¿es verdad?",
        "start": 409.28000000000003,
        "end": 412.52000000000004
    },
    {
        "text": " Parece que sí, ¿no? Porque x menos y es mayor igual que cero, porque x más y",
        "start": 418.92,
        "end": 424.20000000000005
    },
    {
        "text": " igual que y y la segunda, yo lo que quiero también es que esta es más grande que esta,",
        "start": 424.20000000000005,
        "end": 433.44000000000005
    },
    {
        "text": " pero si vuelos restas te da ahí más y, como es mayor igual que cero, y es mayor igual que cero,",
        "start": 433.44,
        "end": 440.52
    },
    {
        "text": " ahí más y es mayor igual que cero, entonces la diferencia quiere decir que x más",
        "start": 440.52,
        "end": 447.88
    },
    {
        "text": " ahí es mayor igual a x menos y que es mayor igual que cero, ¿no? Esto implica esto y esto",
        "start": 447.88,
        "end": 465.68
    },
    {
        "text": " implica esto junto con el hecho que es mayor que cero, ¿cierto? Bueno, entonces ese otro ejemplo",
        "start": 465.68,
        "end": 480.92
    },
    {
        "text": " que transforma el cono en el cono, ¿tá? Bueno, muy bien, quiere decir que no está solo ejemplo prototípico,",
        "start": 480.92,
        "end": 488.64
    },
    {
        "text": " pero está barbaro, sino que también tenemos este otro ejemplo y habrá muchos más,",
        "start": 488.64,
        "end": 495.03999999999996
    },
    {
        "text": " bueno muy bien, ahora voy a recordar un poquitito, ya voy a borrar acá, si bien alguien más lo",
        "start": 496.64,
        "end": 505.76
    },
    {
        "text": " verá en el Eva, las fechas, voy a recordar cosas que ustedes ya saben y que vimos también en este",
        "start": 505.76,
        "end": 514.4399999999999
    },
    {
        "text": " curso, pero para que sea más fácil ahora la discusión en clase, la voy a recordar antes y",
        "start": 514.44,
        "end": 520.2800000000001
    },
    {
        "text": " también voy a hacer un limita de números complejos, bastante sencillo, pero mejor hacerlo antes y",
        "start": 520.2800000000001,
        "end": 525.48
    },
    {
        "text": " no dentro de la demostración. Entonces, recordemos algunas cosas, por ejemplo, si tenemos que el",
        "start": 525.48,
        "end": 538.32
    },
    {
        "text": " espectro, tenemos enomatrizada, cuadrada, ¿sí? y tenemos que el espectro de A, es la anda 1,",
        "start": 538.32,
        "end": 550.32
    },
    {
        "text": " la anda 2, la anda n, que pueden haber varios propios repetidos ahí, la notación que abusan",
        "start": 550.32,
        "end": 558.5200000000001
    },
    {
        "text": " lenguajes, ¿si está en verdad? Porque si fuera un conjo, entonces ya sabemos, es una notación con",
        "start": 558.5200000000001,
        "end": 564.2800000000001
    },
    {
        "text": " abuso del lenguaje. Entonces, y suponete que, bueno que el anda, es la anda 1, digamos, es un valor",
        "start": 564.28,
        "end": 571.92
    },
    {
        "text": " propio, el primero, simplemente para jugar siempre con el mismo valor propio, pero puede ser cualquiera.",
        "start": 571.92,
        "end": 578.04
    },
    {
        "text": " Entonces, teníamos el polinembio carácterístico en donde aparecen todos los valores propios,",
        "start": 578.04,
        "end": 586.76
    },
    {
        "text": " elevados a potencias que la llamamos, bueno, alpha 1, alpha 2, hasta alpha. ¿Cuántos valores",
        "start": 586.76,
        "end": 600.72
    },
    {
        "text": " propios puse? N, no vamos a poner ese, perdón, puse N, está bien, voy a poner ese, porque prefiero",
        "start": 600.72,
        "end": 613.4
    },
    {
        "text": " usar la notación en donde los valores propios repetidos están todos sobre el mismo",
        "start": 613.4,
        "end": 618.64
    },
    {
        "text": " lugar, disculpen, había puesto N, acá no hay abusos del lenguaje, se fue el abuso del lenguaje,",
        "start": 618.64,
        "end": 624.4
    },
    {
        "text": " bueno, y acá queda la anda 1, alpha 1. Digo, porque quiero que tengan la misma, tiene que",
        "start": 624.4,
        "end": 633.56
    },
    {
        "text": " terminar, que coincidan todas las notaciones. Y tenemos el polinembio minimal, voy a poner",
        "start": 633.56,
        "end": 641.54
    },
    {
        "text": " los apelliditos, es el carácterístico, el es el minimal. En el minimal todos sabemos que",
        "start": 641.54,
        "end": 662.78
    },
    {
        "text": " aparecen todas las mismas raíces, pero van a aparecer exponentes, beta 1, beta 2, beta",
        "start": 662.78,
        "end": 674.8199999999999
    },
    {
        "text": " s. Entonces, ¿qué podemos decir de los betas?",
        "start": 674.8199999999999,
        "end": 682.3399999999999
    },
    {
        "text": " Bien, es el menor igual en los alfos, ¿qué es?",
        "start": 682.34,
        "end": 685.62
    },
    {
        "text": " Veta 1, menos igual que alpha 1, y los beta i más es igual que 1, ciertos todos. Bien,",
        "start": 685.62,
        "end": 698.94
    },
    {
        "text": " por ejemplo, si habíamos recordando, ¿cuál es la multiplicidad algebraica, por ejemplo,",
        "start": 698.94,
        "end": 706.26
    },
    {
        "text": " el anda 1?",
        "start": 706.26,
        "end": 709.26
    },
    {
        "text": " ¿Ajú, el anda 1?",
        "start": 709.26,
        "end": 712.26
    },
    {
        "text": " Ah, y va, el anda i es alpha i. No tiene por qué estar escrita acá en la notación,",
        "start": 712.26,
        "end": 719.72
    },
    {
        "text": " algunas respuestas van a tener que inventar, decirme, correspondía tal cosa, por ejemplo,",
        "start": 719.72,
        "end": 726.38
    },
    {
        "text": " valer la multiplicidad geométrica del anda i.",
        "start": 726.38,
        "end": 743.46
    },
    {
        "text": " Sí, y desde el punto de vista del bloque de Jordán, ha asociado el anda i, la cantidad",
        "start": 743.46,
        "end": 749.42
    },
    {
        "text": " del bloque de Jordán, exactamente. Entonces, el número, perdón, que voy a poner palabras",
        "start": 749.42,
        "end": 759.4599999999999
    },
    {
        "text": " informales, pero para que nos sentamos de bloque de Jordán dentro del bloque de Jordán,",
        "start": 759.4599999999999,
        "end": 776.54
    },
    {
        "text": " se ha asociado al anda i, exactamente. ¿Qué corresponde, como habían dicho, a la",
        "start": 776.54,
        "end": 783.92
    },
    {
        "text": " dimensión del núcleo, ¿no?",
        "start": 783.92,
        "end": 786.3399999999999
    },
    {
        "text": " del núcleo, cuando le resta la anda i, ves la entidad. Y por ejemplo, otra pregunta más",
        "start": 786.3399999999999,
        "end": 792.56
    },
    {
        "text": " había puesto yo acá. ¿Cuál es el tamaño de bloque de Jordán más grande ha asociado",
        "start": 792.56,
        "end": 798.86
    },
    {
        "text": " al anda i? Exactamente. Beta i es igual al tamaño del bloque de Jordán, de todos estos",
        "start": 798.86,
        "end": 812.5
    },
    {
        "text": " del que están adentro del bloque grande, del bloque de Jordán más grande ha asociado",
        "start": 812.5,
        "end": 823.02
    },
    {
        "text": " de todos los que están dentro del bloque grande, el que tiene el tamaño mano. Bien, está bien,",
        "start": 824.02,
        "end": 833.18
    },
    {
        "text": " eso es lo que me hay en tu repaso, porque ahora vamos a empezar a usar esta maquinaria,",
        "start": 833.18,
        "end": 836.66
    },
    {
        "text": " un montón de veces. Una cosa más voy a repasar, voy a repasar una cosa más, y además voy a ser",
        "start": 836.66,
        "end": 848.5799999999999
    },
    {
        "text": " en el limitado de números complejos. Si tenemos, sigue el repaso, ¿no? Le hicimos juntos también",
        "start": 848.58,
        "end": 854.34
    },
    {
        "text": " esto. Si tenemos el bloque de Jordán, js mu, holanda, holanda, holanda. Bueno, le llamamos muy",
        "start": 854.34,
        "end": 872.5
    },
    {
        "text": " simplemente porque dentro del teorema el lambda es un específico y me quiero que sea cualquier.",
        "start": 872.5,
        "end": 877.3
    },
    {
        "text": " Muy es un vallo propio, cualquiera de estos. Entonces, tomo el bloque, este, un bloque de",
        "start": 878.7,
        "end": 891.42
    },
    {
        "text": " Jordán. Cuando digo un bloque, un bloque solo, no todo de los de los de los de los de la Anda",
        "start": 891.42,
        "end": 895.7
    },
    {
        "text": " ahí, sino cada componente de estos. Un bloque que no se puede partir, un bloque indiscomponible",
        "start": 895.7,
        "end": 903.5400000000001
    },
    {
        "text": " de Jordán. Pero no lo quiero jota ese lamo, quiero jota ese lamo en la R que lo calculamos juntos,",
        "start": 903.5400000000001,
        "end": 908.9000000000001
    },
    {
        "text": " que nos de un laburo pero que ya nos sirvió y nos va a servir de vuelta hoy. Si recuerdo bien,",
        "start": 909.7,
        "end": 915.0200000000001
    },
    {
        "text": " usted me va a ayudar. En los originales, mumumumumum, uno o uno, uno, todo el más cero.",
        "start": 915.0200000000001,
        "end": 920.5400000000001
    },
    {
        "text": " ¿Cierto? A la cero de la identidad, cero, cero. A la uno de la bloque de Jordán. A la dos y",
        "start": 921.06,
        "end": 928.38
    },
    {
        "text": " así la vimos calculado todos, ayúdame, creo que daba, mumum. Ahí va.",
        "start": 928.38,
        "end": 934.62
    },
    {
        "text": " A la R-1, R por mumum, R-1 y acá combinaciones de R tomado por mumum a R-2. Acá R por mumum a R-1, R por mumum,",
        "start": 935.5,
        "end": 956.1
    },
    {
        "text": " a R-1 y la otra vez lo hicimos más bonito porque lo fuimos colores, ¿sacurado? Para que no",
        "start": 956.1,
        "end": 967.22
    },
    {
        "text": " si nos mezclaron. Entonces bueno, la diaguna en el negro, acá le habíamos puesto otro color que",
        "start": 967.22,
        "end": 974.3000000000001
    },
    {
        "text": " no lo voy a borrar ahora porque ya están negro también. Acá hay un cero grande o te y después,",
        "start": 974.3000000000001,
        "end": 983.34
    },
    {
        "text": " por ejemplo, venía combinaciones de R tomado de 2, de mua a R-2.",
        "start": 983.34,
        "end": 990.02
    },
    {
        "text": " Ahí va. Y esto sigue.",
        "start": 994.9,
        "end": 997.86
    },
    {
        "text": " Y el... Sí, vamos a tomar el R, mayor igual que ese sí, porque va a tomar un límite.",
        "start": 1002.94,
        "end": 1012.1800000000001
    },
    {
        "text": " Entonces tomemos el R-1 igual que ese, R-1 igual que ese porque vamos a el R grande y eso",
        "start": 1012.18,
        "end": 1020.8199999999999
    },
    {
        "text": " que está en verde como no me cabe ahí lo pongo acá. Nos quedaba combinaciones de R tomado en",
        "start": 1020.8199999999999,
        "end": 1033.6599999999999
    },
    {
        "text": " ese menos 1 mua a R-1. Eso es lo que va a ir en verde. Es un rellenado ahí.",
        "start": 1033.66,
        "end": 1046.98
    },
    {
        "text": " Que no me cabe ahí. Este es este. Bueno, de hecho los que son R por mua a R-1 también se pueden",
        "start": 1046.98,
        "end": 1059.46
    },
    {
        "text": " escribir como combinaciones de R tomado en 1, ¿no? En verdad, todo eso y acá combinaciones",
        "start": 1059.46,
        "end": 1063.82
    },
    {
        "text": " de R tomado en cero en el diagonal. Todos se pueden escribir como combinaciones. Todo esto",
        "start": 1063.82,
        "end": 1069.98
    },
    {
        "text": " lo hicimos juntos y todo va a aparecer en la clase en el próximo teorema. Y voy a hacer, entonces un",
        "start": 1069.98,
        "end": 1076.3
    },
    {
        "text": " lema de número complejos. Entonces un lema muy sencillo que casi no tiene demostraciones,",
        "start": 1076.3,
        "end": 1085.3400000000001
    },
    {
        "text": " es una observación. Supongamos que tenemos un número complejo que no es real, un número",
        "start": 1085.34,
        "end": 1099.34
    },
    {
        "text": " complejo que no es real. Entonces el número lambda se anota así, ¿no? Este se los pongo",
        "start": 1099.34,
        "end": 1115.78
    },
    {
        "text": " así. Y anguló, angulotito. Es realidad que me quisiera usar la notación del... Sí, voy",
        "start": 1115.78,
        "end": 1134.06
    },
    {
        "text": " a usar la notación de exponenciales. O sea, es el módulo de lambda, por el a y a alpha",
        "start": 1134.06,
        "end": 1147.5
    },
    {
        "text": " siendo alpha el anguló, o podría dar puestotita el anguló de lambda. Esto lo vieron alguna",
        "start": 1147.5,
        "end": 1158.6599999999999
    },
    {
        "text": " vez en calculo 2, calculo 3, la exponencial compleja, está. Váruas, por un momento pensé",
        "start": 1158.66,
        "end": 1164.98
    },
    {
        "text": " que no y lo fíjese acá, pero está. Ahora, esto no es nada, simplemente que estoy escribiendo",
        "start": 1164.98,
        "end": 1170.8200000000002
    },
    {
        "text": " el amnacial. Cuando digo que es complejo y no es real lo que estoy diciendo es que alpha",
        "start": 1170.8200000000002,
        "end": 1175.38
    },
    {
        "text": " es 5, es 0, ¿no? O alpha es 5 de p, también. No es ni 0 ni p. Entonces, ¿qué tiene",
        "start": 1175.38,
        "end": 1187.0600000000002
    },
    {
        "text": " un anguló? Entonces, ¿qué pasa? Yo lo que digo es esto, ¿qué pasa cuando uno le va",
        "start": 1187.0600000000002,
        "end": 1193.98
    },
    {
        "text": " el lambda de vuelta? No, el proceso de elevar lambda, lambda, lambda, lambda, lambda",
        "start": 1193.98,
        "end": 1198.3400000000001
    },
    {
        "text": " que, por tener en la sucesión de lambda a la r, la r, la r, la 0 que es el 1, la r, que es el",
        "start": 1199.34,
        "end": 1208.34
    },
    {
        "text": " que acabamos de escribir, lambda al cuadrado, que es la norma de lambda al cuadrado, por e a la y 2",
        "start": 1208.34,
        "end": 1219.3
    },
    {
        "text": " alpha y así vamos, ¿no? Supongamos por un instante porque realidad ni siquiera necesito",
        "start": 1219.3,
        "end": 1225.82
    },
    {
        "text": " alcanza a ver, también. Yo lo que digo es lo siguiente, que nosotros en esta sucesión",
        "start": 1225.82,
        "end": 1245.3799999999999
    },
    {
        "text": " de potencias podemos encontrar un mínimo, un primer momento de tal manera, se los voy",
        "start": 1245.38,
        "end": 1258.8600000000001
    },
    {
        "text": " a dibujar y después los escribimos, ¿vos tenés? La lambda, ¿pensemoslo? En el dibujo, en el",
        "start": 1258.8600000000001,
        "end": 1270.94
    },
    {
        "text": " dibujo lo voy a hacer con módulo de lambda, es igual 1 para que no se salga de círculo",
        "start": 1270.94,
        "end": 1276.5
    },
    {
        "text": " para que se vea mejor, pero el módulo de lambda no juega un papel importante para nada.",
        "start": 1276.5,
        "end": 1281.3
    },
    {
        "text": " Entonces, digo que al elevar las potencias no se vaya agrandando que si no me quedan el",
        "start": 1281.3,
        "end": 1286.8200000000002
    },
    {
        "text": " dibujo, ¿no? Entonces, bueno, aquí hay un que es horrible, como siempre, ¿sí?",
        "start": 1286.8200000000002,
        "end": 1297.7
    },
    {
        "text": " Bien, un poco mejor. Ellos se ponen el que está de lambda, que tenían gulo alpha acá.",
        "start": 1300.94,
        "end": 1309.94
    },
    {
        "text": " Te voy a hacer más con más ángulo alpha para no tener que dibujar tantos, acá está",
        "start": 1309.94,
        "end": 1321.94
    },
    {
        "text": " lambda con ángulo alpha. Entonces, como lo hice de norma 1 para no coplicarme, bueno,",
        "start": 1321.94,
        "end": 1333.7
    },
    {
        "text": " por acá está la lambda cuadrado, lambda cubo, lambda la cuarta y en algún momento esto sigue,",
        "start": 1333.7,
        "end": 1348.54
    },
    {
        "text": " lambda cuadrado, lambda cubo, si la norma de lambda no es 1 o se va agrandando o se van",
        "start": 1348.54,
        "end": 1355.6599999999999
    },
    {
        "text": " achicando los módulos, pero este dibujo lo tome con 1. Yo lo que digo es que existe",
        "start": 1355.6599999999999,
        "end": 1367.52
    },
    {
        "text": " un momento a partir del cual vos podés atrapar el 0 como combinación lineal un momento",
        "start": 1367.52,
        "end": 1375.94
    },
    {
        "text": " cubo, cubo el momento como combinación lineal desde igual 0 hasta cubo, de coeficiente",
        "start": 1375.94,
        "end": 1384.66
    },
    {
        "text": " reales se suí por lambda la y, entonces todo lo se suí perteneciente a la y. Y eso",
        "start": 1384.66,
        "end": 1397.14
    },
    {
        "text": " es no es nada en realidad lo que estoy diciendo, pero se usan al medio del teorema y entonces",
        "start": 1397.14,
        "end": 1400.78
    },
    {
        "text": " lo querías separar. Y eso, obvio, porque vos agarras lambda, lambda cuadrado, en un momento",
        "start": 1400.78,
        "end": 1405.5800000000002
    },
    {
        "text": " lo que vos diste la vuelta, incluso antes de la vuelta, después que vos ya lograste",
        "start": 1405.58,
        "end": 1410.46
    },
    {
        "text": " tener una orientación digamos. Lo que hay en un momento es un poco más yo le estoy",
        "start": 1410.46,
        "end": 1431.86
    },
    {
        "text": " probando que tengo que usar todo, si ya se me complica. Lo que quiero es que puedo",
        "start": 1431.86,
        "end": 1436.62
    },
    {
        "text": " tener una combinación lineal positiva de los lambda que me dé 0, pero eso es ni bien",
        "start": 1436.62,
        "end": 1442.58
    },
    {
        "text": " te diste la vuelta, si gastes hasta cierto punto por acá abajo digamos y si, vos tomás",
        "start": 1442.58,
        "end": 1452.2199999999998
    },
    {
        "text": " este vector. Claro, claro. Lo único que, por ejemplo en",
        "start": 1452.2199999999998,
        "end": 1461.74
    },
    {
        "text": " este dibujo acá no puedo todavía, no me alcanza las potencias, porque los coeficiente",
        "start": 1461.74,
        "end": 1468.38
    },
    {
        "text": " son positivos, pero ni bien lo veré que se ha me fui para abajo, acá tampoco me alcanza,",
        "start": 1468.38,
        "end": 1473.02
    },
    {
        "text": " creo, ¿no? No, pero toda la vuelta entera no, Santiago mira, yo digo que acá alcanza",
        "start": 1473.02,
        "end": 1479.5
    },
    {
        "text": " en el dibujo, con este alcanza, porque este y estos dos, ya claro, lo gras con estos dos",
        "start": 1479.5,
        "end": 1487.06
    },
    {
        "text": " y este lo grasas una combinación que te desea, se entiende? Entonces ni bien digamos",
        "start": 1487.06,
        "end": 1491.82
    },
    {
        "text": " este pasas, formalmente creo que es esto, ¿no chicos? Si vos tomás esta recta, ni bien",
        "start": 1491.82,
        "end": 1499.86
    },
    {
        "text": " pasas esta recta, vas a lograr la combinación positiva, no usando todos, pero usando",
        "start": 1499.86,
        "end": 1505.26
    },
    {
        "text": " algunos de ellos, ahora. Y eso porque se da y porque la alfamos, si acaba de decir que",
        "start": 1505.26,
        "end": 1512.7
    },
    {
        "text": " el alfano es cero, va sumando, va sumando, va sumando en un momento. Si, sí, si, si.",
        "start": 1512.78,
        "end": 1517.94
    },
    {
        "text": " ¿O sea, si sí, que es un masivo de acero, o sea, realidad son las dos que te han descomar",
        "start": 1517.94,
        "end": 1521.54
    },
    {
        "text": " lo? Si, los que alcanza con dos y un o más, acá tres, pero no nos interesa eso, o sea.",
        "start": 1521.54,
        "end": 1526.3600000000001
    },
    {
        "text": " No nos interesa eso, o sea. Claro. Ah, si, si, no tengo que colocar mayor igual que",
        "start": 1526.3600000000001,
        "end": 1537.5800000000002
    },
    {
        "text": " cero, cuando se alcanza, si, si, sí. Sí, sí, pero como hay mayor igual que cero,",
        "start": 1537.5800000000002,
        "end": 1542.46
    },
    {
        "text": " pero quiero que lo aclaro esto, es bastante sencillo pero si no lo pongo aparte que lo",
        "start": 1542.46,
        "end": 1547.58
    },
    {
        "text": " número complejo que existe que, entonces lo importante es cuál es Uricent que existe",
        "start": 1547.58,
        "end": 1554.7
    },
    {
        "text": " un momento Q sería la potencia a la cual tengo que llegar de tal manera de su, o sea",
        "start": 1554.7,
        "end": 1561.42
    },
    {
        "text": " a ver, eso así no, yo creo que la demostración sería Cacu, C-N tal que N por alpha, Cacu",
        "start": 1561.42,
        "end": 1569.74
    },
    {
        "text": " perdón, tal que Q por alpha es mayor que P, o sea en que momento pasaste P, no P no tengo",
        "start": 1569.74,
        "end": 1582.6200000000001
    },
    {
        "text": " que poner, a Q, Q más 1 por alpha, Q más 1 por alpha mayor que P, este y todo lo otro",
        "start": 1582.6200000000001,
        "end": 1594.66
    },
    {
        "text": " lado, pero con la cosa en alguno en Q, o sea sí, sí, se va a quedar, o sea el poder",
        "start": 1594.66,
        "end": 1601.3000000000002
    },
    {
        "text": " dejar de pa' irse y pero yo no he quedado vos, o sea, que el alpha más cercano al Cero",
        "start": 1601.3000000000002,
        "end": 1606.3400000000001
    },
    {
        "text": " por arriba y tiene a ser otro lado, bueno, que es más poder bajo de la recta, es que",
        "start": 1606.3400000000001,
        "end": 1612.38
    },
    {
        "text": " queda, pero me lo quiero dar. Que con 2 tal cansan, decís? Sí, claro. Ah, pues sí, sí,",
        "start": 1612.38,
        "end": 1617.8600000000001
    },
    {
        "text": " probablemente sí. Una vez que pasa a cierta línea que probablemente sea la más chica,",
        "start": 1617.8600000000001,
        "end": 1622.42
    },
    {
        "text": " o sea la más cercana al EKV, sí, te recuerda.",
        "start": 1622.42,
        "end": 1626.66
    },
    {
        "text": " Una, ¿cómo no se actorá?",
        "start": 1627.5,
        "end": 1630.02
    },
    {
        "text": " Sí, para que pueda ser al OÈ con un rifle, no?- girl, vamos a dar colló del 75.",
        "start": 1630.42,
        "end": 1634.9
    },
    {
        "text": " Lo que lo voy a dar tiene a comprar el rifle al EKV para que Landing Germain como",
        "start": 1634.9,
        "end": 1639.18
    },
    {
        "text": " venbones, hay que dejar de tener que ver algo por una de las sasheras, si la거를",
        "start": 1639.18,
        "end": 1647.18
    },
    {
        "text": " de allá gracias al OÈ, claro que muestranceís esta leuke orang está enoa.",
        "start": 1647.18,
        "end": 1649.3000000000002
    },
    {
        "text": " Están enoa o염isos WITH, cuando al OÈ deНА saliva en la Cero como a la중에厲害",
        "start": 1649.3000000000002,
        "end": 1654.28
    },
    {
        "text": " ¿Cómo sirve el que se lo sí?",
        "start": 1654.28,
        "end": 1655.28
    },
    {
        "text": " Cuando no sé si el cansa que vine.",
        "start": 1655.28,
        "end": 1662.28
    },
    {
        "text": " Yo digo sí, no digo el ín, yo no digo el ín, el ín, puede ser cualquiera.",
        "start": 1662.28,
        "end": 1669.28
    },
    {
        "text": " Yo digo que al tomar el lambda más cercano, imagínate tú, es una colección de la",
        "start": 1669.28,
        "end": 1675.28
    },
    {
        "text": " plana.",
        "start": 1675.28,
        "end": 1676.28
    },
    {
        "text": " Sí.",
        "start": 1676.28,
        "end": 1677.28
    },
    {
        "text": " Al tomar el más cercano, ahí está el jefe, te va a quedar que la recta, o sea,",
        "start": 1677.28,
        "end": 1680.28
    },
    {
        "text": " tienes que tomar otro lambda, cuya recta sea, digamos, paso por esa línea.",
        "start": 1680.28,
        "end": 1685.28
    },
    {
        "text": " Cuando más chico sea más fácil de encontrar el amo.",
        "start": 1685.28,
        "end": 1689.28
    },
    {
        "text": " El amo está dado.",
        "start": 1689.28,
        "end": 1690.28
    },
    {
        "text": " Sí, claro, porque si tienes un lambda, digamos, así, va a ser muy difícil encontrar",
        "start": 1690.28,
        "end": 1695.28
    },
    {
        "text": " una que...",
        "start": 1695.28,
        "end": 1696.28
    },
    {
        "text": " Claro, sí, sí, siempre va a aparecer.",
        "start": 1696.28,
        "end": 1700.28
    },
    {
        "text": " Pero me refiero que siempre va a ser más fácil encontrar con un lambda más cercano",
        "start": 1700.28,
        "end": 1706.28
    },
    {
        "text": " acá y luego que termine de pasar a la línea, digamos.",
        "start": 1706.28,
        "end": 1710.28
    },
    {
        "text": " Pero yo no veo que alcanza con 12 y distinto de 0, para mí necesitas 13 y distinto de 0.",
        "start": 1710.28,
        "end": 1715.28
    },
    {
        "text": " Yo quedo 2 por esto, o sea, te va a quedar 1, te va a formar una recta y el otro,",
        "start": 1715.28,
        "end": 1721.28
    },
    {
        "text": " capaz que no la pasa, capaz que al final termines de un motor, que no pasa una recta y que si sumas 2,",
        "start": 1721.28,
        "end": 1726.28
    },
    {
        "text": " capaz que si también pasa.",
        "start": 1726.28,
        "end": 1727.28
    },
    {
        "text": " Porque el tema es así, cuando...",
        "start": 1727.28,
        "end": 1729.28
    },
    {
        "text": " Cuando tu termino pasado, tienes que termino pasado.",
        "start": 1729.28,
        "end": 1730.28
    },
    {
        "text": " Cuando vos sumas 2, con positivo, lo que vos vos formaste esto del cono.",
        "start": 1730.28,
        "end": 1735.28
    },
    {
        "text": " Claro, claro.",
        "start": 1735.28,
        "end": 1736.28
    },
    {
        "text": " Pero no formaste el cielo, porque el cielo se informa solo con el cielo, cero, cero.",
        "start": 1736.28,
        "end": 1741.28
    },
    {
        "text": " Ah, tiene que formar el cielo como un mianzón, o sea...",
        "start": 1741.28,
        "end": 1744.28
    },
    {
        "text": " Claro.",
        "start": 1744.28,
        "end": 1745.28
    },
    {
        "text": " Ah, la mierda, pero entonces tienes que quedar robar.",
        "start": 1745.28,
        "end": 1747.28
    },
    {
        "text": " Por eso, por eso, por eso, yo creo que necesitas 3.",
        "start": 1747.28,
        "end": 1750.28
    },
    {
        "text": " Sí, bien, bien.",
        "start": 1750.28,
        "end": 1751.28
    },
    {
        "text": " Creo que necesitas al menos 3.",
        "start": 1751.28,
        "end": 1752.28
    },
    {
        "text": " Ah, también, también.",
        "start": 1752.28,
        "end": 1753.28
    },
    {
        "text": " Nada.",
        "start": 1753.28,
        "end": 1754.28
    },
    {
        "text": " ¿Solo es el lalo o el lalo de un poco de distinto de 0?",
        "start": 1754.28,
        "end": 1756.28
    },
    {
        "text": " Y eso depende si el alpha racional o no.",
        "start": 1756.28,
        "end": 1759.28
    },
    {
        "text": " Si el alpha es irracional, no es un infinito.",
        "start": 1759.28,
        "end": 1762.28
    },
    {
        "text": " Si el alpha es racional, en un momento se va a hacer...",
        "start": 1762.28,
        "end": 1766.28
    },
    {
        "text": " Se va a hacer... va a sobre...",
        "start": 1766.28,
        "end": 1768.28
    },
    {
        "text": " Sobre la parce, va a quedar encima.",
        "start": 1768.28,
        "end": 1770.28
    },
    {
        "text": " Pero alcanza con que pase la mitad, ahí.",
        "start": 1770.28,
        "end": 1773.28
    },
    {
        "text": " Bueno, pero se entendió la discusión, ¿sí? ¿Lexperció bien?",
        "start": 1773.28,
        "end": 1776.28
    },
    {
        "text": " Está, ¿sí? ¿Existe el cu?",
        "start": 1776.28,
        "end": 1778.28
    },
    {
        "text": " Capas que no sé si les pusiera bien, ¿sí?",
        "start": 1778.28,
        "end": 1780.28
    },
    {
        "text": " El cu tiene que ser tal que cu más 1 es mayor que por alpha, mayor que...",
        "start": 1780.28,
        "end": 1783.28
    },
    {
        "text": " ¿Como es un?",
        "start": 1783.28,
        "end": 1784.28
    },
    {
        "text": " ¿Como es un?",
        "start": 1784.28,
        "end": 1785.28
    },
    {
        "text": " ¿No? ¿O cu menos 1?",
        "start": 1785.28,
        "end": 1786.28
    },
    {
        "text": " Ahí se me parece, cu más 1, ¿cuál es...",
        "start": 1786.28,
        "end": 1788.28
    },
    {
        "text": " ¿Es un momento que vos pasas ahí?",
        "start": 1788.28,
        "end": 1790.28
    },
    {
        "text": " Y eso existe, va muy implicando el momento que pasa.",
        "start": 1790.28,
        "end": 1792.28
    },
    {
        "text": " Bueno, vamos arriba. Entonces esto, quedó limpio.",
        "start": 1792.28,
        "end": 1795.28
    },
    {
        "text": " Entonces cuando lo usemos dentro, este truco saben para que se hace dentro del lema,",
        "start": 1795.28,
        "end": 1800.28
    },
    {
        "text": " para anular otra... ¿cómo?",
        "start": 1800.28,
        "end": 1802.28
    },
    {
        "text": " ¿Van a aparecer coeficientes?",
        "start": 1802.28,
        "end": 1804.28
    },
    {
        "text": " Y lo vas a anular. Es para anular un coeficiente.",
        "start": 1804.28,
        "end": 1807.28
    },
    {
        "text": " Ah, entonces si ten esto, ¿sí?",
        "start": 1807.28,
        "end": 1808.28
    },
    {
        "text": " Entonces se da vuelta una doble de sumatoria y se saca 1.",
        "start": 1808.28,
        "end": 1811.28
    },
    {
        "text": " ¿Por qué da ser? ¿A qué? ¿Está?",
        "start": 1811.28,
        "end": 1814.28
    },
    {
        "text": " Es un truquito que aparece en el medio de la demostración.",
        "start": 1814.28,
        "end": 1817.28
    },
    {
        "text": " Bueno, vamos arriba.",
        "start": 1818.28,
        "end": 1820.28
    },
    {
        "text": " Entonces...",
        "start": 1825.28,
        "end": 1827.28
    },
    {
        "text": " Está, voy a borrar porque voy a apreciar todo el pizarro para él.",
        "start": 1835.28,
        "end": 1838.28
    },
    {
        "text": " El teoremo, el teoremo, yo.",
        "start": 1838.28,
        "end": 1841.28
    },
    {
        "text": " Bueno.",
        "start": 1847.28,
        "end": 1849.28
    },
    {
        "text": " un bien, así es, Cith",
        "start": 1849.28,
        "end": 1849.32
    },
    {
        "text": " le muerto, no voy achando las piernas,gramos una otra hostile que no se está Pav fazla",
        "start": 1849.32,
        "end": 1867.3999999999999
    },
    {
        "text": " para Apply,ун por aquí en el canal os déjume colar a Texia, Suday unjustizo de esa",
        "start": 1867.3999999999999,
        "end": 1876.86
    },
    {
        "text": " Birlcoff Bander Graffs",
        "start": 1876.86,
        "end": 1881.6599999999999
    },
    {
        "text": " Birlcoff Bander Graffs",
        "start": 1890.6599999999999,
        "end": 1895.32
    },
    {
        "text": " Piero ver si encuentro el artículo en lo posso subir el artículo original",
        "start": 1895.32,
        "end": 1900.74
    },
    {
        "text": " en el 67",
        "start": 1901.6200000000001,
        "end": 1905.1200000000001
    },
    {
        "text": " y dice así",
        "start": 1908.54,
        "end": 1912.28
    },
    {
        "text": " le digo es el teorema más general que generaliza el de Perrófrobio que es un poco más",
        "start": 1912.52,
        "end": 1919.66
    },
    {
        "text": " sobre los comienzos de 1900",
        "start": 1919.66,
        "end": 1923.1
    },
    {
        "text": " si acá un cono",
        "start": 1923.3999999999999,
        "end": 1927.6599999999999
    },
    {
        "text": " propio que era propio mi caela",
        "start": 1927.8999999999999,
        "end": 1931.8999999999999
    },
    {
        "text": " a ver quién se acuerda de ciudad mi caela",
        "start": 1933.6599999999999,
        "end": 1937.58
    },
    {
        "text": " ese era sólido",
        "start": 1937.78,
        "end": 1941.54
    },
    {
        "text": " con el sólido la que tenía interior y propio que era",
        "start": 1941.54,
        "end": 1947.4599999999998
    },
    {
        "text": " ahí va que cae interésión menos cae se los se tocan exactamente y se usa todo",
        "start": 1947.6200000000001,
        "end": 1952.7
    },
    {
        "text": " increíble un cono propio y solido y sea una matriz cuadrada de la copina reales",
        "start": 1952.7,
        "end": 1960.78
    },
    {
        "text": " que deja invariante el cono el teorema de Perrófrobio es para cuando el cono",
        "start": 1960.78,
        "end": 1966.6200000000001
    },
    {
        "text": " son los el cono es el cono positivo el prototípico entonces dice el teorema",
        "start": 1966.6200000000001,
        "end": 1975.78
    },
    {
        "text": " rodea es valor propio",
        "start": 1977.46,
        "end": 1984.46
    },
    {
        "text": " de a que lo que está diciendo acá es altamente",
        "start": 1984.46,
        "end": 1991.94
    },
    {
        "text": " en este en el punto uno que son varios puntos de ti",
        "start": 1992.94,
        "end": 1998.94
    },
    {
        "text": " no no no el rodea cuándo es que el rodea es",
        "start": 1998.94,
        "end": 2012.94
    },
    {
        "text": " el supremo de los módulos de los valores propios",
        "start": 2012.94,
        "end": 2019.94
    },
    {
        "text": " ah si bueno que al decir positivo está diciendo que es el mismo tiempo",
        "start": 2023.94,
        "end": 2028.22
    },
    {
        "text": " es como dice Santiago que es real",
        "start": 2028.22,
        "end": 2032.94
    },
    {
        "text": " bueno positivo o cero porque puede ser cero y va a caber la discusión de que se",
        "start": 2034.18,
        "end": 2038.7
    },
    {
        "text": " hace pero la cuestión es que va a valor propio claro el caso cero sería obvio pero",
        "start": 2038.7,
        "end": 2044.7
    },
    {
        "text": " pero que realmente este número real es valor propio es fuerte ese resultado",
        "start": 2044.7,
        "end": 2055.7
    },
    {
        "text": " después el segundo resultado es que beta de rodea beta es el que acabamos de",
        "start": 2059.7,
        "end": 2068.46
    },
    {
        "text": " repasar o sea podríamos decir el tamaño del bloque más grande asociado al",
        "start": 2068.46,
        "end": 2079.14
    },
    {
        "text": " bloque mayor de más grande asociado se valor propio en este caso el valor",
        "start": 2079.14,
        "end": 2083.26
    },
    {
        "text": " propio rodea o podríamos decir el exponente correspondiente se valor",
        "start": 2083.26,
        "end": 2089.02
    },
    {
        "text": " propio en el polenio en mi minimal pero es el beta que hace un rato de repasamos",
        "start": 2089.02,
        "end": 2093.62
    },
    {
        "text": " es mayor igual que beta de landa para todo el landa en el espectro que tenga su módulo",
        "start": 2094.18,
        "end": 2103.66
    },
    {
        "text": " rodea",
        "start": 2106.98,
        "end": 2107.7
    },
    {
        "text": " ahora sigo escribiendo el atecis pero quiero leer con usted el atecis dos",
        "start": 2116.8599999999997,
        "end": 2120.06
    },
    {
        "text": " que es lo que está diciendo esto vos dentro del espectro de a tenés muchos valores propios de",
        "start": 2121.02,
        "end": 2128.2999999999997
    },
    {
        "text": " todos esos valores propios puede haber uno o muchos que su módulo se arrodea",
        "start": 2128.2999999999997,
        "end": 2133.18
    },
    {
        "text": " mirar los que tienen módulo rodea este fijaza ahora es esos valores propios",
        "start": 2134.38,
        "end": 2140.98
    },
    {
        "text": " pueden ser distintos valores propios que tienen el mismo módulo esos valores propios tienen",
        "start": 2140.98,
        "end": 2147.42
    },
    {
        "text": " cada uno aparece en el que es el distico cada uno aparece en el minimal cierto y cada uno",
        "start": 2147.42,
        "end": 2154.34
    },
    {
        "text": " tiene además un bloque de sorda que tiene sus bloque sitios de sorda lo único que coincide",
        "start": 2154.34,
        "end": 2159.1
    },
    {
        "text": " es que tiene el mismo módulo cada uno de ellos resulta que el tamaño más grande del bloque de",
        "start": 2159.1,
        "end": 2165.62
    },
    {
        "text": " sorda asociado a rodear es más grande que el tamaño más grande para cualquier otro de los",
        "start": 2165.62,
        "end": 2170.82
    },
    {
        "text": " bloque de sorda para cualquier otro de los valores propios este que tengan el mismo módulo",
        "start": 2170.82,
        "end": 2175.7000000000003
    },
    {
        "text": " claro eso es lo que está diciendo y tercero",
        "start": 2175.7,
        "end": 2180.22
    },
    {
        "text": " este es el típico problema que apareció el típico problema cuando vos querés aplicar",
        "start": 2184.06,
        "end": 2193.98
    },
    {
        "text": " algo de la automática este apareció en el modelo de Leon Tiff que queríamos que la",
        "start": 2193.98,
        "end": 2199.22
    },
    {
        "text": " solución X fuera mayor igual que 0 porque si no no tenía ningún sentido y acá aparece",
        "start": 2199.22,
        "end": 2204.4199999999996
    },
    {
        "text": " esto también el caj contiene un vector propio por eso es que este es muy aplicado este",
        "start": 2204.42,
        "end": 2212.58
    },
    {
        "text": " resultado digo el perronfrovenio si este también un vector propio que está en la zona que",
        "start": 2212.58,
        "end": 2221.04
    },
    {
        "text": " te interesa un vector propio que está en el cono un vector propio que está en el cono y",
        "start": 2221.04,
        "end": 2228.66
    },
    {
        "text": " ahora sigue el atesis no voy a terminar pero si en el perronfrovenio el cono es con",
        "start": 2228.66,
        "end": 2235.04
    },
    {
        "text": " opositivo el teoreba del perronfrovenio se con opositivo claro un vector de coordenadas positivas",
        "start": 2235.04,
        "end": 2240.62
    },
    {
        "text": " vuelvemos el mismo tipo de problema que el modelo de Leon Tiff que es lo que le interesa a las",
        "start": 2240.62,
        "end": 2245.2999999999997
    },
    {
        "text": " áreas aplicadas cuando las coordenadas son positivas pues son poblaciones de gente son intercambios",
        "start": 2245.2999999999997,
        "end": 2251.58
    },
    {
        "text": " económicos etc. Bueno bien con o sea valor propia asociado justamente al rodear o sea",
        "start": 2251.58,
        "end": 2263.1
    },
    {
        "text": " ese rodear es valor propio pero además quien un vector propio dentro del cono el cono",
        "start": 2263.1,
        "end": 2272.74
    },
    {
        "text": " ese por el cual partiste digo esto entendemos y no va a llevar un buen rato de mostrarlo si",
        "start": 2272.74,
        "end": 2279.02
    },
    {
        "text": " no terminamos hoy y que avalúne no me calienta porque voy a ir haciendo el despacito porque me",
        "start": 2279.02,
        "end": 2284.5
    },
    {
        "text": " interesa que se entienda la demostración. Ah un punto más en el libro aparece otro resultado más",
        "start": 2284.5,
        "end": 2296.02
    },
    {
        "text": " no como punto cuatro sino que dice además blah blah blah blah blah es ese blah blah blah blah",
        "start": 2296.02,
        "end": 2301.46
    },
    {
        "text": " blah blah lo vamos a poner aparte como coroelario para no mezclar el resultado nosotros lo vamos",
        "start": 2301.46,
        "end": 2307.48
    },
    {
        "text": " a hacer pero como coroelario. Sí.",
        "start": 2307.48,
        "end": 2309.48
    },
    {
        "text": " A aplicado un vector de coordenadas un vector de coordenadas positivas. ¿Por qué?",
        "start": 2309.48,
        "end": 2317.56
    },
    {
        "text": " Porque el resultado de la aplicado de coordenadas una combinación tiene a nivel de coordenadas",
        "start": 2317.56,
        "end": 2323.44
    },
    {
        "text": " y ya ya hay a nivel de coordenadas. ¿Como el coordenadas se puede hacer? Sí y entonces me perdí.",
        "start": 2323.44,
        "end": 2331.2400000000002
    },
    {
        "text": " O sea ha aplicado a un vector de coordenadas me calentra un vector de coordenadas todo",
        "start": 2331.24,
        "end": 2337.72
    },
    {
        "text": " vector de coordenadas es combinación de extremales pero de ahí no no no no no de duco que él",
        "start": 2337.72,
        "end": 2344.7599999999998
    },
    {
        "text": " tenga que ser extremales. En principio.",
        "start": 2344.7599999999998,
        "end": 2347.7599999999998
    },
    {
        "text": " ¿No va a ser una estreza? ¿No?",
        "start": 2347.7599999999998,
        "end": 2358.0
    },
    {
        "text": " No porque el trelo lo complicamos esto. Tengo que mostrar que está en acá.",
        "start": 2358.0,
        "end": 2364.0
    },
    {
        "text": " Pero si ya es invariante. Sí pero que hace invariante no quiere decir que no puede haber un vector",
        "start": 2364.0,
        "end": 2370.96
    },
    {
        "text": " fuera de acá que también se hay variante. Podría suceder en principio que un vector cito",
        "start": 2370.96,
        "end": 2376.76
    },
    {
        "text": " B es el que te soluciona la ecuación esta estando fuera de acá que te deja invariante",
        "start": 2376.76,
        "end": 2381.72
    },
    {
        "text": " a otra zona también. Estoy de acuerdo que es lo natural que estoy dentro de acá y eso es lo",
        "start": 2381.72,
        "end": 2387.3999999999996
    },
    {
        "text": " que va a suceder. Bueno muy bien. Entonces la notación todas las notaciones que como están",
        "start": 2387.3999999999996,
        "end": 2397.08
    },
    {
        "text": " largo el teorema en algunos momentos nos pueden no enreder un poquito pero a ver primero",
        "start": 2397.08,
        "end": 2402.12
    },
    {
        "text": " que nada. Epsilon 1, Epsilon 2, Epsilon N, este sí es N es una base de Jordan para o sea",
        "start": 2402.12,
        "end": 2419.96
    },
    {
        "text": " esa es la base de Jordan para allá pero ya piensen por favor cuando digo la base de Jordan",
        "start": 2424.48,
        "end": 2429.24
    },
    {
        "text": " ya en la cabeza de usted se apareció todo lo que de Jordan ordena dito. Ahí están todos",
        "start": 2429.24,
        "end": 2435.64
    },
    {
        "text": " los victores de la base de Jordan para toda la matriz. Porque el espacio es RN, estamos en",
        "start": 2435.64,
        "end": 2441.8399999999997
    },
    {
        "text": " bueno.",
        "start": 2444.4399999999996,
        "end": 2445.2799999999997
    },
    {
        "text": " Por supuesto que más allá de que estamos trabajando en una matriz coefficiente reales nosotros nos",
        "start": 2445.28,
        "end": 2460.2000000000003
    },
    {
        "text": " permitimos hacer el trabajo en C a la N porque los valores propios en principio son complejos,",
        "start": 2460.2000000000003,
        "end": 2465.44
    },
    {
        "text": " más allá de que estamos en bueno. Esto empieza así la notación pero ahora",
        "start": 2466.44,
        "end": 2477.6
    },
    {
        "text": " esto es lo que voy a escribir a ver Epsilon N1, Epsilon N2 hasta Epsilon NL de toda esta base",
        "start": 2477.6,
        "end": 2500.64
    },
    {
        "text": " esto son los victores propios de A sigo con notaciones pero vamos a poco.",
        "start": 2500.64,
        "end": 2513.12
    },
    {
        "text": " Claro cuando vos tenés imagínense para que tenés la base de Jordan y la matriz de Jordan ya",
        "start": 2520.64,
        "end": 2527.16
    },
    {
        "text": " no he hecho la matriz de Jordan. Por el que tenés arrancado en una dos por dos el primer",
        "start": 2527.16,
        "end": 2533.64
    },
    {
        "text": " bloquecito de Jordan es 2 por 2 entonces M1 es 2 porque es el segundo victor es el que es",
        "start": 2533.64,
        "end": 2542.44
    },
    {
        "text": " victor propio ¿no? Porque el primero va a parar a quien a Mubes es el más el segundo porque es",
        "start": 2542.44,
        "end": 2549.52
    },
    {
        "text": " M1 o landa o landa 1 ¿no verdad? Si es 3 por 3, el primer bloquecito de Jordan tuyo es 3",
        "start": 2549.52,
        "end": 2556.8399999999997
    },
    {
        "text": " por 3 entonces M1 es 3 es el tercero que es el victor propio ahora ponéle que tenés un 3 por",
        "start": 2556.84,
        "end": 2564.52
    },
    {
        "text": " miras la matriz de Jordan y la primera es una 3 por 3 y la segunda es un 2 por 2 puede ser de",
        "start": 2564.52,
        "end": 2570.52
    },
    {
        "text": " mismo lo propio o diferente vale el propio pero entonces M1 es 3 y el segundo es 5 se entiende",
        "start": 2570.52,
        "end": 2576.28
    },
    {
        "text": " lo que tiene notando acá. Porque ahí está bien poniendo los sigues abajo porque el tercero te",
        "start": 2576.28,
        "end": 2584.2000000000003
    },
    {
        "text": " queda, los dos los sigues te queda bien bien bien, para que ya solo se te lo propio, no puede tener más arriba.",
        "start": 2584.2000000000003,
        "end": 2591.96
    },
    {
        "text": " Puede ser si.",
        "start": 2594.1600000000003,
        "end": 2595.0400000000004
    },
    {
        "text": " No me parece que me parece que tengo razón yo ¿no?",
        "start": 2598.88,
        "end": 2601.0800000000004
    },
    {
        "text": " Landa 1, landa 1, landa con él, 0, 0, 0 y me falta la cina y para para entonces yo digo 1, 0, 0,",
        "start": 2606.28,
        "end": 2621.92
    },
    {
        "text": " entonces ahí va eso ¿qué me da?",
        "start": 2621.92,
        "end": 2623.76
    },
    {
        "text": " Landa, el tercero.",
        "start": 2623.76,
        "end": 2626.2400000000002
    },
    {
        "text": " Ahí va para y si multiplico por 0, 0, tener razón entonces",
        "start": 2628.2400000000002,
        "end": 2635.44
    },
    {
        "text": " ¿viste eso? Te dije que era mejor caminar que ponga el azul abajo.",
        "start": 2639.44,
        "end": 2642.4
    },
    {
        "text": " Si no tengo que cambiar toda la notación de la demostración. Era vos que existía por el azul abajo, no sé.",
        "start": 2643.6800000000003,
        "end": 2649.28
    },
    {
        "text": " No, es lo mismo, es exactamente lo mismo solo que la notación del libro en la demostración que",
        "start": 2649.84,
        "end": 2658.28
    },
    {
        "text": " yo tomé es considerando que los factores propios son los últimos, entonces tengo que ponerle",
        "start": 2658.28,
        "end": 2666.96
    },
    {
        "text": " los unos abajo. Gracias por la divertencia. Ahora quedo bien ¿no? A ver por la ciudad, landa,",
        "start": 2666.96,
        "end": 2672.6400000000003
    },
    {
        "text": " sea, se, ahí va. Entonces estamos tomando los unos abajo y prácticamente es un error también",
        "start": 2672.64,
        "end": 2683.24
    },
    {
        "text": " del libro que yo me lo comí porque el libro creo que había puesto los unos arriba, creo que",
        "start": 2683.24,
        "end": 2687.68
    },
    {
        "text": " va el comienzo en el comienzo de los capítulos. Bueno, esto son los factores propios ¿qué más?",
        "start": 2687.68,
        "end": 2693.2799999999997
    },
    {
        "text": " sigo con las notaciones ¿quién son M1? Bueno, acá es lo que tenemos. M1, menor que M2, esto no",
        "start": 2693.84,
        "end": 2706.6000000000004
    },
    {
        "text": " tiene porque ser siempre así, simplemente que lo tomamos así. No, perdón, esto está bien, esto",
        "start": 2706.6000000000004,
        "end": 2716.48
    },
    {
        "text": " es, acá no hay nada nuevo, está ese evidente. Y acá este se en, simplemente que voy enumerando",
        "start": 2716.48,
        "end": 2728.64
    },
    {
        "text": " donde están los factores propios, va creciendo y acá grega una cosa más que no está dicho pero",
        "start": 2728.64,
        "end": 2736.84
    },
    {
        "text": " después aparece en el medio de la demostración. Tomemos, agregamos uno que se me cero, que es",
        "start": 2736.84,
        "end": 2743.2
    },
    {
        "text": " este, en el macro si el meseo me va a servir en una de mostr, en la parte de la demostración aparece",
        "start": 2743.2,
        "end": 2747.4399999999996
    },
    {
        "text": " un meseo, me acuerdo si me sirve que se ha cero o uno ahora pero bueno, creo que se",
        "start": 2747.4399999999996,
        "end": 2754.9199999999996
    },
    {
        "text": " arvíe que fuera uno. Después me la dejan cambiar si se agrega esa notación, es meseo igual",
        "start": 2754.9199999999996,
        "end": 2761.24
    },
    {
        "text": " cero o uno según lo que conviene después en el medio de la demostración. ¿Qué más? ¿Qué más?",
        "start": 2761.24,
        "end": 2768.3999999999996
    },
    {
        "text": " ¿Qué más? Bueno, lambda 1, lambda 2 y lambda l, son los valores propios asociados a esos",
        "start": 2768.4,
        "end": 2782.92
    },
    {
        "text": " literés propios. Ojo, acá estoy permitiendo me arrepetido, en el sentido m1 y m2 pueden",
        "start": 2782.92,
        "end": 2800.7400000000002
    },
    {
        "text": " estar asociados al mismo valor propio pero los pongo lambda 1 y lambda 2, pueden ser que",
        "start": 2800.7400000000002,
        "end": 2805.54
    },
    {
        "text": " sean iguales, la lambda 1 y lambda 2 pero los pongo 2 veces porque esta notación surge",
        "start": 2805.54,
        "end": 2812.94
    },
    {
        "text": " de los bloques de sordan, los bloquesitos chiquititos, entonces pueden aparecer muchos asociados",
        "start": 2812.94,
        "end": 2819.22
    },
    {
        "text": " al mismo valor propio pero entonces como estoy anotando así aparece, va a lo propio lambda",
        "start": 2819.22,
        "end": 2824.38
    },
    {
        "text": " 1, el lambda 2 puede ser igual al lambda 1 hasta que de repente cambia. Bueno, todos",
        "start": 2824.38,
        "end": 2830.1
    },
    {
        "text": " son notaciones para ponos entonces. ¿Qué más? Acá si viene algo que vamos a asumir",
        "start": 2830.1,
        "end": 2836.1
    },
    {
        "text": " y esto, vieron que mil veces se hace esto de asumir bueno, si no es así lo reordenamos,",
        "start": 2836.1,
        "end": 2840.66
    },
    {
        "text": " lo damos vuelta y le cambiamos para que, bueno este es el primer momento que eso",
        "start": 2840.66,
        "end": 2843.8199999999997
    },
    {
        "text": " sucede. Voy a asumir que el valor propio de lambda 1, el módulo, de lambda 1 es",
        "start": 2843.8199999999997,
        "end": 2850.58
    },
    {
        "text": " mayor igual que el módulo de lambda 2 o sea que cuando estamos ordenando todo esto,",
        "start": 2850.58,
        "end": 2864.34
    },
    {
        "text": " cuando estamos haciendo el orden, proliciando todo para arrancar el teorema, lo primero",
        "start": 2864.34,
        "end": 2867.94
    },
    {
        "text": " que digo bueno voy a poner primero los valores propios que tienen módulos más grandes,",
        "start": 2867.94,
        "end": 2875.46
    },
    {
        "text": " más ese y lo voy, ojo, puede haber mucho valores propio, pone a ver repetidos y",
        "start": 2875.46,
        "end": 2881.5
    },
    {
        "text": " además, otros que son valores propios distintos para que tengan el mismo módulo, pero al final",
        "start": 2881.5,
        "end": 2886.46
    },
    {
        "text": " vas, vas chicando, chicando, chicando, chicando hasta que llegase al último valor propio.",
        "start": 2886.46,
        "end": 2891.2200000000003
    },
    {
        "text": " Entonces, ¿estamos consiguiendo los mejores propios también está arroredado? Sí, sí,",
        "start": 2891.2200000000003,
        "end": 2902.66
    },
    {
        "text": " esto me ordena esto también, esta numeración me ordena todo hasta acá, todo la anterior.",
        "start": 2902.66,
        "end": 2909.66
    },
    {
        "text": " Sí, bueno, ¿qué más? Sí, ¿por qué es el ordeno? El ordeno según esto, según",
        "start": 2909.66,
        "end": 2922.06
    },
    {
        "text": " el tamaño de los módulos. ¿Por qué también usted está dando el módulo arriba? No, porque",
        "start": 2922.06,
        "end": 2928.66
    },
    {
        "text": " esto me marca la numeración, estos que están acá, yo digo que en realidad voy a sumir",
        "start": 2928.66,
        "end": 2935.5
    },
    {
        "text": " que este tiene módulo más grande que, y si no es así, bueno, da los vueltas, cambiá",
        "start": 2935.5,
        "end": 2939.98
    },
    {
        "text": " lo para que te quede, pero al cambiar esto, tienes que cambiar esto, porque esto se",
        "start": 2939.98,
        "end": 2943.8399999999997
    },
    {
        "text": " lo va a ver el propio suciado, a esto ve lo que le va a ver el propio, la anda a",
        "start": 2943.8399999999997,
        "end": 2946.5
    },
    {
        "text": " una este, este, este, este, este, este, este, este, eso por las dudas no sé si quedó",
        "start": 2946.5,
        "end": 2950.42
    },
    {
        "text": " claro lo voy a remarcar. ¿Cómo trae que se le da una este con este? Lo ubicás vos,",
        "start": 2950.42,
        "end": 2966.5
    },
    {
        "text": " lo ubicás a prepos, lo ubicás a prepos porque simplemente como puede ser cualquier",
        "start": 2966.5,
        "end": 2972.2200000000003
    },
    {
        "text": " el orden, lo ubicás de esa manera. Entonces, ¿qué lo que estoy diciendo? ¿Este? Vuelta,",
        "start": 2972.22,
        "end": 2978.2599999999998
    },
    {
        "text": " nada, hasta ahí, ese. ¿Qué más? Bueno, a ver, quiero minimizar las cosas que me puse",
        "start": 2978.2599999999998,
        "end": 2989.64
    },
    {
        "text": " un montón de otras cosas, se ha notado acá, pero a ver, voy a poner lo estrictamente",
        "start": 2989.64,
        "end": 2998.52
    },
    {
        "text": " necesariamente, ¿no? Bueno, me ves el día de algunas notaciones que eran aclaratorias,",
        "start": 2998.52,
        "end": 3009.2
    },
    {
        "text": " pero vamos a ir directamente a la demostración. Entonces, primer caso, vamos a dividir en",
        "start": 3009.2,
        "end": 3018.0
    },
    {
        "text": " caso que Rodeano, lo que se llama Rodea, lo que se llama simplemente Rodea sea cero,",
        "start": 3018.0,
        "end": 3026.28
    },
    {
        "text": " supongamos que Rodea sea cero. ¿Puedes suceder que Rodea sea cero? Quiere decir que el",
        "start": 3026.28,
        "end": 3033.76
    },
    {
        "text": " máximo de supremo de los valores absolutos es cero, quiere decir que todos los valores",
        "start": 3033.76,
        "end": 3038.96
    },
    {
        "text": " absolutos son cero, quiere decir que todos los valores propiosos es cero, el único valor",
        "start": 3038.96,
        "end": 3043.16
    },
    {
        "text": " propios cero. Entonces, ¿tenes toda la diagonal de cero, un montón de bloquesito, más",
        "start": 3043.16,
        "end": 3049.72
    },
    {
        "text": " gran, de más chico, los que fuera, pero todo la diagonal de cero, nosotros sabemos que",
        "start": 3049.72,
        "end": 3054.24
    },
    {
        "text": " eso quiere decir que es importante, ¿no? El grado de hipotencia va a ser el tamaño del bloque",
        "start": 3054.24,
        "end": 3063.6
    },
    {
        "text": " más grande asociado a cero. Bueno, entonces, dice, elegimos un R mayor que uno, tal que",
        "start": 3063.6,
        "end": 3080.3199999999997
    },
    {
        "text": " a la R es igual cero en K. A ver, se los escribo de otra manera para que se entiende",
        "start": 3080.3199999999997,
        "end": 3092.7999999999997
    },
    {
        "text": " a lo que estoy diciendo. Lo que estoy diciendo es A a la R, evaluado en K, me da cero,",
        "start": 3092.8,
        "end": 3100.2400000000002
    },
    {
        "text": " pero A a la R menos 1, el evaluado nunca da distinto de cero. ¿Sienta tío? Ahí se",
        "start": 3100.2400000000002,
        "end": 3110.1600000000003
    },
    {
        "text": " hay una primera pregunta que quiero que me la digan ustedes. Quiero ir de espacio aunque",
        "start": 3110.1600000000003,
        "end": 3119.1200000000003
    },
    {
        "text": " no se ve tiempo, pero ahí hay algo que me tiene que decir, ¿por qué profeta es cosa?",
        "start": 3119.12,
        "end": 3124.16
    },
    {
        "text": " Ah, claro, que tanto, mínimo, me hubiera ponido mínimo.",
        "start": 3132.3199999999997,
        "end": 3137.88
    },
    {
        "text": " Sí, a partir de decir esto, te voy a acuerdo, decir mínimo, lo mismo que decir esto,",
        "start": 3149.68,
        "end": 3158.24
    },
    {
        "text": " que yo le había puesto, tiene razón, pero hay algo que tendría que justificar, ¿por qué",
        "start": 3158.24,
        "end": 3163.8399999999997
    },
    {
        "text": " mayor que uno? O sea, ¿por qué a la 1 de K es distinto de cero?",
        "start": 3163.84,
        "end": 3175.92
    },
    {
        "text": " Rezaco a la 1 por lo que si no se confunde, ¿por qué a de K es distinto de cero?",
        "start": 3180.1600000000003,
        "end": 3183.6400000000003
    },
    {
        "text": " Sí pues más como de que 40 de C es siúlti este caso, o sea, dancing y dancing de cero.",
        "start": 3193.84,
        "end": 3206.6400000000003
    },
    {
        "text": " Faith, ¿qué que oldu, el que con el posterior?",
        "start": 3207.52,
        "end": 3218.32
    },
    {
        "text": " Le pegaste en el papel. ¿Por qué контрilla?",
        "start": 3218.32,
        "end": 3223.42
    },
    {
        "text": " A ver, si hay adecas de cero, asumamos que hay adecas de cero ¿no?",
        "start": 3223.42,
        "end": 3230.42
    },
    {
        "text": " Yo pongo acá, acá solido. ¿A qué era equivalente que cafó la solido?",
        "start": 3230.42,
        "end": 3238.42
    },
    {
        "text": " Sí, pero la otra. No, no, la otra, la que citaron ustedes, la clase pasada, la citaron",
        "start": 3238.42,
        "end": 3247.98
    },
    {
        "text": " ustedes. Exactamente. ¿Tienes una base dentro de quién?",
        "start": 3247.98,
        "end": 3252.42
    },
    {
        "text": " Entonces, quiere decir que a anule una base. Si tenés una base dentro de c, a anule una base,",
        "start": 3252.42,
        "end": 3259.42
    },
    {
        "text": " entonces anule a todo el espacio. La citaron ustedes, ¿no? Entonces, a, b, cero.",
        "start": 3259.42,
        "end": 3268.42
    },
    {
        "text": " Pongan, por favor. Recordar que cás sólido, lo mismo que decir que hay una base dentro de c.",
        "start": 3268.42,
        "end": 3275.42
    },
    {
        "text": " Y que quiere decir que cuando va multiplicas por todos los elementos de la base te dan tosero.",
        "start": 3275.42,
        "end": 3280.42
    },
    {
        "text": " ¿Claro? ¿Cuánto has una combinación niñal de c, que te acero?",
        "start": 3281.42,
        "end": 3284.42
    },
    {
        "text": " Toda combinación niñal de c, porque si adecas es cero quiere decir que en todos los",
        "start": 3284.42,
        "end": 3289.42
    },
    {
        "text": " vectores de c, de c, de c, pero vos tenés una base dentro de c, porque cás sólido.",
        "start": 3289.42,
        "end": 3293.42
    },
    {
        "text": " Entonces, a, en todos los vectores de la base te da cero. Entonces, con agarres cualquier",
        "start": 3293.42,
        "end": 3299.42
    },
    {
        "text": " vector del espacio es combinación niñal de la base, en los de la base de acero.",
        "start": 3299.42,
        "end": 3305.42
    },
    {
        "text": " A, cero. A, debe de acero. Y si a, debe de acero, entonces, ay, cero.",
        "start": 3305.42,
        "end": 3313.42
    },
    {
        "text": " Una transformación que deja todo el espacio en cero es porque la transformación ni la anula.",
        "start": 3315.42,
        "end": 3319.42
    },
    {
        "text": " Pero, asumamos, este, bueno.",
        "start": 3320.42,
        "end": 3324.42
    },
    {
        "text": " No lo puse en, en, en, pero es, evidente, ¿no? ¿Es este?",
        "start": 3324.42,
        "end": 3335.42
    },
    {
        "text": " Sí, o sea, distintos c, o si no.",
        "start": 3338.42,
        "end": 3341.42
    },
    {
        "text": " Que no es la matriz nula, ¿no? No, no vamos a romper todo para una matriz nula, ¿no?",
        "start": 3345.42,
        "end": 3350.42
    },
    {
        "text": " No, la matriz nula, digamos, este, no la quiero. O sea, puede tener que el rodo de acero,",
        "start": 3351.42,
        "end": 3360.42
    },
    {
        "text": " pero la matriz no quiere que sea la nula, ¿no? Bueno, entonces, ¿qué quiere decir?",
        "start": 3360.42,
        "end": 3365.42
    },
    {
        "text": " Que realmente a de cánode puede ser cero, que a, en cada va a ser cero a partir y a calla",
        "start": 3365.42,
        "end": 3372.42
    },
    {
        "text": " su sobricia su esta, esta hipote, sino, a calla apareció esta hipote.",
        "start": 3372.42,
        "end": 3376.42
    },
    {
        "text": " En el rato va a aparecer esta otra, se usa en todas las hipotes.",
        "start": 3377.42,
        "end": 3381.42
    },
    {
        "text": " Entonces, realmente esta tontería que pasó de esa percibida y que remayor que uno es verdad.",
        "start": 3381.42,
        "end": 3387.42
    },
    {
        "text": " Se puede tomar el remayor que uno, el mínimo R que anula acá es mayor que uno.",
        "start": 3390.42,
        "end": 3397.42
    },
    {
        "text": " Y entonces, sigo por acá la demostración de uno, esta parte cita, sigo por acá, con lo cual",
        "start": 3398.42,
        "end": 3410.42
    },
    {
        "text": " puedo tomar a la R menos uno, considero un X en K, calque a la R menos uno, a la R menos uno,",
        "start": 3411.42,
        "end": 3426.42
    },
    {
        "text": " a la R menos uno de X, que también pertenece acá por supuesto.",
        "start": 3429.42,
        "end": 3437.42
    },
    {
        "text": " Y ya da el término, simplemente la línea final de término, pero quiero que entiendo en",
        "start": 3441.42,
        "end": 3451.42
    },
    {
        "text": " anterior que es sencillísimo, no dije nada, simplemente si a la R menos uno de cada distinto de cero es",
        "start": 3451.42,
        "end": 3458.42
    },
    {
        "text": " porque hay algún vector X en K, queda distinto de cero, ese es lo que puso.",
        "start": 3458.42,
        "end": 3464.42
    },
    {
        "text": " Es importante que el R sea mayor que uno, sino no podría haber hecho la R menos uno,",
        "start": 3465.42,
        "end": 3469.42
    },
    {
        "text": " directamente te daba a la cero y ya no tenía sentido, a la cero te queda la entidad y",
        "start": 3469.42,
        "end": 3475.42
    },
    {
        "text": " porque fíjense que a la R menos uno pertenece acá, ¿por qué pertenece acá?",
        "start": 3475.42,
        "end": 3480.42
    },
    {
        "text": " Porque el X está acá y el A te deja invariante, el K. Entonces a la R menos uno va a ser a la",
        "start": 3480.42,
        "end": 3488.42
    },
    {
        "text": " 1, o a la 2, o a la 3, o a la 4, no sé cuánto ese R menos uno, pero le aplicaste muchas veces a",
        "start": 3488.42,
        "end": 3494.42
    },
    {
        "text": " X, pero siempre el A te deja invariante el K, A de K está dentro de K, A de K, lo repetir,",
        "start": 3494.42,
        "end": 3501.42
    },
    {
        "text": " lo literás, lo literás, lo literás, lo literás, siempre estás dentro de K. Por lo tanto,",
        "start": 3501.42,
        "end": 3505.42
    },
    {
        "text": " el W está acá, ¿cierto? Y entonces ¿qué pasa con A de W? Camila, sí, ahí va, lo",
        "start": 3505.42,
        "end": 3518.32
    },
    {
        "text": " dijo en A, ¿cero? Pero tiene muchas cosas porque W, primero o no es 0, o sea, el 0 es 0 por",
        "start": 3518.32,
        "end": 3529.2200000000003
    },
    {
        "text": " W y además el W está acá y ahí tienes toda la tesis, o sea 0, R o D, A es valor propio,",
        "start": 3529.2200000000003,
        "end": 3539.52
    },
    {
        "text": " en este caso estamos en el caso 0, en caso 1, ¿no? R o D, A es 0, es valor propio, porque",
        "start": 3539.52,
        "end": 3544.92
    },
    {
        "text": " W es distinto de 0, además de podemos la 2, pero la última está ahí, el vector propiedad",
        "start": 3544.92,
        "end": 3551.92
    },
    {
        "text": " W, que está dentro de K, y por qué está dentro de K, por qué es invariante por A. Y",
        "start": 3551.92,
        "end": 3564.16
    },
    {
        "text": " esta es sencilla, ¿no? Porque el, quiero que quiero ahora, que el, bueno acá no, esta",
        "start": 3564.16,
        "end": 3587.3599999999997
    },
    {
        "text": " tiene sentido, ¿no? Porque acá el único valor propio es 0, entonces hay un solo tamaño,",
        "start": 3587.36,
        "end": 3596.48
    },
    {
        "text": " hay un solo beta, el único valor propio es 0, no hay otro valor propio, ¿se entiende?",
        "start": 3596.48,
        "end": 3602.84
    },
    {
        "text": " El único valor propio es 0, no hay con quien comparar, porque en este caso todos los",
        "start": 3602.84,
        "end": 3609.38
    },
    {
        "text": " valores propios son 0, ¿se siguieron? No vamos al caso 2, así que pregunten ahora Santiago,",
        "start": 3609.38,
        "end": 3623.5
    },
    {
        "text": " bueno, vamos a avanzar en el caso 2 todo lo que podamos hoy, vamos a jalar lo terminemos",
        "start": 3623.5,
        "end": 3630.6600000000003
    },
    {
        "text": " en el duro, pero 2, 2, 2, 2, todo de a 0, o a lo de a distinto de 0, pero el 2 es más",
        "start": 3630.66,
        "end": 3639.66
    },
    {
        "text": " complicado, claro, debería borrar, pero necesito un poquito más tener esta notación aquí,",
        "start": 3639.66,
        "end": 3651.3399999999997
    },
    {
        "text": " bueno, ustedes se la acuerdan, todo esto, ¿no? Se la acuerdan, te haces yo lo bueno, y bueno,",
        "start": 3651.34,
        "end": 3664.06
    },
    {
        "text": " esta parte ya le hicimos, también la borro, entonces basamos el caso, Roma y Orque 0, el radio",
        "start": 3664.06,
        "end": 3681.06
    },
    {
        "text": " espectro de mayor quise, bueno, entonces teníamos los que estaban acá dibujados los",
        "start": 3681.06,
        "end": 3690.64
    },
    {
        "text": " los victores propios, mejora que estaban asociados a valores propios, lambda j, ¿y qué, ¿cómo viene la",
        "start": 3690.64,
        "end": 3708.2799999999997
    },
    {
        "text": " cosa? El, estamos resonando con los los que he citado de Jorda, ¿no verdad? Que tenían",
        "start": 3708.28,
        "end": 3721.2000000000003
    },
    {
        "text": " tamaño, emejo, ¿tadigimos, ¿no verdad? M1, M2, M3, perdón, M1, M2, M3 eran las notaciones,",
        "start": 3721.2000000000003,
        "end": 3731.88
    },
    {
        "text": " los tamaños son estos, ¿tán de acuerdo? A ver, M1 era el tamaño el primero, después",
        "start": 3731.88,
        "end": 3737.6800000000003
    },
    {
        "text": " M2 que era, que le sumaste el tamaño el primero, el tamaño el segundo, entonces el tamaño",
        "start": 3737.68,
        "end": 3743.2
    },
    {
        "text": " del segundo bloque se me domen a seme uno, ¿entonces? Después viene M3, ¿qué qué",
        "start": 3743.2,
        "end": 3748.3999999999996
    },
    {
        "text": " venría hacer? Porque miraste el tercer bloque de Jordan, chiquito, bueno, pero entonces",
        "start": 3748.3999999999996,
        "end": 3755.16
    },
    {
        "text": " cuál es el tamaño del tercer bloquecito de Jordan? M3, M2 y así, ¿no verdad? Entonces",
        "start": 3755.16,
        "end": 3759.56
    },
    {
        "text": " lo voy a llamar Vijota, le pongo un nombre, Vijota, los tamaños de los bloque de Jordan,",
        "start": 3759.56,
        "end": 3769.7599999999998
    },
    {
        "text": " de los bloquecitos de Jordan, ¿ok? Bueno, entonces tomo el máximo, el más grande, lo",
        "start": 3769.7599999999998,
        "end": 3782.32
    },
    {
        "text": " llamó inmigrante, al máximo de los Vijota, pero no de todos los bloqueos de Jordan, ya saben",
        "start": 3782.32,
        "end": 3793.48
    },
    {
        "text": " que los Vijotas son los tamaños de los bloquecitos de Jordan, pero no voy a mirar todo",
        "start": 3793.48,
        "end": 3797.52
    },
    {
        "text": " los bloqueos de Jordan, solo voy a mirar los bloqueos de aquellos valores propios que",
        "start": 3797.52,
        "end": 3803.92
    },
    {
        "text": " tienen el módulo rojo. Puede ser solamente un caso o muchos, pero bueno, bueno, por supuesto,",
        "start": 3803.92,
        "end": 3821.88
    },
    {
        "text": " una. No, no, no, los bloquecitos los bloquecitos, o sea por ejemplo, ¿góstenes? El lambda",
        "start": 3821.88,
        "end": 3829.4
    },
    {
        "text": " 1, con su bloquecito, después viene otro bloquecito, que también puede ser el lambda",
        "start": 3829.4,
        "end": 3834.88
    },
    {
        "text": " 1 de vuelta, puede ser. ¿Pero uno de los que tiene el número más grande y tuve 2 es",
        "start": 3834.88,
        "end": 3838.4
    },
    {
        "text": " el segundo? Sí, porque acordate que se pueden repetir los landa, porque estos son los que",
        "start": 3838.4,
        "end": 3847.12
    },
    {
        "text": " marquen la cuestión, el último de cada bloquecito es un vector propio y pueden coincidir",
        "start": 3847.12,
        "end": 3853.1600000000003
    },
    {
        "text": " de los bloqueos de los bloquecitos. ¿Pero eso es el orden de los valores propios?",
        "start": 3853.16,
        "end": 3863.6
    },
    {
        "text": " Claro, y no es el máximo tamaño del bloque de los bloquecitos. Sí, señor, de los",
        "start": 3863.6,
        "end": 3871.24
    },
    {
        "text": " bloquecitos, el máximo tamaño de los bloquecitos. ¿El bloque de ese lambda 1? Sí, señor,",
        "start": 3871.24,
        "end": 3876.44
    },
    {
        "text": " por eso es que está entre uno y el heo. Bien, lo que está diciendo que es importante",
        "start": 3876.44,
        "end": 3880.24
    },
    {
        "text": " porque yo lo escribi y no lo... Y no se lo remarqué. ¿Por qué puse entre uno y el?",
        "start": 3880.24,
        "end": 3888.68
    },
    {
        "text": " Justamente porque lo que dice Kevin, porque los primeros, se acuerdan que habíamos",
        "start": 3888.68,
        "end": 3894.8399999999997
    },
    {
        "text": " puesto módulo de lambda 1, estos ros, mayor igual que módulo de lambda 2, mayor igual",
        "start": 3894.8399999999997,
        "end": 3902.04
    },
    {
        "text": " que... Bueno, era en él, en total. Tienes razón, en realidad los... En principio pueden",
        "start": 3902.04,
        "end": 3911.84
    },
    {
        "text": " ser todos, lamentablemente pueden ser hasta el final, pero tiene razón que, en realidad,",
        "start": 3911.84,
        "end": 3918.04
    },
    {
        "text": " me van a interesar los primeros. En principio podrían ser todos, el último también podría",
        "start": 3918.04,
        "end": 3923.64
    },
    {
        "text": " ser ron, por eso no lo puedo descartar, pero estoy de acuerdo que voy a mirar los primeros",
        "start": 3923.64,
        "end": 3927.96
    },
    {
        "text": " hasta que me fui del valor de los módulos, de los valores propios que tienen módulos",
        "start": 3927.96,
        "end": 3932.6
    },
    {
        "text": " ros. Exactamente. No puedo descartar ninguna en principio porque... Bueno, muy bien. Pero,",
        "start": 3932.6,
        "end": 3943.36
    },
    {
        "text": " como dijo Kevin, asumamos que... Porque además fíjense de los que tienen valor propio",
        "start": 3943.36,
        "end": 3953.52
    },
    {
        "text": " ron, que en principio, uno eso... Todo no va a tener este módulo ron, algunos van a ser",
        "start": 3953.52,
        "end": 3959.52
    },
    {
        "text": " más chicos. Bueno, en principio pueden ser todos los módulos ros. Pero a más de esos voy",
        "start": 3959.52,
        "end": 3965.12
    },
    {
        "text": " a decir que entre 1 y t, acá está 1, 2, hasta t, llego hasta el nivel, hasta el lugar",
        "start": 3965.12,
        "end": 3973.36
    },
    {
        "text": " t, son aquellos que tienen módulo, j, igual 1, t, módulo ron, pero además el bloque",
        "start": 3973.36,
        "end": 3983.4
    },
    {
        "text": " vezujo tabale, me sentí en lo que estoy diciendo. O sea que en cierto sentido hay un nuevo",
        "start": 3983.4,
        "end": 3995.32
    },
    {
        "text": " reordenamiento si quieren. Tomemos no es el tiempo para entender bien. Venimos con la",
        "start": 3995.32,
        "end": 4002.6200000000003
    },
    {
        "text": " discusión de Kevin que decía, bueno, está, pero no era que estaban los más grandes,",
        "start": 4002.62,
        "end": 4006.52
    },
    {
        "text": " primero sí, señor, en principio están los más grandes. Para el final están los más",
        "start": 4006.52,
        "end": 4010.38
    },
    {
        "text": " chicos. De los más grandes me fijó cuál es tienen el tamaño más grande su bloque de",
        "start": 4010.38,
        "end": 4016.8199999999997
    },
    {
        "text": " sordán y los pongo todos adelante a esos, los pongo primero. De los que tienen el mismo",
        "start": 4016.8199999999997,
        "end": 4023.42
    },
    {
        "text": " módulo, pongo adelante los que tienen los bloques más grandes. ¿Vos entendió?",
        "start": 4023.42,
        "end": 4029.16
    },
    {
        "text": " Ahí tenemos que acordarnos de esto porque ojo podría pasar que el amda 1 y el amda",
        "start": 4029.16,
        "end": 4042.8399999999997
    },
    {
        "text": " 2 no sea el mismo valor propio y después vuelva el amda 1 si quieres, o sea el amda 3",
        "start": 4042.8399999999997,
        "end": 4049.04
    },
    {
        "text": " y el amda 1. ¿Se entendió? Porque ahora lo estamos reordenando. ¿Portam año de bloque?",
        "start": 4049.04,
        "end": 4054.3199999999997
    },
    {
        "text": " Claro, por tamaño de módulo, pero por tamaño de bloque, entonces de repente el amda 2",
        "start": 4054.3199999999997,
        "end": 4058.56
    },
    {
        "text": " que tiene el mismo módulo que el amda 1 tiene el tamaño bloque grande, pero después",
        "start": 4058.56,
        "end": 4062.7599999999998
    },
    {
        "text": " el amda 3 será igual al amda 1 pero quedó tercero porque su tamaño es más chico. ¿Se",
        "start": 4062.7599999999998,
        "end": 4068.12
    },
    {
        "text": " entendió? Nada que no podamos hacer, pero va, vale, que quede bien clarito que es lo que",
        "start": 4068.12,
        "end": 4075.64
    },
    {
        "text": " se llama 100. Acá pusimos bien primero lo que tienen este módulo ro y tamaño bloque",
        "start": 4075.64,
        "end": 4081.6
    },
    {
        "text": " bien grande. Si se entiende eso junto con esto de las potencias que hicimos acá hace",
        "start": 4081.6,
        "end": 4089.04
    },
    {
        "text": " un rato, ya tenemos el teorema casi demostrado, solo que hay que esa es la esencia, esto y",
        "start": 4089.04,
        "end": 4097.36
    },
    {
        "text": " las potencias de los bloques y yo lo que hicimos tiempo atrás. Pero bueno, hay una",
        "start": 4097.36,
        "end": 4102.36
    },
    {
        "text": " en parte de trucos en el medio. Esta afirmación que voy a hacer ahora es la que pienso hacer",
        "start": 4102.36,
        "end": 4111.719999999999
    },
    {
        "text": " el lunes. Esta afirmación en azul es la que pensaba que me iba a quedar, la llamó",
        "start": 4111.719999999999,
        "end": 4118.08
    },
    {
        "text": " afirmación A, pero en realidad es una afirmación en azul. Existen, esta la vamos a dejar para",
        "start": 4118.08,
        "end": 4130.12
    },
    {
        "text": " demostrar el lunes. De uno, de dos, de té, números complejos, pusete, es este té, el que",
        "start": 4130.12,
        "end": 4141.04
    },
    {
        "text": " acabamos de existente en números complejos, tal que hago una combinación lineal con esos",
        "start": 4141.04,
        "end": 4151.36
    },
    {
        "text": " coeficientes de suí, desde igual 1 hasta té, multiplicado por los SUM-MI, me falta poner",
        "start": 4151.36,
        "end": 4163.599999999999
    },
    {
        "text": " una cosita más en azul, el cierre de eso, pero quiero que lo lea. O sea, y lo ya moías",
        "start": 4163.599999999999,
        "end": 4172.679999999999
    },
    {
        "text": " este vector, lo estoy definiendo en este momento. Definí en el sevector, me va a dar cinto",
        "start": 4172.679999999999,
        "end": 4179.5199999999995
    },
    {
        "text": " de cero, ¿quién es ese vector? Es la combinación lineal de los M y ¿quién es son los M",
        "start": 4179.52,
        "end": 4184.320000000001
    },
    {
        "text": " y? Recordemos, son los vectores propios, asociados a los valores propios, estos que están acá,",
        "start": 4184.320000000001,
        "end": 4190.72
    },
    {
        "text": " los de bloque más grande, y módulo ró. Esos vectores propios, si yo hago una combinación",
        "start": 4190.72,
        "end": 4200.120000000001
    },
    {
        "text": " lineal de ellos, me da distinto de cero, y está en ca, esto lo difícil de creer, sin embargo",
        "start": 4200.12,
        "end": 4208.28
    },
    {
        "text": " no es tan difícil. Porque ustedes saben cuál es la técnica de demostración de este azul,",
        "start": 4208.28,
        "end": 4217.88
    },
    {
        "text": " que lo vamos a hacer al lunes, el ejercicio 7, el práctico 2, a que el que agregamos",
        "start": 4217.88,
        "end": 4223.24
    },
    {
        "text": " y que Nikon encontró una demostración en un artículo, que decía que yo le dije cuál es la",
        "start": 4223.24,
        "end": 4230.88
    },
    {
        "text": " técnica que sean los biólogos y los estadísticos para encontrar el radio espectral. Esa técnica es la",
        "start": 4230.88,
        "end": 4237.36
    },
    {
        "text": " que se usa en esta demostración, la vamos a hacer el lunes. Es esa idea de tomar el límite",
        "start": 4237.36,
        "end": 4242.4
    },
    {
        "text": " a infinito y mostrar que las cosas convergen al comportamiento de los valores propios mayores y en los",
        "start": 4242.4,
        "end": 4248.5599999999995
    },
    {
        "text": " módulos de los bloque mayores. Es exactamente eso. Eso queda para el lunes, pero es exactamente",
        "start": 4248.56,
        "end": 4255.64
    },
    {
        "text": " la misma técnica que quizás se pensó alguna vez en el práctico 2. Entonces, pero ahora sigamos",
        "start": 4255.64,
        "end": 4263.92
    },
    {
        "text": " como que el azul lo tenemos. Tenemos esos vectores y encontramos un vector que está enca",
        "start": 4263.92,
        "end": 4269.360000000001
    },
    {
        "text": " en el cono y es distinto de cero y que usa esos vectores propios. Bueno, muy bien. Entonces,",
        "start": 4269.36,
        "end": 4281.12
    },
    {
        "text": " a ver, ¿qué me sirvi hacer ahora para que me quede? Progija la demostración, me quedan",
        "start": 4281.12,
        "end": 4298.8
    },
    {
        "text": " ocho minutos. Ahora vamos a hacer lo siguiente. ¿Qué es lo que pretendemos? Cuando analizamos la",
        "start": 4298.8,
        "end": 4307.68
    },
    {
        "text": " tesis 1, dijimos, queremos que rodease a valor propio y creo que fue Santiago y Nico",
        "start": 4307.68,
        "end": 4313.16
    },
    {
        "text": " dice que no. En lo mismo que decir, ¿qué es? Encontrar o mostrar que algún valor propio",
        "start": 4313.16,
        "end": 4322.64
    },
    {
        "text": " está en los reales. Algo un valor propio de estos que tienen módulos ronos. O sea, pretendo",
        "start": 4322.64,
        "end": 4327.56
    },
    {
        "text": " que algunos de estos sea real, que no sea un número complejo y no real, que algunos de",
        "start": 4327.56,
        "end": 4336.12
    },
    {
        "text": " estos sea real. Quiero que alguno de estos sea reales. ¿Tá? Es lo que tenemos que probar",
        "start": 4336.12,
        "end": 4340.599999999999
    },
    {
        "text": " acá. Bien. Entonces, lo que comienza haciendo la demostración es supongamos, digo, que",
        "start": 4340.599999999999,
        "end": 4355.44
    },
    {
        "text": " el anda 1 no pertenece a los reales. Pretendo que algunos de estos modulos de la anda 1,",
        "start": 4355.44,
        "end": 4366.799999999999
    },
    {
        "text": " de hecho me alcanzaría con cualquiera que tuviera valor propio ró, pero va a surgir",
        "start": 4366.799999999999,
        "end": 4370.86
    },
    {
        "text": " de algunos de estos T, de acá. Va a surgir de uno de estos T. Entonces, supongamos que",
        "start": 4370.86,
        "end": 4376.759999999999
    },
    {
        "text": " no es real de la anda 1. Y de hecho, decir que el anda 1 es no real es para que quede",
        "start": 4376.759999999999,
        "end": 4381.639999999999
    },
    {
        "text": " más prolíja la demostración, porque podríamos decir, supongamos que algunos de estos no",
        "start": 4381.64,
        "end": 4386.4800000000005
    },
    {
        "text": " es real. Aunque no sea el anda 1, lo que vamos a hacer es construir a partir de esto azul",
        "start": 4386.4800000000005,
        "end": 4394.240000000001
    },
    {
        "text": " una sumatoria más chica en donde se va el sumando 1, porque el anda 1 no es real. Si el anda",
        "start": 4394.240000000001,
        "end": 4404.08
    },
    {
        "text": " 1 fuera real, entonces ya tenés probado la primera parte y iremos a la siguiente punto",
        "start": 4404.08,
        "end": 4409.6
    },
    {
        "text": " de la demostración. Pero si el anda 1 no es real, lo va a eliminar de acá. Va a eliminar",
        "start": 4409.6,
        "end": 4417.56
    },
    {
        "text": " el sumando correspondiente al 1. Pero si fuera el anda 5 no es real, es que eliminarse",
        "start": 4417.56,
        "end": 4422.88
    },
    {
        "text": " el 5. Pusimos el 1 para que quede más prolíjo, nada más. Después vamos a ir al 2, porque",
        "start": 4422.88,
        "end": 4428.120000000001
    },
    {
        "text": " asumiendo que no, poco el andado es real para que quede proligito. Pero se entiende lo que",
        "start": 4428.120000000001,
        "end": 4432.160000000001
    },
    {
        "text": " va a ir es eliminando de ahí sumando por culpa de esto. Entonces, al final de cuenta,",
        "start": 4432.160000000001,
        "end": 4439.4800000000005
    },
    {
        "text": " como esto nos vamos a mostrar que no se pone a eliminar todos. Ah, entonces alguno",
        "start": 4439.48,
        "end": 4445.599999999999
    },
    {
        "text": " de estos anda tiene que ser real. Sí, mardigo. Este va a ser la dinámica de la demostración.",
        "start": 4445.599999999999,
        "end": 4455.0
    },
    {
        "text": " Entonces supongamos que el anda 1 no es real. Esto es lo que estaba en el lemma, un número",
        "start": 4455.0,
        "end": 4462.679999999999
    },
    {
        "text": " complejo que no era real. Entonces si tenés un número complejo que no era real, existen",
        "start": 4462.68,
        "end": 4469.68
    },
    {
        "text": " coeficientes positivos o cero, existen reales, secú, no todo cero, claro. O sea que no era",
        "start": 4469.68,
        "end": 4490.68
    },
    {
        "text": " lo que hicimos en el lemma no es una combinación trivial que multiplicábamos todos por cero,",
        "start": 4490.68,
        "end": 4494.76
    },
    {
        "text": " obviamente. Tal que la sumatoria desde igual cero hasta cú, desesuí por lambda 1 a la",
        "start": 4494.76,
        "end": 4507.68
    },
    {
        "text": " y me da cero. Bueno, muy bien, si la han dado un anunreal, entonces que vamos a hacer,",
        "start": 4507.68,
        "end": 4523.08
    },
    {
        "text": " a partir del ís se los pongo en azul, construyo un híasterico. Cuando si éramos, no porque",
        "start": 4523.08,
        "end": 4532.240000000001
    },
    {
        "text": " no lo vayamos a demostrar, sino simplemente porque viene del azul, voy a definir un híasterico",
        "start": 4532.24,
        "end": 4539.5199999999995
    },
    {
        "text": " que es jugando con esto otro que tenemos del lemma. ¿Quién es el haterisco lo define así?",
        "start": 4539.5199999999995,
        "end": 4546.12
    },
    {
        "text": " Lo define como la sumatoria desde igual cero hasta cú, desesuí por a a la y de y.",
        "start": 4546.84,
        "end": 4558.4
    },
    {
        "text": " El y es aquel, a es la matriz, a la y es literar, se subí sobre esos coeficientes,",
        "start": 4562.599999999999,
        "end": 4569.12
    },
    {
        "text": " o sea que esto es la sumatoria desde igual cero hasta cú, desesuí por a a la y de aquel del y",
        "start": 4570.0,
        "end": 4580.88
    },
    {
        "text": " en vez de y pongo sumatoria, desesuí por e a la y, desesuí, desde igual 1 hasta t.",
        "start": 4580.88,
        "end": 4591.04
    },
    {
        "text": " Acá voy a cambiar una de las dos y chiquilines porque si no serían dos índices con el mismo,",
        "start": 4591.84,
        "end": 4599.28
    },
    {
        "text": " ahí te lesamos jota, voy a poner igual que acá, al día de dentro lesa mejor, si quieren acá,",
        "start": 4599.28,
        "end": 4607.56
    },
    {
        "text": " se le ponemos jota para que quede siempre jota como referencia de que eso le vamos a poner jota.",
        "start": 4607.56,
        "end": 4614.0
    },
    {
        "text": " Bueno, muy bien, la matriz, esto es una matriz, o sea una transformación",
        "start": 4615.0,
        "end": 4620.32
    },
    {
        "text": " lineal, pasa para adentro, entonces esto me queda igual a la sumatoria desde igual cero hasta",
        "start": 4620.32,
        "end": 4627.96
    },
    {
        "text": " cú, desesuí por a la y, desesuí, sale de su jota, sale la sumatoria, desujota a de m j,",
        "start": 4628.96,
        "end": 4644.96
    },
    {
        "text": " de jota igual 1 hasta t. Y esto es para indicidas, fuera pueden estar en el",
        "start": 4644.96,
        "end": 4659.52
    },
    {
        "text": " lugar porque no cambia nadie, me faltó el mal, y esto es igual a la sumatoria, lo",
        "start": 4659.52,
        "end": 4672.9400000000005
    },
    {
        "text": " de vuelta, desigual cero hasta cú, desesuí, estoy haciendo todos los pasitos para que no se pierdan,",
        "start": 4672.9400000000005,
        "end": 4680.620000000001
    },
    {
        "text": " podría hacerlo más corto, sumatoria, desejota igual 1 hasta t, desujota y acá me queda",
        "start": 4680.620000000001,
        "end": 4689.18
    },
    {
        "text": " hacer a la y de la m j, te cuantas da a la y de la m j, ¿quién es eran esos m j?",
        "start": 4689.18,
        "end": 4694.280000000001
    },
    {
        "text": " Exactamente, entonces cuantas da a la y de la m j? Claro, la andajota a la y de m j.",
        "start": 4694.280000000001,
        "end": 4703.34
    },
    {
        "text": " La andajota a la y de m, exactamente, por eso es que hay que usar esos porque son los",
        "start": 4703.34,
        "end": 4710.240000000001
    },
    {
        "text": " actores propios. Bueno, y esto, lo de vuelta, es una doble sumatoria finita, acá no",
        "start": 4710.24,
        "end": 4721.48
    },
    {
        "text": " hay serie, no hay nada, entonces si es una doble sumatoria finita, puedo primero poner",
        "start": 4721.48,
        "end": 4725.5199999999995
    },
    {
        "text": " en n y o puedo poner primero j, entonces voy a dar vuelta y poner primero j, o sea",
        "start": 4725.5199999999995,
        "end": 4730.16
    },
    {
        "text": " re ordeno, la suma primero j, te apoyen y sigo por acá.",
        "start": 4730.16,
        "end": 4759.16
    },
    {
        "text": " Creo que de igual a la sumatoria, primero en j, desejota igual 1 hasta t, desujota,",
        "start": 4759.16,
        "end": 4768.28
    },
    {
        "text": " por la sumatoria, desde igual 0 hasta c, desejuj, dan la j, y en m j, ¿tabien?",
        "start": 4768.28,
        "end": 4786.28
    },
    {
        "text": " Y yo voy a hacer una chanchada, porque me describió toda vuelta en el pizarro, es más fácil",
        "start": 4786.28,
        "end": 4796.96
    },
    {
        "text": " porque puedo borrar un número y ya me queda el siguiente paso. Miren acá, vienen acá",
        "start": 4796.96,
        "end": 4802.08
    },
    {
        "text": " en el pizarro angurice, esto es una sumatoria, dejó de igual no hasta t, o sea j, 1, después",
        "start": 4802.08,
        "end": 4808.0599999999995
    },
    {
        "text": " j, 2, después hasta t, haga j, 1 conmigo, piensa el j, 1, queda de su 1, lambda 1, acá",
        "start": 4808.06,
        "end": 4818.3
    },
    {
        "text": " no, pero cuánto de esta sumatoria, para j, 1, 0, la que estaba en elema, ¿no? acá, da",
        "start": 4818.3,
        "end": 4828.22
    },
    {
        "text": " 0, es el altruch, yo se lo sabía ver, tiera un truco para eliminar un sumando, entonces",
        "start": 4828.22,
        "end": 4836.4400000000005
    },
    {
        "text": " para j, t igual 1, es toda 0, ¿se va? entonces, por eso para mí le pizarro en el más fácil",
        "start": 4836.44,
        "end": 4844.58
    },
    {
        "text": " le di, en el caso que los diferentes, la una no están en los reales, pero su el último",
        "start": 4844.58,
        "end": 4852.62
    },
    {
        "text": " pasito es lo que quiero hacer junto con ustedes, porque esto a mí quiero ver con ustedes",
        "start": 4852.62,
        "end": 4857.799999999999
    },
    {
        "text": " y como y el el último que pasa, si ninguno están en los reales, pero se entendió, pero",
        "start": 4857.799999999999,
        "end": 4866.099999999999
    },
    {
        "text": " hay muchas cosas por decir acá todavía, ya se entendió la esencia, pero hay muchas",
        "start": 4866.1,
        "end": 4869.4400000000005
    },
    {
        "text": " cosas por decir, a ver, y 32, nos vamos a ir perante a deserrar, hay muchas cosas para decir,",
        "start": 4869.4400000000005,
        "end": 4878.26
    },
    {
        "text": " porque este muchacho no era 0, el I, el I, el azul, no era 0 y estaba en acá y este",
        "start": 4878.26,
        "end": 4886.3
    },
    {
        "text": " muchacho, tenemos que probar que no es 0 y que está en acá, porque después le quiero",
        "start": 4886.3,
        "end": 4891.700000000001
    },
    {
        "text": " seguir repitiendo la operación, eso no va a llevar un rato para que no es 0, ahí se",
        "start": 4891.7,
        "end": 4896.9
    },
    {
        "text": " usa el apellido propio y que está en acá, bueno va a ser porque en el fondo, porque",
        "start": 4896.9,
        "end": 4903.0599999999995
    },
    {
        "text": " es una iteración usando AI y que es fiscente positivo, estamos en un cono, ¿ok? lo hacemos",
        "start": 4903.0599999999995,
        "end": 4908.26
    },
    {
        "text": " juntos, eso es el lunes y el siguiente truco es, como dijo Kevin, si el Lando 2 no",
        "start": 4908.26,
        "end": 4914.5
    },
    {
        "text": " está en R, en vez de Y estrellas, que tener un Y estrellas estrellas, pero lo que quiero",
        "start": 4914.5,
        "end": 4919.32
    },
    {
        "text": " ser junto con ustedes es el último paso, porque el final de cuenta y si me queda uno",
        "start": 4919.32,
        "end": 4922.4
    },
    {
        "text": " que pasa, hagamos lo junto a ver que se vea la contradicción, explícita, entonces",
        "start": 4922.4,
        "end": 4929.04
    },
    {
        "text": " tiene que haber uno que es real, ¿ok? y después reordenamos y vemos el resto de latísico",
        "start": 4929.04,
        "end": 4933.719999999999
    },
    {
        "text": " como quedó, ¿ok? Bueno, entonces lo terminamos en lunes.",
        "start": 4933.719999999999,
        "end": 4937.88
    }
]