[
    {
        "text": " Bueno, Ulis vamos a ver si le damos, aprovechamos la clase de hoy. Vamos a ver, vamos a repasar",
        "start": 0.0,
        "end": 13.48
    },
    {
        "text": " en que estamos. Un teoremita que nos, el tema de fondo es el teorema de Perron, Provenius.",
        "start": 13.48,
        "end": 26.04
    },
    {
        "text": " Es el tema general, pero en particular estamos demostrando una versión poco más moderna que",
        "start": 30.64,
        "end": 39.64
    },
    {
        "text": " el teorema de Birkopf bandlegraft. Ahora voy a poner hipotisitesis para empezar a recordar lo que",
        "start": 39.64,
        "end": 66.64
    },
    {
        "text": " ya empezamos a la clase pasada y vamos a ver hasta que punto llegamos y seguir este avance de",
        "start": 66.64,
        "end": 75.36
    },
    {
        "text": " anunidades. Bueno, todavía me cae tres pasadas más, hace 8.",
        "start": 75.36,
        "end": 101.14
    },
    {
        "text": " Entonces, se acá un cono, que vinquero un cono.",
        "start": 105.36,
        "end": 114.36
    },
    {
        "text": " Dale, ¿qué dien que tengo varias preguntas para el resto de los compañeros?",
        "start": 135.36,
        "end": 145.36
    },
    {
        "text": " Bueno, a ver quién ayuda a Kevin.",
        "start": 145.36,
        "end": 152.36
    },
    {
        "text": " ¿Se raro por las fumadas?",
        "start": 153.36,
        "end": 155.36
    },
    {
        "text": " Sí. ¿Se raro? ¿Qué tiene la frontera?",
        "start": 155.36,
        "end": 166.36
    },
    {
        "text": " Muy bien. ¿Y qué era Camila que era un cono propio?",
        "start": 166.36,
        "end": 173.36
    },
    {
        "text": " ¿Y la intersuprenda en el caio y en el caio?",
        "start": 173.36,
        "end": 177.36
    },
    {
        "text": " Sí, señora. ¿Y qué era sólido, Micah?",
        "start": 177.36,
        "end": 181.36
    },
    {
        "text": " Punto es interior, es perfecto.",
        "start": 182.36,
        "end": 184.36
    },
    {
        "text": " Y esto va de que ha incluido un canco, como se llama esta propiedad Santiago.",
        "start": 184.36,
        "end": 190.36
    },
    {
        "text": " ¿Qué no me recibe esa propiedad?",
        "start": 190.36,
        "end": 193.36
    },
    {
        "text": " ¿No te parecen varias cosas?",
        "start": 212.36,
        "end": 215.36
    },
    {
        "text": " Sí, que casi en variante bajo a muy bien.",
        "start": 215.36,
        "end": 223.36
    },
    {
        "text": " Y acá en el punto 2, en el punto 1 dice rodear valor propio de A.",
        "start": 223.36,
        "end": 228.36
    },
    {
        "text": " Eso lo entendemos todo, ya lo analizamos.",
        "start": 228.36,
        "end": 231.36
    },
    {
        "text": " ¿Y qué quiere decir esta notación beta mateo que era que la repasamos, la clase pasada, pero hoy no la repasamos?",
        "start": 231.36,
        "end": 239.36
    },
    {
        "text": " La repas, si no, recuerdos, era número que se ha estado confusionando en el interval al de parte de la transferencia de todo.",
        "start": 239.36,
        "end": 253.36
    },
    {
        "text": " Ah, iba. O sea que corresponde también con el nivel de nivel de...",
        "start": 253.36,
        "end": 259.36
    },
    {
        "text": " ¿Es exactamente? Y al índice de hipotencia, exactamente.",
        "start": 259.36,
        "end": 265.36
    },
    {
        "text": " Ese es el beta, asociado a cada valor propio.",
        "start": 266.36,
        "end": 270.36
    },
    {
        "text": " Entonces, lo que está diciendo que el que tiene mayor tamaño, el bloque de mayor tamaño,",
        "start": 270.36,
        "end": 277.36
    },
    {
        "text": " de rodear es más grande que el bloque de mayor tamaño de cualquiera de los otros valores propios.",
        "start": 277.36,
        "end": 283.36
    },
    {
        "text": " Todo es muy ordenado, queda con estas características, ¿no?",
        "start": 283.36,
        "end": 287.36
    },
    {
        "text": " Y la tercera propiedad es que cada contiene un vector propio, o sea, no en u lo por supuesto, porque es un vector propio.",
        "start": 287.36,
        "end": 307.36
    },
    {
        "text": " El vector propio asociado al radiospictral. ¿Tá?",
        "start": 307.36,
        "end": 316.36
    },
    {
        "text": " Sí, también, la triunf, ¿no? ¿Y al? ¿Y la primera?",
        "start": 316.36,
        "end": 322.36
    },
    {
        "text": " No, porque dice que está acá, esa es la verdad.",
        "start": 322.36,
        "end": 328.36
    },
    {
        "text": " O sea, lo más importante estar el comienzo, que el valor propio, hay uno que está acá.",
        "start": 328.36,
        "end": 334.36
    },
    {
        "text": " Pues, lo que dice es que la primera es que hay un valor propio de la primera.",
        "start": 335.36,
        "end": 346.36
    },
    {
        "text": " Sí, sí, señor. O sea, que rodea que hay un valor propio de norma rodea que es real.",
        "start": 346.36,
        "end": 363.36
    },
    {
        "text": " Entonces, por lo tanto, es rodear exactamente.",
        "start": 363.36,
        "end": 366.36
    },
    {
        "text": " Bueno, hemos generado una notación. Si me pongo a repasar la notación, se nos va a la clase.",
        "start": 366.36,
        "end": 373.36
    },
    {
        "text": " Solo le pido que, sin algún momento, cuando sigue la demostración, no se acuerda la notación para en la mano y lo recordamos.",
        "start": 373.36,
        "end": 382.36
    },
    {
        "text": " ¿Tá? Me levanta la mano, sí, y se nos acuerda que le decía esa notación.",
        "start": 382.36,
        "end": 385.36
    },
    {
        "text": " Se acuerda que al principio pusimos todas las notaciones, ese submeú, uno blá, blá, blá, blá.",
        "start": 385.36,
        "end": 390.36
    },
    {
        "text": " Bueno, después se estemos probados, hemos dividido en dos casos.",
        "start": 391.36,
        "end": 399.36
    },
    {
        "text": " El caso que fuera rodea igual cero, y este lo resolvimos.",
        "start": 399.36,
        "end": 408.36
    },
    {
        "text": " Y después el caso rodea mayor que cero, que por supuesto es el caso que estamos trabajando.",
        "start": 408.36,
        "end": 416.36
    },
    {
        "text": " En esa parte de la demostración, recuerdo ahora sí, en esta parte de la notación,",
        "start": 417.36,
        "end": 425.36
    },
    {
        "text": " algunas notaciones que surgían específicas, digamos, pero que tenían que ver con las notaciones originales.",
        "start": 425.36,
        "end": 431.36
    },
    {
        "text": " Tenemos este vector propio, lo pusimos todo esto en la otra vez también.",
        "start": 431.36,
        "end": 438.36
    },
    {
        "text": " Eso en mejor tas, se acuerdan que habíamos ordenado, este era el último de cada bloque.",
        "start": 438.36,
        "end": 444.36
    },
    {
        "text": " Porque ordenamos la base de Jordan, por eso empezamos, que está asociado al valor propio, la andajota.",
        "start": 446.36,
        "end": 455.36
    },
    {
        "text": " Y ahora vez, en esa notación que generamos, el V subj, que era Mj, menos Mj, menos 1,",
        "start": 455.36,
        "end": 467.36
    },
    {
        "text": " y era justamente el tamaño del bloque de Jordan en la asociada por supuesto en los tipos ninos.",
        "start": 468.36,
        "end": 483.36
    },
    {
        "text": " Asociado a este valor propio, la andajota con este vector propio y se trociaba.",
        "start": 483.36,
        "end": 488.36
    },
    {
        "text": " Cuando saltaba de Mj, menos 1, Mj, en esa notación que generamos,",
        "start": 489.36,
        "end": 494.36
    },
    {
        "text": " es que asociaba este vector pro, ese era el último, en esa base cita, el último en ese tramo,",
        "start": 494.36,
        "end": 502.36
    },
    {
        "text": " de M su j, menos 1, más 1, hasta M su j, este era el último.",
        "start": 506.36,
        "end": 512.36
    },
    {
        "text": " Y por eso, este es un vector propio, asociado ese valor propio, este es el tamaño del bloque,",
        "start": 512.36,
        "end": 517.36
    },
    {
        "text": " ese es el trasm, y entonces habíamos considerado M, el más grande, el máximo de los V subj,",
        "start": 517.36,
        "end": 532.36
    },
    {
        "text": " para los lambda subj, que tienen el módulo igual a roo.",
        "start": 532.36,
        "end": 546.36
    },
    {
        "text": " Habíamos hecho un orden, la enumeración, los índices quedó asociado a una forma,",
        "start": 546.36,
        "end": 554.36
    },
    {
        "text": " a que sean decrescientes los módulos de los valores propios, ¿accuerdan?",
        "start": 554.36,
        "end": 560.36
    },
    {
        "text": " El módulo de lambda 1 es el más grande, después más, mayor igual que el módulo de lambda 2,",
        "start": 560.36,
        "end": 565.36
    },
    {
        "text": " mayor igual que el módulo, así los ordenamos. Entonces, claro, el primero, si o si, es rodeado, el módulo, ¿no?",
        "start": 565.36,
        "end": 574.36
    },
    {
        "text": " Pero rodeado puede llegar a hacer el segundo y puede llegar a hacer muchos más, incluso puede llegar a hacer todos rodeados.",
        "start": 574.36,
        "end": 583.36
    },
    {
        "text": " Y él mira el máximo de los V subj, en tanto el módulo de lambda j se arró, ¿qué en principio?",
        "start": 584.36,
        "end": 594.36
    },
    {
        "text": " No sé, se dan algunos de los, no tienen por qué hacer todo, pueden hacer todo pero no tienen por qué hacer todo.",
        "start": 594.36,
        "end": 600.36
    },
    {
        "text": " Bueno, entonces, parámosse ahora en T, esto creo que lo llevamos a decir, ¿cierta bien?",
        "start": 601.36,
        "end": 612.36
    },
    {
        "text": " Sí, creo que sí, desde 1, 2, hasta T, que son, aquellos lambda y, que justamente el módulo me darró,",
        "start": 612.36,
        "end": 624.36
    },
    {
        "text": " pero además, que vésu, que, perdón, que vésu j, o vésu bien, en este caso, es m. ¿Qué quiero decir?",
        "start": 624.36,
        "end": 635.36
    },
    {
        "text": " También podría llegar hasta el final, esta situación, podría ser que todos cumplan esto, pero en principio cuál me quedó?",
        "start": 635.36,
        "end": 642.36
    },
    {
        "text": " De aquellos valores propios me quedo en los que tienen módulos ros, y de esos que tienen módulos ros,",
        "start": 642.36,
        "end": 650.36
    },
    {
        "text": " que son los primeros en principio, me quedo con los que tienen, con los que tienen el, este bloque,",
        "start": 650.36,
        "end": 659.36
    },
    {
        "text": " el tamaño más grande, justamente igual m. Ahora bien, esto implica, lo dijimos en la clase pasada,",
        "start": 659.36,
        "end": 670.36
    },
    {
        "text": " es posible que implique una reordenación de los lambda, porque estoy poniendo al principio todo",
        "start": 670.36,
        "end": 677.36
    },
    {
        "text": " que tienen esta doble condición, porque recuerden que nosotros cual era la única condición para ordenarlo,",
        "start": 677.36,
        "end": 685.36
    },
    {
        "text": " que tuvieran módulo de creciente, pero ahora, después que los ordenaste así con módulo de creciente,",
        "start": 685.36,
        "end": 691.36
    },
    {
        "text": " lo del módulo nos va a cambiar, porque queda, está prolijo en lo que estamos haciendo, pero dentro de los que tienen",
        "start": 691.36,
        "end": 697.36
    },
    {
        "text": " la misma, el mismo módulo ros, capaz que entre eso los tendes que cambiar del lugar, porque quiere exponer primero",
        "start": 697.36,
        "end": 702.36
    },
    {
        "text": " es lo que tienen, el mayor bloque asociado a su valor propio del tamaño, el máximo de los besos jodos.",
        "start": 702.36,
        "end": 711.36
    },
    {
        "text": " Capas que hay, alguno de estos es lambda que tiene módulo ros, no llega el máximo, capas que todo llega en el máximo,",
        "start": 711.36,
        "end": 719.36
    },
    {
        "text": " capas que solo el primero, entonces esos son los primeros, desde un hasta t,",
        "start": 719.36,
        "end": 727.36
    },
    {
        "text": " bueno, esto lo dijimos, después de esto también dijimos, y esto avisamos que es un coronario posterior,",
        "start": 728.36,
        "end": 739.36
    },
    {
        "text": " dijimos, digamos, una afirmación que quedó como, perdón, un coronario, no digamos, es una disculpe,",
        "start": 740.36,
        "end": 753.36
    },
    {
        "text": " no coronario, un resultado que vamos a probar después, para no mezclar tanto aquí dentro, que existen",
        "start": 753.36,
        "end": 759.36
    },
    {
        "text": " coeficiente descomplejos de 1 hasta t, justamente t es esta, también lo dijo la clase pasada, la misma",
        "start": 760.36,
        "end": 771.36
    },
    {
        "text": " t, algunos coeficiente complejos, tal que el y construido de esta manera no es 0, no es el",
        "start": 771.36,
        "end": 782.36
    },
    {
        "text": " vector nulo, no es el vector nulo, hay unico construido con esos coeficientes, lo llamé de su jota,",
        "start": 782.36,
        "end": 792.36
    },
    {
        "text": " usando justamente los elementos, es la base que son victores propios, pero desde un hasta t,",
        "start": 792.36,
        "end": 800.36
    },
    {
        "text": " y que esta construcción está en ca, bueno, les comentaba la clase pasada,",
        "start": 800.36,
        "end": 808.36
    },
    {
        "text": " lo comento de vuelta, que la demostración de eso, lo vamos a hacer, es una, eso lleva su ratito,",
        "start": 808.36,
        "end": 815.36
    },
    {
        "text": " pero que la técnica es justamente usando lo que está, digamos, sugerido en el último",
        "start": 815.36,
        "end": 823.36
    },
    {
        "text": " ejercicio del práctico dos, es la misma técnica, bueno, entonces que dijimos acá, vamos de alguna",
        "start": 823.36,
        "end": 831.36
    },
    {
        "text": " manera a asumir cuál es esto, cuál es esto el landaí, de estos que me interesan entre un",
        "start": 831.36,
        "end": 840.36
    },
    {
        "text": " IT, estos landaí que son los importantes entre un IT, con los cuales, con esos victores propios,",
        "start": 840.36,
        "end": 847.36
    },
    {
        "text": " asociados de esos valores propios, construyos este vector nk, voy a fijarme cuál es esto",
        "start": 847.36,
        "end": 852.36
    },
    {
        "text": " el landaí no está en R, y esos con el truquito del, del lema de los números complejos que",
        "start": 852.36,
        "end": 859.36
    },
    {
        "text": " hicimos la clase pasada, los vamos a ir eliminando, eso creo que también lo hicimos la clase pasada,",
        "start": 859.36,
        "end": 864.36
    },
    {
        "text": " pero como fue, dijimos, supongamos que el landa 1, la landa 1 no está en R, también lo",
        "start": 864.36,
        "end": 878.36
    },
    {
        "text": " observé la clase pasada, es importante que sea el landa 1, no va a poder ser que el landa 8 no",
        "start": 878.36,
        "end": 882.36
    },
    {
        "text": " está en R, entonces lo vas quitando, todos los que no están en R lo vas quitando de 1, puse el",
        "start": 882.36,
        "end": 888.36
    },
    {
        "text": " landa 1 porque queda más proligito, digamos nada más, en la notación, supongamos que haya",
        "start": 888.36,
        "end": 893.36
    },
    {
        "text": " alguno que no está en R y entonces le aplico el lema de los números complejos, cuál era",
        "start": 893.36,
        "end": 900.36
    },
    {
        "text": " el lema que existen, porque el landa 1 si no está en R es un complejo que no está en R,",
        "start": 900.36,
        "end": 908.36
    },
    {
        "text": " entonces existen, este lo hicimos aparte en verdad, reales hasta secú, existen reales,",
        "start": 908.36,
        "end": 924.36
    },
    {
        "text": " no todos seros, tales que la sumatoria de Ciswis por landa 1 al A desde igual 0 hasta",
        "start": 924.36,
        "end": 944.36
    },
    {
        "text": " esto me da 0 y la prueba fue muy sencilla, fue buscar que el landa 1 pegue el abueltito, es un complejo",
        "start": 945.36,
        "end": 954.36
    },
    {
        "text": " que tiene un ángulo positivo porque no es real, que pegue el abueltito hasta que llega hasta",
        "start": 954.36,
        "end": 959.36
    },
    {
        "text": " el otro lado, digamos hablando mal y pronto y con eso construís encerrar el 0 de los complejos",
        "start": 959.36,
        "end": 966.36
    },
    {
        "text": " dentro de un polietro y construís entonces una podés atrapar a ese 0 con esas potencias,",
        "start": 967.36,
        "end": 976.36
    },
    {
        "text": " bueno incluso dijimos cuál sería el cumidinimo etcétera, con ese truquito lo que hicimos es generamos,",
        "start": 976.36,
        "end": 986.36
    },
    {
        "text": " supongo que el landa 1 no está en R y con este truquito definimos, vamos a ponerle",
        "start": 986.36,
        "end": 994.36
    },
    {
        "text": " la insucula porque se entiende definimos y estrella que es la sumatoria desde igual 0 hasta",
        "start": 994.36,
        "end": 1009.36
    },
    {
        "text": " cu, de estos mismos es suy que pusimos ahí, lo que aparecen en el lemma por A de la matriz",
        "start": 1009.36,
        "end": 1019.36
    },
    {
        "text": " y es el vector que tomamos arriba, bueno hicimos un montón de cuentas y terminamos,",
        "start": 1019.36,
        "end": 1026.3600000000001
    },
    {
        "text": " se acuerdan, hicimos un montón de cuentas y usando el truquito esto queda 0, terminamos",
        "start": 1026.3600000000001,
        "end": 1032.3600000000001
    },
    {
        "text": " es que esto es igual a la sumatoria desde J igual 2 hasta T de los mismos de su j,",
        "start": 1032.3600000000001,
        "end": 1041.3600000000001
    },
    {
        "text": " lo que están aquí por la sumatoria, porque reordenamos, cambiamos este el orden de las",
        "start": 1041.36,
        "end": 1048.36
    },
    {
        "text": " dos sumatorias que aparecen, ese suy por la anda J del ahí por Epsilon M J,",
        "start": 1048.36,
        "end": 1061.36
    },
    {
        "text": " y hasta acá llegamos la clase pasada, entonces en este momento destacar una cosa que",
        "start": 1062.36,
        "end": 1072.36
    },
    {
        "text": " ya ha de esta aquí la clase pasada y otras que creo que las dije pero vale la pena volver",
        "start": 1072.36,
        "end": 1077.36
    },
    {
        "text": " a destacar así probar, lo que destacé es que este truco, como es la cosa,",
        "start": 1077.36,
        "end": 1084.36
    },
    {
        "text": " la 1 no está en R, si la anda 1 no está en R le aplico la emita para la anda 1,",
        "start": 1084.36,
        "end": 1089.36
    },
    {
        "text": " juego que en el emita en estas cuentas hicimos la clase pasada y el limino el Epsilon M 1",
        "start": 1089.36,
        "end": 1096.36
    },
    {
        "text": " de la cuenta, porque empezó en Pisan J igual 2, ese es el truco, yo lo tengo todos",
        "start": 1096.36,
        "end": 1103.36
    },
    {
        "text": " desde 1 hasta T, a la anda 1 no está en R, uso el lemma de los complejos y lo limino,",
        "start": 1103.36,
        "end": 1110.36
    },
    {
        "text": " lo saco para afuera, eso mismo voy a hacer con cada uno de los lambda que no está en R,",
        "start": 1111.36,
        "end": 1115.36
    },
    {
        "text": " claro vamos a hacerlo para el ligito, la anda 1 está en R, la anda 1 está en R y así,",
        "start": 1115.36,
        "end": 1121.36
    },
    {
        "text": " la realidad podría pasar que la anda 1 está en R y el tercero en este N,",
        "start": 1121.36,
        "end": 1125.36
    },
    {
        "text": " bueno ahí se que hay que eliminar, pero para que quede el pro ligito lo hacemos,",
        "start": 1125.36,
        "end": 1128.36
    },
    {
        "text": " bueno ahora bien, eso se lo había destacado, esto está en K, esto lo dije pero no lo",
        "start": 1128.36,
        "end": 1135.36
    },
    {
        "text": " lo probamos, bueno, que está en K sencillo, que está en K sencillo,",
        "start": 1135.36,
        "end": 1145.36
    },
    {
        "text": " hay que ser una cuentita, ¿por qué está en K?",
        "start": 1145.36,
        "end": 1150.36
    },
    {
        "text": " Les sugiero algo, no lo miren al final, miren lo al principio, ¿por qué está en K?",
        "start": 1150.36,
        "end": 1158.36
    },
    {
        "text": " un l illusions,",
        "start": 1166.36,
        "end": 1166.52
    },
    {
        "text": " pues eso está en K así, de ahí esta var maybe,",
        "start": 1166.52,
        "end": 1173.1999999999998
    },
    {
        "text": " y está en K наша si parece bien, el al landlords slimbrarieren,",
        "start": 1173.1999999999998,
        "end": 1179.36
    },
    {
        "text": " se staan en K y las propostas voting leales se Amen.",
        "start": 1179.36,
        "end": 1186.36
    },
    {
        "text": " Reales,",
        "start": 1186.36,
        "end": 1188.3999999999999
    },
    {
        "text": " y todos los ничего especiales?",
        "start": 1188.3999999999999,
        "end": 1193.4399999999998
    },
    {
        "text": " El I estaba acá, A lo deje invariante y lo aplicamos muchas veces también deje invariante.",
        "start": 1193.44,
        "end": 1201.6200000000001
    },
    {
        "text": " Siempre de dentro de acá, le aplicaba, le aplicaba, le aplicaba, siempre me quedo",
        "start": 1201.6200000000001,
        "end": 1204.38
    },
    {
        "text": " dentro de acá y después que hice en cada uno de estos casos lo multiplicé por coeficiente,",
        "start": 1204.38,
        "end": 1211.14
    },
    {
        "text": " mayores iguales que 0, que eso me permite hacer el cono y después lo sumé, eso me permite",
        "start": 1211.14,
        "end": 1215.9
    },
    {
        "text": " hacer el cono y se toda las cosas que me permiten hacer los cono con tomando una matriz",
        "start": 1215.9,
        "end": 1221.3400000000001
    },
    {
        "text": " invariante. Entonces eso justifica porque están acá. Que o claro, si no lo digo una",
        "start": 1221.34,
        "end": 1227.3799999999999
    },
    {
        "text": " vez más, regúntense al toal. Luego que nos cuesta un poquito más es probar que distinto,",
        "start": 1227.3799999999999,
        "end": 1233.9599999999998
    },
    {
        "text": " es 0. Entonces...",
        "start": 1233.9599999999998,
        "end": 1237.8
    },
    {
        "text": " El que es distinto de 0 lo vamos a usar más tarde, distinto de electronulo, ¿no? Lo vamos a",
        "start": 1251.34,
        "end": 1260.4199999999998
    },
    {
        "text": " usar más tarde. Pero además, si yo les mencioné que era un proceso iterativo, entonces yo",
        "start": 1260.4199999999998,
        "end": 1267.98
    },
    {
        "text": " tengo un I que es distinto de 0 y está acá. Esta interacción me tiene que llevar a un",
        "start": 1267.98,
        "end": 1273.6999999999998
    },
    {
        "text": " y estrella que es distinto de 0 y está acá. Para seguir iterando con este procedimiento",
        "start": 1273.6999999999998,
        "end": 1278.5
    },
    {
        "text": " diría eliminando todos los landais que no están en el r. ¿Está bien? Entonces es por",
        "start": 1278.5,
        "end": 1283.54
    },
    {
        "text": " eso que tengo que probar que es distinto de 0 porque el procedimiento me lo pide hasta",
        "start": 1283.54,
        "end": 1287.54
    },
    {
        "text": " llegar entonces es momento que bueno, algunos de los landas tienen que estar en el r. Y",
        "start": 1287.54,
        "end": 1292.62
    },
    {
        "text": " eso también lo vamos a ver esplicitamente no es la cosa que quede medio perdido. Bueno,",
        "start": 1292.62,
        "end": 1297.26
    },
    {
        "text": " entonces vamos a probar que distinto de 0 y supongamos que es 0, asumamos que ahí estrella",
        "start": 1297.26,
        "end": 1311.5
    },
    {
        "text": " es 0. Entonces lo que tenemos, el I estrés está aquí, esto es el electronulo desde igual",
        "start": 1311.5,
        "end": 1325.62
    },
    {
        "text": " de 0 hasta Q. Y no se voy a separar el primer sumando por un lado y el resto por otro",
        "start": 1325.62,
        "end": 1332.2199999999998
    },
    {
        "text": " lado. Entonces, este C sub 0 por, bueno, me voy a arrastrar, quizás, Ranguil C, el",
        "start": 1332.2199999999998,
        "end": 1343.6599999999999
    },
    {
        "text": " primero es C sub 0 por A del acero de I, pero A del acero es de entidad, o sea por I, C",
        "start": 1343.6599999999999,
        "end": 1349.9799999999998
    },
    {
        "text": " es 0 por I, es igual a menos porque lo paso para el otro lado, desde igual 1 hasta Q,",
        "start": 1349.98,
        "end": 1358.8600000000001
    },
    {
        "text": " esto es I, A del A, entonces, Nico, este donde está? En C, y este? Perfecto, pertenece",
        "start": 1358.86,
        "end": 1388.62
    },
    {
        "text": " a menos, y cuál el elé hipótesis que tengo que usar ahora? Que es perfecto. Que es",
        "start": 1388.62,
        "end": 1396.1399999999999
    },
    {
        "text": " perfecto, perfecto, entonces, propio que implica. Pero el I es del intento de 0, el",
        "start": 1396.1399999999999,
        "end": 1412.4599999999998
    },
    {
        "text": " I es del intento de 0, o sea que quien es 0, ese es 0. Entonces, como caes propio,",
        "start": 1412.46,
        "end": 1426.26
    },
    {
        "text": " entonces, ese es 0, aja, quiere decir que I estresa en realidad es la sumatoria de igual",
        "start": 1426.26,
        "end": 1436.42
    },
    {
        "text": " 1 hasta Q, deseesuí por A del A del A, o sea, ese es 0, se fue. Sigue así esto, y este, el",
        "start": 1436.42,
        "end": 1450.98
    },
    {
        "text": " libro dice, sigue así, pero lo voy a hacer, porque el siguiente paso es más complicado, pero",
        "start": 1450.98,
        "end": 1457.3400000000001
    },
    {
        "text": " es la misma lógica, pero ciertamente es un poquito más complicada, entonces, dice así, bueno,",
        "start": 1457.3400000000001,
        "end": 1462.54
    },
    {
        "text": " pero estamos asumiendo que I estresa es 0, dice, ya eliminamos el sucesero, pero sigue siendo",
        "start": 1463.02,
        "end": 1468.78
    },
    {
        "text": " 0, porque quiere llegar a una contradicción, ¿no? Entonces, separamos ahora por supuesto, el C",
        "start": 1468.78,
        "end": 1475.5
    },
    {
        "text": " sub 1 para un lado por A del I y del otro lado del resto de la sumatoria, con el menos por supuesto.",
        "start": 1475.5,
        "end": 1486.18
    },
    {
        "text": " Bueno, la lógica es la misma, voy a ponerlo en el mismo colorcito, para que se vea bien,",
        "start": 1492.54,
        "end": 1508.3
    },
    {
        "text": " no la voy a preguntar porque ya las saben, el primero está acá, el segundo está en menos",
        "start": 1509.5,
        "end": 1513.7
    },
    {
        "text": " acá, este está en menos acá, conclusión, como acá es propio, lo uso, ya lo que tengo acá,",
        "start": 1513.7,
        "end": 1526.18
    },
    {
        "text": " conclusión, C es 1 por A, C es 1 por A de I, ese es el 1.",
        "start": 1526.18,
        "end": 1535.1000000000001
    },
    {
        "text": " Y acá lo dice, el libro dice, a tos es 1, 0, bueno, yo me permitía hacer una",
        "start": 1543.7,
        "end": 1573.18
    },
    {
        "text": " prohibita por acá, que la podemos poner dentro del leema, pero no está en el libro, pero se las",
        "start": 1573.98,
        "end": 1583.06
    },
    {
        "text": " pongo porque si no, o podríamos ponerla de práctico, pero no, vamos a la, una prohibita, una",
        "start": 1583.06,
        "end": 1592.5800000000002
    },
    {
        "text": " observación intermedia que es que A de I de I siempre es distinto de cedo, bueno, vamos a",
        "start": 1592.5800000000002,
        "end": 1602.66
    },
    {
        "text": " la prohibita, con lo cual es como A de I de I es particular a la 1 de I, distinto de cedo,",
        "start": 1602.66,
        "end": 1609.22
    },
    {
        "text": " con lo cual, con la que esa observación, que ahora vamos a probar, tenemos que ese sub 1 es 0.",
        "start": 1609.22,
        "end": 1616.46
    },
    {
        "text": " Y ahora sí, a la beta, a la beta, a la beta, pero",
        "start": 1616.46,
        "end": 1628.66
    },
    {
        "text": " que tiene que ser 0.",
        "start": 1632.66,
        "end": 1650.22
    },
    {
        "text": " Sí, pero no es el potente, porque el caso es un hipotente, ya lo hicimos, estamos en el caso,",
        "start": 1650.22,
        "end": 1662.26
    },
    {
        "text": " no, no, el potente. Bueno, entonces eso es un hipoteno y esto, ahora voy a probar la observación,",
        "start": 1662.26,
        "end": 1671.26
    },
    {
        "text": " ahora sí, yo le creo al libro y ustedes crean a mí, esto sigue igual para el resto de los",
        "start": 1671.26,
        "end": 1677.06
    },
    {
        "text": " coeficientes, con lo cual, qué estaríamos probando, ahora sí, el resto de los casos es igual,",
        "start": 1677.06,
        "end": 1684.1799999999998
    },
    {
        "text": " usando esta observación, con lo cual estaríamos probando que ese sub 0 es 0, que ese sub 1 es 0,",
        "start": 1684.1799999999998,
        "end": 1690.1
    },
    {
        "text": " que ese sub 12 es 0, que ese sub C es 0, pero entonces ¿quién es 0?",
        "start": 1690.1,
        "end": 1693.3
    },
    {
        "text": " Exactamente, no entendía lo que me estaba diciendo, esto, que es no todo 0, eso me dijeron,",
        "start": 1693.3,
        "end": 1715.1399999999999
    },
    {
        "text": " no, entonces ahí está el absurdo, ese sub 0 es 0, ese sub 1 es 0, todo sería 0, pero no todo son",
        "start": 1715.14,
        "end": 1723.5
    },
    {
        "text": " 0, dijimos en el lema, por lo tanto ahí está la contradicción, la contradicción está",
        "start": 1723.5,
        "end": 1730.6200000000001
    },
    {
        "text": " de haber asumido que esto es 0 y entonces tenemos probado que esto otro que estaba acá.",
        "start": 1730.6200000000001,
        "end": 1736.22
    },
    {
        "text": " Sí, no es 0, entonces ¿qué es el mismo? No, este lo tenemos acá, por hipótesis y de",
        "start": 1736.22,
        "end": 1749.9
    },
    {
        "text": " distintos 0, el esquema es y distintos 0 y está acá, el y estrella que acabamos de crear juntos",
        "start": 1749.9,
        "end": 1757.14
    },
    {
        "text": " va a ser distintos 0 y está acá y ese proceso lo vamos a citerar, no falta probar para dar por",
        "start": 1757.14,
        "end": 1763.98
    },
    {
        "text": " concluido esta partecita, que simplemente lo que hicimos en esta partecita es si lambda 1",
        "start": 1763.98,
        "end": 1770.1
    },
    {
        "text": " no está en R yo construyo otro objeto con las mismas condiciones que usan menos vectores propios,",
        "start": 1770.1,
        "end": 1776.6200000000001
    },
    {
        "text": " ese sonó más lo que hicimos, si lambda 2 no está en R voy a bajarle otro y así hasta que",
        "start": 1776.6200000000001,
        "end": 1785.02
    },
    {
        "text": " 1 tiene que estar en R porque el proceso es finito y así disalible se termina, nosotros el último",
        "start": 1785.02,
        "end": 1790.14
    },
    {
        "text": " lo vamos a hacer juntos de vuelta, porque esto de que el proceso finito y termina no me gustó",
        "start": 1790.14,
        "end": 1794.5800000000002
    },
    {
        "text": " nada y lo hice esplicitamente para que se vea porque termina, eso lo hacemos después, pero",
        "start": 1794.5800000000002,
        "end": 1800.74
    },
    {
        "text": " necesitamos probar esto en el medio, porque lo usamos, entonces vamos a probar que al aire y",
        "start": 1800.74,
        "end": 1806.9
    },
    {
        "text": " el distinto de 0 por supuesto para todo donde la vamos a usar esto, acá entre 0 y cú.",
        "start": 1806.9,
        "end": 1814.7800000000002
    },
    {
        "text": " En 0 es obvio porque el 0 te quedo de la identidad por y y el distinto de 0,",
        "start": 1814.78,
        "end": 1825.82
    },
    {
        "text": " entonces ¿qué pasa con? O sea, a el acero de I es I que distinto de 0, a la 1 de I es",
        "start": 1825.82,
        "end": 1838.26
    },
    {
        "text": " A, bueno y está ya arriba, tengo un poco espacio, hubo y sé que voy a dar dos pasos,",
        "start": 1839.26,
        "end": 1846.9
    },
    {
        "text": " vi a dos pasos, pero ustedes lo van a entender, es A aplicado aquella sumatoria, pero como es",
        "start": 1846.9,
        "end": 1854.74
    },
    {
        "text": " una sumatoria finita y hace una transformación lineal, saco la suma y saco los coeficientes para",
        "start": 1854.74,
        "end": 1859.74
    },
    {
        "text": " afuera, o sea que me quedo en la sumatoria, desde J igual 1 hasta T del D subj por A de",
        "start": 1859.74,
        "end": 1870.22
    },
    {
        "text": " Mj, ¿cierto? Pero le pregunto a ustedes, ¿quién era Mj y por lo tanto que es A de Mj?",
        "start": 1870.22,
        "end": 1880.26
    },
    {
        "text": " A, por lo tanto a D Mj, J por Mj, o sea que esto me quedo, sumatoria J igual 1 hasta T",
        "start": 1880.26,
        "end": 1896.7
    },
    {
        "text": " de D subj por A de Mj, por E Mj y ¿cómo son? E M1 hasta E Mt, que son los que aparecen aquí en",
        "start": 1896.7,
        "end": 1916.18
    },
    {
        "text": " esta sumatoria, claro, es un conjunto de ley y entonces si esto fuera, ¿por qué quiero probar",
        "start": 1916.18,
        "end": 1921.18
    },
    {
        "text": " qué distinto es 0, ¿no verdad? Supongamos que es el nulo, ¿qué me está diciendo entonces?",
        "start": 1921.18,
        "end": 1926.22
    },
    {
        "text": " Pero sí se leí, ¿qué pasaría entonces? ¿Qué dejota por la anda J?",
        "start": 1935.18,
        "end": 1939.78
    },
    {
        "text": " El 0 para todos J entre un y T.",
        "start": 1942.1000000000001,
        "end": 1944.94
    },
    {
        "text": " ¿Sí? ¿En mi foto que leí? ¿Tú lo de esto por un todo?",
        "start": 1951.18,
        "end": 1954.5
    },
    {
        "text": " Sí, totalmente, pero ahora, pregunto, los landa J que necesitarán, estoy entre un y T, ¿quién",
        "start": 1954.5,
        "end": 1963.1000000000001
    },
    {
        "text": " necesarán los landa J? ¿Se acuerdan? ¿Qué tenían módulo? P, R, R mayor que 0 exactamente,",
        "start": 1963.1000000000001,
        "end": 1972.9
    },
    {
        "text": " entonces los landa J ni un 0, entonces quiénes son todos 0?",
        "start": 1972.9,
        "end": 1976.3400000000001
    },
    {
        "text": " Los de su jota y si son todos 0, quién es 0?",
        "start": 1977.34,
        "end": 1980.1399999999999
    },
    {
        "text": " Sí, y absorberlo.",
        "start": 1980.1399999999999,
        "end": 1982.3799999999999
    },
    {
        "text": " El lindo cuando la matemática cierra toda, ¿no?",
        "start": 1982.3799999999999,
        "end": 1986.1799999999998
    },
    {
        "text": " Por lo tanto, como landa J es distinto de 0 para todos J entre un y T.",
        "start": 1986.1799999999998,
        "end": 1994.4599999999998
    },
    {
        "text": " Como landa J es distinto de 0 para todos J.",
        "start": 2006.34,
        "end": 2008.8999999999999
    },
    {
        "text": " Entonces, de J es 0 para todos J entre un y T, y entonces, y sería 0.",
        "start": 2011.6999999999998,
        "end": 2020.4199999999998
    },
    {
        "text": " Absurdo. El absurdo lo pongo en azul, el absurdo es saber, supuesto aquí, que es esta combinación es 0.",
        "start": 2020.4199999999998,
        "end": 2030.8999999999999
    },
    {
        "text": " Por lo tanto, A de I es distinto de 0.",
        "start": 2030.9,
        "end": 2036.7800000000002
    },
    {
        "text": " Lo mismo vale para el resto de los casímicas.",
        "start": 2036.7800000000002,
        "end": 2040.46
    },
    {
        "text": " ¿Qué ha que?",
        "start": 2043.7,
        "end": 2045.74
    },
    {
        "text": " Sí, y entonces no sea donde va.",
        "start": 2050.34,
        "end": 2054.14
    },
    {
        "text": " ¿No podrías ser el abril que ha tenido?",
        "start": 2054.14,
        "end": 2056.78
    },
    {
        "text": " No, porque el I podría ser...",
        "start": 2056.78,
        "end": 2060.5400000000004
    },
    {
        "text": " ¿Puedes estar en el kernel?",
        "start": 2060.5400000000004,
        "end": 2063.5400000000004
    },
    {
        "text": " O sea, en principio no tenemos muchas condiciones de I.",
        "start": 2063.5400000000004,
        "end": 2067.38
    },
    {
        "text": " O sea, sabemos que existe esta en el cono, sabemos que aman del cono en el cono, ¿no?",
        "start": 2067.38,
        "end": 2074.1400000000003
    },
    {
        "text": " ¿No? ¿Pero podría mandarlo al cero?",
        "start": 2074.1400000000003,
        "end": 2076.5
    },
    {
        "text": " Porque el cero, el nulo está en el cono.",
        "start": 2076.5,
        "end": 2079.34
    },
    {
        "text": " ¿Precipio lo podría mandar?",
        "start": 2079.34,
        "end": 2080.82
    },
    {
        "text": " Pero no lo manda, eso es lo que estamos diciendo.",
        "start": 2080.82,
        "end": 2084.34
    },
    {
        "text": " A ese que construimos no lo manda.",
        "start": 2084.34,
        "end": 2086.34
    },
    {
        "text": " A otro puede ser, pero a ese que construimos juntos, que son con los valores propios,",
        "start": 2086.34,
        "end": 2090.1800000000003
    },
    {
        "text": " lo hablan o lo manda.",
        "start": 2090.1800000000003,
        "end": 2091.1800000000003
    },
    {
        "text": " Estamos bien.",
        "start": 2096.42,
        "end": 2099.02
    },
    {
        "text": " Talina, la demostración, pero tiene sus recovecos, ¿no?",
        "start": 2099.02,
        "end": 2102.02
    },
    {
        "text": " Y no quiero que se me pierdan.",
        "start": 2102.02,
        "end": 2104.7000000000003
    },
    {
        "text": " Ojo, chicos, acá dejen un espacio, el resto es igual.",
        "start": 2104.7000000000003,
        "end": 2108.6600000000003
    },
    {
        "text": " A la I es distinto de 0 es igual, o sea, provee sólo que a...",
        "start": 2108.6600000000003,
        "end": 2112.34
    },
    {
        "text": " Pero después cuadrado, lo mismo, el cubo, ¿ok?",
        "start": 2112.34,
        "end": 2118.7400000000002
    },
    {
        "text": " ¿Qué va a pasar cuando lo van a cuadrado?",
        "start": 2118.7400000000002,
        "end": 2120.9
    },
    {
        "text": " A ver si lo hacemos rápido en el aire.",
        "start": 2120.9,
        "end": 2122.46
    },
    {
        "text": " ¿Qué va a pasar?",
        "start": 2122.46,
        "end": 2122.98
    },
    {
        "text": " ¿Cuál es la única diferencia?",
        "start": 2122.98,
        "end": 2124.2200000000003
    },
    {
        "text": " No es la que van a cuadrar.",
        "start": 2124.2200000000003,
        "end": 2125.38
    },
    {
        "text": " Exactamente.",
        "start": 2125.38,
        "end": 2126.34
    },
    {
        "text": " Pero en los lambda, siguen siendo distinto de 0, porque...",
        "start": 2126.34,
        "end": 2129.2200000000003
    },
    {
        "text": " Y al quedar al cuadrado, terminamos coincidiendo que los de sus jodas son, o sea,",
        "start": 2129.2200000000003,
        "end": 2133.1000000000004
    },
    {
        "text": " que la misma prueba para todo caso es que...",
        "start": 2133.1000000000004,
        "end": 2136.1000000000004
    },
    {
        "text": " Excelente.",
        "start": 2136.1000000000004,
        "end": 2137.54
    },
    {
        "text": " Tenemos la demostración en el bolsillo.",
        "start": 2137.54,
        "end": 2141.02
    },
    {
        "text": " Sí.",
        "start": 2141.02,
        "end": 2142.02
    },
    {
        "text": " ¿Por qué la amnajera es una dos?",
        "start": 2142.02,
        "end": 2143.3
    },
    {
        "text": " Porque al poner a cuadrado, cuando agas para cuadrado, ¿no?",
        "start": 2143.3,
        "end": 2146.2599999999998
    },
    {
        "text": " Sí.",
        "start": 2146.2599999999998,
        "end": 2147.2599999999998
    },
    {
        "text": " Te queda a de a de mi jota.",
        "start": 2147.2599999999998,
        "end": 2149.46
    },
    {
        "text": " Cuando vas a de mi jota, te queda la amnajota por ahí, mi jota.",
        "start": 2149.46,
        "end": 2152.62
    },
    {
        "text": " Si acá se la amnajota para afuera y le aplicado vuelta, te queda la amnajuada.",
        "start": 2152.62,
        "end": 2157.66
    },
    {
        "text": " Bueno.",
        "start": 2157.66,
        "end": 2158.66
    },
    {
        "text": " Bueno.",
        "start": 2158.66,
        "end": 2160.66
    },
    {
        "text": " Entonces, voy a borrar un poquito.",
        "start": 2160.66,
        "end": 2166.14
    },
    {
        "text": " Pues ya quedó medio en maraña o todo esto.",
        "start": 2166.14,
        "end": 2170.2599999999998
    },
    {
        "text": " Si la amnajuna no está en R, construimos este con el lema, este que ya lo conocemos.",
        "start": 2170.26,
        "end": 2179.5400000000004
    },
    {
        "text": " Si estrellas...",
        "start": 2179.54,
        "end": 2184.54
    },
    {
        "text": " Ahí borré una parte que no tiene que borrar.",
        "start": 2184.54,
        "end": 2193.86
    },
    {
        "text": " Por el parón, una parte cita que no tiene que borrar.",
        "start": 2193.86,
        "end": 2202.86
    },
    {
        "text": " Que el yestre se termina escribiendo, sí, como en la sumatoria, el de j igual 2, de",
        "start": 2202.86,
        "end": 2215.38
    },
    {
        "text": " su jota, por la sumatoria, del igual 0 hasta Q.",
        "start": 2215.38,
        "end": 2220.9
    },
    {
        "text": " Y ese suy.",
        "start": 2220.9,
        "end": 2221.9
    },
    {
        "text": " La amnajota del ahí, el mejota y que esto está en C.",
        "start": 2221.9,
        "end": 2229.6200000000003
    },
    {
        "text": " O sea, si la amda 1 no está en R, construyo y este...",
        "start": 2230.62,
        "end": 2236.62
    },
    {
        "text": " Bueno, entonces la misma situación.",
        "start": 2236.62,
        "end": 2239.74
    },
    {
        "text": " Si la amda 2 ya sabemos que lo estamos haciendo ordenadito pero podría ser todo salteado.",
        "start": 2239.74,
        "end": 2245.1
    },
    {
        "text": " No vuelvo a hacer énfasis en eso porque aburro ya, si no.",
        "start": 2245.1,
        "end": 2251.22
    },
    {
        "text": " Si la amnado no está en R, construyo este...",
        "start": 2251.22,
        "end": 2257.62
    },
    {
        "text": " Claro, uso de vuelta el lema con otros coeficientes que complejos, es el lema complet de los números",
        "start": 2257.62,
        "end": 2262.8199999999997
    },
    {
        "text": " complejos.",
        "start": 2262.8199999999997,
        "end": 2263.8199999999997
    },
    {
        "text": " Habrá otros coeficientes en redes para el amda 1, van a ser para el amda 2.",
        "start": 2263.8199999999997,
        "end": 2267.9
    },
    {
        "text": " La cuestión es que construyo un y estreza estreza, no enulo, perteneciente acá, que va",
        "start": 2267.9,
        "end": 2276.22
    },
    {
        "text": " a usar solamente los valores propios desde 3 en adelante.",
        "start": 2276.22,
        "end": 2283.22
    },
    {
        "text": " O sea, combinación lineal de su mj desde 3 hasta t.",
        "start": 2290.22,
        "end": 2303.22
    },
    {
        "text": " Acáuse el dedo y el dedo, hasta t.",
        "start": 2307.22,
        "end": 2312.22
    },
    {
        "text": " Bueno, entonces el libro termina así.",
        "start": 2312.22,
        "end": 2320.22
    },
    {
        "text": " Bueno, este proceso es finito porque la suma original, el I, tiene solo T sumandos, si los",
        "start": 2320.22,
        "end": 2328.22
    },
    {
        "text": " voy sacando, en algún momento el proceso tiene que terminar.",
        "start": 2328.22,
        "end": 2332.22
    },
    {
        "text": " A mí no me gustó nada, que me lo dije era así y les pregunto a ustedes, ¿qué quiere",
        "start": 2332.22,
        "end": 2336.64
    },
    {
        "text": " decir que nos queda el último? Porque ese es el punto, ¿no? O sea, en algún momento",
        "start": 2336.64,
        "end": 2341.3799999999997
    },
    {
        "text": " si algún lambda está en R, bueno esa es la situación que queremos, fue lo que dijo",
        "start": 2341.3799999999997,
        "end": 2345.54
    },
    {
        "text": " lo que me preguntó Pablo, esto es lo que quiere probar es que el lambda está en R, que",
        "start": 2345.54,
        "end": 2350.98
    },
    {
        "text": " el rodear está en R, pero estos lambda son los que tienen, los que estamos usando,",
        "start": 2350.98,
        "end": 2356.8999999999996
    },
    {
        "text": " son justamente los que tienen módulos rodeados, si alguno está en R es lo que queríamos probar,",
        "start": 2356.8999999999996,
        "end": 2361.22
    },
    {
        "text": " exactamente lo que me preguntó Pablo de Comienzo, pero si ninguno está en R, dice que",
        "start": 2361.22,
        "end": 2367.3399999999997
    },
    {
        "text": " la puedo seguir sacando, pero a mí no me gusta y el último que pasa, vamos a hacerlo,",
        "start": 2367.3399999999997,
        "end": 2371.22
    },
    {
        "text": " a ver qué pasa, a ver qué contradiación llegamos, que sea explícita de la contradición.",
        "start": 2371.22,
        "end": 2376.22
    },
    {
        "text": " Entonces supongamos que ya llegamos hasta el final y nos queda que fuimos generando",
        "start": 2376.22,
        "end": 2382.2599999999998
    },
    {
        "text": " diferentes y estrella y estrella y estrella y estrella hasta que generamos uno que",
        "start": 2382.2599999999998,
        "end": 2387.5
    },
    {
        "text": " solo se escriben función de F sub M, F silenemente el último, ¿no? Entonces y supongamos, o sea",
        "start": 2387.5,
        "end": 2396.34
    },
    {
        "text": " tenemos un I, T, el T chito por la no va a estar un montón de estrechas, ponga un",
        "start": 2396.34,
        "end": 2403.06
    },
    {
        "text": " T chito, ponga el T chito y envés el montón de estrechita, ese I, T chito distinto de",
        "start": 2403.06,
        "end": 2410.9
    },
    {
        "text": " 0, perteneciente acá que se va a escribir, solo en función del último, este, perdón,",
        "start": 2410.9,
        "end": 2420.62
    },
    {
        "text": " el último, T, M sub T, eso emete, ¿ok? Bueno, por supuesto este distinto de 0, ¿no?",
        "start": 2420.62,
        "end": 2432.9
    },
    {
        "text": " Y esto está en C, que quede bien claro la situación, por lo tanto si esto es distinto",
        "start": 2432.9,
        "end": 2438.42
    },
    {
        "text": " del vector nublo en particular, M sub T distinto de 0, sin no tener más el vector nublo,",
        "start": 2438.42,
        "end": 2445.42
    },
    {
        "text": " entonces ¿qué pasa si... si la andate? No se está en el sumato de A, es que ya no",
        "start": 2445.42,
        "end": 2453.34
    },
    {
        "text": " hay más sumato, ¿y ese fue todo? No quedó el último, estoy asumiendo que quizás",
        "start": 2453.34,
        "end": 2458.14
    },
    {
        "text": " fuiste hasta el final, ¿por qué libro dice? Vas sacando hasta que encontras uno en los",
        "start": 2458.14,
        "end": 2463.02
    },
    {
        "text": " reales, como el proceso es finito porque eso es lo T, en algún caso tiene que parar,",
        "start": 2463.02,
        "end": 2467.7400000000002
    },
    {
        "text": " ¿qué pasa si llegas al final al último y ninguno estaba en los reales? Quiero mostrar",
        "start": 2468.74,
        "end": 2474.06
    },
    {
        "text": " la contradicción, ¿ok? Entonces supongamos que la andate tampoco están los reales, supongamos",
        "start": 2474.06,
        "end": 2483.06
    },
    {
        "text": " que el último tampoco está en los reales, nuevamente uso el coroelario de los números",
        "start": 2483.06,
        "end": 2489.54
    },
    {
        "text": " como es para el coroelario, el lema de los números complejos que hemos citado un montón",
        "start": 2489.54,
        "end": 2494.82
    },
    {
        "text": " de veces y existen coeficientes, ya usen tantas letras que usen algunas letras griegas,",
        "start": 2494.82,
        "end": 2506.2599999999998
    },
    {
        "text": " desiten coeficientes, no todos cero, alpha 1 hasta alpha L, no todos cero, tal que la sumatoria",
        "start": 2506.98,
        "end": 2521.26
    },
    {
        "text": " del andate a la I desde igual cero hasta L, multiplicado por estos alpha I, me da cero, el",
        "start": 2522.26,
        "end": 2534.6200000000003
    },
    {
        "text": " número cero en los complejos, L, andate a la I, por eso es L, andate, es el,",
        "start": 2534.62,
        "end": 2552.3399999999997
    },
    {
        "text": " estoy aplicando el lema para este, el andate que nos está en los reales, entonces el",
        "start": 2553.34,
        "end": 2559.78
    },
    {
        "text": " el de aplico lo mismo de siempre, ¿ok? ¿Cómo es la cosa? Vamos a repasarlo acá,",
        "start": 2559.78,
        "end": 2582.86
    },
    {
        "text": " vas a construir un nuevo objeto, a partir de este vas a construir un nuevo objeto que",
        "start": 2583.86,
        "end": 2589.54
    },
    {
        "text": " cómo era, la suma de los coeficientes, alpha, en este caso acá el ances, al caso en alpha,",
        "start": 2589.54,
        "end": 2597.26
    },
    {
        "text": " acá iba hasta C, porque en el lema pusimos C, pero acá le pusimos L, usando eso de A elevado a",
        "start": 2597.26,
        "end": 2606.42
    },
    {
        "text": " esos índices, evaluado en el último que teníamos, acá era ahí, cuando construimos C,",
        "start": 2606.42,
        "end": 2615.7400000000002
    },
    {
        "text": " es 3, acá el último que tenemos es I techo, o sea vamos a escribir eso, consideramos,",
        "start": 2615.7400000000002,
        "end": 2621.78
    },
    {
        "text": " entonces un I, otro techo distinto, un Ibarra, que es la sumatoria desde I igual 0 hasta L,",
        "start": 2621.78,
        "end": 2636.02
    },
    {
        "text": " la alpha Sui por A a la I de I, el techo que teníamos recién, y voy a hacer el mismo tipo de cuenta,",
        "start": 2636.02,
        "end": 2648.94
    },
    {
        "text": " no es la repita, ¿cuál es el acelentad las cuentas que aparecien acá, las que recién repasamos?",
        "start": 2652.06,
        "end": 2660.06
    },
    {
        "text": " O sea, cuando vuelve a aplicar a la I, a la I, a I techo, me dejan cambiar y te chito acá por",
        "start": 2660.06,
        "end": 2669.14
    },
    {
        "text": " quienes, así ya me ahorro pizarrón, el I te chito era, usted, es su MT, ¿ok? Cuando le",
        "start": 2669.14,
        "end": 2679.06
    },
    {
        "text": " aplicemos a la I a su MT, ya sabemos cómo es valor propio, es vector propio, si le aplica una",
        "start": 2679.06,
        "end": 2686.7
    },
    {
        "text": " vez sale, lambda T por el MT, pero si se lo aplico con A a la 5, A a la I veces sale, elevado",
        "start": 2686.7,
        "end": 2694.9399999999996
    },
    {
        "text": " el lambda a la I, bueno eso es lo que va a suceder, cuenta que se hicimos muchas veces, y entonces",
        "start": 2694.9399999999996,
        "end": 2701.5
    },
    {
        "text": " nos queda la sumatoria desde I igual 0 hasta L de alpha Sui por el muzulté sale para fuera,",
        "start": 2701.5,
        "end": 2708.8999999999996
    },
    {
        "text": " por supuesto, por muzulté, por lambda su T a la I por E a la MT, en muzulté me lo dejan sacar,",
        "start": 2708.9,
        "end": 2721.14
    },
    {
        "text": " para ahorrarme pizarrón lo salco para fuera de la sumatoria porque no juega ningún role,",
        "start": 2721.14,
        "end": 2726.86
    },
    {
        "text": " es un coeficiente cualquiera, distinto de 0 nada más, que ya sabemos que es distinto de 0,",
        "start": 2726.86,
        "end": 2731.5
    },
    {
        "text": " y entonces supongamos bueno, ¿qué pasa? acá lo escribo, ahí está, vamos a ver que lo ven así,",
        "start": 2731.5,
        "end": 2748.7
    },
    {
        "text": " este su MT, Urici no tiene nada de quedar con la I, ¿no verdad? O sea esto es, la sumatoria",
        "start": 2750.94,
        "end": 2757.06
    },
    {
        "text": " de I igual 0 de alpha I por lambda su T a la I, siempre multiplicando al mismo su MT,",
        "start": 2757.06,
        "end": 2762.98
    },
    {
        "text": " ¿ok? Por lo tanto, puedo sacar factor como una la derecha en su MT y aparece en el medio de la",
        "start": 2764.14,
        "end": 2770.94
    },
    {
        "text": " sumatoria, este paréntesis, es lo mismo, ¿no verdad? Como siempre es el mismo vector de su MT,",
        "start": 2770.94,
        "end": 2777.34
    },
    {
        "text": " lo salco para fuera, ¿y cuánto da ese paréntesis verde? 0, entonces y te he hecho sería 0,",
        "start": 2777.34,
        "end": 2785.7799999999997
    },
    {
        "text": " eso sería 0, ahí está, y cómo era la cosa? Sí, para, ¿y...",
        "start": 2787.06,
        "end": 2803.58
    },
    {
        "text": " ¿a ver qué dijiste Santiago si es eso? Se exactamente lo mismo que eso acabo de, lo tenía",
        "start": 2817.06,
        "end": 2831.7799999999997
    },
    {
        "text": " ¿No你看 Café, no lo nos graban? Patr серьез, que es normal, erroros como imm momos,",
        "start": 2832.6600000000003,
        "end": 2851.3
    },
    {
        "text": " anterior, sabía que la sumatoria de los conficientes, por la banda, te ha dado cero en ese",
        "start": 2851.3,
        "end": 2858.26
    },
    {
        "text": " paso y ya se aparece desde este paso de caminacero, entonces ese tipo no se dice, y se",
        "start": 2858.26,
        "end": 2863.42
    },
    {
        "text": " dijeron para atrás de adquiseros cero, cero, cero, cero, cero, cero, cero, hasta que",
        "start": 2863.42,
        "end": 2867.02
    },
    {
        "text": " llega allí en tres, se le dijeron cero, pero por definición, era de cero, cero, cero,",
        "start": 2867.02,
        "end": 2872.9
    },
    {
        "text": " ¿cómo vas hacia atrás?",
        "start": 2872.9,
        "end": 2874.9
    },
    {
        "text": " para ver",
        "start": 2874.9,
        "end": 2876.9
    },
    {
        "text": " El este se no puede ser, no puede ser, no puede ser, ninguna de las estricias, hasta ahí",
        "start": 2880.9,
        "end": 2886.62
    },
    {
        "text": " te he hecho no es cero.",
        "start": 2886.62,
        "end": 2887.62
    },
    {
        "text": " Y todos los de las que son complejos, que no son reales, que para que la sumatoria",
        "start": 2887.62,
        "end": 2896.14
    },
    {
        "text": " se va a hacer la sumatoria de el cota de la banda, lo haces, está, pero a parte de que",
        "start": 2896.14,
        "end": 2907.7
    },
    {
        "text": " quienes se higlan las cota, sí, eso es cero para todo cota, entonces te cae cero, pero",
        "start": 2907.7,
        "end": 2915.7
    },
    {
        "text": " por quien me queda aquí esto es cero para todo cota, porque en un cota es, a ver, voy",
        "start": 2915.7,
        "end": 2924.7
    },
    {
        "text": " a hacer como todo cero.",
        "start": 2924.7,
        "end": 2926.7
    },
    {
        "text": " Sí, pero, pero los coeficientes, estos dependen, estos coeficientes 6 fueron para",
        "start": 2926.7,
        "end": 2939.52
    },
    {
        "text": " lambda 1, si hago la combinación para un lambda 2 o un lambda 3, no me tiene por que dar",
        "start": 2939.52,
        "end": 2948.58
    },
    {
        "text": " los coeficientes que aparecen aquí, para por ejemplo el lambda t, por eso lo llame distinto,",
        "start": 2949.58,
        "end": 2957.34
    },
    {
        "text": " perfectamente puede ser completamente distinto, estos a los s, tienen la misma condición que",
        "start": 2957.34,
        "end": 2962.7799999999997
    },
    {
        "text": " son mayores iguales que cero y que no son todos cero, pero en principio, bueno, este,",
        "start": 2962.7799999999997,
        "end": 2970.74
    },
    {
        "text": " no, yo tengo una forma de llegar al absurdo, pero pensé que capaz que ustedes veían",
        "start": 2970.74,
        "end": 2975.98
    },
    {
        "text": " una forma más rápida y entonces me quedé esperando y ahora, incluso me quedé pensando,",
        "start": 2975.98,
        "end": 2982.1
    },
    {
        "text": " si no hay una forma más rápida, yo tengo una forma de llegar al absurdo, pero déjame",
        "start": 2982.1,
        "end": 2986.22
    },
    {
        "text": " pensar a ver si hay una forma más ágil ahora.",
        "start": 2986.22,
        "end": 2988.42
    },
    {
        "text": " No, yo creo que esto es que hay que ir con el cero, pero esto un día es que ella",
        "start": 2988.42,
        "end": 2993.1
    },
    {
        "text": " es el cero, pero con esto, por construcción de a un cero, para el cero, para el cero,",
        "start": 2993.1,
        "end": 2999.26
    },
    {
        "text": " exacto, entonces ahí está, exactamente, para lo que iba a hacer ahora es probar que",
        "start": 2999.78,
        "end": 3005.7400000000002
    },
    {
        "text": " hay que he hecho el distinto de cero con la misma técnica que probamos que y estrés era",
        "start": 3005.7400000000002,
        "end": 3010.86
    },
    {
        "text": " distinto de cero, exactamente la misma técnica, la técnica era estará basada en esta, en este",
        "start": 3010.86,
        "end": 3017.38
    },
    {
        "text": " pot, si se acuerdan, que íbamos separando de un lado, el primer sumando y del otro entonces",
        "start": 3017.38,
        "end": 3022.1800000000003
    },
    {
        "text": " el primer coeficiente es cero y después usamos esto también, esto en la aparición en el medio",
        "start": 3022.1800000000003,
        "end": 3027.34
    },
    {
        "text": " de la demostración también para probar, exactamente, o sea que con la misma técnica se repite",
        "start": 3027.34,
        "end": 3032.5
    },
    {
        "text": " la técnica y podés probar, así como acá vamos a probar que cero, se puede probar que",
        "start": 3032.5,
        "end": 3038.82
    },
    {
        "text": " desde ahí estrellas pasas ahí te he hecho distinto de cero, usando, le pongo acá que caz",
        "start": 3038.82,
        "end": 3045.1400000000003
    },
    {
        "text": " propio, que recuerden cuál es la técnica, es el mismo truco, lo pongo el rojo para",
        "start": 3045.1400000000003,
        "end": 3051.2200000000003
    },
    {
        "text": " que se acuerdan, es esto, esto cuando probamos eso la misma técnica se prueba que hay",
        "start": 3051.22,
        "end": 3061.8999999999996
    },
    {
        "text": " techo y distinto de cero, separando, ah, este queda cero, entonces pongo un sumando",
        "start": 3061.8999999999996,
        "end": 3067.7
    },
    {
        "text": " este lado, del otro del otro lado, como están acá y menos acá, entonces el primer coeficiente",
        "start": 3067.7,
        "end": 3071.98
    },
    {
        "text": " es cero y ahí sigo probando que todo lo que ofiende es cero y entonces eso es absurdo",
        "start": 3071.98,
        "end": 3077.62
    },
    {
        "text": " porque no todos los coeficiente son cero, no todos los alfaz son cero, eso es absurdo,",
        "start": 3077.62,
        "end": 3082.8599999999997
    },
    {
        "text": " quiere decir que el hi-techo tiene que ser distinto de cero, pero por otro lado el hi-techo",
        "start": 3082.8599999999997,
        "end": 3086.18
    },
    {
        "text": " cero y ahí está el absurdo final y ahí está el absurdo final, pero yo quería explicitarlo",
        "start": 3086.18,
        "end": 3098.58
    },
    {
        "text": " porque no me parecía tan obvio que fuera evidente, entonces ¿qué es lo que probamos acá?",
        "start": 3098.58,
        "end": 3111.5
    },
    {
        "text": " Probamos que rodeas valor propio de ah, porque alguno de los lambda tiene que ser real.",
        "start": 3111.5,
        "end": 3120.2999999999997
    },
    {
        "text": " Sí, nieta la propiet realidad, porque la Plata es un impossible valor sin dar positivигos,",
        "start": 3120.3,
        "end": 3140.2200000000003
    },
    {
        "text": " Sí, ahí está, por ejemplo, ahí está, esa es una justificación rápida, totalmente",
        "start": 3150.3,
        "end": 3158.46
    },
    {
        "text": " acuerdo, y igualmente me cabe la sinusurgio antes, así si ya no está, explícito antes,",
        "start": 3158.46,
        "end": 3169.54
    },
    {
        "text": " ¿cómo fue que probamos nosotros si no estaban en R, nada más?",
        "start": 3169.54,
        "end": 3174.34
    },
    {
        "text": " Claro, está bien, en el razón, en principio le aduda a Nico es cierta, porque nosotros",
        "start": 3174.34,
        "end": 3182.02
    },
    {
        "text": " supusimos que no estaba en R, entonces perfectamente podría ser menos rodear, podría ser",
        "start": 3182.02,
        "end": 3189.78
    },
    {
        "text": " menos rodear, tiene razón Nico, pero como dijo Santiago, eso es absurdo porque ha de",
        "start": 3189.78,
        "end": 3195.7400000000002
    },
    {
        "text": " caja incluido en caja y si fuera un valor propio menos rodear, te queda para el otro",
        "start": 3195.7400000000002,
        "end": 3201.1400000000003
    },
    {
        "text": " lado y entonces sería el caso de hacer, porque te queda hacer.",
        "start": 3201.14,
        "end": 3207.9
    },
    {
        "text": " Bueno, muy bien, gracias por la notación, porque era importante. Se nos fue la hora que",
        "start": 3207.9,
        "end": 3216.74
    },
    {
        "text": " teníamos, sin embargo, quiero observar, que creo que la parte dos también la tenemos",
        "start": 3216.74,
        "end": 3221.62
    },
    {
        "text": " probada, pero quiero chequearlo y la parte tres también va a estar bastante probada,",
        "start": 3221.62,
        "end": 3230.2599999999998
    },
    {
        "text": " pero sí es por la construcción, pero la parte dos es evidente, a ver, nosotros consideramos,",
        "start": 3230.26,
        "end": 3250.6200000000003
    },
    {
        "text": " estos que tenían todos los bloques máximos y probamos que uno de estos de entre un y",
        "start": 3250.6200000000003,
        "end": 3256.0200000000004
    },
    {
        "text": " este, probamos que era real, por lo tanto, está, el a parte dos es evidente, claro, por",
        "start": 3256.02,
        "end": 3265.3
    },
    {
        "text": " un instante, me olvides de esta hipótesis en la parte dos, lo leemos junto en la parte",
        "start": 3265.3,
        "end": 3272.14
    },
    {
        "text": " dos, lo que dice en la parte dos es que el bloque más grande ha asociado, después que",
        "start": 3272.14,
        "end": 3278.2599999999998
    },
    {
        "text": " probaste que es valor propio, ya probaste que rodeas valor propio, entonces vamos a mirar",
        "start": 3278.2599999999998,
        "end": 3283.02
    },
    {
        "text": " hacer bloques más grandes asociados de ese valor propio, mirar los bloques más grandes",
        "start": 3283.02,
        "end": 3286.98
    },
    {
        "text": " asociados de todos los valores propios, ojo, por eso es que dudé en un asistante,",
        "start": 3286.98,
        "end": 3294.18
    },
    {
        "text": " todos los valores propios que es un norma, que su módulo sea exactamente rodeado y estos",
        "start": 3294.18,
        "end": 3299.5
    },
    {
        "text": " están considerados aquí en la primera lista, de estos nos quedamos al principio, entre",
        "start": 3299.5,
        "end": 3307.18
    },
    {
        "text": " unites con lo que tiene este bloque máximo y dentro de estos mostramos que uno de ellos",
        "start": 3307.18,
        "end": 3315.8599999999997
    },
    {
        "text": " es justamente rodeado, entonces al final probaste que este mayor igual que el beta de los demás.",
        "start": 3315.8599999999997,
        "end": 3321.7
    },
    {
        "text": " ¿Y ahí? ¿Sabes que esta con condiciones, o sea que el ando a subir el buen a rodeado",
        "start": 3321.7,
        "end": 3329.1
    },
    {
        "text": " es el mismo, ¿por qué cuando construiste M, como lo definiste? Es el máximo de los",
        "start": 3329.1,
        "end": 3339.66
    },
    {
        "text": " veces un jota de aquellos que tienen módulo roo, uno hay, porque el máximo, no puede",
        "start": 3339.66,
        "end": 3346.2599999999998
    },
    {
        "text": " ser súper más, es una cantidad finita, y uno hay, capaz que eso lo unen y el trabajo",
        "start": 3346.2599999999998,
        "end": 3351.02
    },
    {
        "text": " reinute, bueno no, si era solo uno tendremos que aprobar que ese estaban los reales y era",
        "start": 3351.02,
        "end": 3356.7799999999997
    },
    {
        "text": " el último caso, era como si hubiéramos arrancado en el último caso, exactamente, muy buena",
        "start": 3356.78,
        "end": 3361.2200000000003
    },
    {
        "text": " pregunta, pero se entendió que entonces el do ya está y tres creo que también está, como",
        "start": 3361.2200000000003,
        "end": 3367.94
    },
    {
        "text": " dijo Santiago, es la construcción de I, pero hay un detallecito, yo lo hice.",
        "start": 3367.94,
        "end": 3372.5800000000004
    },
    {
        "text": " Es que, claro, exactamente, cuando en este proceso",
        "start": 3386.78,
        "end": 3415.34
    },
    {
        "text": " lo hice y no lo destacé en el momento claro, pero bueno, ni por tal, lo destacamos ahora.",
        "start": 3415.34,
        "end": 3422.9
    },
    {
        "text": " Y ya está pronto, tres también, ¿cómo fue la construcción? Y después de esto",
        "start": 3422.9,
        "end": 3432.06
    },
    {
        "text": " paramos porque terminamos el teoreema, así que no los voy a, no los aburromar, tenemos un",
        "start": 3432.06,
        "end": 3436.7000000000003
    },
    {
        "text": " y que estaba en C, si la anda uno no está en R, entonces si la anda uno no está en R,",
        "start": 3436.7,
        "end": 3447.7799999999997
    },
    {
        "text": " construimos un I estrellas, no en Ulo, perteneciente acá, si la anda dos no está en R,",
        "start": 3447.7799999999997,
        "end": 3459.66
    },
    {
        "text": " construimos un I y doble estrellas, no en Ulo, perteneciente acá, cierto, y así fuimos",
        "start": 3459.66,
        "end": 3468.7799999999997
    },
    {
        "text": " eliminando todos los lambda I, los lambda I que no estuvieran en R y fuimos generando nuevos",
        "start": 3468.7799999999997,
        "end": 3481.5
    },
    {
        "text": " I y prima, no en Ulo, perteneciente acá. Como les observé un montón de veces, lo hacemos",
        "start": 3481.5,
        "end": 3491.7
    },
    {
        "text": " con lambda U y con lambda 2 para que quede prolijo, pero en realidad podría ser que lambda",
        "start": 3491.7,
        "end": 3496.54
    },
    {
        "text": " unos ya estuvieran R o el lambda otra, pero el proceso es eliminar todos los coeficientes",
        "start": 3496.54,
        "end": 3502.18
    },
    {
        "text": " que no están en R, después que eliminaste todos los coeficientes que están en R, cuando",
        "start": 3502.18,
        "end": 3507.3
    },
    {
        "text": " llegamos al final probamos que por lo menos uno está en R, pero podría haber muchos",
        "start": 3507.3,
        "end": 3510.9
    },
    {
        "text": " que están en R, lo que pasa es que después que eliminaste todos los coeficientes que no",
        "start": 3510.9,
        "end": 3515.5
    },
    {
        "text": " están en R, ya lo se eliminaste, de esta cuentita lo se eliminamos todos los que no están en",
        "start": 3515.5,
        "end": 3522.06
    },
    {
        "text": " R, y fuimos generando nuevos, nuevas combinaciones lineales, los coeficientes ya no son los mismos,",
        "start": 3522.06,
        "end": 3528.78
    },
    {
        "text": " pero usamos solamente los victores propios que los valores propios están R y lo digo una",
        "start": 3528.78,
        "end": 3534.82
    },
    {
        "text": " vez más lo último porque es la clave, usamos al final los victores propios cuyo valor",
        "start": 3534.82,
        "end": 3540.14
    },
    {
        "text": " propios está en R, o sea que es rodear, por lo tanto cuando llegaste al final, cuando",
        "start": 3540.14,
        "end": 3545.02
    },
    {
        "text": " eliminaste todos, vamos a malo y prima el último, que yo no sé cuál es el último, acá",
        "start": 3545.02,
        "end": 3551.9
    },
    {
        "text": " dijimos y si no lo queda más ninguno, pero en realidad el último puede quedar en el",
        "start": 3551.9,
        "end": 3556.02
    },
    {
        "text": " medio, en un momento no hay más conficientes en R, no hay más conficientes fuera de R y",
        "start": 3556.02,
        "end": 3559.7799999999997
    },
    {
        "text": " los que me quedaron unos cuantos que están en R, bueno eso me quedó un I prima, está",
        "start": 3559.7799999999997,
        "end": 3565.2599999999998
    },
    {
        "text": " en K combinación lineal y de vuelta, acá va a aparecer una combinación lineal demasiado",
        "start": 3565.26,
        "end": 3571.5400000000004
    },
    {
        "text": " proligita porque va a ser como que combinación lineal desde S, M y más uno hasta S, M, T,",
        "start": 3571.5400000000004,
        "end": 3581.1400000000003
    },
    {
        "text": " repito, no tienen porque ser lo último en lo que están en R y los primeros no, es simplemente",
        "start": 3581.1400000000003,
        "end": 3587.6600000000003
    },
    {
        "text": " una reordenación de esto, pero estos son los que tienen los valores propios, lambda",
        "start": 3587.6600000000003,
        "end": 3594.78
    },
    {
        "text": " este suima sueno hasta lambda subte, todos igual a rodear, todos sobrevivieron lo que",
        "start": 3594.78,
        "end": 3604.3
    },
    {
        "text": " están en R, ¿qué pasa cuando yo le aplico a I prima? Repito, I prima está en K y no",
        "start": 3604.3,
        "end": 3612.5
    },
    {
        "text": " es nulo, quedan acá por supuesto, pero ¿cuánto da? Es una combinación lineal de estos",
        "start": 3612.5,
        "end": 3621.7400000000002
    },
    {
        "text": " chachos, que tienen valor propio rodear, todos ellos.",
        "start": 3621.74,
        "end": 3625.74
    },
    {
        "text": " ¿Cara o sea que da rodear por I prima? Porque en cada sumando lo que participan",
        "start": 3625.74,
        "end": 3639.18
    },
    {
        "text": " son los lectores propios, entonces en cada sumando sal un rodear. ¿Eso es el propio",
        "start": 3639.18,
        "end": 3645.02
    },
    {
        "text": " malo de la manera de hacer la roda? Sí, sí, santiago, sí, exactamente, pero en este proceso",
        "start": 3646.02,
        "end": 3653.66
    },
    {
        "text": " que fuimos haciendo, eliminando todos los landas que no sean reales, entonces te quedaste con",
        "start": 3653.66,
        "end": 3660.22
    },
    {
        "text": " los landas, de esos que me acabas de decir, los que tienen lambda real, o sea que es rodear, me",
        "start": 3660.22,
        "end": 3666.9
    },
    {
        "text": " quedé con los que tienen rodear exactamente, entonces cuando haga la combinación lineal que",
        "start": 3666.9,
        "end": 3672.82
    },
    {
        "text": " hagas, te aplique la matriz a esa combinación lineal, en cada uno de esos bitorcitos salga",
        "start": 3672.82,
        "end": 3679.1400000000003
    },
    {
        "text": " rodea para fuera y quede la misma combinación lineal multiplicada por rodear. Este muchacho,",
        "start": 3679.1400000000003,
        "end": 3684.86
    },
    {
        "text": " quién es el I prima? SLB y I prima SLB de la tercera parte. SLB de la parte 3.",
        "start": 3684.86,
        "end": 3700.5800000000004
    },
    {
        "text": " Está en caa, no es nulo, el vector propio. Te me perdiste Camila, tienes cara que tener",
        "start": 3702.82,
        "end": 3715.1800000000003
    },
    {
        "text": " para ir seguro que no? Bueno, yo sé que ya pueden repasar ahí en el pen fin, vale la pena",
        "start": 3715.1800000000003,
        "end": 3722.1800000000003
    },
    {
        "text": " ver si es porque era esto, porque era lo otro. Cográse la cara, adiós, está con la de",
        "start": 3722.1800000000003,
        "end": 3727.94
    },
    {
        "text": " cara. Ese, Urices, esta es la esencia, tenemos mucho más para decir la metablemente mañana,",
        "start": 3727.94,
        "end": 3736.38
    },
    {
        "text": " vamos a estar con perro de proveño de vuelta, porque yo quería meter grafos ya mañana,",
        "start": 3736.38,
        "end": 3741.62
    },
    {
        "text": " pero hay mucho más por decir, por ejemplo no probamos esto, esto no lo probamos, por ejemplo",
        "start": 3741.62,
        "end": 3748.7000000000003
    },
    {
        "text": " es el famoso perro de proveños, es una aplicación de este, sí sí, es una aplicación de este",
        "start": 3748.7,
        "end": 3757.7799999999997
    },
    {
        "text": " cuando el cae es el cono de los efectores positivos, muy bien, es el que usa Google si quieren,",
        "start": 3757.7799999999997,
        "end": 3764.46
    },
    {
        "text": " pero Google, por ejemplo, usa que este vector que sale aquí es positivo, positivo, o sea el cae es",
        "start": 3764.46,
        "end": 3772.8599999999997
    },
    {
        "text": " el de los efectores positivos, pero quién es el cono positivo? El cono positivo es los",
        "start": 3772.86,
        "end": 3779.2200000000003
    },
    {
        "text": " efectores mayores iguales que se recuerdan, pero no, pero lo que se usa es que el vector solución",
        "start": 3779.2200000000003,
        "end": 3786.1800000000003
    },
    {
        "text": " es positivo, eso se puede probar lo vamos a hacer y me desotra cuenta más, yo quiero llegar hasta",
        "start": 3786.1800000000003,
        "end": 3794.34
    },
    {
        "text": " esa fase, el perro de proveños tiene muchas más partes, hay algunas que no voy a poder probar",
        "start": 3794.34,
        "end": 3800.6600000000003
    },
    {
        "text": " porque no llevarían dos clases más, pero quiero llegar hasta ese punto que es la esencia del famoso",
        "start": 3800.66,
        "end": 3806.2599999999998
    },
    {
        "text": " terema que usa Google, etcétera, etcétera, etcétera, ¿no puede ser cero? No, no, no puede ser cero, pero yo",
        "start": 3806.2599999999998,
        "end": 3814.8199999999997
    },
    {
        "text": " quiero que este ve lo que usa, acá sacaste que veis que es cero que su mérito del propio, pero",
        "start": 3814.8199999999997,
        "end": 3820.7799999999997
    },
    {
        "text": " además cuando uses el cae de proveños, el cono es del cono positivo, los efectores mayores iguales",
        "start": 3820.7799999999997,
        "end": 3829.7
    },
    {
        "text": " que cero, no es antiago, pero las coordenadas pueden ser algunas cero y otras mayores, lo que usa",
        "start": 3829.7,
        "end": 3834.68
    },
    {
        "text": " Google es que todos los verdes, todas son coordenadas son positivas y eso es, bueno hay algún hipótesis",
        "start": 3834.68,
        "end": 3842.3399999999997
    },
    {
        "text": " maque, por supuesto el famoso perro de proveños es para el cono positivo, pero tiene una hipótesis",
        "start": 3842.3399999999997,
        "end": 3848.9399999999996
    },
    {
        "text": " extra, tiene un hipótesis maque, es una matriz irreducible si llaman y por eso saca la conclusión",
        "start": 3848.9399999999996,
        "end": 3854.8599999999997
    },
    {
        "text": " de que el vector es positivo, positivo, ¿tá? pero quiero llegar a eso para que lo tengan, no",
        "start": 3854.86,
        "end": 3860.54
    },
    {
        "text": " podemos irnos a este curso sin tener ese demostrado, así que eso va a ser mañana y el viernes",
        "start": 3860.54,
        "end": 3869.1
    },
    {
        "text": " me queda con ganas en este curso de hablar de matrices estocáticas más, me queda que en este curso",
        "start": 3870.7000000000003,
        "end": 3875.26
    },
    {
        "text": " de hacer teoría de grafos con más fuerza, ya que están discrétagos, no podríamos, yo decidiría",
        "start": 3875.26,
        "end": 3880.94
    },
    {
        "text": " ganar un clase un mes más, pero este no se puede, bueno chicos, gracias por venir hoy",
        "start": 3880.94,
        "end": 3890.14
    }
]