[
    {
        "text": " Bueno, entonces, como les decía recién, lo gustaría arrancar enfatizando algunas cosas",
        "start": 0.0,
        "end": 11.200000000000001
    },
    {
        "text": " o resaltando algunas cosas de las que deben haberle ido.",
        "start": 11.200000000000001,
        "end": 18.04
    },
    {
        "text": " Quizás alguien tiene alguna duda de las cosas de los temas de la semana pasada, también",
        "start": 18.04,
        "end": 25.84
    },
    {
        "text": " podemos aprovechar ahora si me quiere consultar.",
        "start": 25.84,
        "end": 30.240000000000002
    },
    {
        "text": " Lo van a ir un poco las ventanas acá.",
        "start": 56.84,
        "end": 61.84
    },
    {
        "text": " Bueno, si no hay ningún comentario sobre los temas de la semana pasada, sobre los temas",
        "start": 61.84,
        "end": 70.2
    },
    {
        "text": " de esta semana, que son el capítulo 2 que tiene que ver con complejidad, con análisis,",
        "start": 70.2,
        "end": 76.84
    },
    {
        "text": " complejidad de los orismos, es decir, sobre todo, nos vamos a concentrar el tiempo de ejecución",
        "start": 76.84,
        "end": 84.60000000000001
    },
    {
        "text": " y fundamentalmente vamos a expir la notación sintótico.",
        "start": 84.6,
        "end": 90.6
    },
    {
        "text": " El análisis es asentótico y la notación que se usa para eso, que da un gran visto",
        "start": 90.6,
        "end": 94.67999999999999
    },
    {
        "text": " de obra, ne, o meiga, etcétera.",
        "start": 94.67999999999999,
        "end": 100.6
    },
    {
        "text": " Entonces, esto realmente es una de las ustedes, a denabrtenido alguna experiencia primaria",
        "start": 100.6,
        "end": 110.0
    },
    {
        "text": " que con este tema en programación 2 seguramente.",
        "start": 110.0,
        "end": 113.0
    },
    {
        "text": " Ahora vamos a ir bastante más profundo en esto y es algo fundamental, es decir, entender",
        "start": 113.0,
        "end": 121.76
    },
    {
        "text": " la complejidad de los orismos que tal eficiente son, se capazes de analizarlo con cuidado.",
        "start": 121.76,
        "end": 130.16
    },
    {
        "text": " Bueno, definitivamente es buena parte de lo que nos interesa la gente que hacemos computación,",
        "start": 130.16,
        "end": 136.56
    },
    {
        "text": " tener algoritmos que sean eficientes, implementaciones de esos algoritmos que sean eficientes.",
        "start": 136.56,
        "end": 143.56
    },
    {
        "text": " Una cosa que les quería comentar es que habrán visto que, sobre todo el nivel en que",
        "start": 143.56,
        "end": 148.56
    },
    {
        "text": " nos expresamos los algoritmos, que es de muy alto nivel, hay una diferencia entre lo que",
        "start": 148.56,
        "end": 156.72
    },
    {
        "text": " es el algoritmo en sí, la eficiencia que cuadra que es algoritmo y...",
        "start": 156.72,
        "end": 165.56
    },
    {
        "text": " una implementación de ese algoritmo.",
        "start": 166.56,
        "end": 169.56
    },
    {
        "text": " Entonces, si ustedes miren un algoritmo como el de GaleSapple y por ejemplo que vemos",
        "start": 169.56,
        "end": 173.56
    },
    {
        "text": " el otro día de la forma expresada como está, bueno, pudimos analizar, por ejemplo,",
        "start": 173.56,
        "end": 180.56
    },
    {
        "text": " en cuántas iteraciones termines el algoritmo.",
        "start": 180.56,
        "end": 185.56
    },
    {
        "text": " Es como una... así quiera un efecto secundario de haber probado que el algoritmo, de hecho,",
        "start": 185.56,
        "end": 192.56
    },
    {
        "text": " termine.",
        "start": 192.56,
        "end": 193.56
    },
    {
        "text": " Ahora, que el tiempo de ejecución de ese algoritmo sea de orden de N cuadrado,",
        "start": 198.56,
        "end": 205.56
    },
    {
        "text": " ustedes habrán visto, tiene que ver cómo, depende mucho de cómo le implementen.",
        "start": 205.56,
        "end": 208.56
    },
    {
        "text": " Eso es lo que puede implementar de forma eficiente y lo puede implementar de forma nota",
        "start": 208.56,
        "end": 214.56
    },
    {
        "text": " en eficiente. Y con eficiente me refiero a no a pequeños hacks que tienen que ver que cómo implementar",
        "start": 214.56,
        "end": 219.56
    },
    {
        "text": " un paso de forma un poco más rápida, que si visiera de otra manera,",
        "start": 219.56,
        "end": 223.56
    },
    {
        "text": " sino realmente a uso de estructuras y de estructuras tanto de control como de datos",
        "start": 223.56,
        "end": 232.56
    },
    {
        "text": " que posibilitan que el tiempo de ejecución de esa implementación de ese algoritmo",
        "start": 232.56,
        "end": 240.56
    },
    {
        "text": " sea en tiempo de N cuadrado y no algo superior.",
        "start": 240.56,
        "end": 244.56
    },
    {
        "text": " Entonces, ustedes van a ver que muchas veces los anuncios de nuestros ejercicios,",
        "start": 244.56,
        "end": 253.56
    },
    {
        "text": " a lo largo de este curso, van a decir algo como, demuestre que su algoritmo",
        "start": 253.56,
        "end": 261.56
    },
    {
        "text": " admite una implementación, cuyo tiempo de ejecución es tal y cual.",
        "start": 261.56,
        "end": 266.56
    },
    {
        "text": " Asintóticamente.",
        "start": 267.56,
        "end": 269.56
    },
    {
        "text": " Tenía un comentario antes de esto, creo que...",
        "start": 273.56,
        "end": 276.56
    },
    {
        "text": " Entonces para eso es importante reparar este punto,",
        "start": 278.56,
        "end": 283.56
    },
    {
        "text": " resalte acá, cómo se representa y manipulan los datos en una implementación de algoritmo.",
        "start": 283.56,
        "end": 289.56
    },
    {
        "text": " Y hace un uso de discusiones en eso, lo que es la implementación de algoritmo y la algoritmo en sí.",
        "start": 289.56,
        "end": 294.56
    },
    {
        "text": " El algoritmo para ser tal al alto nivel, como se veremos presentarlo,",
        "start": 295.56,
        "end": 300.56
    },
    {
        "text": " muchas veces no es obvio que tan esficiente puede ser una implementación de ese algoritmo.",
        "start": 300.56,
        "end": 307.56
    },
    {
        "text": " Hay que describir con precisión cuáles son las estructuras de datos que vamos a usar,",
        "start": 307.56,
        "end": 313.56
    },
    {
        "text": " cómo lo vamos a usar, etcétera.",
        "start": 313.56,
        "end": 315.56
    },
    {
        "text": " En este caso, ustedes lo habrán visto en una sección del libro que justamente se detiene,",
        "start": 315.56,
        "end": 321.56
    },
    {
        "text": " que está que estamos viendo acá, se detienen cómo hacer eso en el mismo día.",
        "start": 321.56,
        "end": 327.56
    },
    {
        "text": " Si lo vamos a ver el mismo que vimos la semana pasada,",
        "start": 327.56,
        "end": 329.56
    },
    {
        "text": " es muy buena ver este algoritmo, que vamos a mostrar que se puede que admite una implementación",
        "start": 329.56,
        "end": 335.56
    },
    {
        "text": " cuyo tiempo de ejecución es o de enecuadra.",
        "start": 335.56,
        "end": 339.56
    },
    {
        "text": " Y para eso define todas las eleas de estructuras.",
        "start": 339.56,
        "end": 342.56
    },
    {
        "text": " Y explica cómo las pusa.",
        "start": 345.56,
        "end": 348.56
    },
    {
        "text": " Muchas veces pasa, sobre todo, cuando uno viene acostumbrado de cursos más de programación",
        "start": 348.56,
        "end": 355.56
    },
    {
        "text": " y tanto de algoritmia, algunos ustedes se sienten con un poco desorientados por la forma",
        "start": 355.56,
        "end": 364.56
    },
    {
        "text": " en que escribimos los algoritmos de un nivel tan alto, tan cercano,",
        "start": 364.56,
        "end": 369.56
    },
    {
        "text": " realmente un implementación como programa en un lenguaje al nivel.",
        "start": 369.56,
        "end": 375.56
    },
    {
        "text": " Y genera un poco de dudas hasta que, hasta cuando podemos llegar con estos de los pasos del tan alto en el nivel.",
        "start": 375.56,
        "end": 384.56
    },
    {
        "text": " Obviamente no queremos algo que diga paso 1, suficiono del problema, y fin.",
        "start": 384.56,
        "end": 390.56
    },
    {
        "text": " Y tampoco estamos siendo algo tan fino como un programa realmente en el mundo.",
        "start": 390.56,
        "end": 396.56
    },
    {
        "text": " ¿Dónde está ese punto?",
        "start": 396.56,
        "end": 399.56
    },
    {
        "text": " Es un poco sutil. Lo que tiene que quedar claro, en el nivel que se expresemos el algoritmo,",
        "start": 399.56,
        "end": 407.56
    },
    {
        "text": " es que los pasos 1 por 1, que si tienen que realizar pasos sencillos, que si tienen que realizar",
        "start": 407.56,
        "end": 413.56
    },
    {
        "text": " para si una persona va a seguir paso a paso, es el algoritmo para obtener una solución,",
        "start": 413.56,
        "end": 420.56
    },
    {
        "text": " de un problema que tengamos en el programa.",
        "start": 420.56,
        "end": 423.56
    },
    {
        "text": " Y eso no necesariamente como es en el ejemplo del último nivel,",
        "start": 424.56,
        "end": 428.56
    },
    {
        "text": " es que no necesariamente implica que esos pasos salgan referencias a estructuras de datos particular.",
        "start": 428.56,
        "end": 435.56
    },
    {
        "text": " Como vimos en este ejemplo, toma un m libre, ahí no estoy diciendo de dónde,",
        "start": 435.56,
        "end": 442.56
    },
    {
        "text": " todo mona, que está algoritmicamente, desde el punto de vista,",
        "start": 442.56,
        "end": 445.56
    },
    {
        "text": " si yo como una persona voy a seguir esos pasos, la de otros,",
        "start": 445.56,
        "end": 449.56
    },
    {
        "text": " es perfectamente que es lo que vamos a hacer.",
        "start": 449.56,
        "end": 452.56
    },
    {
        "text": " No está dicho cómo se lleva eso a una computadora.",
        "start": 452.56,
        "end": 458.56
    },
    {
        "text": " Cuando analizamos el algoritmo, no estaría mal si uno,",
        "start": 458.56,
        "end": 463.56
    },
    {
        "text": " y la dar un poco más fino, y deja entre ver que este utero podrá usar.",
        "start": 463.56,
        "end": 467.56
    },
    {
        "text": " Nada es un poco más fino de lo que realmente necesitamos para expresar una onda.",
        "start": 467.56,
        "end": 474.56
    },
    {
        "text": " Ahora, cuando vamos a analizar el tiempo de ejecución o el consumo de memoria o lo que fuera de algoritmo,",
        "start": 474.56,
        "end": 481.56
    },
    {
        "text": " ahí sí necesitamos explicar cuáles son las estructuras que vamos a usar,",
        "start": 481.56,
        "end": 488.56
    },
    {
        "text": " cómo la vamos a usar, y por qué usamos las estructuras,",
        "start": 488.56,
        "end": 491.56
    },
    {
        "text": " el tiempo de ejecución es el que yo digo.",
        "start": 491.56,
        "end": 494.56
    },
    {
        "text": " Y de repente, si uno es más explícito en cuando el abuelo de algoritmo,",
        "start": 494.56,
        "end": 499.56
    },
    {
        "text": " capaz que tiene que ser menos de desayun, la explicación de cómo lo hace y al revés.",
        "start": 499.56,
        "end": 504.56
    },
    {
        "text": " Entonces, la frontera ahí es un poco difusa,",
        "start": 504.56,
        "end": 509.56
    },
    {
        "text": " y hay en general muchas formas de hacer lo de resolver eso,",
        "start": 509.56,
        "end": 513.56
    },
    {
        "text": " y queda un poco al criterio de ustedes sin muy estar mal.",
        "start": 513.56,
        "end": 519.56
    },
    {
        "text": " A veces les genera un poco de insactitud.",
        "start": 519.56,
        "end": 523.56
    },
    {
        "text": " Por eso también está bueno como les ven,",
        "start": 523.56,
        "end": 526.56
    },
    {
        "text": " y me siento varios días que tratan de escribir las opciones de acerca a alguien de la ley,",
        "start": 526.56,
        "end": 532.56
    },
    {
        "text": " de mandarnos las a nosotros para que se la leamos, etc.",
        "start": 532.56,
        "end": 537.56
    },
    {
        "text": " Así que bueno, esto de mostrar, de analizar el tiempo de ejecución en el abuelo,",
        "start": 540.56,
        "end": 544.56
    },
    {
        "text": " muchas veces pasa por esto, de explicar esto que está resaltado acá,",
        "start": 544.56,
        "end": 548.56
    },
    {
        "text": " cómo se representan y se manipulan los datos en una implementación de los volos.",
        "start": 548.56,
        "end": 554.56
    },
    {
        "text": " Así de escribir cómo le implementaría para que el tiempo de ejecución sea y pienso dio que eso.",
        "start": 554.56,
        "end": 559.56
    },
    {
        "text": " Otro punto que resalté acá sobre el análisis del B1 de B1 de B1 es particular,",
        "start": 562.56,
        "end": 566.56
    },
    {
        "text": " porque es algo que vamos a usar a menudo, que van a usar a ustedes a menudo,",
        "start": 566.56,
        "end": 571.56
    },
    {
        "text": " es que creo que se puede para simplificar,",
        "start": 571.56,
        "end": 575.56
    },
    {
        "text": " vamos a suponer que en conjunto D, M y D, son ambos naturales de 1 hasta 1.",
        "start": 575.56,
        "end": 583.56
    },
    {
        "text": " Definirlo, eso parece una definición normal,",
        "start": 584.56,
        "end": 589.56
    },
    {
        "text": " en principio el algoritmo, tal cual lo está expresado,",
        "start": 589.56,
        "end": 595.56
    },
    {
        "text": " bueno, hay un conjunto M y un conjunto W que no tiene porque esas naturales,",
        "start": 595.56,
        "end": 599.56
    },
    {
        "text": " a veces pueden ser como dijimos, personas, a veces podrían ser,",
        "start": 599.56,
        "end": 602.56
    },
    {
        "text": " y en una implementación concreta podéis tener datos, son esas personas,",
        "start": 602.56,
        "end": 606.56
    },
    {
        "text": " a veces podrían ser, por ejemplo, estudiantes de medicina tratando de aspirar a un enternador al lado,",
        "start": 607.56,
        "end": 617.56
    },
    {
        "text": " como el ejemplo que veíamos las veces pasadas en el libro,",
        "start": 617.56,
        "end": 621.56
    },
    {
        "text": " el otro conjunto podría ser, no sé, hospitales, puede ser las datos sobre esos hospitales,",
        "start": 621.56,
        "end": 626.56
    },
    {
        "text": " pero tú lo olvidamos de esas detalles y siempre podemos atraer esa situación,",
        "start": 626.56,
        "end": 632.56
    },
    {
        "text": " en conjunto de 1 hasta N, eso lo vamos a hacer, lo hicimos a ver,",
        "start": 633.56,
        "end": 637.56
    },
    {
        "text": " lo vamos a hacer a lo largo de todo el curso, no es perdemos nada en realidad,",
        "start": 637.56,
        "end": 642.56
    },
    {
        "text": " pues si eso después realmente se puede tener otro lado,",
        "start": 642.56,
        "end": 645.56
    },
    {
        "text": " si lo necesito en una aplicación, no estoy haciendo un uso concreto en el algoritmo,",
        "start": 645.56,
        "end": 650.56
    },
    {
        "text": " son otro lado podrían tener, bueno, un mapeo de quién es uno,",
        "start": 650.56,
        "end": 654.56
    },
    {
        "text": " quién es dos, quién es tres, quién es cuatro,",
        "start": 654.56,
        "end": 656.56
    },
    {
        "text": " también tener datos de las personas de los hospitales de lo que fuera,",
        "start": 656.56,
        "end": 659.56
    },
    {
        "text": " y a los efectos de hacer el emparejamiento,",
        "start": 660.56,
        "end": 663.56
    },
    {
        "text": " o lo que fuera que está haciendo en ese momento,",
        "start": 663.56,
        "end": 665.56
    },
    {
        "text": " bueno, para mí son simplemente naturales del uno de un lado y de los...",
        "start": 665.56,
        "end": 670.56
    },
    {
        "text": " eso tiene una ventaja enorme que me permite, por ejemplo, indexar en arreglos,",
        "start": 670.56,
        "end": 676.56
    },
    {
        "text": " con matrices, con la particular estructuras de datos, con esos números naturales.",
        "start": 676.56,
        "end": 682.56
    },
    {
        "text": " Quizá lo que de hecho se usa en esta implementación, por ejemplo,",
        "start": 682.56,
        "end": 686.56
    },
    {
        "text": " en la casa de fines, bueno, la estructura manpref,",
        "start": 686.56,
        "end": 689.56
    },
    {
        "text": " es una regla donde entre con m, que principios es un nombre, un conjunto de m,",
        "start": 689.56,
        "end": 695.56
    },
    {
        "text": " un elemento con junto de m, y un i, que es un i,",
        "start": 695.56,
        "end": 700.56
    },
    {
        "text": " y está bien, es un entero el m, también para nosotros va a ser un entero también,",
        "start": 700.56,
        "end": 704.56
    },
    {
        "text": " y esto nos permite indexar en matrices, etcétera.",
        "start": 704.56,
        "end": 709.56
    },
    {
        "text": " No tengo alguien que está levantando la mano o Rafael,",
        "start": 709.56,
        "end": 713.56
    },
    {
        "text": " ¿sí que dais una pregunta?",
        "start": 713.56,
        "end": 715.56
    },
    {
        "text": " Hola, sí, justo de esa parte, ¿viste que tenés el manpref y tenés el bumampref?",
        "start": 715.56,
        "end": 721.56
    },
    {
        "text": " Sí, sí, tenés ni bien, pero el bumampref,",
        "start": 721.56,
        "end": 727.56
    },
    {
        "text": " en realidad solo lo queréis para armar los rankings después,",
        "start": 727.56,
        "end": 732.56
    },
    {
        "text": " o sea, ¿no tiene ningún uso dentro de la implementación que te da un libro o...?",
        "start": 732.56,
        "end": 737.56
    },
    {
        "text": " Ah, a ver, no me acuerdo de memoria ahora.",
        "start": 738.56,
        "end": 742.56
    },
    {
        "text": " Sí, definitiva, el algoritmo o lo que tenés que ser capaz desde el lado de los WB",
        "start": 748.56,
        "end": 756.56
    },
    {
        "text": " es decidir si prefiera uno o a otro,",
        "start": 756.56,
        "end": 761.56
    },
    {
        "text": " así que perfectamente podría ser con la otra estructura auxiliar que se construye después,",
        "start": 761.56,
        "end": 766.56
    },
    {
        "text": " que para saber el ranking.",
        "start": 767.56,
        "end": 769.56
    },
    {
        "text": " Pero bueno, pero esto es algo también que se describen en libro.",
        "start": 769.56,
        "end": 776.56
    },
    {
        "text": " Estas son las manpref y las un impref, serían entre las naturales si queréis el problema.",
        "start": 776.56,
        "end": 782.56
    },
    {
        "text": " Esa es otra tema que a veces genera un poco de duda.",
        "start": 782.56,
        "end": 788.56
    },
    {
        "text": " Muchas veces las entradas a nuestro algoritmo están descrita,",
        "start": 788.56,
        "end": 794.56
    },
    {
        "text": " también en alto nivel, sin especificar una estructura de datos como que se usaría para representar.",
        "start": 795.56,
        "end": 801.56
    },
    {
        "text": " Por ejemplo, acá decimos, bueno, cada WB tiene una lista de preferencias sobre los M y cada M,",
        "start": 801.56,
        "end": 807.56
    },
    {
        "text": " no hay que estar en ese sota.",
        "start": 807.56,
        "end": 810.56
    },
    {
        "text": " No está dicho que eso, que es una reglo de lista,",
        "start": 810.56,
        "end": 814.56
    },
    {
        "text": " como está una matriz, como está definida eso.",
        "start": 814.56,
        "end": 818.56
    },
    {
        "text": " Bueno, muchas veces la gente se llama que se llama,",
        "start": 819.56,
        "end": 821.56
    },
    {
        "text": " yo asumo que o bueno, o define que las entradas están presentadas de esta manera.",
        "start": 821.56,
        "end": 829.56
    },
    {
        "text": " En este caso, se llama las preferencias de los M, están dadas por esta matriz,",
        "start": 829.56,
        "end": 833.56
    },
    {
        "text": " las preferencias de los WB, con esto nos le sirven,",
        "start": 833.56,
        "end": 836.56
    },
    {
        "text": " la descripción bastante natural podrían pensar en otras.",
        "start": 836.56,
        "end": 839.56
    },
    {
        "text": " Y muchas veces la entrada más natural de los algoritmos,",
        "start": 839.56,
        "end": 846.56
    },
    {
        "text": " no es la que después nos termina siendo útil después desde el punto de vista de implementación de las algoritmos.",
        "start": 847.56,
        "end": 854.56
    },
    {
        "text": " Entonces, como ocurre acá, uno termina siendo un preprocesamiento de esos datos para sebar los de un formato natural,",
        "start": 854.56,
        "end": 861.56
    },
    {
        "text": " de entrada, uno de las perarias, recibir los datos,",
        "start": 861.56,
        "end": 864.56
    },
    {
        "text": " a otra tipo de representación que no sea más práctico a la hora de implementar la algoritmo.",
        "start": 864.56,
        "end": 872.56
    },
    {
        "text": " Entonces, bueno, esto tiene que ver con, sería un poco raro decir,",
        "start": 873.56,
        "end": 876.56
    },
    {
        "text": " bueno, las preferencias de los M, las recibo de esta manera y las preferencias de la WB,",
        "start": 876.56,
        "end": 881.56
    },
    {
        "text": " las recibo un ranking que está que está abuelto.",
        "start": 881.56,
        "end": 884.56
    },
    {
        "text": " Bueno, no, recibo las entradas de una forma natural para el problema,",
        "start": 884.56,
        "end": 889.56
    },
    {
        "text": " en todo caso las transformos a lo que a mí me resulta práctico en el autorito.",
        "start": 889.56,
        "end": 896.56
    },
    {
        "text": " No es el caso del problema de esta idea de que les apliquen particular,",
        "start": 897.56,
        "end": 901.56
    },
    {
        "text": " pero a veces esa transformación de una representación a otra podría implicar un tiempo que no es menos.",
        "start": 901.56,
        "end": 909.56
    },
    {
        "text": " Hay que tenerlo en cuenta del análisis.",
        "start": 909.56,
        "end": 912.56
    },
    {
        "text": " Y entonces podríamos terminar con una, por ejemplo,",
        "start": 913.56,
        "end": 917.56
    },
    {
        "text": " imaginate que nos va a emser, va a producir la entrada natural de los problemas,",
        "start": 917.56,
        "end": 924.56
    },
    {
        "text": " los son un formato que me permite, no sé, prestarme el orín en el tiempo lineal.",
        "start": 924.56,
        "end": 929.56
    },
    {
        "text": " Ese transformación me lleva tiempo cuadrado.",
        "start": 931.56,
        "end": 934.56
    },
    {
        "text": " Entonces, claro, uno podría también hacer con la ilusión de que su alaborismo,",
        "start": 939.56,
        "end": 943.56
    },
    {
        "text": " si asumiz que las entradas están dadas en ese formato particularmente útil para vos,",
        "start": 943.56,
        "end": 951.56
    },
    {
        "text": " podría hacerme algo en la ilusión de que, bueno, tengo una delogarismo que funciona en tiempo lineal,",
        "start": 952.56,
        "end": 955.56
    },
    {
        "text": " de guardar. Fueción en tiempo lineal asumiendo que las entradas son de esa forma mega rara que no es de",
        "start": 955.56,
        "end": 959.56
    },
    {
        "text": " trabajo a través de esa manera y la para el formato natural de entrada, lo que podría hacer este,",
        "start": 959.56,
        "end": 964.56
    },
    {
        "text": " o alguno similar, no, tienes que hacer el propio asumente, te se va a ir a tiempo cuadrado.",
        "start": 964.56,
        "end": 970.56
    },
    {
        "text": " Entonces, es un poco eso. No sé si era esa la duda.",
        "start": 971.56,
        "end": 976.56
    },
    {
        "text": " Si, si era eso. O sea, en principio, como las entradas, mientras algo así es razonable,",
        "start": 977.56,
        "end": 984.56
    },
    {
        "text": " una matriz, una reglo de listas, etc.",
        "start": 984.56,
        "end": 988.56
    },
    {
        "text": " Exacto, lo que hayamos.",
        "start": 988.56,
        "end": 990.56
    },
    {
        "text": " Sí, sí.",
        "start": 990.56,
        "end": 991.56
    },
    {
        "text": " Salvo que es prísitamente, si te diría, mira, esto está presentado de tal forma.",
        "start": 991.56,
        "end": 995.56
    },
    {
        "text": " Van a ver que, además, para determinadas estructuras,",
        "start": 996.56,
        "end": 1000.56
    },
    {
        "text": " las restricciones matemátivas, vamos a trabajar mucho donde terminan las representaciones y, en general, vamos a asumir que están presentados de esa manera.",
        "start": 1000.56,
        "end": 1010.56
    },
    {
        "text": " Por ejemplo, con grafos, y lo vamos a estudiar después.",
        "start": 1010.56,
        "end": 1014.56
    },
    {
        "text": " Hay varios tipos de representaciones que uno podría pensar, algunas tienen, permiten resolveras de más operaciones de una más",
        "start": 1014.56,
        "end": 1022.56
    },
    {
        "text": " edificiente y otras otras, pero en general, la que camine es una representación, la más sobre edad, lo sabemos como se estudiar,",
        "start": 1022.56,
        "end": 1028.56
    },
    {
        "text": " una representación que camina bien es la vez, una representación polita de esasencia,",
        "start": 1028.56,
        "end": 1034.56
    },
    {
        "text": " y en general, vamos a sumir que los grafos vienen representados de esa manera.",
        "start": 1034.56,
        "end": 1039.56
    },
    {
        "text": " Son todas cosas que yo sé que al principio cuesta, uno se siente que está en algo con un poco definido, con mucho grado de libertad,",
        "start": 1040.56,
        "end": 1055.56
    },
    {
        "text": " con para presentar las cosas, pero va a ver que se va acostumbrando y eso tendría que fluir bien.",
        "start": 1055.56,
        "end": 1062.56
    },
    {
        "text": " Les comenté esto, de guinir bien las estructuras de datos, esto de los conjuntos de cosas, muchas veces para nosotros van a ser conjuntos de naturales,",
        "start": 1063.56,
        "end": 1080.56
    },
    {
        "text": " en un rango de unos hasta N, de uno hasta lo que fuera, porque eso nos permite trabajar con estructuras de datos de forma muy práctica y como les decía hoy, nos perdemos nada de generalidad con eso.",
        "start": 1081.56,
        "end": 1094.56
    },
    {
        "text": " Con las estructuras de datos que uno utilice, marque acá un par de cosas para hacer es fácil, sobre algo general.",
        "start": 1095.56,
        "end": 1108.56
    },
    {
        "text": " Si ustedes vienen, miran el análisis, casi el libro acá sobre este algoritmo,",
        "start": 1108.56,
        "end": 1115.56
    },
    {
        "text": " dice bueno, para estar el paso, necesito tal estructura, para que nos proponemos que cada iteración del cual se en tiempo o de uno.",
        "start": 1116.56,
        "end": 1132.56
    },
    {
        "text": " Si yo quiero eso, tal paso, necesitaría, por ejemplo, tal estructura, para tal otro paso, necesitaría tal otra estructura.",
        "start": 1133.56,
        "end": 1139.56
    },
    {
        "text": " Por ejemplo acá dice, necesitamos identificar a la mocaga, mejor que elificada, a la que aún no sea propuesta.",
        "start": 1139.56,
        "end": 1148.56
    },
    {
        "text": " Y si vamos a usar un arreglo Next, que me dice NextDM, me dice quién es el siguiente, a lo que lo voy a proponer.",
        "start": 1149.56,
        "end": 1160.56
    },
    {
        "text": " Entonces, mucho ojo con eso, porque eso estoy mirando ahora el paso, tengo un M y quiero que me digas,",
        "start": 1160.56,
        "end": 1171.56
    },
    {
        "text": " y necesito saber en tiempo constante, o costado por una bastante para hacer más preciso.",
        "start": 1172.56,
        "end": 1176.56
    },
    {
        "text": " ¿Quién es, aquí le voy a hacer la siguiente propuesta?",
        "start": 1176.56,
        "end": 1180.56
    },
    {
        "text": " Entonces, yo voy a ver, si tengo este arreglo Next, está tema seducionado o de uno.",
        "start": 1180.56,
        "end": 1186.56
    },
    {
        "text": " Mucho ojo cuando ustedes dicen bueno, usar esta estructura para resolver esto, porque es esta estructura y que inicializarla y mantenerla.",
        "start": 1186.56,
        "end": 1195.56
    },
    {
        "text": " Para que en el paso, en que yo necesito saber qué más hacer la siguiente propuesta, ese Next, efectivamente me sirve para algo,",
        "start": 1196.56,
        "end": 1205.56
    },
    {
        "text": " lo tengo que mantener actualizado lo largo de toda la ejecución del algoritmo.",
        "start": 1205.56,
        "end": 1210.56
    },
    {
        "text": " Entonces, a veces usted puede decir, bueno, para esto uso tal estructura y después hay un loop que sigue haciendo cosas,",
        "start": 1210.56,
        "end": 1218.56
    },
    {
        "text": " esa estructura podría necesitarse actualizada y esa actualización implica tiempo y hay que analizarlo.",
        "start": 1218.56,
        "end": 1225.56
    },
    {
        "text": " Ya no quedarnos en el paso en que la estructura me sirve y perder de vista los pasos donde mantener la estructura, pues es una carga en vez de una sure.",
        "start": 1225.56,
        "end": 1236.56
    },
    {
        "text": " Entonces, hay que ver siempre el panorama completo.",
        "start": 1236.56,
        "end": 1243.56
    },
    {
        "text": " En este caso, con el ejemplo de esta estructura, este Next se inicializa en uno y después la actualización es sencilla,",
        "start": 1244.56,
        "end": 1252.56
    },
    {
        "text": " porque bueno, simplemente cada vez que se hace una propuesta un cierto M, incrementamos en uno el elemento M.",
        "start": 1252.56,
        "end": 1259.56
    },
    {
        "text": " Pero como usted se hace nada a la análisis de un algoritmo, esta cosa se queda en la encuerta y explica cómo está hecho acá.",
        "start": 1259.56,
        "end": 1266.56
    },
    {
        "text": " Se entiende si alguien más tiene alguna consulta adelante.",
        "start": 1267.56,
        "end": 1274.56
    },
    {
        "text": " Y si tiene algún comentario más.",
        "start": 1279.56,
        "end": 1283.56
    },
    {
        "text": " Si nada, simplemente para hacerles notar una técnica que también se usa bastante,",
        "start": 1284.56,
        "end": 1305.56
    },
    {
        "text": " que está bastante emparentada con esto de que vimos la otra vez de ver una medida de avance para ver con el domino termino acá,",
        "start": 1306.56,
        "end": 1313.56
    },
    {
        "text": " para realizar este especie de merge sort, que no va a ser una mezcla de, esto es parte de una de las dos más.",
        "start": 1313.56,
        "end": 1324.56
    },
    {
        "text": " La mezcla de dos listas ordenada.",
        "start": 1324.56,
        "end": 1328.56
    },
    {
        "text": " El ejemplo es su volto en programación 2, ahora han hecho cosas del estilo.",
        "start": 1329.56,
        "end": 1334.56
    },
    {
        "text": " Y lo que hacen es, bueno, tiene estas dos listas ordenadas y lo van haciendo es,",
        "start": 1334.56,
        "end": 1338.56
    },
    {
        "text": " tiene un puntero a cuál es el elemento frontal en cada lado de la subí y el resujota.",
        "start": 1338.56,
        "end": 1345.56
    },
    {
        "text": " Y en cada paso, compare aquí en estos dos es menor.",
        "start": 1345.56,
        "end": 1348.56
    },
    {
        "text": " Claro que no estoy vivo, como dijimos, la pasada marcando bien esto.",
        "start": 1348.56,
        "end": 1352.56
    },
    {
        "text": " El asubí con el puntero del mábito.",
        "start": 1353.56,
        "end": 1355.56
    },
    {
        "text": " El asubí es menor que el resujota mando el asubí para la lista mezcla, sino más del resujota.",
        "start": 1355.56,
        "end": 1364.56
    },
    {
        "text": " Entonces, aceran análisis de este tipo de situaciones donde, de repente, el asubí permanece ahí en el frente por mucho tiempo,",
        "start": 1364.56,
        "end": 1373.56
    },
    {
        "text": " por varias instalaciones y siempre van los V, o al revés.",
        "start": 1373.56,
        "end": 1379.56
    },
    {
        "text": " Entonces, esto es un poco más sutil de analizar que algo donde simplemente recorro la reglo A,",
        "start": 1379.56,
        "end": 1386.56
    },
    {
        "text": " después recorro la reglo.",
        "start": 1386.56,
        "end": 1388.56
    },
    {
        "text": " Cuando recorro la reglo A, paso por cada elemento unas horas.",
        "start": 1388.56,
        "end": 1391.56
    },
    {
        "text": " Entonces, cada una de esas visitas me llevaba una, un total o de N.",
        "start": 1391.56,
        "end": 1396.56
    },
    {
        "text": " Lo mismo con V, tengo dos N, visitas de elementos, ya está, esto es ODN.",
        "start": 1396.56,
        "end": 1405.56
    },
    {
        "text": " Acá eso es diferente, porque como les decía hoy, el asubí que está acá en el frente, de repente lo comparo,",
        "start": 1406.56,
        "end": 1413.56
    },
    {
        "text": " no, una vez sino cinco veces. Es más, podría ser que todos los de A fueron menores que los de eventos,",
        "start": 1413.56,
        "end": 1418.56
    },
    {
        "text": " no han revistado, los A fueron más sueles que los de eventos, es el asubí, que en el frente de la V,",
        "start": 1418.56,
        "end": 1424.56
    },
    {
        "text": " y lo comparo N, V, con cada uno de todos estos, y recién después arranco a despacharlo, ¿sab?",
        "start": 1424.56,
        "end": 1432.56
    },
    {
        "text": " Entonces, si me puedo me saber, V, esto se me complica porque un elemento de A,",
        "start": 1433.56,
        "end": 1439.56
    },
    {
        "text": " lo puede haber comparado muchas veces y cada una de esas operaciones, me llevaba ODN,",
        "start": 1439.56,
        "end": 1444.56
    },
    {
        "text": " podría ser esto más que N.",
        "start": 1444.56,
        "end": 1446.56
    },
    {
        "text": " Entonces, una de las formas de atacar ese tipo de problemas es decir, bueno,",
        "start": 1446.56,
        "end": 1450.56
    },
    {
        "text": " no importa, yo compara un elemento un lado y un elemento del otro.",
        "start": 1450.56,
        "end": 1454.56
    },
    {
        "text": " Se ha volsido al resultado, alguno de ellos lo voy a despachar para la lista mezcla.",
        "start": 1454.56,
        "end": 1460.56
    },
    {
        "text": " O sea que si yo vino el total de elementos que todavía no despaché hacia la lista mezclada,",
        "start": 1460.56,
        "end": 1469.56
    },
    {
        "text": " eso siempre va disminuyendo en uno.",
        "start": 1469.56,
        "end": 1472.56
    },
    {
        "text": " Y bueno, cada uno de esas, cada uno de las pasos lo tengo que hacer,",
        "start": 1472.56,
        "end": 1476.56
    },
    {
        "text": " que es comparado los elementos y a uno de ellos, sin ser tan lista mezclada,",
        "start": 1476.56,
        "end": 1481.56
    },
    {
        "text": " eso me llevaba ODN también.",
        "start": 1481.56,
        "end": 1483.56
    },
    {
        "text": " Entonces, el tiempo total va a ser, digo, la cantidad de iteración,",
        "start": 1484.56,
        "end": 1488.56
    },
    {
        "text": " va a ser no más de 2N.",
        "start": 1488.56,
        "end": 1490.56
    },
    {
        "text": " No sé en qué ordeno es que vas a hacer primero las de A y después la de B,",
        "start": 1490.56,
        "end": 1493.56
    },
    {
        "text": " va a ir alternando, pero sí, no va a ser más 2N, que es el total que tiene entre las dos listas.",
        "start": 1493.56,
        "end": 1498.56
    },
    {
        "text": " Eso es lo que acá le llama una esquema de contabilidad.",
        "start": 1498.56,
        "end": 1501.56
    },
    {
        "text": " Si incumptarle cada una de estas comparaciones y agregados a la lista mezclada,",
        "start": 1501.56,
        "end": 1509.56
    },
    {
        "text": " a un elemento de los datos de entrada y ver que eso va siempre marchando por lo menos uno por iteración.",
        "start": 1509.56,
        "end": 1517.56
    },
    {
        "text": " Eso, no sé, puede haber que les quedo claro,",
        "start": 1519.56,
        "end": 1523.56
    },
    {
        "text": " si alguien tiene alguna de dos respecto a esto también, me avisa.",
        "start": 1523.56,
        "end": 1528.56
    },
    {
        "text": " Yo supongo que en pronunciación 2, o sea,",
        "start": 1529.56,
        "end": 1539.56
    },
    {
        "text": " todo en la vera, ha visto la noción de O grande, la noción de O mega y la noción de,",
        "start": 1539.56,
        "end": 1546.56
    },
    {
        "text": " digo, la notación O mega y la notación Z, supongo que no, o me imagino que no.",
        "start": 1546.56,
        "end": 1554.56
    },
    {
        "text": " Si alguien tiene alguna duda con respecto a eso, o me gusta,",
        "start": 1555.56,
        "end": 1561.56
    },
    {
        "text": " o me gusta lo vamos a usar, y después de ahora cuando veamos el ejemplo que tengo pensado de trabajar,",
        "start": 1561.56,
        "end": 1566.56
    },
    {
        "text": " van a aparecer los dos tipos de los casos.",
        "start": 1566.56,
        "end": 1573.56
    },
    {
        "text": " ¿No te escute?",
        "start": 1573.56,
        "end": 1580.56
    },
    {
        "text": " No, no te escute, el peor de los casos.",
        "start": 1580.56,
        "end": 1584.56
    },
    {
        "text": " Siempre, sí, generalmente vamos a hacer análisis de peor caso, tanto por el lado, o sea,",
        "start": 1584.56,
        "end": 1591.56
    },
    {
        "text": " la func... Porque en definitivo la notación está sintológica tanto O como mega, etcétera,",
        "start": 1591.56,
        "end": 1599.56
    },
    {
        "text": " es, explica, a funciones.",
        "start": 1599.56,
        "end": 1601.56
    },
    {
        "text": " Yo hay otros contextos que no son de análisis de algoritmo, capaz de esas funciones,",
        "start": 1601.56,
        "end": 1606.56
    },
    {
        "text": " cuando son tiempo o consumo de memoria, que es lo que, o requerimientos de memoria,",
        "start": 1606.56,
        "end": 1613.56
    },
    {
        "text": " que lo solemos hacermos, o sea, puede ser otras cosas.",
        "start": 1613.56,
        "end": 1618.56
    },
    {
        "text": " Cuando nos usamos, la función tiempo de ejecución, en general lo que vamos a analizar es el tiempo de peor caso,",
        "start": 1618.56,
        "end": 1629.56
    },
    {
        "text": " o sea, el máximo de todas las instancias posibles de tamaño N, donde bueno N es alguna en medida de tamaño del problema",
        "start": 1629.56,
        "end": 1638.56
    },
    {
        "text": " que también es todo un tema como decidir, ahora me he visto que es una discusión sobre eso,",
        "start": 1638.56,
        "end": 1644.56
    },
    {
        "text": " también, para todas las instancias de tamaño N, el máximo del tiempo de ejecución de memoria o cuándo puede ser.",
        "start": 1644.56,
        "end": 1655.56
    },
    {
        "text": " Y esa es la función que analizamos, es decir, el peor tiempo.",
        "start": 1655.56,
        "end": 1658.56
    },
    {
        "text": " Y eso lo podemos analizar desde un punto de vista de una cota superior, y ahí usamos la notación o grande,",
        "start": 1658.56,
        "end": 1666.56
    },
    {
        "text": " o desde el punto de vista de una cota inferior, y ahí usamos la notación o mega.",
        "start": 1666.56,
        "end": 1673.56
    },
    {
        "text": " Entonces, o megas para denotar una cota inferior al peor tiempo de ejecución.",
        "start": 1673.56,
        "end": 1680.56
    },
    {
        "text": " Y hoy es una cota superior para el peor tiempo de ejecución.",
        "start": 1681.56,
        "end": 1685.56
    },
    {
        "text": " O sea, podría haber instancias particulares donde de repente, para un problema de tamaño N, donde de repente el tiempo de distribución es o de uno,",
        "start": 1685.56,
        "end": 1694.56
    },
    {
        "text": " o sea, con miro el primer elemento es 0, se acabó.",
        "start": 1694.56,
        "end": 1699.56
    },
    {
        "text": " Pero lo que miramos es, de todas las posibles centras de tamaño N, cuáles la que me sea más tiempo, y esa es la que quiero acotar superiormente y acotar también inferiormente.",
        "start": 1699.56,
        "end": 1709.56
    },
    {
        "text": " Una con gran dio trébano, y cuando las cotas superiores y inferiores, asintúndicamente coinciden,",
        "start": 1710.56,
        "end": 1719.56
    },
    {
        "text": " entonces ahí usamos la notación theta para decir que nuestra función, la podemos hacer un sanguche entre dos funciones que son del mismo ordenas sintóticos, por ejemplo, es eso, cuadrático.",
        "start": 1719.56,
        "end": 1736.56
    },
    {
        "text": " ¿Pero fue el clon? Sí, decidimos.",
        "start": 1737.56,
        "end": 1740.56
    },
    {
        "text": " Viste que, o sea, libre explica como que si tengo con LES, ON, Y es Omega N, entonces theta N, y lo estoy apretando como que el algoritmo siempre va a tomar un tiempo que es, bueno, alinear en el enriqueco, ¿no?",
        "start": 1740.56,
        "end": 1760.56
    },
    {
        "text": " Pero no podría pasarnos, yo tengo un algoritmo que es ON y Omega N, pero entre medio de esas dos cotas asuntóticas, ya ya otra función como que lo apreste más diamos.",
        "start": 1761.56,
        "end": 1776.56
    },
    {
        "text": " Que sea para algunas constantes, sea más chica que...",
        "start": 1777.56,
        "end": 1782.56
    },
    {
        "text": " O sea, ¿por qué es cuotando superiormente y inferiormente te dice, ¿táe ese tiempo que va a demorar? ¿Sí?",
        "start": 1782.56,
        "end": 1790.56
    },
    {
        "text": " ¿Cómo sabes que no hay algo más entre medio y a metido?",
        "start": 1790.56,
        "end": 1793.56
    },
    {
        "text": " Sí, puedo ver algo más entre medio y a metido, pero de menor orden, es decir, o si hilaras más fino, nivel de cuál es la constante que multiplica, pero como nosotros estamos presindiéndose de hilar tan fino,",
        "start": 1794.56,
        "end": 1812.56
    },
    {
        "text": " porque no tiene sentido en punto de vista de análisis de algoritmos en general y no de una implementación concreta.",
        "start": 1813.56,
        "end": 1821.56
    },
    {
        "text": " Y como nosotros no hablamos de cuál es la constante que multiplica.",
        "start": 1821.56,
        "end": 1826.56
    },
    {
        "text": " No, si yo te dijera, el tiempo de distribución está cortado superiormente por 5N y inferiormente por 2N, ¿táe bueno?",
        "start": 1827.56,
        "end": 1840.56
    },
    {
        "text": " Ahí sí, que es para que me decían, bueno, en realidad podría ir mar fino y a contarla por 3N y 2N.",
        "start": 1840.56,
        "end": 1849.56
    },
    {
        "text": " Pero como estamos presindiéndose de esa constante en una forma de que os encuentres algo en el medio más ajustado que N y N.",
        "start": 1850.56,
        "end": 1856.56
    },
    {
        "text": " Salvo por las constantes, la función que oficia de cuota inferior y la que actúa como cuota superior son la misma, ¿no se no puedes demontar nada del medio?",
        "start": 1856.56,
        "end": 1867.56
    },
    {
        "text": " ¿Ves?",
        "start": 1868.56,
        "end": 1869.56
    },
    {
        "text": " Ya con o N, pudo ser como un orden de las funciones, ¿díamos un orden total de todo el función estiremos, ¿no van a formar un orden total?",
        "start": 1869.56,
        "end": 1881.56
    },
    {
        "text": " No, no, no, no.",
        "start": 1882.56,
        "end": 1885.56
    },
    {
        "text": " A ver cuál sería el orden.",
        "start": 1894.56,
        "end": 1899.56
    },
    {
        "text": " Sí, está, yo puedo comparar funciones entre sí, pero después se funcione que no van a estar relacionadas.",
        "start": 1899.56,
        "end": 1908.56
    },
    {
        "text": " Ninguna de las dos va a ser un ahorro de la otra que pasa.",
        "start": 1908.56,
        "end": 1911.56
    },
    {
        "text": " Claro de eso, porque por ejemplo, ¿qué funciones podrían no solo comparar el es entre sí?",
        "start": 1915.56,
        "end": 1920.56
    },
    {
        "text": " Vamos a ver, déjame empezar.",
        "start": 1921.56,
        "end": 1923.56
    },
    {
        "text": " Si vos tenés este, por ejemplo, ¿vale?",
        "start": 1932.56,
        "end": 1940.56
    },
    {
        "text": " Funciones.",
        "start": 1941.56,
        "end": 1942.56
    },
    {
        "text": " Déjame, sí, te le voy a pensar ahora y después te contesto más tarde.",
        "start": 1950.56,
        "end": 1957.56
    },
    {
        "text": " Está por ahora, no me vean ningún ejemplo a la mente y no quiero que darme,",
        "start": 1958.56,
        "end": 1962.56
    },
    {
        "text": " pensando con ustedes.",
        "start": 1962.56,
        "end": 1964.56
    },
    {
        "text": " Está así, dejame empezar un poco y dejame empezar un poco la respuesta y te contesto.",
        "start": 1964.56,
        "end": 1973.56
    },
    {
        "text": " Ok, gracias.",
        "start": 1974.56,
        "end": 1975.56
    },
    {
        "text": " Hay una pregunta más sobre esto.",
        "start": 1983.56,
        "end": 1986.56
    },
    {
        "text": " Les quiero comentar y más.",
        "start": 1995.56,
        "end": 1997.56
    },
    {
        "text": " Bueno, creo que no me he dienos nada más con para saltarles acá.",
        "start": 2018.56,
        "end": 2022.56
    },
    {
        "text": " Bueno, vamos a hacer una cosa.",
        "start": 2024.56,
        "end": 2025.56
    },
    {
        "text": " Vamos a hacer una pausa.",
        "start": 2025.56,
        "end": 2028.56
    },
    {
        "text": " Son 9 menos 20.",
        "start": 2028.56,
        "end": 2032.56
    },
    {
        "text": " Hacemos 10 minutos de pausa, siquiera 9 menos 10 y hacemos el ejercicio,",
        "start": 2032.56,
        "end": 2037.56
    },
    {
        "text": " este que pensaba trabajar con ustedes.",
        "start": 2037.56,
        "end": 2040.56
    },
    {
        "text": " Acuerdo que se conectados acá no más,",
        "start": 2040.56,
        "end": 2042.56
    },
    {
        "text": " está que retomamos ahora en 10 minutos.",
        "start": 2042.56,
        "end": 2045.56
    },
    {
        "text": " Está luego.",
        "start": 2048.56,
        "end": 2049.56
    },
    {
        "text": " Bueno, seguimos perdona, que a una parte de la clase no quedó grabada, ¿no?",
        "start": 2054.56,
        "end": 2082.56
    },
    {
        "text": " No sé qué pasó ahí.",
        "start": 2083.56,
        "end": 2085.56
    },
    {
        "text": " Bueno, entonces, es 17, tenemos este algoritmo que hace literalmente lo que dice la netra.",
        "start": 2092.56,
        "end": 2097.56
    },
    {
        "text": " En cada, para cada hijoota, calcula la suma, vea, ya subía esta suma,",
        "start": 2097.56,
        "end": 2103.56
    },
    {
        "text": " y con eso, esa suma la guarda en el elemento que su hijo.",
        "start": 2103.56,
        "end": 2110.56
    },
    {
        "text": " Entonces, lo que nos pide el ejercicio es, en primer lugar,",
        "start": 2111.56,
        "end": 2116.56
    },
    {
        "text": " dar una función F, explicitamente,",
        "start": 2116.56,
        "end": 2123.56
    },
    {
        "text": " tal que el tiempo de ejecución, de prior caso, en realidad, en este caso,",
        "start": 2123.56,
        "end": 2131.56
    },
    {
        "text": " es en todos los casos lo mismo, de este algoritmo.",
        "start": 2131.56,
        "end": 2138.56
    },
    {
        "text": " Encontrar básicamente lo que tenemos que hacer es encontrar una función F,",
        "start": 2138.56,
        "end": 2142.56
    },
    {
        "text": " tal que el tiempo de ejecución es ODF y OmegaDF.",
        "start": 2142.56,
        "end": 2147.56
    },
    {
        "text": " Tenemos que contar cotas inferiores y superiores.",
        "start": 2147.56,
        "end": 2152.56
    },
    {
        "text": " Y nos da una sugerencia por acá que tiene que ver más bien con la protege más bien, con las cuentas.",
        "start": 2152.56,
        "end": 2161.56
    },
    {
        "text": " Entonces, está claro, después, está como parte B,",
        "start": 2162.56,
        "end": 2167.56
    },
    {
        "text": " si nos pide que diseñemos un algoritmo que sea más eficiente y bueno,",
        "start": 2167.56,
        "end": 2173.56
    },
    {
        "text": " y que lo analicemos también.",
        "start": 2173.56,
        "end": 2180.56
    },
    {
        "text": " Este era el ejemplo en respuesta a la pregunta que me hacía en el más temprano.",
        "start": 2181.56,
        "end": 2187.56
    },
    {
        "text": " Lo voy a comentar rápido el ejemplo porque no quedo grabado, creo.",
        "start": 2187.56,
        "end": 2192.56
    },
    {
        "text": " A la pregunta de si podía haber dos funciones,",
        "start": 2192.56,
        "end": 2197.56
    },
    {
        "text": " que entre sí ninguna fuera orden de la otra o gran de la otra,",
        "start": 2198.56,
        "end": 2202.56
    },
    {
        "text": " y acá lo que había hecho presentar un ejemplo TDN, que tiene esta forma,",
        "start": 2202.56,
        "end": 2206.56
    },
    {
        "text": " que va a oscilen entre N cuadrado y N,",
        "start": 2206.56,
        "end": 2210.56
    },
    {
        "text": " que con eso hayamos dicho que con esta T era ODN cuadrado y era OmegaDN,",
        "start": 2210.56,
        "end": 2215.56
    },
    {
        "text": " ahí las cotas inferiores y superiores,",
        "start": 2215.56,
        "end": 2219.56
    },
    {
        "text": " y ahí la otra es, ¿no?",
        "start": 2219.56,
        "end": 2221.56
    },
    {
        "text": " Y además, si uno mira una deprima que esté defasada en estos no unidad,",
        "start": 2221.56,
        "end": 2226.56
    },
    {
        "text": " entonces ahí pueden ver que ninguna es orden de la otra.",
        "start": 2226.56,
        "end": 2230.56
    },
    {
        "text": " Cardona esto es simplemente porque no había quedado grabado para que quedo registrado.",
        "start": 2230.56,
        "end": 2235.56
    },
    {
        "text": " Entonces, ahora sí, vamos a analizar el algoritmo de la decía,",
        "start": 2238.56,
        "end": 2242.56
    },
    {
        "text": " tenemos que analizar la protege de la otra,",
        "start": 2242.56,
        "end": 2246.56
    },
    {
        "text": " entonces ahora sí vamos a analizar el algoritmo,",
        "start": 2246.56,
        "end": 2250.56
    },
    {
        "text": " como les decía, tenemos que ver una cota superior y una cota inferior.",
        "start": 2250.56,
        "end": 2258.56
    },
    {
        "text": " Entonces, yo acá me noté algunas puntos a destacar con respecto a la cota superior.",
        "start": 2258.56,
        "end": 2268.56
    },
    {
        "text": " Déjeme, me lo tengo de abrir la letra, acá también.",
        "start": 2268.56,
        "end": 2278.56
    },
    {
        "text": " Y ahora sí, sí, sí, sí, sí, sí, sí, sí, sí, sí, sí, sí, sí, sí, sí, sí, sí, sí, sí, sí, sí, sí, sí, sí, sí, sí, sí, sí, sí, sí, sí, sí, sí, sí, sí, sí, sí, sí, sí, sí, sí, sí, sí, sí, sí, sí, sí, sí, sí, sí, sí, sí, sí, sí, sí, sí, sí, sí, sí, sí, sí, sí, sí, sí, sí, sí, sí, sí, sí, sí, sí, sí, sí, sí, sí, sí, sí, sí, sí, sí, sí, sí, sí, sí, sí, sí, sí, sí, sí, sí, sí, sí, sí, sí, sí, sí, sí, sí, sí, sí, sí, sí, sí, sí, sí, sí, sí, sí, sí, sí",
        "start": 2298.56,
        "end": 2328.56
    },
    {
        "text": " ¿Ustedes aviezan las letras de ejercicio, eh? ¿Sí, sí, sí? ¿Sí, sí? Sí. Y cómo los voy a elections?agarán, vamos, sí, sí, sí, sí, sí, sí sí, sí, sí, sí, sí, sí, sí... si tÚssez nos siguengandoускas.",
        "start": 2328.56,
        "end": 2357.56
    },
    {
        "text": " me había dado algunos puntos a destacar con respecto a este aloveno. Una es que cada",
        "start": 2357.56,
        "end": 2366.2
    },
    {
        "text": " ejecución del paso 4 requiere tiempo o de 1. El paso 4 es simplemente guardar el resultado",
        "start": 2366.2,
        "end": 2377.0
    },
    {
        "text": " de la matriz, eso claramente es de 1. Otro comentario es que cada ejecución del",
        "start": 2377.0,
        "end": 2386.28
    },
    {
        "text": " del paso 3 lo que hace es j menos y sumas. Paso 3, recuerder, era sumar las entras de asubir",
        "start": 2386.28,
        "end": 2400.44
    },
    {
        "text": " hasta a su jota. O sea que hay j menos y más un, elementos j menos y más un término, hay",
        "start": 2400.44,
        "end": 2407.7200000000003
    },
    {
        "text": " j menos y sumas. Entonces, cada ejecución del paso 3 realiza j menos y sumas, así menos",
        "start": 2407.7200000000003,
        "end": 2421.96
    },
    {
        "text": " de n sumas. Definitiva porque jota llega hasta n y arranca en 1, decir, nunca son más de n",
        "start": 2421.96,
        "end": 2432.12
    },
    {
        "text": " sumas, nunca veas sumas más de n etagos. Los ciclos, los dos forques están ahí, se",
        "start": 2432.12,
        "end": 2442.64
    },
    {
        "text": " repiten nomás de n y v es cada uno. O sea que los pasos, el bloque de paso 3 a 4 se repiten",
        "start": 2442.64,
        "end": 2452.62
    },
    {
        "text": " nomás de n cuadrado veces. Son dos foranidados que uno se ejecuta exactamente n y v es el primero",
        "start": 2452.62,
        "end": 2463.4
    },
    {
        "text": " y el otro nomás de n y v es, eso sea que en total este bloque de acá se va a ejecutar",
        "start": 2463.96,
        "end": 2471.6800000000003
    },
    {
        "text": " nomás de n y v es.",
        "start": 2471.68,
        "end": 2473.24
    },
    {
        "text": " Entonces, ¿qué pasa? Si le llamamos,",
        "start": 2489.08,
        "end": 2497.3999999999996
    },
    {
        "text": " de su 4,",
        "start": 2502.2,
        "end": 2507.24
    },
    {
        "text": " de su 3 y de su 4, de n,",
        "start": 2514.44,
        "end": 2519.2
    },
    {
        "text": " por definir los van al tiempo que insume la logarimba en la ejecución del paso 3 y en la ejecución del",
        "start": 2561.68,
        "end": 2567.8399999999997
    },
    {
        "text": " paso 4, el tiempo total a lo largo de todas las ejecuciones, que como dijimos, recién no van a ser más de n cuadrado.",
        "start": 2567.8399999999997,
        "end": 2582.8399999999997
    },
    {
        "text": " Entonces, ¿qué tenemos de las observaciones? Esta que este quisimo recién,",
        "start": 2583.84,
        "end": 2592.0
    },
    {
        "text": " tenemos que decir a y de c,",
        "start": 2598.84,
        "end": 2603.48
    },
    {
        "text": " entonces de acá sabemos que tiene su 4 de n,",
        "start": 2603.48,
        "end": 2615.56
    },
    {
        "text": " es cuánto es o de n cuadrado,",
        "start": 2619.32,
        "end": 2622.32
    },
    {
        "text": " porque puedes ejecutar nomás de n cuadrado veces, algo que me lleva tiempo cotado por nada",
        "start": 2634.48,
        "end": 2641.36
    },
    {
        "text": " bastante, así que el tiempo va a ser acotado para lo proporcional de n cuadrado. Y por otro",
        "start": 2641.36,
        "end": 2649.16
    },
    {
        "text": " parte por v y c,",
        "start": 2649.16,
        "end": 2655.36
    },
    {
        "text": " también de 3,",
        "start": 2656.36,
        "end": 2659.6400000000003
    },
    {
        "text": " n, ¿cuánto va a ser?",
        "start": 2664.44,
        "end": 2666.04
    },
    {
        "text": " O de n cuadrado,",
        "start": 2670.84,
        "end": 2672.36
    },
    {
        "text": " porque en definitiva cada vez que ejecuto el paso 3, tengo que hacernos más de n sumas,",
        "start": 2672.36,
        "end": 2683.6
    },
    {
        "text": " y eso lo voy a repetir nomás de n cuadrado veces, así que la cantidad de sumas que voy a tener",
        "start": 2685.6,
        "end": 2690.84
    },
    {
        "text": " que hacer en total no va a ser más que n cubo, cada uno de esas sumas que se van tiempo",
        "start": 2690.84,
        "end": 2697.6800000000003
    },
    {
        "text": " cotado por una constante, así que esto va a ser el tiempo o de n cubo.",
        "start": 2697.68,
        "end": 2702.24
    },
    {
        "text": " Entonces, acá, ustedes acuan a que había alguna propiedad de estas de las que estudieran",
        "start": 2706.08,
        "end": 2710.8799999999997
    },
    {
        "text": " el capítulo que dice que existen 2 bloques, en el de Orin, una que me lleva o de n cuadrado,",
        "start": 2710.8799999999997,
        "end": 2718.9199999999996
    },
    {
        "text": " otro que me sea o de n cubo, el tiempo total de esto es o de n cubo, es como que el cuello,",
        "start": 2718.92,
        "end": 2728.2400000000002
    },
    {
        "text": " a los efectos de identificar una cota superior, desde el punto de vista sintótico el cuello",
        "start": 2728.2400000000002,
        "end": 2734.32
    },
    {
        "text": " de botezas lo más relevante, si tengo varios bloques, una cantidad constante de bloques,",
        "start": 2734.32,
        "end": 2741.84
    },
    {
        "text": " que eso puede identificar en el de Orin, o que cada uno me sea un cierto tiempo, en este caso,",
        "start": 2741.84,
        "end": 2746.04
    },
    {
        "text": " tiene 6, 4, o entonces el más pesado de esos tiempos va a ser que determina el comportamiento",
        "start": 2746.04,
        "end": 2752.84
    },
    {
        "text": " sintótico del tiempo de ejecución de labor. Entonces, acá sacamos que",
        "start": 2752.84,
        "end": 2758.52
    },
    {
        "text": " 3d n más de 4d n si voy a la o de n cubo, alta algo más, con esto ya está,",
        "start": 2758.52,
        "end": 2786.6
    },
    {
        "text": " y ahí no tendrías que ver, o sea, ya sabemos que adentro el bloque, eso va a tener",
        "start": 2788.52,
        "end": 2801.08
    },
    {
        "text": " orden en n cubo y tendríamos que ver qué pasa con los 4, en ese momento, o sea, sabemos",
        "start": 2801.08,
        "end": 2806.6
    },
    {
        "text": " que ahí va a ser orden en n cubo. Bueno, exactamente, ese punto quería ir, en general,",
        "start": 2806.6,
        "end": 2814.4
    },
    {
        "text": " de una analiza este tipo de algoritmos donde los ciclos son tan elementales como esto,",
        "start": 2814.4,
        "end": 2822.0
    },
    {
        "text": " con este análisis que hicimos hasta ahora, ya está, ya está, ya está, ya está,",
        "start": 2822.0,
        "end": 2824.92
    },
    {
        "text": " muy obvio que el tiempo de ejecución de laborismo va a ser orden en n cubo, porque en",
        "start": 2824.92,
        "end": 2831.84
    },
    {
        "text": " sí lo fort no van a contribuir con nada más pesado que esto, pero si lo quisiera explicar",
        "start": 2831.84,
        "end": 2842.44
    },
    {
        "text": " todo completamente, uno acá podría agregar a nuestros comentarios, que además, además,",
        "start": 2842.44,
        "end": 2862.12
    },
    {
        "text": " una implementación de los pasos 1 y 2, no requiere más que o de uno tiempo por",
        "start": 2862.12,
        "end": 2889.6
    },
    {
        "text": " distracción. Entonces, el tiempo total, TDNes o de n cubo. ¿Por qué les comento esto? Porque,",
        "start": 2889.6,
        "end": 2909.96
    },
    {
        "text": " en este lugar es un particular, eso es bastante obvio, en general, no vamos a ir a esto que",
        "start": 2911.96,
        "end": 2918.04
    },
    {
        "text": " escribí en azul acá, no vamos, donde está nevidente, no es necesario que les escribamos",
        "start": 2918.04,
        "end": 2925.44
    },
    {
        "text": " simplemente, bueno, hicimos este contenido, pero ojo porque muchas veces en ciclos que escribamos",
        "start": 2925.44,
        "end": 2935.84
    },
    {
        "text": " en nuestras algoritmos, la evaluación de las condiciones para ese ciclo implica cosas,",
        "start": 2935.84,
        "end": 2943.0
    },
    {
        "text": " las vamos a escribir en alto nivel y implica hacer operaciones que no son tan triviales.",
        "start": 2943.0,
        "end": 2950.48
    },
    {
        "text": " Por ejemplo, el caso de el mismo de Gelsaplis, bueno, mientras exista un M libre que no se",
        "start": 2950.48,
        "end": 2958.96
    },
    {
        "text": " apropuesta a toda su mapa, ahí hay ojo, ahí hay montón de complejidad, de escondida y cada vez que",
        "start": 2958.96,
        "end": 2970.36
    },
    {
        "text": " paso con interacción o cualquier o que va a aduar la condición. Y eso puede ser o de uno o no,",
        "start": 2970.36,
        "end": 2978.7200000000003
    },
    {
        "text": " dependiendo de cómo lo implementa. En este caso es bastante obvio que es así, no muestro",
        "start": 2978.7200000000003,
        "end": 2983.6
    },
    {
        "text": " form, definitivo, lo que hay que hacer es comparar dos enteros, pasar si llegué al fin del límite,",
        "start": 2983.6,
        "end": 2991.2400000000002
    },
    {
        "text": " hay que inicializar este fin y diseño uno y hay que incrementarlo cada vez que se acaba el",
        "start": 2991.2400000000002,
        "end": 2999.0
    },
    {
        "text": " ciclo, todo eso se va a go de uno por iteración. Había alguien que había levantado la mano.",
        "start": 2999.0,
        "end": 3004.56
    },
    {
        "text": " Y yo no lo he entendido, o sea, porque los forcos no te suman al orden,",
        "start": 3005.96,
        "end": 3011.44
    },
    {
        "text": " ahí, porque poner el primer for que va de 1 hasta n, bueno, entraría cene veces a ese bloque que",
        "start": 3011.44,
        "end": 3017.68
    },
    {
        "text": " tiene orden n3, entonces no, o sea, no será lo mejor donde es.",
        "start": 3017.68,
        "end": 3025.0
    },
    {
        "text": " Diendo por qué no suma al orden, el hecho de que tengo por ahí, o sea, con que ver que el bloque es orden n3.",
        "start": 3026.96,
        "end": 3033.96
    },
    {
        "text": " Porque por que estuvo en cuenta, ¿aparecer? Sí, ya está teniendo en cuenta, a ver si lo logra explicar",
        "start": 3033.96,
        "end": 3040.0
    },
    {
        "text": " de esta manera. Cuando... No me go muy claro con mí.",
        "start": 3040.0,
        "end": 3044.92
    },
    {
        "text": " Ahora déjenme explicarlo de la manera, ahora sí, si de esta forma llegamos.",
        "start": 3044.92,
        "end": 3050.8
    },
    {
        "text": " Lo que definimos como T3, que es el tiempo que lleva la ejecución del paso 3, lo definimos como el",
        "start": 3050.8,
        "end": 3059.12
    },
    {
        "text": " tiempo total, acumulando todas las ejecuuciones del paso 3.",
        "start": 3059.12,
        "end": 3063.4
    },
    {
        "text": " Entonces, se están contempladas las n cuadrados y las del orden de n cuadrado,",
        "start": 3066.6,
        "end": 3076.3599999999997
    },
    {
        "text": " veces que se va a repetir la ejecución del paso 3.",
        "start": 3076.3599999999997,
        "end": 3078.52
    },
    {
        "text": " Entonces se va a poder decir, bueno, y sabíamos que eso es o de nq, ¿de acuerdo?",
        "start": 3080.72,
        "end": 3086.64
    },
    {
        "text": " O sea, no es que yo voy a repetir n veces algo que me lleva tiempo o de nq.",
        "start": 3087.08,
        "end": 3090.92
    },
    {
        "text": " Yo voy a repetir n cuadrado veces algo que me lleva tiempo o de n, lo cual, en total, termina con un tiempo de ficución",
        "start": 3091.92,
        "end": 3100.96
    },
    {
        "text": " que es o de nq. ¿De acuerdo? Yo lo que digo es, imagínense que borramos todo esto que está acá,",
        "start": 3100.96,
        "end": 3110.16
    },
    {
        "text": " los pasos 3 y 4 y ponemos solo dos foraniedades.",
        "start": 3110.16,
        "end": 3113.96
    },
    {
        "text": " Pero eso, aunque no hagan nada, también se va a repetir, porque la sola ejecución de las estructuras",
        "start": 3115.48,
        "end": 3121.8399999999997
    },
    {
        "text": " de control, el incrementar la variable d y incrementar la variable j, chequear si llegó hasta",
        "start": 3121.8399999999997,
        "end": 3127.8799999999997
    },
    {
        "text": " al alumbral de n para cortar el ciclo, etc. Entonces, cosas se van tiempo.",
        "start": 3127.8799999999997,
        "end": 3133.24
    },
    {
        "text": " Mismo si el cuerpo del ciclo estaba sido, eso se va tiempo.",
        "start": 3133.7599999999998,
        "end": 3139.52
    },
    {
        "text": " ¿Cuánto tiempo? Bueno, todo esto va a llevar si sacamos, si eliminamos los pasos 3 y 4,",
        "start": 3139.52,
        "end": 3144.08
    },
    {
        "text": " todo esto se varía del tiempo en este caso o de n cuadrado.",
        "start": 3144.08,
        "end": 3147.04
    },
    {
        "text": " Por ejemplo, la variable j se va a incrementar de lo orden de n cuadrado veces,",
        "start": 3148.7999999999997,
        "end": 3153.3999999999996
    },
    {
        "text": " de lo orden de n veces para cada ahí y hay y varía entre uno y n.",
        "start": 3155.0,
        "end": 3159.12
    },
    {
        "text": " Entonces lo mismo fue como analizar por separado.",
        "start": 3160.12,
        "end": 3162.92
    },
    {
        "text": " Bueno, el tiempo total entre todas las situaciones que hay de esto,",
        "start": 3162.92,
        "end": 3166.3599999999997
    },
    {
        "text": " el tiempo total entre todas las situaciones de la ejecución de esto,",
        "start": 3168.3599999999997,
        "end": 3171.68
    },
    {
        "text": " a ver que todo eso era del orden de n³ y después simplemente el argumento, bueno,",
        "start": 3171.68,
        "end": 3177.68
    },
    {
        "text": " en realidad los for, aunque estuvieran vacios también, se van tiempo, pero el tiempo que",
        "start": 3177.68,
        "end": 3182.3199999999997
    },
    {
        "text": " sea o de n cuadrado que es un orden más chico que el n³, así que definitivamente todos",
        "start": 3182.3199999999997,
        "end": 3186.64
    },
    {
        "text": " los foros del N.",
        "start": 3187.64,
        "end": 3188.64
    },
    {
        "text": " No sé si ahora quedó claro.",
        "start": 3188.64,
        "end": 3189.64
    },
    {
        "text": " A mí me quedó claro porque el paso 3,",
        "start": 3189.64,
        "end": 3196.64
    },
    {
        "text": " te ha ido a un orden, tiene orden de n, porque tiene y tirada entre oíso también.",
        "start": 3196.64,
        "end": 3204.64
    },
    {
        "text": " Exactamente, exactamente.",
        "start": 3204.64,
        "end": 3206.64
    },
    {
        "text": " ¿No?",
        "start": 3206.64,
        "end": 3207.64
    },
    {
        "text": " No, no, nada, hay una interacción de conía en la suma de la entrada.",
        "start": 3207.64,
        "end": 3212.64
    },
    {
        "text": " Exactamente y por eso también lo presente de esta manera justamente a propósito,",
        "start": 3213.64,
        "end": 3219.64
    },
    {
        "text": " porque como justamente estamos expresando nuestros algoritmos de forma,",
        "start": 3219.64,
        "end": 3224.64
    },
    {
        "text": " de forma de tan alto nivel,",
        "start": 3227.64,
        "end": 3231.64
    },
    {
        "text": " muchas veces como vimos con el sable y como está ahora en esta suma conmidad,",
        "start": 3231.64,
        "end": 3238.64
    },
    {
        "text": " hay pasos que una expresa en alto nivel que no necesariamente se traducen a operaciones",
        "start": 3239.64,
        "end": 3247.64
    },
    {
        "text": " y elementales que se realizan en tiempo de 1.",
        "start": 3247.64,
        "end": 3250.64
    },
    {
        "text": " En este caso el paso 3, así tan inocente, como parece, redesta es conmiendo un lube,",
        "start": 3250.64,
        "end": 3256.64
    },
    {
        "text": " porque yo tengo que iterar desde ahí estas jotas sumando todos los elementos desde a su día",
        "start": 3256.64,
        "end": 3261.64
    },
    {
        "text": " esta a su jota, si yo voy a implementar este en un programa.",
        "start": 3261.64,
        "end": 3264.64
    },
    {
        "text": " Si no hace falta que cuando expresamos nuestro algoritmo realmente pongamos otro lube más anidad de ahí",
        "start": 3265.64,
        "end": 3271.64
    },
    {
        "text": " y simplemente podemos, si sumamos todas las estrellas subientas su jota,",
        "start": 3271.64,
        "end": 3274.64
    },
    {
        "text": " ojo que cuando realizamos el algoritmo tenemos que tener en cuenta que eso no es una operación que se va a odieudar.",
        "start": 3274.64,
        "end": 3281.64
    },
    {
        "text": " Hay varias operaciones elementales que hay que ejecutar para implementar ese paso.",
        "start": 3285.64,
        "end": 3290.64
    },
    {
        "text": " Llevo a marcio con la mano, le mantabamos que pasen que quedó de antes.",
        "start": 3295.64,
        "end": 3299.64
    },
    {
        "text": " Bueno, así tenemos nuestra cota superior, sabemos que el algoritmo de tiempo es un función de la abril o NQ.",
        "start": 3303.64,
        "end": 3313.64
    },
    {
        "text": " Ahora la letra nos pide, no sólo eso,",
        "start": 3318.64,
        "end": 3322.64
    },
    {
        "text": " sino también encontrar una cota inferior.",
        "start": 3325.64,
        "end": 3330.64
    },
    {
        "text": " Lo que es muy claro, pero lo que nos va a tratar de demostrar es que el tiempo de ejecutión es también o mega de NQ.",
        "start": 3338.64,
        "end": 3349.64
    },
    {
        "text": " Hay una cota inferior del orden de NQ que podemos demostrar.",
        "start": 3350.64,
        "end": 3356.64
    },
    {
        "text": " A diferencia de lo que hacemos es que encontramos la cota superior, tenemos que tener en cuenta todos los pasos posibles.",
        "start": 3359.64,
        "end": 3364.64
    },
    {
        "text": " Y mostrar que ninguno de esos excede la cota superior de ODE NQ",
        "start": 3367.64,
        "end": 3373.64
    },
    {
        "text": " para mostrar una cota inferior lo que tenemos que mostrar es que alguna parte de algoritmo necesita o mega de NQ operaciones.",
        "start": 3374.64,
        "end": 3383.64
    },
    {
        "text": " No tenemos por qué ir paso con paso. Al casan con que encontramos algún punto crítico en algoritmo que diga,",
        "start": 3385.64,
        "end": 3390.64
    },
    {
        "text": " bueno, este pasito acá me va a consumir por lo menos valor en NQ operaciones.",
        "start": 3390.64,
        "end": 3396.64
    },
    {
        "text": " Para eso me anotea acá algunos puntos a destacar de vuelta que cada ejecutión del paso 3 hace j menos y subas.",
        "start": 3397.64,
        "end": 3411.64
    },
    {
        "text": " Uno sabe medio a ojo que si va a ser el paso más pesado, porque el paso 4 se va a ODE 1.",
        "start": 3411.64,
        "end": 3418.64
    },
    {
        "text": " Y esas j menos y subas se repiten para j variando entre y más 1 y N es superveneradorino, esto es para j entre y más 1 y N a ser esto.",
        "start": 3419.64,
        "end": 3432.64
    },
    {
        "text": " Y eso a su vez está dentro de otro form que se repite para ir variando de 1 hasta tiene.",
        "start": 3435.64,
        "end": 3440.64
    },
    {
        "text": " Entonces si yo mire las sumas escalares que tienen que hacer esta algoritmo, los de los va a ser para cada y y para cada j va a ser j menos y sumas y eso se repite con j variando de y más 1 hasta N y con y variando entre 1 y N.",
        "start": 3441.64,
        "end": 3469.64
    },
    {
        "text": " Entonces vamos a tratar de calcular cuántas sumas en total tiene que hacer y ver que esa cantidad de sumas es omega de NQ.",
        "start": 3470.64,
        "end": 3479.64
    },
    {
        "text": " Y con eso son las alcanza, no nos vamos a analizar nada con respecto a el control de lo 4 o si almacenar en B, nada, simplemente encontrando que 1 operación en este caso la suma.",
        "start": 3483.64,
        "end": 3497.64
    },
    {
        "text": " Ya me llevo omega de N, ¿cuál me alcanza para firmar que esa es una cota inferior? Otros pasos podrán llevar aún más, pero así que va a ser omega de N.",
        "start": 3498.64,
        "end": 3508.64
    },
    {
        "text": " Entonces como se como podríamos hacer esto y bueno vamos a llamar a que vamos con la a partir de los pasos a y B, digo de los puntos a y B que están marcado acá, podríamos denotar",
        "start": 3510.64,
        "end": 3524.64
    },
    {
        "text": " ese, ese de y, esa es la cantidad de sumas para cada valor de y.",
        "start": 3527.64,
        "end": 3548.64
    },
    {
        "text": " Entonces quién es ese de y, ese de y es la suma.",
        "start": 3549.64,
        "end": 3560.64
    },
    {
        "text": " Dejote igual y más 1 hasta N, de j, así.",
        "start": 3561.64,
        "end": 3574.64
    },
    {
        "text": " Entonces ahora fíjense lo que estoy sumando el término de este, varias desde j igual a y más 1, entonces que va en ese caso toma el valor 1, j es y más 1 menos y me queda 1.",
        "start": 3574.64,
        "end": 3603.64
    },
    {
        "text": " Vale 1, 2, 3 y 6 de la hasta, cuando j vale N, esto vale N menos y.",
        "start": 3604.64,
        "end": 3619.64
    },
    {
        "text": " Acuerdo así que esto es lo mismo que poner la suma de j igual a 1 hasta N menos y de j.",
        "start": 3620.64,
        "end": 3637.64
    },
    {
        "text": " Y eso saben que es algo cuadrático, se para cada ahí va a ser una cantidad, cuadrática de paso porque esto es N menos y por N menos y más 1,",
        "start": 3638.64,
        "end": 3659.64
    },
    {
        "text": " 2, 2.",
        "start": 3660.64,
        "end": 3664.64
    },
    {
        "text": " Entonces esa sé para cada ahí cuántas sumas voy a necesitar y podría ahora definir la suma total para un enedado, la cantidad de sumas totales.",
        "start": 3664.64,
        "end": 3687.64
    },
    {
        "text": " Eso es función de N en chica, eso que va a ser, es la suma de j igual a 1 hasta N, ¿no?",
        "start": 3695.64,
        "end": 3716.64
    },
    {
        "text": " N menos y por N menos y más 1, sobre 2.",
        "start": 3717.64,
        "end": 3730.64
    },
    {
        "text": " Queremos encontrar una cota inferior.",
        "start": 3731.64,
        "end": 3744.64
    },
    {
        "text": " Entonces, poner así bueno, esto es más 1 igual que la suma de j igual a 1 hasta N, de N menos y al cuadrado sobre 2.",
        "start": 3745.64,
        "end": 3767.64
    },
    {
        "text": " Y ahora sí, vemos cómo varía esto, esto, ¿eh?",
        "start": 3767.64,
        "end": 3791.64
    },
    {
        "text": " Que valores toma, digo para igual a 1, esto vale N menos 1, después vale N menos 2, etc. hasta para igual a N esto vale 0.",
        "start": 3798.64,
        "end": 3815.64
    },
    {
        "text": " O sea que esto es la misma que la suma y igual a 0 hasta N menos 1, vamos a ver un medio acá afuera de N y el cuadrado.",
        "start": 3816.64,
        "end": 3837.64
    },
    {
        "text": " Se entendieron, las estos son cuentas, ¿no más?",
        "start": 3838.64,
        "end": 3844.64
    },
    {
        "text": " Lo que estamos haciendo es, en definitiva es lo que hicimos es acotar inferiormente la cantidad de veces que tengo que hacer una suma y eso me da una cota inferior para el tiempo a cinturio.",
        "start": 3844.64,
        "end": 3866.64
    },
    {
        "text": " Y esto, la suma de ceras, tenemos un sumo de algo al medía cuadrado, es omega de N, ¿no?",
        "start": 3868.64,
        "end": 3879.64
    },
    {
        "text": " Esto es igual a omega de N, y eso lo tenían era una de las sugerencias de ejercicio, que no es difícil de ver.",
        "start": 3879.64,
        "end": 3894.64
    },
    {
        "text": " Esta expresión de acá, ¿no?",
        "start": 3895.64,
        "end": 3902.64
    },
    {
        "text": " Si ustedes tienen, en realidad para cualquier calo lo aplicamos para K igual a 2, pues tenemos la suma de y cuadrado pero en general la suma de I a la K, con I variando entre 0 y U y N es omega de N a la K más 1.",
        "start": 3902.64,
        "end": 3921.64
    },
    {
        "text": " Hay una forma de ver eso, es decir, bueno, por qué no es completamente obvio, eso es bueno porque los los primeros términos que sumo son chicos, no?",
        "start": 3921.64,
        "end": 3932.64
    },
    {
        "text": " Y la igual a 0, para igual a 1, pero bueno, si yo agarro y como estoy haciendo acá sumo N sobre 2 en adelante, entonces todos los términos que estoy sumando",
        "start": 3932.64,
        "end": 3950.64
    },
    {
        "text": " los sumos, la mitad de los términos es sumo N sobre 2 y todos los términos son proporcionales a N, más grandes que 1,5 N, entonces al final lo que me termina quedándes N sobre 2 a la K,",
        "start": 3951.64,
        "end": 3967.64
    },
    {
        "text": " porque todos los términos estos son mayores, que en mayores iguales a N sobre 2 y estoy sumando piso de N sobre 2 darme, entonces tengo del orden de N veces sumado un término que es del orden de N a la K,",
        "start": 3968.64,
        "end": 3989.64
    },
    {
        "text": " entonces cuando multiplico esto me queda omega de N a la K más 1, ya entendía las cuantas estas, o sea, este término de acá es más uro igual que",
        "start": 3989.64,
        "end": 4004.64
    },
    {
        "text": " que en eso es 2 minus 1, que en eso es medio incluso, entonces me queda esto multiplicado por algo que es del orden N a la K, me queda algo de N a la K más 1,",
        "start": 4005.64,
        "end": 4024.64
    },
    {
        "text": " entonces siempre que tengan una suma de ese tipo que aparece cuando empieza a lidar a ciclos de este tipo como que tenemos acá,",
        "start": 4025.64,
        "end": 4037.64
    },
    {
        "text": " así yo sumo N veces algo que es del orden, y a la K me son que te mire dando N a la K más 1, como corta inferior.",
        "start": 4037.64,
        "end": 4048.64
    },
    {
        "text": " Perfecto, ya que tengo la última parte donde pasó de la sumatoria en la humedad.",
        "start": 4048.64,
        "end": 4057.64
    },
    {
        "text": " No acá en el PDF me decís en las notas de recién.",
        "start": 4059.64,
        "end": 4063.64
    },
    {
        "text": " Sí, sí, las notas.",
        "start": 4063.64,
        "end": 4066.64
    },
    {
        "text": " ¿A qué? ¿Cuál parte?",
        "start": 4067.64,
        "end": 4071.64
    },
    {
        "text": " La última igualdad, ahí me ha perdido, no entendía qué pasó.",
        "start": 4071.64,
        "end": 4076.64
    },
    {
        "text": " Ok, la desigualdad, para la última me está hablando de ¿en dónde pasa?",
        "start": 4076.64,
        "end": 4083.64
    },
    {
        "text": " De esta o de la A.",
        "start": 4083.64,
        "end": 4086.64
    },
    {
        "text": " Sí, ahí lo estoy definiendo, simplemente, ahí está, llegué a la potemperiador.",
        "start": 4086.64,
        "end": 4091.64
    },
    {
        "text": " Por la sugerencia está que estamos viendo recién en la letra del ejercicio, ¿está?",
        "start": 4092.64,
        "end": 4100.639999999999
    },
    {
        "text": " Porque lo que tengo de este lado acá es la suma de I cuadrado, entonces por la análisis 7, que estuvo en la 16 no recién,",
        "start": 4100.639999999999,
        "end": 4107.639999999999
    },
    {
        "text": " eso me da la omega de IQ, omega de NQ, pero...",
        "start": 4107.639999999999,
        "end": 4112.639999999999
    },
    {
        "text": " Ahí va, gracias.",
        "start": 4112.639999999999,
        "end": 4115.639999999999
    },
    {
        "text": " Era esa la que tenías dudas.",
        "start": 4115.639999999999,
        "end": 4117.639999999999
    },
    {
        "text": " Sí, sí, perdón, si, gracias.",
        "start": 4117.639999999999,
        "end": 4120.639999999999
    },
    {
        "text": " ¿Pero fue una bronda?",
        "start": 4121.64,
        "end": 4122.64
    },
    {
        "text": " Sí.",
        "start": 4122.64,
        "end": 4123.64
    },
    {
        "text": " La mantriz de los resultados no te quedaría con una centrada como hacía.",
        "start": 4123.64,
        "end": 4127.64
    },
    {
        "text": " Sí, verdad.",
        "start": 4127.64,
        "end": 4129.64
    },
    {
        "text": " No se los comenté, pero en la letra del ejercicio efectivamente decía que eso valoró el importa.",
        "start": 4129.64,
        "end": 4134.64
    },
    {
        "text": " Esa no es normal porque decían algo.",
        "start": 4137.64,
        "end": 4140.64
    },
    {
        "text": " Podría ser, por ejemplo, ¿vos estuvieras construyendo esta estructura auxiliar?",
        "start": 4143.64,
        "end": 4146.64
    },
    {
        "text": " Y vos sabes que nunca vas a necesitar acceder a elementos I j con I más orquejota.",
        "start": 4146.64,
        "end": 4158.64
    },
    {
        "text": " Entonces, el resto de la matriz, o sea, vos definís la matriz cuadrada para poder después acceder en orden 1 a un elemento I j arbitrario,",
        "start": 4158.64,
        "end": 4168.64
    },
    {
        "text": " pero nunca vas a acceder a la diagonal y perió.",
        "start": 4168.64,
        "end": 4171.64
    },
    {
        "text": " Entonces, eso no lo se enla.",
        "start": 4172.64,
        "end": 4174.64
    },
    {
        "text": " Si querés, podria escenar todo con sí que os he sido.",
        "start": 4174.64,
        "end": 4177.64
    },
    {
        "text": " Y eso va a llevar el horde de n°2, o sea, que tampoco te cambiaría mucho.",
        "start": 4177.64,
        "end": 4186.64
    },
    {
        "text": " Pero sí, el horismo de esas células va a ser.",
        "start": 4186.64,
        "end": 4189.64
    },
    {
        "text": " Bueno, ¿una vez duama más de esto?",
        "start": 4194.64,
        "end": 4196.64
    },
    {
        "text": " Una consulta.",
        "start": 4196.64,
        "end": 4198.64
    },
    {
        "text": " ¿Viste con lo planteaste ese de I que tienen la suma de j I más 1 hasta n?",
        "start": 4199.64,
        "end": 4205.64
    },
    {
        "text": " Sí.",
        "start": 4205.64,
        "end": 4206.64
    },
    {
        "text": " Pero ponenle sí, Tomás, el valor igual n, que ahí es donde no se ejecutaría en cicloforo.",
        "start": 4207.64,
        "end": 4215.64
    },
    {
        "text": " No te queda mal definida esa expresión o algo.",
        "start": 4215.64,
        "end": 4219.64
    },
    {
        "text": " Para igual n, eso te queda la suma desde j, igual n más 1 hasta n, que no termino.",
        "start": 4220.64,
        "end": 4227.64
    },
    {
        "text": " Eso te queda una suma sobre un conjunto de índices vacíos que es 0, que no es lo que tengo como 0.",
        "start": 4227.64,
        "end": 4233.64
    },
    {
        "text": " La suma, la suma de la bácuadra.",
        "start": 4235.64,
        "end": 4238.64
    },
    {
        "text": " Las sumatorias en general, déjame notar por acá, con una nota el margen,",
        "start": 4238.64,
        "end": 4250.64
    },
    {
        "text": " en general la suma, el I perteneciente, un cierto conjunto de...",
        "start": 4251.64,
        "end": 4262.64
    },
    {
        "text": " Algo, déjame, esto es 0, si es vacío.",
        "start": 4262.64,
        "end": 4271.64
    },
    {
        "text": " ¿Qué es tu?",
        "start": 4275.64,
        "end": 4276.64
    },
    {
        "text": " ¿Para?",
        "start": 4276.64,
        "end": 4277.64
    },
    {
        "text": " ¿Qué me ha decidido para donde culpáis, un rato?",
        "start": 4278.64,
        "end": 4283.64
    },
    {
        "text": " No, no, que eso es en general, así, cuando la convención, la sumatoria sobre un conjunto vacío,",
        "start": 4283.64,
        "end": 4292.64
    },
    {
        "text": " no tiene ningún término y eso es lo que tengo como ser.",
        "start": 4292.64,
        "end": 4296.64
    },
    {
        "text": " La misma forma que la productoria sobre algo vacío es 1.",
        "start": 4296.64,
        "end": 4301.64
    },
    {
        "text": " La más tema de convención de notación que hay otra cosa.",
        "start": 4302.64,
        "end": 4307.64
    },
    {
        "text": " Es muy práctico porque no, no, no, no, no, no, no, no, no.",
        "start": 4307.64,
        "end": 4311.64
    },
    {
        "text": " Fermi que escribir, por ejemplo, cosas como escribimos ahí en SDI y que sin tener que estar contemplando,",
        "start": 4311.64,
        "end": 4321.64
    },
    {
        "text": " ese tipo de casos como situaciones aparte, con casos separados.",
        "start": 4321.64,
        "end": 4325.64
    },
    {
        "text": " Ok, gracias.",
        "start": 4326.64,
        "end": 4330.64
    },
    {
        "text": " Bien.",
        "start": 4330.64,
        "end": 4331.64
    },
    {
        "text": " Nos queda un poco minutos y nos queda una parte más para hacer.",
        "start": 4349.64,
        "end": 4353.64
    },
    {
        "text": " Que es la de diseño un algoritmo asentóticamente más eficiente y muestre que el tiempo de ejecución de algoritmo es o de GDN.",
        "start": 4356.64,
        "end": 4369.64
    },
    {
        "text": " La deciden, acá otro algoritmo, cuyo tiempo de ejecución asintótico sea o de GDN.",
        "start": 4369.64,
        "end": 4374.64
    },
    {
        "text": " Y para qué lo que significa que nuestro algoritmo sea asentóticamente más eficiente, estrictamente.",
        "start": 4374.64,
        "end": 4383.64
    },
    {
        "text": " Lo que quiere decir que esa GDN es o chica de FD.",
        "start": 4384.64,
        "end": 4386.64
    },
    {
        "text": " Esa función o chica.",
        "start": 4386.64,
        "end": 4388.64
    },
    {
        "text": " Digo esa notación o chica no está definida en el libro, pero nosotros la vamos a usar y además está bueno que la sepon porque es algo que se usa.",
        "start": 4392.64,
        "end": 4401.64
    },
    {
        "text": " Aparece, se da alguna cosa, esa es la notación o chica.",
        "start": 4401.64,
        "end": 4406.64
    },
    {
        "text": " Se usa y lo que significa es eso de ahí, el límite de GDN sobre FDN es sigo.",
        "start": 4407.64,
        "end": 4414.64
    },
    {
        "text": " Eso que quiere decir definitiva que asintóticamente F crece estrictamente más rápido que G.",
        "start": 4416.64,
        "end": 4425.64
    },
    {
        "text": " De manera que un lado el límite eso se va a hacer.",
        "start": 4425.64,
        "end": 4429.64
    },
    {
        "text": " Por ejemplo, 2.",
        "start": 4430.64,
        "end": 4433.64
    },
    {
        "text": " Si tiene cuadrado y 2.",
        "start": 4433.64,
        "end": 4435.64
    },
    {
        "text": " N cuadrado, bueno eso no es o chica.",
        "start": 4435.64,
        "end": 4439.64
    },
    {
        "text": " Si bien son distintas, pero son del mismo or, crecen cuadraticamente.",
        "start": 4439.64,
        "end": 4445.64
    },
    {
        "text": " Ahora sí hago para GDN igual a Lineal y FDN cuadratica, cuando hago ese consciente, si es el basero, ese límite.",
        "start": 4445.64,
        "end": 4457.64
    },
    {
        "text": " Ahí es una estrictamente más eficiente que un tiempo es estrictamente más eficiente que el otro.",
        "start": 4458.64,
        "end": 4463.64
    },
    {
        "text": " Ahora, como...",
        "start": 4464.64,
        "end": 4466.64
    },
    {
        "text": " ¿Cómo podríamos mejorar ese límite?",
        "start": 4479.64,
        "end": 4483.64
    },
    {
        "text": " Es bastante claro que esta parte de acá es bien redundante, ¿no?",
        "start": 4484.64,
        "end": 4492.64
    },
    {
        "text": " Pues tú lo piensas más sumo los elementos a su y a su y más uno.",
        "start": 4492.64,
        "end": 4498.64
    },
    {
        "text": " Imagínese a sumo a su uno y a su dos, después sumo en la cinta y de la cinta y de la cinta y de la cinta, su 2, su 3, su 3, su 4.",
        "start": 4498.64,
        "end": 4506.64
    },
    {
        "text": " Haciendo muchas veces la misma suma, hay hay hay operaciones redundantes y uno la podría mejorar haciendo un algoritmo con una estructura similar.",
        "start": 4507.64,
        "end": 4523.64
    },
    {
        "text": " De vuelta dos, este, 4, añoados, pero donde...",
        "start": 4524.64,
        "end": 4532.64
    },
    {
        "text": " Voy a aprovechar la suma que se tenía hecha del interaccionante, entonces lo que tendría que hacer es...",
        "start": 4533.64,
        "end": 4538.64
    },
    {
        "text": " Bueno, fue igual a uno hasta N, inicializar acá...",
        "start": 4538.64,
        "end": 4543.64
    },
    {
        "text": " V, su y, y, igual a su y...",
        "start": 4553.64,
        "end": 4558.64
    },
    {
        "text": " La, la, la centras de la diagonal tienen la suma de uso lo termino, o sea que es el valor y chao.",
        "start": 4559.64,
        "end": 4566.64
    },
    {
        "text": " Y, y después hacer, adentro del, del siguiente 4, lo que hacemos es hacer...",
        "start": 4566.64,
        "end": 4576.64
    },
    {
        "text": " V y J, igual a lo que tenía del interaccionante,",
        "start": 4576.64,
        "end": 4584.64
    },
    {
        "text": " y el anterior,",
        "start": 4584.64,
        "end": 4586.64
    },
    {
        "text": " más el nuevo termino.",
        "start": 4594.64,
        "end": 4596.64
    },
    {
        "text": " Entonces, esto calcula exactamente lo mismo, la vemos que esto termina acá,",
        "start": 4596.64,
        "end": 4604.64
    },
    {
        "text": " y esto termina acá.",
        "start": 4605.64,
        "end": 4607.64
    },
    {
        "text": " Y lo hace...",
        "start": 4608.64,
        "end": 4610.64
    },
    {
        "text": " Asintóticamente más rápido, si ustedes hacen este análisis rápido,",
        "start": 4612.64,
        "end": 4616.64
    },
    {
        "text": " bueno, ahora...",
        "start": 4616.64,
        "end": 4618.64
    },
    {
        "text": " Este paso en la suma, es una suma, o sea que esto me lleva o de 1,",
        "start": 4619.64,
        "end": 4624.64
    },
    {
        "text": " al que se da el hamacrice me lleva o de 1, hace la suma,",
        "start": 4624.64,
        "end": 4626.64
    },
    {
        "text": " hace la suma, hace la suma, hace la suma de 1,",
        "start": 4626.64,
        "end": 4629.64
    },
    {
        "text": " o sea que se da el hamacrice,",
        "start": 4629.64,
        "end": 4630.64
    },
    {
        "text": " y eso...",
        "start": 4630.64,
        "end": 4631.64
    },
    {
        "text": " ...no, esto termina acá,",
        "start": 4631.64,
        "end": 4633.64
    },
    {
        "text": " una suma de 1,",
        "start": 4633.64,
        "end": 4635.64
    },
    {
        "text": " lo hace la suma de 1,",
        "start": 4635.64,
        "end": 4636.64
    },
    {
        "text": " será el valor de la diagonal también,",
        "start": 4636.64,
        "end": 4639.64
    },
    {
        "text": " ¿me entrega uno de 1?",
        "start": 4639.64,
        "end": 4640.64
    },
    {
        "text": " Esto se ejecuta el valor de N cuadrado veces,",
        "start": 4642.64,
        "end": 4644.64
    },
    {
        "text": " así que el tiempo de discusión este lo mismo es, o de N cuadrado, ¿no?",
        "start": 4644.64,
        "end": 4649.64
    },
    {
        "text": " Así que en este caso,",
        "start": 4649.64,
        "end": 4652.64
    },
    {
        "text": " creo que no hace falta...",
        "start": 4652.64,
        "end": 4654.64
    },
    {
        "text": " es que si les vamos a tener prima DNA, al tiempo de ejecución de este logrismo,",
        "start": 4654.64,
        "end": 4659.84
    },
    {
        "text": " este prima DNA es igual a... o DNA cuadrado. ¿A cuándo?",
        "start": 4659.84,
        "end": 4665.360000000001
    },
    {
        "text": " Por otro lado,",
        "start": 4665.360000000001,
        "end": 4668.360000000001
    },
    {
        "text": " tenemos que TDN, que era el nuestro primer agrobrismo, la primera versión que estaba",
        "start": 4668.36,
        "end": 4686.96
    },
    {
        "text": " la letra es Pomega DNAQ. Y acá surge que es de prima de N sobre TDN,",
        "start": 4686.96,
        "end": 4710.88
    },
    {
        "text": " Tiene acero cuando vene tiene infinito. Fíjense que para mostrar que una aburrida es más",
        "start": 4710.88,
        "end": 4719.400000000001
    },
    {
        "text": " eficiente que otro, tengo que ver, por un lado una cota superior para el aburrismo,",
        "start": 4719.400000000001,
        "end": 4726.24
    },
    {
        "text": " yo estoy diciendo que es más eficiente y una cota inferior para el aburrido cuando",
        "start": 4726.24,
        "end": 4732.8
    },
    {
        "text": " estén comparando. En un caso tengo que usar o grande, en otro caso, o mega.",
        "start": 4732.8,
        "end": 4737.64
    },
    {
        "text": " Bueno, este no, nunca necesita más DNA cuadrado y siempre distase que necesita más",
        "start": 4737.64,
        "end": 4744.88
    },
    {
        "text": " DNAQ, entonces con todo el cociente, efectivamente eso tiende acero. No puedo hacer una",
        "start": 4744.88,
        "end": 4752.72
    },
    {
        "text": " análisis de cota superior de ambos lados, porque yo, por ejemplo, puede decir, te prima,",
        "start": 4752.72,
        "end": 4759.360000000001
    },
    {
        "text": " así como digo que es ODN, imagínense que yo hubiera hecho solo la primera parte del",
        "start": 4759.360000000001,
        "end": 4764.68
    },
    {
        "text": " ejercicio anterior y hubiera hecho, te prima TDN, el tiempo de nuestro, de nuestro",
        "start": 4764.68,
        "end": 4772.56
    },
    {
        "text": " primero aburrismo, nuestra primera versión es PodNQ. Bueno, cuando eso solo no puede decir",
        "start": 4772.56,
        "end": 4778.72
    },
    {
        "text": " que este aburrismo nuevo sea más eficiente, porque el hecho de que sea ODNQ no contradice,",
        "start": 4778.72,
        "end": 4784.240000000001
    },
    {
        "text": " no intriga necesariamente, podría ser perfectamente también ODN cuadrado, simplemente que",
        "start": 4784.240000000001,
        "end": 4788.96
    },
    {
        "text": " la paz que mi cota superior está abogada y no podría estar ajustada. Para eso me",
        "start": 4788.96,
        "end": 4794.96
    },
    {
        "text": " os trae como una vez más eficiente, efectivamente uno más eficiente que otro, tengo que mostrar",
        "start": 4794.96,
        "end": 4800.04
    },
    {
        "text": " que una cota superior para uno, una cota inferior para el otro y mostrar que la cota inferior",
        "start": 4800.04,
        "end": 4804.8
    },
    {
        "text": " es asymptoticamente más grande que la cota inferior de nosotros, ¿sí vea? Esa es la forma",
        "start": 4804.8,
        "end": 4814.04
    },
    {
        "text": " correcta de comparar a sintoticamente el tiempo de ejecución de DOZALOE. Se entendió",
        "start": 4814.04,
        "end": 4821.24
    },
    {
        "text": " hasta último. ¿Sí? O estamos ya un minuto pasado del tiempo y así vamos a dejar por",
        "start": 4821.24,
        "end": 4839.48
    },
    {
        "text": " acá. Les recuerdo por favor que y déjame recalcar esto. Aprovechan ahora para medirse",
        "start": 4839.48,
        "end": 4849.839999999999
    },
    {
        "text": " el tiempo de avance. Si ustedes ven que no están pudiendo seguir con el estudio y con",
        "start": 4849.839999999999,
        "end": 4857.599999999999
    },
    {
        "text": " la resolución de los ejercicios, de acuerdo a lo que está apautado por semana, entonces",
        "start": 4857.599999999999,
        "end": 4861.599999999999
    },
    {
        "text": " eso es una luz de alerta y reacciona en ahora porque después no es cada más difícil.",
        "start": 4861.6,
        "end": 4868.6
    },
    {
        "text": " Perdona me quinciste pero me parece seguir los ayudos. Bueno, hasta la próxima.",
        "start": 4868.6,
        "end": 4877.6
    }
]