[
    {
        "text": " Bueno, gente, arrancamos.",
        "start": 0.0,
        "end": 23.0
    },
    {
        "text": " Puse ahí en el pizarrón los avance de los otros días, bien, para sobresabase arrancar hoy.",
        "start": 24.0,
        "end": 31.0
    },
    {
        "text": " ¿Qué es lo que estábamos analizando? ¿Por dónde íbamos?",
        "start": 32.0,
        "end": 36.0
    },
    {
        "text": " Mercado de bienes y servicios, ¿por qué oferta y demanda bienes y servicios? ¿Por qué nos interesaba eso?",
        "start": 36.0,
        "end": 42.0
    },
    {
        "text": " Tres grandes problemas macro, crecimiento económico, empleo de desempleo, como un problema que engloba esos dos, e inflación.",
        "start": 42.0,
        "end": 50.0
    },
    {
        "text": " Entonces, teníamos una herramienta que era lo que denominábamos, modelo de ofertidemanda, que nos iba a servir para entender eso.",
        "start": 51.0,
        "end": 56.0
    },
    {
        "text": " ¿Cómo es que funciona una economía de esas globalidades, de la macro que se llama?",
        "start": 56.0,
        "end": 61.0
    },
    {
        "text": " Para ver qué pasa con ese PBI, con el crecimiento económico.",
        "start": 61.0,
        "end": 64.0
    },
    {
        "text": " Y esta CUC, que tenemos acá, que era los ofertas agregadas, justamente hacia el lusión a eso, el PBI, a la producción de bienes.",
        "start": 64.0,
        "end": 74.0
    },
    {
        "text": " Entonces, sabíamos arrancado por ahí, la definimos, vimos que se trata y empezamos con esta manera de representar cuáles son esos factores que determinan a una variable.",
        "start": 75.0,
        "end": 86.0
    },
    {
        "text": " En este caso, cuáles son los que denominamos los factores productivos macroconómicos que nos determina la producción de un país.",
        "start": 86.0,
        "end": 93.0
    },
    {
        "text": " Ese PBI ha agregado esa sumatoria de todos los bienes y servicios, ¿no? Soja, trigo, boletos de homie, gusto.",
        "start": 93.0,
        "end": 100.0
    },
    {
        "text": " Después que hicimos eso, vimos la relación que había con esa variable, cada una, ¿no? ¿Qué relación tiene el trabajo con la producción? ¿Qué relación tiene el capital con la producción y así con los cuatro?",
        "start": 101.0,
        "end": 113.0
    },
    {
        "text": " Y la representamos a través de esta otra, de este otro instrumento gráfico que nos muestra cómo es la relación a levulucionar la cantidad de trabajo que se emplea, que se utilicen una economía, con lo que es la producción que va a lograr esa economía.",
        "start": 113.0,
        "end": 127.0
    },
    {
        "text": " Y ahí habían aparecido dos conceptos, es la productividad y el de los rendimientos, uno asociado y en este orden, ¿no?",
        "start": 128.0,
        "end": 134.0
    },
    {
        "text": " Asociaba la derivada primera y otra la derivada segunda. Productividad que asumimos que es positiva de todos los factores productivos,",
        "start": 134.0,
        "end": 141.0
    },
    {
        "text": " o sea, cada vez que aumenta alguno de estos factores productivos, la producción va a aumentar. Eso nos decía este símbolo positivo y que estaba asociada esa relación directa que hay entre cada una de esas cuatro variables y la producción.",
        "start": 141.0,
        "end": 155.0
    },
    {
        "text": " Y a eso le llamamos productividad de los factores productivos y el concepto de rendimientos de crecientes, aseluciona esta tasa de creciente, que también nos está completando esa relación entre los factores productivos y la producción.",
        "start": 156.0,
        "end": 171.0
    },
    {
        "text": " ¿Y por qué era esto de de creciente? ¿Cuál era lo que se asumía ahí, que se aumentamos y metemos más gente a trabajar? ¿Por qué la producción cada vez va a aumentar un poco menos?",
        "start": 171.0,
        "end": 182.0
    },
    {
        "text": " Siempre aumentar, ¿no? Eso es la productividad, pero por qué cada vez aumenta menos la producción. ¿Por dónde pasaba esa elógica?",
        "start": 182.0,
        "end": 192.0
    },
    {
        "text": " Tenemos esta relación que tiene en este eje al trabajo, pero a los otros lo dejamos constantes. Si sólo aumentamos uno de los factores productivos,",
        "start": 199.0,
        "end": 207.0
    },
    {
        "text": " las posibilidades que se aumento tiene de lograr mayor producción con estos otros que estaban dados, va cayendo esa posibilidad.",
        "start": 207.0,
        "end": 215.0
    },
    {
        "text": " Y ahí aparecía este concepto de los rendimientos marginales de crecientes. Siempre más factor productivo, más producción, pero aún menos ritmo y por eso poníamos este gráfico, la derivada hace un anécadio para representarles.",
        "start": 215.0,
        "end": 230.0
    },
    {
        "text": " Después el otro paso que hicimos fue decir bueno, pero estos factores productivos hay uno y lo vinculamos con una parte de lo que habíamos trabajado la clase anterior,",
        "start": 231.0,
        "end": 240.0
    },
    {
        "text": " que era decir bueno, a nivel macro se puede mirar en largo plazo y dejar limpiar todo lo que nos afecte la cociuntura de corto plazo, o podemos focalizar en el corto plazo y ahí si miramos esos factores.",
        "start": 240.0,
        "end": 253.0
    },
    {
        "text": " Entonces, si vamos bien, vamos a mirar el trabajo porque es el que va a explicar más la evolución a corto plazo.",
        "start": 254.0,
        "end": 260.0
    },
    {
        "text": " Entonces nos metimos con este factor productivo y ahí apareció otro de los mercados que vamos a ver a lo largo de estas clases de macroeconomía, que era el mercado de trabajo.",
        "start": 260.0,
        "end": 270.0
    },
    {
        "text": " Digimos, por un lado hay quienes ofrecen esto y esto es el factor productivo, entonces la oferta que agente económico es el que dueño es ese factor productivo y por lo tanto lo ofrece.",
        "start": 270.0,
        "end": 281.0
    },
    {
        "text": " Las personas, porque hablamos del factor productivo y no del puesto de trabajo, entonces quién ofrecen trabajo, las personas.",
        "start": 283.0,
        "end": 292.0
    },
    {
        "text": " Como lo ofrecen y fue lo que justamente estuvimos discutiendo sobre el final de la clase anterior, que llegamos a ver que había una relación con una variable clave también con mirada macro,",
        "start": 292.0,
        "end": 301.0
    },
    {
        "text": " no había otras cosas, la educación, preferencia, gusto de las personas por trabajar, por ilocios, etc.",
        "start": 301.0,
        "end": 307.0
    },
    {
        "text": " Pero esta variable clave macro no se explicaba mucho de lo que hacía la gente, porque esta variable recuerden operaba como el costo o oportunidad del ocio.",
        "start": 308.0,
        "end": 316.0
    },
    {
        "text": " Si a mí me suben el salario, ante mi decisión de trabajar y cobrar ese salario, o quedarme en mi casa ocio y no cobrar ese salario, me sale más caro quearme en mi casa.",
        "start": 316.0,
        "end": 327.0
    },
    {
        "text": " Entonces ahí si bien hablábamos de un efecto sustitución, un efecto ingreso, o sea como que en la cabeza de la persona hay dos cosas que quisiera ser y son contradictorias,",
        "start": 327.0,
        "end": 336.0
    },
    {
        "text": " por un lado más salario, bueno quiero trabajar más, porque me paga más, pero por otro lado más salario me dice, mirá, ya estás consiguiendo necesidades materiales, satisfechas, bajar o ocuparte más de ocio.",
        "start": 336.0,
        "end": 347.0
    },
    {
        "text": " Entonces ante esa contradicción igual nos quedábamos con el positivo porque íbamos hacia evidencia empírica y también por esa saturación de las horas de trabajo,",
        "start": 347.0,
        "end": 355.0
    },
    {
        "text": " incluso habíamos hecho un gráfico que podíamos representar acá de esta manera como que pegaba la curva, la representación positiva solo va hasta este tramo, solo hasta acá.",
        "start": 355.0,
        "end": 369.0
    },
    {
        "text": " Esto que después pega la vuelta era más cuando empezaba a pesar más el efecto ingreso, eso de tener más salario, más horas de trabajo y por lo tanto muchas, muchos ingresos para las necesidades materiales, entonces ahí empezaba a lo otro.",
        "start": 369.0,
        "end": 384.0
    },
    {
        "text": " Y ahí cerramos, hoy vamos a retomar acá, vamos a analizar la demanda, después vamos a juntar las dos y analizar justamente el mercado de trabajo y después vamos a volver acá a ver cómo cerramos o farta agregada.",
        "start": 384.0,
        "end": 398.0
    },
    {
        "text": " Sí, ese es el plan para hoy, liquidar lo que es el capítulo 2 de la bibliografía, bien, en este orden, demanda de trabajo, luego integramos y luego venimos a la farta agregada.",
        "start": 398.0,
        "end": 411.0
    },
    {
        "text": " Bien, demanda de trabajo, dijimos que el agente económico que está acá es una empresa, las empresas, ¿no?",
        "start": 411.0,
        "end": 424.0
    },
    {
        "text": " Las empresas son las que van a salir a buscar a quedar contratar este factor productivo. Bien, ¿qué nos podemos plantear que sea el objetivo de esta empresa a la hora de salir a contratar gente? ¿Para qué quiere salir a contratar gente?",
        "start": 425.0,
        "end": 441.0
    },
    {
        "text": " ¿Por qué una empresa quiere contratar mano de obra?",
        "start": 444.0,
        "end": 447.0
    },
    {
        "text": " ¿Para producir? ¿Sí? ¿Por qué? Porque suponemos que tienen los factores productivos, pero esto no se usan solo, entonces ahí los tienen que usar, entonces quiere contratar gente para utilizando los factores productivos, producir bienes y servicios. ¿Y para qué una empresa quiere producir bienes y servicios?",
        "start": 448.0,
        "end": 469.0
    },
    {
        "text": " ¿Para vendarlos y tener ingresos? ¿Para vendarlos y tener ingresos? Entonces podríamos pensar, una empresa va a querer contratar aquella cantidad de gente que le haga, que le dé la mayor producción posible, por dónde puede pasar el objetivo de una empresa a la hora de que su empresa venda la mayor cantidad de bienes posible, que obtenga la mayor cantidad de ingresos, que facture lo máximo posible, que haga la mayor beneficiencia posible en la comandante.",
        "start": 470.0,
        "end": 498.0
    },
    {
        "text": " ¿Cuál es el objetivo que podríamos definir para una empresa? ¿Qué es lo que busca una empresa?",
        "start": 498.0,
        "end": 506.0
    },
    {
        "text": " ¿Ganar más? ¿Sí? Entonces la lógica de un empresario que nosotros vamos a plantearnos acá, que si bien estamos tratando de ver cuántos trabajadores quiere contratar demanda de trabajo, vamos a poner que esta empresa va a tener un objetivo",
        "start": 511.0,
        "end": 527.0
    },
    {
        "text": " que le vamos a llamar racional, porque vamos a tratar de formalizar como es que procura cumplir sus objetivos en la empresa y la racionalidad va a pasar por obtener los máximos beneficios.",
        "start": 528.0,
        "end": 543.0
    },
    {
        "text": " ¿Sí? O sea, el objetivo de una empresa, vamos a ponernos la maximización de beneficios.",
        "start": 545.0,
        "end": 552.0
    },
    {
        "text": " Con los hogares, con las personas sabíamos también planteado algo similar, decíamos las personas lo que quieren, a la hora de ver cuántas horas ofrecer, cuando hicimos este análisis acá,",
        "start": 552.0,
        "end": 565.0
    },
    {
        "text": " era tratar de maximizar qué cosa quería maximizar una persona, a la hora de decidir cuántas horas.",
        "start": 565.0,
        "end": 574.0
    },
    {
        "text": " Las satisfacción de necesidad, tenías esas dos cosas, oscio y trabajar, oscio le daba necesidad, satisfacción de necesidad directa, trabajable, daba un sueldo, un ingreso, compraba bien, satisfacción necesidad.",
        "start": 574.0,
        "end": 589.0
    },
    {
        "text": " Entonces quería lo máximo posible, acá va directo algo, el empresario quiere maximizar esto, beneficios.",
        "start": 589.0,
        "end": 596.0
    },
    {
        "text": " Como ya hablamos de falturación, la compañera habló de ingresos, ganancias también dijeron por allá, vamos a definir unos beneficios.",
        "start": 597.0,
        "end": 606.0
    },
    {
        "text": " Así hablamos en un lenguaje común. Si quiera beneficio lo mismo que ganancio, para seguir lo que tenemos en el material bibliográfico, vamos a llamarle beneficios.",
        "start": 606.0,
        "end": 617.0
    },
    {
        "text": " Pero es lo mismo, beneficios sinónimo de ganancia. ¿Cómo calculamos esos beneficios de una empresa, de cualquier empresa?",
        "start": 617.0,
        "end": 624.0
    },
    {
        "text": " Si quisieramos calcular los beneficios de una empresa, ¿qué cuentas hacemos?",
        "start": 624.0,
        "end": 630.0
    },
    {
        "text": " ¿Venecíso de lo mismo que ingresos que tiene una empresa? No, la compañera hoy mencionó costos también.",
        "start": 632.0,
        "end": 638.0
    },
    {
        "text": " Entonces cómo se llega a la cuenta de los beneficios? Beneficios lo que me queda después de hacer la cuenta que dice el compañero.",
        "start": 638.0,
        "end": 645.0
    },
    {
        "text": " Miro ingresos, miro costos o miro gastos. Esa diferencia son los beneficios. Entonces definamos así.",
        "start": 646.0,
        "end": 654.0
    },
    {
        "text": " Ingresos menos, vamos a llamarle ingresos para no hablar de gastos porque capaz que alguno puede ser una inversión y hay conceptos que a veces se paran gasto de inversión.",
        "start": 654.0,
        "end": 665.0
    },
    {
        "text": " Entonces dámoslo bien generico. Ingresos menos ingresos. Los ingresos son los costos que hablaba de la compañera.",
        "start": 665.0,
        "end": 672.0
    },
    {
        "text": " Y de hecho si quieren hablemos ya de los costos, ¿qué tipo de costos tiene una empresa? ¿En qué gasta plata para producir?",
        "start": 673.0,
        "end": 681.0
    },
    {
        "text": " Por ejemplo, que estamos buscando, quiere contratar gente y le tiene que pagar. ¿Qué cuentas hacemos para calcular lo que gasta en sueldo?",
        "start": 681.0,
        "end": 690.0
    },
    {
        "text": " Y pónganse en el lugar que tienen que hacer la cuenta de ustedes de un negocio que están por azar y quiero saber a alguien me pregunta en sueldo ¿cuánto gasto? ¿Y qué cuenta van a azar?",
        "start": 691.0,
        "end": 701.0
    },
    {
        "text": " Para saber cuánto gasto en sueldo. ¿La cantidad de gente que tengo por el sueldo es agente?",
        "start": 701.0,
        "end": 710.0
    },
    {
        "text": " Entonces para vincular esto, que es una lógica que estamos viendo y ya acá les voy a poner la abartencia.",
        "start": 711.0,
        "end": 718.0
    },
    {
        "text": " Lo dijimos en los otros días pero de vuelta acá, esto es un razonamiento microeconómico.",
        "start": 718.0,
        "end": 723.0
    },
    {
        "text": " Lo van a volver a hacer con Gustavo al final de el curso en el bloque de micro. La macroeconomía se apoyan esto.",
        "start": 723.0,
        "end": 729.0
    },
    {
        "text": " Por eso lo estamos viendo.",
        "start": 729.0,
        "end": 731.0
    },
    {
        "text": " Entonces, entonces, si vamos, vamos a tratar de definir esos egresos, que si bien lo estamos pensando con una mirada de una empresa, lo vamos a llevar a la macro.",
        "start": 732.0,
        "end": 742.0
    },
    {
        "text": " Entonces vamos a usar variables macro. ¿Cómo calculo los costos salariales?",
        "start": 742.0,
        "end": 747.0
    },
    {
        "text": " W, que es lo que le voy a pagar de sueldo a cada uno por la cantidad de gente.",
        "start": 747.0,
        "end": 752.0
    },
    {
        "text": " Y ahí tengo los costos en mano de obra, los costos en salarios.",
        "start": 752.0,
        "end": 757.0
    },
    {
        "text": " Más a salarial, el nombre que quiera usar. Eso es lo que va a gastar la empresa en mano de obra.",
        "start": 758.0,
        "end": 764.0
    },
    {
        "text": " Pero tiene otros costos también, ¿verdad? ¿Qué otros costos tienen una empresa para producir?",
        "start": 764.0,
        "end": 770.0
    },
    {
        "text": " Contrata gente y ¿qué más?",
        "start": 770.0,
        "end": 772.0
    },
    {
        "text": " Material primas.",
        "start": 772.0,
        "end": 773.0
    },
    {
        "text": " Materias primas. ¿Qué más?",
        "start": 773.0,
        "end": 776.0
    },
    {
        "text": " Insumos. ¿Qué más?",
        "start": 776.0,
        "end": 780.0
    },
    {
        "text": " Impuestos.",
        "start": 780.0,
        "end": 782.0
    },
    {
        "text": " Y estamos como en la chiquita. No hay nada grande que tenga que gastar para producir.",
        "start": 782.0,
        "end": 791.0
    },
    {
        "text": " Machinaria. Entonces ahí nos acercamos un poco también con esto de pensar en nivel micro y después ir a macro, va a tener que comprar machinarias.",
        "start": 791.0,
        "end": 804.0
    },
    {
        "text": " ¿Sí?",
        "start": 804.0,
        "end": 805.0
    },
    {
        "text": " También capaz que hay alguna tecnología.",
        "start": 805.0,
        "end": 808.0
    },
    {
        "text": " Entonces, si fuera de esto un razonamiento micro de las materias primas, los insumos, todo eso lo tenemos que poner ahí.",
        "start": 809.0,
        "end": 814.0
    },
    {
        "text": " Como estamos con esto que vamos de la micro a la macro, a nivel macro de las materias primas insumos desaparecen.",
        "start": 814.0,
        "end": 820.0
    },
    {
        "text": " Entonces lo que vamos a incluir acá son lo que podemos denominar otros costos fijos.",
        "start": 820.0,
        "end": 826.0
    },
    {
        "text": " Y ahí por ejemplo, hasta el capítulo de la tecnología, recuerden que acá dijimos la mano de obra es clave, a corto plazo.",
        "start": 828.0,
        "end": 835.0
    },
    {
        "text": " Porque los otros tres lo suponemos constantes o fijos a corto plazo.",
        "start": 836.0,
        "end": 841.0
    },
    {
        "text": " Entonces dentro de los ingresos que tenemos esta resta acá, tenemos costos salariales definidos de esa manera, W por L,",
        "start": 841.0,
        "end": 852.0
    },
    {
        "text": " W salario unitario, el sueldo que le pagamos acá a persona y en términos nominales, porque estamos hablando de beneficio de billetes.",
        "start": 852.0,
        "end": 860.0
    },
    {
        "text": " No estoy hablando de poder adquisitivo acá, estoy hablando de cantidad billetes por persona y acá, cantidad de persona.",
        "start": 860.0,
        "end": 867.0
    },
    {
        "text": " Entonces esto me queda un monto de plata, de dinero y esto es lo mismo, costo fijo.",
        "start": 867.0,
        "end": 872.0
    },
    {
        "text": " Y los ingresos de una empresa como los cadeculos.",
        "start": 872.0,
        "end": 875.0
    },
    {
        "text": " Las ventas y las ventas que he cuentado para calcular las ventas, el monto de ventas, en pesos.",
        "start": 878.0,
        "end": 886.0
    },
    {
        "text": " Preció por las cantidades que vendí, entonces de vuelta con este ejercicio de ir de lo individual,",
        "start": 887.0,
        "end": 893.0
    },
    {
        "text": " al agregado, me tuéis precio que en esta lógica macro sería LPC y cantidades que en la lógica macro es PBI.",
        "start": 893.0,
        "end": 901.0
    },
    {
        "text": " Entonces tengo ingresos por ventas menos costos, ¿sí?",
        "start": 901.0,
        "end": 907.0
    },
    {
        "text": " Y esos son nuestros beneficios.",
        "start": 908.0,
        "end": 910.0
    },
    {
        "text": " Estos son los beneficios de una empresa.",
        "start": 911.0,
        "end": 914.0
    },
    {
        "text": " Entonces definimos para saber cómo llamarle, cómo manejar estos los beneficios y volvimos a lo que estábamos tratando a analizar,",
        "start": 916.0,
        "end": 925.0
    },
    {
        "text": " que es en función de qué una empresa va a tomar la decisión de cuánta gente contratar.",
        "start": 925.0,
        "end": 932.0
    },
    {
        "text": " Digimos que va a pasar eso por la maximización de beneficios y la maximización de beneficios.",
        "start": 932.0,
        "end": 937.0
    },
    {
        "text": " Y sabemos que los beneficios son esta ecuación y le ponemos un condimento matemático como parte de la formalidad de este planteo que hacemos para maximizar una función.",
        "start": 938.0,
        "end": 949.0
    },
    {
        "text": " Derivamos, entonces vamos a derivar los beneficios en función de la variable de control.",
        "start": 951.0,
        "end": 959.0
    },
    {
        "text": " Esta es la forma de expresar derivada, igual que lo de la productividad, no es un cociente, simplemente no me enclatura.",
        "start": 960.0,
        "end": 966.0
    },
    {
        "text": " Es capaz que le ponen prima o es. En función de la variable que estamos manejando, que es la cantidad de trabajadores.",
        "start": 968.0,
        "end": 974.0
    },
    {
        "text": " La empresa va a querer ver a medida que contratan a trabajadores como ese incremento de gente a la empresa le pegan los beneficios y lo que va a tratar de buscar el max.",
        "start": 974.0,
        "end": 984.0
    },
    {
        "text": " Entonces vamos a hacer esta derivada y qué vamos a hacer para el máximo.",
        "start": 985.0,
        "end": 991.0
    },
    {
        "text": " Enciencia económica y no respondan, está bien, pero acá ingeniería, casi hemos con un máximo.",
        "start": 992.0,
        "end": 999.0
    },
    {
        "text": " O alamos cero, ¿no? Vamos, le dejo acá para el final, primero pongamos.",
        "start": 999.0,
        "end": 1004.0
    },
    {
        "text": " Tenemos que derivar esto, ¿sí? Vamos a agrearle algún datito adicional, primer dato que viene también de este juego de microalomacro.",
        "start": 1006.0,
        "end": 1017.0
    },
    {
        "text": " Los precios van a estar dados. A nivel de una empresa vamos a suponer por ciertas condiciones, eso lo van a ver mejor en micro, ¿qué es un dato?",
        "start": 1017.0,
        "end": 1027.0
    },
    {
        "text": " O sea, el empresario va a querer ver cuántos personas contratar, pero para un nivel de precios de lo que él va a vender, ¿qué va a estar dado por el mercado?",
        "start": 1027.0,
        "end": 1035.0
    },
    {
        "text": " Y lo mismo va a pasar con el salario.",
        "start": 1035.0,
        "end": 1038.0
    },
    {
        "text": " El empresario este vamos a suponer que a la hora de decir cuántas personas contratan, no tienen poder influirle pago tanto o tanto, sino que va a tomar lo que es el salario del mercado.",
        "start": 1038.0,
        "end": 1049.0
    },
    {
        "text": " Entonces, agregados esas dos supuestos adicionales, derivemos los beneficios en función del, derivo peporku.",
        "start": 1049.0,
        "end": 1062.0
    },
    {
        "text": " ¿Cómo me queda? ¿Qu depende de él? ¿La producción de la empresa depende de la cantidad de gente que contrate?",
        "start": 1063.0,
        "end": 1070.0
    },
    {
        "text": " Sí, lo tenemos acá, en esto que le hoy nos lo dijimos en este repaso, pero esto se llama la función de producción, que me dice justamente que variando esta variable va a cambiar aquello.",
        "start": 1070.0,
        "end": 1083.0
    },
    {
        "text": " Entonces, ¿cómo me queda la derivada de peporku?",
        "start": 1084.0,
        "end": 1087.0
    },
    {
        "text": " Pep por la derivada de Q en función de él.",
        "start": 1088.0,
        "end": 1093.0
    },
    {
        "text": " Sí, y a esto incluso como le llamamos, como dijimos que se llama esto.",
        "start": 1093.0,
        "end": 1098.0
    },
    {
        "text": " La productividad.",
        "start": 1098.0,
        "end": 1101.0
    },
    {
        "text": " En realidad, como este concepto sale de la derivada se le agrega siempre marginal.",
        "start": 1103.0,
        "end": 1109.0
    },
    {
        "text": " Ahora vamos a trabajar un poquito, estas conceptos con un ejercicio.",
        "start": 1110.0,
        "end": 1114.0
    },
    {
        "text": " Sigo, doble por él, derivo por él.",
        "start": 1115.0,
        "end": 1121.0
    },
    {
        "text": " ¿Por él?",
        "start": 1121.0,
        "end": 1124.0
    },
    {
        "text": " ¿Qué antigeniería, verdad?",
        "start": 1132.0,
        "end": 1136.0
    },
    {
        "text": " Entra a un recién o, ¿y hay si un semestre de cálculo? ¿Dereiva eso, derivo por él?",
        "start": 1136.0,
        "end": 1143.0
    },
    {
        "text": " Lo le ve, deriva de ahí costofijos, ser.",
        "start": 1143.0,
        "end": 1148.0
    },
    {
        "text": " Entonces, de acá concluimos que la for, esto que le llamamos la productividad, marginal del trabajo,",
        "start": 1148.0,
        "end": 1160.0
    },
    {
        "text": " a esto se le denomina la condición de maximización de beneficios.",
        "start": 1161.0,
        "end": 1175.0
    },
    {
        "text": " ¿Sí?",
        "start": 1176.0,
        "end": 1180.0
    },
    {
        "text": " Podríamos pensar que pueda haber una relación, pero también esto puede cambiar en función de cambios tecnológicos que tengas,",
        "start": 1188.0,
        "end": 1194.0
    },
    {
        "text": " la relación máquina por persona o cantidad de turnos que quieras para utilizar las máquinas.",
        "start": 1194.0,
        "end": 1199.0
    },
    {
        "text": " Por eso, tiene una relación, pero como estamos asumiendo que estas de acá son fijas,",
        "start": 1200.0,
        "end": 1205.0
    },
    {
        "text": " en el momento de ir aquella lógica, así monóla, la máquina era tan,",
        "start": 1205.0,
        "end": 1209.0
    },
    {
        "text": " y lo que tengo que ver es cuánta gente la que me conviene a mí producir en función de costos de ingresos.",
        "start": 1209.0,
        "end": 1214.0
    },
    {
        "text": " Bien, vamos a ponernos ahora con un ejercicio para tratar de seguir esta lógica.",
        "start": 1217.0,
        "end": 1226.0
    },
    {
        "text": " El ejercicio va a consistir en analizar que tenemos cinco personas,",
        "start": 1227.0,
        "end": 1235.0
    },
    {
        "text": " cinco personas que quieren trabajar, que tenemos nosotros la posibilidad de contratarlas",
        "start": 1239.0,
        "end": 1244.0
    },
    {
        "text": " y que queremos ver cuál es la cantidad de gente que nos va a maximizar los beneficios.",
        "start": 1244.0,
        "end": 1250.0
    },
    {
        "text": " Entonces, vamos a tener una primera persona que le vamos a llamar Pepe,",
        "start": 1251.0,
        "end": 1256.0
    },
    {
        "text": " una segunda que le vamos a llamar Danielio,",
        "start": 1256.0,
        "end": 1259.0
    },
    {
        "text": " una tercera que le vamos a llamar Sandic,",
        "start": 1259.0,
        "end": 1263.0
    },
    {
        "text": " una cuarta, vamos a poner,",
        "start": 1263.0,
        "end": 1266.0
    },
    {
        "text": " que le vamos a llamar Poygar,",
        "start": 1268.0,
        "end": 1270.0
    },
    {
        "text": " y una quinta que le vamos a llamar Vergalla.",
        "start": 1272.0,
        "end": 1275.0
    },
    {
        "text": " Y vamos a poner datos.",
        "start": 1276.0,
        "end": 1278.0
    },
    {
        "text": " El ingeniero de la empresa que nosotros somos los dueños y queremos tomar la decisión como empresarios racionales,",
        "start": 1281.0,
        "end": 1287.0
    },
    {
        "text": " nos da a los datos de cuánto va poder obtener la empresa.",
        "start": 1287.0,
        "end": 1292.0
    },
    {
        "text": " De bienes, ¿sí?",
        "start": 1295.0,
        "end": 1297.0
    },
    {
        "text": " Dependiendo cuánta gente contrate.",
        "start": 1303.0,
        "end": 1305.0
    },
    {
        "text": " Y ahora vamos a interpretar esto.",
        "start": 1305.0,
        "end": 1307.0
    },
    {
        "text": " Entonces, agarran y nos dan estos datos.",
        "start": 1311.0,
        "end": 1314.0
    },
    {
        "text": " Nosotros le pedimos que nos diga el función de las maquinarias que tenemos y sumos todo lo que tenemos y le hicimos mirar.",
        "start": 1314.0,
        "end": 1320.0
    },
    {
        "text": " Tengo estos cinco currículums y quiero ver qué es lo mejor que puedo hacer.",
        "start": 1320.0,
        "end": 1324.0
    },
    {
        "text": " Y para eso, lo que nos pasó el ingeniero es si trabaja una sola persona,",
        "start": 1324.0,
        "end": 1329.0
    },
    {
        "text": " si solo contratamos a Pepe y vamos a suponer que nos jugamos con el orden, el orden es este.",
        "start": 1329.0,
        "end": 1334.0
    },
    {
        "text": " Entonces, cientra Pepe a trabajar y solo trabaja este, nos decimos por que él es uno, que sea un solo empleado,",
        "start": 1335.0,
        "end": 1342.0
    },
    {
        "text": " vamos a obtener siete unidades, la producción va a ser siete.",
        "start": 1342.0,
        "end": 1346.0
    },
    {
        "text": " Ahora, si contratamos a Pepe pero además a Danielo,",
        "start": 1347.0,
        "end": 1350.0
    },
    {
        "text": " está es la columna de la producción total que nos está pasando el ingeniero,",
        "start": 1350.0,
        "end": 1354.0
    },
    {
        "text": " nos dice que vamos a producir 13 unidades en total.",
        "start": 1354.0,
        "end": 1357.0
    },
    {
        "text": " ¿Cómo se interpreta eso? Que si hay dos que están trabajando y yo puedo asumir que si había uno solo produce siete,",
        "start": 1358.0,
        "end": 1366.0
    },
    {
        "text": " ¿cuántos es lo que me aporta Danielo?",
        "start": 1366.0,
        "end": 1369.0
    },
    {
        "text": " 6. Entonces, vamos a hacernos acá una columna adicional que le vamos a llamar producto marginal",
        "start": 1369.0,
        "end": 1379.0
    },
    {
        "text": " y el producto marginal en este ejercicio que vamos a estar analizando, justamente refiere a eso,",
        "start": 1380.0,
        "end": 1385.0
    },
    {
        "text": " a ver, a pensarlo en esos términos de derivada, aunque no estamos haciendo una aproximación grosera,",
        "start": 1385.0,
        "end": 1391.0
    },
    {
        "text": " como que no es infinitesimal sino que es uno, que él le cambia en uno.",
        "start": 1391.0,
        "end": 1395.0
    },
    {
        "text": " Entonces, ¿cuánto me cambia la producción si yo contrato a uno más o sea Danielo",
        "start": 1395.0,
        "end": 1400.0
    },
    {
        "text": " y que la producción va a aumentar en size?",
        "start": 1400.0,
        "end": 1403.0
    },
    {
        "text": " Ahora si además contratamos a Cendic, vamos a tener que la producción es 18,",
        "start": 1404.0,
        "end": 1409.0
    },
    {
        "text": " entonces el producto marginal de Cendic, ¿cuánto es?",
        "start": 1409.0,
        "end": 1412.0
    },
    {
        "text": " 5. El producto marginal de Poigar,",
        "start": 1414.0,
        "end": 1417.0
    },
    {
        "text": " el producto marginal de Vergara, 2. ¿Qué le va pasando al producto marginal?",
        "start": 1419.0,
        "end": 1427.0
    },
    {
        "text": " Vaba Han, ¿qué le va pasando a la producción? A medida de contratamos más gente.",
        "start": 1428.0,
        "end": 1437.0
    },
    {
        "text": " Vaba aumentando, o sea que si yo me quisiera hacer un gráfico acá con la cantidad de gente y acá la producción",
        "start": 1439.0,
        "end": 1446.0
    },
    {
        "text": " y acá arrancamos un cero, ¿no? Si no contratamos nadie, si él es cero, cero.",
        "start": 1448.0,
        "end": 1454.0
    },
    {
        "text": " ¿Cómo hago la evolución de esto?",
        "start": 1455.0,
        "end": 1458.0
    },
    {
        "text": " Con la formita que dijimos allá, ¿no? O sea, estamos asumiendo los supuestos que venimos manejando,",
        "start": 1460.0,
        "end": 1468.0
    },
    {
        "text": " que los factores productivos me inciden positivamente que hay una relación directa a más gente,",
        "start": 1468.0,
        "end": 1475.0
    },
    {
        "text": " más producción, pero esa producción va cayendo. ¿Por qué? Y asumimos lo mismo,",
        "start": 1475.0,
        "end": 1480.0
    },
    {
        "text": " porque en esta empresa ya hay maquinarias instaladas, ya hay plantas,",
        "start": 1481.0,
        "end": 1486.0
    },
    {
        "text": " hay puestas, el ejercicio va a ir un poco por ahí, ¿no?",
        "start": 1486.0,
        "end": 1489.0
    },
    {
        "text": " Son gente que está vinculada al proyecto canábico, ¿no?",
        "start": 1489.0,
        "end": 1493.0
    },
    {
        "text": " Entonces, bajemos por ahí y que este cúen realidad son unidades bolsitas como quieran llamar.",
        "start": 1493.0,
        "end": 1500.0
    },
    {
        "text": " Entonces tenemos esta producción que surge a partir de determinados toques de maquinarias, insumos, etc.",
        "start": 1501.0,
        "end": 1507.0
    },
    {
        "text": " Y que bueno, si sólo le metemos más gente a trabajar, esa producción aumenta, pero cada vez menos.",
        "start": 1508.0,
        "end": 1513.0
    },
    {
        "text": " Otro dato que tenemos que manejar es cuánto le vamos a pagar.",
        "start": 1517.0,
        "end": 1521.0
    },
    {
        "text": " Y en realidad vamos a pensarlo en términos reales, ¿cuánto le vamos a pagar?",
        "start": 1523.0,
        "end": 1528.0
    },
    {
        "text": " Vamos a suponer que el salario del mercado",
        "start": 1528.0,
        "end": 1533.0
    },
    {
        "text": " ¿cuánto es el precio de la bolsita? Por algún conocido ustedes, ¿no? No tienen por qué marcen.",
        "start": 1538.0,
        "end": 1543.0
    },
    {
        "text": " ¿Algún conocido que les haya contado? ¿Cuánto sale?",
        "start": 1544.0,
        "end": 1549.0
    },
    {
        "text": " ¿Cier? ¿Homámole que es cier? Bueno, vamos a suponer que el salario que recibe que se paga acá es 500.",
        "start": 1549.0,
        "end": 1557.0
    },
    {
        "text": " Entonces, salario real, 5 bolsitas.",
        "start": 1558.0,
        "end": 1564.0
    },
    {
        "text": " Estamos hablando acá que la variable salario nominal son 500 pesos, pero como el bien este por esta lógica macro micro,",
        "start": 1566.0,
        "end": 1575.0
    },
    {
        "text": " lo asociamos a un bien solo, que son las bolsas esta, siempre sos cada una.",
        "start": 1575.0,
        "end": 1580.0
    },
    {
        "text": " Entonces, en términos reales como en este ejercicio sólo hablamos de que los bienes que conforman la canasta de EPC,",
        "start": 1581.0,
        "end": 1587.0
    },
    {
        "text": " eso lo saboles a bueno, en salario real son 5 unidades.",
        "start": 1587.0,
        "end": 1591.0
    },
    {
        "text": " En otros casos podríamos decir, bueno, acá hay gente que viene a trabajar y produce para la empresa,",
        "start": 1593.0,
        "end": 1599.0
    },
    {
        "text": " produce bolsas para la empresa y se le paga en bolsas también.",
        "start": 1599.0,
        "end": 1603.0
    },
    {
        "text": " Entonces, ¿cuánto le vamos a pagar a PPS? Si lo contratamos 5, a Danielo y a todos los demás, a todos le pagamos 5.",
        "start": 1604.0,
        "end": 1614.0
    },
    {
        "text": " Y tenemos todo expresado acá en este cuadro en unidades físicas, en términos reales por aquella diferenciación que también así.",
        "start": 1615.0,
        "end": 1624.0
    },
    {
        "text": " Entonces, la idea con este ejercicio es ver justamente lo que estamos buscando, a ver si podemos encontrar un criterio para saber si nos conviene contratar a las 5 personas,",
        "start": 1625.0,
        "end": 1634.0
    },
    {
        "text": " si sólo nos conviene contratar hasta POD, el garcicendixi o no, si Danielo sí conviene o no.",
        "start": 1634.0,
        "end": 1641.0
    },
    {
        "text": " Entonces, vamos a tratar de identificarnos cuál es pueden ser, si quieren podemos hacer otra columna acá,",
        "start": 1642.0,
        "end": 1651.0
    },
    {
        "text": " podemos evitarla, pero que sea el costo total. ¿Cuál es el costo total si contratamos una persona sola y siempre hablando en términos reales?",
        "start": 1652.0,
        "end": 1665.0
    },
    {
        "text": " 5 bolsas, vamos a tener que pagar, ¿no? Si contratamos al PPD a Danielo, ¿cuánto gastamos en total? 10.",
        "start": 1666.0,
        "end": 1675.0
    },
    {
        "text": " Se indica, en total gastamos 15, por eso cada columna hay que interpretarla según lo que estamos diciendo, ¿no? 20 y 25.",
        "start": 1676.0,
        "end": 1688.0
    },
    {
        "text": " Entonces, tenemos una primera columna que es la producción total, otra que es la producción marginal, otra que es lo que le pagamos acá a uno individualmente y otra que es el costo total.",
        "start": 1691.0,
        "end": 1702.0
    },
    {
        "text": " Y vamos a conformarnos una que sea el beneficio total.",
        "start": 1703.0,
        "end": 1708.0
    },
    {
        "text": " Si, que sea el beneficio total, las ganancias totales que obtendría la empresa expresadas en términos reales, porque estamos todos hablando de las bolsas,",
        "start": 1712.0,
        "end": 1721.0
    },
    {
        "text": " y analizarlo para cada uno, el ingeniero nos dio hasta acá y ahora con algún concepto económico estamos tratando hacer una cuentita para ver quién me conviene más.",
        "start": 1722.0,
        "end": 1733.0
    },
    {
        "text": " Y la hago bien así cuadrículado de decir, bueno, para cada uno de ellos veo cuánto podría hacer y después sobre eso, mira y tomo la decisión.",
        "start": 1733.0,
        "end": 1741.0
    },
    {
        "text": " ¿Cuál es el beneficio total que obtenemos y solo contratamos al PPD?",
        "start": 1741.0,
        "end": 1746.0
    },
    {
        "text": " El ideólogo de este proyecto. ¿Cuánto ganamos? Como dueños de esta empresa.",
        "start": 1747.0,
        "end": 1754.0
    },
    {
        "text": " Contratamos al PPD, la producción total va a ser 7 y el costo total, 5, o sea, 2.",
        "start": 1754.0,
        "end": 1763.0
    },
    {
        "text": " Para que a la calcula el beneficio total voy a estar mirando entonces estas 2.",
        "start": 1763.0,
        "end": 1769.0
    },
    {
        "text": " Y me calculo beneficio total. Si contrató al PPD y a Danilo, ¿cuál es el beneficio total de la empresa? 3 unidades.",
        "start": 1770.0,
        "end": 1783.0
    },
    {
        "text": " Prodúsco 13 en total, tengo un costo total de 10, la diferencia 3.",
        "start": 1783.0,
        "end": 1790.0
    },
    {
        "text": " Si contratas en Dick, si agrego a Poglgar a la empresa, si agrego a Vargara, beneficio total menos 1, quiere decir que me voy a endeudar,",
        "start": 1791.0,
        "end": 1810.0
    },
    {
        "text": " que me tengo pérdidas ahí, para todos los demás casos tengo ganancias.",
        "start": 1811.0,
        "end": 1815.0
    },
    {
        "text": " Ya podría ir pensando que si tuviera que elegir entre una determinada cantidad de gente,",
        "start": 1815.0,
        "end": 1822.0
    },
    {
        "text": " voy a elegir contratar a alguien que me lleve a que la empresa tenga pérdidas.",
        "start": 1822.0,
        "end": 1827.0
    },
    {
        "text": " No, entonces Vargara parecería que sería alguien que no vamos a contratar.",
        "start": 1827.0,
        "end": 1833.0
    },
    {
        "text": " Le pido a la renuncia al PPD porque no era reglólo, el financiamiento, que lo han concentrado,",
        "start": 1833.0,
        "end": 1838.0
    },
    {
        "text": " no sé qué, no sé lo cuenta de eso, me da a traer esperdidas te hecho o no te contrato en este ejercicio.",
        "start": 1838.0,
        "end": 1846.0
    },
    {
        "text": " Ahora vamos a jugar también con la idea del beneficio marginal, de pensarlo en términos de cada uno, individuales de cada uno,",
        "start": 1846.0,
        "end": 1855.0
    },
    {
        "text": " porque en realidad teníamos la mirada total, pero también la mirada de cada uno, la individual.",
        "start": 1855.0,
        "end": 1860.0
    },
    {
        "text": " Entonces ahora para esto otro vamos a estar mirando lo que me aporta cada uno,",
        "start": 1860.0,
        "end": 1866.0
    },
    {
        "text": " la productividad de cada uno que habíamos visto hoy, y lo que me cuesta cada uno.",
        "start": 1866.0,
        "end": 1873.0
    },
    {
        "text": " ¿Sí? ¿Cuánto aporta el PEPE?",
        "start": 1873.0,
        "end": 1877.0
    },
    {
        "text": " 7 unidades, pero me cuesta? 5, o sea que cuanto aporta.",
        "start": 1880.0,
        "end": 1886.0
    },
    {
        "text": " 2, si hay solo una persona lo que aporta tiene que coincidir con el total.",
        "start": 1886.0,
        "end": 1893.0
    },
    {
        "text": " ¿Sí? Danilo en cambio aporta o no aporta.",
        "start": 1893.0,
        "end": 1898.0
    },
    {
        "text": " 1, por eso el marginal, la suma de los marginales cuando estamos contratando a 2,",
        "start": 1900.0,
        "end": 1907.0
    },
    {
        "text": " que dijimos que teníamos un beneficio total de 3, de donde sale este 3,",
        "start": 1907.0,
        "end": 1911.0
    },
    {
        "text": " del PEPE que aporta a 2 unidades, de ganancia a la empresa y de Danilo que aporta a UD.",
        "start": 1911.0,
        "end": 1917.0
    },
    {
        "text": " Si contratamos a Sendik, ¿cuál es el aporte de Sendik?",
        "start": 1917.0,
        "end": 1923.0
    },
    {
        "text": " 5, me aporta 5 unidades, trabaja y aporta 5 unidades, pero cuesta registradas en la tarjeta 5.",
        "start": 1923.0,
        "end": 1934.0
    },
    {
        "text": " 0 de aporte entonces. ¿Qué pasa con Polgar?",
        "start": 1935.0,
        "end": 1940.0
    },
    {
        "text": " 1, y entonces si lo miramos así muy individualmente decimos, pero para Polgar,",
        "start": 1942.0,
        "end": 1949.0
    },
    {
        "text": " voy a venir a trabajar, aportas 4, pero te tengo que pagar 5 bolsitas cuando te vas.",
        "start": 1949.0,
        "end": 1956.0
    },
    {
        "text": " ¿Qué hacemos con Polgar?",
        "start": 1956.0,
        "end": 1959.0
    },
    {
        "text": " Si somos racionales, si somos amigos, no somos amigos, somos racionales.",
        "start": 1960.0,
        "end": 1965.0
    },
    {
        "text": " Este numerito acá, hoy acá este número me había dicho no, si me lleva la empresa pérdida,",
        "start": 1965.0,
        "end": 1970.0
    },
    {
        "text": " si yo tenía una empresa que ganaba 2, si te contrataba hoy paso a perder,",
        "start": 1970.0,
        "end": 1974.0
    },
    {
        "text": " ya tu análisis me llegó a que bargar a no, ahora yo estoy ganando con Polgar,",
        "start": 1974.0,
        "end": 1979.0
    },
    {
        "text": " pero si lo mire individualmente, Polgar me hace ganarme menos, no?",
        "start": 1979.0,
        "end": 1985.0
    },
    {
        "text": " Podría haber ganado 3, si no lo he contratado.",
        "start": 1985.0,
        "end": 1988.0
    },
    {
        "text": " Por lo tanto, este dato de que el beneficio marginal sea negativo, que quiere decir esto,",
        "start": 1988.0,
        "end": 1994.0
    },
    {
        "text": " me aportas 4, pero me costa 5, si yo soy racional, no te tengo que contratar.",
        "start": 1994.0,
        "end": 2000.0
    },
    {
        "text": " ¿Sí? Porque mire estas dos variables del análisis de los beneficios de una empresa,",
        "start": 2000.0,
        "end": 2007.0
    },
    {
        "text": " y si yo soy cerrado, que solo quiero ganar y ganar y envolzarme el billet,",
        "start": 2007.0,
        "end": 2013.0
    },
    {
        "text": " y yo soy el billet con más billete, y bueno, este no me sirve,",
        "start": 2013.0,
        "end": 2016.0
    },
    {
        "text": " porque voy a ganar un poquito menos.",
        "start": 2016.0,
        "end": 2019.0
    },
    {
        "text": " Y este último para cerrar el análisis, que beneficio marginal tenía a bargar a,",
        "start": 2019.0,
        "end": 2025.0
    },
    {
        "text": " menos 3, o sea, bargar a tanto por su análisis individual,",
        "start": 2025.0,
        "end": 2033.0
    },
    {
        "text": " como porque no llevaba una pérdida de toda la empresa, habíamos decidido no contratar.",
        "start": 2033.0,
        "end": 2039.0
    },
    {
        "text": " Entonces, tenemos que ya doya los sacamos del análisis,",
        "start": 2039.0,
        "end": 2045.0
    },
    {
        "text": " y tenemos 3 personas para decidir si contratamos 1, 2 o 3,",
        "start": 2045.0,
        "end": 2050.0
    },
    {
        "text": " y tenemos las variables clave de un empresario que son los beneficios.",
        "start": 2050.0,
        "end": 2056.0
    },
    {
        "text": " ¿Qué hacemos? ¿Cuál es la decisión, la mejor decisión,",
        "start": 2056.0,
        "end": 2060.0
    },
    {
        "text": " decisión óptima como quieran llamarle para contratar gente y ser maximizador de beneficios?",
        "start": 2060.0,
        "end": 2068.0
    },
    {
        "text": " Dos personas, ¿sí? ¿Hay uno ahí le da un crédito a Sendico, no?",
        "start": 2069.0,
        "end": 2078.0
    },
    {
        "text": " ¿Ya lo quieren matar? El sábado se va a descargar, ¿sí?",
        "start": 2078.0,
        "end": 2084.0
    },
    {
        "text": " ¿Por qué 2 y no 3?",
        "start": 2084.0,
        "end": 2088.0
    },
    {
        "text": " ¿Sendismo a portanada?",
        "start": 2088.0,
        "end": 2091.0
    },
    {
        "text": " Sendismo a portanada, con Sendico a andogano yo como empresario.",
        "start": 2091.0,
        "end": 2098.0
    },
    {
        "text": " 3, sin sendir cuanto gano, y entonces si gano lo mismo.",
        "start": 2098.0,
        "end": 2105.0
    },
    {
        "text": " ¿Pero produjo menos bolsitas, no?",
        "start": 2105.0,
        "end": 2112.0
    },
    {
        "text": " ¿Pero lo mismo?",
        "start": 2112.0,
        "end": 2116.0
    },
    {
        "text": " O sea, me da lo mismo, ¿no?",
        "start": 2116.0,
        "end": 2121.0
    },
    {
        "text": " Estamos en un momento que tenemos que cualquiera de los 2 casos me da lo mismo,",
        "start": 2121.0,
        "end": 2126.0
    },
    {
        "text": " nos ha cerruido el cero.",
        "start": 2126.0,
        "end": 2132.0
    },
    {
        "text": " O sea, las máquinas las tenemos porque recuerden que eran costofijos, ya los tenemos.",
        "start": 2132.0,
        "end": 2137.0
    },
    {
        "text": " Lo único que nos va a cambiar es como ustedes dicen, me ahorro un sueldo,",
        "start": 2137.0,
        "end": 2141.0
    },
    {
        "text": " no pago estos 5, pero me no produjo tanto.",
        "start": 2141.0,
        "end": 2146.0
    },
    {
        "text": " La lógica igual no era que yo quería ser el empresario que produjera más bolsas,",
        "start": 2146.0,
        "end": 2151.0
    },
    {
        "text": " sino que quería ser de los más beneficios.",
        "start": 2151.0,
        "end": 2154.0
    },
    {
        "text": " Milógicamente no era el ser un empresario que se ahorra costo,",
        "start": 2154.0,
        "end": 2157.0
    },
    {
        "text": " sino que un tenga más beneficio.",
        "start": 2157.0,
        "end": 2160.0
    },
    {
        "text": " Por acá parece que no tenemos la herramienta que nos ayuda a definirlo.",
        "start": 2160.0,
        "end": 2168.0
    },
    {
        "text": " Capaz que si le agregamos otro criterio, yo diría bueno,",
        "start": 2168.0,
        "end": 2171.0
    },
    {
        "text": " pero producir con 2 personas y producir con 3 personas y ganar lo mismo,",
        "start": 2171.0,
        "end": 2177.0
    },
    {
        "text": " capaz que prefiero contribuir porque le estoy dando un sueldo y hay una persona",
        "start": 2177.0,
        "end": 2181.0
    },
    {
        "text": " que se va a su casa trabajando y no desempleada.",
        "start": 2181.0,
        "end": 2185.0
    },
    {
        "text": " Pero bueno, tampoco es parte de esto que estamos tratando de definir acá.",
        "start": 2185.0,
        "end": 2191.0
    },
    {
        "text": " Como tenemos dudas, vamos a plantear una posibilidad.",
        "start": 2191.0,
        "end": 2195.0
    },
    {
        "text": " Antes de no contratarlo, ¿qué pasa si lo contratamos medio horario?",
        "start": 2195.0,
        "end": 2198.0
    },
    {
        "text": " Si nos planteamos esa posibilidad, antes de no contratarlo,",
        "start": 2198.0,
        "end": 2202.0
    },
    {
        "text": " que era lo que teníamos acá de la duda,",
        "start": 2202.0,
        "end": 2205.0
    },
    {
        "text": " planteamos no abrir su jornada laboral.",
        "start": 2205.0,
        "end": 2210.0
    },
    {
        "text": " En 8 horas en el NIC produce 5 bolsas.",
        "start": 2214.0,
        "end": 2217.0
    },
    {
        "text": " Si separamos, 4 horas y 4 horas.",
        "start": 2218.0,
        "end": 2221.0
    },
    {
        "text": " ¿Cómo hacemos esa repartida para seguir la coherencia de eso?",
        "start": 2221.0,
        "end": 2226.0
    },
    {
        "text": " 2,5 y 2,5.",
        "start": 2230.0,
        "end": 2232.0
    },
    {
        "text": " Si acá tenemos 3 trabajadores, acá teníamos 2,",
        "start": 2235.0,
        "end": 2242.0
    },
    {
        "text": " la mitad de la jornada va a estar acá, ¿no?",
        "start": 2244.0,
        "end": 2247.0
    },
    {
        "text": " Esto acá es 2,5.",
        "start": 2248.0,
        "end": 2252.0
    },
    {
        "text": " Y entonces esta producción, que acá decíamos que era 13.",
        "start": 2253.0,
        "end": 2258.0
    },
    {
        "text": " Y acá se viene a 18, no, acá se viene a 18, acá esto cuanto es.",
        "start": 2258.0,
        "end": 2264.0
    },
    {
        "text": " 15,5.",
        "start": 2265.0,
        "end": 2268.0
    },
    {
        "text": " Si fuese 15,5.",
        "start": 2270.0,
        "end": 2274.0
    },
    {
        "text": " Esto acá tendría que ser una recta, ¿no?",
        "start": 2275.0,
        "end": 2279.0
    },
    {
        "text": " Y es una recta que habíamos dicho, ¿qué por qué esto era decreciente?",
        "start": 2282.0,
        "end": 2289.0
    },
    {
        "text": " ¿Por qué?",
        "start": 2290.0,
        "end": 2294.0
    },
    {
        "text": " Porque a medida que uno trabajaba más hora,",
        "start": 2296.0,
        "end": 2299.0
    },
    {
        "text": " se agotaba en las posibilidades de aportar, entonces para hacer coherentes,",
        "start": 2299.0,
        "end": 2303.0
    },
    {
        "text": " entonces acá tendríamos que hacer que esto fuese 2,8 y esto fuese 2,2.",
        "start": 2303.0,
        "end": 2309.0
    },
    {
        "text": " Así seguimos trabajando con la lógica de rendimientos de crecimiento.",
        "start": 2309.0,
        "end": 2313.0
    },
    {
        "text": " Las primeras 4 horas son más productivas que las 2,4.",
        "start": 2313.0,
        "end": 2318.0
    },
    {
        "text": " Bien, en una jornada laboral, así como también capaz de una jornada de estudio,",
        "start": 2320.0,
        "end": 2325.0
    },
    {
        "text": " si nos ponemos estudiar 8 horas seguida, las primeras vamos a estar fresco,",
        "start": 2325.0,
        "end": 2329.0
    },
    {
        "text": " las últimas ya nos rinden menos, ¿no?",
        "start": 2329.0,
        "end": 2333.0
    },
    {
        "text": " Y en costo, ¿cómo le pagamos?",
        "start": 2333.0,
        "end": 2338.0
    },
    {
        "text": " ¿Acasí?",
        "start": 2340.0,
        "end": 2342.0
    },
    {
        "text": " Salvo que nos metamos con cuestiones de horas estras que a veces se pagan distintos,",
        "start": 2342.0,
        "end": 2346.0
    },
    {
        "text": " pero acá nos honoras estras, estamos hablando de la mitad de las jornadas,",
        "start": 2346.0,
        "end": 2350.0
    },
    {
        "text": " entonces 2,5 goudos.",
        "start": 2350.0,
        "end": 2353.0
    },
    {
        "text": " ¿Sí?",
        "start": 2355.0,
        "end": 2358.0
    },
    {
        "text": " Dejenme llevar a un gráfico esto.",
        "start": 2362.0,
        "end": 2366.0
    },
    {
        "text": " Y ahora vamos a ver si es un gráfico de rendimiento.",
        "start": 2376.0,
        "end": 2380.0
    },
    {
        "text": " Y ahora vamos a ver si es un gráfico de rendimiento.",
        "start": 2380.0,
        "end": 2384.0
    },
    {
        "text": " Y ahora vamos a ver si es un gráfico de rendimiento.",
        "start": 2384.0,
        "end": 2388.0
    },
    {
        "text": " Y ahora vamos a ver si es un gráfico de rendimiento.",
        "start": 2388.0,
        "end": 2392.0
    },
    {
        "text": " Y ahora vamos a ver si es un gráfico de rendimiento.",
        "start": 2392.0,
        "end": 2396.0
    },
    {
        "text": " Y ahora vamos a ver si es un gráfico de rendimiento.",
        "start": 2396.0,
        "end": 2400.0
    },
    {
        "text": " Y ahora vamos a ver si es un gráfico de rendimiento.",
        "start": 2400.0,
        "end": 2404.0
    },
    {
        "text": " Me gráfico de acá entonces la productividad marginal del trabajo,",
        "start": 2405.0,
        "end": 2416.0
    },
    {
        "text": " ¿sí? Lo que aporta cada uno de ellos.",
        "start": 2416.0,
        "end": 2420.0
    },
    {
        "text": " Lo otro que puedo graficar también,",
        "start": 2420.0,
        "end": 2424.0
    },
    {
        "text": " es lo que me cuesta.",
        "start": 2426.0,
        "end": 2430.0
    },
    {
        "text": " Cada uno de ellos, el salario real.",
        "start": 2431.0,
        "end": 2435.0
    },
    {
        "text": " ¿Sí?",
        "start": 2442.0,
        "end": 2444.0
    },
    {
        "text": " Este era Vergara, ¿por qué decíamos que no lo contrataban?",
        "start": 2445.0,
        "end": 2449.0
    },
    {
        "text": " Si yo miro la diferencia entre lo que aporta Vergara,",
        "start": 2452.0,
        "end": 2459.0
    },
    {
        "text": " que eran dos unidades y lo que me cuesta Vergara,",
        "start": 2460.0,
        "end": 2465.0
    },
    {
        "text": " que eran cinco unidades,",
        "start": 2465.0,
        "end": 2467.0
    },
    {
        "text": " encuentro que esto que me queda acá arriba,",
        "start": 2467.0,
        "end": 2470.0
    },
    {
        "text": " son el menos tres pérdidas.",
        "start": 2470.0,
        "end": 2475.0
    },
    {
        "text": " Por eso como el costo, el salario, supera lo que aporta",
        "start": 2475.0,
        "end": 2479.0
    },
    {
        "text": " la productividad, no lo contratan.",
        "start": 2479.0,
        "end": 2482.0
    },
    {
        "text": " Hay algo similar así, con el PP, decíamos, pero el PP me cuesta cinco,",
        "start": 2482.0,
        "end": 2489.0
    },
    {
        "text": " pero me aporta siete,",
        "start": 2490.0,
        "end": 2494.0
    },
    {
        "text": " por lo tanto toda esta diferencia carriola,",
        "start": 2494.0,
        "end": 2497.0
    },
    {
        "text": " acá es positiva y es el beneficio marginal.",
        "start": 2497.0,
        "end": 2503.0
    },
    {
        "text": " Y acá tenemos el beneficio marginal de Danilo,",
        "start": 2504.0,
        "end": 2511.0
    },
    {
        "text": " y acá la pérdida de Póviga, ¿no?",
        "start": 2511.0,
        "end": 2515.0
    },
    {
        "text": " Menos suito.",
        "start": 2516.0,
        "end": 2518.0
    },
    {
        "text": " Y Sandic lo teníamos acá en el cerro.",
        "start": 2518.0,
        "end": 2521.0
    },
    {
        "text": " Bien?",
        "start": 2522.0,
        "end": 2524.0
    },
    {
        "text": " Representé en un gráfico los mismos datos que teníamos allá",
        "start": 2524.0,
        "end": 2527.0
    },
    {
        "text": " en aquel ejercicio, en el cuadro.",
        "start": 2527.0,
        "end": 2531.0
    },
    {
        "text": " Entonces estamos mirando a Sandic,",
        "start": 2531.0,
        "end": 2533.0
    },
    {
        "text": " pero dijimos, vamos a mirar a Sandic con media jornada,",
        "start": 2533.0,
        "end": 2536.0
    },
    {
        "text": " o sea que estamos poniendo acá,",
        "start": 2536.0,
        "end": 2539.0
    },
    {
        "text": " dos con cinco empleados, media jornada de Sandic,",
        "start": 2539.0,
        "end": 2544.0
    },
    {
        "text": " y mirando el gráfico, mirando los números a aquellos,",
        "start": 2544.0,
        "end": 2547.0
    },
    {
        "text": " nos conviene la primera media hora de Sandic,",
        "start": 2547.0,
        "end": 2553.0
    },
    {
        "text": " ¿cuánto aporta en la primera media jornada de Dios?",
        "start": 2553.0,
        "end": 2558.0
    },
    {
        "text": " Dos con ocho, o sea, vine hasta acá y digo,",
        "start": 2558.0,
        "end": 2565.0
    },
    {
        "text": " todo esto acá vale dos con ocho.",
        "start": 2565.0,
        "end": 2570.0
    },
    {
        "text": " Y esto acá me cuesta dos con cinco.",
        "start": 2571.0,
        "end": 2576.0
    },
    {
        "text": " Y entonces esto acaba de 0,3 positivo.",
        "start": 2576.0,
        "end": 2583.0
    },
    {
        "text": " Y entonces lo contratos a primera media jornada con bien.",
        "start": 2583.0,
        "end": 2588.0
    },
    {
        "text": " Entonces ahora la duda en vez de trasladarla,",
        "start": 2588.0,
        "end": 2591.0
    },
    {
        "text": " de que nos plantábamos con Danilo,",
        "start": 2591.0,
        "end": 2594.0
    },
    {
        "text": " ahora la duda es seguro me conviene contratar media jornada",
        "start": 2594.0,
        "end": 2598.0
    },
    {
        "text": " a Sandic y la duda es la segunda jornada,",
        "start": 2598.0,
        "end": 2602.0
    },
    {
        "text": " la segunda parte de la jornada con estos números,",
        "start": 2602.0,
        "end": 2605.0
    },
    {
        "text": " ¿qué me diría esto acá?",
        "start": 2605.0,
        "end": 2610.0
    },
    {
        "text": " Este de acá según lo que decimos en ese ejercicio es",
        "start": 2610.0,
        "end": 2614.0
    },
    {
        "text": " más 0,3 y acá es menos 0,3.",
        "start": 2614.0,
        "end": 2619.0
    },
    {
        "text": " Y acá viene la advertencia y por eso es el gráfico.",
        "start": 2619.0,
        "end": 2623.0
    },
    {
        "text": " Este ejercicio viene ilustrativo,",
        "start": 2623.0,
        "end": 2627.0
    },
    {
        "text": " está en términos discretos.",
        "start": 2627.0,
        "end": 2629.0
    },
    {
        "text": " Acá uno puede dar el salto a pasar a analizar",
        "start": 2629.0,
        "end": 2632.0
    },
    {
        "text": " en términos continuos la situación.",
        "start": 2632.0,
        "end": 2635.0
    },
    {
        "text": " Entonces si uno analiza la segunda parte de la jornada,",
        "start": 2635.0,
        "end": 2638.0
    },
    {
        "text": " yo me podría haber hecho el mismo análisis de plantearme bueno,",
        "start": 2638.0,
        "end": 2641.0
    },
    {
        "text": " pero en vez de las segunda, cuatro horas,",
        "start": 2641.0,
        "end": 2643.0
    },
    {
        "text": " ¿qué pasa si lo contratos solo dos de esas segunda, cuatro horas?",
        "start": 2643.0,
        "end": 2647.0
    },
    {
        "text": " Y ahí que tendría que analizar esta parte de acá.",
        "start": 2647.0,
        "end": 2650.0
    },
    {
        "text": " Y me conviene o no,",
        "start": 2650.0,
        "end": 2653.0
    },
    {
        "text": " si analizo esta parte de acá,",
        "start": 2653.0,
        "end": 2656.0
    },
    {
        "text": " ¿qué tengo acá?",
        "start": 2656.0,
        "end": 2658.0
    },
    {
        "text": " ¿qué me aporta esto y me da esta de ganancia?",
        "start": 2658.0,
        "end": 2662.0
    },
    {
        "text": " ¿Sí? Y entonces ahí siguiendo con ese análisis",
        "start": 2662.0,
        "end": 2666.0
    },
    {
        "text": " creo podría hacerme bueno, pero de las últimas dos horas",
        "start": 2666.0,
        "end": 2669.0
    },
    {
        "text": " y lo contratos una sola y también me da una ganancia.",
        "start": 2669.0,
        "end": 2673.0
    },
    {
        "text": " Bien, entonces este análisis gráfico,",
        "start": 2675.0,
        "end": 2679.0
    },
    {
        "text": " lo que a mí me está mostrando es que este diferencial",
        "start": 2679.0,
        "end": 2682.0
    },
    {
        "text": " que se genera acá entre las curvas de producto marginal",
        "start": 2682.0,
        "end": 2688.0
    },
    {
        "text": " y de costo de cada uno, ¿no?",
        "start": 2688.0,
        "end": 2691.0
    },
    {
        "text": " Es costo marginal, también el salario real.",
        "start": 2691.0,
        "end": 2694.0
    },
    {
        "text": " Lo que me está mostrando todo esto acá rallado",
        "start": 2694.0,
        "end": 2697.0
    },
    {
        "text": " son los beneficios total, como suma de los beneficios marginal.",
        "start": 2697.0,
        "end": 2703.0
    },
    {
        "text": " Y donde si yo lo miro a cien términos gráficos,",
        "start": 2703.0,
        "end": 2708.0
    },
    {
        "text": " ¿dónde voy a obtener la mayor cantidad de beneficios?",
        "start": 2708.0,
        "end": 2713.0
    },
    {
        "text": " Si me he planto acá, ¿lo se obtenía?",
        "start": 2714.0,
        "end": 2717.0
    },
    {
        "text": " No, porque me pedía de ganar este triángulo.",
        "start": 2717.0,
        "end": 2721.0
    },
    {
        "text": " Si me he planto acá en la media jornada,",
        "start": 2721.0,
        "end": 2723.0
    },
    {
        "text": " me pido hacia el triángulito acá.",
        "start": 2723.0,
        "end": 2725.0
    },
    {
        "text": " Si me paro en este caso y sobre el final",
        "start": 2725.0,
        "end": 2727.0
    },
    {
        "text": " y me perderé un poquito ahí que no estoy bien.",
        "start": 2727.0,
        "end": 2730.0
    },
    {
        "text": " ¿Sí?",
        "start": 2730.0,
        "end": 2731.0
    },
    {
        "text": " En términos matemáticos, ¿qué me decía la condición",
        "start": 2731.0,
        "end": 2735.0
    },
    {
        "text": " de maximización de beneficio? ¿Qué dónde maximizado a yo?",
        "start": 2735.0,
        "end": 2740.0
    },
    {
        "text": " Cuando era igual, porque si no es igual,",
        "start": 2740.0,
        "end": 2744.0
    },
    {
        "text": " me estoy perdiendo un cachito ahí antes de ganar beneficio.",
        "start": 2744.0,
        "end": 2749.0
    },
    {
        "text": " Por lo tanto, volvemos, decimos, sendic.",
        "start": 2749.0,
        "end": 2752.0
    },
    {
        "text": " Y nos olvidamos de esto negativo acá,",
        "start": 2752.0,
        "end": 2754.0
    },
    {
        "text": " porque esta apertura era solo un ejercicio ilustrativo",
        "start": 2754.0,
        "end": 2757.0
    },
    {
        "text": " y hasta no es consistente que nos denegativo ahí, ¿sí?",
        "start": 2757.0,
        "end": 2761.0
    },
    {
        "text": " Comiene o no contratarlo, por más que acá tengamos un cero.",
        "start": 2762.0,
        "end": 2766.0
    },
    {
        "text": " Sí, justamente este cero de acá",
        "start": 2767.0,
        "end": 2771.0
    },
    {
        "text": " es el que me está diciendo que ahí maximiza los beneficios.",
        "start": 2771.0,
        "end": 2779.0
    },
    {
        "text": " En el cero, diez minutos antes no sería racional",
        "start": 2779.0,
        "end": 2786.0
    },
    {
        "text": " porque estaría perdiendo, me ganara algún peso",
        "start": 2786.0,
        "end": 2789.0
    },
    {
        "text": " y lo contratos diez minutos antes, sí, lo contratos siete horas a 50 minutos.",
        "start": 2789.0,
        "end": 2794.0
    },
    {
        "text": " Lo tengo que contratar ocho horas exacta para llegar a esta igualdad.",
        "start": 2794.0,
        "end": 2799.0
    },
    {
        "text": " Bien.",
        "start": 2799.0,
        "end": 2801.0
    },
    {
        "text": " Entonces, la contratación de gente por parte de una empresa",
        "start": 2803.0,
        "end": 2808.0
    },
    {
        "text": " va a depender de esta condición y esta condición tiene dos variables.",
        "start": 2808.0,
        "end": 2814.0
    },
    {
        "text": " Podemos venir acá a decir la demanda del trabajo",
        "start": 2814.0,
        "end": 2818.0
    },
    {
        "text": " que va a depender del salario real y de la productiva marginal del trabajo.",
        "start": 2818.0,
        "end": 2825.0
    },
    {
        "text": " Estas dos variables me van a estar determinando los beneficios,",
        "start": 2825.0,
        "end": 2829.0
    },
    {
        "text": " perdón, la demanda una empresa, porque son las que me determinan los beneficios de esa empresa.",
        "start": 2829.0,
        "end": 2835.0
    },
    {
        "text": " Ahora vamos a ver cómo es la relación el cino,",
        "start": 2838.0,
        "end": 2841.0
    },
    {
        "text": " pero lo primero que hicimos fue, bueno, si la conducta del empresario",
        "start": 2841.0,
        "end": 2845.0
    },
    {
        "text": " es maximizar beneficios, los beneficios trato de maximizarlos",
        "start": 2845.0,
        "end": 2850.0
    },
    {
        "text": " y en ese ejercicio de maximizar, de ver que es lo mejor para el empresario",
        "start": 2850.0,
        "end": 2854.0
    },
    {
        "text": " de esos beneficios, el salario real y la productividad,",
        "start": 2854.0,
        "end": 2858.0
    },
    {
        "text": " o sea, lo que me aporta cada uno en términos productivos de cantidad de bienesproducidos",
        "start": 2858.0,
        "end": 2864.0
    },
    {
        "text": " y lo que me cuesta cada uno, hago el ejercicio y ahí veo de términos",
        "start": 2864.0,
        "end": 2868.0
    },
    {
        "text": " cuáles la mejor cantidad de gente en función de esa lógica de beneficios.",
        "start": 2868.0,
        "end": 2873.0
    },
    {
        "text": " acá también nos faltó algo, porque lo que hicimos para maximizar beneficios con esto",
        "start": 2879.0,
        "end": 2885.0
    },
    {
        "text": " fue allá de este cero, pero para maximizar beneficios que precisamos,",
        "start": 2885.0,
        "end": 2892.0
    },
    {
        "text": " según la condición, segundo orden,",
        "start": 2893.0,
        "end": 2896.0
    },
    {
        "text": " igualando a cero, hay un extremo en la función,",
        "start": 2902.0,
        "end": 2905.0
    },
    {
        "text": " tengo que asar la segunda condición derivada segunda",
        "start": 2908.0,
        "end": 2912.0
    },
    {
        "text": " y derivada segunda es derivar de vuelta a esto,",
        "start": 2915.0,
        "end": 2918.0
    },
    {
        "text": " derivada de p, que era una constante por esta derivada, como me queda,",
        "start": 2918.0,
        "end": 2923.0
    },
    {
        "text": " p por la derivada segunda, menos derivada dole v, cero,",
        "start": 2927.0,
        "end": 2937.0
    },
    {
        "text": " y acá vamos a el análisis de signos, ¿qué es lo que precisamos para que esto sea un máximo?",
        "start": 2940.0,
        "end": 2945.0
    },
    {
        "text": " que el análisis de signos nos den negativo, ¿no?",
        "start": 2948.0,
        "end": 2951.0
    },
    {
        "text": " que esta derivada sea negativo y para que sea un máximo, esto tiene que ser negativo.",
        "start": 2951.0,
        "end": 2957.0
    },
    {
        "text": " Los precios, ¿cómo son los precios de los bienes?",
        "start": 2959.0,
        "end": 2963.0
    },
    {
        "text": " positivo siempre ¿no?",
        "start": 2964.0,
        "end": 2966.0
    },
    {
        "text": " y esto, ¿cómo le llamábamos a esto?",
        "start": 2968.0,
        "end": 2971.0
    },
    {
        "text": " a esta derivada segunda, los rendimientos y los rendimientos que era lo que asumíamos desde una lógica macroeconómica,",
        "start": 2972.0,
        "end": 2983.0
    },
    {
        "text": " ¿qué cómo era?",
        "start": 2984.0,
        "end": 2986.0
    },
    {
        "text": " negativo, este supuesto de última aca, no se está diciendo bueno, pero ojo,",
        "start": 2987.0,
        "end": 2992.0
    },
    {
        "text": " porque si ese supuesto no se cumplía todo este juez y tuvísimo, no sea,",
        "start": 2992.0,
        "end": 2997.0
    },
    {
        "text": " capaz que en vez de obtener el máximo beneficio podíamos estar calculándole a máximas pérdidas a una empresa.",
        "start": 2998.0,
        "end": 3003.0
    },
    {
        "text": " por eso eso del supuesto de los rendimientos de creciente, también lo podemos justificar,",
        "start": 3004.0,
        "end": 3009.0
    },
    {
        "text": " pero pongamos ahí una alerta de que salgo crítico, es un punto que si eso no se cumple,",
        "start": 3009.0,
        "end": 3014.0
    },
    {
        "text": " todo este otro razonamiento se nos puede caer ¿no?",
        "start": 3014.0,
        "end": 3017.0
    },
    {
        "text": " entonces vamos con un ejemplo bien sencillo a tratar de ver qué relación tiene,",
        "start": 3028.0,
        "end": 3038.0
    },
    {
        "text": " por ejemplo un aumento del salario real con la demanda de trabajo, ¿qué debería de hacer una empresa?",
        "start": 3040.0,
        "end": 3048.0
    },
    {
        "text": " y lo mismo si le aumenta la productividad marginal del trabajo",
        "start": 3049.0,
        "end": 3054.0
    },
    {
        "text": " y para eso vamos a ponernos bien sencillo,",
        "start": 3055.0,
        "end": 3059.0
    },
    {
        "text": " acá vamos a graficar la productividad marginal del trabajo y el salario real",
        "start": 3064.0,
        "end": 3068.0
    },
    {
        "text": " y si quieren sigamos jugando con estos mismos números, ¿eh?",
        "start": 3074.0,
        "end": 3079.0
    },
    {
        "text": " esta era la cantidad que tenía que contratar la empresa, se indica incluido 3 personas,",
        "start": 3080.0,
        "end": 3085.0
    },
    {
        "text": " ¿qué pasa si aumenta el salario real?",
        "start": 3086.0,
        "end": 3089.0
    },
    {
        "text": " ya no es 5 lo que hay que pagarlo porque viene dado por el mercado y el salario real ahora es 6,",
        "start": 3091.0,
        "end": 3097.0
    },
    {
        "text": " subió el salario real,",
        "start": 3100.0,
        "end": 3102.0
    },
    {
        "text": " representó graficamente para no cambiar todos los datos, no del cuadro,",
        "start": 3103.0,
        "end": 3106.0
    },
    {
        "text": " pero si quieren podemos mirar el cuadro que acabo de borrar,",
        "start": 3107.0,
        "end": 3110.0
    },
    {
        "text": " si suba el salario a 6, ¿qué pasa con Sendik?",
        "start": 3111.0,
        "end": 3115.0
    },
    {
        "text": " miremos los numeritos de Sendik que teníamos en el cuadro, ¿cuánto aporta Sendik?",
        "start": 3116.0,
        "end": 3120.0
    },
    {
        "text": " 5, ¿cuánto me cuesta?",
        "start": 3123.0,
        "end": 3125.0
    },
    {
        "text": " 6, ¿qué hacemos con Sendik?",
        "start": 3126.0,
        "end": 3128.0
    },
    {
        "text": " si suba el salario lo vamos a tener que echar porque somos empresarios racionales,",
        "start": 3129.0,
        "end": 3133.0
    },
    {
        "text": " fríos, maximizadores de beneficio, ¿qué pasa con Danilo? ¿cuánto aporta Danilo?",
        "start": 3134.0,
        "end": 3142.0
    },
    {
        "text": " 6, ¿cuánto me cuesta?",
        "start": 3144.0,
        "end": 3146.0
    },
    {
        "text": " ahora que subió el salario 6, ¿cuál es el beneficio marginal de Danilo?",
        "start": 3147.0,
        "end": 3151.0
    },
    {
        "text": " 0, ¿pero qué pasa si no lo contratamos a Danilo?",
        "start": 3152.0,
        "end": 3156.0
    },
    {
        "text": " ¿no vamos a perder de ganar esas horas anteriores?",
        "start": 3157.0,
        "end": 3160.0
    },
    {
        "text": " o sea que si suba el salario la nueva demanda va a ser esta.",
        "start": 3161.0,
        "end": 3164.0
    },
    {
        "text": " ¿qué es lo que tiene que hacer entonces una empresa ante una suba de salarios?",
        "start": 3166.0,
        "end": 3169.0
    },
    {
        "text": " reducir la demanda de trabajo.",
        "start": 3171.0,
        "end": 3174.0
    },
    {
        "text": " Ya Sendik no nos sirve, nos plantamos en Danilo, nos plantamos en menos gente.",
        "start": 3175.0,
        "end": 3180.0
    },
    {
        "text": " suba el salario real, baja la demanda de trabajo. ¿por qué?",
        "start": 3181.0,
        "end": 3186.0
    },
    {
        "text": " por este ejercicio de maximización de beneficio, no es que se enoja con los trabajadores, con el gremio,",
        "start": 3187.0,
        "end": 3193.0
    },
    {
        "text": " entonces hecha alguno, ¿no? suba el salario contra a tomenos porque es la forma que voy a obtener mis mayores beneficios.",
        "start": 3194.0,
        "end": 3199.0
    },
    {
        "text": " de la otra manera no obtendría tantos beneficios y como sigo esa elógica de maximizarlos contra a tomenos.",
        "start": 3200.0,
        "end": 3207.0
    },
    {
        "text": " bien y entonces acá que si no ponemos, como es la relación entre la evolución del salario real y la demanda de trabajo.",
        "start": 3208.0,
        "end": 3218.0
    },
    {
        "text": " invarsa o negativo, si el menos que ponemos acá quiere decir eso, cuando el salario va para un lado, para arriba, suba, aumenta como lo pusimos en esta ejemplo, tengo que contratar menos gente.",
        "start": 3218.0,
        "end": 3234.0
    },
    {
        "text": " hagamos lo mismo, pero ahora con un aumento de la productiva marginal, ¿qué quiere decir esto de que aumenta la productiva marginal?",
        "start": 3249.0,
        "end": 3258.0
    },
    {
        "text": " que ahora la columna del producto marginal o del producto total va a ser más alta que lo que teníamos originalmente, o sea que por ejemplo,",
        "start": 3259.0,
        "end": 3268.0
    },
    {
        "text": " y que se indique, ya no va a aportar sin unidades, se indique en realidad ahora va a aportar 6 unidades y danilo va a aportar más también.",
        "start": 3268.0,
        "end": 3276.0
    },
    {
        "text": " y poigar, por ejemplo, ¿cuánto aportaba poigar antes?",
        "start": 3279.0,
        "end": 3283.0
    },
    {
        "text": " 4 unidades ¿no?",
        "start": 3287.0,
        "end": 3288.0
    },
    {
        "text": " poigar antes aportaba 4, pero como nos costaba 5, ¿qué pasaba con poigar?",
        "start": 3288.0,
        "end": 3297.0
    },
    {
        "text": " no lo contrataba, ahora como por alguna razón aumentó la productividad, todos producen un poco más en ese producto marginal y poigar que antes producía 4, ahora produce 5.",
        "start": 3298.0,
        "end": 3310.0
    },
    {
        "text": " entonces pasamos a analizar de vuelta si conviene o no y que pasa con poigar, lo contratamos o no ahora, sí, por lo tanto, ¿qué va a ocurrir con la demanda de trabajo?",
        "start": 3310.0,
        "end": 3324.0
    },
    {
        "text": " ante un aumento de la productividad voy a contratar más trabajadores, mejora la productividad del trabajo, la gente, los trabajadores son más productivos,",
        "start": 3325.0,
        "end": 3337.0
    },
    {
        "text": " y eso le va a llevar a la empresa que le convenga contratar más gente porque de esa manera va a obtener más beneficios.",
        "start": 3337.0,
        "end": 3344.0
    },
    {
        "text": " parecido a lo de hoy aunque con otro, con otro razonamiento, no es que les pago que contratas más gente para premiarlos porque son más productivos, ¿no?",
        "start": 3347.0,
        "end": 3356.0
    },
    {
        "text": " contratos más gente porque son más productivos y eso me lleva a ganar más beneficios, nos estamos acá con un empresario que hace beneficiencia o se porta bien con los trabajadores,",
        "start": 3356.0,
        "end": 3365.0
    },
    {
        "text": " estamos con un empresario que busca los máximos beneficios, entonces si son más productivos esos trabajadores, voy a contratar más.",
        "start": 3366.0,
        "end": 3373.0
    },
    {
        "text": " relación entonces que las vamos acá en esta forma de resumir las ideas que venimos trabajando, una relación directa,",
        "start": 3373.0,
        "end": 3382.0
    },
    {
        "text": " a mayor productividad, mayor demanda de trabajo.",
        "start": 3384.0,
        "end": 3391.0
    },
    {
        "text": " bien",
        "start": 3393.0,
        "end": 3395.0
    },
    {
        "text": " la productividad también la podíamos ver en este cuadro, ¿no?",
        "start": 3395.0,
        "end": 3403.0
    },
    {
        "text": " si nosotros acá teníamos, por ejemplo, el caso de Sendik, ¿qué número debería de poner acá si contratos tres personas?",
        "start": 3404.0,
        "end": 3417.0
    },
    {
        "text": " esto de acá nos representa la función de producción, en este eje tengo la cantidad de gente que contratos,",
        "start": 3417.0,
        "end": 3427.0
    },
    {
        "text": " vamos a partir del dato inicial que decíamos que 3 era la cantidad que debíamos contratar y acá que es lo que representa.",
        "start": 3428.0,
        "end": 3434.0
    },
    {
        "text": " la producción de Sendik, marginal, total, o sea que el número que debería poner acá cuál es, 18 y jero,",
        "start": 3435.0,
        "end": 3446.0
    },
    {
        "text": " si yo quiero representar que aumenta la productividad, ¿cómo hago en ese gráfico para representar que aumenta la productividad?",
        "start": 3448.0,
        "end": 3456.0
    },
    {
        "text": " con Sendik, con tres empleados, debería representar acá arriba, ¿verdad?",
        "start": 3457.0,
        "end": 3465.0
    },
    {
        "text": " por ejemplo un 20 por decir algo, que con tres personas ahora se logre producir más, o sea que tenemos lo que la clase anterior habíamos visto,",
        "start": 3466.0,
        "end": 3474.0
    },
    {
        "text": " que es una especie de desplazamiento a otra función, a una cubrima, ¿no?",
        "start": 3475.0,
        "end": 3480.0
    },
    {
        "text": " pero si es otra función, algo tiene que haber cambiado, ¿sí?",
        "start": 3481.0,
        "end": 3488.0
    },
    {
        "text": " entonces ¿cómo se puede lograr un aumento de la productividad marginal del trabajo?",
        "start": 3489.0,
        "end": 3493.0
    },
    {
        "text": " de qué manera podemos lograr que aumenta la productividad del trabajo y básicamente está definido porque hay uno de estos haya aumentado?",
        "start": 3494.0,
        "end": 3503.0
    },
    {
        "text": " con lo cual, esta relación que tenemos acá de la productividad marginal con la demanda de trabajo,",
        "start": 3504.0,
        "end": 3511.0
    },
    {
        "text": " a su vez podríamos decir que esta productividad es una función de la cantidad del estado de capital, recurso naturales y tecnología",
        "start": 3512.0,
        "end": 3521.0
    },
    {
        "text": " y también tenemos una relación positivo.",
        "start": 3522.0,
        "end": 3524.0
    },
    {
        "text": " a más de esos tres factores productivos, la misma gente va a poder lograr mayor producción y esos productividad, esos más productividad",
        "start": 3525.0,
        "end": 3534.0
    },
    {
        "text": " generalmente como pensamos la mejora de la productividad es por un cambio técnico, una innovación y eso no lleva que bueno con lo mismo producimos más",
        "start": 3535.0,
        "end": 3544.0
    },
    {
        "text": " pero bueno, también puede ser con estos dos otros factores productivos, que con más maquinarias, la misma cantidad de gente pueda producir más",
        "start": 3545.0,
        "end": 3552.0
    },
    {
        "text": " o con más recursos naturales o mejores pueda producir más.",
        "start": 3552.0,
        "end": 3556.0
    },
    {
        "text": " entonces indirectamente la demanda de trabajo se ve afectada a través de la productividad por eso lo indirectamente por estos factores productivos.",
        "start": 3557.0,
        "end": 3566.0
    },
    {
        "text": " bien, hay una consulta hasta ahora",
        "start": 3574.0,
        "end": 3578.0
    },
    {
        "text": " y ahora vamos a ver si esta persona está en la dirección de la productividad de trabajo, si esta persona está en la dirección de la productividad de trabajo,",
        "start": 3582.0,
        "end": 3589.0
    },
    {
        "text": " si esta persona está en la dirección de la productividad de trabajo, si esta persona está en la dirección de la productividad de trabajo,",
        "start": 3590.0,
        "end": 3597.0
    },
    {
        "text": " si esta persona está en la dirección de la productividad de trabajo, si esta persona está en la dirección de la productividad de trabajo,",
        "start": 3598.0,
        "end": 3604.0
    },
    {
        "text": " si esta persona está en la dirección de la productividad de trabajo, si esta persona está en la dirección de la productividad de trabajo,",
        "start": 3605.0,
        "end": 3609.0
    },
    {
        "text": " si esta persona está en la dirección de la productividad de trabajo, si esta persona está en la dirección de la productividad de trabajo,",
        "start": 3609.0,
        "end": 3615.0
    },
    {
        "text": " si acá quisieramos también para terminar, hacer los dos resumenes iguales, si acá me ha dado un gráfico para representar la relación entre la demanda de trabajo y el salario para utilizar el mismo EG,",
        "start": 3616.0,
        "end": 3628.0
    },
    {
        "text": " lo que obtengo acá es esta relación inversa ¿verdad?",
        "start": 3629.0,
        "end": 3632.0
    },
    {
        "text": " y esto le llamó la curva así como acá le llamaba la oferta de trabajo, a esto le llamó la demanda de trabajo.",
        "start": 3632.0,
        "end": 3640.0
    },
    {
        "text": " Eficiense que la demanda de trabajo en estos ejercicios que hemos hecho, por ejemplo acá cuando había subido el salario,",
        "start": 3641.0,
        "end": 3647.0
    },
    {
        "text": " era que me voy de este punto, este punto, este punto de corte entre salario que tenía y la productividad y este punto de corte entre salario y la productividad,",
        "start": 3648.0,
        "end": 3655.0
    },
    {
        "text": " o sea que la curva que ella demanda de trabajo es esta, esta es la curva de demanda de trabajo.",
        "start": 3655.0,
        "end": 3662.0
    },
    {
        "text": " Y este concepto de que la demanda de trabajo depende de la productividad es un elemento importante que ahora en tu prato vamos a retomar.",
        "start": 3663.0,
        "end": 3671.0
    },
    {
        "text": " Bien, porque ahora sí nos vamos a meter en el análisis del mercado de trabajo.",
        "start": 3672.0,
        "end": 3681.0
    },
    {
        "text": " Como todo el mercado lo que poníamos en los ejes era precio y cantidad, como acá vamos a representar el mercado de trabajo en este eje tenemos precio del trabajo,",
        "start": 3685.0,
        "end": 3703.0
    },
    {
        "text": " el salario real porque pensamos en términos reales para evitar la ilusión que monetaria que hablábamos la otra vez.",
        "start": 3704.0,
        "end": 3710.0
    },
    {
        "text": " La cantidad de trabajadores, en un caso va a ser la demanda de trabajo que la representamos con esta pendiente negativa por lo que ya hablamos y en otro caso la oferta de trabajo que si quiere le da muy la curva esa que pega la vuelta pero que no va a monalizar la parte de la pegada de vuelta, que es la oferta de trabajo.",
        "start": 3710.0,
        "end": 3731.0
    },
    {
        "text": " Cada una con sus explicaciones detrás que fue lo que estuvimos manejando hasta hoy, pero que en términos de resumen con esto utilizar una herramienta gráfica nos permite fácilmente ver cómo son las relaciones entre uno y otro y además sacar algunas otras cuestiones de conceptos que podemos analizar ahí.",
        "start": 3732.0,
        "end": 3751.0
    },
    {
        "text": " Bien, estamos entonces en el camino de lo que habíamos hablado hoy de que ya terminamos estos dos por separado y estamos en condiciones de ver cómo juegan estos dos juntos a la hora de saber quién es este L que yo pongo acá.",
        "start": 3752.0,
        "end": 3766.0
    },
    {
        "text": " Entonces cuando uno va al mercado de trabajo y tiene una curva de pendiente negativa y tiene otra que es de pendiente positiva, lo primero que surge es que los ojos se nos van al punto de corque.",
        "start": 3767.0,
        "end": 3780.0
    },
    {
        "text": " Y a este punto de corte vamos a llamarle que es el salario real de equilibrio y que acá tenemos lo que se denomina un nivel de plenombre.",
        "start": 3781.0,
        "end": 3798.0
    },
    {
        "text": " O sea, si estamos en un mercado de trabajo donde el salario es el equilibrio, entonces la oferta de trabajo y la cantidad de gente que quiere trabajar coincide con la cantidad de puestos de trabajo que las empresas precisan.",
        "start": 3799.0,
        "end": 3820.0
    },
    {
        "text": " Y a eso le llamamos el nivel de pleno empleo.",
        "start": 3821.0,
        "end": 3825.0
    },
    {
        "text": " Si le ponemos números para el caso uruguayo, bueno, tenemos que si el salario real es ese, es el equilibrio, tenemos que hay un millón y medio de personas que quieren trabajar y hay un millón y medio de puestos de trabajo.",
        "start": 3828.0,
        "end": 3848.0
    },
    {
        "text": " Como coincide ese número, a eso se le llama una situación de equilibrio o de pleno empleo.",
        "start": 3848.0,
        "end": 3855.0
    },
    {
        "text": " Hay puestos de trabajo para la cantidad de gente que quiere trabajar.",
        "start": 3856.0,
        "end": 3860.0
    },
    {
        "text": " Sí? Pero hay otras situaciones.",
        "start": 3860.0,
        "end": 3864.0
    },
    {
        "text": " Podemos tener una situación, por ejemplo, donde el salario real sea el uno este que le vamos a llamar que es inferior al pleno empleo.",
        "start": 3865.0,
        "end": 3876.0
    },
    {
        "text": " Sí?",
        "start": 3877.0,
        "end": 3879.0
    },
    {
        "text": " Y si es inferior al pleno empleo, podemos razonarlo así si quieren para interpretar y para repasar alguna cosa.",
        "start": 3882.0,
        "end": 3890.0
    },
    {
        "text": " Supongamos que por alguna razón baja el salario. Estábamos en ese equilibrio y bajo el salario.",
        "start": 3890.0,
        "end": 3897.0
    },
    {
        "text": " Pensemos en estos dos. En los agentes económicos por separado. ¿Qué hacen las personas cuando baja el salario?",
        "start": 3898.0,
        "end": 3908.0
    },
    {
        "text": " Si les baja el salario, ¿qué decisión toma?",
        "start": 3908.0,
        "end": 3912.0
    },
    {
        "text": " Trabajar menos horas, ofrecer menos horas, ofrecer más horas. ¿Cómo era el razonamiento que hacíamos?",
        "start": 3912.0,
        "end": 3919.0
    },
    {
        "text": " Si baja el salario, relación directa con la oferta de trabajo. Por más que estaba aquello el efecto sustitución,",
        "start": 3928.0,
        "end": 3936.0
    },
    {
        "text": " pesa más que a menor salario me voy, redujo horas de trabajo en el mercado.",
        "start": 3937.0,
        "end": 3943.0
    },
    {
        "text": " Entonces acá yo tengo un millón, 480 mil personas. Y esto de acá es, voy el salario, está el acurvado falta, tengo la oferta de trabajo.",
        "start": 3943.0,
        "end": 3956.0
    },
    {
        "text": " ¿Qué pasó con 20 mil personas ahí?",
        "start": 3958.0,
        "end": 3961.0
    },
    {
        "text": " Dejaron de trabajar, están estudiando más, están durmiendo más, lo que sea, pero no quieren participar ya del mercado de trabajo.",
        "start": 3962.0,
        "end": 3973.0
    },
    {
        "text": " Y si baja el salario, ¿qué hacen las empresas? ¿Cuál es la decisión que deberían de tomar las empresas?",
        "start": 3977.0,
        "end": 3983.0
    },
    {
        "text": " Si baja el salario y tenemos que estar relacionado inversamente por esto de la maximización de beneficios.",
        "start": 3983.0,
        "end": 3990.0
    },
    {
        "text": " Van a querer contratar más gente.",
        "start": 3991.0,
        "end": 3995.0
    },
    {
        "text": " Y por eso, a un salario menor tenemos que hay más demanda de trabajo, que las empresas van a quedar 100 mil puestos de trabajo más,",
        "start": 4009.0,
        "end": 4018.0
    },
    {
        "text": " que lo que tenían antes que bajar al salario.",
        "start": 4019.0,
        "end": 4022.0
    },
    {
        "text": " Entonces ¿cómo podemos caracterizar esta situación?",
        "start": 4022.0,
        "end": 4027.0
    },
    {
        "text": " Que si el salario es menor al equilibrio, ¿cómo es la oferta con respecto a la demanda de trabajo?",
        "start": 4027.0,
        "end": 4033.0
    },
    {
        "text": " Menor.",
        "start": 4035.0,
        "end": 4036.0
    },
    {
        "text": " Y a esta situación se le denomina una situación de exceso de demanda de trabajo.",
        "start": 4037.0,
        "end": 4048.0
    },
    {
        "text": " Esta diferencia de acá entre la demanda y la oferta que decimos que son 100 mil puestos de trabajo,",
        "start": 4048.0,
        "end": 4060.0
    },
    {
        "text": " eso es un exceso de demanda de trabajo. Son puestos de trabajo que las empresas precisan, pero que no hay tanta gente para ocupar.",
        "start": 4061.0,
        "end": 4070.0
    },
    {
        "text": " No hay gente interesada porque el salario es bajo.",
        "start": 4071.0,
        "end": 4074.0
    },
    {
        "text": " Y entonces excesas empresas, ¿por qué querían contratar gente?",
        "start": 4075.0,
        "end": 4078.0
    },
    {
        "text": " Para producir y obtener beneficios. Pero hay algunas que no consiguen la gente.",
        "start": 4081.0,
        "end": 4086.0
    },
    {
        "text": " Entonces ¿qué pasa con lo que pensaban producir? No lo pueden hacer y ¿qué pasa con los beneficios que pensaban tener?",
        "start": 4087.0,
        "end": 4093.0
    },
    {
        "text": " No lo van a tener. ¿Y entonces ¿qué pasa con esas empresas?",
        "start": 4093.0,
        "end": 4097.0
    },
    {
        "text": " Si erran, se van, se dicen, ¿taba bueno, no es mi negocio?",
        "start": 4098.0,
        "end": 4101.0
    },
    {
        "text": " Me voy, me voy del país, me pongo a ser trabajador. ¿Qué puede haberse incentivado hacer un empresario si está buscando gente y no la consigue?",
        "start": 4103.0,
        "end": 4110.0
    },
    {
        "text": " Y paga un poco más, si no está consiguiendo gente, deja de quejarte y paga un poco más.",
        "start": 4111.0,
        "end": 4118.0
    },
    {
        "text": " El trabajador se va a quejar, se va a oponer a que pasa eso a que los empresarios paga más.",
        "start": 4119.0,
        "end": 4127.0
    },
    {
        "text": " Entonces una situación de exceso de demanda de trabajo podemos decir que va a llevar a que aumenta el salario.",
        "start": 4128.0,
        "end": 4135.0
    },
    {
        "text": " Si, la situación en el gráfico como para razonar este desequilibrio, bueno llegamos a eso.",
        "start": 4136.0,
        "end": 4145.0
    },
    {
        "text": " Ahora lo que estamos diciendo ahora es esto va a perdurar en el tiempo y no parecería porque eso les genera un perjuicio, un empresario,",
        "start": 4146.0,
        "end": 4154.0
    },
    {
        "text": " entonces el empresario va a poder querer pagar un poco más.",
        "start": 4155.0,
        "end": 4159.0
    },
    {
        "text": " El empresario quiere pagar un poco más, el trabajador no se opone y bueno el salario va a subir entonces.",
        "start": 4159.0,
        "end": 4165.0
    },
    {
        "text": " Y además fíjense que cuando suba el salario, ¿qué pasa con la oferta de trabajo?",
        "start": 4166.0,
        "end": 4170.0
    },
    {
        "text": " Si pagan un poco más y va a haber gente que va a volver al mercado de trabajo.",
        "start": 4171.0,
        "end": 4176.0
    },
    {
        "text": " Entonces el problema que había que era poca oferta y bueno a través de este incentivo, ¿sí? Estos son los empresarios.",
        "start": 4177.0,
        "end": 4185.0
    },
    {
        "text": " Están dispuestos entonces a pagar más. Eso nos aumenta la cantidad de gente y a su vez hace que algunas empresas contraten menos.",
        "start": 4185.0,
        "end": 4196.0
    },
    {
        "text": " Y esto no lleva hacia el pleno pleno.",
        "start": 4197.0,
        "end": 4202.0
    },
    {
        "text": " O sea que en una situación donde hay exceso de manda de trabajo, donde el salario es muy bajo, menor al equilibrio, van a pasar cosas motivadas por este agente económico que es el principal perjudicado acá, va a pagar más, se cierra la diferencia.",
        "start": 4203.0,
        "end": 4222.0
    },
    {
        "text": " Sí? Segunda situación, tercera, perdón. Tenemos un salario real que es mayor al equilibrio.",
        "start": 4223.0,
        "end": 4236.0
    },
    {
        "text": " Salario real subdós. ¿Qué ocurre en este caso? ¿Quién es este de acá?",
        "start": 4237.0,
        "end": 4252.0
    },
    {
        "text": " ¿Quién es el 1.491? ¿Demanda de trabajo? ¿Sí? Es un salario curva de manda. ¿Es? ¿Lo podemos razonar si estamos en la de equilibrio?",
        "start": 4252.0,
        "end": 4281.0
    },
    {
        "text": " ¿Y sube el salario? Lo que dijimos recién va a haber menos empresario dispuestos a contratar por la lógica de la moncinización de beneficios.",
        "start": 4281.0,
        "end": 4289.0
    },
    {
        "text": " Pero si sube el salario va a aparecer más gente y oferta de trabajo un millón 550 mil personas. ¿Qué pasó en la sierra un 50 mil persona? ¿Por qué sube el salario?",
        "start": 4289.0,
        "end": 4310.0
    },
    {
        "text": " A eso se le llama baby boom, con salarios, marcado de trabajo que tienen salarios atractivos, no es al otro día, pero aumenta la población.",
        "start": 4310.0,
        "end": 4322.0
    },
    {
        "text": " Pero no es este caso, ¿no? ¿De dónde salieron esas 50 mil personas?",
        "start": 4322.0,
        "end": 4327.0
    },
    {
        "text": " De la casa, dieron que en el mercado se paga más, dijeron quearme en mi casa salía más caro.",
        "start": 4328.0,
        "end": 4336.0
    },
    {
        "text": " Entonces tenemos una situación donde ahora cómo es la oferta con respecto a la de manda. ¿Quién es mayor ahora?",
        "start": 4336.0,
        "end": 4346.0
    },
    {
        "text": " La oferta y a este exceso a esta cantidad de gente que es 60 mil personas, ¿no? 60 mil personas. ¿Cómo le llamamos? ¿Qué son esas 60 mil personas?",
        "start": 4347.0,
        "end": 4366.0
    },
    {
        "text": " Hay un millón 550 que quieren trabajar, que se ofrecen al mercado de trabajo. Y hay un millón 490 que son los puestos de trabajo que las empresas quieren completar.",
        "start": 4367.0,
        "end": 4380.0
    },
    {
        "text": " Hay 60 mil que desempleados, personas que quieren trabajar, pero que no hay puestos para ellos. O sea, que esto de acá se le denomina desempleo.",
        "start": 4380.0,
        "end": 4392.0
    },
    {
        "text": " Entonces ahí completamos los tres tipos de situaciones que puede tener un mercado de trabajo con esta lógica agregada de ver oferta y demanda.",
        "start": 4393.0,
        "end": 4410.0
    },
    {
        "text": " Y donde hay una variable clave, que es el salario que estaba determinando no salas dos, y que ese salario puede ser este equilibrio.",
        "start": 4411.0,
        "end": 4418.0
    },
    {
        "text": " Y entonces las dos ofertes de manda, coïcide, puede ser uno inferior y tenemos exceso de demanda de trabajo o un salario superior al equilibrio y tenemos desempleo.",
        "start": 4418.0,
        "end": 4429.0
    },
    {
        "text": " Pensemos en lo mismo que hoy, tenemos la situación, quien se ve perjudicado ante esta situación entre los dos agentes económicos que estamos manejando.",
        "start": 4430.0,
        "end": 4440.0
    },
    {
        "text": " Empresarios o trabajadores.",
        "start": 4440.0,
        "end": 4444.0
    },
    {
        "text": " Trabajadores, ¿por qué? Porque hay 60 mil que quieren trabajar, que quieren ir a su casa y no logra.",
        "start": 4445.0,
        "end": 4452.0
    },
    {
        "text": " Y si no logra en ingreso, no logra en trabajar, no logra en ingreso, no van a poder comprar las bienes y servicios para su necesidad de material.",
        "start": 4452.0,
        "end": 4460.0
    },
    {
        "text": " Y entonces esos 60 mil que podrían estar dispuestos, que incentivo podrían tener. Así como decíamos las empresas que no consiguen la gente, tienen incentivo apagar más.",
        "start": 4460.0,
        "end": 4470.0
    },
    {
        "text": " El trabajador, acá, que no consigue trabajo, tiene incentivo a qué podríamos decir.",
        "start": 4470.0,
        "end": 4476.0
    },
    {
        "text": " Aceptar un salario menor. Entonces podríamos decir que las personas, los trabajadores, estén dispuestos a bajar el salario real.",
        "start": 4476.0,
        "end": 4493.0
    },
    {
        "text": " Y bajando el salario real, se nos cerraría la brecha de esto. Porque habría menos gente que quiere trabajar, porque bajo el salario, y habría más demanda y iríamos hacia el clara de empleo.",
        "start": 4493.0,
        "end": 4512.0
    },
    {
        "text": " Entonces, con esta mirada de mercado de trabajo, no puede decir, tengo tres situaciones, unas de equilibrio y si hay equilibrio, no hay incentivos, nadie va a querer hacer nada para cambiar esa situación.",
        "start": 4524.0,
        "end": 4537.0
    },
    {
        "text": " Si tengo acceso de manda a los empresarios, son los que van a querer hacer algo y vamos volveríamos al equilibrio. Y si hay desempleo, van a ser los trabajadores los que están dispuestos a cobrar menos y iríamos hacia el penampleo.",
        "start": 4537.0,
        "end": 4549.0
    },
    {
        "text": " ¿Cuál es estas tres situaciones, en la que generalmente uno encuentra en los países?",
        "start": 4550.0,
        "end": 4557.0
    },
    {
        "text": " Exceso de manda.",
        "start": 4558.0,
        "end": 4561.0
    },
    {
        "text": " ¿Equilibrio?",
        "start": 4562.0,
        "end": 4566.0
    },
    {
        "text": " ¿La tasa de desempleo? ¿Cómo es acá?",
        "start": 4567.0,
        "end": 4570.0
    },
    {
        "text": " El indicador de tasa de desempleo que vieron en desquintivo.",
        "start": 4570.0,
        "end": 4575.0
    },
    {
        "text": " Nula, porque todo el mundo quiere trabajar esta trabajando. ¿Cuándo estamos en equilibrio?",
        "start": 4575.0,
        "end": 4580.0
    },
    {
        "text": " También, ¿cuándo estamos acá?",
        "start": 4581.0,
        "end": 4584.0
    },
    {
        "text": " Hay algo de desempleo, ¿no? ¿Cómo se calculaba? Desempleados, 60 mil, dividido que.",
        "start": 4585.0,
        "end": 4591.0
    },
    {
        "text": " Y la pea. Entonces, ahí tenemos lo que hoy en Uruguay existe, que es una tasa de desempleo de impongamos el 8%.",
        "start": 4593.0,
        "end": 4604.0
    },
    {
        "text": " En los países, entonces lo que generalmente uno observa es que hay algo de desempleo.",
        "start": 4605.0,
        "end": 4611.0
    },
    {
        "text": " Capacán estamos acá, capacán más arriba, un poquito más abajo, pero hay desempleo.",
        "start": 4611.0,
        "end": 4616.0
    },
    {
        "text": " O sea que las situaciones que se dan son estas. Por lo tanto, esto es lo que generalmente uno observa en los países.",
        "start": 4616.0,
        "end": 4625.0
    },
    {
        "text": " Y por lo tanto, hay algo que está impidiendo esto, porque si estas son las situaciones que uno encuentran los países",
        "start": 4626.0,
        "end": 4634.0
    },
    {
        "text": " y decimos que entonces bajando el salario se solucionaría, pero encontramos que en los países no hay, no estamos en equilibrio,",
        "start": 4634.0,
        "end": 4640.0
    },
    {
        "text": " sino que seguimos dando esto. Esto enfrenta restricciones,",
        "start": 4640.0,
        "end": 4651.0
    },
    {
        "text": " opongamos este ajuste, en frente a restricciones. ¿Qué pasa si hoy tenemos 8% de desempleo en Uruguay?",
        "start": 4651.0,
        "end": 4666.0
    },
    {
        "text": " Nos gustó esto que acabamos de hacer, curvita, vacaba, allá, desequilibrio, miro, concluyo.",
        "start": 4666.0,
        "end": 4672.0
    },
    {
        "text": " Agarramos en balaje, hacemos unas pancarta y nos vamos para el edificio de presidencia, diciendo que tenemos la solución,",
        "start": 4673.0,
        "end": 4682.0
    },
    {
        "text": " no me nombre a mí por la duda, tenemos la solución al desempleo que es bajar el salario real y salimos acá cantando todo por la rambla presiosa.",
        "start": 4682.0,
        "end": 4691.0
    },
    {
        "text": " Llegamos a presidencia al edificio, ¿eh? ¿Quién nos puede interceptar en el camino? ¿Por qué no esté de acuerdo con esto?",
        "start": 4692.0,
        "end": 4703.0
    },
    {
        "text": " ¿Quién es el que estaban incentivados a esto? ¿Cuántos? 60 mil y acá ¿cuántos tenemos?",
        "start": 4706.0,
        "end": 4719.0
    },
    {
        "text": " 1,490 mil, 1,490 mil, ¿ván a estar de acuerdo con esto? No, entonces hay algunas cuestiones que funcionan en los países,",
        "start": 4722.0,
        "end": 4739.0
    },
    {
        "text": " que por ejemplo el tema de los sindicatos que penean por los trabajadores, entonces no van a querer que la solución se dé por una baja de salario.",
        "start": 4739.0,
        "end": 4750.0
    },
    {
        "text": " ¿Sí? Entonces acá tenemos algo que va por el lado de los trabajadores que va a impedir que se ajuste ese des, pero también podríamos hablar que se da por el lado del estado.",
        "start": 4750.0,
        "end": 4763.0
    },
    {
        "text": " Por ejemplo a través de los salarios mínimos nacionales, nosotros qué es lo que estamos hablando acá, que queremos que baje el salario para que venga este valor porque ha cao fuerte a si vuela de manda.",
        "start": 4765.0,
        "end": 4777.0
    },
    {
        "text": " Ahora, ¿qué es el salario? Nos permite llegar a fin y en vez ese que equilibrio a fuerte a manda. Esto es un concepto de salario de equilibrio, pero de equilibrio haciendo alusión a que equilibrio es oferta igual de manda.",
        "start": 4777.0,
        "end": 4796.0
    },
    {
        "text": " ¿A paz que el estado definió que el salario mínimo está acá? ¿Por qué? Porque análisis no es oferta igual de manda, sino que el estado hizo un análisis de que el sueldo que permite comprar una canasta digna y solos cálculo y está carribo.",
        "start": 4796.0,
        "end": 4813.0
    },
    {
        "text": " Entonces, nos vamos a venir a una situación de equilibrio porque hay una ley que dice que menos esto no se puede pagar. Entonces, es esa es otra de los impedimentos porque este salario acá de vuelta no nos dice nada acerca de si está bueno o malo si llegamos a fin de mes, si es mínimo, si es máximo, no dice nada.",
        "start": 4813.0,
        "end": 4830.0
    },
    {
        "text": " Solo dice oferta igual de manda. Entonces, tenemos que este ajuste no se va a dar porque hay trabajadores que van a impedirlo, porque hay un estado que va a impedirlo, porque hay acuerdos salariales, donde tenemos a trabajadores, tenemos a empresarios y tenemos al estado en Uruguay hoy, con los consejos de salario,",
        "start": 4830.0,
        "end": 4855.0
    },
    {
        "text": " que también si hay una negociación y se pusieron de acuerdo en determinado salario, por más que estemos por acá arriba y allá de ese empleo, ese salario no va a bajar hasta acá, porque ya acordamos, firmamos, que de acá dos años el salario se va a mantener acá.",
        "start": 4855.0,
        "end": 4871.0
    },
    {
        "text": " Entonces, por más que acá veamos que hay algunos, estos 60 mil que tienen ese incentivo no se va a dar, ahí algo acordado.",
        "start": 4871.0,
        "end": 4880.0
    },
    {
        "text": " Y hay una cuarta que tiene solo a los empresarios, que es lo que se denominan los salarios de eficiencia, ¿por qué a un empresario a una empresa le puede convenir pagar altos salarios y no bajos salarios?",
        "start": 4880.0,
        "end": 4900.0
    },
    {
        "text": " Si yo le pago muy bien a alguien, yo como empresario, ¿qué podría pensar que va a ocurrir? ¿Qué incentivo que señal estoy dando si pago un buen salario, un salario mayor al el promedio del mercado?",
        "start": 4900.0,
        "end": 4927.0
    },
    {
        "text": " ¿Qué si esa persona hace algo mal? Yo la voy a echar y a dónde va a ir, a ganar un salario promedio que está por debajo.",
        "start": 4928.0,
        "end": 4938.0
    },
    {
        "text": " Entonces, esos pagos de salario superiores en algunas empresas, no estamos hablando de ese en todo lado, pero salarios altos, justamente algunas empresas les conviene tenerlo para tener más incentiva, más motivada de evitar rotación, por ejemplo,",
        "start": 4938.0,
        "end": 4953.0
    },
    {
        "text": " que se vaya gente en determinados puestos clavos. Por lo tanto esto, aunque con menor peso, no, o relativo respecto a las otras medidas, también opera o también es identificado como una restricción para que esto pase.",
        "start": 4953.0,
        "end": 4967.0
    },
    {
        "text": " Entonces, solución que podíamos pensar por este lado para resolver ese problema del desempleo de esa gente, no la encontramos.",
        "start": 4968.0,
        "end": 4980.0
    },
    {
        "text": " No hay solución, entonces, tratemos de mirar en ese gráfico, si vamos a hacerlo acá, aunque se van a suciar un poco, pero tratemos de verlo en este gráfico, ¿cómo podríamos solucionar el desempleo?",
        "start": 4981.0,
        "end": 4999.0
    },
    {
        "text": " Ya vimos que bajando el salario, se abajando la variable de este eje, no lo vamos a poder hacerlo.",
        "start": 5000.0,
        "end": 5010.0
    },
    {
        "text": " Tengo una análisis gráfico con curvas de oferta y demanda, pensemos en las curvas, si tuviera que correr alguna de las curvas, por ejemplo arranquemos con la de oferta.",
        "start": 5011.0,
        "end": 5027.0
    },
    {
        "text": " ¿Qué haría? Yo sé que a este salario hay un millón, 550 mil personas que quieren trabajar. ¿Qué pases si traigo inmigrantes, por ejemplo?",
        "start": 5028.0,
        "end": 5040.0
    },
    {
        "text": " Si como quiero solucionar esta situación de desempleo se me ocurre, vamos a traer más sirios, hay uno más de aguantar, amóloqueceo, gente del exterior, que venga orgullo ahí a trabajar. ¿Cómo lo representamos hoy?",
        "start": 5040.0,
        "end": 5053.0
    },
    {
        "text": " Assumamos que el salario no varía, ¿cómo represento la curva de oferta si hay cuando son 40 más, 40 mil antes más?",
        "start": 5057.0,
        "end": 5066.0
    },
    {
        "text": " Y voy a tener una curva de oferta y va a pasar por acá ¿no? ¿Y qué pasa con el desempleo?",
        "start": 5069.0,
        "end": 5074.0
    },
    {
        "text": " ¿Eh? Y ahí me va a aumentar ¿no? O sea que en realidad por la inmigración no debería de pensar la solución del desempleo, debería de pensarlo por algo que me corrirá esta curva para acá ¿no?",
        "start": 5075.0,
        "end": 5091.0
    },
    {
        "text": " Y ahí sí, si yo hago de alguna manera algo para que la curva de oferta para este salario en vez de haber un millón, 550 mil haya un millón, 490 mil, si hago algo en ese sentido voy a solucionar el desempleo.",
        "start": 5092.0,
        "end": 5108.0
    },
    {
        "text": " Por ejemplo ¿qué pasa si compramos 60 mil tickets de avión de hída no más?",
        "start": 5110.0,
        "end": 5118.0
    },
    {
        "text": " Tí que es de hída, Europa, Estados Unidos, varíamos, 20 mil para un lado, 30 para otro, cambiamos.",
        "start": 5121.0,
        "end": 5129.0
    },
    {
        "text": " Solucionamos el desempleo. Hay 60 mil, se lo damos gente que estaba buscando de gallito ¿no? No es lo que recuerde que acá esto es la pea ¿no?",
        "start": 5130.0,
        "end": 5140.0
    },
    {
        "text": " Estos son los activos, o sea acá tenemos 3 millones de habitantes, pero estamos hablando de que a este salario había 1,550 mil.",
        "start": 5141.0,
        "end": 5150.0
    },
    {
        "text": " Si yo le obron entonces que la curva de oferta se me venga para el izquierda, soluciono el problema.",
        "start": 5150.0,
        "end": 5157.0
    },
    {
        "text": " Pero no parecería ser una atractiva medida de política para solucionar el desempleo ¿no?",
        "start": 5157.0,
        "end": 5164.0
    },
    {
        "text": " Entonces si la curva oferta, corregla la derecha, no no solucionaba sino que empeoraba, corregla la izquierda, la podemos solucionar pero no parece tan ético esto, pensemos por la otra curva.",
        "start": 5165.0,
        "end": 5180.0
    },
    {
        "text": " Por este lado parece que no vamos a encontrar la solucion.",
        "start": 5180.0,
        "end": 5183.0
    },
    {
        "text": " Y con la otra curva que tenemos que hacer, para donde habría que corrarla si queremos solucionar el desempleo, deberíamos corrarla la derecha y si queremos ir hasta el pleno empleo ¿qué justo pasara por ahí?",
        "start": 5184.0,
        "end": 5201.0
    },
    {
        "text": " ¿Y cómo hacemos para correr esa curva a la derecha?",
        "start": 5202.0,
        "end": 5206.0
    },
    {
        "text": " ¿Qué es lo que estamos diciendo que a este salario, en vez de demandar 1,490 mil que las empresas demanden 1,550 mil.",
        "start": 5211.0,
        "end": 5222.0
    },
    {
        "text": " Me voy a la demanda de trabajo y digo bueno yo quiero que este número acasi a más grande.",
        "start": 5223.0,
        "end": 5228.0
    },
    {
        "text": " Yo quiero lograr, si yo tengo consalario real su 2, tengo que acá hay 1,490 mil personas que precisan las empresas,",
        "start": 5229.0,
        "end": 5244.0
    },
    {
        "text": " yo quiero que a este mismo salario esto me aumenta 1,550, o sea quiero aumentar acá, pero mantengo esto acá ¿qué tendría que hacer?",
        "start": 5244.0,
        "end": 5256.0
    },
    {
        "text": " Aumentar acá, hacer algo por el lado de la productividad y hacer algo que lo aumenta,",
        "start": 5257.0,
        "end": 5264.0
    },
    {
        "text": " se ha invertido en más capital físico, en fomentar mayores o mejor uso de los recursos naturales y fomentar mejoras tecnológicas.",
        "start": 5265.0,
        "end": 5278.0
    },
    {
        "text": " Entonces cualquiera de esos, en esta lógica macro nos va a aumentar la productividad del trabajo y esa productividad directamente va a ser que haya más",
        "start": 5279.0,
        "end": 5291.0
    },
    {
        "text": " puestos de trabajo que las empresas presiden cubrir por la lógica de maximizar el dinero y ahí sí parecería que eso no es ningún problema, o sea el problema de esto déctico que decíamos ¿no?",
        "start": 5292.0,
        "end": 5304.0
    },
    {
        "text": " Estaría bueno y generalmente por ahí es que pasan las medidas de querer solucionar el desempleo ¿sí?",
        "start": 5304.0,
        "end": 5314.0
    },
    {
        "text": " ¿sí?",
        "start": 5314.0,
        "end": 5315.0
    },
    {
        "text": " ¿qué ha claro?",
        "start": 5320.0,
        "end": 5321.0
    },
    {
        "text": " Una última cosa del mercado de trabajo, que esto se separa un poco en el material bibliográfico que no estaba tan detallado pero que últimamente le damos bastante bolilla y así aparecen las preguntas.",
        "start": 5324.0,
        "end": 5339.0
    },
    {
        "text": " Digimos, estás al desempleo 8% para tener un guarismo ahí referido a Uruguay. Ahora esto es gente decimos que está buscando trabajo y que no lo encuentro.",
        "start": 5340.0,
        "end": 5351.0
    },
    {
        "text": " Ahora ¿por qué? ¿cuál es pensemos en términos de causas? No tanto en descriptivos sino de causas, ¿por qué puede haber gente que no encuentre trabajo?",
        "start": 5352.0,
        "end": 5360.0
    },
    {
        "text": " Y ahí aparece una parte del desempleo que es la que se denomina el desempleo cíclico y pongamos el E que de esos 8 puntos de desempleo hay 3 que refieren a esto.",
        "start": 5360.0,
        "end": 5371.0
    },
    {
        "text": " ¿qué es el desempleo cíclico y está asociado al ciclo del economía?",
        "start": 5375.0,
        "end": 5379.0
    },
    {
        "text": " La clase anterior decíamos si acá ponemos en este eje el tiempo y acá ponemos el PBI, ¿cómo hacemos la evolución del economía?",
        "start": 5380.0,
        "end": 5388.0
    },
    {
        "text": " De manera ciclica, ¿sí? Entonces ¿qué me quiere decir el desempleo cíclico que capaz que yo estoy acá en el ciclo del economía?",
        "start": 5389.0,
        "end": 5400.0
    },
    {
        "text": " Que capaz que estoy por acá y la economía va a crecer más y si la economía va a crecer más, esto es PBI ¿no?",
        "start": 5402.0,
        "end": 5410.0
    },
    {
        "text": " Crecimiento económico PBI, si va a haber más bienes y servicios y la economía va a producir más bienes y servicios ¿qué va a precisar para que esto de acá humente?",
        "start": 5410.0,
        "end": 5421.0
    },
    {
        "text": " Más empleo, por lo tanto si el ciclo de la economía hace que la economía crezca parte del desempleo se va a solucir.",
        "start": 5422.0,
        "end": 5432.0
    },
    {
        "text": " Y eso es lo que uno le llama el desempleo cíclico. Hay un contingente, hay gente que está buscando trabajo y apenas la economía crezca y se va a contratar a una parte de ese desempleado, de eso desempleado.",
        "start": 5433.0,
        "end": 5445.0
    },
    {
        "text": " Pero ya de la mano es muy vinculado a esto, aparece lo que se denomina el desempleo estructural.",
        "start": 5446.0,
        "end": 5454.0
    },
    {
        "text": " Que pongamos el EQ en Uruguay para tener una referencia, pongamos el EQ hay un 4% y esto no va a pasar lo que dijimos recién de lo del ciclo.",
        "start": 5455.0,
        "end": 5467.0
    },
    {
        "text": " ¿Por qué? Porque este crecimiento de la economía también va a traer que a nivel del país Uruguay crezca y se produzca más y se necesita más gente.",
        "start": 5468.0,
        "end": 5478.0
    },
    {
        "text": " Ahora, estos desempleados van a poder trabajar en esto que se necesita más. Cuando hablamos de que Uruguay crece, no crecen todos los sectores productivos, todas las actividades por igual y por lo tanto todas las necesidades de formación o de recursos humanos por igual.",
        "start": 5479.0,
        "end": 5494.0
    },
    {
        "text": " Entonces, dentro de este crecimiento se van a demandar unas profesiones, unas capacidades y no se van a demandar otras.",
        "start": 5495.0,
        "end": 5502.0
    },
    {
        "text": " Entonces, hay un núcleo acá de gente, pongamos la Inglaterra Uruguay, papeleros de panapeljo en la casa, testiles de todo el país, curtiambre, sectores que no están creciendo tanto.",
        "start": 5503.0,
        "end": 5516.0
    },
    {
        "text": " Entonces, quienes tienen esas capacidades para trabajar en esos sectores, la economía crece, contrata más ingenieros en computación, más ingenieros civiles y qué pasa con esto que trabajan en la textividad y no van a ser contratados.",
        "start": 5517.0,
        "end": 5531.0
    },
    {
        "text": " Entonces, este desempleo es difícil, es más duro porque esto va a requerir, reconvertir gente, decirle mirar lo que trabajaba este, ahora no se demanda o se ha ido desempleado o te cambias.",
        "start": 5532.0,
        "end": 5544.0
    },
    {
        "text": " Y acá no vamos a caer, aguantar que ahora la economía crece y te van a contratar. Entonces, las medidas para combatir este desempleo, muy diferentes que para combatir este otro.",
        "start": 5545.0,
        "end": 5554.0
    },
    {
        "text": " Sí? Y hay un tercer tipo de desempleo y con esto cerramos el 8% que es el que se denomina el desempleo friccional.",
        "start": 5554.0,
        "end": 5565.0
    },
    {
        "text": " El desempleo friccional pasa por gente que está desempleada pero por un tema de tiempo nada más, porque recién estoy saliendo al mercado de trabajo.",
        "start": 5566.0,
        "end": 5576.0
    },
    {
        "text": " Quisiera avanzar con la facultad, con los estudios y el día que dije bueno quiero trabajar y bueno no es que quiero trabajar y ya encontré trabajo.",
        "start": 5576.0,
        "end": 5584.0
    },
    {
        "text": " Entonces hay un tiempo que estoy buscando y si justo ahí me cae la encuesta y me pregunta, trabajaste, buscaste al menos la semana pasada, no vamos a empezar justo ayer y bueno desemplea.",
        "start": 5585.0,
        "end": 5597.0
    },
    {
        "text": " Entonces hay una parte de ese desempleo que depende de este ajuste entre oferta y demanda de trabajo, incluso en la búsqueda, ¿no?",
        "start": 5597.0,
        "end": 5605.0
    },
    {
        "text": " Capaz que si para imaginarnos, si hubiera, si el gallito le hubiera algo espectacular, perfecto esto sería cero, porque no se igual había enseguida y no hay problema de búsqueda, de demoras de tiempo.",
        "start": 5606.0,
        "end": 5618.0
    },
    {
        "text": " ¿Sí? Y hay un cuarto tipo de desempleo que podemos manejar también para tener los diferentes conceptos que está vinculados a este indicador de desempleo, ¿qué es el estacional?",
        "start": 5618.0,
        "end": 5634.0
    },
    {
        "text": " No, a cada nivel año es cero, ¿sí? Porque si este 8 es de un año y estamos hablando de que esto es estacional, el desempleo estacional está vinculado a las estaciones del año, ¿no?",
        "start": 5634.0,
        "end": 5649.0
    },
    {
        "text": " Esto a nivel anual es cero, pero si hicieramos por ejemplo la tasa de desempleo de mal donado del verano y la tasa de desempleo de mal donado del invierno.",
        "start": 5649.0,
        "end": 5660.0
    },
    {
        "text": " Ponámole que en el año la tasa de desempleo es mal donado ese ese 8, nada más no complicado. ¿Qué pasa si tenemos que inventar números? ¿Qué números inventamos?",
        "start": 5660.0,
        "end": 5677.0
    },
    {
        "text": " ¿Eh?",
        "start": 5678.0,
        "end": 5680.0
    },
    {
        "text": " 1% en verano, ¿por qué es mal donado 1% no más de desempleo?",
        "start": 5681.0,
        "end": 5689.0
    },
    {
        "text": " Porque hay temporada y más trabajo menos de desempleo y en invierno entonces agregemos el 10 para mediar más del 8, ¿no?",
        "start": 5691.0,
        "end": 5699.0
    },
    {
        "text": " Para que esto no era una suma ¿no? Y eso 12, el número que quiero, pero mayor al promedio en una estación del año si hay más actividad y dependiendo de cada país y justamente tiene actividades que son estacionales más desempleo, ¿me?",
        "start": 5700.0,
        "end": 5718.0
    },
    {
        "text": " Lo que sí no podemos considerar acá es a los inactivos ¿verdad?",
        "start": 5719.0,
        "end": 5725.0
    },
    {
        "text": " El inactivo no está trabajando, pero el hecho de no estar trabajando no es desempleado. Recordemos que ese concepto de desempleo implica participación activa en el mercado de trabajo.",
        "start": 5728.0,
        "end": 5739.0
    },
    {
        "text": " Por lo tanto, por más que alguien pueda decir no, yo soy desempleado porque no estoy trabajando, si manejamos un poquito estos conceptos tendríamos que indagar si está buscando trabajo, no está buscando trabajo.",
        "start": 5740.0,
        "end": 5751.0
    },
    {
        "text": " Bien, voy a volver a poner estos números acá porque me olvidó una cosa.",
        "start": 5756.0,
        "end": 5762.0
    },
    {
        "text": " ¿Cuatro, cinco, ¿de ahí?",
        "start": 5762.0,
        "end": 5770.0
    },
    {
        "text": " Bueno, la pregunta es si estamos en pleno empleo, un millón 500, entonces se lele que va acá, inventemos números si quieren, acá tenemos un 100, acá un 65, acá un 70, y todo eso nos da 60 mil.",
        "start": 5822.0,
        "end": 5851.0
    },
    {
        "text": " ¿M millones de dólares?",
        "start": 5852.0,
        "end": 5857.0
    },
    {
        "text": " Tenemos la función de producción y decimos que si tenemos un millón y medio, el nivel que le hablamos de pleno empleo, entonces la producción que va a tener la economía es la que le vamos a llamarla de pleno empleo y para tirar algún número ahí para inventar,",
        "start": 5862.0,
        "end": 5881.0
    },
    {
        "text": " entonces, 60 mil millones de dólares que sea el PBI de Uruguay.",
        "start": 5881.0,
        "end": 5886.0
    },
    {
        "text": " Bien, si la economía está en una de esas tres situaciones, que era la que decíamos de exalario de equilibrio, el nivel de pleno empleo, no hay drama con ese nivel de producción de empleados, venimos a la función de producción como era aquello de la receta de la clase anterior, ponemos los números, acá tenemos los datos de los ingredientes y sale esto.",
        "start": 5886.0,
        "end": 5907.0
    },
    {
        "text": " ¿Qué pasa si no es esa situación? Si no es la de pleno empleo, si no que la de desempleo.",
        "start": 5908.0,
        "end": 5915.0
    },
    {
        "text": " ¿Cuál es el número que pongo ahí? Si estamos ante la situación de desempleo, cuál va a ser el L que voy a poner ahí?",
        "start": 5916.0,
        "end": 5925.0
    },
    {
        "text": " Si estoy en desempleo, ¿qué pongo?",
        "start": 5925.0,
        "end": 5930.0
    },
    {
        "text": " ¿Situación?",
        "start": 5931.0,
        "end": 5934.0
    },
    {
        "text": " Desempleo, dije, ¿no? 1,490, pongo la oferta, 1,490,",
        "start": 5938.0,
        "end": 5945.0
    },
    {
        "text": " o pongo la demanda, no, esta es la demanda, o pongo la oferta, 1,550. ¿Cuál es el L que voy a poner acá para que utilizando los factores productivos obtengan el nivel de producción?",
        "start": 5946.0,
        "end": 5959.0
    },
    {
        "text": " ¿Queris son el M my gosh cual es de los dos el que es cada vez?",
        "start": 5960.0,
        "end": 5965.0
    },
    {
        "text": " ¿Tiene un cambio?",
        "start": 5974.0,
        "end": 5978.0
    },
    {
        "text": " ¿Qué es lo que cóよ?",
        "start": 5980.0,
        "end": 5982.0
    },
    {
        "text": " ¿Quién es son? El Milleón 490, el Milleón 500, ¿cuál es de los dos? El que está usando",
        "start": 5982.0,
        "end": 5989.6
    },
    {
        "text": " estas máquinas, estos recursos, esta tecnología para producir.",
        "start": 5989.6,
        "end": 5993.28
    },
    {
        "text": " El Milleón 490, la demanda. ¿Por qué los 60.000 esos de diferenciano?",
        "start": 6005.76,
        "end": 6010.56
    },
    {
        "text": " Porque si están desempleados, no van a estar utilizando maquinaria, recursos y",
        "start": 6012.56,
        "end": 6016.68
    },
    {
        "text": " tecnología para producir. Si son desempleados, no están trabajando, no están",
        "start": 6016.68,
        "end": 6021.44
    },
    {
        "text": " produciendo. Por lo tanto acá la producción van a ser 50.000 millones de dólares.",
        "start": 6021.44,
        "end": 6027.48
    },
    {
        "text": " Entonces acá yo tengo 1.490.000 y la producción es 50.000 millones de dólares. Y esta es la demanda de trabajo.",
        "start": 6027.48,
        "end": 6041.56
    },
    {
        "text": " Acá dijimos que era plenompleo para los dos, ¿no? De manda igual o farta.",
        "start": 6042.0,
        "end": 6045.8
    },
    {
        "text": " Y si estoy en la situación cuando el salario real era ese de ahí abajo, ¿quién pongo?",
        "start": 6049.8,
        "end": 6055.88
    },
    {
        "text": " El Milleón 450, que es la oferta.",
        "start": 6057.0,
        "end": 6060.52
    },
    {
        "text": " O sea, acá dijimos que era la demanda, ¿no? Este no es. ¿Por qué? Porque no están",
        "start": 6063.4,
        "end": 6067.92
    },
    {
        "text": " trabajando, están desempleados. O 1.660, que es la demanda.",
        "start": 6067.92,
        "end": 6074.52
    },
    {
        "text": " ¿Cuál es el número que está utilizando a las maquinas los recursos naturales y la tecnología",
        "start": 6079.04,
        "end": 6083.8
    },
    {
        "text": " que se dispone para obtener una producción? ¿Ehh?",
        "start": 6083.8,
        "end": 6091.8
    },
    {
        "text": " Oferta ahora. ¿Por qué? ¿Por qué pasa con los 150.000 puestos de trabajo que",
        "start": 6097.8,
        "end": 6105.12
    },
    {
        "text": " precisan las empresas y que no lo pueden cubrir? Si no lo pueden cubrir, van a",
        "start": 6105.12,
        "end": 6110.4400000000005
    },
    {
        "text": " estar produciendo. ¿No? Entonces acá es la demanda la que no vamos a utilizar y consideramos",
        "start": 6110.44,
        "end": 6118.679999999999
    },
    {
        "text": " la oferta. Y tenemos 48.000 millones de dólares. Tenemos un poquito menos de gente con estos números.",
        "start": 6118.679999999999,
        "end": 6127.599999999999
    },
    {
        "text": " Producimos 48.000 millones de dólares. Entonces, como cierre de esto, ¿cuál es el L que",
        "start": 6127.6,
        "end": 6141.4400000000005
    },
    {
        "text": " uno va a poner acá? El más chico, ¿sí? Si son iguales, barbar, no nos calentamos. Ahora, si son",
        "start": 6141.4400000000005,
        "end": 6152.4400000000005
    },
    {
        "text": " diferentes, vamos a usar el más chico, porque lo que estamos considerando acá es la función",
        "start": 6152.4400000000005,
        "end": 6156.280000000001
    },
    {
        "text": " de producción, lo que efectivamente se está utilizando. Los factores productivos que efectivamente",
        "start": 6156.28,
        "end": 6161.0
    },
    {
        "text": " se están utilizando para lograr obtener los bienes. ¿Sí? Si hay más gente que anda en la vuelta,",
        "start": 6161.0,
        "end": 6168.679999999999
    },
    {
        "text": " pero que no está trabajando, no va a producir. Si hay puesto de trabajo que quedaron vacíos,",
        "start": 6168.679999999999,
        "end": 6173.48
    },
    {
        "text": " no van a producir. Entonces, se ha hablado más chico, el valor más chico entre oferti de manda,",
        "start": 6173.48,
        "end": 6179.96
    },
    {
        "text": " el mercado de trabajo, cuando hay diferencias, es lo que me va a determinar este valor de los",
        "start": 6179.96,
        "end": 6189.28
    },
    {
        "text": " factores productivos. ¿Y cuál va a ser la máxima producción que puede obtener una economía?",
        "start": 6189.28,
        "end": 6196.32
    },
    {
        "text": " ¿Cuándo es lo máximo que puede producir? Si estamos en el equipo de ese equilibrio de acá arriba,",
        "start": 6196.32,
        "end": 6204.28
    },
    {
        "text": " lo dijimos que lo que nos va a determinar la producción es el más corto de los dos, ¿no?",
        "start": 6204.28,
        "end": 6209.16
    },
    {
        "text": " El más chico de los dos. ¿Cuál es lo máximo este equilibrio? El máximo nivel de empleo que va",
        "start": 6209.16,
        "end": 6216.28
    },
    {
        "text": " a poder estar utilizando los demás factores productivos es este él, porque si no siempre estamos con",
        "start": 6216.28,
        "end": 6222.5199999999995
    },
    {
        "text": " el lado más chico, de este lado cuando el salario está por encima o este lado de acá cuando el salario",
        "start": 6222.5199999999995,
        "end": 6227.84
    },
    {
        "text": " está por debajo. Siempre vamos a estar con alguno de estos puntos. ¿Cuál es el mayor y ese?",
        "start": 6228.4400000000005,
        "end": 6235.400000000001
    },
    {
        "text": " El nivel de pleno empleo entonces es lo que vamos a poder asociar como el máximo nivel de",
        "start": 6235.400000000001,
        "end": 6242.56
    },
    {
        "text": " factores productivos que se puedan utilizar y por lo tanto el máximo nivel de producto que se",
        "start": 6242.56,
        "end": 6248.6
    },
    {
        "text": " pueda obtener en la economía. Sí?",
        "start": 6248.6,
        "end": 6255.68
    },
    {
        "text": " Lo que vamos a tratar de dejar planteado para cerrar la clase de próxima es dado que ya vimos",
        "start": 6278.6,
        "end": 6290.52
    },
    {
        "text": " la oferta agregada, tratemos de ir al mercado de bienes y servicios para ver qué relacionáis entre",
        "start": 6290.52,
        "end": 6303.88
    },
    {
        "text": " los dos variables clave de un mercado que es el precio con su cantidad. Nosotros ya tenemos",
        "start": 6303.88,
        "end": 6312.88
    },
    {
        "text": " entonces que la oferta agregada de una economía depende de estos cuatro factores productivos y a su vez",
        "start": 6312.88,
        "end": 6317.88
    },
    {
        "text": " esos cuatro factores productivos sabemos de qué depende, con mucho énfasis en el mercado de trabajo",
        "start": 6317.88,
        "end": 6322.88
    },
    {
        "text": " que se que desarrolla más. Vamos a tratar de ver si podemos analizar esta relación, ¿qué ocurrirías",
        "start": 6322.88,
        "end": 6330.2
    },
    {
        "text": " y suben los precios o si bajan los precios con la producción, con la oferta agregada de una empresa,",
        "start": 6330.2,
        "end": 6338.2
    },
    {
        "text": " de una economía. Y acá vamos a empezar a esbozar, o sea lo que quiero decir yo es, partamos de una",
        "start": 6338.2,
        "end": 6349.48
    },
    {
        "text": " situación, por ejemplo esa de 60 mil millones de dólares de producción y un nivel de precios",
        "start": 6349.48,
        "end": 6359.679999999999
    },
    {
        "text": " un IPC de 170. Entonces tenemos esta situación y lo que quiero ver tratar de razonar es por ejemplo si el",
        "start": 6359.68,
        "end": 6372.34
    },
    {
        "text": " precio baja, ¿qué es lo que ocurre en una economía? ¿Se va a producir menos, se va a producir lo mismo,",
        "start": 6372.34,
        "end": 6379.8
    },
    {
        "text": " se va a producir más? ¿Cómo es la relación de acuerdo a lo que ya hemos visto que nos puede",
        "start": 6379.8,
        "end": 6385.84
    },
    {
        "text": " dedicular variables macroeconómicas? Que a mí me diga, mira si baja esto yo puedo empezar a",
        "start": 6385.84,
        "end": 6392.24
    },
    {
        "text": " razonar y te voy a concluir que la oferta agregada de una economía le va a pasar tallos.",
        "start": 6392.24,
        "end": 6396.84
    },
    {
        "text": " Para eso lo que nosotros vamos a tratar de ver es cómo es que determinamos esta variable,",
        "start": 6403.0,
        "end": 6412.400000000001
    },
    {
        "text": " porque partimos de esto que lo tomamos con un dato y vamos a llegar a esto que es lo que queremos",
        "start": 6413.0,
        "end": 6418.719999999999
    },
    {
        "text": " saber y esto se determina acá la producción, pero la producción a su vez se determinaba, si seguimos",
        "start": 6418.719999999999,
        "end": 6427.12
    },
    {
        "text": " con la lógica de corto plazo se determinaba con la función de producción, con aquella cú,",
        "start": 6427.12,
        "end": 6432.28
    },
    {
        "text": " que era función de L, C, recurso natural, esit tecnología y donde asumimos estos dados y por lo",
        "start": 6432.28,
        "end": 6438.879999999999
    },
    {
        "text": " tanto nos quedamos con el nivel de empleo, pero su vez el nivel de empleo donde sacamos,",
        "start": 6438.88,
        "end": 6444.6
    },
    {
        "text": " cómo determinamos cuál es el nivel de empleo que se utiliza para producir bienes en el",
        "start": 6444.6,
        "end": 6451.1
    },
    {
        "text": " mercado de trabajo, entonces me voy a hacer también el gráfico del mercado de trabajo para saber",
        "start": 6451.1,
        "end": 6458.64
    },
    {
        "text": " que en función de la oferta de trabajo y la demanda de trabajo yo puedo concluir cosas,",
        "start": 6460.76,
        "end": 6466.12
    },
    {
        "text": " sí, parecido a lo que hicimos hace un rato, dijimos bueno si estamos en la situación del",
        "start": 6466.12,
        "end": 6474.64
    },
    {
        "text": " pleno empleo, ¿quién es el L que se utiliza para producir? Y decía muy bueno, el L es un",
        "start": 6474.64,
        "end": 6479.68
    },
    {
        "text": " 1,500, con 1,500 lo pongo en la función de producción y saco, entonces y lo planteamos",
        "start": 6479.68,
        "end": 6488.0
    },
    {
        "text": " y cerramos la clase de hoy, si bajan los precios, para saber lo que pasa acá tendría que",
        "start": 6488.0,
        "end": 6497.78
    },
    {
        "text": " mirar qué pasa con el trabajo, entonces voy a pensar primero acá, si bajan los precios,",
        "start": 6497.78,
        "end": 6502.88
    },
    {
        "text": " pasa algo acá en el mercado de trabajo, la baja de precios a mí me va a afectar",
        "start": 6502.88,
        "end": 6516.08
    },
    {
        "text": " este indicador, si asumo que esto queda igual y que esto baja que le pasa el salario real,",
        "start": 6519.0,
        "end": 6528.88
    },
    {
        "text": " aumenta, si bajan los precios que pasa con el poder de compra del salario de una persona y",
        "start": 6532.0,
        "end": 6540.8
    },
    {
        "text": " va a aumentar, entonces ahora yo lo que preciso es saber la situación de partida, entonces vamos",
        "start": 6540.8,
        "end": 6548.08
    },
    {
        "text": " a sumir qué partimos del equilibrio, por simplicidad, entonces yo partida de 2V sub 0 sobre",
        "start": 6548.08,
        "end": 6554.56
    },
    {
        "text": " p sub 0, pero ahora que tengo, ahora tengo 2V sub 0 sobre p sub 1, dado que bajaron los precios,",
        "start": 6554.56,
        "end": 6568.72
    },
    {
        "text": " yo tengo que el salario real subió, y si el salario real sube,",
        "start": 6568.72,
        "end": 6582.400000000001
    },
    {
        "text": " que le pasó a la oferta de trabajo y que le pasó a la demanda de trabajo, si el salario real",
        "start": 6584.56,
        "end": 6591.6
    },
    {
        "text": " sube la gente que hace, va a querer trabajar más horas, los empresarios contratar menos gente",
        "start": 6591.6,
        "end": 6602.0
    },
    {
        "text": " para maximizar beneficios, qué pasa en el mercado de trabajo, qué es lo que representamos acá,",
        "start": 6602.0,
        "end": 6608.240000000001
    },
    {
        "text": " si partimos de qué oferta ir igual a demanda y subió la oferta y bajo la demanda, la oferta mayor,",
        "start": 6612.320000000001,
        "end": 6618.4800000000005
    },
    {
        "text": " o sea que tenemos desempleo, dejamos acá, lo retomamos en la clase que viene que esto sigue,",
        "start": 6618.48,
        "end": 6632.04
    },
    {
        "text": " el razonamiento de este va a seguir, y estamos empezando a relacionar a través de cadena causal lo",
        "start": 6632.04,
        "end": 6639.599999999999
    },
    {
        "text": " que les dije los otros días, el final va a servir como muchas variales macroeconómicas, las podemos",
        "start": 6639.599999999999,
        "end": 6645.04
    },
    {
        "text": " ir relacionadas, por ahora es para saber qué le pasa a la producción, vemos que le pasa al mercado de trabajo.",
        "start": 6645.04,
        "end": 6651.6
    }
]