[
    {
        "text": " Bueno, Urices, última clase teórico antes de arrancar, digamos, la época de parciales",
        "start": 0.0,
        "end": 10.72
    },
    {
        "text": " y después de esto además viene nuestro parcial, por supuesto, y después vamos a arrancar",
        "start": 10.72,
        "end": 18.16
    },
    {
        "text": " la segunda parte del curso que estuve pensando un poquito como a salar.",
        "start": 18.16,
        "end": 23.0
    },
    {
        "text": " Vamos a arrancar la segunda parte del curso, vamos a arrancar directamente con el último",
        "start": 23.0,
        "end": 26.900000000000002
    },
    {
        "text": " rapítulos que estoy aida de grafos.",
        "start": 26.9,
        "end": 28.9
    },
    {
        "text": " Lo voy a traer para adelante porque le sirve a todos, es el más cercano a los intereses",
        "start": 28.9,
        "end": 36.519999999999996
    },
    {
        "text": " de muchos ustedes.",
        "start": 36.519999999999996,
        "end": 38.32
    },
    {
        "text": " Y después voy a meter el economía, la aplicación de economía y después viendo cuántos",
        "start": 38.32,
        "end": 43.26
    },
    {
        "text": " tiempo nos sogramos, vemos que otra aplicación hacemos.",
        "start": 43.26,
        "end": 45.9
    },
    {
        "text": " ¿Vamos a hacer ese orden?",
        "start": 45.9,
        "end": 47.9
    },
    {
        "text": " Grafos, economía y después vemos.",
        "start": 47.9,
        "end": 50.9
    },
    {
        "text": " Bueno, la última clase nos llevó un buen rato, una demostración.",
        "start": 50.9,
        "end": 57.9
    },
    {
        "text": " ¿Estamos monstruidos más de parciales por la nena o no?",
        "start": 57.9,
        "end": 62.9
    },
    {
        "text": " Yo no sé si tiene inscripción, yo le pregunte a todo el mundo, la hablé con la directora",
        "start": 62.9,
        "end": 69.06
    },
    {
        "text": " de Veli, y todo.",
        "start": 69.06,
        "end": 71.06
    },
    {
        "text": " No sé si está inscripción o no, no sé si tiene que ir.",
        "start": 71.06,
        "end": 75.06
    },
    {
        "text": " No sé si tiene que ir.",
        "start": 75.06,
        "end": 82.06
    },
    {
        "text": " Yo ya pedí también, bueno, el parcial es en el A21, ya sabemos, pero ya pedí que me",
        "start": 82.06,
        "end": 88.16
    },
    {
        "text": " recebe en el A22, suele el A21 para las dos martes, lo vamos a tener clase de consulta.",
        "start": 88.16,
        "end": 93.36
    },
    {
        "text": " Martes a las dos, luego martes a las dos.",
        "start": 93.36,
        "end": 96.66
    },
    {
        "text": " Así queda, ya, el mismo, uno de los mismos salarios que teníamos para antes.",
        "start": 96.66,
        "end": 101.7
    },
    {
        "text": " Bueno, entonces en la última clase, hubo un proceso, trabajamos bastante para demostrar",
        "start": 101.7,
        "end": 111.18
    },
    {
        "text": " el teorema C10, entonces, decimos en el repaso.",
        "start": 111.18,
        "end": 115.46000000000001
    },
    {
        "text": " Repaso en el ultima clase, vamos a hacer repaso de materias anteriores para que la clase",
        "start": 115.46000000000001,
        "end": 120.56
    },
    {
        "text": " de hoy fluya sin problemas.",
        "start": 120.56,
        "end": 123.7
    },
    {
        "text": " Entonces, repaso azul, digamos, el teorema decía así, bueno, el teorema, si teníamos",
        "start": 123.7,
        "end": 143.74
    },
    {
        "text": " una matriz cuadrada, coeficiente complejo para poder usar llorada en tranquilidad, también",
        "start": 143.74,
        "end": 151.8
    },
    {
        "text": " la pensamos, la pensamos en MSN-DSE, o bien la pensamos en CN², porque vamos a usar",
        "start": 151.8,
        "end": 161.46
    },
    {
        "text": " la norma también.",
        "start": 161.46,
        "end": 163.46
    },
    {
        "text": " Entonces el teorema se interrompe, entonces, rodea es igual al límite cuando se tiene",
        "start": 163.46,
        "end": 175.44
    },
    {
        "text": " más infinito de la raíz SESMA-DALAES.",
        "start": 175.44,
        "end": 181.84
    },
    {
        "text": " Bien, este fue el teorema y en la demostración había cuatro partes, primero la observación",
        "start": 181.84,
        "end": 190.92
    },
    {
        "text": " de que el más acuerdo que estoy en el mismo orden que el diagrama que hicimos la vez",
        "start": 190.92,
        "end": 195.07999999999998
    },
    {
        "text": " pasada a prezón.",
        "start": 195.07999999999998,
        "end": 198.07999999999998
    },
    {
        "text": " Espero que se robamos esto, probamos, quiero dejar el hematélico ahí va, probamos, esta",
        "start": 198.08,
        "end": 211.22000000000003
    },
    {
        "text": " la pregunta, digamos, acá, esta la pregunta, o sea, el teorema, ahí va, sí, esto lo observamos,",
        "start": 211.22000000000003,
        "end": 227.36
    },
    {
        "text": " y probamos este, ¿no?",
        "start": 227.36,
        "end": 231.92000000000002
    },
    {
        "text": " Vamos a sacar el tibuel por ahora, probamos este límite cuando se tiene más infinito",
        "start": 231.92000000000002,
        "end": 239.28
    },
    {
        "text": " de la raíz SESMA-DALAES, que es este es igual a esto, ¿no?",
        "start": 239.28,
        "end": 247.4
    },
    {
        "text": " Nos queda un lema técnico, o sea, esos dos que están en negro, los probamos, este es",
        "start": 247.4,
        "end": 253.20000000000002
    },
    {
        "text": " el teorema y nos queda el lema técnico que lo pongo en rojo, que es el que vamos a",
        "start": 253.2,
        "end": 257.88
    },
    {
        "text": " probar ahora, con eso tenemos la demostración del teorema, el lema técnico lo habíamos",
        "start": 257.88,
        "end": 262.47999999999996
    },
    {
        "text": " separado, entonces ya mismo aparece, que sierra la demostración, ese es el que está ahí,",
        "start": 262.47999999999996,
        "end": 276.15999999999997
    },
    {
        "text": " las mismas hipótesis que arriba no repito hipótesis, y pongo la teasis, que es el que",
        "start": 276.16,
        "end": 284.28000000000003
    },
    {
        "text": " está escrito arriba, los límites, hola, que tal, ok, bien, ese es el primer objetivo",
        "start": 284.28,
        "end": 310.2
    },
    {
        "text": " de la clase de hoy, para esto al final de la clase pasada se acuerdan, repasamos tres",
        "start": 310.2,
        "end": 316.96
    },
    {
        "text": " conceptos, ¿sí? o tres o cuatro conceptos que voy a comenzar esta clase de nuevo repasando",
        "start": 316.96,
        "end": 322.68
    },
    {
        "text": " los, por lo menos oralmente, ¿sí?",
        "start": 322.68,
        "end": 325.68
    },
    {
        "text": " O sea, que quede también para la clase de open-fing, lo primero, vamos a escribirlos,",
        "start": 325.68,
        "end": 335.2
    },
    {
        "text": " entonces repasos de otros cursos, lo primero, esta lista la voy a tratar de dejar porque,",
        "start": 335.2,
        "end": 352.48
    },
    {
        "text": " en la mitad de la clase voy a incrementar algunos puntos más, de otros cursos, primero,",
        "start": 352.48,
        "end": 357.2
    },
    {
        "text": " tenemos T, de ren, en ren, cualquiera en, o bien, T, de CN, de CN, en general le estudiamos",
        "start": 357.2,
        "end": 371.68
    },
    {
        "text": " en ren, en ren, en transformación lineal, si quieren le pongo M para que nadie se confunda,",
        "start": 371.68,
        "end": 385.64
    },
    {
        "text": " es cualquiera, quiere decir cualquiera, no tiene que ver con aquel N, cualquiera, entonces",
        "start": 385.64,
        "end": 392.36
    },
    {
        "text": " ustedes vieron en cálculo 2, ¿sí? y le estamos llevamos a usar, que cualquier transformación",
        "start": 392.36,
        "end": 397.68
    },
    {
        "text": " lineal de ren en RM o SMSM, con la normauclidiano, con cualquier norma, porque son todas equivalentes,",
        "start": 397.68,
        "end": 406.44
    },
    {
        "text": " con la normauclidiano por ejemplo, entonces T es continuo, todo decía así el resultado,",
        "start": 406.44,
        "end": 420.96
    },
    {
        "text": " toda transformación lineal es continuo, conjugando gal 2 o gal 1, si se quiere o gal 2, con cálculo 2,",
        "start": 420.96,
        "end": 430.32
    },
    {
        "text": " eso lo vieron en cálculo 2, no es muy difícil de demostrar, pero bueno, no lo vamos a",
        "start": 430.32,
        "end": 437.0
    },
    {
        "text": " hacer acá, pues ya está hecho, lo segundo que repasamos al final de la clase pasada es considerar",
        "start": 437.0,
        "end": 443.24
    },
    {
        "text": " ese, los vectores de ser R, o sí, cualquiera los dos, a la M, tal que la norma de X es exactamente",
        "start": 443.24,
        "end": 454.56
    },
    {
        "text": " 1, o sea la espera, la cáscara de la pelota, de radio 1, ¿sí? y esta, ya me dije no la última clase,",
        "start": 454.56,
        "end": 468.08
    },
    {
        "text": " es este conjunto es cerrado y acotado, y cerrado y acotado en RN o en sea la M, es lo mismo,",
        "start": 468.08,
        "end": 478.88
    },
    {
        "text": " esto sí solamente sigue compacto, cierto todo, estos son cosas que ya vieron en cálculo 2 y que",
        "start": 478.88,
        "end": 490.44
    },
    {
        "text": " lo vamos a usar hoy, ¿qué más? Baistras, 3, tenemos baistras, si tenemos cualquier función, vamos",
        "start": 490.44,
        "end": 506.8
    },
    {
        "text": " llamar la F, de sea la M o R, la M como quieran, en R, eso sí, a la derecha tiene que estar R,",
        "start": 506.8,
        "end": 518.36
    },
    {
        "text": " F y F, cualquiera puede ser el dominio, pero la derecha tiene que estar R, ¿por qué? Porque",
        "start": 519.36,
        "end": 527.36
    },
    {
        "text": " Baistras habla de máximo y mínimo, se acuerda y para hablar de máximo y mínimo no puede escaren los",
        "start": 527.36,
        "end": 530.96
    },
    {
        "text": " complejos, y si crees en los complejos tienes que tomar norma digamos para poder hablar de máximo",
        "start": 530.96,
        "end": 535.5600000000001
    },
    {
        "text": " y mínimo, ¿todas? y lo que decía Baistras es que F restricta a un companto, en este caso S tiene",
        "start": 535.5600000000001,
        "end": 546.6
    },
    {
        "text": " máximo y mínimo, o alcanza mejor dicho, alcanza máximo y mínimo, alcanza máximo y mínimo,",
        "start": 546.6,
        "end": 555.96
    },
    {
        "text": " absoluto, todos conceptos de años anteriores, ¿tabien? No se sorprendían a alguien con estos conceptos,",
        "start": 555.96,
        "end": 574.64
    },
    {
        "text": " lo cierto, primero que la habíamos repasado y segundo que, bueno, pero ya que estamos,",
        "start": 574.64,
        "end": 581.96
    },
    {
        "text": " estos son las vamos a usar acá en el EMT, pero voy a citar dos conceptos más que vienen en los",
        "start": 581.96,
        "end": 588.08
    },
    {
        "text": " siguientes resultados, cuatro, me voy probablemente, antes estaban calculo uno, creo que ahora están",
        "start": 588.08,
        "end": 595.3199999999999
    },
    {
        "text": " calculos dos, ¿qué es una sucesión de Cochí? Sí, es una sucesión de Cochí que la definición,",
        "start": 595.32,
        "end": 611.7600000000001
    },
    {
        "text": " cuando una sucesión x suene es de Cochí, ahí va, para todo, para todo epsilom mayor que",
        "start": 611.76,
        "end": 628.48
    },
    {
        "text": " 0, existe en el 0, tal que para todo e, mayor igual que en el 0, en el m, para todo e, mayor",
        "start": 628.48,
        "end": 636.64
    },
    {
        "text": " igual que en el 0, la distancia de x n, a x m, en menor que epsilom, esa es la definición de",
        "start": 636.64,
        "end": 646.0
    },
    {
        "text": " sucesión de Cochí, ¿tabas? Y esa distancia que me, ¿por qué estudias a esa? ¿les son las?",
        "start": 646.0,
        "end": 650.8000000000001
    },
    {
        "text": " ¿Vamos a este? Ah, usted es el matemático, ok, esta definición que me pasó a lesandra",
        "start": 650.8,
        "end": 659.68
    },
    {
        "text": " fíjense que a usar la distancia, la distancia puede ser, por ejemplo, la norma de x n",
        "start": 659.68,
        "end": 667.06
    },
    {
        "text": " menos x m, ¿qué norma? Y donde este es, en el Rm, en el cm, lo que fue, pero también vale para",
        "start": 667.06,
        "end": 674.04
    },
    {
        "text": " otras distancias de otros, es una versión, esto es un concepto que valen cualquier espacios",
        "start": 674.04,
        "end": 679.5799999999999
    },
    {
        "text": " en el m, una versión F, que es otra n, que es esto, lo que es el M, que sería el примé çok",
        "start": 680.1800000000001,
        "end": 685.46
    },
    {
        "text": " cierto, este es algo bueno, es continuación, es continuación, ¿a qué es que es heldado?",
        "start": 685.46,
        "end": 690.36
    },
    {
        "text": " Deinally, esta es la cn, ¿qué es lo que es lo que hemos██ lo haz? Es como la Ts,",
        "start": 690.36,
        "end": 695.9200000000001
    },
    {
        "text": " lo racionalνε la lacking del Rm, esto es la Xs, el Xs n más las Cos por agua, lo sabão Minas",
        "start": 695.9200000000001,
        "end": 703.38
    },
    {
        "text": " porque CN es igual a Rm, cada vez que hablemos de CN, topológicamente lo mismo que Rm, R2n,",
        "start": 703.38,
        "end": 712.22
    },
    {
        "text": " porque cada sesuina recuadrado, entonces topológicamente lo mismo, lo que pasa en uno y en el",
        "start": 712.22,
        "end": 717.06
    },
    {
        "text": " otro es lo mismo, entonces como ustedes ya tienen todo estudiado, R a la M, para cualquier",
        "start": 717.06,
        "end": 722.14
    },
    {
        "text": " M de cálculo 2 tenemos también todo estudiado, los 6 a la M, eso no hay ningún problema",
        "start": 722.14,
        "end": 726.9
    },
    {
        "text": " del punto de vista topológicos, por eso continuamente cuando hablamos a todos estos",
        "start": 726.9,
        "end": 731.18
    },
    {
        "text": " conceptos topológicos podemos arragar, eso sí, por ejemplo en barriestras acá no puedo",
        "start": 731.18,
        "end": 735.5799999999999
    },
    {
        "text": " ponerse porque hablo de máximo y mínimo, eso os cuidad a que tengas, y acá te la sucesión",
        "start": 735.5799999999999,
        "end": 740.18
    },
    {
        "text": " de coxí el concepto, ¿sierto? ¿Qué probaron en los reales? Probablemente el comienzo",
        "start": 740.18,
        "end": 746.14
    },
    {
        "text": " de cálculo 2, esto yo lo di en el liceo, o sea, en cuenta que pasó del liceo a cálculo",
        "start": 746.14,
        "end": 751.54
    },
    {
        "text": " 1, de cálculo 1, a cálculo 2, bueno probaron que toda sucesión de coxí converge, una",
        "start": 751.54,
        "end": 758.3
    },
    {
        "text": " sucesión es de coxí, solamente sí converge en los reales, Alexander nos adelantó,",
        "start": 758.3,
        "end": 763.3399999999999
    },
    {
        "text": " el resultado es un espacio métrico, es completo cuando toda sucesión de coxí converge,",
        "start": 763.3399999999999,
        "end": 769.14
    },
    {
        "text": " nosotros no vamos a ir hasta arriba, simplemente vamos a decir, R a la M, C a la M, todos",
        "start": 769.14,
        "end": 776.4599999999999
    },
    {
        "text": " los que trabajamos nosotros son todos completos, lo probamos y hacer así toda sucesión de",
        "start": 776.4599999999999,
        "end": 781.4599999999999
    },
    {
        "text": " coxí, del coxí converge, es muy importante, para que está el concepto de sucesión de coxí,",
        "start": 781.46,
        "end": 794.74
    },
    {
        "text": " porque vos muchas veces, o sea, cuando uno quiere probar que algo converge, así yo tengo",
        "start": 794.74,
        "end": 800.86
    },
    {
        "text": " el candidato alímito y te daba a lo largo, pero si no se el candidato alímito y te",
        "start": 800.86,
        "end": 803.96
    },
    {
        "text": " pasa, entonces el concepto aquí hizo coxí y dijo bueno, yo quiero tener una forma de ver",
        "start": 803.96,
        "end": 810.58
    },
    {
        "text": " que las cosas convergen sin saber cuál es el límite, esa es la idea y entonces vio esta",
        "start": 810.58,
        "end": 816.34
    },
    {
        "text": " definición y entonces bueno, ¿qué pasa? Provo, que en los reales, complejos, R n, etcétera,",
        "start": 816.34,
        "end": 827.98
    },
    {
        "text": " bueno, esto es un equivalente, por ejemplo, donde no es equivalente, uno que conoce en usted",
        "start": 827.98,
        "end": 832.82
    },
    {
        "text": " es muy bien, un conjunto que conoce incluso desde la escuela y donde no son equivalentes",
        "start": 832.82,
        "end": 840.0200000000001
    },
    {
        "text": " que sea convergento y de coxí, no estoy sogerando, no estoy sogerando, no estoy",
        "start": 840.02,
        "end": 845.5
    },
    {
        "text": " diciendo la verdad, de la escuela lo conoce, los naturales pero más aún un poquito los",
        "start": 845.5,
        "end": 851.6999999999999
    },
    {
        "text": " racionales, por ejemplo, los racionales, los racionales, si, los naturales no como que",
        "start": 851.6999999999999,
        "end": 860.06
    },
    {
        "text": " la definición de coxí queda media porque el el sílomo, pero los racionales, por ejemplo,",
        "start": 860.06,
        "end": 868.1
    },
    {
        "text": " no es completo, así como dije en los varios completos, los reales, los complejos, los racionales,",
        "start": 868.1,
        "end": 875.1
    },
    {
        "text": " no, porque está siendo agujero, los racionales y esos agujeros hacen, por ejemplo, si vos",
        "start": 875.1,
        "end": 880.82
    },
    {
        "text": " tomás acá raíz de dos y tomás una sucesión en los reales que tiendan raíz de dos, la",
        "start": 880.82,
        "end": 888.14
    },
    {
        "text": " dibujo en rojo, pero un asociante, por una sucesión en los racionales, que en los reales",
        "start": 888.14,
        "end": 895.14
    },
    {
        "text": " tiendan raíz de dos, todos los números racionales que se acercan por acá y si quieren",
        "start": 895.14,
        "end": 899.14
    },
    {
        "text": " por acá también, se van acercando, ¿sí? Es posible, sabemos que es posible tomar una",
        "start": 899.14,
        "end": 906.34
    },
    {
        "text": " sucesión de racionales que se van acercando, en verdad, e incluso la definición de los",
        "start": 906.34,
        "end": 909.66
    },
    {
        "text": " reales, ¿y qué pasa? Existe elímite en los reales, si existe elímite en los reales",
        "start": 909.66,
        "end": 914.58
    },
    {
        "text": " es convergentes, si es convergentes es de coxí, sin embargo si lo mirás en los racionales",
        "start": 914.58,
        "end": 921.64
    },
    {
        "text": " no es convergentes porque elímite no está en los racionales, quiere decir que hay una",
        "start": 921.64,
        "end": 927.34
    },
    {
        "text": " sucesión de coxí en los racionales, si todos los términos rojos son racionales, vamos",
        "start": 927.34,
        "end": 933.48
    },
    {
        "text": " a ponerlo así para que se que claro, los rojos son racionales, tienden a raíz de dos,",
        "start": 933.48,
        "end": 940.04
    },
    {
        "text": " en los reales, pero en los racionales no, porque no está a raíz de dos, y por lo tanto",
        "start": 940.04,
        "end": 945.1
    },
    {
        "text": " es una sucesión de coxí que en los racionales no converan, entonces hay espacio completo",
        "start": 945.1,
        "end": 950.4
    },
    {
        "text": " y hay espacio que no sea un completo, los reales son completo. Bueno, este es el",
        "start": 950.4,
        "end": 956.6
    },
    {
        "text": " concepto de sucesión de coxí y ese mismo concepto lo encuadro en verde la definición,",
        "start": 956.6,
        "end": 964.66
    },
    {
        "text": " fíjense, hasta acá por ejemplo, si quieren saquenlo distancia y ponemos la de norma,",
        "start": 964.66,
        "end": 973.84
    },
    {
        "text": " ese mismo concepto vale en muchísimas situaciones porque el único que tiene que hacer es la",
        "start": 973.84,
        "end": 978.84
    },
    {
        "text": " diferencia de los victores, tomar la norma, menor que y psícano y todo lo demás,",
        "start": 978.84,
        "end": 983.52
    },
    {
        "text": " o sea, son vectores, esto de acá pueden ser vectores, incluso pueden ser matrices, porque",
        "start": 983.52,
        "end": 990.76
    },
    {
        "text": " son vectores, son matrices, son matrices, la diferencia es un vector, la norma, menos",
        "start": 990.76,
        "end": 996.08
    },
    {
        "text": " que decir, o sea el concepto es bien general. Bueno, muy bien, ese es el concepto 4 y el",
        "start": 996.08,
        "end": 1003.12
    },
    {
        "text": " concepto 5 es un concepto que me entere ahora que ya no dan más en calculo y en el calculo",
        "start": 1003.12,
        "end": 1011.48
    },
    {
        "text": " 2, que es serie de potencia. O sí lo vieron en calculo 2, serie de la forma a su N por",
        "start": 1011.48,
        "end": 1029.52
    },
    {
        "text": " de X a la N, de N igual 0 hasta más infinito. Es eso, una más. Pero entonces ese, para",
        "start": 1029.52,
        "end": 1039.16
    },
    {
        "text": " no perder más tiempo, nos vamos al lema técnico, demostramos avanzamos y cuando llegue la hora",
        "start": 1039.16,
        "end": 1043.28
    },
    {
        "text": " de usar ese lema, mi particular en ese concepto lo retomamos. De hecho, una de las cosas que",
        "start": 1043.28,
        "end": 1048.36
    },
    {
        "text": " hice ayer y no me dio el tiempo es bajar el apostol, no el cálculos, el otro, el de análisis",
        "start": 1048.36,
        "end": 1056.4
    },
    {
        "text": " matemático que es muchísimo mejor en español, lo encontré en español, lo bajé y voy",
        "start": 1056.4,
        "end": 1062.72
    },
    {
        "text": " a poner en el Eva 4 página nada más, que son exactamente las que necesitamos para",
        "start": 1062.72,
        "end": 1067.4
    },
    {
        "text": " serie de potencia. Repito, una vez más es un concepto que yo lo vien el diseño y ahora",
        "start": 1067.4,
        "end": 1077.3600000000001
    },
    {
        "text": " o sea yo no estoy diciendo que el tiempo antes sea mejor que los de ahora, quiere decir",
        "start": 1077.3600000000001,
        "end": 1081.16
    },
    {
        "text": " mostrarles una y otra vez cómo se ha deformado mucho la formación en secundaria y el peso",
        "start": 1081.16,
        "end": 1089.92
    },
    {
        "text": " que eso les pone a ustedes y a nosotros a la hora de construir toda la currícula.",
        "start": 1089.92,
        "end": 1096.44
    },
    {
        "text": " Bueno, vamos arriba, entonces ese último punto le dejamos para ahí, no vamos a darle",
        "start": 1096.44,
        "end": 1101.3200000000002
    },
    {
        "text": " el matemico, esta de la construcción es una belleza, matemáticamente es una belleza,",
        "start": 1101.32,
        "end": 1107.84
    },
    {
        "text": " usa uno, dos y tres y es realmente como mágica. Entonces, nos vamos.",
        "start": 1107.84,
        "end": 1123.04
    },
    {
        "text": " Fíjase, consideramos primero que nada, recuerden que hay jota sua, eso ya la había",
        "start": 1123.04,
        "end": 1135.02
    },
    {
        "text": " musicrito pero lo recuerdo por acá, son equivalentes, pasamos de una o otra por conjugando",
        "start": 1135.02,
        "end": 1142.8799999999999
    },
    {
        "text": " por una invertible, espero en la clase pasábola opuesto así si no, ustedes saben que si no",
        "start": 1142.8799999999999,
        "end": 1148.8799999999999
    },
    {
        "text": " queda, pero a menos uno jota su A P, es lo mismo, no me acuerdo cómo lo puse la clase",
        "start": 1148.88,
        "end": 1154.5200000000002
    },
    {
        "text": " pasábola. Bueno, en el libro usate, pero nosotros siempre venimos poniendo P, entonces",
        "start": 1154.5200000000002,
        "end": 1163.0400000000002
    },
    {
        "text": " espero no confundirme, va a ser la que está jugando el rol de T allá, ¿no verdad? Y consideramos",
        "start": 1163.0400000000002,
        "end": 1171.5600000000002
    },
    {
        "text": " P, de hecho una función de CN cuadrado en CN cuadrado. Bueno, o sea, si quieren",
        "start": 1171.56,
        "end": 1185.76
    },
    {
        "text": " poder empezar que toma matrices y le da matrices, porque CN cuadrado son matrices en",
        "start": 1185.76,
        "end": 1189.6799999999998
    },
    {
        "text": " el por N, ¿vale? Pero ¿por qué lo dices CN cuadrado en CN cuadrado? Porque voy a usar",
        "start": 1189.6799999999998,
        "end": 1194.28
    },
    {
        "text": " toda la articería que está aquí, a la derecha. Entonces, ¿cuál es la función?",
        "start": 1194.28,
        "end": 1202.26
    },
    {
        "text": " Agarras un V, grandote, si quieren los gris o grandes porque tiene columna, es un vector",
        "start": 1202.26,
        "end": 1207.24
    },
    {
        "text": " que cada elemento es una columna V1, V2, Vn, los pongo arriba para diferenciar los subindices",
        "start": 1207.24,
        "end": 1222.16
    },
    {
        "text": " que nos hacen acordar un vector de coordenadas, ¿no? De pongo arriba en macarano, son",
        "start": 1222.16,
        "end": 1227.3200000000002
    },
    {
        "text": " subindices, ¿no? No es que esté elevado de la 1 y el cuadrado. O sea, a ver, ¿por qué",
        "start": 1227.3200000000002,
        "end": 1233.0
    },
    {
        "text": " es? Acá y N, cada uno de ellos tiene CN cuadrado, ¿no? O sea, CN cuadrado está bien, ¿cual?",
        "start": 1233.0,
        "end": 1244.72
    },
    {
        "text": " La cuenta, cada uno de ellos es un vector columna hacia la N, ¿no? Ponga los si quieren,",
        "start": 1244.72,
        "end": 1252.24
    },
    {
        "text": " cada V y pertenece hacia la N, ¿cómo hay N? El total de CN cuadrado. De hecho, bueno,",
        "start": 1252.24,
        "end": 1259.1200000000001
    },
    {
        "text": " ¿y cuánto vale? Si se llama Pgorro, tiene que ver con la P, ¿no? Y vale así, Pgorro",
        "start": 1259.1200000000001,
        "end": 1270.92
    },
    {
        "text": " este V, me tiene que dar de vuelta una matriz, o sea, un vector que tenga N columnas, y vale",
        "start": 1270.92,
        "end": 1278.0
    },
    {
        "text": " P por V subra 1, P por V subra N. Lo distinto es la notación, pero de hecho, a ver, lo que",
        "start": 1278.0,
        "end": 1302.28
    },
    {
        "text": " tiene cada casi cero acá es una matriz por una columna, una matriz por un vector, matriz",
        "start": 1302.28,
        "end": 1308.76
    },
    {
        "text": " por un vector, entonces por eso tienes, y como la matriz es cuadrada, N por N multiplicado",
        "start": 1308.76,
        "end": 1316.0
    },
    {
        "text": " por un vector de largo N, te va un vector de largo N, o sea, ahí N vectores de largo N, ¿cabien?",
        "start": 1316.0,
        "end": 1320.16
    },
    {
        "text": " Pero la que está usando es la P aquella, que sabes que es invertible, o sea, hay un dato,",
        "start": 1320.16,
        "end": 1329.3999999999999
    },
    {
        "text": " bien. Esta P techo, simplemente, observen por favor, agarras, el primer vector de N, a ver,",
        "start": 1330.4,
        "end": 1347.4
    },
    {
        "text": " miren acá el pizarrón, y a ver si están en acuerdo conmigo, ¿vos tenés N cuadrado?",
        "start": 1347.4,
        "end": 1351.72
    },
    {
        "text": " Tenés un vector de N, lo agarras ese pedacito y lo transforma y lo ponés el primer casicero,",
        "start": 1352.52,
        "end": 1360.24
    },
    {
        "text": " N, N en el lugar, se olvida, ahora agarré el segundo, lo multiplica por P, lo ponemos casi",
        "start": 1362.24,
        "end": 1371.44
    },
    {
        "text": " quieren P2 y después se olvida, entonces lo que está haciendo es lo que ya conocemos nosotros,",
        "start": 1371.44,
        "end": 1380.4
    },
    {
        "text": " ¿no? Es P, P, ¿cierto? Está haciendo lo de siempre, esta P techo tiene esta forma,",
        "start": 1380.4,
        "end": 1395.5600000000002
    },
    {
        "text": " bueno acá tendría que poner puntos suspensivos en el lugar, casero, cero, bueno,",
        "start": 1395.56,
        "end": 1412.8
    },
    {
        "text": " tendría que poner puntos suspensivos también por acá, por ahí también hay algún punto",
        "start": 1412.8,
        "end": 1417.6799999999998
    },
    {
        "text": " suspensivo que me faltan, ¿se dan cuenta eso? Lo que pasa es que es siempre P, pero si yo le",
        "start": 1417.68,
        "end": 1425.0800000000002
    },
    {
        "text": " hubiera puesto P1, P2, P3, P4, entonces cada una quedaba acledito que era entonces diferente,",
        "start": 1425.0800000000002,
        "end": 1430.28
    },
    {
        "text": " pero siempre la misma P que va transformando a los diferentes victores, cada uno es su cuadrado,",
        "start": 1430.28,
        "end": 1435.24
    },
    {
        "text": " como se sabe, en particular si quieren estar recontra invertible porque cada uno de los",
        "start": 1435.24,
        "end": 1442.18
    },
    {
        "text": " casiseros es invertible porque P es invertible, entonces estamos todos, pero además como P es",
        "start": 1442.18,
        "end": 1449.46
    },
    {
        "text": " liñal, todo esto es una transformación liñal, o sea lo que estamos diciendo es que P2",
        "start": 1449.46,
        "end": 1454.22
    },
    {
        "text": " echo construimos a partir de P1 a transformación liñal más grande, ¿por qué? Tome una matriz",
        "start": 1454.22,
        "end": 1467.38
    },
    {
        "text": " conformada por un bloquecito, son todas las transformaciones liñales, invertibles, muy bien y por lo",
        "start": 1467.38,
        "end": 1474.5
    },
    {
        "text": " tanto usando el punto 1 si es una transformación lial en particular es continua, excelente, muy bien,",
        "start": 1474.5,
        "end": 1483.66
    },
    {
        "text": " además de invertible también es contigo, entonces nosotros podemos tomar así también, ¿no?",
        "start": 1483.66,
        "end": 1490.8400000000001
    },
    {
        "text": " Es verdad, solamente porque en un rato lo vamos a necesitar, vamos de CN2, en CN2, acá hasta",
        "start": 1490.84,
        "end": 1498.12
    },
    {
        "text": " la petecho y después si yo tomo la norma en CN2 me voy a caer a los reales, me estoy aprontando",
        "start": 1498.12,
        "end": 1505.6799999999998
    },
    {
        "text": " ya que esta composición, primero petecho y después tomo la norma esto para usar dentro",
        "start": 1505.6799999999998,
        "end": 1511.0
    },
    {
        "text": " ratito y observar esto, ¿no? Ahora bien, solo me tengo una observación, sigo por acá, observación",
        "start": 1511.0,
        "end": 1517.48
    },
    {
        "text": " muy sencilla, sigo la demostración por acá, observación cortita, ¿qué pasa si la matriz",
        "start": 1517.48,
        "end": 1527.3600000000001
    },
    {
        "text": " a es la matriz? La escribo justamente con sus columbres, con el primer columbres,",
        "start": 1527.3600000000001,
        "end": 1533.56
    },
    {
        "text": " segunda columbra, o sea a 1 a 2 a n, es un vector de CN2 escrito con sus columbres, como",
        "start": 1533.56,
        "end": 1543.76
    },
    {
        "text": " está acá, ¿no? Entonces, ¿qué es lo que pasa acá? ¿Cuánto vale en este vector,",
        "start": 1543.76,
        "end": 1553.64
    },
    {
        "text": " ¿cuánto vale? Petecho de A, exactamente, P1, P2, P4A, entonces yo le voy a hacer una pregunta",
        "start": 1553.64,
        "end": 1580.3600000000001
    },
    {
        "text": " a la sala, ¿si usted tiene 2 matriz, P y A? Tás en galuno si querés, ¿cómo te enseñan",
        "start": 1580.36,
        "end": 1588.7199999999998
    },
    {
        "text": " a multiplicar P4A? ¿Cómo hacer? P4, primer columbra, P4, segunda columbra, P4 y la",
        "start": 1588.7199999999998,
        "end": 1598.1999999999998
    },
    {
        "text": " resultado lo va poniendo vertical, ¿no? Entonces lo que me estás diciendo es que esto es",
        "start": 1598.1999999999998,
        "end": 1604.4399999999998
    },
    {
        "text": " P4A, P4A1, P4A2, P4A1, ¿no? Entonces, esta construcción no es otra cosa para que el",
        "start": 1604.44,
        "end": 1619.0800000000002
    },
    {
        "text": " evaluar en A me despejora, exactamente, producto de matrices, ojo, acá ese, si quieres",
        "start": 1619.0800000000002,
        "end": 1625.2
    },
    {
        "text": " le pon un punto rojo acá, ¿quieren? Porque este es el producto de matrices, ¿cuánto",
        "start": 1625.2,
        "end": 1629.24
    },
    {
        "text": " me despejora? Porque ese producto es el proyecto de la matriz P, por la matriz A, esto",
        "start": 1629.24,
        "end": 1635.64
    },
    {
        "text": " que tenemos, a me creo que me va a quedar al revés, ¿eh? Y es que el peníxuel, pero me dejan",
        "start": 1635.64,
        "end": 1641.96
    },
    {
        "text": " hacia el trampa, acá está, y acá está jota su alma, ya está, creo que me va a quedar",
        "start": 1641.96,
        "end": 1648.72
    },
    {
        "text": " al revés, si no me iba a quedar al revés, ¿tá? Bueno, muy bien, excelente y ahora mismo",
        "start": 1648.72,
        "end": 1659.88
    },
    {
        "text": " pregunto para que no aparezca después, ¿y cuánto vale? P, te he hecho, Dala S, bueno, por",
        "start": 1659.88,
        "end": 1671.68
    },
    {
        "text": " definiciones P por A, por A, S1, digamos, el primero de este pop-up, P por A, S, N, o sea,",
        "start": 1671.68,
        "end": 1687.4
    },
    {
        "text": " que esto es P por A, ¿tá? Digo, porque lo vamos a usar en tus ratitos, las cuentas,",
        "start": 1687.4,
        "end": 1701.04
    },
    {
        "text": " que estoy preparando para que salgan todos más fáciles, pues, bueno, muy bien, entonces",
        "start": 1701.04,
        "end": 1711.44
    },
    {
        "text": " ahora es, ahora de consilar S, consiramos la esfera S, en este caso son los lectores de C",
        "start": 1711.44,
        "end": 1722.6
    },
    {
        "text": " N cuadrado, ahí está, vencm general, acá estoy parado en C N cuadrado, o tomo los lectores",
        "start": 1722.6,
        "end": 1728.0
    },
    {
        "text": " de C N cuadrado, que tienen norma exactamente igual a 1, normal exactamente igual a 1,",
        "start": 1728.0,
        "end": 1736.56
    },
    {
        "text": " esto vector de C N cuadrado, claro, podemos ser visto como matrices, que tienen norma",
        "start": 1736.56,
        "end": 1741.84
    },
    {
        "text": " 1, ¿eh? Lo que están en el peor, muy bien, entonces, ahí ahora voy a usar Bayistras, que",
        "start": 1741.84,
        "end": 1749.6
    },
    {
        "text": " se lo adelantamos, entonces, por Bayistras, lo reconoce, existe un momento que lo voy",
        "start": 1749.6,
        "end": 1759.4399999999998
    },
    {
        "text": " a llamar el mínimo X1, perteneciente a S y un momento, un valor, un vector, X2, tal",
        "start": 1759.4399999999998,
        "end": 1770.6799999999998
    },
    {
        "text": " que acá la norma de pegorro y la norma de pegorro alcanza el máximo alcanza el mínimo,",
        "start": 1770.68,
        "end": 1786.76
    },
    {
        "text": " lo que estoy usando es Bayistras, existen dos vectores, si la función no es constante,",
        "start": 1786.76,
        "end": 1796.8400000000001
    },
    {
        "text": " quiere decir que son los lectores son distintos, pero no es importante, hay que llamar, existen",
        "start": 1796.8400000000001,
        "end": 1800.44
    },
    {
        "text": " dos vectores donde se alcanza el máximo y se alcanza el por Bayistras, o sea, vieron",
        "start": 1800.44,
        "end": 1809.76
    },
    {
        "text": " que lo que estoy usando acá es esto chicos, la composición de voy a decir N2 en N2 por",
        "start": 1809.76,
        "end": 1815.0
    },
    {
        "text": " pegorro, después lo explico, estas dos funciones son continuas, esta es continuas porque es",
        "start": 1815.0,
        "end": 1819.76
    },
    {
        "text": " una transformación ideal y la norma es una función continuada, se lo vieron en el cáculo",
        "start": 1819.76,
        "end": 1825.16
    },
    {
        "text": " es, bueno, o sea vamos a llamar Pt, X1, lo voy a llamar C y Pt, X2, lo voy a llamar",
        "start": 1825.16,
        "end": 1843.2
    },
    {
        "text": " D, donde alcanza el máximo y el mínimo, por lo tanto lo que tenemos, la vez acá no,",
        "start": 1843.2,
        "end": 1851.52
    },
    {
        "text": " una conclusión porque esta de las más importantes, voy a poner una frucha, entonces C es",
        "start": 1851.52,
        "end": 1856.6
    },
    {
        "text": " menor igual, el mínimo es menor igual, que Pt, X es menor igual que D para todo X perteneciente",
        "start": 1856.6,
        "end": 1870.16
    },
    {
        "text": " a ese, como alcanza el máximo y el mínimo quiere decir que todos los valores en Ns están",
        "start": 1870.16,
        "end": 1880.92
    },
    {
        "text": " entre C y D, es impresionante como en este en este lema se utiliza de todo y conjugando",
        "start": 1880.92,
        "end": 1896.0
    },
    {
        "text": " toda esa artillería, Pt, el teorema de Perron Froben, nos va a pasar lo mismo, el teorema",
        "start": 1896.0,
        "end": 1901.8000000000002
    },
    {
        "text": " de Perron Froben es una magia, donde aparece toda la matemática para sacar un leore resultado",
        "start": 1901.8000000000002,
        "end": 1906.5600000000002
    },
    {
        "text": " más important, que sea que se usa por ejemplo para el page rank, Google y todo eso, este",
        "start": 1906.56,
        "end": 1913.34
    },
    {
        "text": " tipo de demostraciones es maravilloso, bueno, entonces, muy importante, tenés esta desigualdad",
        "start": 1913.34,
        "end": 1922.36
    },
    {
        "text": " para todos los lectores en Ns, ahora qué pasa con este vector? este vector si ya sé que",
        "start": 1922.36,
        "end": 1928.98
    },
    {
        "text": " es una matriz dividido número, pero nosotros lo estamos pensando como un vector, una",
        "start": 1928.98,
        "end": 1934.0
    },
    {
        "text": " matriz y bien, hoy olvides de este material, no importa, más en general, estoy en R77,",
        "start": 1934.0,
        "end": 1941.66
    },
    {
        "text": " 1420, no sé, a la L y tomo un vector y lo divido entre su norma, qué norma tiene,",
        "start": 1941.66,
        "end": 1950.2
    },
    {
        "text": " el cociente, uno, se acuerdan eso, porque él sale dividiendo en la norma, entonces",
        "start": 1950.2,
        "end": 1956.84
    },
    {
        "text": " que norma tiene este muchacho, uno, no nos asusta que sea, donde está Ns, tiene norma",
        "start": 1956.84,
        "end": 1969.6399999999999
    },
    {
        "text": " exactamente uno, por lo tanto, puedo tomarlo en lugar de X, en esta desigualdad, entonces",
        "start": 1969.6399999999999,
        "end": 1978.76
    },
    {
        "text": " es menor igual que la norma de pt, de a sobre norma de a, menor igual que de, cierto?",
        "start": 1978.76,
        "end": 1990.3
    },
    {
        "text": " y ahora les pregunto, me queda poco pizarrón, voy a ahorrarme alguna cuentita, pt es",
        "start": 1990.3,
        "end": 1996.4
    },
    {
        "text": " lineal, por lo tanto cualquier cociente sale para fuera, uno sobre norma de a es un numerito,",
        "start": 1996.4,
        "end": 2003.14
    },
    {
        "text": " es un número, puede salir para fuera de pt, muy bien, la norma es lineal, si yo tengo",
        "start": 2004.14,
        "end": 2010.9
    },
    {
        "text": " la norma de 2x es 2 por la norma de x, ¿no verdad? sobre todo sale para fuera sin, incluso sin valor",
        "start": 2010.9,
        "end": 2017.18
    },
    {
        "text": " absoluto cuando ya sabemos que es positivo, entonces yo puedo sacar para fuera de pt echo y de la",
        "start": 2017.18,
        "end": 2023.8600000000001
    },
    {
        "text": " norma uno sobre norma de a, cierto? y me permiten multiplicar todo por uno sobre norma de a,",
        "start": 2023.8600000000001,
        "end": 2029.18
    },
    {
        "text": " ya los aquí para fuera y multiplico todo, entonces ¿qué concluyo? que la norma de a por c es",
        "start": 2030.14,
        "end": 2039.3400000000001
    },
    {
        "text": " menor igual, ojo, a no eten por favor que los sacamos para fuera de pt echo porque pt echo",
        "start": 2039.3400000000001,
        "end": 2045.3400000000001
    },
    {
        "text": " es una transformación lineal y los sacamos para fuera de la norma porque uno sobre norma de",
        "start": 2045.3400000000001,
        "end": 2049.9
    },
    {
        "text": " es un numerito y después multiplique todo, un tesisito mientras van así mirando,",
        "start": 2049.9,
        "end": 2069.06
    },
    {
        "text": " más mirando las cuentas, esto no entendía, miras esto por esto, alguien podría preguntarse por",
        "start": 2069.06,
        "end": 2075.14
    },
    {
        "text": " qué puede vivir entre la norma de a porque podría ser cero, pero si la norma de a es cero,",
        "start": 2075.14,
        "end": 2080.06
    },
    {
        "text": " ahí es la matriz nula y por lo tanto j suá en la matriz nula y por lo tanto ya sabemos que esto",
        "start": 2080.06,
        "end": 2086.8599999999997
    },
    {
        "text": " da igual cero, si quieren ponemos en un riconcito, si a fuera nulo todo esto ya lo sabíamos,",
        "start": 2086.8599999999997,
        "end": 2093.2599999999998
    },
    {
        "text": " puedo descartar en ese caso, ¿vale? Bueno muy bien, hemos, realmente la hemos hecho",
        "start": 2093.2599999999998,
        "end": 2102.8199999999997
    },
    {
        "text": " ahora, Uri, ¿qué es lo que yo quiero probar? ¿cuestiones con este límite? ¿no verdad? ¿cuestiones",
        "start": 2105.14,
        "end": 2111.9
    },
    {
        "text": " con este límite? entonces bueno perdón me voy a hacer trampa, a ustedes de los que están anotando",
        "start": 2111.9,
        "end": 2121.94
    },
    {
        "text": " me van a enojar conmigo, lo debo prempir un dedo igual porque esta cuentita que hice acá está",
        "start": 2121.94,
        "end": 2127.3799999999997
    },
    {
        "text": " perfecta pero no lo quiero hacer para así, no para la s, porque esa es la s que tengo en gran,",
        "start": 2127.3799999999997,
        "end": 2132.5
    },
    {
        "text": " entonces, la s, la misma cuenta pero con la s, vale también pero con la s y un detasisito,",
        "start": 2132.5,
        "end": 2147.58
    },
    {
        "text": " didáctico menor, las s es acaso en números centeros que van creciendo y la s gran dota",
        "start": 2150.54,
        "end": 2156.78
    },
    {
        "text": " y la sfera, entonces confundan con las s, sólo que no le quises poner distinto a la s",
        "start": 2157.7400000000002,
        "end": 2165.26
    },
    {
        "text": " gran dota de la sfera porque en general si ya me hace por eso, por la sfera en inglés, entonces",
        "start": 2165.26,
        "end": 2174.6200000000003
    },
    {
        "text": " no quise cambiar, como en núcleo que llama que él, entonces bueno chicos, entonces tenemos este",
        "start": 2174.6200000000003,
        "end": 2181.1000000000004
    },
    {
        "text": " resultado y entonces le voy a tomar la raíz ante tomar límite, le tomo la raíz s es esima",
        "start": 2181.1,
        "end": 2190.58
    },
    {
        "text": " todo eso, lo copio abajo pero con las raíces s esimas, entonces que te queda que la raíz s esima",
        "start": 2190.58,
        "end": 2198.62
    },
    {
        "text": " de la s, la norma de la s, por la raíz s esima de un numerito en menor igual que la raíz",
        "start": 2199.3399999999997,
        "end": 2209.1
    },
    {
        "text": " s es esima, perdón, de la norma me dejan cambiar petecho de a la s por lo que dijimos que va la",
        "start": 2209.1,
        "end": 2217.58
    },
    {
        "text": " s arriba, p por a la s, la norma de p por a la s y esto menor igual que la raíz s esima",
        "start": 2217.58,
        "end": 2230.1
    },
    {
        "text": " de de por la raíz s esima de la norma de a la s, ¿de acuerdo? Y estamos casi que papá",
        "start": 2230.1,
        "end": 2246.3399999999997
    },
    {
        "text": " tía del penal, estamos casi pronto, ¿sí? Dos observaciones, voy a seguir por acá, ya usamos",
        "start": 2246.34,
        "end": 2259.42
    },
    {
        "text": " todo lo de los otros cursos, esta parte, perdón que va a quedar esto en el medio, disculpen,",
        "start": 2259.42,
        "end": 2265.6600000000003
    },
    {
        "text": " porque eso todavía no lo usamos, pero esto ya lo usamos, lo voy borrando porque así termino por acá.",
        "start": 2265.6600000000003,
        "end": 2271.98
    },
    {
        "text": " Fija el seguro y se dice, el próximo objetivo es tomar el límite cuando ese tiene más infinito,",
        "start": 2276.34,
        "end": 2292.5
    },
    {
        "text": " esto lo discutimos en la clase pasada, la raíz s esima de un número a cuánto tiende a uno y la",
        "start": 2292.5,
        "end": 2298.7000000000003
    },
    {
        "text": " raíz s esima de tiende a uno, lo que es cuando yo tome el límite lo que va a suceder es que el",
        "start": 2298.7000000000003,
        "end": 2305.94
    },
    {
        "text": " límite de lo del medio queda pretado por dos veces el mismo el límite, ¿no? El límite cuando",
        "start": 2305.94,
        "end": 2311.62
    },
    {
        "text": " ese tiene más infinito, pongan por favor que esto tiende a uno y te queda la raíz s esima",
        "start": 2311.62,
        "end": 2319.62
    },
    {
        "text": " de norma de a la s, menor igual el límite cuando ese tiene más infinito de la raíz s esima",
        "start": 2320.7400000000002,
        "end": 2330.82
    },
    {
        "text": " de p por a la s y esto menor igual que el límite cuando ese tiene más infinito de la raíz s",
        "start": 2330.82,
        "end": 2345.2200000000003
    },
    {
        "text": " esima de la norma de a la s, lo que está al izquierdo, lo que está a la derecha lo mismo,",
        "start": 2345.2200000000003,
        "end": 2351.98
    },
    {
        "text": " sí, ¿cómo es el partido que se ove, no es el p, la raíz s es el p, o sea, es el p, o sea,",
        "start": 2351.98,
        "end": 2357.42
    },
    {
        "text": " bien, vamos para que sea distinto de cero, porque si sea distinto de cero todo lo más distinto de cero,",
        "start": 2359.42,
        "end": 2366.06
    },
    {
        "text": " es una buena pregunta a su buen momento, ¿qué es ese? Se es el mínimo, si p de x1 fuera c, entonces",
        "start": 2366.06,
        "end": 2377.66
    },
    {
        "text": " p de hecho es una buena pregunta el aquiso que he ving, la tenía notar en el cuadro me había",
        "start": 2382.46,
        "end": 2386.06
    },
    {
        "text": " olvidado hacer, así que muchas gracias, ¿por qué p de hecho de x1 es distinto de cero?",
        "start": 2386.06,
        "end": 2393.02
    },
    {
        "text": " ¿por qué es c, distinto de cero? O sea, c es cero, si solamente si este es el oito nulo,",
        "start": 2398.3,
        "end": 2403.18
    },
    {
        "text": " está claro, ¿no? O sea está bien la pregunta que me hizo que me inesesta, ¿por qué este distinto",
        "start": 2403.18,
        "end": 2406.54
    },
    {
        "text": " de cero está nulo? ¿por qué? Yo lo dije, ¿por qué es cero, porque si no hay alguna o p de",
        "start": 2406.54,
        "end": 2411.9
    },
    {
        "text": " cero, ¿por qué no hay una oito nulo? Bueno, porque p de hecho que es",
        "start": 2411.9,
        "end": 2416.62
    },
    {
        "text": " invertible, y si no están a p de entonces no hay una cuesta nulo.",
        "start": 2416.62,
        "end": 2423.2599999999998
    },
    {
        "text": " Aquí si una es exactamente, porque p de hecho tiene esta forma por la definición,",
        "start": 2423.2599999999998,
        "end": 2428.7
    },
    {
        "text": " p, ahora lo que dijimos, soy cuando analizamos, v tiene su primer columnita dn, bien ep y multiplica,",
        "start": 2428.7,
        "end": 2438.22
    },
    {
        "text": " y lo ponen en el primer lugar y se olvida, ¿qué viene ahora? Arras, desde n más 1 hasta 2n,",
        "start": 2438.22,
        "end": 2445.3399999999997
    },
    {
        "text": " bien ep y multiplica, lo ponés desde n más 1 hasta 2n.",
        "start": 2445.3399999999997,
        "end": 2450.7799999999997
    },
    {
        "text": " ¿Eso es una, ya que quiera, una y una con p, 1 con p, 1 con p, 1 con p, 1 con p, 2 con p, 2 con p,",
        "start": 2450.78,
        "end": 2455.86
    },
    {
        "text": " ¿no? No, pero adjoarte que pesto una matriz ¿eh?",
        "start": 2455.86,
        "end": 2458.78
    },
    {
        "text": " ¿no? Sí, sí, o sea lo que te queda es, cuando vos haces p por v1 te queda un vector.",
        "start": 2458.78,
        "end": 2465.5800000000004
    },
    {
        "text": " Claro, v1 es una columna matriz y resultado, esta es una columna.",
        "start": 2465.5800000000004,
        "end": 2471.1400000000003
    },
    {
        "text": " ¿Es exactamente? Es como es lo que le pregunté a Sara, ¿cómo hace para mutuir que hay p,",
        "start": 2471.14,
        "end": 2482.02
    },
    {
        "text": " p, por a?",
        "start": 2482.02,
        "end": 2483.58
    },
    {
        "text": " Ahí no sería por ejemplo, se cuadra arriba de la, a izquierda no sería, p, 1, sí señor.",
        "start": 2483.58,
        "end": 2489.7
    },
    {
        "text": " Pero te quedó así después como te puedo ir por la, yo peque, te queda p, 1, p, claro,",
        "start": 2489.7,
        "end": 2496.3399999999997
    },
    {
        "text": " lo que pasa es que a la hora, cuando vos estas agueros que te queda p por a 1, p por a 2,",
        "start": 2496.34,
        "end": 2501.38
    },
    {
        "text": " p por a n y entonces ese vector en esta identificación. Acá estamos haciendo una",
        "start": 2501.38,
        "end": 2507.1400000000003
    },
    {
        "text": " identificación continuamente, por un lado y para el otro. ¿Cierto?",
        "start": 2507.1400000000003,
        "end": 2511.82
    },
    {
        "text": " vos acá tenés un vector de n cuadrado coordenadas que las primeras n son p por a 1, las",
        "start": 2511.82,
        "end": 2517.94
    },
    {
        "text": " otras son p por a 2, si los cribis como matriz, es exactamente esta matriz. O sea, la cribis",
        "start": 2517.94,
        "end": 2525.34
    },
    {
        "text": " como vector como matriz. Continuamente estamos haciendo ese juego, ¿no? Pasarlo una andratación",
        "start": 2525.34,
        "end": 2529.42
    },
    {
        "text": " a la otra.",
        "start": 2529.42,
        "end": 2530.42
    },
    {
        "text": " ¿Pasar una andratación a la otra?",
        "start": 2530.42,
        "end": 2532.42
    },
    {
        "text": " ¿Pasar que en esa matriz que haría un cuadrado que pega 1? Pues un cuadrado un poco",
        "start": 2532.42,
        "end": 2536.58
    },
    {
        "text": " más bajo, pero por quien es todo 0? ¿Cuándo es el 0? ¿No quedaría la parte de 1? ¿No",
        "start": 2536.58,
        "end": 2542.42
    },
    {
        "text": " cuesta un torcero?",
        "start": 2542.42,
        "end": 2547.9
    },
    {
        "text": " Cuando, cuando ojo, ojo, si yo envíro esto como matriz es para envidarlos solamente",
        "start": 2547.9,
        "end": 2553.5
    },
    {
        "text": " la transformación ni al, yo no estoy multiplicando esto por a, eh, todo esto por a.",
        "start": 2553.5,
        "end": 2559.9
    },
    {
        "text": " Cuando si vamos a multiplicar todo esto por a, tenés que mirarlo así de esta manera,",
        "start": 2559.9,
        "end": 2565.38
    },
    {
        "text": " así, esta. Entonces, vos agarrás y decir, viene, los primeros, las primera n coordenadas",
        "start": 2565.38,
        "end": 2574.3
    },
    {
        "text": " a 1, viene, cuando vos agas este producto, estas primeros n van a multiplicar los primeros",
        "start": 2574.3,
        "end": 2578.82
    },
    {
        "text": " n, después estos van a multiplicar los de a 2 y así, eh, se gare mal, ¿no? Tienés que",
        "start": 2578.82,
        "end": 2586.26
    },
    {
        "text": " haberse llegado así, sí, sí, no, se gare bien.",
        "start": 2586.26,
        "end": 2589.7000000000003
    },
    {
        "text": " Bueno, resulta como recordó este Nicolás, p'techo es invertible porque p es invertible,",
        "start": 2589.7000000000003,
        "end": 2598.1400000000003
    },
    {
        "text": " ¿no? Y tiene esta forma y si p'techo es invertible, por lo tanto, para que esto de 0",
        "start": 2598.1400000000003,
        "end": 2604.94
    },
    {
        "text": " es invertible, el vectonulo, sí solamente sí, x1 es el vectonulo, porque p'techo es",
        "start": 2604.94,
        "end": 2613.44
    },
    {
        "text": " invertible, pero x1 no es el vectonulo porque x1 es tan lafera, entonces no tiene b, tienen",
        "start": 2613.44,
        "end": 2622.26
    },
    {
        "text": " norma 1, no tiene norma 1, o sea, esto es absurdo, porque esto no es tan lafera, así",
        "start": 2622.26,
        "end": 2629.98
    },
    {
        "text": " que es muy buena pregunta y eso explica esto que discutimos en azul, implica que esto",
        "start": 2629.98,
        "end": 2635.82
    },
    {
        "text": " es distinto de 0 y si es en número de distinto de 0, todos los demás que son más grandes",
        "start": 2635.82,
        "end": 2640.36
    },
    {
        "text": " son distinto de 0.",
        "start": 2640.36,
        "end": 2642.22
    },
    {
        "text": " Excelente, bueno, hubo unicés, y entonces, vieron que acá yo ya lo escribí sacándoles",
        "start": 2642.22,
        "end": 2650.3
    },
    {
        "text": " los límites de la raíz es ese décima de de y se den, ¿verdad? Y te les he estado",
        "start": 2650.3,
        "end": 2654.54
    },
    {
        "text": " abres igual a lo del izquierdo, de la derecha lo mismo, entonces lo que está diciendo es",
        "start": 2654.54,
        "end": 2657.78
    },
    {
        "text": " que el comportamiento de esta sucesión, la de la raíz es ese, este coincide con",
        "start": 2657.78,
        "end": 2666.34
    },
    {
        "text": " el comportamiento de esta sucesión, o sea, esta va a ser lo que haga esto.",
        "start": 2666.34,
        "end": 2671.1000000000004
    },
    {
        "text": " Bueno, y entonces, casi que estamos pronto, o sea, pero yo aprofé y quiero llegar a",
        "start": 2671.1000000000004,
        "end": 2677.7400000000002
    },
    {
        "text": " jota a la ese, pero este truco le hemos hecho muchas veces, primero, así como logramos",
        "start": 2677.7400000000002,
        "end": 2684.7200000000003
    },
    {
        "text": " esta desigualdad multiplicando por pelear a la izquierda con todo este trabajo, definiendo",
        "start": 2684.72,
        "end": 2689.1
    },
    {
        "text": " p, petecho de esta manera, obviamente puede hacer todo el trabajo y si hemos esta parte,",
        "start": 2689.1,
        "end": 2697.74
    },
    {
        "text": " se lo pongo en verde acá, y si hemos esta parte, ahora podríamos hacer todo el mismo",
        "start": 2697.74,
        "end": 2704.8799999999997
    },
    {
        "text": " trabajo para que, para esta parte, o sea, multiplicar por pelear a menos 1 a la derecha,",
        "start": 2704.8799999999997,
        "end": 2711.24
    },
    {
        "text": " todo lo mismo, arranco, definiendo p, p, p, p y todo en vez de p, p, p, p, p, p, n sería",
        "start": 2711.24,
        "end": 2718.54
    },
    {
        "text": " p, p, a la menos 1, etcétera, etcétera, todo el trabajo, toda la interpretación y",
        "start": 2718.54,
        "end": 2725.4399999999996
    },
    {
        "text": " qué lo que lograríamos al final, entonces analoagamente, lograríamos que el límite, cuando",
        "start": 2725.4399999999996,
        "end": 2737.6
    },
    {
        "text": " es el límite, tiene más infinito, porque en esta dos partes no tiene que ver con p,",
        "start": 2737.6,
        "end": 2743.52
    },
    {
        "text": " esto quedó quietito, ¿no? La raíz, bueno, sería así, formalmente, se lo aplicaría",
        "start": 2743.52,
        "end": 2754.72
    },
    {
        "text": " a p por a la s, ¿no? Entonces quedaría de p por a la s, el límite, cuando es el",
        "start": 2754.72,
        "end": 2763.22
    },
    {
        "text": " límite, es así infinito, la raíz s e, de p por a la s, por pelear a menos 1 a la",
        "start": 2763.22,
        "end": 2773.68
    },
    {
        "text": " s, ¿pron? Ya puse a la s adentro, menor igual que al límite, cuando es el tiende más",
        "start": 2773.68,
        "end": 2783.98
    },
    {
        "text": " infinito, de la raíz s e, de a la s, ¿ok? ¿pron? De p por a la s, pero el primero",
        "start": 2783.98,
        "end": 2798.1
    },
    {
        "text": " y el tercero, ya sabemos que coincide por la parte anterior, con el límite, cuando",
        "start": 2798.1,
        "end": 2804.58
    },
    {
        "text": " es el tiende más infinito, de la raíz s e, de a la s, y esto es igual al límite, de la",
        "start": 2804.58,
        "end": 2817.9
    },
    {
        "text": " raíz s e, de a la s, ¿este igual lo marco en azul? ¿este igual? ¿está doble de s igual",
        "start": 2817.9,
        "end": 2830.2999999999997
    },
    {
        "text": " de s, ¿sabes a doble de s igual? ¿sierto? Y lo que estoy diciendo es que todo el trabajo",
        "start": 2831.3,
        "end": 2843.1400000000003
    },
    {
        "text": " que hicimos hasta llegar a esta desigualdad podríamos volver a hacerlo para pela a menos 1",
        "start": 2843.1400000000003,
        "end": 2847.98
    },
    {
        "text": " a la derecha y obtendríamos esta otra desigualdad. Conclusión final, la conclusión final es que el",
        "start": 2847.98,
        "end": 2855.6200000000003
    },
    {
        "text": " límite, cuando es el tiende más infinito, de la raíz s e, de a la s coincide con el límite,",
        "start": 2855.62,
        "end": 2865.22
    },
    {
        "text": " cuando es el tiende más infinito, de la raíz s e, y me dejan cambiar un poquito acá,",
        "start": 2865.22,
        "end": 2872.66
    },
    {
        "text": " esto hicimos si me embece, o sea, mil veces, p a la s por p a la m e 1, que lo pongo p a,",
        "start": 2874.18,
        "end": 2879.54
    },
    {
        "text": " p a la p a la p a la m e 1, o sea, j a la s y este es lo que nos pedía el límite.",
        "start": 2879.54,
        "end": 2892.54
    },
    {
        "text": " Yo la maravilla, la demostración que ofrece el libro es maravillosa,",
        "start": 2897.5,
        "end": 2903.62
    },
    {
        "text": " es una delicadeza de la matemática, incluso con la parte azul de la pregunta de Kevin,",
        "start": 2904.62,
        "end": 2912.62
    },
    {
        "text": " que nos sabíamos olvidado, es como utilizar todas las herramientas para allá no hacer casi cuentas",
        "start": 2912.62,
        "end": 2922.42
    },
    {
        "text": " y poder probar un resultado que sería de un cuenterío brutal, esto en el fondo es un cuenterío",
        "start": 2922.42,
        "end": 2929.94
    },
    {
        "text": " brutal y no estamos esquivando completamente el cuenterío con interpretaciones y usando",
        "start": 2929.94,
        "end": 2935.82
    },
    {
        "text": " todas las herramientas matemáticas que conocemos. Muy bien, muy bien, muy bien, muy bien, excelente,",
        "start": 2935.82,
        "end": 2945.02
    },
    {
        "text": " niños, excelente. Bueno, si no hay preguntas y bien esta media hora que nos queda y me iría",
        "start": 2945.02,
        "end": 2955.2200000000003
    },
    {
        "text": " la última sección que es de la serie de potencia, pero tenemos un tiempito para hacer preguntas.",
        "start": 2955.22,
        "end": 2962.62
    },
    {
        "text": " Resultado final es que bosco el límite, cuando ese tiene más infinito de la norma de la s,",
        "start": 2967.18,
        "end": 2971.8199999999997
    },
    {
        "text": " la rey se esísima, calculas de esa manera el radio espectral de la matriz. Y ese radio espectral",
        "start": 2971.8199999999997,
        "end": 2982.4199999999996
    },
    {
        "text": " ya apareció el fundamental para la convergencia de las potencias de la s.",
        "start": 2982.42,
        "end": 2987.98
    },
    {
        "text": " Bueno, entonces mientras terminan de asimilar el resultado anterior, comienzo con la sección 4.5.",
        "start": 2993.26,
        "end": 3001.46
    },
    {
        "text": " Esta. Sí, por el teniendo, por el elevador a la de 1 por la de 1. Claro, porque el truco es",
        "start": 3012.42,
        "end": 3022.06
    },
    {
        "text": " lo mismo, mira acá, mira acá, bosco lo que te permitiste con todo el trabajo hasta este",
        "start": 3022.06,
        "end": 3026.94
    },
    {
        "text": " momento es que la del medio la puedes multiplicar por peal izquierda y se mantiene la desigualdad.",
        "start": 3026.94,
        "end": 3032.82
    },
    {
        "text": " Ahora haciendo todo el truco, pero en vez de la construcción para peal a menos 1, lo que te",
        "start": 3033.82,
        "end": 3042.7400000000002
    },
    {
        "text": " permitices que desaparezca peal a menos 1 de la derecha, realidad, de los dos laterales.",
        "start": 3042.7400000000002,
        "end": 3049.26
    },
    {
        "text": " Es eso, eso es exactamente, nos ahorramos hacer todo lo mismo, por eso es exactamente igual,",
        "start": 3049.26,
        "end": 3055.5
    },
    {
        "text": " pero para peal a menos 1 al lado derecho. Está bien, se entendió. Zara, Martin, bien, entonces",
        "start": 3055.5,
        "end": 3064.82
    },
    {
        "text": " nos vamos a hacer y de potencia. La serie de potencia tiene en esa forma",
        "start": 3064.82,
        "end": 3072.66
    },
    {
        "text": " el igual cero hasta más infinito y esta x si tiramos en cálculo 1 sería un real.",
        "start": 3072.66,
        "end": 3089.8199999999997
    },
    {
        "text": " Claro, bueno, depende, si podría ser un complejo si el curso fue un poquito más amplio y de",
        "start": 3091.8199999999997,
        "end": 3101.1
    },
    {
        "text": " hecho si le meto en norma podría estar hablando de otras cosas también, ¿verdad? Entonces, lo",
        "start": 3101.1,
        "end": 3110.5
    },
    {
        "text": " que se acordó, Martin, voy a borrar un segundo, es esto, esta converge si la norma de x es",
        "start": 3110.5,
        "end": 3115.8199999999997
    },
    {
        "text": " menor que 1, cierto, y me interesa esto porque además no se le meten con verge si la norma",
        "start": 3115.8199999999997,
        "end": 3121.86
    },
    {
        "text": " de si el valor absoluto o norma es menor que 1, sino que sabemos a cuánto converge, ¿se",
        "start": 3121.86,
        "end": 3128.22
    },
    {
        "text": " se acuerdan? ¿a cuánto converge? A 1 sobre 1 menos x, ¿se acuerdan? Que lo usamos también",
        "start": 3128.22,
        "end": 3133.3799999999997
    },
    {
        "text": " en discreta 1, esto, ¿sí? ¿Por qué? Porque la sumatoria es en igual cero hasta acá de x",
        "start": 3133.3799999999997,
        "end": 3142.9399999999996
    },
    {
        "text": " a la n, ¿se acuerdan? Que valía 1 menos x a la cama 1 sobre 1 menos x, ¿se acuerdan?",
        "start": 3142.9399999999996,
        "end": 3149.4599999999996
    },
    {
        "text": " Si vos haces este producto por esto se va a todo y te queda el primero y el último, ¿sí?",
        "start": 3149.4599999999996,
        "end": 3154.22
    },
    {
        "text": " esto se cuando vos tomás, ¿qué es tomar la serie este infinito? Estomar el cátendidio",
        "start": 3154.22,
        "end": 3159.18
    },
    {
        "text": " infinito y entonces vienen acá, ¿si tomás el cátendidio infinito? Si la norma de x es",
        "start": 3159.18,
        "end": 3165.14
    },
    {
        "text": " menor que 1, este pedazo se va a 0, este esta restando se va a 0, entonces te queda esto",
        "start": 3165.14,
        "end": 3170.4599999999996
    },
    {
        "text": " otro, ¿sí? Nada grave. ¿Qué son las series de potencia? Un pasito más, o sea que te",
        "start": 3170.4599999999996,
        "end": 3176.66
    },
    {
        "text": " permitas vuelvo a lo que estaba escrito antes, lo pongo en rojo para que se veía bien el",
        "start": 3176.66,
        "end": 3182.14
    },
    {
        "text": " cambio, en vez de tener siempre el coeficiente 1, 1, 1, 1, 1, 1, 1, que te permitas multiplicar",
        "start": 3182.14,
        "end": 3188.8599999999997
    },
    {
        "text": " acá por una sucesión a su n, a su cero, por que se le acero, a su 1, por que se le",
        "start": 3188.8599999999997,
        "end": 3193.66
    },
    {
        "text": " a 1. Y acá el problema ahí está, ¿cuál es converso o no comerje? Y eso es lo que quiero",
        "start": 3193.66,
        "end": 3201.42
    },
    {
        "text": " que lo lean en el a postol, pero esencialmente esto tiene un radio de convergencia, lo que",
        "start": 3201.42,
        "end": 3207.2999999999997
    },
    {
        "text": " se llama el radio de convergencia. Yo lo voy a dibujar en los complejos para que se vea más",
        "start": 3207.3,
        "end": 3226.9
    },
    {
        "text": " lindo, pero tiene su versión en los reales, pues de puesto, ¿no? Un detalle, antes de escribir",
        "start": 3226.9,
        "end": 3238.1
    },
    {
        "text": " la de convergencia, pero ya empezamos a utilizar la notación habitual. Si a su n es siempre",
        "start": 3238.1,
        "end": 3247.78
    },
    {
        "text": " 1, el radio convergencia es 1, es el que me dijeron a ustedes, si a su n es 1, 1, 1, 1,",
        "start": 3247.78,
        "end": 3252.78
    },
    {
        "text": " el radio convergencia es 1, pero el radio convergencia va a depender de que empone de la su n, por",
        "start": 3252.78,
        "end": 3258.34
    },
    {
        "text": " ejemplo, por que si yo pongo 2, 2, 2, 2, 2, creo que el radio convergencia sigue siendo 1,",
        "start": 3258.34,
        "end": 3263.02
    },
    {
        "text": " pero si yo pongo 2 a la n, miren, un ejemplo, si yo pongo la serie 2 a la n por x a la n,",
        "start": 3263.02,
        "end": 3272.42
    },
    {
        "text": " ¿cuál será el radio de convergencia? Meten el 2 para dentro con la x, o sea esto es lo",
        "start": 3272.42,
        "end": 3279.98
    },
    {
        "text": " mismo que la serie 2 por x a la n, olvides que eso por x se llama griega ahora, y griega la n,",
        "start": 3279.98,
        "end": 3291.62
    },
    {
        "text": " o sea tiene la forma de la de antes, esto es acá, ¿cuál será el radio convergencia?",
        "start": 3291.62,
        "end": 3296.7400000000002
    },
    {
        "text": " Que el módulo de ahí tiene que ser menor que 1, es 1, es 1, exactamente, entonces si",
        "start": 3296.7400000000002,
        "end": 3302.5
    },
    {
        "text": " está bien afectado el radio convergencia es 1, 1, 1, entonces va a depender de a su n,",
        "start": 3302.5,
        "end": 3307.7
    },
    {
        "text": " ¿cuál será el radio convergencia? Ahora bien, para cada x, tanto sean los reales o",
        "start": 3307.7,
        "end": 3314.7
    },
    {
        "text": " los complejos, pues tenés una serie de tinta, ¿no? Si tenés x, porque usted me dijeron cualquier",
        "start": 3314.7,
        "end": 3321.1
    },
    {
        "text": " equil de módulo menor que 1, converge, entonces para cualquier x, pues tenés una serie de tinta,",
        "start": 3321.1,
        "end": 3327.3399999999997
    },
    {
        "text": " y entonces esto se llama fdx, le vamos a dar un nombre, fdx, porque es una función que depende",
        "start": 3327.3399999999997,
        "end": 3332.74
    },
    {
        "text": " sobre todo en la parte que convergen, la parte que divergen, ¿no? porque da más infinito.",
        "start": 3333.4599999999996,
        "end": 3337.74
    },
    {
        "text": " Y entonces este radio de convergencia se llama rdf, el radio de convergencia de la función,",
        "start": 3337.74,
        "end": 3346.74
    },
    {
        "text": " porque la serie de potencia, todo esto se llama serie de potencia, las series de potencias",
        "start": 3346.74,
        "end": 3355.74
    },
    {
        "text": " definitiva definen funciones, que si alguien hizo o va a ser análisis complejo en la facultad",
        "start": 3356.74,
        "end": 3367.74
    },
    {
        "text": " o en otro lugar son el pan de todos los días, la serie de potencia, las funciones definidas",
        "start": 3367.74,
        "end": 3375.74
    },
    {
        "text": " bueno, entonces acá hay un radio de convergencia, adentro digamos converge y afuera de",
        "start": 3376.74,
        "end": 3392.74
    },
    {
        "text": " ser radio convergencia diverge, hasta así le voy a poner de convergencia, le voy a poner",
        "start": 3393.74,
        "end": 3405.74
    },
    {
        "text": " converge para que no se mezclen con la cera de los complejos, ese comportamiento, ese es el",
        "start": 3405.74,
        "end": 3413.74
    },
    {
        "text": " comportamiento que tiene la serie de potencias, ¿vale? Parece que lo que estoy diciendo es nada,",
        "start": 3413.74,
        "end": 3420.74
    },
    {
        "text": " no, Uri se hace muy importante lo que estoy diciendo, porque si se dan cuenta estamos diciendo que la",
        "start": 3420.74,
        "end": 3427.74
    },
    {
        "text": " convergencia o no de la serie de potencias se da para un círculo todos los puntos que están",
        "start": 3427.74,
        "end": 3433.74
    },
    {
        "text": " adentro de un círculo de radio fijo, radio ahí, ¿por qué? Porque en principio Uri se",
        "start": 3433.74,
        "end": 3439.74
    },
    {
        "text": " dice ¿por qué no convergen este pedacito acá en la mia de los complejos? Ad converge acá,",
        "start": 3439.74,
        "end": 3444.74
    },
    {
        "text": " no, es muy importante lo que estamos diciendo, la serie de potencias se comporta muy,",
        "start": 3444.74,
        "end": 3449.74
    },
    {
        "text": " muy bien, hay un círculo adentro convergen a fuera de divergen y en el borde puede pasar",
        "start": 3449.74,
        "end": 3455.74
    },
    {
        "text": " cualquier cosa, el radio de convergencia depende de la sución de suene, por ejemplo en este caso",
        "start": 3455.74,
        "end": 3462.74
    },
    {
        "text": " 2 a la n, hace que el radio de convergencia pase de 1 a un medio, si fuera 3 a la n ya divina,",
        "start": 3462.74,
        "end": 3469.74
    },
    {
        "text": " pasa de 1 a un tercio, pero a suene ni siquiera tiene que ser de la forma exponencial,",
        "start": 3470.74,
        "end": 3474.74
    },
    {
        "text": " a suene puede ser cualquier sucesión, 1 a 1, 1 a 1 a 1 a 1 a 1 a 1 a 1, por ejemplo.",
        "start": 3474.74,
        "end": 3479.74
    },
    {
        "text": " ¿Por qué le hicimos acá? Esto les igualado por aquí se la n, cambia variable 2 por aquí",
        "start": 3479.74,
        "end": 3488.74
    },
    {
        "text": " si igual y esto lo ves como en la sumatoria, este ejemplo, estoy hablando, ¿no? De y a la n,",
        "start": 3488.74,
        "end": 3494.74
    },
    {
        "text": " esta ya sabes que esta tiene el radio de convergencia 1 para la y griega, pero el radio de convergencia",
        "start": 3494.74,
        "end": 3501.74
    },
    {
        "text": " 1 para la y griega implica que para la a x, la de convergencia 1 medio, ¿sabé?",
        "start": 3501.74,
        "end": 3506.74
    },
    {
        "text": " Entonces quiere decir que el radio de convergencia de esta, el radio de convergencia de esta",
        "start": 3506.74,
        "end": 3513.74
    },
    {
        "text": " digamos f de x de la roja es 1 medio y de la n, ¿qué está aquí está acá?",
        "start": 3513.74,
        "end": 3521.74
    },
    {
        "text": " Está digamos a más infinito, porque acá ya le puse la parte roja, ¿no?",
        "start": 3522.74,
        "end": 3529.74
    },
    {
        "text": " Esta tiene el radio de convergencia 1, etcétera, ¿no?",
        "start": 3529.74,
        "end": 3535.74
    },
    {
        "text": " Es muy importante que el comportamiento es así tan clarito, convergi y afuera divergi.",
        "start": 3535.74,
        "end": 3541.74
    },
    {
        "text": " Hay algunas que divergen en todos los puntos y hay otras que son los convergen en 0,",
        "start": 3541.74,
        "end": 3547.74
    },
    {
        "text": " claro para a x igual a 0 siempre comerje este evidencio, ¿no?",
        "start": 3548.74,
        "end": 3552.74
    },
    {
        "text": " Bueno, dicho esto, eso es lo que llama serie de potencia.",
        "start": 3552.74,
        "end": 3556.74
    },
    {
        "text": " Y esto de poner, no es este digamos un antojo del profesor, llamado f de x a esto,",
        "start": 3560.74,
        "end": 3568.74
    },
    {
        "text": " es que realmente definen funciones para cada punto, ¿cuánto vale?",
        "start": 3568.74,
        "end": 3574.74
    },
    {
        "text": " Bueno acá está la función, en este caso lo sabemos calcular, este ejemplo que usamos en cálculo 1,",
        "start": 3575.74,
        "end": 3579.74
    },
    {
        "text": " mucha vez, es que se llama la serie geométrica, esta sería f de x,",
        "start": 3579.74,
        "end": 3584.74
    },
    {
        "text": " lo usaron en el discreto también, esta sería la f de x, 1 sobre 1,1 x,",
        "start": 3584.74,
        "end": 3588.74
    },
    {
        "text": " ¿a cuánto converge esta serie? ¿a 1 sobre 1,1 x?",
        "start": 3588.74,
        "end": 3591.74
    },
    {
        "text": " Esta es la función, 1 sobre 1,1 x, ¿no? ¿en cuenta?",
        "start": 3591.74,
        "end": 3594.74
    },
    {
        "text": " Y acá pueden calcular también cuanto a eso.",
        "start": 3594.74,
        "end": 3597.74
    },
    {
        "text": " Y ustedes hicieron en el discreto 1, la opción discreta 1,1 un montón y con la parte de esta de funciones general trices,",
        "start": 3597.74,
        "end": 3603.74
    },
    {
        "text": " un montón de transformaciones usando esta, o sea que ya saben hacer cuentas acá,",
        "start": 3603.74,
        "end": 3608.74
    },
    {
        "text": " si repasan los desfunciones general trices, nunca le dijeron que había un problema de límite,",
        "start": 3608.74,
        "end": 3614.74
    },
    {
        "text": " un problema topológico de análisis, etc., simplemente decimos cuentas en discreto 1,",
        "start": 3614.74,
        "end": 3621.74
    },
    {
        "text": " con lo que se llama la función general trices, o sea que realmente saben calcular unas cuantas funciones de estas,",
        "start": 3621.74,
        "end": 3628.74
    },
    {
        "text": " y esas funciones de donde van, y bueno, de los complejos, en los reales, o de los reales,",
        "start": 3629.74,
        "end": 3636.74
    },
    {
        "text": " en los reales, ¿eh? Y si voy a le ponen norma entre realidad,",
        "start": 3636.74,
        "end": 3642.74
    },
    {
        "text": " podríamos haber tomado vectores más grandes, en vez de poner a suene,",
        "start": 3642.74,
        "end": 3647.74
    },
    {
        "text": " por ir y salir a la n, pongo a suene, por norma de x a la n, podríamos tomar vectores",
        "start": 3647.74,
        "end": 3652.74
    },
    {
        "text": " en otros espacios, y ese es el trugo que vamos a hacer para tomar las matrices,",
        "start": 3652.74,
        "end": 3657.74
    },
    {
        "text": " y eso es lo que se hace, o consideras ahora voy a lo que nos interesa,",
        "start": 3657.74,
        "end": 3665.74
    },
    {
        "text": " consideramos una matriz a y lambda n, una sucesión de complejos,",
        "start": 3665.74,
        "end": 3677.74
    },
    {
        "text": " el número complejos, y entonces consideramos, o mirás,",
        "start": 3678.74,
        "end": 3684.74
    },
    {
        "text": " lambda 0 por la identidad, esto es una matriz, la identidad n por n,",
        "start": 3684.74,
        "end": 3689.74
    },
    {
        "text": " después le sumo lambda 0 por la identidad más lambda 1 por la matriz a,",
        "start": 3689.74,
        "end": 3697.74
    },
    {
        "text": " bueno, esta es otra matriz, le sumo, ya saben, lo que viene ahora,",
        "start": 3697.74,
        "end": 3704.74
    },
    {
        "text": " lambda 0 por la identidad, más lambda 1 por a, más lambda 2 por acuadrado,",
        "start": 3704.74,
        "end": 3711.74
    },
    {
        "text": " y ahí tienes otra matriz, sigo, sigo, sigo, sigo, sigo, sigo,",
        "start": 3711.74,
        "end": 3714.74
    },
    {
        "text": " el término general lambda 0 por la identidad, más lambda 1 por a,",
        "start": 3714.74,
        "end": 3720.74
    },
    {
        "text": " más lambda n por a a la n, ¿cierto? Y eso es otra matriz,",
        "start": 3720.74,
        "end": 3727.74
    },
    {
        "text": " el problema está, ¿qué pasa? Esto, converge, esta es una sucesión de matrices,",
        "start": 3727.74,
        "end": 3738.74
    },
    {
        "text": " lo solo sabemos, trabajar con sucesión de matrices, converge o no converge,",
        "start": 3738.74,
        "end": 3742.74
    },
    {
        "text": " ¿qué es esta sucesión de matrices? Es esto, ¿urice?",
        "start": 3742.74,
        "end": 3747.74
    },
    {
        "text": " La sucesión lambda s por a la s, desde s igual 0 hasta más infinito,",
        "start": 3747.74,
        "end": 3758.74
    },
    {
        "text": " ese es nuestro propósito, analizar eso, ¿vale?",
        "start": 3760.74,
        "end": 3764.74
    },
    {
        "text": " Si se llama serie de potencias de A, es una serie de potencias de A.",
        "start": 3764.74,
        "end": 3774.74
    },
    {
        "text": " Todo lo sabemos hacer, ¿vale?",
        "start": 3777.74,
        "end": 3781.74
    },
    {
        "text": " Todos estas cosas lo vamos a hacer, porque profesión no dice serie,",
        "start": 3782.74,
        "end": 3786.74
    },
    {
        "text": " no, una serie no es otra cosa con una sucesión,",
        "start": 3786.74,
        "end": 3789.74
    },
    {
        "text": " la serie, este concepto es el límite de las sumas parciales, ¿sí?",
        "start": 3789.74,
        "end": 3796.74
    },
    {
        "text": " Si a esta última les llamamos s,m a la primera les llamamos s0,",
        "start": 3796.74,
        "end": 3804.74
    },
    {
        "text": " s1, s2, y esta última, s,m las sumas parciales, esos sí nos enseñaron",
        "start": 3804.74,
        "end": 3811.74
    },
    {
        "text": " en calcular 1, calcular 2, ¿no sé?",
        "start": 3811.74,
        "end": 3818.74
    },
    {
        "text": " Entonces, el concepto este tiene sentido, esta clarito acá,",
        "start": 3822.74,
        "end": 3831.74
    },
    {
        "text": " pero vamos a formalizarlo, nuestra otra cosa, que el límite,",
        "start": 3831.74,
        "end": 3838.74
    },
    {
        "text": " cuando es, tiene más infinito, vamos a poner el límite,",
        "start": 3838.74,
        "end": 3849.74
    },
    {
        "text": " tiene más infinito, de las s,m, de las sumas parciales, ¿vale?",
        "start": 3849.74,
        "end": 3858.74
    },
    {
        "text": " Muy bien, puede ser un ejemplo rápido,",
        "start": 3858.74,
        "end": 3870.74
    },
    {
        "text": " porque así vamos al resultado central, y después se sienta resultado,",
        "start": 3870.74,
        "end": 3877.74
    },
    {
        "text": " me parece que la voy a decir, pero la voy a omitir en la prueba,",
        "start": 3877.74,
        "end": 3881.74
    },
    {
        "text": " yo la había preparado, pero no nos va del tiempo.",
        "start": 3881.74,
        "end": 3884.74
    },
    {
        "text": " El ejemplo muy rápido, muy sencillo,",
        "start": 3884.74,
        "end": 3891.74
    },
    {
        "text": " están en el libro, también el libro está para mí,",
        "start": 3891.74,
        "end": 3894.74
    },
    {
        "text": " tiene el error de cuentas, pero la idea está muy bien,",
        "start": 3894.74,
        "end": 3897.74
    },
    {
        "text": " toma la idea del libro, si considero a la matriz 0,",
        "start": 3897.74,
        "end": 3903.74
    },
    {
        "text": " 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0,",
        "start": 3903.74,
        "end": 3912.74
    },
    {
        "text": " y quiero ver si tiene sentido y cuánto da esta serie.",
        "start": 3912.74,
        "end": 3919.74
    },
    {
        "text": " Ya en este momento, el propio Poder Sider y el Profeta de Locoh,",
        "start": 3919.74,
        "end": 3923.74
    },
    {
        "text": " no solamente en los enseños, sus sesiones de matrices,",
        "start": 3923.74,
        "end": 3926.74
    },
    {
        "text": " ahora toma la serie de potencia de una matriz, ya se está pirando,",
        "start": 3926.74,
        "end": 3932.74
    },
    {
        "text": " y sin embargo es sencillísimo, gurises, la matemática,",
        "start": 3932.74,
        "end": 3936.74
    },
    {
        "text": " cuando está bien desarrolladita, están en ciencia,",
        "start": 3936.74,
        "end": 3941.74
    },
    {
        "text": " hagamos cuenta juntos, gurises, por las dudas,",
        "start": 3941.74,
        "end": 3945.74
    },
    {
        "text": " esto es 0, 1, 1, 1, 1, 2, al cubo, cierto, y 0, ¿no verdad?",
        "start": 3945.74,
        "end": 3952.74
    },
    {
        "text": " Cuando ases al cuadrado, ¿cuánto da?",
        "start": 3952.74,
        "end": 3955.74
    },
    {
        "text": " Vamos a ser rapidito, calculo por acá,",
        "start": 3955.74,
        "end": 3961.74
    },
    {
        "text": " ¿cuadrado? ¿cuánto da?",
        "start": 3961.74,
        "end": 3965.74
    },
    {
        "text": " Hayba 1 sobre 2, el a 4, 0, 0, 1, 2, el a 4, cierto?",
        "start": 3965.74,
        "end": 3973.74
    },
    {
        "text": " ¿Sí? Y se hago al cubo, al cuadrado y lo multiplico por acá,",
        "start": 3973.74,
        "end": 3980.74
    },
    {
        "text": " entonces vuelve para el otro lado y te queda 0, 1 sobre 2, 0, 5,",
        "start": 3980.74,
        "end": 3984.74
    },
    {
        "text": " porque este se multiplica 1, 1, 1, 1 sobre 2, el a 8, 0, cierto?",
        "start": 3984.74,
        "end": 3990.74
    },
    {
        "text": " Y vamos a ser uno más, al a 4, ¿cuánto da?",
        "start": 3991.74,
        "end": 3995.74
    },
    {
        "text": " ¿cuándo es 2, el a 9?",
        "start": 4001.74,
        "end": 4004.74
    },
    {
        "text": " A la 9, ¿vale?",
        "start": 4004.74,
        "end": 4007.74
    },
    {
        "text": " ¿cuándo es 2, el a 8 por 1, el a 9?",
        "start": 4007.74,
        "end": 4012.74
    },
    {
        "text": " No, pero es 1 sobre 2, el a 4, ¿es este por este, ¿no?",
        "start": 4012.74,
        "end": 4015.74
    },
    {
        "text": " No, pero si hago este por...",
        "start": 4015.74,
        "end": 4019.74
    },
    {
        "text": " No, a por a 3, le vimos, ¿cuánto da?",
        "start": 4019.74,
        "end": 4022.74
    },
    {
        "text": " Claro, si hacemos a 3 por 1 medio, ¿cuánto da?",
        "start": 4022.74,
        "end": 4029.74
    },
    {
        "text": " ¿A 0?",
        "start": 4029.74,
        "end": 4031.74
    },
    {
        "text": " Sí, algo mala, acá puse mal, acá puse mal, ¿no?",
        "start": 4036.74,
        "end": 4040.74
    },
    {
        "text": " Acá puse mal, acá es 7, gracias.",
        "start": 4040.74,
        "end": 4042.74
    },
    {
        "text": " Yo me equivoqué, acá es 7, ¿no?",
        "start": 4042.74,
        "end": 4045.74
    },
    {
        "text": " 4 y 3, 7, yo mal, ¿vale?",
        "start": 4045.74,
        "end": 4048.74
    },
    {
        "text": " 4 y 7, entonces ahora sí, ¿qué? ¿no?",
        "start": 4048.74,
        "end": 4051.74
    },
    {
        "text": " ¿qué da 2 al a 8, 0, 0?",
        "start": 4051.74,
        "end": 4054.74
    },
    {
        "text": " Ahí va, ahí vamos, he hecho ese rorsito.",
        "start": 4054.74,
        "end": 4057.74
    },
    {
        "text": " Y así sigue la cosa.",
        "start": 4057.74,
        "end": 4059.74
    },
    {
        "text": " Para los casos pares tiene una forma, para los casos sin pares tiene otra forma, ¿no?",
        "start": 4059.74,
        "end": 4063.74
    },
    {
        "text": " ¿no? ¿y vos quieres sumar las todas?",
        "start": 4063.74,
        "end": 4065.74
    },
    {
        "text": " Quiero sumar a, a, a cuadrado, a cubo, pimp, pimp, pimp, pimp, pimp.",
        "start": 4065.74,
        "end": 4069.74
    },
    {
        "text": " ¿cuánto da esa suma?",
        "start": 4069.74,
        "end": 4072.74
    },
    {
        "text": " Bueno, hagamos juntos acá.",
        "start": 4075.74,
        "end": 4077.74
    },
    {
        "text": " La suma de los a, la s, te queda a los pares por un lado si quieres.",
        "start": 4077.74,
        "end": 4082.74
    },
    {
        "text": " Aquí vamos de los pares, a la, a la 12, más la suma de los impares.",
        "start": 4083.74,
        "end": 4091.74
    },
    {
        "text": " A a la 12, es más 1.",
        "start": 4092.74,
        "end": 4096.74
    },
    {
        "text": " Sumamos los pares.",
        "start": 4097.74,
        "end": 4099.74
    },
    {
        "text": " En los pares no olvidemos el 0, ¿o qué está la identidad también, ¿eh?",
        "start": 4100.74,
        "end": 4103.74
    },
    {
        "text": " A la 0, al cuadrado, ¿eh?",
        "start": 4104.74,
        "end": 4107.74
    },
    {
        "text": " Entonces, lo que, fijate que lo que tenés que hacer es, en la, en la antidiagonal,",
        "start": 4107.74,
        "end": 4113.74
    },
    {
        "text": " da todos los a y los pares, ¿no?",
        "start": 4113.74,
        "end": 4114.74
    },
    {
        "text": " Cero, cero, cero, cero, cero.",
        "start": 4114.74,
        "end": 4115.74
    },
    {
        "text": " Sólo tenemos que mirar la diagonal y pero en la diagonal, en los pares,",
        "start": 4115.74,
        "end": 4120.74
    },
    {
        "text": " en la identidad que es 1, 1, 1 sobre 0 a 4, 1 sobre 0 a 4, 1 sobre 0 a 8, 1 sobre 0 a 8,",
        "start": 4120.74,
        "end": 4127.74
    },
    {
        "text": " o sea que de forma ya sabemos como bien, o sea lo que tengo que saber es,",
        "start": 4127.74,
        "end": 4130.74
    },
    {
        "text": " ¿cuánto da 1 sobre 2 a la 4 a la y desde igual 0 hasta más infinito?",
        "start": 4130.74,
        "end": 4139.74
    },
    {
        "text": " Y cero, te queda la identidad, el caso 1, 1 y 1 es este muy llacho.",
        "start": 4141.74,
        "end": 4147.74
    },
    {
        "text": " Y 2 es este ¿no? ¿Está bien?",
        "start": 4147.74,
        "end": 4150.74
    },
    {
        "text": " Entonces, a la 4 a la y 4 por 2 a 8, ¿tabía, no?",
        "start": 4151.74,
        "end": 4155.74
    },
    {
        "text": " Corríjame por favor, porque podemos estar haciendo error, ¿sí?",
        "start": 4156.74,
        "end": 4159.74
    },
    {
        "text": " Y 1 sobre 0 a 4, ahora que haymos en esta cuenta, esta que está acá,",
        "start": 4160.74,
        "end": 4164.74
    },
    {
        "text": " el x es 1 sobre 2 a la 4, 1 sobre 16, entonces te queda 1 y dividido 1 menos 1 16, ¿no? ¿no? ¿no? ¿no? ¿no?",
        "start": 4164.74,
        "end": 4173.74
    },
    {
        "text": " ¿Converge? ¿porque es menor que 1? O sea que es 1 y dividido 1 menos 16 y esto es igual a, bueno,",
        "start": 4173.74,
        "end": 4182.74
    },
    {
        "text": " 1, 1, 1 sobre 1, 16 y esto es 16 y se hago.",
        "start": 4182.74,
        "end": 4189.74
    },
    {
        "text": " ¿tabía? ¿las cuentas? O sea que esta suma, ya sé que acá me va a dar 16, 15 hago, 16, 15 hago,",
        "start": 4193.74,
        "end": 4206.74
    },
    {
        "text": " 15 hago, acá se lo hicieron y ahora tenemos que salir a otro.",
        "start": 4207.74,
        "end": 4211.74
    },
    {
        "text": " La otra es un poquito más difícil porque es en la antideagonal, o sea en la diagonal,",
        "start": 4213.74,
        "end": 4219.74
    },
    {
        "text": " vale ser, vale ser, ¿no? Después tengo que sumar todo y te corresponde a la final.",
        "start": 4219.74,
        "end": 4225.74
    },
    {
        "text": " Y en la antideagonal, ¿por qué se le pido atención? Hay una diferencia de un cuarto, ¿no?",
        "start": 4225.74,
        "end": 4230.74
    },
    {
        "text": " Es un medio por, y acá un medio por un cuarto, 1 sobre 2 será 5, 1 sobre 2 será 5 por un cuarto.",
        "start": 4231.74,
        "end": 4239.74
    },
    {
        "text": " Agarán la cuenta en la esquina superior arriba y después multiplican por un cuarto en la otra.",
        "start": 4239.74,
        "end": 4244.74
    },
    {
        "text": " Y chao, se lo dejo para ustedes completar acá y acá, completan y obtienen la resultado final.",
        "start": 4244.74,
        "end": 4252.74
    },
    {
        "text": " Y no solamente hemos calculado nuestro primer ejemplo de serie de potencia de matriz.",
        "start": 4252.74,
        "end": 4258.74
    },
    {
        "text": " ¿Pero?",
        "start": 4259.74,
        "end": 4260.74
    },
    {
        "text": " Pregunto, ¿a ver?",
        "start": 4268.74,
        "end": 4272.74
    },
    {
        "text": " Después que calculen el radi espectral, la iba a ser ahora, pero el radi espectral día,",
        "start": 4280.74,
        "end": 4286.74
    },
    {
        "text": " ¿cuáles son los dos valores propios y cuánto van? ¿Y cuál es el máximo los voy a hacer?",
        "start": 4286.74,
        "end": 4294.74
    },
    {
        "text": " Y después me dicen cuánto de esto, ¿a algunos de ustedes que le pongan el Eva, cuál es el resultado final?",
        "start": 4294.74,
        "end": 4302.74
    },
    {
        "text": " Yo tengo, dice las cuentas acá. Pero quiera esto que me quedan 15 minutos, 12,",
        "start": 4302.74,
        "end": 4308.74
    },
    {
        "text": " poner el teorema central de esta parte,",
        "start": 4308.74,
        "end": 4312.74
    },
    {
        "text": " poner el teorema central de esta parte, ¿sí?",
        "start": 4313.74,
        "end": 4316.74
    },
    {
        "text": " Y la demostración es muy cortita, nos lleva 2 minutos, porque es muy sencilla, porque ya está todo hecho.",
        "start": 4316.74,
        "end": 4325.74
    },
    {
        "text": " Y después quiero ir al siguiente teorema que lo voy a enunciar y no lo voy a demostrar porque nos da el tiempo,",
        "start": 4325.74,
        "end": 4331.74
    },
    {
        "text": " que es muy bonito también, pero bueno, todo no se puede en la vida.",
        "start": 4331.74,
        "end": 4335.74
    },
    {
        "text": " Así que el teorema central de esta parte, dice así.",
        "start": 4335.74,
        "end": 4339.74
    },
    {
        "text": " Como está todo hecho en las cuentas de esta hora, y si hemos resultado que son muy potentes,",
        "start": 4343.74,
        "end": 4348.74
    },
    {
        "text": " lo que estamos haciendo es recoger un montón de información y un montón de material a partir de todo el trabajo previo.",
        "start": 4348.74,
        "end": 4358.74
    },
    {
        "text": " Una matriz cuadrada en el por N, y lo que dice el teorema es sencillamente así.",
        "start": 4360.74,
        "end": 4365.74
    },
    {
        "text": " Primera parte, si el radio espectral de A es menor que 1, vaya sospecha,",
        "start": 4365.74,
        "end": 4371.74
    },
    {
        "text": " ya sabíamos que venía por ahí la mano, entonces,",
        "start": 4371.74,
        "end": 4375.74
    },
    {
        "text": " y su N, menos a la matriz identidad, menos a, es invertible.",
        "start": 4378.74,
        "end": 4383.74
    },
    {
        "text": " Y además, la inversa, si es invertible, si la inversa, ¿cuánto vale la inversa?",
        "start": 4387.74,
        "end": 4394.74
    },
    {
        "text": " A ver, gurises, miren este lado el pizarrón, chicos, y miren lo que voy a poner ahora.",
        "start": 4395.74,
        "end": 4401.74
    },
    {
        "text": " Y su N, menos a, es la sumatoria de A a la S, desde S igual 0 hasta más infinita.",
        "start": 4402.74,
        "end": 4410.74
    },
    {
        "text": " Es la misma lógica que aquello de esa, es exactamente la misma lógica que es toda la.",
        "start": 4412.74,
        "end": 4417.74
    },
    {
        "text": " Se dan cuenta, es exactamente el mismo tipo de matemática que está en la punta de derecha al pizarrón y la punta y que acaran numeritos, vaya su matriz.",
        "start": 4418.74,
        "end": 4430.74
    },
    {
        "text": " Y la única clave, ¿cuál es gurises? Que el radio espectral es menor que 1, ¿qué era el radio espectral profe?",
        "start": 4431.74,
        "end": 4436.74
    },
    {
        "text": " El mayor de los módulos de los de los de los valores propios.",
        "start": 4437.74,
        "end": 4441.74
    },
    {
        "text": " Y ese que sea menor que 1, se acuerdan que determinaba el comportamiento al infinito de las potencias a la S.",
        "start": 4442.74,
        "end": 4449.74
    },
    {
        "text": " Parte B, esto que voy a poner ahora tiene que ver con el terreno del perro en frubeño, si tiene que,",
        "start": 4450.74,
        "end": 4458.74
    },
    {
        "text": " lo vamos a aprovechar en el terreno del perro en frubeño y en teoría de grafo.",
        "start": 4459.74,
        "end": 4461.74
    },
    {
        "text": " Bueno, si estoy en las mismas hipótesis que en la parte A, o sea que el radio espectral es menor que 1, y además a su hijota, siempre mayor igual que 0,",
        "start": 4462.74,
        "end": 4470.74
    },
    {
        "text": " quién era el frijota los términos de la matriz a todos los elementos de la matriz a si los centrados de la matriz a si son todas positivas,",
        "start": 4471.74,
        "end": 4483.74
    },
    {
        "text": " entonces dice esta parte, la parte B, entonces las centradas de I, N, menos a, a la menos 1,",
        "start": 4484.74,
        "end": 4498.74
    },
    {
        "text": " perdón, dije positivas y está mal para lo de Benfín, mayor igual que 0, debería haber dicho,",
        "start": 4499.74,
        "end": 4506.74
    },
    {
        "text": " dije, oralmente dije positivas, son mayores iguales que 0, o sea no negativas,",
        "start": 4507.74,
        "end": 4511.74
    },
    {
        "text": " entonces la conclusión es que las centradas de I, N, menos a, y la inversa de I, menos a, son también todas las centradas, son también no negativas.",
        "start": 4512.74,
        "end": 4523.74
    },
    {
        "text": " Y la demostración cabe en este pedacito de pizarro.",
        "start": 4523.74,
        "end": 4529.74
    },
    {
        "text": " Sí, lo que pasa, bueno, acá podemos tomar, podemos tomar el caso que sean todos números reales, o sea en particular puedes pensar que son todos números reales,",
        "start": 4532.74,
        "end": 4548.74
    },
    {
        "text": " y en particular en ese caso estas también son números reales no negativos.",
        "start": 4549.74,
        "end": 4554.74
    },
    {
        "text": " A donde va esto, se lo sa delanto, vamos a empezar en la próxima parte y en muchas de las aplicaciones, los datos de la matriz vienen de la vida real o de grafos,",
        "start": 4557.74,
        "end": 4568.74
    },
    {
        "text": " los grafos tienen la matriz social, que son las matrices de incidencia, la matriz y la desacidencia, y lo que cuentan son aristas verdes y esto, cuentan,",
        "start": 4569.74,
        "end": 4577.74
    },
    {
        "text": " o cuando venís de la vida real en economía, datos de poblaciones, son números positivos.",
        "start": 4578.74,
        "end": 4583.74
    },
    {
        "text": " Entonces, la pregunta martín está perfecta, ¿qué me pone este aparte B si los números son complejos?",
        "start": 4583.74,
        "end": 4591.74
    },
    {
        "text": " Tiene que ser real y todavía mayor igual que sea que B, porque esta la parte B no dice nada, lo que pasa que en la aplicación de la vida real vienen todos,",
        "start": 4591.74,
        "end": 4598.74
    },
    {
        "text": " todos de la interior economía y en grafos va a suceder muchas veces esto, ¿sabes?",
        "start": 4598.74,
        "end": 4603.74
    },
    {
        "text": " Y esta tiene una interpretación, incluso de la interior de grafos, que todos los coeficientes sean mayor y mayor que sea, en particular que sea mayor que sea.",
        "start": 4605.74,
        "end": 4614.74
    },
    {
        "text": " Bueno, Uri se, la parte B está demostrada, bien en las, yo no digo que no hay nada a pasar, si tenés la parte A la parte B está, porque la parte B dice que la inversa tiene esta forma.",
        "start": 4614.74,
        "end": 4626.74
    },
    {
        "text": " Todos los casiceros de A son mayor y igual que 0, entonces de A la A es, también son todos mayor y igual que 0, porque es producto de cosas mayor y igual que 0, mayor y igual que 0.",
        "start": 4626.74,
        "end": 4636.74
    },
    {
        "text": " Y después que hago lo sumo, entonces queda siempre mayor y igual que sea, la parte B si la está bien, no hay que ser nada, ya está.",
        "start": 4636.74,
        "end": 4646.74
    },
    {
        "text": " Entonces, el único que vamos a hacer es la parte A y la parte A hemos hecho tanta cuenta, sabemos tanto que va a ser bastante sencillo.",
        "start": 4647.74,
        "end": 4653.74
    },
    {
        "text": " Entonces, en la parte A tenemos que considerar la suma parcial, lo que definimos en la izquierda, la suma toria desde 0 hasta M de A la A, la suma parcial.",
        "start": 4654.74,
        "end": 4669.74
    },
    {
        "text": " Y queremos probar que es M, queremos probar que esta suma parcial, que este es el SM, cuando M tiene más infinito converge, ahí suvene menos a la medosura.",
        "start": 4670.74,
        "end": 4685.74
    },
    {
        "text": " Ahora, ¿qué pasa? Hay que usar la hipótesis, acá está el 1, acá está la R O D A, dice el hipótesis que R O D A es menor que 1.",
        "start": 4687.74,
        "end": 4695.74
    },
    {
        "text": " Esto lo sé, si es menor que 1 entre R O D A y 1 hay un número por lo menos, hay muchos infinitos, pero hay uno que se llama beta, agarra uno cualquiera en el medio que se llama beta.",
        "start": 4696.74,
        "end": 4707.74
    },
    {
        "text": " Entonces, lo que pasa y ahora uso el teorema que acabamos de terminar de demostrar, que empezamos a demostrar la clase pasada y la terminamos con el emato técnico hoy, el teorema decía que el límite, cuando E se tiende a más infinito de la norma, de A de la A S, de la R A S S y más de la norma de A.",
        "start": 4707.74,
        "end": 4736.74
    },
    {
        "text": " Esta es la R A S y más de la estiva así, esto es R O D A, ese es el teorema que acabamos de demostrar, pongan ahí un cartelo abajo, tremendo, y lo estamos aprovechando.",
        "start": 4737.74,
        "end": 4749.74
    },
    {
        "text": " Y este es menor que beta, que es menor que 1.",
        "start": 4749.74,
        "end": 4752.74
    },
    {
        "text": " Entonces, si esto es menor que beta, menor que 1, sabemos por lo definición, estos son números reales, las normas son números reales, entonces existe si al límite es menor que beta existe un momento que lo llamo ese cero,",
        "start": 4753.74,
        "end": 4769.74
    },
    {
        "text": " tal que para todo ese, y lo igual que ese cero.",
        "start": 4769.74,
        "end": 4773.74
    },
    {
        "text": " A ver chicos, miren acá, así me ahorro un placer de pizarro, debería poner que a partir del momento ese cero, la norma de A a S elevado a la 1 sobre S es menor que beta, ¿no verdad?",
        "start": 4782.74,
        "end": 4795.74
    },
    {
        "text": " Pues vos tenés acá, si al límite es acá, en algún momento, bien se acerca por el que ahora, por derecho, no sé, pero en algún momento, a partir de 1.0, están más cerca que beta, ¿no verdad?",
        "start": 4795.74,
        "end": 4808.74
    },
    {
        "text": " La definición del límite, pero si me dejan poner, en vez de poner la norma de A a S, a la 1 sobre S, menor que beta, puedo poner, menor que beta a S, el digo todo a S, es lo mismo, ¿no verdad?",
        "start": 4808.74,
        "end": 4820.74
    },
    {
        "text": " Pues estamos todos con números positivos, acá no hay ningún problema, y me ahorro un pedacito de pizarro.",
        "start": 4820.74,
        "end": 4826.74
    },
    {
        "text": " O sea que a partir de ese cero, vale ese resultado, esa desigualdad.",
        "start": 4827.74,
        "end": 4832.74
    },
    {
        "text": " Bueno, y ahora por fin viene lo de sucesión de Koshii.",
        "start": 4833.74,
        "end": 4839.74
    },
    {
        "text": " El último de los repasos de años previos, lo voy a aprovechar ahora.",
        "start": 4846.74,
        "end": 4852.74
    },
    {
        "text": " Lo que viene ahora, entonces, es considerar L, mayor igual KM, y hago la diferencia de S, L, menos S, M, la norma de la diferencia.",
        "start": 4857.74,
        "end": 4873.74
    },
    {
        "text": " A ver, sumo hasta M y sumo hasta L, L es mayor igual KM, entonces la diferencia es la suma de M más 1 hasta L, ¿no verdad?",
        "start": 4873.74,
        "end": 4883.74
    },
    {
        "text": " Porque estas son sumas parciales, o sea que esto es la norma de la sumatoria desde M más 1 hasta L, L, L a S, el pedacito que falta.",
        "start": 4884.74,
        "end": 4899.74
    },
    {
        "text": " ¿Cómo se llama hasta desigualdad que voy a poner acá?",
        "start": 4900.74,
        "end": 4903.74
    },
    {
        "text": " Y ya lo usamos más de una vez en clase y nunca repasé el nombre con ustedes.",
        "start": 4904.74,
        "end": 4909.74
    },
    {
        "text": " Esa desigualdad, ¿cómo se llama?",
        "start": 4920.74,
        "end": 4922.74
    },
    {
        "text": " Trangular, la desigualdad trangular, son victores de real a N, porque las matrices la estamos mirando como en este caso de CN cuadrado.",
        "start": 4923.74,
        "end": 4932.74
    },
    {
        "text": " Esa es la desigualdad trangular, pongo el nombre, la querida desigualdad trangular de real a N, de real a N, de real a N, de real a J, tan importante en el espacio que estés.",
        "start": 4933.74,
        "end": 4944.74
    },
    {
        "text": " Pero la norma de A a S, chicos acá está, para todo S, mayor igual KS0, para todo S, mayor igual KS0, resulta que la norma de A a S es menor que B a S, entonces,",
        "start": 4945.74,
        "end": 4961.74
    },
    {
        "text": " si tomo M, mayor igual KS0, si, tomo M, mayor igual KS0, entonces, L es todo los S a partir de M a S, las son mayoras igual KS0 y por lo tanto, puedo seguir la cadena de desigualdad es por acá, esto es menor igual, sigo por acá, con el igual que la sumatoria, B es igual, M a S1 hasta L, Db a la S.",
        "start": 4963.74,
        "end": 4988.74
    },
    {
        "text": " Usela desigualdad que ella.",
        "start": 4989.74,
        "end": 4992.74
    },
    {
        "text": " Posa acá, voy a hacer dos pasos en uno, pero mira el Pizarón, voy a sacar B a la M más 1 de factor común, porque acá está B a la M más 1, B a la M más 2, B a la M más 3, B a la M más 4, está B a la L, ¿no verdad?",
        "start": 4998.74,
        "end": 5011.74
    },
    {
        "text": " Voy a hacer dos pasos en uno, en vez de poner igual pongo menor, Db saco, B a la M más 1 de factor común, o sea que arrancaría en uno, B a, B a cuadrado, lo que queda dentro, pero además no voy a parar en L, me voy a estar infinito, o sea que queda menor, entonces me queda menor que B a la M más 1 por la sumatoria, B a la I, desde igual 0 hasta más infinito,",
        "start": 5011.74,
        "end": 5040.74
    },
    {
        "text": " ¿cuánto vale esta última?",
        "start": 5042.74,
        "end": 5044.74
    },
    {
        "text": " Esta última serie, ¿cuánto vale?",
        "start": 5053.74,
        "end": 5055.74
    },
    {
        "text": " Otra vez nos remitimos acá, chiquiline, caemos nuevamente lo mismo, B es menor que 1, o sea que convergís ya sé cuantos vale su valor, esa serie vale 1 por 1, 1 y B1, ¿venos B?",
        "start": 5055.74,
        "end": 5070.74
    },
    {
        "text": " ¿cierto?",
        "start": 5071.74,
        "end": 5072.74
    },
    {
        "text": " Bueno, entonces en definitiva que chiquilines, que la norma DcL menos SM es menor que beta a la M más 1 por 1 sobre 1, menos beta, esto es un número, no me interesa que número es,",
        "start": 5076.74,
        "end": 5094.74
    },
    {
        "text": " o sea en chiquilines que 1, que beta es distinto de 1, fundamental haber tomado el beta verde en el medio, no igual a 1, porque acá necesitábamos que esto es por el distinto de 0, esto es menor para todo M más y igual que ese 0.",
        "start": 5094.74,
        "end": 5109.74
    },
    {
        "text": " Bueno, Uriz, ¿qué es lo que estoy a punto de decir ahora? Díganlo ustedes, ¿cómo es esa sucesión de sumas parciales? Esta sucesión, ¿cómo es?",
        "start": 5109.74,
        "end": 5130.74
    },
    {
        "text": " Es creciente en el sentido de que va sumando pero cortavilleno tenemos un orden ahí, podríamos, pero fíjense acá. ¿Eh?",
        "start": 5130.74,
        "end": 5150.74
    },
    {
        "text": " No, pero no, no, no, de creciente en principio, no, lo que tenés es que decoy, ¿por qué que pasa? Este numerito depende de M, depende de M y si vas a ese M muy grande esto para todo Epsilón, lo pongo en rojo ahora, dado Epsilón o en azul, perdón, ahora es la azul.",
        "start": 5150.74,
        "end": 5169.74
    },
    {
        "text": " Dado Epsil, el mayor que 0 existe, un M0, bien grande, tal que esto, este es un número fijo, no importa si es muy grande, es un número fijo, pero este tende a 0, porque es beta es menor que 1 y M es potencia, tiende a 0 cuando M crece crece crece crece, tiende a 0, o sea que existe un M0, tal que para todo M, mayor igual que M0, esto es menor que Epsilón.",
        "start": 5169.74,
        "end": 5198.74
    },
    {
        "text": " ¿Por qué? Vamos de nuevo, porque la sucesión beta a la M tiende a 0, ¿eh? Entonces lo que acabo de escribir acá, fíjense, es que para todo M y N es mayor igual que N0, en este caso el M0, cuál va a ser el que va a jugar en la definición de collista N0 acá?",
        "start": 5200.74,
        "end": 5221.74
    },
    {
        "text": " Mira bien, tengo dos condiciones para M, una que tiene que superar a ese 0, otra que tiene que superar este M0, no importa, tomo el máximo entre M0 y ese 0 y tomo M mayor igual que el máximo entre M0 y ese 0 y listo, y entonces caigo en la definición de collista, es una sucesión de collista, esta sucesión de suma parciales es de collista.",
        "start": 5221.74,
        "end": 5250.74
    },
    {
        "text": " Cádenla definición de collista, ¿eh? Pero ustedes ya saben que R a la N2 sea la N2, R a la N4, lo que quieran el tamaño que quieran usando C o R porque se comporta igual, C es R más R,",
        "start": 5252.74,
        "end": 5271.74
    },
    {
        "text": " se lo saben que es completo, lo vieron en el cálculo 2 y por lo tanto toda sucesión de collista converge, como es de collista, R a lo que quieran, A la U es completo, entonces esta sucesión converge.",
        "start": 5271.74,
        "end": 5291.74
    },
    {
        "text": " Y a ver si me queda un minuto, no pasamos, chicos, que lo único que queda pero no quiero hacerlo acá porque me molesta sobre el pasado en muchos minutos,",
        "start": 5302.74,
        "end": 5316.74
    },
    {
        "text": " solo queda probar este converje a este número, a este valor, discuto, no es un número, a esta matriz, lo voy a escribir escortitos, son dos líneas, lo escribo en el Eva,",
        "start": 5316.74,
        "end": 5331.74
    },
    {
        "text": " ok, lo escribo en el Eva para todo, pero lo doy por fin, porque no quiero abusar del tiempo, me queda dos líneas para probar esta parte, y a la vez voy a escribir también el enunciado del teolema de la gran silvestre,",
        "start": 5331.74,
        "end": 5345.74
    },
    {
        "text": " que es el último de la sección, están en el libro, por supuesto, pero voy a escribir el enunciado ahí, o por lo menos copio la parte del libro y la pego en el Eva, ¿sabes?",
        "start": 5345.74,
        "end": 5355.74
    },
    {
        "text": " Chicos, fue un gusto, nos encontramos el martes para aquellos que tengan dudas, recuerden que el parcial, a la lado de fin también, el parcial es teórico práctico,",
        "start": 5355.74,
        "end": 5367.74
    },
    {
        "text": " va a ver seguro una buena pregunta de teórico, va a ver un ejercicio de práctico como prometido, un ejercicio va a ser igual a alguno de práctico,",
        "start": 5367.74,
        "end": 5379.74
    },
    {
        "text": " y un par de preguntas más, una sencilla por lo menos y una más brava.",
        "start": 5379.74,
        "end": 5387.74
    }
]