[
    {
        "text": " Bueno, continuando con lo que vimos la clase pasada, por aquí tenemos la solución, pero",
        "start": 0.0,
        "end": 21.32
    },
    {
        "text": " un poquito la idea es explicarles algunos conceptos de cómo se arma. Como ya les comenté,",
        "start": 21.32,
        "end": 29.2
    },
    {
        "text": " esto no se les va a preguntar el día de la preva porque por el formato que tenemos que",
        "start": 29.2,
        "end": 34.56
    },
    {
        "text": " es una multipl opción, es muy difícil de plasmar esto. Así que, bueno, simplemente se da para",
        "start": 34.56,
        "end": 40.4
    },
    {
        "text": " que tengan una idea de que existen formas de poner en papel una decisión, de poder",
        "start": 40.4,
        "end": 47.72
    },
    {
        "text": " poner a dar, de poder calificar, de poder asignar puntajes y es más que nada para que",
        "start": 47.72,
        "end": 53.56
    },
    {
        "text": " lo tengan el día mañana como forma. Otro tema que también les había comentado en su momento,",
        "start": 53.56,
        "end": 59.88
    },
    {
        "text": " si bien damos este modelo, que se acerca un poco a lo que tienen en el libro, que no hay que",
        "start": 60.6,
        "end": 66.44
    },
    {
        "text": " les plantea la importancia de lo que creen que tiene decisión y cómo se analiza las alternativas,",
        "start": 66.44,
        "end": 72.12
    },
    {
        "text": " cómo luego se toma la decisión. Hay otras formas de tomar decisiones y, bueno, cada empresa tiene",
        "start": 72.12,
        "end": 79.84
    },
    {
        "text": " su estructura para eso y hay otros autores que plantean, por ejemplo, el árbol de tomar decisiones,",
        "start": 79.84,
        "end": 87.48
    },
    {
        "text": " otras formas para poder hacerlos. Pero bueno, acá es simplemente para que vean una manera que",
        "start": 87.48,
        "end": 94.60000000000001
    },
    {
        "text": " cómo les decía, lo que hace es, por un lado poner todos los criterios de decisión, los pondera,",
        "start": 94.60000000000001,
        "end": 101.68
    },
    {
        "text": " y otro tema importante es, y después vamos a ver los ejes o no, que bueno, todo esto tiene su",
        "start": 102.48,
        "end": 108.76
    },
    {
        "text": " objetividad. Si bien uno puede buscar información y tratar de llevarlo a un plano más objetivo,",
        "start": 108.76,
        "end": 117.0
    },
    {
        "text": " tiene también su lado de su objetividad. Hay cosas que no, por ejemplo, la cantidad de años",
        "start": 117.0,
        "end": 123.48
    },
    {
        "text": " de vehículos, todo eso, uno, realmente lo puede medir, pero en otros elementos, verdad, que",
        "start": 123.48,
        "end": 129.88
    },
    {
        "text": " es más importante, si es más importante que sea de marcosudo, si es más importante, los años",
        "start": 129.88,
        "end": 136.68
    },
    {
        "text": " todo eso, bueno, tiene cierto grado de su objetividad y cada persona va a ponder ar distinto,",
        "start": 136.76000000000002,
        "end": 141.48000000000002
    },
    {
        "text": " que eso también es algo que habíamos visto, que algo que puede ser un excelente trabajo para",
        "start": 141.48000000000002,
        "end": 146.20000000000002
    },
    {
        "text": " una persona, para otra persona puede considerar que no lo es, y bueno, porque va a tomar otros",
        "start": 146.20000000000002,
        "end": 152.36
    },
    {
        "text": " otros elementos en sus criterios de decisión. Aquí, como les decía, lo que hace es, por un lado,",
        "start": 152.36,
        "end": 161.8
    },
    {
        "text": " nombrar todos los criterios de decisión, luego los pondera del 1 al 10, luego acá le vas",
        "start": 161.8,
        "end": 167.32000000000002
    },
    {
        "text": " buscando la información, que esta información, no sé si en los grupos lo llegan a hacer, si no es",
        "start": 167.32000000000002,
        "end": 173.16000000000003
    },
    {
        "text": " cual lo pueden ver tranquilos, lo que se hace es buscar en la letra, la información del vehículo,",
        "start": 173.16000000000003,
        "end": 180.76000000000002
    },
    {
        "text": " luego se califica, que allí lo que se hace es, como les decía, tiene que tener un criterio",
        "start": 181.8,
        "end": 188.84
    },
    {
        "text": " lógico, verdad, lo que es más antiguo, va a tener menor calificación, como lo vemos acá, y lo que es",
        "start": 189.4,
        "end": 196.6
    },
    {
        "text": " más nuevo va a tener una mayor calificación. Tenga en cuenta que esto está pensado a 2014,",
        "start": 196.6,
        "end": 203.56
    },
    {
        "text": " es una letra, por eso es que considera el 2014 como ser lo que irán.",
        "start": 203.56,
        "end": 208.76
    },
    {
        "text": " Bueno, aquí tenemos entonces todas las, la información que sale del texto, luego la calificación y luego",
        "start": 210.52,
        "end": 218.36
    },
    {
        "text": " la calificación pondera. Después la idea es que ustedes salgan un ejercicio y de esa forma analicemos",
        "start": 218.36,
        "end": 227.4
    },
    {
        "text": " otros casos, ya más de la vida práctica, pero siempre de una forma u otra, nosotros analizamos y",
        "start": 227.4,
        "end": 235.56
    },
    {
        "text": " buscamos luego las diferentes automatías. Le doy un ejemplo reciente, por ejemplo,",
        "start": 235.56,
        "end": 240.84
    },
    {
        "text": " compré un lavacicarrop, para comprar el lavacicarrop, qué les parece que yo tuve en cuenta.",
        "start": 240.84,
        "end": 247.48000000000002
    },
    {
        "text": " Perfecto, ahí se la marca el precio, ¿qué más?",
        "start": 261.4,
        "end": 263.8
    },
    {
        "text": " El consumo, la garantía, perfecto, está muy bien, incluso lo que dice a Garnuzvo porque es verdad,",
        "start": 271.84,
        "end": 282.91999999999996
    },
    {
        "text": " tuve que tomar las dimensiones y hayan algunos que no entraban en el lugar que lo quería poner así",
        "start": 282.91999999999996,
        "end": 287.96
    },
    {
        "text": " que también el tema del tamaño, fue algo que tuve en cuenta, ¿qué más?",
        "start": 287.96,
        "end": 293.08
    },
    {
        "text": " Bueno, todo eso que ustedes están mencionando, la marca, el precio, el consumo, la garantía, el tamaño,",
        "start": 293.08,
        "end": 308.2
    },
    {
        "text": " si tenía como bien dice Mateo entre, aún no tenía entre, entonces son criterios de decisión.",
        "start": 308.2,
        "end": 315.08
    },
    {
        "text": " En cierta medida, yo si bien no lo hice en un papel, sí hay algunos criterios de decisión que",
        "start": 316.03999999999996,
        "end": 323.71999999999997
    },
    {
        "text": " para mí eran más importantes que otros, si si bien no los pondré por papel, sí hice una",
        "start": 323.71999999999997,
        "end": 328.88
    },
    {
        "text": " ponderación personal. Otro tema también, la cantidad de kilos, vieron que hay un kilos para",
        "start": 328.88,
        "end": 335.24
    },
    {
        "text": " lavado y kilos para secado, eso también lo miré, ¿no? Bueno, entonces siempre estamos a demás",
        "start": 335.24,
        "end": 341.56
    },
    {
        "text": " a nivel empresarial, a nivel personal como le decíamos, estamos también tomando decisiones.",
        "start": 341.56,
        "end": 346.68
    },
    {
        "text": " Ahí no nombraron bastantes. Pero bueno, ¿cómo les decía? No les vamos a preguntar para",
        "start": 349.0,
        "end": 357.52
    },
    {
        "text": " este parcial, el modelo, ¿para qué vimos? Pero sí, la idea es que lo vi eran y lo colocan.",
        "start": 357.52,
        "end": 367.16
    },
    {
        "text": " Ahora vamos a ver lo que les decía, que es bastante importante que es el tema de los ejgos, que",
        "start": 368.16,
        "end": 373.44
    },
    {
        "text": " explica bastante el tema. En su momento, voy a compartir pantalla.",
        "start": 373.44,
        "end": 378.04
    },
    {
        "text": " Hay unos los comentamos ya la clase pasada, pero bueno, vamos a",
        "start": 397.16,
        "end": 426.02000000000004
    },
    {
        "text": " ver. Es repasando algunos, no lo llegamos a ver y es un tema importante.",
        "start": 427.72,
        "end": 432.32000000000005
    },
    {
        "text": " Cegos de exceso de confianza. Este cegos lo que dice es que cuando los tomadores decisiones",
        "start": 432.32000000000005,
        "end": 438.68
    },
    {
        "text": " tienen a pensar que saben más de lo que en realidad saben o tienen una perspectiva y realmente",
        "start": 438.68,
        "end": 443.76000000000005
    },
    {
        "text": " positiva de sí mismos y de su desempeño. Esto es habitual a la vez en los trabajos que las",
        "start": 443.76000000000005,
        "end": 450.48
    },
    {
        "text": " personas se confían en su experiencia, en su capacidad, a la hora de tomar decisiones y que",
        "start": 450.48,
        "end": 457.96000000000004
    },
    {
        "text": " esas que son demasiado positivos, en cuanto a su conocimiento, su su capacidad para tomar",
        "start": 457.96000000000004,
        "end": 465.32
    },
    {
        "text": " decisiones y bueno, se confían, no analizan toda la información que deberían de tener en cuenta",
        "start": 465.32,
        "end": 471.56
    },
    {
        "text": " para la decision, quizás que se apuran también para la decisión, pero está basada justamente en el",
        "start": 471.56,
        "end": 477.64000000000004
    },
    {
        "text": " cego de exceso de confianza. Vamos a ver más adelante que justamente lo importante y esto para",
        "start": 477.64,
        "end": 484.56
    },
    {
        "text": " que también lo tengan en cuenta ustedes, todos tenemos cejos. A la hora de tomar una decisión,",
        "start": 484.56,
        "end": 489.68
    },
    {
        "text": " existen cejos, existen esos debíos, de todas formas lo que tenemos que tener en cuenta es conocer",
        "start": 489.68,
        "end": 499.88
    },
    {
        "text": " cuáles son los cejos y luego que lo veamos todos se va a servir identificado con algunos de ellos o en",
        "start": 499.88,
        "end": 506.15999999999997
    },
    {
        "text": " algún momento, en alguna decisión, seguramente cometieron algunos de ellos y entonces después",
        "start": 506.16,
        "end": 511.32000000000005
    },
    {
        "text": " que nosotros lo tenemos identificado tratar de trabajar sobre eso. Entonces decir bueno, si yo",
        "start": 511.32000000000005,
        "end": 516.12
    },
    {
        "text": " generalmente tiendo tomar decisiones con un exceso de confianza, bueno, voy a tratar de pensar",
        "start": 516.12,
        "end": 522.2
    },
    {
        "text": " mal la decisión, de tomar más información y de evitar justamente ese cego que tengo habitualmente.",
        "start": 522.2,
        "end": 530.0400000000001
    },
    {
        "text": " Cegos de gratificación inmediata o tener recompensas inmediatas, evitar los costos",
        "start": 536.52,
        "end": 542.6
    },
    {
        "text": " indignantes, esto es muy habitual, que a veces buscamos lo que me va a generar un beneficio más rápido,",
        "start": 542.6,
        "end": 549.6
    },
    {
        "text": " lo que va a lucir más pronto y muchas veces en los trabajos también se da que",
        "start": 549.6,
        "end": 554.4399999999999
    },
    {
        "text": " que mostrar resultados es valorado, entonces bueno a veces vamos por ese camino que rápidamente",
        "start": 554.4399999999999,
        "end": 561.0
    },
    {
        "text": " va a mostrar resultados y no quizás que ese camino que es más largo y que va a demorar en",
        "start": 561.52,
        "end": 567.4
    },
    {
        "text": " demostrar esos resultados. Cegos tan clage, la manera en que los tonadores decisiones se apegan",
        "start": 567.4,
        "end": 576.0
    },
    {
        "text": " con firmeza a la información obtenida inicialmente que la resulta difícil ajustar a datos posteriores.",
        "start": 576.0,
        "end": 582.24
    },
    {
        "text": " Muchas veces nosotros obtenemos información sobre un aspecto y nos quedamos con esa información y",
        "start": 582.76,
        "end": 591.84
    },
    {
        "text": " nos cuesta ayudarnos de otros datos quizás que surge ni que son posteriores y que son también",
        "start": 591.84,
        "end": 598.48
    },
    {
        "text": " relevantes, pero nos quedamos en esa información inicial que teníamos, entonces eso se le habla de",
        "start": 598.48,
        "end": 605.64
    },
    {
        "text": " efecto a un clage, ustedes se imaginan una ancla, verdad que lo que hace justamente es estacionar,",
        "start": 605.64,
        "end": 610.32
    },
    {
        "text": " dejar quieto en un lugar, entonces bueno ese cego existe que muchas veces nos quedamos con",
        "start": 610.32,
        "end": 619.6
    },
    {
        "text": " esa información inicial y no nos vamos ajustando a todo lo que va a sucediendo. A nivel de inversiones",
        "start": 619.6,
        "end": 629.8000000000001
    },
    {
        "text": " sucede a veces que las personas se quedan con el recuerdo, bueno esta inversión siempre le iba bien y",
        "start": 629.8000000000001,
        "end": 636.4000000000001
    },
    {
        "text": " bueno si será importante a nivel de inversiones no quedarse en ese anclaje y a llornarse,",
        "start": 636.4,
        "end": 643.16
    },
    {
        "text": " actualizarse, buscar información nueva, la recuerden que para lo que es la toma de decisiones,",
        "start": 643.16,
        "end": 648.6
    },
    {
        "text": " la información es fundamental, tener buena información nos permite tomar buenas decisiones o por",
        "start": 648.6,
        "end": 655.56
    },
    {
        "text": " lo menos nos ayuda a ellos, entonces siempre tener información y en estos tiempos,",
        "start": 655.56,
        "end": 661.16
    },
    {
        "text": " incluso hay exceso de información, saber, recolectar, saber captar la que es más significativa para",
        "start": 661.16,
        "end": 668.4399999999999
    },
    {
        "text": " una decisión es muy nueva verdad. Si hay alguna duda, alguna consulta me dice,",
        "start": 668.4399999999999,
        "end": 682.16
    },
    {
        "text": " Cego de percepción selectiva, lo que dicen es que en estos casos los tomadores de decisiones",
        "start": 682.16,
        "end": 689.9599999999999
    },
    {
        "text": " organizan e intercretan los acontecimientos de forma selectiva y toman como bases su percepciones",
        "start": 689.9599999999999,
        "end": 696.16
    },
    {
        "text": " que ya tienen un prejuicio, entonces en cierta medida van organizando y interpretando, pero",
        "start": 696.16,
        "end": 703.16
    },
    {
        "text": " la información selectiva para tener en cuenta el preconcepto que ya tenían sobre el tema. A veces",
        "start": 703.16,
        "end": 711.28
    },
    {
        "text": " pasa mucho con el manejo de los recursos humanos, que muchas veces se tiene como una impresión para",
        "start": 711.28,
        "end": 718.04
    },
    {
        "text": " sobre el actual o el comportamiento de un funcionario y luego se van interpretando los acontecimientos",
        "start": 718.04,
        "end": 725.4399999999999
    },
    {
        "text": " teniendo en cuenta esos prescuchos, entonces esto es que evitarlo, ya hay que tratar justamente de no",
        "start": 725.4399999999999,
        "end": 732.8
    },
    {
        "text": " interpretar los acontecimientos es una forma selectiva, verdad, y no tomar, verdad, percepciones que",
        "start": 732.8,
        "end": 738.88
    },
    {
        "text": " ya tengan un prejuicio anterior, entonces siempre lo que decimos es que los gerenes a dar",
        "start": 738.88,
        "end": 744.2
    },
    {
        "text": " la tomada de decisiones tenemos que, bueno, desprendernos de todo lo anterior y tratar de analizar",
        "start": 744.2,
        "end": 749.48
    },
    {
        "text": " con la información que tenemos, una forma lo más racional posible y bueno, tratar de tomarse",
        "start": 749.48,
        "end": 755.92
    },
    {
        "text": " el tiempo, ¿no? Que si bien sabemos que el tiempo hoy en día es limitado y que eso a veces",
        "start": 755.92,
        "end": 762.68
    },
    {
        "text": " no nos permite, pero bueno, intentar dentro de las posibilidades de tomarse el tiempo para tomar",
        "start": 762.68,
        "end": 768.8
    },
    {
        "text": " las decisiones. Sejgo de confirmación, cuando el tomar decisiones, busque información que reafirme",
        "start": 768.8,
        "end": 779.92
    },
    {
        "text": " las elecciones que ha hecho en el pasado y desdeña aquella que contradice sus puicios preguites,",
        "start": 779.92,
        "end": 785.88
    },
    {
        "text": " exivo un cejo de confirmación, estos individuos tienen aceptar si mayor los datos que confirmen",
        "start": 785.88,
        "end": 792.12
    },
    {
        "text": " sus puntedistas preconcebidos y se muestran críticos y étimos cos de pede información que los ponga en",
        "start": 792.64,
        "end": 798.28
    },
    {
        "text": " un. Esto es habitual y incluso si bien como siempre decimos esto lo vemos a nivel empresarial a nivel",
        "start": 798.28,
        "end": 806.92
    },
    {
        "text": " personal muchos tenemos a veces una tendencia a buscar confirmar, verdad, lo que en realidad nosotros",
        "start": 806.92,
        "end": 814.28
    },
    {
        "text": " queremos, entonces en cierta medida nos lo buscamos de reafirmar lo que en realidad queremos,",
        "start": 814.28,
        "end": 822.8399999999999
    },
    {
        "text": " queremos hacer, a veces hasta las formas en que realizamos las preguntas, las formas en que",
        "start": 822.8399999999999,
        "end": 828.6
    },
    {
        "text": " buscamos la información, lo que lo que intenta es confirmar lo que ya queríamos hacer, entonces",
        "start": 828.6,
        "end": 836.36
    },
    {
        "text": " es un cejo habitual, es un cejo que como decíamos en todos los casos anteriores, la importante es",
        "start": 836.36,
        "end": 842.0
    },
    {
        "text": " conocerlo, saber que existe y tratar de no tener ese cejo de confirmación y bueno buscar la",
        "start": 842.0,
        "end": 851.68
    },
    {
        "text": " herramienta justamente para contrarestar ese cejo.",
        "start": 851.68,
        "end": 855.84
    },
    {
        "text": " Cejo de encuadre, seleccionan resaltan ciertos aspectos de una situación,",
        "start": 861.32,
        "end": 867.12
    },
    {
        "text": " anima tiempo que excluye otros, concentran la atención en un aspecto específico, los ponen a relieve y",
        "start": 867.68,
        "end": 873.84
    },
    {
        "text": " si omítice la red de importancia a otro. Habíamos visto la clase pasada que muchas veces sucede, a veces",
        "start": 873.84,
        "end": 881.24
    },
    {
        "text": " es por ejemplo una sufusal que tiene una baja de ventas significativas, entonces quizás que un sector",
        "start": 881.24,
        "end": 889.84
    },
    {
        "text": " puntual quiera demostrar, bueno, pero esto en realidad está bajando las ventas porque el personal no",
        "start": 889.84,
        "end": 899.12
    },
    {
        "text": " está teniendo el público de una manera correcta y se olviden de otros datos y quizás que no es",
        "start": 899.12,
        "end": 905.9200000000001
    },
    {
        "text": " el personal capaz de ser producto, capaz de ser servicio, entonces siempre tratar de analizar todos los",
        "start": 905.9200000000001,
        "end": 913.2
    },
    {
        "text": " aspectos de la situación, no quedarse en temas puntuales, ahí es importante de que cada sector",
        "start": 913.2,
        "end": 921.2
    },
    {
        "text": " de su opinión dejar que se participe, dejar que personas de confianza nos den su forma de dar las",
        "start": 921.2,
        "end": 929.6800000000001
    },
    {
        "text": " cosas, si bien sabemos que las decisiones rupales tienen como contra, el exceso de tiempo,",
        "start": 929.6800000000001,
        "end": 937.5200000000001
    },
    {
        "text": " para que llega la hora de tomar decisiones, tener aunque sea uno, dos opiniones, extras,",
        "start": 937.52,
        "end": 944.36
    },
    {
        "text": " ajenas a que nosotros podemos llegar a tener, a veces es importante justamente si estábamos aplicando",
        "start": 944.36,
        "end": 951.0799999999999
    },
    {
        "text": " algún sesgo en forma inconsciente, pueda dar alguna manera solucional.",
        "start": 951.0799999999999,
        "end": 955.76
    },
    {
        "text": " Ciso de disponibilidad, los tomadores decisiones inclinan a rememorar eventos recientes y todavía",
        "start": 958.24,
        "end": 964.4
    },
    {
        "text": " vivieron su memoria, la consecuencia de su capacidad para recordar los sucesos formas efectivas,",
        "start": 964.4,
        "end": 969.1999999999999
    },
    {
        "text": " se ve distorsionada, lo cual genera cuyos suelterados y cálculos de probabilidad de arroles.",
        "start": 969.1999999999999,
        "end": 974.0799999999999
    },
    {
        "text": " Esto es muy normal, no se lo siempre cuando vamos a tomar decisiones, es algo que sea muy significativo,",
        "start": 974.0799999999999,
        "end": 980.68
    },
    {
        "text": " hace uno tiende a recordarlo, los últimos acontecimientos que han sucedido y en base a eso uno",
        "start": 980.68,
        "end": 988.04
    },
    {
        "text": " termina tomando una decisión, pero bueno evidentemente que para evitar este sesgo de disponibilidad,",
        "start": 988.04,
        "end": 995.24
    },
    {
        "text": " lo que tenemos a hacer es, en caso de que la decisión, o sea de importancia, tratar de ir más allá",
        "start": 995.24,
        "end": 1002.24
    },
    {
        "text": " en el tiempo, hoy en día hay programas extremadamente útiles para todo lo que es análisis de información,",
        "start": 1002.24,
        "end": 1012.52
    },
    {
        "text": " hay un incluso que tiene una versión para estudiante, que se lo recomiendo, que se les es,",
        "start": 1013.48,
        "end": 1018.28
    },
    {
        "text": " es ese, bueno ese tipo de programas, ustedes deben de conocer otros seguramente también para análisis de edatos,",
        "start": 1018.28,
        "end": 1025.36
    },
    {
        "text": " en algún momento yo utilicé otros, se llamaba IDEA también, hay muchos programas que lo que nos permiten",
        "start": 1025.36,
        "end": 1031.4
    },
    {
        "text": " escargar una serie de datos y en base a eso realizar análisis y realmente es admirable todo lo que uno",
        "start": 1031.4,
        "end": 1040.12
    },
    {
        "text": " puede lograr ingresando bases de datos y todo lo que nos permite realizar de análisis y cómo",
        "start": 1040.12,
        "end": 1049.28
    },
    {
        "text": " sustenta nuestra decisión. Otro tema que habíamos planteado la clase pasada es que justamente",
        "start": 1049.28,
        "end": 1057.2399999999998
    },
    {
        "text": " sabiendo la existencia de todos estos sesgos, tratar de documentar las decisiones significativas,",
        "start": 1057.2399999999998,
        "end": 1063.76
    },
    {
        "text": " obviamente lo que decía, es una compra de papel que es algo diario y quizás que por un importe",
        "start": 1063.76,
        "end": 1071.04
    },
    {
        "text": " pequeño para la empresa no necesita tanto documentación, lo que nos vamos a tomar decisiones",
        "start": 1071.04,
        "end": 1076.2
    },
    {
        "text": " relevantes, por ejemplo el lanzamiento de un producto nuevo, queremos que tratar de que todo",
        "start": 1076.2,
        "end": 1082.48
    },
    {
        "text": " que he documentado de forma de que si alguien quiera ser al recorrido, pueda verificar a la que hubo",
        "start": 1082.48,
        "end": 1089.24
    },
    {
        "text": " una responsabilidad atrás de esa decisión. Y seguramente también ustedes, por su actividad",
        "start": 1089.24,
        "end": 1098.64
    },
    {
        "text": " profesional, participen en lo que es el proceso de tomar decisiones a veces participamos como",
        "start": 1098.64,
        "end": 1104.84
    },
    {
        "text": " tomadores y a veces participamos brindando información para que se tomen la decisión.",
        "start": 1104.84,
        "end": 1110.8
    },
    {
        "text": " Ya tenemos que ser muy conscientes a veces del rol que estamos jugando y de qué forma vamos a",
        "start": 1110.8,
        "end": 1116.92
    },
    {
        "text": " influir con nuestros actos. Sejos de representatividad, venimos bien hasta acá.",
        "start": 1116.92,
        "end": 1131.48
    },
    {
        "text": " Perfecto, sejo de representatividad. Cuando los tomadores decisiones evaluan la probabilidad de",
        "start": 1131.48,
        "end": 1149.1200000000001
    },
    {
        "text": " ocurre una acontecimiento tomando como base la similitud que tiene este con otro acontecimiento.",
        "start": 1149.1200000000001,
        "end": 1155.0
    },
    {
        "text": " Entonces lo que es terminamos haciendo es buscando semejanzas con otro suceso para poder tomar esa",
        "start": 1155.56,
        "end": 1164.96
    },
    {
        "text": " esa decisión. Y ahí es cuando se habla de que esa generación, esas analogías, nadar y ver también",
        "start": 1164.96,
        "end": 1171.96
    },
    {
        "text": " situaciones, muchas veces nos pasa que vemos situaciones idénticas donde no existe. Entonces hay que",
        "start": 1171.96,
        "end": 1177.08
    },
    {
        "text": " tener mucho cuidado cuando tratamos de buscar semejanzas con las decisiones y bueno, que no puede",
        "start": 1177.08,
        "end": 1187.52
    },
    {
        "text": " llevar a el rol. Llegan en cuenta que todos estos atajos que nuestro cerebro en definitiva termina",
        "start": 1187.52,
        "end": 1193.96
    },
    {
        "text": " siendo muchas veces para tomar decisiones cuando tenemos que tomar decisiones rápidas y bueno,",
        "start": 1193.96,
        "end": 1199.4399999999998
    },
    {
        "text": " son necesarios. O sea, qué es lo que hacemos cuando rápidamente tenemos que tomar una decisión.",
        "start": 1199.4399999999998,
        "end": 1204.6799999999998
    },
    {
        "text": " Tratamos de pensar y buscar, bueno, en casos similares que fue lo que hicimos o buscamos información",
        "start": 1204.96,
        "end": 1211.0800000000002
    },
    {
        "text": " que teníamos de antes por eso se nos genera ese efecto. Anglas que, pero bueno, muchas veces el tiempo",
        "start": 1211.0800000000002,
        "end": 1216.5600000000002
    },
    {
        "text": " limitado nos obliga a que terminamos haciendo estos atajos. El demás es que cuando tenemos tiempo",
        "start": 1216.5600000000002,
        "end": 1224.4
    },
    {
        "text": " tratemos de evitar estos hejos entendiendo que existen, que es la primera aspecto y tratando de",
        "start": 1225.2,
        "end": 1232.8
    },
    {
        "text": " profundizar en esos aspectos. Sijo de la utilización, ya tendrán interpretaciones de eventos",
        "start": 1232.8,
        "end": 1243.24
    },
    {
        "text": " aleatorios, la razón es que casi todos los seres humanos pueden trabajar con elidad,",
        "start": 1243.24,
        "end": 1247.12
    },
    {
        "text": " pero en hecho que aunque las situaciones sin previstas pueden ocurrir la cualquiera,",
        "start": 1247.12,
        "end": 1250.8
    },
    {
        "text": " no hay nada que podemos hacer para predecir. Muchas veces pasa, no sé si, sí, sí,",
        "start": 1250.8,
        "end": 1257.1599999999999
    },
    {
        "text": " bueno, si alguno tuvo algún contacto con algún tipo de empresa, pero bueno, hay momentos,",
        "start": 1257.16,
        "end": 1262.52
    },
    {
        "text": " por ejemplo, en que la facturación siempre sube y tiene su explicación. Por ejemplo, en el caso",
        "start": 1262.52,
        "end": 1269.4
    },
    {
        "text": " de un supermercado, el día previo, el primero de mayo, no sé si aún no está en el ruro,",
        "start": 1269.4,
        "end": 1275.48
    },
    {
        "text": " o conoce pero el día previo se compra muchísimo, porque la gente siente que al día siente va a estar",
        "start": 1275.48,
        "end": 1279.92
    },
    {
        "text": " todo cerrado, pero compra mucho más de lo que puede llegar a consumir en un día, y a su vez",
        "start": 1279.92,
        "end": 1286.3200000000002
    },
    {
        "text": " también, a ser asignados, a ser múneos, en un guay es algo típico que la previa, el primero de mayo,",
        "start": 1286.3200000000002,
        "end": 1292.4
    },
    {
        "text": " se compra mucho. También es normal dentro de supermercados que dentro de lo que es las fiestas,",
        "start": 1292.4,
        "end": 1299.24
    },
    {
        "text": " verdad, también se compra mucho, o dentro de lo que son empresas de regal o sobrevestimientos,",
        "start": 1299.24,
        "end": 1305.2
    },
    {
        "text": " también cerca del periodo festivo se compra mucho. Y eso tiene una explicación, pero muchas veces",
        "start": 1305.2,
        "end": 1311.32
    },
    {
        "text": " sea que no tiene una explicación, ¿verdad? Porque un día la facturación tuvo una sube,",
        "start": 1311.32,
        "end": 1317.32
    },
    {
        "text": " veces son temas aleatorios. Y bueno, la interésación lo busca es que los tomadores decisiones",
        "start": 1317.32,
        "end": 1325.2
    },
    {
        "text": " tratar de interpretación, hay menos que realidad son aleatorios, ¿no? Entonces lo que dice ahí es que",
        "start": 1325.2,
        "end": 1331.44
    },
    {
        "text": " cuesta trabajo lidiar, verdad que situaciones sin previstas puedan ocurrir, ¿no? Y que no",
        "start": 1332.0,
        "end": 1339.04
    },
    {
        "text": " no podemos predecirla, no todo se puede predecir. Si podemos predecirlo, que lo que yo le decía,",
        "start": 1339.04,
        "end": 1345.24
    },
    {
        "text": " que antes primero de mayo vamos a tener cierto nivel de ventas, que cerca la fiesta vamos a tener",
        "start": 1345.24,
        "end": 1349.68
    },
    {
        "text": " cierto nivel de ventas. Sejo de error de los costos unidos. Esto también pasa, bueno, así como",
        "start": 1349.68,
        "end": 1360.52
    },
    {
        "text": " pasa con la siempresa pasa también a nivel personal, ¿no? A veces cuando gastamos mucho en algo,",
        "start": 1360.52,
        "end": 1365.28
    },
    {
        "text": " es como que nos quedamos en casi ya o sin eso y tratar de solucionar eso cuando en realidad quizás",
        "start": 1365.28,
        "end": 1372.44
    },
    {
        "text": " hay que soltar y buscar otra decisión.",
        "start": 1372.44,
        "end": 1375.8
    },
    {
        "text": " Entonces lo que habla justamente de esta toma de decisión, los tomadores decisiones olvían que",
        "start": 1379.52,
        "end": 1386.24
    },
    {
        "text": " las selecciones tomados hoy no van a corregir el pasado, en consecuencia, el valor de los",
        "start": 1386.24,
        "end": 1391.2
    },
    {
        "text": " alternativas pone demasiado atención en los gastos de tiempo, dinero, esfuerzo en que se incurrieron",
        "start": 1391.2,
        "end": 1396.96
    },
    {
        "text": " en el pasado, en lugar de pensar, bueno, ¿qué va a pasar en el futuro si yo tomo esta decisión?",
        "start": 1396.96,
        "end": 1404.04
    },
    {
        "text": " Pero muchas veces pasa que por ejemplo, se toma una mala decisión a la hora de instalar una",
        "start": 1404.04,
        "end": 1410.36
    },
    {
        "text": " sucursal, se instalara su cursal y no se tomaron en cuenta aspectos que había que tomar como, por",
        "start": 1410.36,
        "end": 1415.92
    },
    {
        "text": " ejemplo, realizar encuestas, hacer grupos focos para darse a un interés realmente en esa zona,",
        "start": 1415.92,
        "end": 1423.48
    },
    {
        "text": " analizar la población, analizar las edades, analizar si el público consumio, ¿no?",
        "start": 1423.48,
        "end": 1432.0
    },
    {
        "text": " ¿Ese bruto? Bueno, eso no se hizo correctamente, se instaló la sucursal, si se un gasto,",
        "start": 1432.0,
        "end": 1437.64
    },
    {
        "text": " se alquilos, se pintó el local, verdad si instalaron todas las máquinas, etcétera. Bueno, ahí,",
        "start": 1437.64,
        "end": 1446.3600000000001
    },
    {
        "text": " a la hora de tomar la decisión muchas veces, lo que se trata, para justamente porque ya hay muchos",
        "start": 1446.3600000000001,
        "end": 1452.96
    },
    {
        "text": " costos, por la vez, bueno, vamos a tratar de solucionar esto y se sigue entiendo, cuando",
        "start": 1452.96,
        "end": 1457.94
    },
    {
        "text": " realidad lo que hay que tomar es la mejor decisión, bueno, si eso no funcionó, bueno, hay que pensar",
        "start": 1457.94,
        "end": 1463.1200000000001
    },
    {
        "text": " a futuro, alguien obviamente va a sumir esos costos, ¿no? Pero hay que también mirar a futuro y pensar",
        "start": 1463.12,
        "end": 1470.04
    },
    {
        "text": " qué es lo que lo que uno quiere para la empresa. Entonces, el error de los costos unidos creo que es",
        "start": 1470.04,
        "end": 1475.6399999999999
    },
    {
        "text": " bastante habitual, que cuando se tratamos de ver todo el tiempo, todo lo que se imitió en ese bueno,",
        "start": 1475.6399999999999,
        "end": 1482.52
    },
    {
        "text": " seguimos sobre el solo mismo tema. Sejó por interés personal, viene a hacer al ardir",
        "start": 1482.52,
        "end": 1490.6799999999998
    },
    {
        "text": " y mediato sus éxitos y culpara cualquiera de factores externos por su fracaso, son vítimas",
        "start": 1490.68,
        "end": 1495.3600000000001
    },
    {
        "text": " del séjo por interés personal. Esto es muy habitual, cuando nos va bien, bueno, entonces es porque somos",
        "start": 1495.3600000000001,
        "end": 1502.68
    },
    {
        "text": " excelentes tomadores de decisiones, cuando nos va mal, bueno, no hubiera factores externos,",
        "start": 1502.68,
        "end": 1507.8
    },
    {
        "text": " vino tal situación, vino tal tal otro factor, en realidad eran cosas que yo no podía manejar,",
        "start": 1507.8,
        "end": 1514.5600000000002
    },
    {
        "text": " no? Entonces, bueno, eso es algo que se da habitualmente. Alguna duda está.",
        "start": 1514.56,
        "end": 1522.8799999999999
    },
    {
        "text": " Luego tenemos el sejo de retrospectiva, que lo que dice que es la tendencia de los tomadores",
        "start": 1529.6,
        "end": 1536.2
    },
    {
        "text": " de decisiones a creer que han podido predecir con el sacrificio de resultados de ese evento,",
        "start": 1536.2,
        "end": 1541.28
    },
    {
        "text": " una vez que dicho resultado ya conocido, acá en Uruguay tenemos una frase típica que",
        "start": 1541.8,
        "end": 1548.16
    },
    {
        "text": " hicimos siempre en estos casos y que, bueno, que muchas veces nos molestamos en nuestros trabajos",
        "start": 1548.16,
        "end": 1552.12
    },
    {
        "text": " cuando alguien opina, cuando ya se tiene el dato o la solución, ya se sabe qué pasó. ¿Qué frase usamos?",
        "start": 1552.12,
        "end": 1560.12
    },
    {
        "text": " Lo recuerda. Es cierto, bueno, me voy a ir se lejando con el diario de lunes, pero muchas veces",
        "start": 1572.28,
        "end": 1581.84
    },
    {
        "text": " pasa, que después que ya está la solución, bueno, todos dice, no, sí, claro, ese es el camino que",
        "start": 1581.84,
        "end": 1587.28
    },
    {
        "text": " teníamos que tomar, no? Ahora eso también es un...un sé. Reflexión y ya lo fuimos viendo en la medida",
        "start": 1587.28,
        "end": 1594.92
    },
    {
        "text": " que fuimos tocando el demás ego, ¿no? Primero es que los ingredientes tienen que estar conscientes de",
        "start": 1595.44,
        "end": 1601.1200000000001
    },
    {
        "text": " que los cejos existen. Los ingredientes dicen que nunca tomó una decisión y se vien influenciado por un",
        "start": 1601.1200000000001,
        "end": 1607.0800000000002
    },
    {
        "text": " cejo, bueno, es muy difícil, los cejos existen y, justamente, el primer paso de saber que existen,",
        "start": 1607.0800000000002,
        "end": 1613.5600000000002
    },
    {
        "text": " ser conscientes de que tenemos cejos, tratar de identificar en nuestro caso, que o que está bueno",
        "start": 1613.5600000000002,
        "end": 1619.6000000000001
    },
    {
        "text": " ustedes también lo vean, qué es lo que, mayoritariamente le sucede a la hora de tomar decisiones y si",
        "start": 1619.6,
        "end": 1627.6799999999998
    },
    {
        "text": " tienen necesidades confianzas y quizás que se quedan ancrados y se acuerdan de lo último que",
        "start": 1627.6799999999998,
        "end": 1632.32
    },
    {
        "text": " pasó, bueno, dar qué es lo que... lo que habitalmente le está sucedido y no utilizable. También,",
        "start": 1632.32,
        "end": 1640.48
    },
    {
        "text": " bueno, atención al cómo toman las decisiones, lo que decíamos, ¿no? Hay que tomar ese tiempo para",
        "start": 1640.48,
        "end": 1645.8799999999999
    },
    {
        "text": " tomar una decisión. No hay que apurarse más cuando obviamente son decisiones de cierto importe.",
        "start": 1645.88,
        "end": 1652.68
    },
    {
        "text": " Les comentaba que, bueno, el tema de la base de carroca, porque uno de estos a nivel personal,",
        "start": 1654.68,
        "end": 1659.0800000000002
    },
    {
        "text": " bueno, yo me tomo un tiempo para analizarlo porque tenía un costo, a capa que si uno va a",
        "start": 1659.0800000000002,
        "end": 1663.64
    },
    {
        "text": " comprar algo más chiquito, debe a 20, 30 dólares, uno analiza tanto porque no está la",
        "start": 1663.64,
        "end": 1670.48
    },
    {
        "text": " diferencia, pero en estos casos sí, uno pide cotizaciones, analiza, pero supongo, pero la",
        "start": 1670.48,
        "end": 1674.6000000000001
    },
    {
        "text": " garantía y la marca, porque no es algo que uno compra habitualmente, es algo que uno compra",
        "start": 1674.6,
        "end": 1679.24
    },
    {
        "text": " cada cierta cantidad de años. Entonces, poné atención de cómo tomamos decisiones que los invito",
        "start": 1679.24,
        "end": 1686.1599999999999
    },
    {
        "text": " de ahora es más que cada vez que van a tomar una decisión que tiene un impacto en ustedes,",
        "start": 1686.1599999999999,
        "end": 1691.9599999999998
    },
    {
        "text": " que inviesen a notar y aplastmar y a buscar información y van a ver que van a notar la diferencia.",
        "start": 1691.9599999999998,
        "end": 1699.24
    },
    {
        "text": " Y por último, tal lo que les dice es lo que yo les decía, tratar de preguntar a otro cuando vamos",
        "start": 1700.24,
        "end": 1706.84
    },
    {
        "text": " a tomar una decisión, no tomarla nosotros solo, porque seguramente no se está afectando algún tipo",
        "start": 1706.84,
        "end": 1711.84
    },
    {
        "text": " de sesgo y no nos estemos dando cuenta, que no quiere decir que tomemos la decisión de lo que nos",
        "start": 1711.84,
        "end": 1716.56
    },
    {
        "text": " dice la otra persona, la otra persona nos va a dar su opinión, nos va a fundamentar su opinión y en",
        "start": 1716.56,
        "end": 1723.72
    },
    {
        "text": " base a eso nosotros vamos a tomar la decisión. Después lo otro es que, y esto fuera de este",
        "start": 1723.72,
        "end": 1731.96
    },
    {
        "text": " punto, que la vida no es una disculpección, en los trabajos, no es una disculpección, entonces",
        "start": 1731.96,
        "end": 1738.04
    },
    {
        "text": " siempre es importante fundamentar el porqué de las decisiones, cuando pedimos a otra persona que nos",
        "start": 1738.04,
        "end": 1742.68
    },
    {
        "text": " diga por qué motivo entienden que esa alternativa es mejor que la otra, es, bueno, en que te basaste,",
        "start": 1742.68,
        "end": 1750.3600000000001
    },
    {
        "text": " que información usaste, entonces de esa forma les permite ustedes comparar con el análisis que",
        "start": 1750.36,
        "end": 1755.1999999999998
    },
    {
        "text": " ustedes hicieron, hay muchas veces hablándolo con otros integrantes del equipo, uno puede tener una",
        "start": 1755.1999999999998,
        "end": 1761.76
    },
    {
        "text": " opinión muy valiosa, que nutra y que, de alguna forma nos nos permita mejorar nuestra decisión o",
        "start": 1761.76,
        "end": 1769.6399999999999
    },
    {
        "text": " confirmar nuestra decisión, porque también puede ser que nosotros estemos en lo correcto cuando la",
        "start": 1769.6399999999999,
        "end": 1775.1999999999998
    },
    {
        "text": " persona nos fundamenta los motivos, uno le dían por qué cae un reporte que dice algo diferente",
        "start": 1775.2,
        "end": 1782.88
    },
    {
        "text": " de lo que tú estás plasmando aquí, pero siempre es importante tener, en verdad, esas personas de",
        "start": 1782.88,
        "end": 1788.72
    },
    {
        "text": " confianza los ha llegado que nos den información. ¿Alguna duda está acá?",
        "start": 1788.72,
        "end": 1793.96
    },
    {
        "text": " Bueno, si no hay duda esa idea, ahora desde 7 y 40 hasta el asocho que se junten en grupos,",
        "start": 1793.96,
        "end": 1812.44
    },
    {
        "text": " que yo les voy a mandar a grupos, y que busquen una decisión, por ejemplo, puede ser la compra",
        "start": 1812.44,
        "end": 1820.64
    },
    {
        "text": " en la computadora, puede ser una oportunidad laboral, puede ser cada grupo va a elegir una decisión,",
        "start": 1820.64,
        "end": 1828.2800000000002
    },
    {
        "text": " y en base a eso va a plantear, ¿cuáles son los criterios de decisión? ¿Cuáles se entienden que son",
        "start": 1828.2800000000002,
        "end": 1835.5200000000002
    },
    {
        "text": " más importantes? O sea, ¿cómo los van a ponderar? Y luego, ¿cuáles son las alternativas? Con dos",
        "start": 1835.5200000000002,
        "end": 1842.6000000000001
    },
    {
        "text": " alternativas ya está bien, no es necesario, así que bueno, la idea es que busquen 4, 5 criterios de",
        "start": 1842.6000000000001,
        "end": 1849.3200000000002
    },
    {
        "text": " decisión, dos alternativas y de alguna forma que traten de puntuares. Es ese juzar, verdad, la",
        "start": 1849.32,
        "end": 1859.48
    },
    {
        "text": " decisión. Ahora lo vamos a ver en conjunto, pero bueno, los voy a mandar a grupos.",
        "start": 1859.48,
        "end": 1866.8799999999999
    },
    {
        "text": " Bueno, vamos retornando de los grupos, y la idea es que ahora compartan lo que estuvieran en el",
        "start": 1866.88,
        "end": 1880.96
    },
    {
        "text": " sal. A ver, ¿qué grupo se anima?",
        "start": 1880.96,
        "end": 1893.6000000000001
    },
    {
        "text": " ¿Qué grupo se anima a compartir? ¿Qué silencio? O combatan ventas, ya quizás, con algo",
        "start": 1893.6,
        "end": 1923.48
    },
    {
        "text": " de lo que hayan ido trabajando. No tienen vocero en los grupos.",
        "start": 1923.48,
        "end": 1932.24
    },
    {
        "text": " Bueno, mientras que van pensando quién va a ser el vocero de cada grupo, les voy a hacer",
        "start": 1932.24,
        "end": 1960.44
    },
    {
        "text": " unos comentarios generales que son importantes de tener en cuenta con un objeto de automás",
        "start": 1960.44,
        "end": 1965.1200000000001
    },
    {
        "text": " decisiones. ¿Qué es para ese juggerente que tiene en cuenta la verdad tomar una decisión?",
        "start": 1965.1200000000001,
        "end": 1970.48
    },
    {
        "text": " ¿Qué es para ese?",
        "start": 1979.48,
        "end": 1980.24
    },
    {
        "text": " Bueno, algunos temas, ¿sabrán que vimos en una de las primeras clases toda la importancia de la cultura?",
        "start": 1980.24,
        "end": 1993.92
    },
    {
        "text": " Bueno, las diferencias culturales es importante entenderlas. No todos los gerentes que tomen decisiones",
        "start": 1993.92,
        "end": 2000.48
    },
    {
        "text": " vienen a analizar los valores, las creencias, las actitudes y los patrones de comportamiento de las",
        "start": 2000.48,
        "end": 2009.52
    },
    {
        "text": " personas involucradas. Vean, incluso, que no solo los países tienen sus características de cultura,",
        "start": 2009.52,
        "end": 2015.96
    },
    {
        "text": " sino que también las empresas, una decisión que puede ser muy buena en una empresa, pueden",
        "start": 2015.96,
        "end": 2021.04
    },
    {
        "text": " no solo en otra, porque las características culturales son bien distintas. Luego tenemos también el",
        "start": 2021.04,
        "end": 2027.72
    },
    {
        "text": " crear estándares para la toméfica de decisiones. Hay que tener en cuenta la situación futura,",
        "start": 2027.72,
        "end": 2034.56
    },
    {
        "text": " no pasamos en situación en información disponible, tener en cuenta todas las opciones disponibles y",
        "start": 2034.56,
        "end": 2041.8
    },
    {
        "text": " viables, no generar conflictos de interés. Otro punto bien importante es saber rendirse.",
        "start": 2041.8,
        "end": 2049.2
    },
    {
        "text": " Hay momentos en los que si tomamos una decisión y vemos que no está funcionando y bueno,",
        "start": 2049.9199999999996,
        "end": 2058.4399999999996
    },
    {
        "text": " hay que saber dar marcha atrás. Y a veces eso cuesta mucho darse cuenta de que, bueno,",
        "start": 2058.4399999999996,
        "end": 2063.0
    },
    {
        "text": " que quizás no fue una buena decisión que genera mucho choque culturales o que no simplemente no",
        "start": 2063.0,
        "end": 2071.68
    },
    {
        "text": " estaras dando, bueno, hay que saber rendirse. Eso también es un aspecto general a tener en cuenta la",
        "start": 2072.24,
        "end": 2078.3199999999997
    },
    {
        "text": " vez de tomar decisiones. Luego lo que decíamos usaron un proceso de tomar decisiones,",
        "start": 2078.3199999999997,
        "end": 2084.9199999999996
    },
    {
        "text": " enfocamos en lo importante, ser lógicos, ser consistentes, tomar en cuenta aspectos objetivos,",
        "start": 2084.9199999999996,
        "end": 2094.08
    },
    {
        "text": " verdad y también objetivos, hacer también un pensamiento analítico, hacer cálculo lo que",
        "start": 2094.08,
        "end": 2100.68
    },
    {
        "text": " le decía de búsquen información, analismo, procesen, usen los programas que tienen disponibles para",
        "start": 2100.68,
        "end": 2107.04
    },
    {
        "text": " poder procesar justamente grandes candidatos, análisis particular de la situación, busquen datos",
        "start": 2107.04,
        "end": 2118.0
    },
    {
        "text": " relevantes, búsquen y opiniones sobre los temas. Si están tomando una decisión sobre el área de",
        "start": 2118.0,
        "end": 2125.64
    },
    {
        "text": " ventas, bueno, llámenas, creen de ventas, llámenas quizás al vendedor que tenga mayor experiencia,",
        "start": 2125.64,
        "end": 2131.28
    },
    {
        "text": " no? Traten de rodearse de garantías de que están tomando una buena decisión. Luego, bueno, tratar de",
        "start": 2131.28,
        "end": 2139.8
    },
    {
        "text": " detectar los cambios inesperados por en torno y adaptarse rápidamente a ellos, hablábamos, por",
        "start": 2139.8,
        "end": 2146.12
    },
    {
        "text": " ejemplo, el caso de la pandemia y decíamos que las centresas que sobrevieron por en aquellas",
        "start": 2146.12,
        "end": 2152.3599999999997
    },
    {
        "text": " que, bueno, hubieron adaptarse, pudieron hacer modificaciones, eso es muy importante.",
        "start": 2152.3599999999997,
        "end": 2158.3599999999997
    },
    {
        "text": " Algunas dudas acá? Bueno, ahí me quede un grupo que empezó a notar, bueno, acá lo que dicen es",
        "start": 2161.12,
        "end": 2171.88
    },
    {
        "text": " que se fueron por el tema de una decisión cotidiana y que es que hacer para almorzar, y bueno,",
        "start": 2171.88,
        "end": 2178.84
    },
    {
        "text": " ahí en la toma de decisiones, lo que miran es el tiempo requerido para poderlar la comida,",
        "start": 2178.84,
        "end": 2184.44
    },
    {
        "text": " los ingredientes que tienen, el costo, si es saludable o no? Bueno, muy bien, ese grupo.",
        "start": 2185.7200000000003,
        "end": 2192.84
    },
    {
        "text": " Muy bien, muy bien. Y bueno, alternativas, ahí tienen el tema de elaborar, ahí veo que también",
        "start": 2193.32,
        "end": 2203.52
    },
    {
        "text": " pusieron en combina fuera con otra alternativa. Muy bien, otro ejemplo.",
        "start": 2203.52,
        "end": 2209.0
    },
    {
        "text": " No?",
        "start": 2215.2000000000003,
        "end": 2215.7200000000003
    },
    {
        "text": " Bueno, si no hay más ejemplos, bueno, vimos ya bastante de toma de decisiones, así que vamos a",
        "start": 2223.84,
        "end": 2231.6000000000004
    },
    {
        "text": " pasar el tema siguiente.",
        "start": 2231.6000000000004,
        "end": 2233.2000000000003
    },
    {
        "text": " Le voy a compartir un video antes de arrancar con el tema siguiente.",
        "start": 2242.08,
        "end": 2250.6800000000003
    },
    {
        "text": " Si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si",
        "start": 2252.84,
        "end": 2282.84
    },
    {
        "text": " si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si",
        "start": 2282.84,
        "end": 2312.84
    },
    {
        "text": " si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si",
        "start": 2312.84,
        "end": 2342.84
    },
    {
        "text": " si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si",
        "start": 2342.84,
        "end": 2372.84
    },
    {
        "text": " si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si",
        "start": 2372.84,
        "end": 2402.84
    },
    {
        "text": " si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si",
        "start": 2402.84,
        "end": 2432.84
    },
    {
        "text": " si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si",
        "start": 2432.84,
        "end": 2462.84
    },
    {
        "text": " si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si",
        "start": 2462.84,
        "end": 2492.84
    },
    {
        "text": " si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si",
        "start": 2492.84,
        "end": 2522.84
    },
    {
        "text": " si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si",
        "start": 2522.84,
        "end": 2552.84
    },
    {
        "text": " si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si",
        "start": 2552.84,
        "end": 2582.84
    },
    {
        "text": " si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si",
        "start": 2582.84,
        "end": 2612.84
    },
    {
        "text": " si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si, si",
        "start": 2612.84,
        "end": 2642.84
    },
    {
        "text": " si, si, si, si, si, si, si, si, si, si, si, si, si, si, si... Ningx, Ningx",
        "start": 2642.84,
        "end": 2664.1400000000003
    },
    {
        "text": " más, caf China",
        "start": 2664.1400000000003,
        "end": 2668.02
    },
    {
        "text": " Jenny",
        "start": 2668.02,
        "end": 2669.2000000000003
    },
    {
        "text": " opiniones",
        "start": 2669.2,
        "end": 2672.2
    },
    {
        "text": " lo habían visto el vídeo ya anteriormente",
        "start": 2676.3999999999996,
        "end": 2680.7
    },
    {
        "text": " está muy silencioso, está que está clas bueno de qué trata el vídeo",
        "start": 2684.3999999999996,
        "end": 2690.3999999999996
    },
    {
        "text": " bueno justamente todo lo que es tener una meta trasladar esa meta la",
        "start": 2690.3999999999996,
        "end": 2696.64
    },
    {
        "text": " importancia a la de que todos conozcan esa meta de tener la camineta",
        "start": 2696.64,
        "end": 2701.2599999999998
    },
    {
        "text": " puesta como como decimos habitualmente a la de les dar con prometidos el",
        "start": 2701.2599999999998,
        "end": 2705.68
    },
    {
        "text": " conocerla, el involucrarse bueno da unos porcentajes que son bastantes de",
        "start": 2705.68,
        "end": 2710.96
    },
    {
        "text": " la armante no de lo que es el desconocimiento de las de las de las metas",
        "start": 2710.96,
        "end": 2716.48
    },
    {
        "text": " da también información verdad con con con respecto a la importancia de la",
        "start": 2716.48,
        "end": 2722.0
    },
    {
        "text": " estrategia pero todo lo que lleva delante la inlandación de la misma y como",
        "start": 2722.0,
        "end": 2726.72
    },
    {
        "text": " veces se dan a errores en esa parte y bueno ese ese vídeo verdad que tiene",
        "start": 2726.72,
        "end": 2734.6
    },
    {
        "text": " partes graciosas demuestra como cuando las cosas no están planificadas cuando",
        "start": 2734.6,
        "end": 2739.84
    },
    {
        "text": " no se tiene claro la meta cuando cada integrante de la organización no",
        "start": 2739.84,
        "end": 2744.12
    },
    {
        "text": " sabe exactamente cuál es su rol verdad es que sucede esas cosas no que no se",
        "start": 2744.12,
        "end": 2748.84
    },
    {
        "text": " cumple el el objetivo que en este caso desde el día de vista o inició era ganar el",
        "start": 2748.84,
        "end": 2754.2000000000003
    },
    {
        "text": " partido entonces un poquito un poquito viene viene por allí bueno este es la",
        "start": 2754.2000000000003,
        "end": 2759.28
    },
    {
        "text": " persona que habla es un autor muy reconocido en todo lo que es meta si",
        "start": 2759.28,
        "end": 2764.92
    },
    {
        "text": " organizaciones y bueno todo el análisis de las estrategias de la organización",
        "start": 2764.92,
        "end": 2770.6800000000003
    },
    {
        "text": " alguna duda hasta acá vimos este vídeo porque ahora vamos a arrancar con con",
        "start": 2771.3999999999996,
        "end": 2778.24
    },
    {
        "text": " otro tema y nos sirve de pie así que bueno ahora voy a compartir pantalla",
        "start": 2778.24,
        "end": 2783.8399999999997
    },
    {
        "text": " nuevamente",
        "start": 2783.8399999999997,
        "end": 2786.48
    },
    {
        "text": " vamos a ver como le decía la función de planificación se agarran que hablamos en",
        "start": 2800.68,
        "end": 2811.6
    },
    {
        "text": " su momento de los gerentes dijimos que los que creen desencaran administrar",
        "start": 2811.6,
        "end": 2815.7599999999998
    },
    {
        "text": " cuando hablamos administrar dijimos que era coordinar y si economizar las",
        "start": 2815.7599999999998,
        "end": 2819.6
    },
    {
        "text": " actividades laborales de otra persona de manera que se analizaba de forma",
        "start": 2819.6,
        "end": 2823.64
    },
    {
        "text": " espiciente de picaz en el mideito que vimos vimos que la coordinación",
        "start": 2823.64,
        "end": 2828.8399999999997
    },
    {
        "text": " votamente era parte de lo que no claramente no estaba funcionando y acá",
        "start": 2828.84,
        "end": 2835.04
    },
    {
        "text": " también esto es algo que ya hemos visto existían cuatro funciones de la",
        "start": 2835.04,
        "end": 2839.7200000000003
    },
    {
        "text": " administración la planificación la organización la dirección el control y",
        "start": 2839.7200000000003,
        "end": 2845.6400000000003
    },
    {
        "text": " todo eso nos conduce a alcanzar esos propósitos que la organización se",
        "start": 2845.6400000000003,
        "end": 2850.7200000000003
    },
    {
        "text": " detecta les la clase de hoy vamos a iniciar por la clase que viene no vamos a",
        "start": 2850.7200000000003,
        "end": 2855.48
    },
    {
        "text": " hablar con mayor profundidad en lo que es la planeación esa etapa donde",
        "start": 2855.48,
        "end": 2860.92
    },
    {
        "text": " definimos los objetivos establecemos la estrategia y desarrollamos los planes",
        "start": 2860.92,
        "end": 2867.64
    },
    {
        "text": " para coordinar las actividades acá vienen que se hablaba justamente el",
        "start": 2867.64,
        "end": 2874.72
    },
    {
        "text": " autor anterior en el vídeo que bueno muchas veces no estaba bien comunicada",
        "start": 2874.72,
        "end": 2879.8
    },
    {
        "text": " cual era la meta que muchas veces la estrategia tampoco era conocida por parte",
        "start": 2879.8,
        "end": 2886.52
    },
    {
        "text": " de las partes y bueno eso lleva luego a inconvenientes no la planeación es una",
        "start": 2886.52,
        "end": 2894.04
    },
    {
        "text": " función administrativa que involucra como decíamos la definición de los",
        "start": 2894.04,
        "end": 2898.1200000000003
    },
    {
        "text": " objetivos el estableciniendo de las estrategias para lograrnos y el desarrollo de",
        "start": 2898.1200000000003,
        "end": 2903.88
    },
    {
        "text": " planes para integrar y coordinar las actividades es fundamental luego ese",
        "start": 2903.88,
        "end": 2909.48
    },
    {
        "text": " plan que tenemos por escrito de donde integramos y coordinamos todas las",
        "start": 2909.48,
        "end": 2915.16
    },
    {
        "text": " diferentes actividades de la organización pero antes de eso tenemos que",
        "start": 2915.16,
        "end": 2919.2400000000002
    },
    {
        "text": " definir esos objetivos esos objetivos organizacionales que tienen que ser",
        "start": 2919.2400000000002,
        "end": 2923.6
    },
    {
        "text": " claros que tienen que ser medibles que tienen que ser alcanzables",
        "start": 2923.6,
        "end": 2929.56
    },
    {
        "text": " por qué planean los gerentes por un lado porque da dirección es importante saber",
        "start": 2929.56,
        "end": 2936.36
    },
    {
        "text": " cuál es el rumbo, cuál es el camino que esperamos para nuestra organización",
        "start": 2936.36,
        "end": 2940.8
    },
    {
        "text": " reduce la insertidumbre a cuando estamos en una organización que está",
        "start": 2940.8,
        "end": 2945.32
    },
    {
        "text": " bien planeada tenemos la menor sensación en la incertidumbre",
        "start": 2945.32,
        "end": 2951.44
    },
    {
        "text": " mi minimisa les parece la redundancia o sea muchas veces en algunas organizaciones",
        "start": 2951.44,
        "end": 2956.2000000000003
    },
    {
        "text": " que no tienen una buena planificación se realizan tareas en forma repetida",
        "start": 2956.2000000000003,
        "end": 2961.52
    },
    {
        "text": " hay sectores que controlan nuevamente algo que ya estaba bien",
        "start": 2961.52,
        "end": 2966.52
    },
    {
        "text": " realizado por otra vez entonces siempre está bueno que existe una planificación",
        "start": 2966.52,
        "end": 2971.04
    },
    {
        "text": " para que incluye una buena distribución en nuestro recurso es un análisis",
        "start": 2971.04,
        "end": 2974.88
    },
    {
        "text": " completo de lo que tenemos establece los objetivos o estándares que se",
        "start": 2974.88,
        "end": 2981.08
    },
    {
        "text": " utilizan en la función de control todo eso pero está dentro de lo que es la",
        "start": 2981.08,
        "end": 2986.72
    },
    {
        "text": " planeación de los objetivos el objetivo se ha resultado propósito que la",
        "start": 2986.72,
        "end": 2992.72
    },
    {
        "text": " organización quiere lograr y los planes que yo les decía son las úticas son",
        "start": 2992.72,
        "end": 2997.64
    },
    {
        "text": " bien importantes es el documento en el que se especifica cómo vamos a lograr",
        "start": 2997.64,
        "end": 3003.6
    },
    {
        "text": " esos objetivos existe a veces dichotomías entre los objetivos que establece",
        "start": 3003.6,
        "end": 3010.72
    },
    {
        "text": " la organización en los objetivos reales parte de esto lo vimos en la introducción",
        "start": 3010.72,
        "end": 3015.64
    },
    {
        "text": " de la primera clase en la primera clase vimos alguno de estos conceptos porque",
        "start": 3015.64,
        "end": 3019.92
    },
    {
        "text": " bueno cuando vimos todo el proceso la penetración y bueno previamente hicimos",
        "start": 3019.92,
        "end": 3026.64
    },
    {
        "text": " un pantallas los objetivos establecidos son los que se declaran oficialmente",
        "start": 3026.64,
        "end": 3033.72
    },
    {
        "text": " que es importante que justamente que realmente sean trasladados que sean",
        "start": 3033.72,
        "end": 3039.7999999999997
    },
    {
        "text": " informados que el personal conozca para dar hacia dónde quiere la organización",
        "start": 3039.7999999999997,
        "end": 3043.8799999999997
    },
    {
        "text": " pero muchas veces los que trabajan lo que visualizan es que en realidad de",
        "start": 3044.2400000000002,
        "end": 3048.7200000000003
    },
    {
        "text": " objetivos reales que no son los establecidos que son los auténticos objetivos",
        "start": 3048.7200000000003,
        "end": 3053.2400000000002
    },
    {
        "text": " que parcié la organización y que están definidos por las acciones de los",
        "start": 3053.2400000000002,
        "end": 3057.7200000000003
    },
    {
        "text": " integrantes no bueno realidad debería de la establecimiento de los objetivos",
        "start": 3057.7200000000003,
        "end": 3062.8
    },
    {
        "text": " que es lo que tiene real pero bueno muchas veces no no se da",
        "start": 3062.8,
        "end": 3068.44
    },
    {
        "text": " tipos de planes tenemos los planes podemos dividirlos por su alcance",
        "start": 3069.44,
        "end": 3076.28
    },
    {
        "text": " cuando son planes administratégico que va a participar la cúpula de la",
        "start": 3076.28,
        "end": 3080.7200000000003
    },
    {
        "text": " organización y que son esas grandes decisiones luego tenemos planes más",
        "start": 3080.7200000000003,
        "end": 3085.84
    },
    {
        "text": " operativos ahora igual los vamos a ir viendo uno a uno después también",
        "start": 3085.84,
        "end": 3091.76
    },
    {
        "text": " tenemos por temas temporales si son muy específicos o no por la frecuencia de",
        "start": 3091.76,
        "end": 3098.2000000000003
    },
    {
        "text": " uso a esa forma vamos dividiendo los planes",
        "start": 3098.2,
        "end": 3104.04
    },
    {
        "text": " por su alcance tenemos los estratégicos abargan toda la realización",
        "start": 3104.9199999999996,
        "end": 3109.64
    },
    {
        "text": " determinando los objetivos de tipo más general los planes son aplicados",
        "start": 3109.64,
        "end": 3114.04
    },
    {
        "text": " exclusivamente a un área operativa la organización se nomina planes",
        "start": 3114.04,
        "end": 3116.8799999999997
    },
    {
        "text": " operativos a como decíamos que quizás que no tienen influencia tan significativa",
        "start": 3116.8799999999997,
        "end": 3121.2799999999997
    },
    {
        "text": " a la cúpula como si en nosotros los estratégicos son una amplia el",
        "start": 3121.2799999999997,
        "end": 3125.6
    },
    {
        "text": " cáncer de los objetivos tienen repercusiones más limitadas por ejemplo",
        "start": 3125.6,
        "end": 3129.7599999999998
    },
    {
        "text": " decisiones con respecto a una línea de producción quizás que sea algo más",
        "start": 3129.7599999999998,
        "end": 3136.24
    },
    {
        "text": " más operativo ahora el lanzamiento de un producto porque me ya sería algo",
        "start": 3136.24,
        "end": 3140.12
    },
    {
        "text": " más estratégico",
        "start": 3140.12,
        "end": 3143.56
    },
    {
        "text": " por su marco temporal hablamos de corto y largo plazo y en diferentes",
        "start": 3144.08,
        "end": 3150.16
    },
    {
        "text": " distintos van a encontrar que en algunos habla de que corto plazo son aquí",
        "start": 3150.16,
        "end": 3155.64
    },
    {
        "text": " cantillar a ellos y otros otros bueno no se lo vamos a considerar nada como",
        "start": 3155.64,
        "end": 3160.04
    },
    {
        "text": " marco temporal verdad de largo plazo aquí yo que rebasa los tres años",
        "start": 3160.04,
        "end": 3166.2799999999997
    },
    {
        "text": " y",
        "start": 3166.28,
        "end": 3171.28
    },
    {
        "text": " y",
        "start": 3171.28,
        "end": 3176.28
    },
    {
        "text": " y",
        "start": 3176.28,
        "end": 3180.28
    },
    {
        "text": " lo que tenemos por su especificidad no acá tenemos los planes específicos lo que",
        "start": 3180.28,
        "end": 3184.32
    },
    {
        "text": " dice aquí que algunos pueden ya pensar que son preferibles a los direccionales",
        "start": 3184.32,
        "end": 3188.0
    },
    {
        "text": " debido a que estos últimos son más laxos en contraste lo que dice aquí es que",
        "start": 3188.0,
        "end": 3192.48
    },
    {
        "text": " los prenses específicos están definidos con toda claridad y no deja el lugar",
        "start": 3192.48,
        "end": 3195.8
    },
    {
        "text": " para la interpretación eso es lo importante de un plan específico que",
        "start": 3195.8,
        "end": 3201.6400000000003
    },
    {
        "text": " deje todo pautado todo todo marcado si un cliente dice que busca incrementar el",
        "start": 3201.6400000000003,
        "end": 3207.7200000000003
    },
    {
        "text": " 8% de producción generada por su mía trabajo podría estabelecer procedimientos",
        "start": 3207.7200000000003,
        "end": 3211.84
    },
    {
        "text": " partidas programas de actividad específicos para el programa da menos",
        "start": 3211.84,
        "end": 3217.7200000000003
    },
    {
        "text": " insertidumbre ahora cuando nosotros tenemos todo planificado todo marcado",
        "start": 3217.7200000000003,
        "end": 3221.6800000000003
    },
    {
        "text": " entonces por eso es importante",
        "start": 3221.68,
        "end": 3226.68
    },
    {
        "text": " acá lo que dice en es que cuando en el insertumbre salto los géneres de",
        "start": 3231.3999999999996,
        "end": 3236.72
    },
    {
        "text": " mostrarse flexibles a responder los camiones inspirados y los planes",
        "start": 3236.72,
        "end": 3240.3199999999997
    },
    {
        "text": " direccionales son justamente flexibles y establecen solamente el hígito",
        "start": 3240.3199999999997,
        "end": 3244.7599999999998
    },
    {
        "text": " final hay empresas que tienen un grado de cambio tan alto que no pueden tener un",
        "start": 3244.7599999999998,
        "end": 3249.9199999999996
    },
    {
        "text": " plan demasiado estricto y necesitan verdad esa esa posibilidad de flexibilidad",
        "start": 3249.92,
        "end": 3256.92
    },
    {
        "text": " y luego tenemos por la recuencia de uso hay planes que utilizamos en más",
        "start": 3257.52,
        "end": 3263.76
    },
    {
        "text": " de una oportunidad y hay planes que se hacen para una situación en particular",
        "start": 3263.76,
        "end": 3267.92
    },
    {
        "text": " a por ejemplo si la organización quiere generar una franquicia que fue un tema",
        "start": 3267.92,
        "end": 3276.2400000000002
    },
    {
        "text": " que vimos a puedan en otras en otras clases una franquicia a partir de su",
        "start": 3276.24,
        "end": 3280.64
    },
    {
        "text": " negocio a eso va a ser una una decisión que se va a tomar en un momento y se va a",
        "start": 3280.64,
        "end": 3286.8799999999997
    },
    {
        "text": " buscar información se van a resolver y va a ser un único uso a cómo por",
        "start": 3286.8799999999997,
        "end": 3291.16
    },
    {
        "text": " ejemplo se huirlos pasos",
        "start": 3291.16,
        "end": 3294.3599999999997
    },
    {
        "text": " sin embargo hay otras que van a ser más recurrentes",
        "start": 3296.08,
        "end": 3301.24
    },
    {
        "text": " esto es un gráfico que demuestra lo que habíamos hablado se van a que les mencioné",
        "start": 3302.2,
        "end": 3306.64
    },
    {
        "text": " que la la planeación estratégica iba a involucrar mayoritariamente a los",
        "start": 3306.64,
        "end": 3313.3199999999997
    },
    {
        "text": " objetivos de alto nivel y la operativa va a involucrar mayoritariamente a los",
        "start": 3313.3199999999997,
        "end": 3320.2
    },
    {
        "text": " perentes del primer mime",
        "start": 3320.2,
        "end": 3323.3999999999996
    },
    {
        "text": " a una búastra",
        "start": 3332.24,
        "end": 3336.24
    },
    {
        "text": " acabemos los fluidos que se generan para cuando se empieza a analizar",
        "start": 3349.24,
        "end": 3355.72
    },
    {
        "text": " los objetivos pero funcione cada uno de los sectores",
        "start": 3355.72,
        "end": 3362.2799999999997
    },
    {
        "text": " ahí esto es muy habitual",
        "start": 3362.2799999999997,
        "end": 3367.0
    },
    {
        "text": " ahí tenemos por ejemplo el objetivo de la alta dirección necesitamos mejorar el",
        "start": 3377.7599999999998,
        "end": 3381.8799999999997
    },
    {
        "text": " desempeñado la compañía cómo le interpreta luego y cómo lo trasladas su",
        "start": 3381.88,
        "end": 3387.36
    },
    {
        "text": " personal el sector siguiente el cliente de edición quiero ver una mejora",
        "start": 3387.36,
        "end": 3391.92
    },
    {
        "text": " significativa en la sueltividad de esta edición el geren de departamento vamos a",
        "start": 3391.92,
        "end": 3397.84
    },
    {
        "text": " aumentar la sueltividad sin importar que medio suque dice en para lograr",
        "start": 3397.84,
        "end": 3400.6400000000003
    },
    {
        "text": " vamos ya vemos que más creamos el ruido en todo lo que es la la comunicación y",
        "start": 3400.6400000000003,
        "end": 3406.7200000000003
    },
    {
        "text": " luego el personal dice no hay que popularizar la calidad solo trabajarra",
        "start": 3406.7200000000003,
        "end": 3410.92
    },
    {
        "text": " para mejorar el desempeñado la compañía les parece que están logrando en una",
        "start": 3411.88,
        "end": 3418.7200000000003
    },
    {
        "text": " mejora en el desempeñado la compañía no preocupó a no sé por la calidad",
        "start": 3418.7200000000003,
        "end": 3425.0
    },
    {
        "text": " que opinan",
        "start": 3429.92,
        "end": 3432.7200000000003
    },
    {
        "text": " bueno justamente no es ese ese problema cuando no se informa claramente",
        "start": 3432.72,
        "end": 3442.08
    },
    {
        "text": " cuáles son los objetivos hay empresas que lo que hacen son reuniones donde se",
        "start": 3442.08,
        "end": 3448.9199999999996
    },
    {
        "text": " trasladan los objetivos que tienen la realización y en esas reuniones se trata",
        "start": 3448.9199999999996,
        "end": 3455.04
    },
    {
        "text": " que participe toda la organización se trata de que se se trasladen la información",
        "start": 3455.04,
        "end": 3460.56
    },
    {
        "text": " de una forma clara precisa como seis tribuye materiales esa forma se trata de",
        "start": 3460.56,
        "end": 3466.68
    },
    {
        "text": " involucrar a todos los funcionarios y se evita esto que las tareas que las",
        "start": 3466.68,
        "end": 3472.24
    },
    {
        "text": " acciones que se llevan adelante sea muy diferentes lo que la organización",
        "start": 3472.24,
        "end": 3477.7599999999998
    },
    {
        "text": " desea que sucede en este caso vemos que la alta dirección lo que pide lo que",
        "start": 3477.7599999999998,
        "end": 3485.96
    },
    {
        "text": " traslada es que se mejora el desempeñado la compañía y cuando hablamos de ese",
        "start": 3485.96,
        "end": 3490.68
    },
    {
        "text": " empeño salgo bastante general y quizás que también es importante precisar",
        "start": 3490.68,
        "end": 3494.96
    },
    {
        "text": " que consideramos por desempeño pero bueno en definitiva lo que querían una",
        "start": 3494.96,
        "end": 3501.52
    },
    {
        "text": " mejora el desempeño y lo que logran por parte de lo que tiene en el igual es",
        "start": 3501.52,
        "end": 3507.56
    },
    {
        "text": " simplemente que hay que trabajar rápido no y no es en realidad lo que se quiso",
        "start": 3507.56,
        "end": 3513.28
    },
    {
        "text": " trasladar alguna duda hasta acá",
        "start": 3513.28,
        "end": 3517.48
    },
    {
        "text": " entonces si en las empresas de ustedes tienen conocimientos para esos objetivos",
        "start": 3526.5600000000004,
        "end": 3531.52
    },
    {
        "text": " si les saben ni cada cual son las metas",
        "start": 3531.52,
        "end": 3536.84
    },
    {
        "text": " pero bueno es fundamental y en caso que no lo tengan se lo pueden pedir a su",
        "start": 3545.44,
        "end": 3550.1
    },
    {
        "text": " jefe no bueno cuáles son los objetivos nada que es lo que la empresa espera de",
        "start": 3550.1,
        "end": 3553.8
    },
    {
        "text": " mí eso es fundamental ustedes en definitiva forman parte de los que ya están",
        "start": 3553.8,
        "end": 3559.68
    },
    {
        "text": " trabajando forman parte de una realización y bueno es importante que lo que las",
        "start": 3559.68,
        "end": 3563.64
    },
    {
        "text": " tareas que ustedes están llevando adelante ayuden a cumplir con ese con ese",
        "start": 3563.64,
        "end": 3568.48
    },
    {
        "text": " con ese objetivo que se fija la alta dirección",
        "start": 3568.48,
        "end": 3572.52
    },
    {
        "text": " catemos la diferencia entre lo que es el establecimiento tradicional de los",
        "start": 3583.7599999999998,
        "end": 3589.0
    },
    {
        "text": " objetivos y la cadena de medios y fines el tradicional de objetivos los gerentes",
        "start": 3589.0,
        "end": 3598.3
    },
    {
        "text": " de alto nivel determinan las metas que alfri al restauración se convierte en",
        "start": 3598.3,
        "end": 3602.68
    },
    {
        "text": " en subojetivos para cada área de la misma en definitiva se establece a raúme",
        "start": 3602.68,
        "end": 3608.6
    },
    {
        "text": " objetivo nada que luego se va determinando diferentes metas y influye a cada",
        "start": 3608.6,
        "end": 3616.4
    },
    {
        "text": " área que tiene que cumplir a conciertos y altos elementos la cadena de medios y fines",
        "start": 3616.4,
        "end": 3623.2400000000002
    },
    {
        "text": " en realidad se mira a una rella integrada de los objetivos entonces el",
        "start": 3623.2400000000002,
        "end": 3630.7200000000003
    },
    {
        "text": " cumplimiento de metas en un nivel va a permitir verdad y va a ser el medio para",
        "start": 3630.7200000000003,
        "end": 3636.8
    },
    {
        "text": " lanzar los propósitos que se persigan en el nivel siguiente y esto es sumamente",
        "start": 3636.8,
        "end": 3640.64
    },
    {
        "text": " importante que existe senerzo esa conexión ra esa integración recuerden que",
        "start": 3640.64,
        "end": 3648.44
    },
    {
        "text": " las organizaciones terminan siendo un sistema de partes interrelacionados entre sí",
        "start": 3648.44,
        "end": 3653.6
    },
    {
        "text": " donde cada una de las partes influye entonces verlo de esta forma es súper",
        "start": 3653.6,
        "end": 3659.44
    },
    {
        "text": " importante verdad como una reina integrada de objetivos y que logro verdad de",
        "start": 3659.44,
        "end": 3664.6
    },
    {
        "text": " cada uno de las metas de cada uno de los niveles va a ser el medio en definitiva",
        "start": 3664.6,
        "end": 3669.96
    },
    {
        "text": " para los propósitos del fin y el",
        "start": 3669.96,
        "end": 3674.7200000000003
    },
    {
        "text": " los objetivos esto bueno lo mencionamos estén escritos en términos de resultados",
        "start": 3676.96,
        "end": 3685.04
    },
    {
        "text": " más que de acciones esto no importa el tamaño de la empresa el tipo de",
        "start": 3685.04,
        "end": 3690.44
    },
    {
        "text": " actividad el objetivo tiene que estar por escrito a esto sí sí sí si",
        "start": 3690.44,
        "end": 3697.0
    },
    {
        "text": " empresarios que tengan en esas pequeñas y bueno que visas que no lo tengan por",
        "start": 3697.96,
        "end": 3703.48
    },
    {
        "text": " escrito bueno es que tratar de que vayan por ese camino y el día mañana si usted",
        "start": 3703.48,
        "end": 3708.2
    },
    {
        "text": " tiene un emprendimiento personal o si trabaja en una empresa y el objetivo",
        "start": 3708.2,
        "end": 3713.44
    },
    {
        "text": " tiene que estar por escrito hacia donde queremos si luego tiene que ser",
        "start": 3713.44,
        "end": 3718.92
    },
    {
        "text": " medible y cuantificable o sea por ejemplo no objetivo no puede ser ser los mejores",
        "start": 3718.92,
        "end": 3724.88
    },
    {
        "text": " qué significa salos mejores los mejores comparados con bien y que mejor dicen que",
        "start": 3725.2400000000002,
        "end": 3732.32
    },
    {
        "text": " los los salos más sustentables a los que más cuidamos al medio ambiente salos",
        "start": 3732.32,
        "end": 3737.52
    },
    {
        "text": " quedan las mejores condiciones laborales salos que le tienen más anancias",
        "start": 3737.52,
        "end": 3741.88
    },
    {
        "text": " salos que tienen menos costos salos que los más innovadores lo que tiene",
        "start": 3741.88,
        "end": 3746.6
    },
    {
        "text": " mejor calidad o sea bueno tienen que ser medible y verdad cuantificable hoy en día",
        "start": 3746.6,
        "end": 3754.0
    },
    {
        "text": " hay un montón de indicadores que nos permite medir incluso hay un montón de",
        "start": 3754.0,
        "end": 3759.58
    },
    {
        "text": " software que después lo podemos buscar incluso en internet es mucho software",
        "start": 3759.58,
        "end": 3764.04
    },
    {
        "text": " gratuito para poder justamente medir y cuantificar nuestros objetivos entonces no",
        "start": 3764.04,
        "end": 3770.44
    },
    {
        "text": " solo por ejemplo lo decimos bueno queremos que nuestro balance sea sol y o que",
        "start": 3770.44,
        "end": 3776.52
    },
    {
        "text": " sea sol ve bueno vamos a hacer una serie de indicadores financieros por",
        "start": 3776.52,
        "end": 3781.68
    },
    {
        "text": " ejemplo vamos a poner los ratios de liquidez para ver cómo están nuestras",
        "start": 3781.68,
        "end": 3784.7999999999997
    },
    {
        "text": " liquidez vamos a usar ratios de neudamiento para ver cómo están nuestros",
        "start": 3784.7999999999997,
        "end": 3789.8799999999997
    },
    {
        "text": " neudamientos vamos a usar ratios para las de por ejemplo la situación patrimonial",
        "start": 3789.8799999999997,
        "end": 3797.44
    },
    {
        "text": " vamos a analizar las distribuciones de utilidades pero todo tiene que ser",
        "start": 3797.44,
        "end": 3801.64
    },
    {
        "text": " muy medible y cuantificable son claros en relación con un marco temporal bueno",
        "start": 3801.64,
        "end": 3808.08
    },
    {
        "text": " tenemos que tener en cuenta bueno esto que queremos obtener lo vamos a obtener",
        "start": 3808.08,
        "end": 3812.72
    },
    {
        "text": " en un año lo vamos a obtener en seis meses porque bueno capaz que yo puedo decir bueno",
        "start": 3812.72,
        "end": 3819.44
    },
    {
        "text": " nosotros queremos mejorar las ventas simplemente las ventas y que las ventas",
        "start": 3819.44,
        "end": 3825.0
    },
    {
        "text": " pasen a 40 millones de dólares bueno en cuanto tiempo bueno el primer año yo espero",
        "start": 3825.0,
        "end": 3832.36
    },
    {
        "text": " tal incremento ventas en el segundo año tal incremento de ventas otro aspecto es",
        "start": 3832.36,
        "end": 3838.76
    },
    {
        "text": " que sean desafiantes pero alcanzables esto esto es muy importante si a un",
        "start": 3838.76,
        "end": 3845.7200000000003
    },
    {
        "text": " mendedor por ejemplo se repone un objetivo que es muy difícil de cumplir",
        "start": 3845.7200000000003,
        "end": 3850.56
    },
    {
        "text": " simplemente se va a desmotivar y vamos a hacer el efecto contrario entonces tienen",
        "start": 3850.56,
        "end": 3856.4
    },
    {
        "text": " que ser obviamente desafiada antes no no no puede ser algo que se obtenga rápidamente",
        "start": 3856.4,
        "end": 3863.76
    },
    {
        "text": " tiene que ser un desafío pero tiene que ser alcanzable tiene que ser lograble para",
        "start": 3863.76,
        "end": 3868.2400000000002
    },
    {
        "text": " que la persona trabaje a gusto y comprometida con el objetivo se presenta adecuadamente",
        "start": 3868.2400000000002,
        "end": 3874.56
    },
    {
        "text": " por escrito es algo de lo que de lo que ya hablamos también además de que tiene que estar",
        "start": 3874.56,
        "end": 3879.4
    },
    {
        "text": " en términos de resultados más que naciones pero bueno tienen que estar también por",
        "start": 3879.4,
        "end": 3883.44
    },
    {
        "text": " escrito y esto que fundamental es ser comunicados a todos los miembros de la",
        "start": 3884.44,
        "end": 3889.44
    },
    {
        "text": " organización muchas veces sucede que la forma en que lo trasladamos quizás",
        "start": 3889.44,
        "end": 3894.16
    },
    {
        "text": " sea una reacción diferente o sea no no es lo mismo la información que le vamos a dar",
        "start": 3894.16,
        "end": 3900.12
    },
    {
        "text": " quizás que a los a los querentes de cada sector verdad que tienen cierta formación y",
        "start": 3900.12,
        "end": 3907.16
    },
    {
        "text": " quizás que no sólo buscamos una forma de explicarlo diferente para personas que",
        "start": 3907.16,
        "end": 3911.68
    },
    {
        "text": " capaz que no están tanto en la económico entonces vemos la forma de trasladarlo pero tienen",
        "start": 3911.68,
        "end": 3918.0
    },
    {
        "text": " que estar trasladados y todos los funcionarios tienen que tener la posibilidad de conocerlo esos",
        "start": 3918.0,
        "end": 3925.16
    },
    {
        "text": " datos alguna duda hasta acá",
        "start": 3925.16,
        "end": 3927.48
    },
    {
        "text": " vamos a dar lo siguiente",
        "start": 3927.48,
        "end": 3941.32
    },
    {
        "text": " recorremos que estamos viendo la planificación la planificación que es una de las",
        "start": 3941.32,
        "end": 3957.8
    },
    {
        "text": " funciones de la administración y que allí es donde se definen los objetivos y se establecen",
        "start": 3957.8,
        "end": 3964.32
    },
    {
        "text": " las estrategias para desarrollar los planes y coordinar las actividades y recuerden que la",
        "start": 3964.32,
        "end": 3969.8
    },
    {
        "text": " planificación a como bien dijimos hace un rato lo hacen los querentes",
        "start": 3969.8,
        "end": 3976.8
    },
    {
        "text": " así vamos a seguir con lo siguiente",
        "start": 3978.6000000000004,
        "end": 3982.1200000000003
    },
    {
        "text": " recuerden este este tema que bueno que es bastante preguntado el día de las de las parciales",
        "start": 3985.2400000000002,
        "end": 3993.36
    },
    {
        "text": " dudas consultas",
        "start": 4000.8,
        "end": 4006.8
    },
    {
        "text": " analizar temas contemporáneos relativos a la planificación",
        "start": 4013.8,
        "end": 4017.8
    },
    {
        "text": " acá lo que se plantea es que uno de los temas contemporáneos relacionados con la",
        "start": 4017.8,
        "end": 4023.6400000000003
    },
    {
        "text": " planificación y la existencia de entornos dinámicos que por lo general implica desarrollos",
        "start": 4024.64,
        "end": 4028.64
    },
    {
        "text": " planes específicos pero flexibles está bien que hoy hayamos visto que tenían que ser",
        "start": 4028.64,
        "end": 4034.64
    },
    {
        "text": " flexibles o no bueno definitiva en entornos dinámicos a lo que habíamos visto tienen que",
        "start": 4034.64,
        "end": 4041.64
    },
    {
        "text": " ser flexibles cuando nosotros hacemos una planificación la planificación no puede estar",
        "start": 4041.64,
        "end": 4048.64
    },
    {
        "text": " en el momento que se ha significado todo el tiempo rado no y que nada menos oraniza,",
        "start": 4049.64,
        "end": 4054.64
    },
    {
        "text": " arma un grupo genera una planificación luego yamente en base a esa planificación se van a",
        "start": 4054.64,
        "end": 4062.14
    },
    {
        "text": " ser unas recursos la verdad es que van a generar un montón de acciones verdad que vienen",
        "start": 4062.14,
        "end": 4068.64
    },
    {
        "text": " después de toda esa parte de la amplificación pero como como es aquí tiene que tener cierto",
        "start": 4068.64,
        "end": 4076.64
    },
    {
        "text": " o de flexibilidad teniendo en cuenta que hoy en día los entornos son muy dinámicos",
        "start": 4076.64,
        "end": 4082.64
    },
    {
        "text": " ustedes piensen lo que fue bueno el tema de la pandemia en su momento y bueno ahora tenemos",
        "start": 4082.64,
        "end": 4091.64
    },
    {
        "text": " otra situación la cual es que es lo que está sucediendo ahora que bueno acá ha generado",
        "start": 4091.64,
        "end": 4097.639999999999
    },
    {
        "text": " ciertos cambios en lo que son nuestros hábitos cotidianos",
        "start": 4097.639999999999,
        "end": 4100.639999999999
    },
    {
        "text": " y",
        "start": 4107.64,
        "end": 4108.64
    },
    {
        "text": " por allí",
        "start": 4111.64,
        "end": 4112.64
    },
    {
        "text": " perfecto ahí están mencionando el tema del lenguoso y tenés si si siga avanzando y bueno seguramente",
        "start": 4115.64,
        "end": 4122.64
    },
    {
        "text": " la gente ya no utilice tanto los eventos que sean en espacios exteriores no un poco para",
        "start": 4122.64,
        "end": 4131.64
    },
    {
        "text": " para cuidarse ha cambiado también algunos algunos hábitos de consumo",
        "start": 4131.64,
        "end": 4136.64
    },
    {
        "text": " hábitos de consumo que han cambiado también estamos comprando más repelentes",
        "start": 4144.64,
        "end": 4149.64
    },
    {
        "text": " bueno acá tenemos otro tema cuando en por año",
        "start": 4153.64,
        "end": 4156.64
    },
    {
        "text": " bueno el examen del entorno esto es fundamental analizar las condiciones externas",
        "start": 4157.64,
        "end": 4164.64
    },
    {
        "text": " qué es lo que puede suceder miren que situaciones de crisis de guerra sucedido que hay importaciones",
        "start": 4164.64,
        "end": 4170.64
    },
    {
        "text": " que no se han podido organizar entonces ya no es solo lo que pasa en Uruguay y eso",
        "start": 4170.64,
        "end": 4176.64
    },
    {
        "text": " lo vimos cuando analizamos toda la temática también de externo recuerden que cuando vimos",
        "start": 4176.64,
        "end": 4183.64
    },
    {
        "text": " todo lo que era el el entorno vimos como se generaba un cierta influencia a lo que era la",
        "start": 4183.64,
        "end": 4190.64
    },
    {
        "text": " la organización bueno entonces a la hora de planear yo tengo que tener en cuenta de que mi",
        "start": 4190.64,
        "end": 4196.64
    },
    {
        "text": " organización no está en un ambiente cerrado que no tenga influencia de lo que pasan",
        "start": 4196.64,
        "end": 4201.64
    },
    {
        "text": " en el exterior sino que todo lo contrario va a estar influida por su entorro entonces tenemos",
        "start": 4201.64,
        "end": 4206.64
    },
    {
        "text": " que analizar todas esas condiciones externas",
        "start": 4206.64,
        "end": 4210.64
    },
    {
        "text": " y luego ver qué es lo que están haciendo los competidores",
        "start": 4211.64,
        "end": 4217.64
    },
    {
        "text": " a eso es fundamental y sucede muchas veces que las empresas a la hora de lanzar un producto",
        "start": 4217.64,
        "end": 4224.64
    },
    {
        "text": " o mismo con producto que ya están desarrollando visualizan que es lo que están haciendo",
        "start": 4224.64,
        "end": 4230.64
    },
    {
        "text": " otros antes de planear por ejemplo qué tipo de empaquetado están utilizando",
        "start": 4230.64,
        "end": 4237.64
    },
    {
        "text": " qué formas de entreas están utilizando como es la forma de pago que tiene que",
        "start": 4237.64,
        "end": 4243.64
    },
    {
        "text": " tienes otra empresa y eso se puede contratar empresas para que hagan esos estudios",
        "start": 4243.64,
        "end": 4249.64
    },
    {
        "text": " o la propia empresa hacerlo con sus funcionales y la forma más simple que si es por ejemplo",
        "start": 4249.64,
        "end": 4258.64
    },
    {
        "text": " un local de ropa es que vayan a una persona a comprar una prenda a ver como es el",
        "start": 4258.64,
        "end": 4264.64
    },
    {
        "text": " servicio cuáles son la modalidad de pago como están dispuestos los productos",
        "start": 4264.64,
        "end": 4269.64
    },
    {
        "text": " hay que aprender de las mejores prácticas también de la competencia a la hora de",
        "start": 4269.64,
        "end": 4275.64
    },
    {
        "text": " de realizar la planeación",
        "start": 4275.64,
        "end": 4279.64
    },
    {
        "text": " alguna duda está acá con todo lo que es la planeación",
        "start": 4279.64,
        "end": 4286.64
    },
    {
        "text": " hay dudas con juntas cuando seguimos están muy callados en esta clase",
        "start": 4294.64,
        "end": 4306.64
    },
    {
        "text": " aquí les comparto matallan nuevamente administraciones estratégicas lo",
        "start": 4307.64,
        "end": 4328.64
    },
    {
        "text": " hacen los gerentes para desarrollar las estrategias de sus organizaciones",
        "start": 4328.64,
        "end": 4332.64
    },
    {
        "text": " las estrategias son los planes que determinan cómo lograr la organización su propósito",
        "start": 4332.64,
        "end": 4337.64
    },
    {
        "text": " comercial y el modelo de negocios es el conjunto acciones que pone en práctica",
        "start": 4337.64,
        "end": 4342.64
    },
    {
        "text": " una compañía para generar ingresos económicos y acá nos vamos a detenar",
        "start": 4342.64,
        "end": 4347.64
    },
    {
        "text": " porque es súper importante el día de mañana quizás ustedes y sobre todos los",
        "start": 4347.64,
        "end": 4353.64
    },
    {
        "text": " que están en la parte de informática a ver no sé si levantan la mano o algo",
        "start": 4353.64,
        "end": 4357.64
    },
    {
        "text": " lo que están en la parte de informática",
        "start": 4358.64,
        "end": 4362.64
    },
    {
        "text": " no pocos ni uno",
        "start": 4364.64,
        "end": 4369.64
    },
    {
        "text": " bueno lo que muchas veces cuesta es poder encontrar con uno tiene una idea",
        "start": 4371.64,
        "end": 4377.64
    },
    {
        "text": " en un negocio a decir lo que cuesta es cómo vamos a generar los ingresos",
        "start": 4377.64,
        "end": 4381.64
    },
    {
        "text": " económicos no que quizás algo muy muy discutido porque muchas veces uno",
        "start": 4381.64,
        "end": 4386.64
    },
    {
        "text": " puede generar algo que es muy útil que es práctico que sirve",
        "start": 4386.64,
        "end": 4391.64
    },
    {
        "text": " la gente lo va a utilizar pero después hicimos bueno pero como vamos a",
        "start": 4391.64,
        "end": 4396.64
    },
    {
        "text": " ganar con esto donde vamos a generar el ingreso y ahí se genera el famoso tema",
        "start": 4396.64,
        "end": 4403.64
    },
    {
        "text": " de un WhatsApp por ejemplo no puede pensar bueno pero WhatsApp es algo",
        "start": 4403.64,
        "end": 4408.64
    },
    {
        "text": " gratuito yo no pago pero el WhatsApp entonces pero yo tampoco tengo publicidad",
        "start": 4408.64,
        "end": 4413.64
    },
    {
        "text": " en el WhatsApp o al menos no a la vista no yo dentro de la mensaja",
        "start": 4413.64,
        "end": 4417.64
    },
    {
        "text": " a mí no me aparece una publicidad no tengo que ver vídeos no tengo pausas",
        "start": 4417.64,
        "end": 4422.64
    },
    {
        "text": " en mis conversaciones tampoco es que estoy hablando y separa para pasar",
        "start": 4422.64,
        "end": 4426.64
    },
    {
        "text": " una promoción sin embargo tiene ingresos porque tiene como tiene ingresos",
        "start": 4426.64,
        "end": 4431.64
    },
    {
        "text": " cuáles es el modelo de negocios",
        "start": 4434.64,
        "end": 4436.64
    },
    {
        "text": " que les parece",
        "start": 4443.64,
        "end": 4450.64
    },
    {
        "text": " bueno definitiva nuestros datos nuestra información",
        "start": 4450.64,
        "end": 4458.64
    },
    {
        "text": " de dónde estamos que lo que nos gusta que es lo que escribimos y todo eso",
        "start": 4458.64,
        "end": 4464.64
    },
    {
        "text": " es lo que genera ingresos para la organización",
        "start": 4464.64,
        "end": 4469.64
    },
    {
        "text": " nosotros terminamos siendo los que le damos verdad información y datos",
        "start": 4469.64,
        "end": 4478.64
    },
    {
        "text": " que luego puede comercializar y en base a esos que genera una fuente ingresos",
        "start": 4478.64,
        "end": 4483.64
    },
    {
        "text": " luego otro tema importante para ver es la estrategia",
        "start": 4483.64,
        "end": 4487.64
    },
    {
        "text": " vino a que dice que son los planes que terminan como se logrará la organización",
        "start": 4487.64,
        "end": 4490.64
    },
    {
        "text": " su propósito comercial y como convertirá",
        "start": 4490.64,
        "end": 4494.64
    },
    {
        "text": " hay un autor que se llama Michael Porter que hace muchos años",
        "start": 4494.64,
        "end": 4498.64
    },
    {
        "text": " y bueno Porter está vivo y sí hablando de temas de estrategia",
        "start": 4498.64,
        "end": 4504.64
    },
    {
        "text": " plantea el trata de buscar y dividir las organizaciones",
        "start": 4504.64,
        "end": 4508.64
    },
    {
        "text": " en base a las que buscan calidad de diferencia o sea que buscan algo innovador",
        "start": 4508.64,
        "end": 4515.64
    },
    {
        "text": " que que es el producto lo que lo que determina que las personas compren",
        "start": 4515.64,
        "end": 4521.64
    },
    {
        "text": " y luego dice que hay otra serie de empresas que no hay algo que buscan",
        "start": 4522.64,
        "end": 4526.64
    },
    {
        "text": " ese costo",
        "start": 4526.64,
        "end": 4528.64
    },
    {
        "text": " entonces ahí empieza a analizar que tipo de organización",
        "start": 4528.64,
        "end": 4532.64
    },
    {
        "text": " se necesita en un caso bien el otro entonces si la empresa lo que va a buscar es",
        "start": 4532.64,
        "end": 4536.64
    },
    {
        "text": " diferenciarse entonces va a tener que tener organizaciones que sean",
        "start": 4536.64,
        "end": 4540.64
    },
    {
        "text": " innovadoras con un buen grupo de creativos",
        "start": 4540.64,
        "end": 4544.64
    },
    {
        "text": " si por otro lado va a buscar a costos y bueno entonces va a tener que ser",
        "start": 4544.64,
        "end": 4548.64
    },
    {
        "text": " muy estructural en lo que es su organización tiene que analizar las mermas",
        "start": 4548.64,
        "end": 4554.64
    },
    {
        "text": " tiene que analizar como se continúan las horas",
        "start": 4554.64,
        "end": 4557.64
    },
    {
        "text": " y eso le va a llevar a otro tipo de personal donde lo que vamos a mirar",
        "start": 4557.64,
        "end": 4562.64
    },
    {
        "text": " por ejemplo en el caso de una organización más alta en costos es que el diseño sea",
        "start": 4562.64,
        "end": 4566.64
    },
    {
        "text": " económico y en el otro caso cuando vamos a la parte del diseño del producto",
        "start": 4566.64,
        "end": 4571.64
    },
    {
        "text": " pero yo quiero un perfume vamos a buscar de que sea innovador, que sea creativo",
        "start": 4571.64,
        "end": 4575.64
    },
    {
        "text": " que la persona les guste porque sea distinto a otro y seguramente un diseño",
        "start": 4575.64,
        "end": 4580.64
    },
    {
        "text": " un perfume me va a ser un costo para dar a pasar cuadradito y fácil de replicar",
        "start": 4580.64,
        "end": 4586.64
    },
    {
        "text": " y fácil de elaborar los moldes y con pocas mermas",
        "start": 4586.64,
        "end": 4590.64
    },
    {
        "text": " entonces son el autor plantea planteas de estrategias",
        "start": 4590.64,
        "end": 4594.64
    },
    {
        "text": " y después otra cosa que plantea el autor es que indica que la organización",
        "start": 4594.64,
        "end": 4601.64
    },
    {
        "text": " puede o bien seleccionar un grupo nicho del mercado o trabajar para todo el mercado",
        "start": 4601.64,
        "end": 4609.64
    },
    {
        "text": " y allí hay mucha literatura que dice que las pequeñas y las medianas empresas",
        "start": 4609.64,
        "end": 4614.64
    },
    {
        "text": " tienen que elegir un sector del mercado justamente porque bueno",
        "start": 4614.64,
        "end": 4620.64
    },
    {
        "text": " no puede convertir por economías de cala porque no tiene una gran inversión",
        "start": 4620.64,
        "end": 4626.64
    },
    {
        "text": " en lo que hace es se queda con un sector del mercado",
        "start": 4626.64,
        "end": 4630.64
    },
    {
        "text": " en definitiva el autor por tener entonces lo que hace es identificar",
        "start": 4630.64,
        "end": 4636.64
    },
    {
        "text": " dos grandes estrategias, una basada en diferenciación",
        "start": 4636.64,
        "end": 4641.64
    },
    {
        "text": " en empresas que buscan aspectos que sea que se sentí",
        "start": 4641.64,
        "end": 4647.64
    },
    {
        "text": " que sean diferentes y otra más basada en los costos",
        "start": 4647.64,
        "end": 4651.64
    },
    {
        "text": " si por ejemplo ya he dicho tranquila",
        "start": 4651.64,
        "end": 4654.64
    },
    {
        "text": " les parece que es una empresa basada en costos o basada en diferenciación",
        "start": 4654.64,
        "end": 4661.64
    },
    {
        "text": " que les parece",
        "start": 4664.64,
        "end": 4667.64
    },
    {
        "text": " para dar si se han denvieron el concept",
        "start": 4673.64,
        "end": 4678.64
    },
    {
        "text": " bueno silencio total",
        "start": 4682.64,
        "end": 4685.64
    },
    {
        "text": " bueno podemos decir que tranquila, magma, cruja o esto es de tipo locales",
        "start": 4685.64,
        "end": 4692.64
    },
    {
        "text": " quizás que van más hacia la diferenciación",
        "start": 4692.64,
        "end": 4695.64
    },
    {
        "text": " la gente está dispuesta a pagar un poco más por ese producto",
        "start": 4695.64,
        "end": 4698.64
    },
    {
        "text": " porque lo ven más innovador y que quizás que resalta con los otros productos",
        "start": 4698.64,
        "end": 4705.64
    },
    {
        "text": " también podemos ya de pensar que apunta un hecho de mercado",
        "start": 4706.64,
        "end": 4710.64
    },
    {
        "text": " personas con X nivel de ingresos",
        "start": 4710.64,
        "end": 4714.64
    },
    {
        "text": " y después hay otros comercios que en realidad venen a todo público",
        "start": 4714.64,
        "end": 4719.64
    },
    {
        "text": " porque en la línea náuber que está ubicado en diferentes zonas",
        "start": 4719.64,
        "end": 4723.64
    },
    {
        "text": " y que incluso tienen gran variedad de productos pero",
        "start": 4723.64,
        "end": 4729.64
    },
    {
        "text": " aún costo más bajo",
        "start": 4730.64,
        "end": 4733.64
    },
    {
        "text": " así que bueno son diferentes",
        "start": 4733.64,
        "end": 4736.64
    },
    {
        "text": " por ejemplo podemos pensar que la iPhone quizás que busca más",
        "start": 4736.64,
        "end": 4740.64
    },
    {
        "text": " y la diferenciación también y que sin embargo hay otros celulares",
        "start": 4740.64,
        "end": 4745.64
    },
    {
        "text": " que está más enfocada de costos",
        "start": 4745.64,
        "end": 4748.64
    },
    {
        "text": " a que se humble todas sus funcionalidades",
        "start": 4748.64,
        "end": 4752.64
    },
    {
        "text": " pero están elaborados con un costo menor",
        "start": 4752.64,
        "end": 4757.64
    },
    {
        "text": " y la gente compra esos productos justamente por su costo",
        "start": 4757.64,
        "end": 4762.64
    },
    {
        "text": " pero la certeza pueden dar éxito con cualquiera de las estrategias",
        "start": 4762.64,
        "end": 4769.64
    },
    {
        "text": " no significa que una estrategia es buena y la otra no lo es",
        "start": 4769.64,
        "end": 4773.64
    },
    {
        "text": " eso es simplemente elegir la estrategia correcta para nuestro producto",
        "start": 4773.64,
        "end": 4778.64
    },
    {
        "text": " y que la organización se adapte como decíamos a esa estrategia",
        "start": 4778.64,
        "end": 4784.64
    },
    {
        "text": " que nosotros definimos sin nosotros por ejemplo tenemos una estrategia",
        "start": 4784.64,
        "end": 4788.64
    },
    {
        "text": " que va a estar basada en diferenciación",
        "start": 4788.64,
        "end": 4791.64
    },
    {
        "text": " entonces la gente para que esté dispuesta a pagar más",
        "start": 4791.64,
        "end": 4795.64
    },
    {
        "text": " ese producto tiene que ser muy distinto, muy novidos o muy innovador",
        "start": 4795.64,
        "end": 4798.64
    },
    {
        "text": " entonces yo tengo que tener un grupo de creativos, un grupo de personal",
        "start": 4798.64,
        "end": 4803.64
    },
    {
        "text": " que justamente cumpla con esas características que la gente",
        "start": 4803.64,
        "end": 4808.64
    },
    {
        "text": " es lo que en el definitivo va a pagar",
        "start": 4808.64,
        "end": 4810.64
    },
    {
        "text": " y si yo por el otro lado voy a ir por el lado de costos",
        "start": 4810.64,
        "end": 4814.64
    },
    {
        "text": " y voy a ganar quizás que en las grandes cantidades de venta",
        "start": 4814.64,
        "end": 4819.64
    },
    {
        "text": " como sucede en unos conversos que uno ve que hay muchas personas",
        "start": 4819.64,
        "end": 4822.64
    },
    {
        "text": " haciendo cola y comprando, entonces allí se ganan la cantidad",
        "start": 4822.64,
        "end": 4827.64
    },
    {
        "text": " entonces son muchas personas que están comprando productos",
        "start": 4827.64,
        "end": 4831.64
    },
    {
        "text": " que hay mucha variedad de esos productos se compran las grandes cantidades",
        "start": 4831.64,
        "end": 4835.64
    },
    {
        "text": " y bueno ahí tengo que mirar otro tipo de cosas",
        "start": 4835.64,
        "end": 4838.64
    },
    {
        "text": " bueno mis costos de compra, que progresores selecciono",
        "start": 4838.64,
        "end": 4843.64
    },
    {
        "text": " ser muy analizar mucho lo que es el consumo de mis recursos",
        "start": 4843.64,
        "end": 4849.64
    },
    {
        "text": " seréficiente, antes de un poquito viene por ahí",
        "start": 4849.64,
        "end": 4855.64
    },
    {
        "text": " y la administración estratégica es fundamental en todas las empresas",
        "start": 4855.64,
        "end": 4862.64
    },
    {
        "text": " en la clase hoy vimos, bueno terminamos de ver toma de decisiones",
        "start": 4863.64,
        "end": 4869.64
    },
    {
        "text": " vimos un pantallazo, en el que vamos a ver la clase que viene",
        "start": 4869.64,
        "end": 4874.64
    },
    {
        "text": " que esto va a la parte de planificación y bueno si no queda dudas y consultas",
        "start": 4874.64,
        "end": 4880.64
    },
    {
        "text": " vamos a ir dejando para aquí los que es la clase",
        "start": 4880.64,
        "end": 4883.64
    },
    {
        "text": " bueno cortamos la grabación y dejamos para dudas consultas",
        "start": 4883.64,
        "end": 4887.64
    },
    {
        "text": " para el parcial es necesario tener cámaras en caso de que algunos no tengan cámara",
        "start": 4888.64,
        "end": 4896.64
    },
    {
        "text": " no sabisan y pueden asistir a las facultades, eso no hay ningún inconveniente",
        "start": 4896.64,
        "end": 4901.64
    },
    {
        "text": " vamos a tener un control lo que le decimos control y identificación",
        "start": 4904.64,
        "end": 4908.64
    },
    {
        "text": " que es que media hora pedia se conectan, prenden la cámara, nos muestran las células",
        "start": 4908.64,
        "end": 4914.64
    },
    {
        "text": " y luego se quedan con la cámara prendida durante toda la prueba",
        "start": 4915.64,
        "end": 4919.64
    },
    {
        "text": " y recuerden que tu nanda la prueba no pueden mirar el celular, no pueden",
        "start": 4920.64,
        "end": 4926.64
    },
    {
        "text": " obviamente levantar el teléfono, no no no pueden buscar papeles, es sin",
        "start": 4926.64,
        "end": 4931.64
    },
    {
        "text": " materiales y sin consulta a otros",
        "start": 4931.64,
        "end": 4934.64
    },
    {
        "text": " alguna otra consulta",
        "start": 4936.64,
        "end": 4938.64
    }
]