[
    {
        "text": " En el cláceo hoy entonces vamos a ir redondiendo la parte del Teóneo Espectral",
        "start": 0.0,
        "end": 24.32
    },
    {
        "text": " para operadores unitarios que ya empezamos a ver la clase pasada hoy vamos a anunciar",
        "start": 24.32,
        "end": 30.28
    },
    {
        "text": " el final de la clase del Teóneo Espectral para los operadores unitarios que es exactamente",
        "start": 30.28,
        "end": 33.92
    },
    {
        "text": " el mismo para autoajuntos, es decir que es un espacio de mansión finita si uno tiene",
        "start": 33.92,
        "end": 41.56
    },
    {
        "text": " un operador unitario entonces existe una base ortonormal formada por vectores propios.",
        "start": 41.56,
        "end": 46.64
    },
    {
        "text": " De hecho la demostración es exactamente la misma palabra por palabra, uno realmente tiene",
        "start": 46.64,
        "end": 50.88
    },
    {
        "text": " que cambiar unitario autoajunto por unitario, es la misma demostración que ya vivimos.",
        "start": 50.88,
        "end": 57.18
    },
    {
        "text": " Sí pero entonces vamos a retomar con un resumen de lo que vimos la clase pasada, tengo",
        "start": 57.18,
        "end": 65.58
    },
    {
        "text": " un espacio vectorial B, con producto interno y tengo una transformación, un operador,",
        "start": 65.58,
        "end": 72.64
    },
    {
        "text": " B, en B. Entonces lo que hicimos es considerar operadores que son invertibles y cuya inversa",
        "start": 72.64,
        "end": 81.86
    },
    {
        "text": " coincide con el operador adjunto, esos son justamente los que cumple a esta condición,",
        "start": 81.86,
        "end": 87.96000000000001
    },
    {
        "text": " son las isometrías, esto es las transformaciones que preservan el producto interno o la norma,",
        "start": 87.96000000000001,
        "end": 97.02
    },
    {
        "text": " lo mismo. Acá separamos en dos casos, en el cual el cuerpo real, ahí los operadores",
        "start": 97.02,
        "end": 105.3
    },
    {
        "text": " de si cumple a condición le decíamos que terortonal y el otro caso, el caso en el cual el cuerpo",
        "start": 105.3,
        "end": 119.82
    },
    {
        "text": " es el cuerpo de los complejos, en cuyo caso a teles llamamos unitario, esta cuestión",
        "start": 119.82,
        "end": 126.25999999999999
    },
    {
        "text": " de nombres puede mariar un poco, eso es solamente autojuno es el cuerpo real, unitario",
        "start": 126.25999999999999,
        "end": 132.57999999999998
    },
    {
        "text": " en el cuerpo complejo con esta misma propiedad. Comínense para el cuerpo real del complejo",
        "start": 132.57999999999998,
        "end": 138.29999999999998
    },
    {
        "text": " porque vamos a ver que el teorno espectral vale en este contexto, en general no en este",
        "start": 138.29999999999998,
        "end": 145.6
    },
    {
        "text": " contexto porque hemos visto que un esometr nr no necesariamente tiene valores propios",
        "start": 145.6,
        "end": 150.35999999999999
    },
    {
        "text": " o no tiene el número suficiente valores propios porque las raíces pueden estar en el",
        "start": 150.35999999999999,
        "end": 153.95999999999998
    },
    {
        "text": " cuerpo complejo. Entonces el teorema que vamos a anunciar vale en ese contexto y lo vamos",
        "start": 153.95999999999998,
        "end": 162.28
    },
    {
        "text": " a ver en un ratito. Entonces vamos a repasando un resultado, el resultado final que vimos",
        "start": 162.28,
        "end": 171.76
    },
    {
        "text": " en el clase pasada lo que vimos era que si ves un espacio vectorial, esto lo vimos,",
        "start": 171.76,
        "end": 181.04
    },
    {
        "text": " ¿no? Espacio vectorial con producto interno. Sobre el cuerpo complejo y si te es un operador",
        "start": 181.04,
        "end": 199.12
    },
    {
        "text": " unitario si te debe es un operador unitario, es decir por el serba de norma que lo mismo",
        "start": 199.12,
        "end": 208.52
    },
    {
        "text": " que decir que te da la menos uno de esta estrella. Entonces vimos lo siguiente, primero,",
        "start": 208.52,
        "end": 215.32
    },
    {
        "text": " todos los valores propios tienen el módulo 1, eso lo vimos en la clase pasada. Si landes",
        "start": 215.32,
        "end": 220.72
    },
    {
        "text": " el módulo de ese valor propio. Entonces el módulo de ese valor propio es 1, y el",
        "start": 220.72,
        "end": 245.07999999999998
    },
    {
        "text": " segundo resultado es que esto va en general dimensión finito o infinita, si algo es un",
        "start": 245.07999999999998,
        "end": 249.16
    },
    {
        "text": " valor propio tiene módulo 1. Y el segundo resultado es que si yo trabajo en dimensión finita",
        "start": 249.16,
        "end": 256.04
    },
    {
        "text": " por lo pronto, por lo tanto tiene sentido hablar del polinismo característico, entonces toda",
        "start": 256.04,
        "end": 260.48
    },
    {
        "text": " la raíz del polinismo característico cumple de esta condición. Todas las raíces, si",
        "start": 260.48,
        "end": 271.24
    },
    {
        "text": " dimensión debe de finita.",
        "start": 271.24,
        "end": 272.24
    },
    {
        "text": " Vamos a escribirlo así, del polinismo característico tiene módulo 1.",
        "start": 272.24,
        "end": 301.84000000000003
    },
    {
        "text": " Esto lo vimos en la clase pasada, es absolutamente trivial de probar. Si no tiene entonces un espacio",
        "start": 301.84,
        "end": 311.76
    },
    {
        "text": " de historia que un producto interno sobre los complejos y te es un operador unitario,",
        "start": 311.76,
        "end": 316.56
    },
    {
        "text": " si landes el valor propio entonces su módulo es 1, y la segunda resultado es que si la dimensión",
        "start": 316.56,
        "end": 322.67999999999995
    },
    {
        "text": " es finita y tienes sentido hablar del polinismo característico, entonces todas las raíces",
        "start": 322.67999999999995,
        "end": 325.79999999999995
    },
    {
        "text": " tienen módulo 1. Esto en el caso complejo me dice justamente todas las raíces son valores",
        "start": 325.8,
        "end": 336.6
    },
    {
        "text": " propios y todas tienen módulo. Es decir que en el plano complejo todas las raíces de",
        "start": 336.6,
        "end": 349.24
    },
    {
        "text": " uno operador unitario están en el círculo unitario, es decir en el círculo radio 1,",
        "start": 349.24,
        "end": 354.8
    },
    {
        "text": " de ahí el nombre de operador unitario. Bien, pueden ser complejas, pueden estar por acá",
        "start": 354.8,
        "end": 361.28000000000003
    },
    {
        "text": " o pueden conseguir con un el 1 y el menos 1, pero en cualquier caso todas las raíces",
        "start": 361.28000000000003,
        "end": 367.64
    },
    {
        "text": " siempre están ahí adentro. ¿Se entendió? Entonces vamos a empezar con una adaptación",
        "start": 367.64,
        "end": 374.48
    },
    {
        "text": " sencilla de este resultado para el caso real. Fíjense ahí que en el caso real es casi",
        "start": 374.48,
        "end": 385.36
    },
    {
        "text": " que vale exactamente lo mismo, uno dice si no tiene espacio tutorial sobre el cuerpo real",
        "start": 385.36,
        "end": 389.40000000000003
    },
    {
        "text": " y es un operador ortobona a la hora porque así le llamamos a los a estas operadores",
        "start": 389.40000000000003,
        "end": 395.68
    },
    {
        "text": " en el caso real, si landes el valor propio entonces esto sigue valiendo, solo que ahora",
        "start": 395.68,
        "end": 400.40000000000003
    },
    {
        "text": " tiene que estar esto puede valer un más 1 o menos 1, porque para que ser un valor propio",
        "start": 400.4,
        "end": 405.03999999999996
    },
    {
        "text": " tiene que estar en el cuerpo entonces en un unitario es esto o es esto, hay son esas dos",
        "start": 405.03999999999996,
        "end": 410.52
    },
    {
        "text": " posibilidades y el otro resultado van a algo, las raíces del polimium caractristo tienen",
        "start": 410.52,
        "end": 416.59999999999997
    },
    {
        "text": " todo módulo 1 están en el círculo pero bueno evidentemente si caen por acá, por acá",
        "start": 416.59999999999997,
        "end": 422.08
    },
    {
        "text": " o por acá el operador no va a ser diagonalizado, le puede tener valores propios complejos,",
        "start": 422.08,
        "end": 427.88
    },
    {
        "text": " pero no, raíces caractrarias complejas que no son entonces valores propios. Bien, bueno",
        "start": 427.88,
        "end": 433.04
    },
    {
        "text": " entonces vamos a ver este resultado para el caso real, es un detalle técnico que",
        "start": 433.04,
        "end": 442.04
    },
    {
        "text": " es que ver con un poquito cuidado, es llevar el caso real, el caso complejo y usaré",
        "start": 442.04,
        "end": 446.58
    },
    {
        "text": " ese argumento, pedantería técnica, a ver vamos a empezar por acá, despacio vectorial",
        "start": 446.58,
        "end": 469.62
    },
    {
        "text": " con producto interno sobre R, sobre el cuerpo real entonces, T de Benveo, operador",
        "start": 469.62,
        "end": 493.22
    },
    {
        "text": " y otro, bueno, entonces en este caso es el equivalente resultado uno, me dice que",
        "start": 493.22,
        "end": 508.46000000000004
    },
    {
        "text": " si landes al olor propio T, entonces landa eso bien más 1 o bien menos 1 y el segundo",
        "start": 508.46,
        "end": 526.14
    },
    {
        "text": " caso el segundo resultado es que si la dimensión de B es finita,",
        "start": 526.14,
        "end": 532.02
    },
    {
        "text": " el segundo caso es el equivalente, si la dimensión es finita entonces todas las raíces",
        "start": 556.14,
        "end": 567.1
    },
    {
        "text": " el poniomo caractrístico tienen el modo de logro y hay que tener un poquito de cuidado",
        "start": 567.1,
        "end": 573.74
    },
    {
        "text": " con el con la argumentación, por lo siguiente, acá la argumentación era bien sencilla,",
        "start": 573.74,
        "end": 579.26
    },
    {
        "text": " si yo estoy en el cuerpo complejo todas las raíces el poniomo caractrístico son valores",
        "start": 579.26,
        "end": 583.5
    },
    {
        "text": " propios, entonces si antes ya probé que los valores propios tienen un módulo 1, todas las",
        "start": 583.5,
        "end": 587.78
    },
    {
        "text": " raíces caracteriticas tienen un módulo 1, acá es el mismo argumento literalmente no vale,",
        "start": 587.78,
        "end": 592.42
    },
    {
        "text": " yo no puedo decir, todas las raíces, porque todas las raíces aquí, no son necesariamente",
        "start": 592.42,
        "end": 598.34
    },
    {
        "text": " valores propios, entonces ese argumento se me cae, tengo que usar el argumento un poquito",
        "start": 598.34,
        "end": 604.1
    },
    {
        "text": " más elaborado, pero es muy sencillo es llevar esto al caso complejo y usar el resultado que",
        "start": 604.1,
        "end": 609.38
    },
    {
        "text": " vimos antes, estamos, entonces con un operador retogonal puede también pasar que el poniomo",
        "start": 609.38,
        "end": 617.14
    },
    {
        "text": " caractrístico tenga raíces por acá, pero esos no van a ser valores propios, los únicos",
        "start": 617.14,
        "end": 621.98
    },
    {
        "text": " van a ser valores propios, si es que aparecen es el 1 y el menos 1, después vamos a ver",
        "start": 621.98,
        "end": 627.9399999999999
    },
    {
        "text": " en un ratito que eso vale tanto en aquel caso como en este, si yo tengo valores propios",
        "start": 627.9399999999999,
        "end": 633.38
    },
    {
        "text": " distintos entonces los subespacios propios son retogonales, lo mismo que pasaba con los",
        "start": 633.38,
        "end": 638.8
    },
    {
        "text": " autodajuntos y después vamos a ver el teorema espectral en este contexto que es lo mismo",
        "start": 638.8,
        "end": 644.92
    },
    {
        "text": " que pasaba la misma demostración que el caso autodajundo, se entiende, me estoy decidiratando",
        "start": 644.92,
        "end": 650.4
    },
    {
        "text": " acá, si alguien se duerme no me voy a offender y es probable que me duerme a yo incluso, bueno,",
        "start": 650.4,
        "end": 660.8
    },
    {
        "text": " entonces vamos a empezar probando esto, es bien, bien sencillo, a ver la demostración",
        "start": 660.8,
        "end": 668.7199999999999
    },
    {
        "text": " de la parte 1 es medio renglo y es la misma que habíamos visto antes, vamos a repetir",
        "start": 668.7199999999999,
        "end": 676.8
    },
    {
        "text": " el argumento, la demostración de la parte 1, si lambda es valor propio de t, esto puede",
        "start": 676.8,
        "end": 691.3599999999999
    },
    {
        "text": " ir en un examen, no en los parciales porque no va a haber desarrollo, pero puede haber",
        "start": 691.3599999999999,
        "end": 695.4799999999999
    },
    {
        "text": " cosas como estas, si lambda es valor propio de t entonces, ¿qué quiere decir esto? ¿Qué",
        "start": 695.4799999999999,
        "end": 700.56
    },
    {
        "text": " existe un vector propio? Es decir, existe un b de distinto de 0, tal que tembés es lambda",
        "start": 700.56,
        "end": 710.2399999999999
    },
    {
        "text": " por b, bien eso vale siempre, ahora si te es ortobonal, eso implica que es",
        "start": 710.2399999999999,
        "end": 730.52
    },
    {
        "text": " que se acuerda si te es ortobonal, quiere decir que te haga menos 1 es igual a t de estrella",
        "start": 730.52,
        "end": 736.68
    },
    {
        "text": " y también es lo mismo que decir que es un insometría, entonces si te es ortobonal entonces",
        "start": 736.68,
        "end": 742.0
    },
    {
        "text": " este es una insometría, por lo tanto se preserva el valor esperado que es lo mismo que así que",
        "start": 742.0,
        "end": 753.1999999999999
    },
    {
        "text": " se preserva la norma, es decir que si yo le aplico la norma a td, eso es lo mismo que la norma",
        "start": 753.1999999999999,
        "end": 759.64
    },
    {
        "text": " b, es la misma demostración que habíamos visto en la clase pasada, ahora como ve es un vector",
        "start": 759.64,
        "end": 768.84
    },
    {
        "text": " propio, esto es lo mismo que lambda por b, que es lo mismo que el módulo de lambda por b,",
        "start": 768.84,
        "end": 786.04
    },
    {
        "text": " el lambda lo soco para afuera con el módulo y entonces como ve distinto de 0 puedo simplificar",
        "start": 786.04,
        "end": 793.56
    },
    {
        "text": " esta norma con esta, que es distinto de 0 y me queda que la norma de l tiene que ser el",
        "start": 793.56,
        "end": 802.8
    },
    {
        "text": " perón el módulo de n tiene que ser 1, pero además como estamos en el caso real y lambda",
        "start": 802.8,
        "end": 808.36
    },
    {
        "text": " es un valor propio, entonces lambda b es real y cumplir esta condición, o sea la única",
        "start": 808.36,
        "end": 817.4
    },
    {
        "text": " posibilidad que me queda es que vaya a 1 o menos 2, no hay otra posibilidad, estamos en algún",
        "start": 817.4,
        "end": 825.32
    },
    {
        "text": " momento vamos a ver ejemplos de ortobonales en r2 y r3, típicamente son rotaciones o",
        "start": 825.32,
        "end": 832.94
    },
    {
        "text": " reflexiones en algún es que con algún plano o combinación de ambas cosas, pero siempre los",
        "start": 832.94,
        "end": 839.1400000000001
    },
    {
        "text": " valores propios y hay son 1 y menos 1, bien y ahora veamos esto, veamos esto que es adaptar el",
        "start": 839.1400000000001,
        "end": 849.98
    },
    {
        "text": " problema el caso complejo, repito no podemos ir acá todas las raíces tienen el módulo 1 lo cual",
        "start": 849.98,
        "end": 857.4200000000001
    },
    {
        "text": " es cierto se concluyen tomances, pero no podemos decir no podemos usar el resultado anterior",
        "start": 857.42,
        "end": 863.5799999999999
    },
    {
        "text": " como les dije recién, no puedo decir todas las raíces son valores propios, por lo tanto",
        "start": 863.5799999999999,
        "end": 870.66
    },
    {
        "text": " tienen el módulo 1, porque acá puede haber raíces complejas que no son valores propios,",
        "start": 870.66,
        "end": 876.5799999999999
    },
    {
        "text": " entonces vamos a trabajar un poquito se resultado, es una cuestión técnica como es, el comentario",
        "start": 876.5799999999999,
        "end": 881.9
    },
    {
        "text": " recién que consisten llevar el caso real al caso complejo, es el único resultado más técnico",
        "start": 881.9,
        "end": 888.4599999999999
    },
    {
        "text": " lo que vamos a ver es los dos son bueno son técnicos pero son más lindos y más sencillos",
        "start": 888.4599999999999,
        "end": 894.02
    },
    {
        "text": " entonces la idea acá es llevar el problema al cuerpo complejo y trabajarlo ahí, yo tengo un",
        "start": 897.54,
        "end": 909.54
    },
    {
        "text": " espacio vectorial con dimensión, estoy diciendo, estoy considerando dimensión finita, entonces",
        "start": 909.54,
        "end": 920.02
    },
    {
        "text": " si yo considero una base ortomal de ese espacio vectorial",
        "start": 922.74,
        "end": 926.0999999999999
    },
    {
        "text": " y yo estoy diciendo que el operador teo ortomonal,",
        "start": 940.54,
        "end": 944.62
    },
    {
        "text": " ortomonal, eso es lo que estoy suponiendo, un teo ortomonal, entonces yo garro una base",
        "start": 949.18,
        "end": 954.14
    },
    {
        "text": " ortomal y tengo un operador ortomonal que pasa con una representación matricial de T en esa base",
        "start": 954.14,
        "end": 959.9399999999999
    },
    {
        "text": " ¿qué pasa si yo considero esta matriz?, ¿qué es la matriz asociate en una base ortomal?",
        "start": 959.94,
        "end": 970.34
    },
    {
        "text": " ¿qué pasa con esa base ortomonal? es una matriz ortomonal porque justamente",
        "start": 970.34,
        "end": 977.7
    },
    {
        "text": " yo garro una para ortomonal, lo represento una base ortomonal me queda una matriz ortomonal,",
        "start": 977.7,
        "end": 983.0600000000001
    },
    {
        "text": " de la misma manera que yo garro una operador unitario, lo represento una base ortomal,",
        "start": 983.0600000000001,
        "end": 987.4200000000001
    },
    {
        "text": " me queda una matriz unitaria, las ortomonales se acuerdan que son las que cumplen",
        "start": 987.42,
        "end": 991.3399999999999
    },
    {
        "text": " que son invertibles, el inverse igual a la respuesta, esas son las ortomonales y las unitarias",
        "start": 991.3399999999999,
        "end": 997.86
    },
    {
        "text": " son aquellas que son invertibles, el inverse es la respuesta conjugada, pero hay un equivalente",
        "start": 997.86,
        "end": 1004.8199999999999
    },
    {
        "text": " en cientrones entre matricias ortomonales y operador ortomonales, matricias unitarias o operadores",
        "start": 1004.8199999999999,
        "end": 1009.18
    },
    {
        "text": " entonces esta matriz ortomonal que significa que es invertible y que además a la menús",
        "start": 1009.9,
        "end": 1019.54
    },
    {
        "text": " nos atraspone esta y ahora lo que voy a hacer es algo que ya hicimos anteriormente,",
        "start": 1019.54,
        "end": 1033.06
    },
    {
        "text": " voy a considerar el espacio de un espacio de autónale complejo de la misma dimensión",
        "start": 1033.06,
        "end": 1039.34
    },
    {
        "text": " que aquel, por ejemplo sea la N y voy a trabajar ahí con una base ortomonal, entonces",
        "start": 1039.34,
        "end": 1045.5
    },
    {
        "text": " vamos a considerar sea la N, sea N, espacio vectorial sobre el cuerpo complejo, las N",
        "start": 1045.5,
        "end": 1060.02
    },
    {
        "text": " y las N, con el producto interno usual en los complejos, aunque esto no es poner un",
        "start": 1060.02,
        "end": 1078.58
    },
    {
        "text": " producto interno, pero nada más con el producto interno, no lo vamos a usar esplicitamente.",
        "start": 1078.58,
        "end": 1084.1399999999999
    },
    {
        "text": " Consideramos, entonces consideramos el espacio vectorial de este, sea la N,",
        "start": 1097.78,
        "end": 1102.6599999999999
    },
    {
        "text": " espacio de teraz sobre el cuerpo complejo, con el producto interno usual en los complejos,",
        "start": 1102.6599999999999,
        "end": 1107.58
    },
    {
        "text": " tanto de eso, agarramos acá una base ortomonal en sea la N, por ejemplo la base canónica,",
        "start": 1107.58,
        "end": 1112.82
    },
    {
        "text": " que es ese ortomonal con este producto interno usual, entonces le llamamos sea a la base canónica,",
        "start": 1112.82,
        "end": 1120.02
    },
    {
        "text": " hay muchas sea dando vueltas, esta, se sin la rayita, esta es, le vamos a poner la",
        "start": 1124.02,
        "end": 1132.06
    },
    {
        "text": " seca ligrafica para que no serme lío, sea así, sea es una base canónica, la base canónica de ser a",
        "start": 1132.06,
        "end": 1138.78
    },
    {
        "text": " N, sí, y vamos a considerar una transformación,",
        "start": 1138.78,
        "end": 1144.06
    },
    {
        "text": " vamos a considerar una transformación de este espacio vectorial en sí mismo,",
        "start": 1144.06,
        "end": 1168.62
    },
    {
        "text": " de este espacio vectorial en sí mismo, definir así en de manera, me dan la base canónica o una",
        "start": 1168.62,
        "end": 1178.06
    },
    {
        "text": " base cualquiera, se la en, es tan importante que sea una base ortomonal y definimos la transformación,",
        "start": 1178.06,
        "end": 1183.1
    },
    {
        "text": " tenio aquí o tesombrero, tal qué, la tenio aquí esta, si yo la reemplazo en la base,",
        "start": 1183.1,
        "end": 1198.8999999999999
    },
    {
        "text": " en la que estoy trabajando la canónica en este caso, esa matriz N por N sea la matriz",
        "start": 1200.1,
        "end": 1208.82
    },
    {
        "text": " sea que tengo acá, esto es una matriz real, no me importa, estoy diciendo que la matriz sociedad a",
        "start": 1208.82,
        "end": 1216.6599999999999
    },
    {
        "text": " ese operador que están los complejos, bueno da la casualidad que es una matriz cuadrada, cuyas",
        "start": 1216.6599999999999,
        "end": 1221.02
    },
    {
        "text": " entras son todas reales, tienen todas partes imaginarias nubles, no hay ningún problema en hacer esto,",
        "start": 1221.02,
        "end": 1228.22
    },
    {
        "text": " estamos, esto me define un único operador de CNN, justamente estoy diciendo cómo se representa",
        "start": 1229.22,
        "end": 1242.74
    },
    {
        "text": " una base y en particular cómo se representa una base ortomonal y ahora vamos a trabajar con",
        "start": 1242.74,
        "end": 1251.82
    },
    {
        "text": " ese operador, que ya sabemos, vamos a ver qué ese operador es un operador unitario y vamos a",
        "start": 1251.82,
        "end": 1257.46
    },
    {
        "text": " usar el resultado que hay más el ratito para que les escribes un ratito para operadores",
        "start": 1257.46,
        "end": 1261.54
    },
    {
        "text": " unitarios, se entiende, entonces retomor, consideramos este espacio electoral, CNN con la misma",
        "start": 1261.54,
        "end": 1270.82
    },
    {
        "text": " dimensión que el espacio original, considera una base canónica, una base ortomonal, que es una",
        "start": 1270.82,
        "end": 1276.3
    },
    {
        "text": " base ortomonal con el producto intonusual de este espacio y considera la transformación tetilde",
        "start": 1276.3,
        "end": 1281.26
    },
    {
        "text": " que la batería de la sociedad atertil en la base canónica me da esta matriz de por N, ahora fíjense,",
        "start": 1281.26,
        "end": 1287.5
    },
    {
        "text": " fíjense, fíjense que se cumple lo siguiente, esta matriz tenio aquí,",
        "start": 1287.5,
        "end": 1302.42
    },
    {
        "text": " lo que yo digo que esa matriz es una matriz trabajando en el contexto de los complejos,",
        "start": 1311.98,
        "end": 1316.3
    },
    {
        "text": " es una matriz unitaria, sí, porque sí porque yo la defino a través, yo te doy una matriz",
        "start": 1316.3,
        "end": 1326.94
    },
    {
        "text": " cualquiera en el por N y tengo un operador del espacio imensión N en sí mismo, el operador",
        "start": 1326.94,
        "end": 1333.5
    },
    {
        "text": " que es un íbocamente terminado por la matriz, entonces yo tengo un operador y tengo una",
        "start": 1333.5,
        "end": 1337.7
    },
    {
        "text": " matriz y vos me da una matriz yo te construyo un único operador, simplemente lo que tengo que hacer",
        "start": 1337.7,
        "end": 1341.94
    },
    {
        "text": " es aplicar el este nio que cada elemento la base canónica y justamente la primera columna van",
        "start": 1341.94,
        "end": 1348.98
    },
    {
        "text": " a hacer pasar la descomposición en términos la base canónica, se entiende? o sea, con cada operador",
        "start": 1348.98,
        "end": 1356.14
    },
    {
        "text": " yo siempre construyo una matriz, dado una base, dado una base en la que trabajo y dado una",
        "start": 1356.14,
        "end": 1361.82
    },
    {
        "text": " matriz yo siempre puedo construir un único operador, dado una matriz y la base, ¿no?",
        "start": 1361.82,
        "end": 1367.9399999999998
    },
    {
        "text": " entonces esa es una matriz unitaria en el contexto de los complejos, porque esa matriz cumple",
        "start": 1367.9399999999998,
        "end": 1375.6599999999999
    },
    {
        "text": " esta condición que le fina a las unitarias, esa matriz cumple a transporta conjugada, esta es",
        "start": 1375.6599999999999,
        "end": 1385.3
    },
    {
        "text": " una matriz con entrasto reales, entonces transporte la de la misma que a, esto a transporta",
        "start": 1385.3,
        "end": 1390.62
    },
    {
        "text": " conjugada esa, te voy a tomar la atraspuesta, esto es por ser arreal y atraspuesta esa la",
        "start": 1390.62,
        "end": 1404.54
    },
    {
        "text": " menos 1 justamente porque la A es ortogonal en el contexto de los reales, esto es A la",
        "start": 1404.54,
        "end": 1410.8999999999999
    },
    {
        "text": " menos 1, porque a, si yo la veo en el contexto de los reales, esto es ortogonal, entonces",
        "start": 1410.9,
        "end": 1422.46
    },
    {
        "text": " viste en este contexto, esta es una matriz unitaria y además, es una base ortogonal de",
        "start": 1422.46,
        "end": 1437.58
    },
    {
        "text": " la espacio en el que estamos trabajando, tiene una matriz unitaria en una base ortogonal,",
        "start": 1437.58,
        "end": 1450.18
    },
    {
        "text": " entonces lo que pasa es que este tilde, si la matriz es ortogonal de la base ortogonal",
        "start": 1450.18,
        "end": 1454.5800000000002
    },
    {
        "text": " de la base unitaria, este tilde es un operador unitario, entonces esto me implica que este",
        "start": 1454.5800000000002,
        "end": 1459.46
    },
    {
        "text": " tilde o tenía aquí, es un operador unitario y por lo que vimos hace un ratito, que lo vimos",
        "start": 1459.46,
        "end": 1472.5
    },
    {
        "text": " acá se pasaba, pero la repasamos, como esto es un operador unitario, todas las raíces",
        "start": 1472.5,
        "end": 1477.22
    },
    {
        "text": " de este operador unitario tienen el módulo 1, es esta partecita técnica, es un detalle",
        "start": 1477.22,
        "end": 1492.6200000000001
    },
    {
        "text": " técnico, la idea es entonces es construir un operador tilde emparentado a este vía la",
        "start": 1492.6200000000001,
        "end": 1505.98
    },
    {
        "text": " matriz, el tilde está de fina sobre una espacio editorial complejo y es unitario,",
        "start": 1505.98,
        "end": 1511.66
    },
    {
        "text": " por lo tanto toda la raíces del polinismo característico, asociado a tilde, tienen el módulo",
        "start": 1511.66,
        "end": 1517.5
    },
    {
        "text": " 1 por lo que vimos para los unitarios, entonces finalmente, finalmente, entonces",
        "start": 1517.5,
        "end": 1534.98
    },
    {
        "text": " tenemos el problema en contexto en el cual ya sabíamos cómo trabajarlo, entonces tenemos",
        "start": 1534.98,
        "end": 1546.26
    },
    {
        "text": " finalmente el polinismo característico de este tilde, este tilde es un operador pero coincide",
        "start": 1546.26,
        "end": 1551.5
    },
    {
        "text": " con el polinismo característico de la matriz A, por esa correspondencia que hay troperadores",
        "start": 1551.5,
        "end": 1559.38
    },
    {
        "text": " y matrices asociadas y el polinismo característico de A si lo ve acá coincide con el operador",
        "start": 1559.38,
        "end": 1566.38
    },
    {
        "text": " con el polinismo característico de lo operador t, el operador original, entonces si toda",
        "start": 1566.38,
        "end": 1576.38
    },
    {
        "text": " la raí, este polinismo igual a este, si veo que todas las raíces de este tilden el módulo",
        "start": 1576.38,
        "end": 1580.22
    },
    {
        "text": " 1, entonces todas las raíces de este tilden el módulo 1. Pedanteria matemática hay que",
        "start": 1580.22,
        "end": 1604.02
    },
    {
        "text": " llevar el problema real al caso complejo que ya lo podemos trabajar sin problema porque",
        "start": 1604.02,
        "end": 1610.1399999999999
    },
    {
        "text": " todas las raíces el polinismo característico son valores propios y usa la resultado que",
        "start": 1610.1399999999999,
        "end": 1614.94
    },
    {
        "text": " vimos antes para concluir que las raíces de este operador, todas las raíces de este operador",
        "start": 1614.94,
        "end": 1618.58
    },
    {
        "text": " tienen un módulo 1.",
        "start": 1618.58,
        "end": 1621.58
    },
    {
        "text": " Estamos bueno, bueno dicho esto, no se preocupen que esto no se los voy a tomar en el examen,",
        "start": 1621.58,
        "end": 1629.02
    },
    {
        "text": " esto ¿no?",
        "start": 1629.02,
        "end": 1636.02
    },
    {
        "text": " Sí, así la defino, digo me voy a construir un operador tal que su matriz asociada sea esta,",
        "start": 1636.02,
        "end": 1644.9
    },
    {
        "text": " esta matriz te hayan traes reales, no me importa, yo ahora trabajo en los complejos pero",
        "start": 1644.9,
        "end": 1649.66
    },
    {
        "text": " me defino un operador tal que asociado una base, en este caso la canónica, la matriz",
        "start": 1649.66,
        "end": 1654.9
    },
    {
        "text": " es la que suciada sea aquella, listo, yo sé que hay un único operador que está definido",
        "start": 1654.9,
        "end": 1659.5400000000002
    },
    {
        "text": " así, entonces como esta matriz, si la veo en los complejos es unitaria y sea una base",
        "start": 1659.5400000000002,
        "end": 1669.46
    },
    {
        "text": " ortonomía entonces este operador es unitario, estamos bueno, esta parte así como está,",
        "start": 1669.46,
        "end": 1677.74
    },
    {
        "text": " no la vamos a tomar en el examen pero bueno, bien quedas, y ahora sí viene la parte más",
        "start": 1677.74,
        "end": 1682.7
    },
    {
        "text": " entretenida, vamos a probar, si ustedes se fijan las notas todos estos resultados que",
        "start": 1682.7,
        "end": 1692.54
    },
    {
        "text": " yo digo para operadores, valen si yo las trabajo en matriz, por ejemplo si yo tengo una",
        "start": 1692.54,
        "end": 1697.98
    },
    {
        "text": " matriz real, ortonal, todas las raíces de esta tienen un módulo 1, si yo tengo una",
        "start": 1697.98,
        "end": 1702.98
    },
    {
        "text": " matriz compleja, unitaria, todas las raíces tienen un módulo 1, no lo vamos a escribir,",
        "start": 1702.98,
        "end": 1710.42
    },
    {
        "text": " entonces lo que vamos a ver ahora es lo siguiente, vamos a ver que si yo tengo un operador",
        "start": 1710.42,
        "end": 1715.9
    },
    {
        "text": " unitario, esto también vale para ortogonales, yo tengo su espacio asociado un valor propio",
        "start": 1715.9,
        "end": 1723.0600000000002
    },
    {
        "text": " lambda y su espacio asociado otro valor propio, mú, entonces esto su espacio es un ortogonales,",
        "start": 1723.0600000000002,
        "end": 1733.98
    },
    {
        "text": " vamos, eso es un primer paso si el problema, hacia el teoría espectral, lo vamos a probar",
        "start": 1733.98,
        "end": 1744.54
    },
    {
        "text": " ahora, esto ya más entretenido, mira en proposición,",
        "start": 1744.54,
        "end": 1749.58
    },
    {
        "text": " vamos al caso complejo, volvemos al caso complejo, ves espacio editorial con producto interno",
        "start": 1763.98,
        "end": 1772.54
    },
    {
        "text": " sobre el cuerpo complejo, t operador unitario,",
        "start": 1772.54,
        "end": 1785.7
    },
    {
        "text": " entonces me hice la proposición que si lambda y múson valores propios distintos, lo que",
        "start": 1793.98,
        "end": 1802.1
    },
    {
        "text": " les escribí acá, si lambda y múson valores propios distintos del operador T, entonces",
        "start": 1802.1,
        "end": 1822.98
    },
    {
        "text": " su espacio propio asociado lambda y su espacio propio y su cedamo, esos conjuntos son",
        "start": 1822.98,
        "end": 1831.3600000000001
    },
    {
        "text": " ortogonales, que quiere decir que cada elemento de ese lambda es ortogonal a cada elemento",
        "start": 1831.3600000000001,
        "end": 1839.0
    },
    {
        "text": " de ese mú. Esto es lindo, esta parte así es linda y lo que sigue también, sí.",
        "start": 1839.0,
        "end": 1847.26
    },
    {
        "text": " Bueno, que es una parte de la parte de ese per, porque podría haber más, claro, el",
        "start": 1847.26,
        "end": 1872.1
    },
    {
        "text": " S per de lambda son todos los que son ortogonales de la banda, estas pueden ser una parte,",
        "start": 1872.1,
        "end": 1876.9399999999998
    },
    {
        "text": " o es una parte depende de dónde estemos trabajando, hay un caso en que esto lo llamamos a ver.",
        "start": 1876.9399999999998,
        "end": 1884.54
    },
    {
        "text": " Bueno, no, no dije nada, sí, pero sí, en el caso",
        "start": 1890.54,
        "end": 1901.1
    },
    {
        "text": " complejo, si los únicos valores propios son claro, tengo dos, ahí necesariamente ese",
        "start": 1901.1,
        "end": 1912.02
    },
    {
        "text": " complemento ortogonal. Bueno, entonces, miren la demostración que es sencilla y linda que es,",
        "start": 1912.02,
        "end": 1917.4599999999998
    },
    {
        "text": " vamos a agarrar un vector acá, un vector acá y vamos a ver qué pronto interno es cero, entonces",
        "start": 1917.4599999999998,
        "end": 1923.1799999999998
    },
    {
        "text": " vamos a tomar un V en ese sublanda, lambda y un W en ese submú. Recorremos que tenemos",
        "start": 1923.18,
        "end": 1941.3
    },
    {
        "text": " unitario. Entonces, lo que vamos a hacer es tomar el producto interno de V con W y ver",
        "start": 1941.3,
        "end": 1953.54
    },
    {
        "text": " qué es cero. Bien, primero, como es unitario, es decir, por ejemplo, el producto interno se",
        "start": 1953.54,
        "end": 1968.74
    },
    {
        "text": " cumple esto. Este unitario para hacer el producto interno, vale esto. Ahora, V está en ese sublanda",
        "start": 1968.74,
        "end": 1985.7
    },
    {
        "text": " y W está en ese submú, o sea que T aplicado a V es lambda por V y T aplicado a W es muy por W,",
        "start": 1985.7,
        "end": 1998.5
    },
    {
        "text": " ahora lambda está en la primera entrada, sale para fuera del producto interno, muy",
        "start": 1998.5,
        "end": 2011.32
    },
    {
        "text": " está en la segunda entrada sale para fuera pero con jugado. Estamos. Entonces, lo que",
        "start": 2011.32,
        "end": 2026.18
    },
    {
        "text": " estoy viendo es que V con W el producto interno es lambda por un jugado, el producto interno",
        "start": 2026.18,
        "end": 2032.94
    },
    {
        "text": " ve con W. Si a grupos esas cosas y pasa aquello por este lado, eso es lo mismo que escribir",
        "start": 2032.94,
        "end": 2040.18
    },
    {
        "text": " uno menos lambda por muy con jugado por el producto interno de V con W igual cero. Bien,",
        "start": 2040.18,
        "end": 2055.9
    },
    {
        "text": " hay que tener un poquito cuidado porque en principio lo que son distintos son lambda y",
        "start": 2055.9,
        "end": 2060.86
    },
    {
        "text": " mu, pero ya tengo lambda y mu complejo con jugado. Sí, pero sabemos algo sobre los valores",
        "start": 2061.86,
        "end": 2070.6600000000003
    },
    {
        "text": " propios. ¿Qué sabemos? Sí, pero que sí, y en general acá estamos trabajando en que el",
        "start": 2070.6600000000003,
        "end": 2080.3
    },
    {
        "text": " módulo es uno, o sea, lo que sabemos es que los módulos estos factores son uno, entonces, por",
        "start": 2080.3,
        "end": 2085.58
    },
    {
        "text": " ejemplo el mód, mu sea lo que sea, tiene módulo uno por ser justamente un valor propio",
        "start": 2085.58,
        "end": 2097.98
    },
    {
        "text": " o peronitario y que el módulo sea uno es lo mismo que decir que, bueno, implica que mu por",
        "start": 2097.98,
        "end": 2105.14
    },
    {
        "text": " muy con jugado es uno. Muestras sobre el círculo unitario, entonces muy por muy con jugado tiene que",
        "start": 2105.14,
        "end": 2115.46
    },
    {
        "text": " ser uno, el módulo es uno, estamos entonces donde dice uno, allá voy a reemplazar por muy con",
        "start": 2115.46,
        "end": 2128.66
    },
    {
        "text": " jugado acá en el uno que tengo acá. Estamos entonces, tengo uno, voy a poner",
        "start": 2128.66,
        "end": 2143.2999999999997
    },
    {
        "text": " módulo por muy con jugado. Ahora, lo que voy a hacer es tengo módulo por muy con jugado",
        "start": 2143.2999999999997,
        "end": 2147.98
    },
    {
        "text": " acá y lambda por muy con jugado, bueno, el módulo con jugado lo saco como factor común, entonces me",
        "start": 2147.98,
        "end": 2152.22
    },
    {
        "text": " va a quedar, que me va a quedar, me va a quedar módulo, el módulo con jugado lo saco para fuera,",
        "start": 2152.22,
        "end": 2159.02
    },
    {
        "text": " menos lambda y el módulo con jugado lo saco para fuera. Me va a quedar eso,",
        "start": 2159.02,
        "end": 2169.7
    },
    {
        "text": " estamos y ahora sí tengo ahí muy lambda y sé que son valores propios distintos, entonces esto",
        "start": 2169.7,
        "end": 2186.2999999999997
    },
    {
        "text": " acá, muy menos lambda, el distinto de cero, muy con jugado también el distinto de cero porque si",
        "start": 2186.2999999999997,
        "end": 2196.8599999999997
    },
    {
        "text": " son unitarios los valores propios distintos tenemos de 1 y el cero no tiene un 1, entonces el",
        "start": 2196.86,
        "end": 2204.1400000000003
    },
    {
        "text": " cero lo puede ser valor propio y unitario, estamos entonces esto acá también es distinto de cero,",
        "start": 2204.1400000000003,
        "end": 2208.26
    },
    {
        "text": " por lo tanto lo único que me queda necesariamente es que el producto interno ve con 2V0,",
        "start": 2211.3,
        "end": 2215.42
    },
    {
        "text": " entonces concluimos que el producto interno de un vector V en ese sublanda con un vector cualquiera",
        "start": 2215.42,
        "end": 2228.5
    },
    {
        "text": " WN, ese es un muy cero, por lo tanto esos espacios son autobanales y obviamente el mismo resultado",
        "start": 2228.5,
        "end": 2240.26
    },
    {
        "text": " acá que lo probamos para los complejos vale si uno trabaja con los reales, es decir, yo tengo",
        "start": 2240.26,
        "end": 2247.1000000000004
    },
    {
        "text": " 2 valores propios distintos, entonces necesariamente su esposo propio son autobanales, si yo le dijera",
        "start": 2247.1000000000004,
        "end": 2253.42
    },
    {
        "text": " de muestrarme que eso es cierto, ¿qué cambiaría ahí en la demostración?",
        "start": 2253.42,
        "end": 2261.5400000000004
    },
    {
        "text": " digo tomemos 2 valores propios distintos, un vector provee se ha dado 1, otro, suciedo",
        "start": 2261.54,
        "end": 2270.74
    },
    {
        "text": " otro hagamos lo mismo como estamos en un caso real en lugar de mu con jugado salemú y acá tengo",
        "start": 2270.74,
        "end": 2277.22
    },
    {
        "text": " 1 menos lambda por mu y yo les pregunto ahora si yo estoy en el campo real ¿cuál son los valores",
        "start": 2277.22,
        "end": 2285.74
    },
    {
        "text": " posibles para la lambda y mu? 1 y menos 1, vimos que o es 1 o es menos 1 y si son distintos",
        "start": 2285.74,
        "end": 2292.22
    },
    {
        "text": " significa que 1 es 1 y el otro es menos 1, o sea que necesariamente lambda por mu me tiene que dar",
        "start": 2292.22,
        "end": 2299.18
    },
    {
        "text": " menos 1, con 1 menos me da más, más 1 me queda 1 2, o sea todo esto me queda necesariamente 2,",
        "start": 2299.18,
        "end": 2305.9799999999996
    },
    {
        "text": " 2 por esto, entonces por eso tienes que si va a ser, por lo tanto esto tienes que si va a ser,",
        "start": 2305.9799999999996,
        "end": 2310.18
    },
    {
        "text": " estamos, es la misma demostración más simple incluso, no tenemos en los reales no tenemos",
        "start": 2311.18,
        "end": 2319.7799999999997
    },
    {
        "text": " la posibilidad de lambda 1 y mu es igual a menos 1, no tenemos más de 2, en el caso real no tenemos",
        "start": 2319.7799999999997,
        "end": 2326.06
    },
    {
        "text": " 2 su espacio propio, exactamente, en ese caso real o no hay no hay vectores propios,",
        "start": 2326.06,
        "end": 2333.8999999999996
    },
    {
        "text": " o hay un su espacio propio o no hay dos, más no puede ver, estamos, bueno entonces lo que me",
        "start": 2334.78,
        "end": 2346.3
    },
    {
        "text": " resta hacer ya avanzamos bastante, lo que me resta hacer es lo siguiente, se acuerdan que antes",
        "start": 2346.3,
        "end": 2354.62
    },
    {
        "text": " de probar el teórico espectral para autoarjuntos, probamos un resultado como este, probamos que si",
        "start": 2354.62,
        "end": 2360.62
    },
    {
        "text": " yo tengo un espacio vectorial, tengo un sub espacio S, S invariante bajo T y T autoarjuntos",
        "start": 2360.62,
        "end": 2376.06
    },
    {
        "text": " probamos que es ortobonal también ir invariante bajo T, se acuerdan, esto es invariante bajo T",
        "start": 2376.06,
        "end": 2383.42
    },
    {
        "text": " si te es autoarjuntos y eso nos permitía probar el teórico espectral usando inducción para dar",
        "start": 2383.42,
        "end": 2398.5
    },
    {
        "text": " un sub espacio, un vector propio, me fijo el espacio generado por ese vector propio y como eso es",
        "start": 2398.5,
        "end": 2406.66
    },
    {
        "text": " un espacio invariante bajo T, el complemento tiene dimensiones de menos 1, sin variante bajo T",
        "start": 2406.66,
        "end": 2411.42
    },
    {
        "text": " y eso es un sub espacio variante bajo T, y después repetimos palabra por palabra casi palabra",
        "start": 2411.42,
        "end": 2435.62
    },
    {
        "text": " la demostración del teórico espectral para autoarjuntos en el contexto de los unitarios y ahí termina la clase, bien, bueno claro que hay que hacerlo con algún cuidado",
        "start": 2435.62,
        "end": 2450.8199999999997
    },
    {
        "text": " entonces vamos a probar el equivalente este resultado para unitarios, vamos a trabajar incluso en el",
        "start": 2456.5,
        "end": 2464.66
    },
    {
        "text": " contexto de dimensión finita porque ahí está formulado el teórico espectral, existe una base",
        "start": 2464.66,
        "end": 2474.2599999999998
    },
    {
        "text": " ortobonal de vectores propios, estamos trabajando de dimensión finita, entonces el lemame dice lo siguiente",
        "start": 2474.2599999999998,
        "end": 2479.2999999999997
    },
    {
        "text": " no escribe lo mismo así en prevedo de espacio, del teoría, tengo un teóritario y ese invariante un conjunto",
        "start": 2479.3,
        "end": 2500.02
    },
    {
        "text": " de espacios y variante bajo T, un sub espacio invariante bajo T y vamos a considerar que la dimensión es finita, pues comienzito estamos trabajando ahora en",
        "start": 2500.02,
        "end": 2522.62
    },
    {
        "text": " espacio vectorial de dimensión finita, entonces lo que me dice el resultado es que si te unitario es ese invariante bajo T, entonces el complemento",
        "start": 2522.62,
        "end": 2533.2999999999997
    },
    {
        "text": " ortobonal de es ese también es invariante bajo T,",
        "start": 2533.3,
        "end": 2537.3
    },
    {
        "text": " entonces vamos a ver esto, teunitario es ese invariante bajo T, implica que es ortobonal es invariante bajo T,",
        "start": 2563.3,
        "end": 2575.3
    },
    {
        "text": " ¿qué quiere decir que es ese invariante bajo T?, ¿qué quiere decir que es ese invariante?, significa que si yo le aplico T a todo vector que está en ESE,",
        "start": 2575.3,
        "end": 2591.3
    },
    {
        "text": " T, tiene ese vector si está en ESE, o sea en otros términos significa que le imagen de la imagen de la restricción de T a ESE está contenido en ESE, o sea si yo me restringe,",
        "start": 2591.3,
        "end": 2607.3
    },
    {
        "text": " si yo considero solamente T aplicados a los elementos de ESE y les aplico T ahí no me salgo de ESE, le imagen sigue estando en ese conjunto, ¿tabien?",
        "start": 2607.3,
        "end": 2618.3
    },
    {
        "text": " Eso es que es invariante y además se acuerdan, así se denota la restricción de un operador en su espacio, quiere decir aplíquete solamente a los elementos de su espacio y trabaja ahí,",
        "start": 2618.3,
        "end": 2641.3
    },
    {
        "text": " entonces T es restringido a ESE que es un operador que lo mire con un operador de ESE, en ESE que sabemos que si le aplico acá no me salgo de ESE,",
        "start": 2641.3,
        "end": 2654.3
    },
    {
        "text": " ese operador si me restringe ahí, prece lo al producto interno.",
        "start": 2654.3,
        "end": 2659.3
    },
    {
        "text": " Estamos, estoy diciendo una serie de pavadas en tono solente, como ese es invariante, T aplicado ESE me sigue quedando en ESE, por lo tanto tiene sentido definir la restricción de T a ESE, trabajar con T solamente aplicado esos elementos.",
        "start": 2659.3,
        "end": 2688.3
    },
    {
        "text": " Entonces esto preceve al producto interno, ¿por qué? Porque este es unitario, este es unitario preceve al producto interno para cualquier par de vectores que hagan rello por acá, en particular lo preceve si me restringe operados que está en ESE, por cualquier par de vectores acá lo preceve.",
        "start": 2688.3,
        "end": 2703.3
    },
    {
        "text": " Entonces esa restricción preceve al producto interno y además, bueno,",
        "start": 2703.3,
        "end": 2711.3
    },
    {
        "text": " si preceve al producto interno, significa que es una isometría.",
        "start": 2718.3,
        "end": 2723.3
    },
    {
        "text": " Sí, y si es una isometría ya vimos que es injectiva, las isometrias son injectivas, lo vimos hace, la que haces pasado la otra.",
        "start": 2723.3,
        "end": 2733.3
    },
    {
        "text": " Entonces, esta T sub S es injectiva, es una transformación injectiva, la restringida es su espacio,",
        "start": 2733.3,
        "end": 2743.3
    },
    {
        "text": " y además estamos diciendo que la dimensión de ESE finita.",
        "start": 2744.3,
        "end": 2748.3
    },
    {
        "text": " Estamos, entonces, primero la restricción de T a ESE es una isometría, porque la restricción de E es un operado unitario que es una isometría.",
        "start": 2755.3,
        "end": 2765.3
    },
    {
        "text": " Si es una isometría es injectiva, entonces es injectiva si yo trabajo con ESE y además esto como visto de 1,1 SNS, esto tiene dimensión finita.",
        "start": 2766.3,
        "end": 2777.3
    },
    {
        "text": " Por lo tanto, si injectiva y esto tiene dimensión finita y el mismo espacio llega a que le partida, tiene que ser sobrejectiva.",
        "start": 2777.3,
        "end": 2784.3
    },
    {
        "text": " Entonces, esto me implica acá que T de ESE, la restricción es sobrejectiva si la restringo ASE y entonces es bijectiva y por lo tanto es invertible.",
        "start": 2784.3,
        "end": 2803.3
    },
    {
        "text": " Lo cual me implica que si yo me restringo T ASE esta acá, que esta el punto importante, es invertible.",
        "start": 2803.3,
        "end": 2811.3
    },
    {
        "text": " Es una bijectión, es decir, tiene una transformación ideal de SNS, que es invertible, es injectiva y como la dimensión de este espacio lo mismo que le da llegada y es finita,",
        "start": 2815.3,
        "end": 2829.3
    },
    {
        "text": " es también sobrejectiva, por lo tanto es una bijectión, o sea que T de restringido acá es invertible.",
        "start": 2829.3,
        "end": 2836.3
    },
    {
        "text": " Obviamente lo mismo vale para terrestre en GBAA B, pues justamente es unitario, es invertible y sin verse con ESE con la estrella, pero ahora me estoy retrigiendo acá.",
        "start": 2837.3,
        "end": 2847.3
    },
    {
        "text": " Bien, entonces fíjense eso que significa, sinifiga terrestre en GBA ESE es invertible, lo cual quiere decir que...",
        "start": 2847.3,
        "end": 2858.3
    },
    {
        "text": " Entonces por lo tanto para cada vector ESE minúscula que tiene el espacio ese grande, tenemos que existe un único ESE ni OKI, ESE ni OKI también en ese grande.",
        "start": 2859.3,
        "end": 2880.3
    },
    {
        "text": " Tal que T en ese N OKI, me da ese, el vector ESE.",
        "start": 2881.3,
        "end": 2893.3
    },
    {
        "text": " Estamos como es invertible, veo que para cada vector en el espacio que estoy trabajando existe un único vector ESE Tilde,",
        "start": 2894.3,
        "end": 2905.3
    },
    {
        "text": " tal que te aplicado ese Tilde me da ese. Y ahora sí estamos en condiciones de probar que ese ortobonal es invariante.",
        "start": 2905.3,
        "end": 2916.3
    },
    {
        "text": " ¿Qué queremos probar para ver qué ese ortobonal es invariante?",
        "start": 2916.3,
        "end": 2923.3
    },
    {
        "text": " Yo estoy pariendo al hipótesis que ese invariante quiero ver qué está acá ese ortobonal es invariante.",
        "start": 2923.3,
        "end": 2930.3
    },
    {
        "text": " ¿Qué tengo que probar?",
        "start": 2930.3,
        "end": 2933.3
    },
    {
        "text": " Te voy a probar que si le aplico T a cualquier vector acaso quedando ahí, o sea tengo que probar que si W está en ese ortobonal,",
        "start": 2934.3,
        "end": 2943.3
    },
    {
        "text": " entonces te aplico W también está en ese ortobonal. Y para ver esto tengo que ver, tengo que ver que T aplico W es ortobonal a todos los vectores que están en ese.",
        "start": 2943.3,
        "end": 2956.3
    },
    {
        "text": " O sea lo que tengo que ver es que me da en cualquier W acá, yo consiguiro T en W y tengo que ver que ese T en W,",
        "start": 2956.3,
        "end": 2966.3
    },
    {
        "text": " ortobonal con cualquier, producto interno con cualquier elemento acá, ESE. Para todo ese, en el espacio tutorial, eso es lo que tengo que ver.",
        "start": 2966.3,
        "end": 2976.3
    },
    {
        "text": " Si yo veo eso, saco que T es invariante, así que si le aplico T a un elemento que está en ese ortobonal,",
        "start": 2976.3,
        "end": 2986.3
    },
    {
        "text": " T aplico el elemento también está en ese ortobonal.",
        "start": 2986.3,
        "end": 2989.3
    },
    {
        "text": " Sí, entonces veamos esto.",
        "start": 2989.3,
        "end": 2992.3
    },
    {
        "text": " Veamos esto.",
        "start": 2995.3,
        "end": 2997.3
    },
    {
        "text": " Entonces, la arremos...",
        "start": 2997.3,
        "end": 2999.3
    },
    {
        "text": " Vamos...",
        "start": 2999.3,
        "end": 3001.3
    },
    {
        "text": " Agarramos un vector cualquier en ese ortobonal.",
        "start": 3005.3,
        "end": 3008.3
    },
    {
        "text": " Bien, y lo que queremos ver escribe lo que dice, lo que dije recién.",
        "start": 3029.3,
        "end": 3032.3
    },
    {
        "text": " Queremos ver que si le aplico T a W es producto interno de eso con cualquier vector en el espacio ESE me da Cero.",
        "start": 3032.3,
        "end": 3039.3
    },
    {
        "text": " Y bueno, entonces fíjense.",
        "start": 3047.3,
        "end": 3050.3
    },
    {
        "text": " Para cada ESE, en el espacio en el que estoy trabajando, se cumple lo siguiente.",
        "start": 3059.3,
        "end": 3074.3
    },
    {
        "text": " Yo agarro T W con ESE.",
        "start": 3074.3,
        "end": 3079.3
    },
    {
        "text": " Miremos lo que escribí acá arriba. Para cada ESE existe un ESEño aquí, tal que T a ESEño aquí es ESE.",
        "start": 3080.3,
        "end": 3089.3
    },
    {
        "text": " Bueno, uso ahí. Entonces, en lugar de poner ESE,",
        "start": 3089.3,
        "end": 3092.3
    },
    {
        "text": " escribo T en ESEño aquí.",
        "start": 3100.3,
        "end": 3103.3
    },
    {
        "text": " Por esto acá.",
        "start": 3104.3,
        "end": 3106.3
    },
    {
        "text": " Ahí preciso que sea invertible.",
        "start": 3106.3,
        "end": 3110.3
    },
    {
        "text": " Y ahora, ¿qué usamos? ¿Cómo es una isometría?",
        "start": 3112.3,
        "end": 3116.3
    },
    {
        "text": " ¿Cómo es una...",
        "start": 3116.3,
        "end": 3119.3
    },
    {
        "text": " Sí, como unitario, una isometría?",
        "start": 3119.3,
        "end": 3122.3
    },
    {
        "text": " Esto lo mismo que...",
        "start": 3122.3,
        "end": 3125.3
    },
    {
        "text": " Que el producto interno entre W y ESEño aquí.",
        "start": 3125.3,
        "end": 3132.3
    },
    {
        "text": " Y cuánto vale el producto interno entre W y ESEño aquí?",
        "start": 3139.3,
        "end": 3143.3
    },
    {
        "text": " Cero, porque W está en el complemento ortobonal y ESEño aquí está en ESE.",
        "start": 3143.3,
        "end": 3150.3
    },
    {
        "text": " O sea que ese producto interno vale Cero.",
        "start": 3150.3,
        "end": 3154.3
    },
    {
        "text": " Entonces, estamos probando que el producto interno de cualquier T W cuando W está en el",
        "start": 3155.3,
        "end": 3162.0600000000004
    },
    {
        "text": " ortobonal, con cualquier ESE en el espacio que estamos consilando es...",
        "start": 3162.0600000000004,
        "end": 3165.3
    },
    {
        "text": " Por lo tanto, esto está en el complemento ortobonal de ESE.",
        "start": 3165.3,
        "end": 3171.3
    },
    {
        "text": " Esto acá, ese victorcito T W está en el complemento ortobonal de ESE.",
        "start": 3171.3,
        "end": 3176.3
    },
    {
        "text": " Entonces, lo que estamos viendo es que si yo agarro cualquier W en ESE,",
        "start": 3177.3,
        "end": 3188.3
    },
    {
        "text": " TEN W también está en ESE en el ortobonal, lo que me implica que ESE en el",
        "start": 3188.3,
        "end": 3193.9
    },
    {
        "text": " simbariante bajo T.",
        "start": 3193.9,
        "end": 3200.9
    },
    {
        "text": " Y eso es lo que precisamos, con ESE lemma y con el resultado que vimos que...",
        "start": 3207.9,
        "end": 3214.9
    },
    {
        "text": " Los subespacios propios, los precios distintos son ortobonales, sale el teorema espectral,",
        "start": 3216.9,
        "end": 3221.9
    },
    {
        "text": " y la misma manera que salía para autoadjuntos.",
        "start": 3221.9,
        "end": 3226.9
    },
    {
        "text": " ¿Casi que les podría...?",
        "start": 3226.9,
        "end": 3228.9
    },
    {
        "text": " Sí.",
        "start": 3228.9,
        "end": 3229.9
    },
    {
        "text": " Por lo menos, y tal que sea sobreyectiva, a ver...",
        "start": 3237.9,
        "end": 3242.9
    },
    {
        "text": " ¿Por qué vos para cualquier ESE que esté acá, yo tengo que encontrar...",
        "start": 3242.9,
        "end": 3246.9
    },
    {
        "text": " Para cualquier ESE en este subespacio, tengo que encontrar a alguno acá dentro que vaya para la ESE.",
        "start": 3246.9,
        "end": 3250.9
    },
    {
        "text": " Eso es lo que tengo que usar, que sea sobreyectiva, pero eso lo garantiza el hecho que sea invertible y ahí sale.",
        "start": 3251.9,
        "end": 3259.9
    },
    {
        "text": " Que sea ensectiva que sí que es uno, un único.",
        "start": 3262.9,
        "end": 3265.9
    },
    {
        "text": " Sí, exactamente, pero con que hubiera uno ya está porque agarro uno que cumpla, que vaya para ahí,",
        "start": 3265.9,
        "end": 3270.9
    },
    {
        "text": " pero acá es ensectiva y yo lo activo.",
        "start": 3270.9,
        "end": 3273.9
    },
    {
        "text": " Entonces, yo hasta les diría una cosa, miren.",
        "start": 3274.9,
        "end": 3280.9
    },
    {
        "text": " Vais en unas dos clases para atrás, no sé cómo lo probamos en que uno me espectra, hace dos clases o tres.",
        "start": 3280.9,
        "end": 3287.9
    },
    {
        "text": " Y ustedes me van dictando, yo voy escribiendo.",
        "start": 3287.9,
        "end": 3290.9
    },
    {
        "text": " Si me acabo de ocurrir ahora.",
        "start": 3290.9,
        "end": 3293.9
    },
    {
        "text": " A ver...",
        "start": 3293.9,
        "end": 3295.9
    },
    {
        "text": " Teorema espectral por operadores unitarios.",
        "start": 3297.9,
        "end": 3300.9
    },
    {
        "text": " Les aseguro que es un copy paste, son los que hay que cambiar a tu auto adjunto por unitario.",
        "start": 3304.9,
        "end": 3317.9
    },
    {
        "text": " Teorema espectral para operadores unitarios.",
        "start": 3317.9,
        "end": 3321.9
    },
    {
        "text": " Bien, lo escribo, lo leemos y lo probamos.",
        "start": 3334.9,
        "end": 3338.9
    },
    {
        "text": " Miren entonces, ¿qué es mi septorema espectral para operadores unitarios?",
        "start": 3342.9,
        "end": 3347.9
    },
    {
        "text": " B es pa' sobre el tutorial, con punto de interno sobre el cuerpo complejo.",
        "start": 3347.9,
        "end": 3350.9
    },
    {
        "text": " Acá solamente, a casi necesitamos cuerpo complejo.",
        "start": 3350.9,
        "end": 3353.9
    },
    {
        "text": " Sí, ya le dije que en reales después se que no haya valores propios.",
        "start": 3353.9,
        "end": 3356.9
    },
    {
        "text": " Dimensión de B, igual a N, ya estamos trabajando en dimensión finita.",
        "start": 3356.9,
        "end": 3360.9
    },
    {
        "text": " Y vamos a trabajar con una base acá.",
        "start": 3360.9,
        "end": 3362.9
    },
    {
        "text": " Te unitario, ¿qué me dice el tutorial de mi espectral?",
        "start": 3362.9,
        "end": 3365.9
    },
    {
        "text": " Me dice que existe una base ortornormal del espacio cultural B formada por los lectores propios de Te.",
        "start": 3365.9,
        "end": 3371.9
    },
    {
        "text": " O sea que Te es diagonalizable y además es diagonalizable en una base ortornormal del vector propio.",
        "start": 3371.9,
        "end": 3379.9
    },
    {
        "text": " Si ustedes en lugar de acá ponen unitario, ponen auto adjunto y acá ponen sobre C,",
        "start": 3379.9,
        "end": 3388.9
    },
    {
        "text": " y acá en lugar de sobresión sur R, es exactamente lo mío.",
        "start": 3388.9,
        "end": 3393.9
    },
    {
        "text": " Exactamente lo mío.",
        "start": 3393.9,
        "end": 3395.9
    },
    {
        "text": " El trabajo duro ya lo hicimos, quiero ver que bueno le mitan el proveer recién",
        "start": 3395.9,
        "end": 3400.9
    },
    {
        "text": " y ver que los subespacios propios son auto-bonales para diferentes valores propios.",
        "start": 3400.9,
        "end": 3406.9
    },
    {
        "text": " Entonces, eso nos permite trabajar con inducción en esto,",
        "start": 3406.9,
        "end": 3411.9
    },
    {
        "text": " inducción en la dimensión del espacio tutorial.",
        "start": 3411.9,
        "end": 3415.9
    },
    {
        "text": " Mira, tiene una mano la demostración del auto adjunto,",
        "start": 3416.9,
        "end": 3423.9
    },
    {
        "text": " demostración, inducción sobre N, inducción N.",
        "start": 3423.9,
        "end": 3427.9
    },
    {
        "text": " Primero, sabemos que por ser dimensión finita y el cuerpo complejo existe al menos una raíz característica,",
        "start": 3427.9,
        "end": 3454.9
    },
    {
        "text": " una solución del polimo característico, si el polimo característico y polimo de orden de gradué N,",
        "start": 3454.9,
        "end": 3460.9
    },
    {
        "text": " en los complejos sabemos que existe una raíz compleja, al menos.",
        "start": 3460.9,
        "end": 3465.9
    },
    {
        "text": " Por lo tanto esa raíz compleja como estamos en los complejos es necesariamente un valor propio,",
        "start": 3465.9,
        "end": 3470.9
    },
    {
        "text": " por lo tanto tenemos al menos un valor propio.",
        "start": 3470.9,
        "end": 3472.9
    },
    {
        "text": " Entonces, sabemos que por ser dimensión finita,",
        "start": 3472.9,
        "end": 3476.9
    },
    {
        "text": " por ser la dimensión de B finita y el cuerpo le que estamos trabajando, el cuerpo complejo,",
        "start": 3485.9,
        "end": 3496.9
    },
    {
        "text": " entonces, exista al menos un valor propio,",
        "start": 3496.9,
        "end": 3506.9
    },
    {
        "text": " o sea, exista al menos una raíz característica que como estamos en los complejos es un valor propio.",
        "start": 3506.9,
        "end": 3512.9
    },
    {
        "text": " Exista al menos un valor propio, que le vamos a llamar lambda 0, un valor propio lambda 0 de T.",
        "start": 3512.9,
        "end": 3525.9
    },
    {
        "text": " Sabemos que además cumple que el modo de ese valor propio es 1, por eso no lo vamos a usar.",
        "start": 3525.9,
        "end": 3532.9
    },
    {
        "text": " Que existe un valor propio implica, que existe un vector propio, si le existe un B0,",
        "start": 3532.9,
        "end": 3539.9
    },
    {
        "text": " distinto de 0, tal que ese B0 está en su despacio propio, eso ha asociado lambda 0.",
        "start": 3539.9,
        "end": 3554.9
    },
    {
        "text": " Bien, entonces tenemos acá el espacio vectorial B, sabemos que existe el menos un valor propio,",
        "start": 3555.9,
        "end": 3569.9
    },
    {
        "text": " puede ser el único, pero al menos uno hay, entonces tenemos acá el subespacio propio,",
        "start": 3569.9,
        "end": 3576.9
    },
    {
        "text": " socio lambda 0 y tomo ahí un vectorcito cualquiera, distinto de 0.",
        "start": 3577.9,
        "end": 3582.9
    },
    {
        "text": " Entonces lo que hago ahora es el vector lo normalizo, lo dió por su honor, me tengo un vector propio normal 1,",
        "start": 3582.9,
        "end": 3588.9
    },
    {
        "text": " asoció lambda 0.",
        "start": 3588.9,
        "end": 3591.9
    },
    {
        "text": " Le vamos a llamar W0, el vector S, B0 y vio por su norma, que esto es un vector propio y obviamente tiene norma 1.",
        "start": 3592.9,
        "end": 3606.9
    },
    {
        "text": " Bien, entonces vayamos ahora al argumento inductivo, vamos a probar que en dimension 1 existe una base",
        "start": 3606.9,
        "end": 3619.9
    },
    {
        "text": " de normas de vectores propios y que si existe para espacios de dimensiones de menos 1, también existe para 1 de dimensiones.",
        "start": 3619.9,
        "end": 3626.9
    },
    {
        "text": " Bien, paso base, tan leyendo la en paralelo, la demostración del auto adjunto,",
        "start": 3633.9,
        "end": 3648.9
    },
    {
        "text": " es un copy past, yo yo hice eso con mis notas.",
        "start": 3648.9,
        "end": 3655.9
    },
    {
        "text": " Si dimensiones igual, si la dimension de B es igual a 1 y ya sabemos que hay un valor propio,",
        "start": 3655.9,
        "end": 3666.9
    },
    {
        "text": " o sea agarró un vector propio cualquiera y eso es una base del espacio vectorial,",
        "start": 3666.9,
        "end": 3672.9
    },
    {
        "text": " en particular si lo dió por su norma, si usted es un avance hortogó, hortogó normal del espacio en el que estamos trabajando.",
        "start": 3673.9,
        "end": 3680.9
    },
    {
        "text": " Entonces para N igual a 1, ve el conjunto formado por ese vector propio normalizado, es un avance hortogó normal del espacio y esta formada por vectores propios.",
        "start": 3680.9,
        "end": 3695.9
    },
    {
        "text": " Es decir, existe una base hortogó normal formada por vectores propios de T con lo cual el paso inicial, el paso base se cumple.",
        "start": 3702.9,
        "end": 3714.9
    },
    {
        "text": " Y lo que me queda ver es el paso inductivo.",
        "start": 3714.9,
        "end": 3719.9
    },
    {
        "text": " Que vamos a suponer que se cumple para cualquier espacio y dimension, menos o igual que N-1 y veamos para E.",
        "start": 3719.9,
        "end": 3733.9
    },
    {
        "text": " Y ahora vamos a suponer que es un avance hortogó normal.",
        "start": 3749.9,
        "end": 3757.9
    },
    {
        "text": " Bien, entonces en el paso inductivo vamos a suponer que el hipótesis se cumple para cualquier espacio vectorial y dimensiones, menos o igual a N-1 y veamos que eso nos garantiza que se cumple para dimensiones.",
        "start": 3779.9,
        "end": 3791.9
    },
    {
        "text": " Lo vamos a probar para dimensiones.",
        "start": 3791.9,
        "end": 3794.9
    },
    {
        "text": " Qué artante que es esto, Dios.",
        "start": 3794.9,
        "end": 3797.9
    },
    {
        "text": " Bueno, créanme que ya estamos en 5 minutos terminados, en menos, de menos.",
        "start": 3798.9,
        "end": 3811.9
    },
    {
        "text": " A ver, ¿cómo es el paso inductivo? ¿Se acuerdan? Vamos a considerar, a ver, dícteme ustedes. Consideramos.",
        "start": 3811.9,
        "end": 3823.9
    },
    {
        "text": " Considamos ese, el subespacio associado, ahí va. Consideramos ese, el subespacio generado por doble de 0.",
        "start": 3828.9,
        "end": 3842.9
    },
    {
        "text": " W0 es un vector propio que tenemos acá de norma 1, sabemos que existe y ahora me consiguo el subespacio generado por ese.",
        "start": 3842.9,
        "end": 3849.9
    },
    {
        "text": " Ese es un espacio de dimension 1, que no es realmente va a ser todo el ambasero, pero es un subespacio invariante.",
        "start": 3850.9,
        "end": 3856.9
    },
    {
        "text": " Entonces, consideramos su espacio generado por doble de 0, que esto está en en ve obviamente.",
        "start": 3856.9,
        "end": 3864.9
    },
    {
        "text": " La dimensión de ese es 1. Bien, entonces, acá tengo el espacio vectorial B y acá tengo un espacio de dimension 1 generado por el vector doble de 0, que es un vector propio.",
        "start": 3864.9,
        "end": 3888.9
    },
    {
        "text": " Entonces, como esto es un vector propio, sabemos que este es un vector invariante bajo T. Si le aplico T a cualquier elemento de acá, si oqueando me da un múltiplo de este, porque este es un vector propio, a cualquier elemento de acá yo me da un múltiplo de ese vector.",
        "start": 3889.9,
        "end": 3905.9
    },
    {
        "text": " Entonces, ese dio mío, se cumple que ese invariante bajo T, se cumple.",
        "start": 3905.9,
        "end": 3924.9
    },
    {
        "text": " Ese invariante bajo T y además tenemos que este es unitario, el lema que me dice que ese ortogonal también es invariante bajo T.",
        "start": 3925.9,
        "end": 3944.9
    },
    {
        "text": " Entonces, acá usamos el lema que era el equivalente a que teníamos para ortogonales, esto por el lema.",
        "start": 3945.9,
        "end": 3960.9
    },
    {
        "text": " Y bien, entonces, tengo acá el complemento ese ortogonal, el complemento de este espacio que estamos trabajando y ese es un espacio de que dimensión.",
        "start": 3961.9,
        "end": 3975.9
    },
    {
        "text": " N-1, porque este tiene dimension 1 y el ortogonal tiene ese el complemento. Entonces, entonces, por lo tanto, la restricción de T a S, de A S ortogonal, perdón.",
        "start": 3976.9,
        "end": 3999.9
    },
    {
        "text": " Y el operador de restricción de E a S ortogonal, la restricción ahí es un operador que precede lo al anón, precede lo al pronto y interno, por lo tanto es unitario.",
        "start": 4000.9,
        "end": 4011.9
    },
    {
        "text": " Entonces, la restricción de T es ese espacio de su unitario y la dimensión de ese espacio es N-1.",
        "start": 4011.9,
        "end": 4023.9
    },
    {
        "text": " Estamos todos tenemos que la restricción de T a S ortogonal, que a S ortogonal es unitario, si lo restrínjo ahí, y además, S ortogonal tiene dimensiones de N-1.",
        "start": 4024.9,
        "end": 4040.9
    },
    {
        "text": " Entonces, aplico el hipote sinductiva, decimos que hay una base ortogonal formada por los factores propios de T en ese espacio y mencioné N-1.",
        "start": 4040.9,
        "end": 4049.9
    },
    {
        "text": " Entonces, existe por hipote sinductiva una base ortogonal, W-1, W-2 hasta W-1, que es una base ortogonal de complemento ortogonal formada por factores propios.",
        "start": 4049.9,
        "end": 4075.9
    },
    {
        "text": " Formada por factores propios de la restricción de T es restringido a S ortogonal, estamos trabajando acá, pero los factores propios de T es restringido a S ortogonal son factores propios de T.",
        "start": 4079.9,
        "end": 4096.9
    },
    {
        "text": " Esto es como se hace recién por hipote sinductiva.",
        "start": 4096.9,
        "end": 4111.9
    },
    {
        "text": " Si me dejo T,",
        "start": 4111.9,
        "end": 4133.9
    },
    {
        "text": " Bien, entonces acá viene el reglón final.",
        "start": 4134.9,
        "end": 4150.9
    },
    {
        "text": " Entonces, teníamos el espacio generado por W-0, el complemento ortogonal que vimos que se invarían a T bajo la acción de T y terrestre que es unitario.",
        "start": 4151.9,
        "end": 4166.9
    },
    {
        "text": " O sea, acá por hipote sinductiva tenemos una base de factores propios acá del operador T y además teníamos W-0 acá.",
        "start": 4167.9,
        "end": 4175.9
    },
    {
        "text": " Bien, entonces, ¿qué me resta usar?",
        "start": 4175.9,
        "end": 4183.9
    },
    {
        "text": " Exactamente, lo que nos reto usar es que B es suma de directa de S con ese ortogonal, por lo tanto si yo garro una base de S y una base de S ortogonal te una base de B.",
        "start": 4183.9,
        "end": 4196.9
    },
    {
        "text": " Por lo tanto esto me implica, la base de S era el vector W-0 y la base de S ortogonal la ira tengo.",
        "start": 4196.9,
        "end": 4211.9
    },
    {
        "text": " Esto acá es una base ortogonal, perdón, esto es un principio es una base de B.",
        "start": 4211.9,
        "end": 4221.9
    },
    {
        "text": " Sí sí, pero en principio esto es una base de B, perdemos el segundo y esto.",
        "start": 4221.9,
        "end": 4229.9
    },
    {
        "text": " Bueno, tengo una base de B y ahora uso que los... bueno, uso más nada.",
        "start": 4229.9,
        "end": 4249.9
    },
    {
        "text": " Esto acá es TN, y esto acá está en ese ortogonal.",
        "start": 4250.9,
        "end": 4257.9
    },
    {
        "text": " Entonces, esto es como si una base de ortogonal tiene todo en 2 o 1 y entre sí entre ellos los productos interno son cero, son ortogonales de apares.",
        "start": 4257.9,
        "end": 4267.9
    },
    {
        "text": " Y además esto tiene en 1 o 1 y es ortogonal al cabo de los elementos de este.",
        "start": 4267.9,
        "end": 4273.9
    },
    {
        "text": " Por lo tanto esto también es una base de ortogonal, B.",
        "start": 4274.9,
        "end": 4277.9
    },
    {
        "text": " Entonces, si tenemos una base de ortogonal suponemos que vale el hipótesis para espacios mencionar en el menos 1,",
        "start": 4277.9,
        "end": 4285.9
    },
    {
        "text": " probamos que vale para dimensionen, entonces tenemos una base de ortogonal, B, formada por vectores propios.",
        "start": 4285.9,
        "end": 4291.9
    },
    {
        "text": " Y ahí termino la historia.",
        "start": 4292.9,
        "end": 4298.9
    },
    {
        "text": " Y ahí termino la historia.",
        "start": 4299.9,
        "end": 4305.9
    },
    {
        "text": " Y bien, pierden que era lo mismo, lo único que había que cambiar era unitario por auto adjunto,",
        "start": 4305.9,
        "end": 4316.9
    },
    {
        "text": " auto adjunto por unitario.",
        "start": 4316.9,
        "end": 4318.9
    },
    {
        "text": " Bueno, muy bien, este... paramos acá, terminamos, sí.",
        "start": 4321.9,
        "end": 4326.9
    },
    {
        "text": " Y ahí termino la historia.",
        "start": 4328.9,
        "end": 4331.9
    }
]