[
    {
        "text": " Bueno, vamos arriba a este lado.",
        "start": 0.0,
        "end": 7.0
    },
    {
        "text": " Arranquenlo más.",
        "start": 7.0,
        "end": 14.0
    },
    {
        "text": " Arranquenlo más.",
        "start": 15.0,
        "end": 17.0
    },
    {
        "text": " Muy buenas tardes. Mi nombre es Rodrigo Barbosa y compañero",
        "start": 20.0,
        "end": 25.0
    },
    {
        "text": " al socio Jorge Domínguez.",
        "start": 25.0,
        "end": 28.0
    },
    {
        "text": " Rados, son...",
        "start": 28.0,
        "end": 31.0
    },
    {
        "text": " Hoy es de la Emptamoy, una empresa Uruguayag.",
        "start": 31.0,
        "end": 35.0
    },
    {
        "text": " Más o menos ya tenemos tres, cuatro años en el mercado.",
        "start": 35.0,
        "end": 40.0
    },
    {
        "text": " Y bueno, primero darle las gracias a Jorge por invitarnos",
        "start": 41.0,
        "end": 44.0
    },
    {
        "text": " y tragar un placer.",
        "start": 44.0,
        "end": 46.0
    },
    {
        "text": " Y bueno, espero un poco que nuestra experiencia,",
        "start": 46.0,
        "end": 49.0
    },
    {
        "text": " que a lo largo del camino a emprendedor le sea a su.",
        "start": 49.0,
        "end": 54.0
    },
    {
        "text": " Bueno, como siempre, todos los emprendimientos surgen con un problema",
        "start": 57.0,
        "end": 62.0
    },
    {
        "text": " a solucionar, que como todos, en este caso,",
        "start": 62.0,
        "end": 67.0
    },
    {
        "text": " las lesiones son uno de los riesgos más grandes que corren los deportistas.",
        "start": 67.0,
        "end": 72.0
    },
    {
        "text": " Suelen ser muy caras para las instituciones médicas y deportivas.",
        "start": 72.0,
        "end": 76.0
    },
    {
        "text": " Y si no se realizan correcto tratamiento de rehabilitación,",
        "start": 76.0,
        "end": 80.0
    },
    {
        "text": " puede tener muchas consecuencias.",
        "start": 80.0,
        "end": 83.0
    },
    {
        "text": " Ya sea que el deportista está mucho tiempo parado,",
        "start": 83.0,
        "end": 87.0
    },
    {
        "text": " lo que se traduce en pérdidas monetarias, pérdida de forma del deportista,",
        "start": 87.0,
        "end": 92.0
    },
    {
        "text": " pérdida de calidad de vida, reinsidencia, las lesiones también.",
        "start": 92.0,
        "end": 97.0
    },
    {
        "text": " Y bueno, dentro de esto, muchos de los ejercicios tanto para rehabilitación",
        "start": 97.0,
        "end": 103.0
    },
    {
        "text": " como para entrenamiento son con bandas elásticas.",
        "start": 103.0,
        "end": 106.0
    },
    {
        "text": " Esto tiene un pro que el ejercicio con bandas, como por ejemplo,",
        "start": 106.0,
        "end": 110.0
    },
    {
        "text": " como ven ahí en la selección Uruguayag, es muy usado para entrenamiento",
        "start": 110.0,
        "end": 115.0
    },
    {
        "text": " porque permiten realizar el gesto deportivo.",
        "start": 115.0,
        "end": 118.0
    },
    {
        "text": " Por otro lado, tiene la contra de que hasta ahora no había un mecanismo",
        "start": 118.0,
        "end": 123.0
    },
    {
        "text": " para poder medir el esfuerzo que están haciendo las personas durante este entrenamiento.",
        "start": 123.0,
        "end": 130.0
    },
    {
        "text": " La lesión es más común, tanto en el deporte de matéragos como profesional,",
        "start": 130.0,
        "end": 135.0
    },
    {
        "text": " más que nada en miembros inferiores, son las de rodillas,",
        "start": 135.0,
        "end": 139.0
    },
    {
        "text": " específicamente el ligamiento cruzado anterior, como les pasa muy comunes en los futbolistas.",
        "start": 139.0,
        "end": 146.0
    },
    {
        "text": " Este tipo de lesiones necesita cirugía.",
        "start": 147.0,
        "end": 150.0
    },
    {
        "text": " Para realizar la plástia del ligamento, suele sacar un pedazo de semitendinosos",
        "start": 150.0,
        "end": 159.0
    },
    {
        "text": " del posterior, se coloca en la propio rodilla para hacer del ligamento.",
        "start": 159.0,
        "end": 163.0
    },
    {
        "text": " Ahí es donde entran los ejercicios con bandas elásticas",
        "start": 163.0,
        "end": 167.0
    },
    {
        "text": " porque hay que recuperar el músculo del que se le sacó la plástia.",
        "start": 167.0,
        "end": 172.0
    },
    {
        "text": " Ahí venía el problema de que estos tipos de ejercicios eran difíciles cuantificarlos",
        "start": 173.0,
        "end": 178.0
    },
    {
        "text": " y medirlos y se traducía en la conferencia de los ciruganos y traumatológos",
        "start": 178.0,
        "end": 182.0
    },
    {
        "text": " a la hora de prescribir revelaciones tempranas, lo que demoraba el proceso enormemente.",
        "start": 182.0,
        "end": 187.0
    },
    {
        "text": " Así es que Nase de Inavan, un equipo portable de fácil colocación",
        "start": 188.0,
        "end": 193.0
    },
    {
        "text": " que permitía medir fuerza ángulo y velocidad durante ejercicios con bandas elásticas.",
        "start": 193.0,
        "end": 198.0
    },
    {
        "text": " Es sin alambrico, ya que nos permite no necesitar y estar libres durante el ejercicio",
        "start": 199.0,
        "end": 206.0
    },
    {
        "text": " y seguro y preciso que agregando ese plusa, esa seguridad y precisión",
        "start": 206.0,
        "end": 212.0
    },
    {
        "text": " que necesitaban los ciruganos y traumatológ para prescribir esas revelaciones.",
        "start": 212.0,
        "end": 216.0
    },
    {
        "text": " Bueno, un poco como era la revelación antes y después antes, como se veía ahí en el video,",
        "start": 217.0,
        "end": 225.0
    },
    {
        "text": " el fisioterapeuta tomaba la banda con sus manos y más o menos media la fuerza,",
        "start": 225.0,
        "end": 231.0
    },
    {
        "text": " un poco más o un poco menos, pero a todo medio a ojo básicamente.",
        "start": 231.0,
        "end": 236.0
    },
    {
        "text": " Eso era una medida no objetiva que agrega muchos errores y un cego enorme",
        "start": 236.0,
        "end": 243.0
    },
    {
        "text": " cuando había un cambio de fisioterapeuta con otra.",
        "start": 243.0,
        "end": 248.0
    },
    {
        "text": " Mientras que con Nase de Inavan se puede ver ahí en el segundo video",
        "start": 249.0,
        "end": 254.0
    },
    {
        "text": " que el fisioterapeuta tiene control en todo momento durante el ejercicio.",
        "start": 254.0,
        "end": 258.0
    },
    {
        "text": " Ve, hace un seguimiento ahí se ve bien que la pierna exactamente el ángulo de la repetición",
        "start": 258.0,
        "end": 267.0
    },
    {
        "text": " se apresienta dos barras con la fuerza máxima y la velocidad máxima.",
        "start": 267.0,
        "end": 271.0
    },
    {
        "text": " Entonces esos datos que han guardado ahí en la tabla para hacer procesados",
        "start": 271.0,
        "end": 276.0
    },
    {
        "text": " y que el fisioterapeuta pueda dar más decisiones sobre el tratamiento.",
        "start": 276.0,
        "end": 279.0
    },
    {
        "text": " Eso permite hacer una medición objetiva, una revelación eficiente",
        "start": 279.0,
        "end": 283.0
    },
    {
        "text": " ya que el fisioterapeuta puede dimensionar un plan totalmente amedida para esa persona",
        "start": 283.0,
        "end": 291.0
    },
    {
        "text": " y se exportan todos los datos en PDF o en CSU para agregar los aleestoría clínica electrónica.",
        "start": 291.0,
        "end": 300.0
    },
    {
        "text": " Todo esto ha sido posible gracias a la interdisciplina.",
        "start": 301.0,
        "end": 305.0
    },
    {
        "text": " Si bien nosotros somos ingenieros eléctricos salidos de ahí de la fin.",
        "start": 305.0,
        "end": 310.0
    },
    {
        "text": " Nosotros aportamos toda la parte de diseño electrónico,",
        "start": 310.0,
        "end": 314.0
    },
    {
        "text": " tanto de hardware, de firmware, un poco de software también metimos.",
        "start": 314.0,
        "end": 319.0
    },
    {
        "text": " Y bueno, para poder llevar acá o un proyecto de estas características",
        "start": 319.0,
        "end": 324.0
    },
    {
        "text": " siempre es necesario un conocimiento médico que fue dado por la gente",
        "start": 325.0,
        "end": 332.0
    },
    {
        "text": " del núcleo de ingeniería biomédica, Darío Santos, que es el fisioterapeuta",
        "start": 332.0,
        "end": 336.0
    },
    {
        "text": " que trabajó con nosotros. Y bueno, ella ha sido en toda la parte del análisis biomecánico",
        "start": 336.0,
        "end": 343.0
    },
    {
        "text": " y nos aportaba el conocimiento médico.",
        "start": 343.0,
        "end": 348.0
    },
    {
        "text": " Bueno, un poco los desafíos y nuestra carrera de lo que fue nuestro emprendimiento.",
        "start": 348.0,
        "end": 354.0
    },
    {
        "text": " Todo empezó por allá por los 2017 cuando decidimos y cuando hicimos el proyecto de fin de carrera",
        "start": 354.0,
        "end": 363.0
    },
    {
        "text": " nos presentamos en ingeniería de muestras con un primer prototipo",
        "start": 363.0,
        "end": 368.0
    },
    {
        "text": " y ahí fue que, si bien, la mayoría del público es ingenieril",
        "start": 368.0,
        "end": 373.0
    },
    {
        "text": " pero muchas personas con afinidad al deporte y varios fisioterapeuta también fueron allí",
        "start": 373.0,
        "end": 381.0
    },
    {
        "text": " por el están de nosotros y nos manifestaron.",
        "start": 381.0,
        "end": 384.0
    },
    {
        "text": " Qué buen equipo me encantaría poder usarlo yo en la clínica",
        "start": 384.0,
        "end": 389.0
    },
    {
        "text": " y ahí quedamos con esa idea de decir,",
        "start": 389.0,
        "end": 393.0
    },
    {
        "text": " bueno, vimos realmente que había una necesidad de algo así y decidimos acarlo al mercado.",
        "start": 393.0,
        "end": 398.0
    },
    {
        "text": " Decidimos emprendar.",
        "start": 398.0,
        "end": 400.0
    },
    {
        "text": " Ahí fue que uno de los tutores de nosotros, Pablo Pérez, nos mandó un mail",
        "start": 400.0,
        "end": 405.0
    },
    {
        "text": " diciéndonos que había contándonos del encuador a incuadro,",
        "start": 405.0,
        "end": 410.0
    },
    {
        "text": " que es una encuadora para proyectos de electrónica,",
        "start": 410.0,
        "end": 413.0
    },
    {
        "text": " el cual ofreció una pequeña financiación y bueno,",
        "start": 413.0,
        "end": 418.0
    },
    {
        "text": " toda la parte de acceso de consultorías",
        "start": 418.0,
        "end": 423.0
    },
    {
        "text": " y un acceso a un laboratorio muy bien equipado,",
        "start": 423.0,
        "end": 427.0
    },
    {
        "text": " fuentes, socioscopios, para poder generar los primeros prototipos.",
        "start": 427.0,
        "end": 433.0
    },
    {
        "text": " Así fue que obtuvimos esa, quedamos seleccionados y, bueno,",
        "start": 433.0,
        "end": 439.0
    },
    {
        "text": " realizamos ese proceso ahí.",
        "start": 439.0,
        "end": 441.0
    },
    {
        "text": " Ahora actualmente bajaron a un año del proceso pero nosotros estuvimos dos",
        "start": 441.0,
        "end": 446.0
    },
    {
        "text": " porque eran de los primeros.",
        "start": 446.0,
        "end": 449.0
    },
    {
        "text": " Luego ahí en la encuadora nos sugirieron, nos llevaron por el camino,",
        "start": 449.0,
        "end": 455.0
    },
    {
        "text": " bueno, ahora hay que validar hacer una validación de idea de negocio",
        "start": 455.0,
        "end": 460.0
    },
    {
        "text": " de una manera correcta en las cuales, bueno, necesitábamos una institución patrocinadora",
        "start": 460.0,
        "end": 467.0
    },
    {
        "text": " para poder llegar al vín.",
        "start": 467.0,
        "end": 469.0
    },
    {
        "text": " El vín de Annie, que es, no, te ofrece, es un instrumento que te ofrece financiación",
        "start": 469.0,
        "end": 477.0
    },
    {
        "text": " para que vos puedas realizar todas las tareas pertinentes para la validación.",
        "start": 477.0,
        "end": 481.0
    },
    {
        "text": " La Fundación Ricaldón y nos patrocinó para que pudieramos acceder ahí",
        "start": 481.0,
        "end": 485.0
    },
    {
        "text": " y bueno, nos financiaron con $5.000, en el cual bueno,",
        "start": 485.0,
        "end": 489.0
    },
    {
        "text": " esa plata se distribuyó para poder realizar campaña publicitaria,",
        "start": 489.0,
        "end": 494.0
    },
    {
        "text": " parte del diseño contratar personas que nos hicieran en el diseño de la página web,",
        "start": 494.0,
        "end": 500.0
    },
    {
        "text": " parte de esa plata se utilizó para contratar una empresa de software",
        "start": 500.0,
        "end": 504.0
    },
    {
        "text": " que nos hiciera una aplicación mobile y también estudió de marcado, pruebas de campo",
        "start": 504.0,
        "end": 511.0
    },
    {
        "text": " y millones de cosas más.",
        "start": 511.0,
        "end": 514.0
    },
    {
        "text": " Luego con una validación exitosa o muy buenas opiniones de los clientes,",
        "start": 516.0,
        "end": 525.0
    },
    {
        "text": " ya sea de clicas, fisioterapiatas, personal trainers,",
        "start": 525.0,
        "end": 531.0
    },
    {
        "text": " seguimos dando un paso más en el cual nos postulamos a el instrumento de emprendedores y innovadores",
        "start": 531.0,
        "end": 537.0
    },
    {
        "text": " que también es un capital que brinda Annie, que te da una financiación de hasta 900.000 pesos",
        "start": 537.0,
        "end": 544.0
    },
    {
        "text": " para que vos puedas continuar tu proyecto y terminar y sacar el hacer una versión bien comercializable.",
        "start": 544.0,
        "end": 553.0
    },
    {
        "text": " Que damos seleccionados y bueno, eso favoreció mucho en lo que fue el crecimiento del proyecto.",
        "start": 553.0,
        "end": 560.0
    },
    {
        "text": " También, esa plata se invertió en materiales y insumos, se invertió en promoción e difusión,",
        "start": 560.0,
        "end": 572.0
    },
    {
        "text": " sin diseño de hardware, software, congresos y muchas actividades relacionadas con la parte de venta.",
        "start": 572.0,
        "end": 583.0
    },
    {
        "text": " Eso fue un gran apoyo para nosotros, ya que también, aparte, este instrumento estaba muy bueno",
        "start": 583.0,
        "end": 591.0
    },
    {
        "text": " porque no solo te dan plata para el proyecto en sí, sino que también hay otras,",
        "start": 591.0,
        "end": 598.0
    },
    {
        "text": " otros monto que pueden utilizarlo para pagar sueldos.",
        "start": 598.0,
        "end": 602.0
    },
    {
        "text": " Eso estaba muy bueno para la gente de los emprendedores que a veces nunca,",
        "start": 602.0,
        "end": 608.0
    },
    {
        "text": " no hay mucha dinero disponible y ni tampoco tiempo, ¿no?",
        "start": 608.0,
        "end": 613.0
    },
    {
        "text": " Entonces eso es un punto favor.",
        "start": 613.0,
        "end": 617.0
    },
    {
        "text": " Al no decir, luego de encualeditro, una vez finalizado allí, nos graduamos",
        "start": 617.0,
        "end": 624.0
    },
    {
        "text": " y nos mudamos para la encuadora ingenio, que es la que estamos hoy en día ahora.",
        "start": 624.0,
        "end": 631.0
    },
    {
        "text": " En el cual, esta encuadora no es solo para el electrónica,",
        "start": 631.0,
        "end": 636.0
    },
    {
        "text": " sino que también hay otros proyectos, hay muchas proyectos de software acá también,",
        "start": 636.0,
        "end": 641.0
    },
    {
        "text": " empresas de todo tipo pueden acceder acá.",
        "start": 641.0,
        "end": 646.0
    },
    {
        "text": " Lo bueno que tienes es que nos da acceso a oficinas 24, 7, consultoría legal, marketing,",
        "start": 646.0,
        "end": 656.0
    },
    {
        "text": " de innovación, contabilidad, acceso a salas de arroñones,",
        "start": 656.0,
        "end": 661.0
    },
    {
        "text": " nos enteramos muchas de muchos eventos y bueno ahí la imagen pueden ver un poco",
        "start": 661.0,
        "end": 668.0
    },
    {
        "text": " de lo que es nuestra oficina en el cual tenemos empresas 3D y todo material",
        "start": 668.0,
        "end": 674.0
    },
    {
        "text": " para el control de calidad, soldadores, computadoras, para hacer un firmware, etc.",
        "start": 674.0,
        "end": 682.0
    },
    {
        "text": " Bueno, uno de los sitos grandes que hemos tenido hoy en día es la parte de transferencia de tecnología",
        "start": 682.0,
        "end": 690.0
    },
    {
        "text": " que nosotros firmamos un contrato de eso mismo con modelar para poder continuar",
        "start": 690.0,
        "end": 697.0
    },
    {
        "text": " trabajando en el proyecto, poder mejorarlo y así sacarlo al mercado.",
        "start": 697.0,
        "end": 704.0
    },
    {
        "text": " Y bueno, eso nos permite tener un trabajo en conjunto, generar contactos, darío",
        "start": 704.0,
        "end": 713.0
    },
    {
        "text": " que es el Fispehildo que trabajó con nosotros del inicio, es un miembro de equipo",
        "start": 713.0,
        "end": 718.0
    },
    {
        "text": " y está buenísimo poder seguir trabajando con él, también facilita la generación",
        "start": 718.0,
        "end": 725.0
    },
    {
        "text": " de contenidos de investigación. Eso es muy importante ya que es muy valorado",
        "start": 725.0,
        "end": 731.0
    },
    {
        "text": " para un instrumento de las características del equipo de nosotros.",
        "start": 731.0,
        "end": 736.0
    },
    {
        "text": " Y bueno, hablando un poquito más de la investigación, se han hecho pruebas",
        "start": 736.0,
        "end": 741.0
    },
    {
        "text": " en más de 5.000 pacientes con consentimiento informado y ahí esos valores se sacaron",
        "start": 741.0,
        "end": 747.0
    },
    {
        "text": " y hicieron una tabla de valores normales, se publicó para poder luego",
        "start": 747.0,
        "end": 753.0
    },
    {
        "text": " agregarlos al lo que es el equipo y seguir mejorando.",
        "start": 753.0,
        "end": 757.0
    },
    {
        "text": " Como todos los emprendedores hay que mantenerse visible, no sólo en los medios,",
        "start": 757.0,
        "end": 764.0
    },
    {
        "text": " redes sociales, sino que también hay que participar en congresos y más que nada congresos",
        "start": 764.0,
        "end": 771.0
    },
    {
        "text": " de el público objetivo al que vos le quieres llegar.",
        "start": 771.0,
        "end": 775.0
    },
    {
        "text": " En nuestro caso es medicina deportiva, biomecánica, deporte de todo tipo.",
        "start": 775.0,
        "end": 786.0
    },
    {
        "text": " Entonces, ahí, por ejemplo, vemos a Andrés Silva, el corredor Olímpico,",
        "start": 787.0,
        "end": 792.0
    },
    {
        "text": " que se está evaluando con Dinaban en el Congreso de Punta.",
        "start": 792.0,
        "end": 796.0
    },
    {
        "text": " Y bueno, de hecho, le encantó el equipo hasta que terminó comprando lo.",
        "start": 796.0,
        "end": 801.0
    },
    {
        "text": " Y bueno, también estuviamos en el Saiy 20, presentando el equipo innovador",
        "start": 801.0,
        "end": 807.0
    },
    {
        "text": " entre otros congresos.",
        "start": 807.0,
        "end": 810.0
    },
    {
        "text": " Bueno, muy bien. Desde los inicios del proyecto como un proyecto de fin de carrera,",
        "start": 811.0,
        "end": 816.0
    },
    {
        "text": " de la Universidad de la República, ha surgido, ha surgido un montón de cambios,",
        "start": 816.0,
        "end": 820.0
    },
    {
        "text": " tanto desde el punto de vista de la entarrafa gráfica como desde el hardware.",
        "start": 820.0,
        "end": 823.0
    },
    {
        "text": " Acá podemos ver en la izquierda cómo fue el prototipo del dispositivo desarrollado",
        "start": 823.0,
        "end": 828.0
    },
    {
        "text": " durante el proyecto de fin de carrera.",
        "start": 828.0,
        "end": 830.0
    },
    {
        "text": " Una cosa que estuvo bueno del proyecto es que al tratarse de un proyecto que incluía",
        "start": 830.0,
        "end": 834.0
    },
    {
        "text": " componente de electrónica.",
        "start": 834.0,
        "end": 836.0
    },
    {
        "text": " El nuestro proyecto de fin de carrera contaba con un mundo inicial para hacer la compra",
        "start": 836.0,
        "end": 841.0
    },
    {
        "text": " de componentes, además de acceso a maquinaria que tienen el Instituto de Ingeniería Electric",
        "start": 841.0,
        "end": 845.0
    },
    {
        "text": " a de Brerlar, como prototipadora que utilizamos para la primera versión.",
        "start": 845.0,
        "end": 849.0
    },
    {
        "text": " Esta placa desde que fuimos al incubadora y a través de los escesores nos podíamos",
        "start": 849.0,
        "end": 855.0
    },
    {
        "text": " acessorar correctamente en diversos ámbitos, ha sufrido un montón de modificaciones.",
        "start": 855.0,
        "end": 860.0
    },
    {
        "text": " Ahí podemos ver tres versiones de las placas que se han ido actualizando,",
        "start": 860.0,
        "end": 865.0
    },
    {
        "text": " abajo es la última versión que es la que estamos comercializando ahora con ir a esa",
        "start": 865.0,
        "end": 869.0
    },
    {
        "text": " hacia el exterior, que tiene un montón de mejoras desde el punto de vista",
        "start": 869.0,
        "end": 873.0
    },
    {
        "text": " funcional como de optimización de costos.",
        "start": 873.0,
        "end": 876.0
    },
    {
        "text": " El equipo también ha recibido un montón de mejoras desde el punto de vista de la carcasa",
        "start": 876.0,
        "end": 881.0
    },
    {
        "text": " o el aspecto visual, una dificultad que tenía el equipo del proyecto de fin de carrera",
        "start": 881.0,
        "end": 886.0
    },
    {
        "text": " y era que por más que era un equipo completamente funcional, tanto en el hardware como en el software,",
        "start": 886.0,
        "end": 890.0
    },
    {
        "text": " estaba feo y una herramienta no agradable a la vista.",
        "start": 890.0,
        "end": 895.0
    },
    {
        "text": " Ahí podemos ver el primer prototipo al izquierdo del equipo, que era una caja cuadrada",
        "start": 895.0,
        "end": 900.0
    },
    {
        "text": " y con también con impresora con la que pudimos acceder desde el proyecto de fin de carrera.",
        "start": 900.0,
        "end": 904.0
    },
    {
        "text": " Pero bueno nosotros mismos no teníamos en ese momento los conocimientos de diseño gráfico",
        "start": 904.0,
        "end": 909.0
    },
    {
        "text": " ni diseño industrial para desarrollar una carcasa adecuada.",
        "start": 909.0,
        "end": 913.0
    },
    {
        "text": " Sobre lo hemos ido cambiando afortunadamente y ahora ya tenemos un dispositivo con una carcasa",
        "start": 914.0,
        "end": 921.0
    },
    {
        "text": " muy agradable y que ya está siendo planificada para ser utilizada con inyección.",
        "start": 921.0,
        "end": 927.0
    },
    {
        "text": " La versión actual del equipo que tenemos utiliza todavía componentes en impresión 3D,",
        "start": 927.0,
        "end": 931.0
    },
    {
        "text": " ya que se pueden conseguir muy buenos resultados con esa herramienta,",
        "start": 931.0,
        "end": 935.0
    },
    {
        "text": " pero con el objetivo de más que nada optimizar tiempos y costos a largo plazo",
        "start": 935.0,
        "end": 939.0
    },
    {
        "text": " lo ideal es ir a inyección, inyección me refiero a todas las carcasa de plástico",
        "start": 939.0,
        "end": 944.0
    },
    {
        "text": " que son en tener los componentes electrónicos.",
        "start": 944.0,
        "end": 948.0
    },
    {
        "text": " La versión actual del dispositivo en la que se puede ver ahí en la imagen,",
        "start": 948.0,
        "end": 952.0
    },
    {
        "text": " tenemos el dispositivo de hardware, la parte abajo a la izquierda,",
        "start": 952.0,
        "end": 956.0
    },
    {
        "text": " que cuenta con el sensor, el cilindro ese es un sensor de fuerza",
        "start": 956.0,
        "end": 961.0
    },
    {
        "text": " y una tovillera que se coloca en el miembro de evaluar del deportista del paciente.",
        "start": 961.0,
        "end": 966.0
    },
    {
        "text": " La tablet viene incluida dependiendo de la versión del equipo que se compra",
        "start": 966.0,
        "end": 969.0
    },
    {
        "text": " y es donde se puede utilizar la aplicación para dispositivos móviles",
        "start": 969.0,
        "end": 972.0
    },
    {
        "text": " que está disponible tanto para Android como para iOS",
        "start": 972.0,
        "end": 975.0
    },
    {
        "text": " y se puede descargar de la propia tienda de cualquier algo.",
        "start": 975.0,
        "end": 979.0
    },
    {
        "text": " El equipo viene con un montón de accesorio, como bolso para transportarse,",
        "start": 979.0,
        "end": 983.0
    },
    {
        "text": " tovilleras, manuales, carpadores, etc.",
        "start": 983.0,
        "end": 986.0
    },
    {
        "text": " Acá hemos hecho algunas imágenes de la Vinterface",
        "start": 987.0,
        "end": 990.0
    },
    {
        "text": " este Vinterface ha estado continuamente creciendo,",
        "start": 990.0,
        "end": 993.0
    },
    {
        "text": " hargan las novas funcionalidades y mejorando aspectos visuales.",
        "start": 993.0,
        "end": 996.0
    },
    {
        "text": " En esta tapa estábamos incluyendo los que son indicadores de performance,",
        "start": 996.0,
        "end": 1001.0
    },
    {
        "text": " que son indicadores que son muy útiles para el profesional,",
        "start": 1001.0,
        "end": 1004.0
    },
    {
        "text": " no solo en la tapa de rehabilitación para evaluar el alta deportiva",
        "start": 1004.0,
        "end": 1008.0
    },
    {
        "text": " sino también en la tapa de entrenamiento para la prevención de lesión.",
        "start": 1008.0,
        "end": 1012.0
    },
    {
        "text": " Esto es algo que fuimos aprendiendo mediante que vamos avanzando en el proyecto",
        "start": 1012.0,
        "end": 1017.0
    },
    {
        "text": " desde que arrancamos con un proyecto de fin de carrera,",
        "start": 1017.0,
        "end": 1020.0
    },
    {
        "text": " el dispositivo estaba enfocado solo para rehabilitación,",
        "start": 1020.0,
        "end": 1023.0
    },
    {
        "text": " pero conversar con los propios clientes, que es algo fundamental",
        "start": 1023.0,
        "end": 1026.0
    },
    {
        "text": " cuando estás desarrollando un nuevo equipo, genero en ellos",
        "start": 1026.0,
        "end": 1029.0
    },
    {
        "text": " el interés del equipo también para la tapa de entrenamiento.",
        "start": 1029.0,
        "end": 1033.0
    },
    {
        "text": " De esa manera fuimos guiando el instrumento hacia una herramienta",
        "start": 1033.0,
        "end": 1037.0
    },
    {
        "text": " que le sirva al profesional y que realmente lo vea como un dispositivo",
        "start": 1037.0,
        "end": 1041.0
    },
    {
        "text": " que le suma durante su trabajo normal.",
        "start": 1041.0,
        "end": 1044.0
    },
    {
        "text": " De la misma forma, a través de los propios profesionales,",
        "start": 1045.0,
        "end": 1048.0
    },
    {
        "text": " hemos sido agregando un montón de ejercicios, tanto para miembros superiores",
        "start": 1048.0,
        "end": 1052.0
    },
    {
        "text": " como para miembros inferiores.",
        "start": 1052.0,
        "end": 1054.0
    },
    {
        "text": " El dispositivo que estaba desarrollado en el proyecto de fin de carrera",
        "start": 1054.0,
        "end": 1057.0
    },
    {
        "text": " tenía únicamente el ejercicio que se puede ver en el centro arriba,",
        "start": 1057.0,
        "end": 1061.0
    },
    {
        "text": " este sesión de cadera con rodillas tendidas, ese nombre,",
        "start": 1061.0,
        "end": 1064.0
    },
    {
        "text": " y el típico ejercicio de patada con la rodilla estendida,",
        "start": 1064.0,
        "end": 1068.0
    },
    {
        "text": " que era muy buen ejercicio para rehabilitación de posteriores,",
        "start": 1068.0,
        "end": 1073.0
    },
    {
        "text": " la musculatura que más estaba lesionada luego de la plástica,",
        "start": 1073.0,
        "end": 1077.0
    },
    {
        "text": " y que se le dio nuevamente los propios clientes y usuarios",
        "start": 1077.0,
        "end": 1081.0
    },
    {
        "text": " al momento de usar la herramienta, consultaban por nuevos ejercicios,",
        "start": 1081.0,
        "end": 1085.0
    },
    {
        "text": " y hay que nosotros hemos sabido identificar correctamente cuáles son los que realmente hay que implementar",
        "start": 1085.0,
        "end": 1093.0
    },
    {
        "text": " porque cuando vuelve consultadas al cliente final,",
        "start": 1093.0,
        "end": 1096.0
    },
    {
        "text": " que es lo que le interesa en la herramienta,",
        "start": 1096.0,
        "end": 1098.0
    },
    {
        "text": " el cliente final te va a dar un montón de superiores y uno tiene que saber filtrar",
        "start": 1098.0,
        "end": 1102.0
    },
    {
        "text": " realmente cuáles de todas esas son las que son útiles",
        "start": 1102.0,
        "end": 1105.0
    },
    {
        "text": " y realmente le van a brindar un extra en su entrenamiento",
        "start": 1105.0,
        "end": 1108.0
    },
    {
        "text": " y cuáles incluso pueden hasta ser descabelladas",
        "start": 1108.0,
        "end": 1111.0
    },
    {
        "text": " y estar por fuera de los requerimientos que puede alcanzar el dispositivo.",
        "start": 1111.0,
        "end": 1115.0
    },
    {
        "text": " Fluto del interdisciplino con Odelar, de los conocimientos que adquirimos",
        "start": 1117.0,
        "end": 1121.0
    },
    {
        "text": " del área biomecánica, fue que pudimos modelar el miembro que está haciendo fuerza del paciente,",
        "start": 1121.0,
        "end": 1126.0
    },
    {
        "text": " esto en realidad haya una simplificación de todo el modelado que se ha realizado",
        "start": 1126.0,
        "end": 1130.0
    },
    {
        "text": " donde básicamente tenemos una segunda cardinal de fuerza,",
        "start": 1130.0,
        "end": 1134.0
    },
    {
        "text": " en la que se ignora la componente de aceleración,",
        "start": 1134.0,
        "end": 1137.0
    },
    {
        "text": " porque se está asumiendo que en el ejercicio es despreciable",
        "start": 1137.0,
        "end": 1141.0
    },
    {
        "text": " y se incorporan en la medición otras mediciones externa,",
        "start": 1141.0,
        "end": 1145.0
    },
    {
        "text": " como es por ejemplo el torque realizado por el peso de la propia pierna",
        "start": 1145.0,
        "end": 1150.0
    },
    {
        "text": " y se consideran otras mediciones como el largo total del miembro evaluar,",
        "start": 1150.0,
        "end": 1154.0
    },
    {
        "text": " la distancia del centro de masa, el ángulo que está generando la banda elástica",
        "start": 1154.0,
        "end": 1159.0
    },
    {
        "text": " que estaría donde se ve la fuerza negra, la fecha que dice fecinta",
        "start": 1159.0,
        "end": 1163.0
    },
    {
        "text": " y ese ángulo respecto a lo que sería la componente ortogonal al miembro del paciente",
        "start": 1163.0,
        "end": 1168.0
    },
    {
        "text": " o tan genial al movimiento. Esto lo utilizamos y es uno de los features",
        "start": 1168.0,
        "end": 1173.0
    },
    {
        "text": " en los que más detaca de Inavan respecto a otros dispositivos en el mercado,",
        "start": 1173.0,
        "end": 1177.0
    },
    {
        "text": " ya que es capaz de cuantificar realmente el torque que está realizando",
        "start": 1177.0,
        "end": 1180.0
    },
    {
        "text": " el propio paciente, independientemente de los parámetros externos",
        "start": 1180.0,
        "end": 1184.0
    },
    {
        "text": " como con qué ángulo se realizó la fuerza y cuál es el peso del paciente.",
        "start": 1184.0,
        "end": 1188.0
    },
    {
        "text": " Para obtener estos valores a través de diversas investigaciones",
        "start": 1188.0,
        "end": 1192.0
    },
    {
        "text": " se ha podido modelar cuál es el largo genérico del miembro del paciente",
        "start": 1192.0,
        "end": 1197.0
    },
    {
        "text": " con determinados errores que podemos considerar despreciables",
        "start": 1197.0,
        "end": 1201.0
    },
    {
        "text": " y además también esos valores no sólo están cuantificados",
        "start": 1201.0,
        "end": 1206.0
    },
    {
        "text": " para lo que es la distancia, sino también para las proporciones de masa",
        "start": 1206.0,
        "end": 1210.0
    },
    {
        "text": " de los miembros respecto a la masa total del cuerpo.",
        "start": 1210.0,
        "end": 1213.0
    },
    {
        "text": " Los segmentos de mercado a los que tenemos enfocado al dispositivo",
        "start": 1213.0,
        "end": 1219.0
    },
    {
        "text": " son las instituciones médicas como clínicas de rehabilitación",
        "start": 1219.0,
        "end": 1223.0
    },
    {
        "text": " y motoristas, instituciones deportivas de diversos deportes",
        "start": 1223.0,
        "end": 1227.0
    },
    {
        "text": " no sólo limitado a futbol o básquetbol, iros profesionales y independientes",
        "start": 1227.0,
        "end": 1231.0
    },
    {
        "text": " que adquieren el dispositivo para su uso cotidiano, no restringido a una clínica",
        "start": 1231.0,
        "end": 1237.0
    },
    {
        "text": " o institución deportiva. Algo muy importante también al momento de",
        "start": 1237.0,
        "end": 1242.0
    },
    {
        "text": " emprender y que fuimos aprendiendo a medida que íbamos desarrollando nuestro dispositivo",
        "start": 1242.0,
        "end": 1247.0
    },
    {
        "text": " y planteando nuestras propuestas de valor, es abrir y identificar correctamente",
        "start": 1247.0,
        "end": 1251.0
    },
    {
        "text": " cuáles son los segmentos a lo que vas a dirigir.",
        "start": 1251.0,
        "end": 1254.0
    },
    {
        "text": " Todo el mundo quisiera tener un equipo que le pudiera vender a cualquiera",
        "start": 1254.0,
        "end": 1257.0
    },
    {
        "text": " pero la realidad es que si intentas vender un instrumento a todo el mundo",
        "start": 1257.0,
        "end": 1262.0
    },
    {
        "text": " terminas perdiendo realmente a quien es tu cliente",
        "start": 1262.0,
        "end": 1266.0
    },
    {
        "text": " como suelen decir el que mucho abarca a poco aprieta",
        "start": 1266.0,
        "end": 1269.0
    },
    {
        "text": " y esto es muy cierto, en nuestro caso fue algo real",
        "start": 1269.0,
        "end": 1272.0
    },
    {
        "text": " ya que tuvimos que ser conscientes de cuáles serán realmente nuestros clientes",
        "start": 1272.0,
        "end": 1276.0
    },
    {
        "text": " cuáles es el cliente prioritario y para cada uno de los segmentos de mercado",
        "start": 1276.0,
        "end": 1281.0
    },
    {
        "text": " se ha identificado nuestra propuesta de valor",
        "start": 1281.0,
        "end": 1283.0
    },
    {
        "text": " no le vendemos el equipo de la misma manera a un fisiote de la peuta",
        "start": 1283.0,
        "end": 1286.0
    },
    {
        "text": " que a un deportólogo ni vamos a una institución médica con la misma propuesta",
        "start": 1286.0,
        "end": 1290.0
    },
    {
        "text": " de valor que la que vamos a una institución de rehabilitación",
        "start": 1290.0,
        "end": 1294.0
    },
    {
        "text": " ya que más allá de que los dos utilizan las mismas funcionalidades",
        "start": 1294.0,
        "end": 1298.0
    },
    {
        "text": " pero desde el punto de vista distinto el interés que tienen por el equipo no es el mismo",
        "start": 1298.0,
        "end": 1303.0
    },
    {
        "text": " una institución deportiva a su principal foco es que el propio que el deportista",
        "start": 1303.0,
        "end": 1307.0
    },
    {
        "text": " no se lesione y que si se lesionó se rehabilita rápido",
        "start": 1307.0,
        "end": 1311.0
    },
    {
        "text": " pero para una institución médica dependiendo de la institución también",
        "start": 1311.0,
        "end": 1315.0
    },
    {
        "text": " le puede interesar más hacer un correcto seguimiento que el paciente sienta",
        "start": 1315.0,
        "end": 1319.0
    },
    {
        "text": " de la confianza de que en esa clínica se está rehabilitando correctamente",
        "start": 1319.0,
        "end": 1323.0
    },
    {
        "text": " y que cuando se rehabilita no vuelve a reincibir a una lesión",
        "start": 1323.0,
        "end": 1327.0
    },
    {
        "text": " estas cosas que le comentaba desde el punto de vista de la interfaz",
        "start": 1327.0,
        "end": 1329.0
    },
    {
        "text": " están utilizando las mismas funcionalidades como el índice de asymmetría del RATO-CQ",
        "start": 1329.0,
        "end": 1333.0
    },
    {
        "text": " pero desde el punto de vista de la interfaz son para los profesionales",
        "start": 1333.0,
        "end": 1338.0
    },
    {
        "text": " deben tratarse de forma distinta",
        "start": 1338.0,
        "end": 1341.0
    },
    {
        "text": " los desafíos los que estamos embarcados actualmente en nuestro emprendimiento",
        "start": 1341.0,
        "end": 1344.0
    },
    {
        "text": " son el crecimiento en el marcado nacional",
        "start": 1344.0,
        "end": 1347.0
    },
    {
        "text": " el desarrollo tecnológico del dispositivo y la internacionalización",
        "start": 1347.0,
        "end": 1351.0
    },
    {
        "text": " el crecimiento nacional, ya que el dispositivo hoy en día está siendo comercializado",
        "start": 1351.0,
        "end": 1355.0
    },
    {
        "text": " en nuestro país",
        "start": 1355.0,
        "end": 1357.0
    },
    {
        "text": " estamos por suerte sobreviviendo a la situación de la pandemia",
        "start": 1357.0,
        "end": 1363.0
    },
    {
        "text": " durante la pandemia justo cuando se inición nosotros habíamos arrancado",
        "start": 1363.0,
        "end": 1367.0
    },
    {
        "text": " lo que es el primer año de emprendedores innovadores de lo que conectaba Rodrigo",
        "start": 1367.0,
        "end": 1371.0
    },
    {
        "text": " y bueno tuvimos que también ser capaces de sorpear esa situación",
        "start": 1371.0,
        "end": 1375.0
    },
    {
        "text": " como muchos otros emprendimientos buscando no fundirse en medio de una pandemia",
        "start": 1375.0,
        "end": 1380.0
    },
    {
        "text": " que estaba cerrando todos los emientos de mercado y lo que estábamos trabajando",
        "start": 1380.0,
        "end": 1385.0
    },
    {
        "text": " en esa manera tuvimos que ser capaz de reutilizar ese tiempo para otras actividades",
        "start": 1385.0,
        "end": 1389.0
    },
    {
        "text": " seguir el contacto con los clientes sabiendo que no es el momento en que tenés que ofrecerle un equipo de 1500 o 200 dólares",
        "start": 1389.0,
        "end": 1396.0
    },
    {
        "text": " pero sí escuchando cuáles son sus opiniones y qué tendría que desarrollar para que cuando la situación mejoró",
        "start": 1396.0,
        "end": 1402.0
    },
    {
        "text": " ese propio cliente manifieste el interés por el equipo",
        "start": 1402.0,
        "end": 1405.0
    },
    {
        "text": " y por mandarlo un mail contando de las actualizaciones",
        "start": 1405.0,
        "end": 1408.0
    },
    {
        "text": " termines recuperando un cliente que en la época de pandemia te dijo que el equipo no me interés",
        "start": 1408.0,
        "end": 1413.0
    },
    {
        "text": " respecto al desarrollo a la internacionalización",
        "start": 1413.0,
        "end": 1417.0
    },
    {
        "text": " nuestro la oportunidad principal que vemos de esto es generar una economía de escala",
        "start": 1417.0,
        "end": 1421.0
    },
    {
        "text": " ya que como todo emprendimiento no puede estar sujeto a la venta solo en Uruguay",
        "start": 1421.0,
        "end": 1426.0
    },
    {
        "text": " hay que crecer y para crecer hay que mirar al exterior",
        "start": 1426.0,
        "end": 1429.0
    },
    {
        "text": " para esto lo fundamental fue también durante todas estas etapas",
        "start": 1429.0,
        "end": 1433.0
    },
    {
        "text": " participaciones los congresos y ferias",
        "start": 1433.0,
        "end": 1435.0
    },
    {
        "text": " ser capaces de identificar en cuáles países nos manifestaban un mayor interés por el equipo",
        "start": 1435.0,
        "end": 1440.0
    },
    {
        "text": " eso en esa situación fue en derránmente fue de mucha ayuda la participación en congresos y ferias",
        "start": 1440.0,
        "end": 1446.0
    },
    {
        "text": " que es una inversión por supuesto hay que estar detinando o fondo a esa parte",
        "start": 1446.0,
        "end": 1450.0
    },
    {
        "text": " que entrarían dentro de lo que sería un rubro de promoción y difusión",
        "start": 1450.0,
        "end": 1453.0
    },
    {
        "text": " pero ha rendido su fruto ya que nos llegan no solo clientes interesados",
        "start": 1453.0,
        "end": 1457.0
    },
    {
        "text": " sino también personal personas que están interesadas",
        "start": 1457.0,
        "end": 1461.0
    },
    {
        "text": " en representado distribuir el país el dispositivo en otros países",
        "start": 1461.0,
        "end": 1465.0
    },
    {
        "text": " nosotros actualmente seleccionamos a Brasil y Chile como nuestros siguientes objetivos",
        "start": 1465.0,
        "end": 1469.0
    },
    {
        "text": " Brasil porque es un país significativamente más grande que Uruguay",
        "start": 1469.0,
        "end": 1474.0
    },
    {
        "text": " pero que tiene requerimientos de registro bastante más exigentes",
        "start": 1474.0,
        "end": 1478.0
    },
    {
        "text": " por tratarse de un equipo de hardware uno de los grandes desafíos que tenemos",
        "start": 1478.0,
        "end": 1483.0
    },
    {
        "text": " es registrar el instrumento antes de ingresar al país",
        "start": 1483.0,
        "end": 1486.0
    },
    {
        "text": " y hacer un equipo médico ese registro es aún más exigente",
        "start": 1486.0,
        "end": 1490.0
    },
    {
        "text": " ya que es un registro sanitario",
        "start": 1490.0,
        "end": 1493.0
    },
    {
        "text": " Brasil es un país que tiene requerimientos altos similar a lo que sería un FDA para Estados Unidos",
        "start": 1493.0,
        "end": 1500.0
    },
    {
        "text": " mientras que Chile es un cemento de mercado con requisitos muy muy inferiores",
        "start": 1500.0,
        "end": 1505.0
    },
    {
        "text": " en el que planificamos la comercialización en el primer año",
        "start": 1505.0,
        "end": 1509.0
    },
    {
        "text": " por esto fue que seleccionamos al un poste momento al mismo tiempo",
        "start": 1509.0,
        "end": 1512.0
    },
    {
        "text": " ya que lo objetivo es lo fondo que se están obteniendo a partir de las ventas más sencillas",
        "start": 1512.0,
        "end": 1518.0
    },
    {
        "text": " no marcado como Chile y son reinvertidos para todo lo necesario para completar los registros en Brasil",
        "start": 1518.0,
        "end": 1527.0
    },
    {
        "text": " es fundamental también en un emprendimiento saber seleccionar quienes son tus socioclaves",
        "start": 1527.0,
        "end": 1532.0
    },
    {
        "text": " es algo que cuando cuando participas en un incubador empezás a hablar con consultores",
        "start": 1532.0,
        "end": 1537.0
    },
    {
        "text": " y los primeros que te consultan y si te un cambas te dicen de tu proyecto",
        "start": 1537.0,
        "end": 1541.0
    },
    {
        "text": " el cambas es una herramienta la que empezás a identificar cuáles son tus propuestas de valores",
        "start": 1541.0,
        "end": 1547.0
    },
    {
        "text": " quienes son tus socioclaves cuáles van a ser tus ingresos, cuáles van a ser tus pérdidas",
        "start": 1547.0,
        "end": 1552.0
    },
    {
        "text": " y bueno dentro de estos socioclaves así como tenemos por ejemplo Odelar",
        "start": 1552.0,
        "end": 1556.0
    },
    {
        "text": " que es la que viene de todo el conocimiento técnico y de investigación",
        "start": 1556.0,
        "end": 1560.0
    },
    {
        "text": " también seleccionamos a Hastin que es una empresa internacional que tiene una fuerte experiencia",
        "start": 1560.0,
        "end": 1565.0
    },
    {
        "text": " en la internacionalización y en el registro de dispositivos del área médico",
        "start": 1565.0,
        "end": 1569.0
    },
    {
        "text": " además también estamos trabajando en contratos con distribuidores",
        "start": 1569.0,
        "end": 1573.0
    },
    {
        "text": " ya que un equipo de estas características para el exterior necesita de alguien que estemos trándole a la herramienta",
        "start": 1573.0,
        "end": 1579.0
    },
    {
        "text": " al expandirse no podés seguir siendo sólo unos emprendedores en Uruguay",
        "start": 1579.0,
        "end": 1584.0
    },
    {
        "text": " que están tratando de hablar con gente en otro país es que encima habla en otro idioma",
        "start": 1584.0,
        "end": 1588.0
    },
    {
        "text": " sino que tienes que tener gente que tenga experiencia trabajando con esas personas",
        "start": 1588.0,
        "end": 1594.0
    },
    {
        "text": " y desde el punto de vista de rediseño del hardware",
        "start": 1594.0,
        "end": 1596.0
    },
    {
        "text": " el objetivo en el que estamos embarcado ahora es también relacionado a la etapa de registro",
        "start": 1596.0,
        "end": 1602.0
    },
    {
        "text": " nuestro hardware que le mostramos anteriormente si bien habíamos mejorado un montón de aspectos",
        "start": 1602.0,
        "end": 1607.0
    },
    {
        "text": " del proyecto de fin de carrera",
        "start": 1607.0,
        "end": 1608.0
    },
    {
        "text": " todavía teníamos el inconveniente de que una herramienta con mucho componente manual",
        "start": 1608.0,
        "end": 1611.0
    },
    {
        "text": " hayan muchas partes del equipo que requerían un trabajo prácticamente nuestro",
        "start": 1611.0,
        "end": 1616.0
    },
    {
        "text": " que no es algo que puede ir a hipercerizar",
        "start": 1616.0,
        "end": 1619.0
    },
    {
        "text": " y eso es lo que estamos realizando para la comercialización de la nueva versión",
        "start": 1619.0,
        "end": 1623.0
    },
    {
        "text": " queremos una herramienta que tiene neutralizada, que sea fácil de fabricar",
        "start": 1623.0,
        "end": 1627.0
    },
    {
        "text": " que sea traer los componentes",
        "start": 1627.0,
        "end": 1629.0
    },
    {
        "text": " en todo caso en sambrano en Uruguay, en el país que se desee",
        "start": 1629.0,
        "end": 1632.0
    },
    {
        "text": " y luego se comercialice el exterior",
        "start": 1632.0,
        "end": 1635.0
    },
    {
        "text": " desde el punto de vista de software es inconveniente, no lo tenemos",
        "start": 1635.0,
        "end": 1638.0
    },
    {
        "text": " ya que salgo mucho más sencillo al tenerlo en lo que es la tienda del Prochio Sistema",
        "start": 1638.0,
        "end": 1643.0
    },
    {
        "text": " lo único que tenemos que hacer es una interfaza acorde a control de idiomas",
        "start": 1643.0,
        "end": 1647.0
    },
    {
        "text": " por ejemplo del país en el que se está",
        "start": 1647.0,
        "end": 1650.0
    },
    {
        "text": " donde estamos embarcados en el software es la gestión remota de los equipos",
        "start": 1650.0,
        "end": 1654.0
    },
    {
        "text": " ya que el tener equipos en el exterior ya no pueden estar volviendo a nuestras empresas",
        "start": 1654.0,
        "end": 1658.0
    },
    {
        "text": " si tuvieran algún desperfecto técnico",
        "start": 1658.0,
        "end": 1660.0
    },
    {
        "text": " y el objetivo es que todas las actualizaciones sean realizadas en forma remota",
        "start": 1660.0,
        "end": 1665.0
    },
    {
        "text": " o incluso automático",
        "start": 1665.0,
        "end": 1666.0
    },
    {
        "text": " y también tenemos el manejo de la normativa de datos médicos",
        "start": 1666.0,
        "end": 1669.0
    },
    {
        "text": " eso es un punto en el que también hemos tenido apoyo de la universidad",
        "start": 1669.0,
        "end": 1673.0
    },
    {
        "text": " y bueno, hemos podido establecer contacto con cargos, cargos atos",
        "start": 1673.0,
        "end": 1677.0
    },
    {
        "text": " en los organismos de protección de datos médicos de Uruguay",
        "start": 1677.0,
        "end": 1681.0
    },
    {
        "text": " ya que para un dispositivo médico no deberías, por lo menos, por más que",
        "start": 1681.0,
        "end": 1686.0
    },
    {
        "text": " hay muchos que lo hacen, no deberías estar almacenando datos sensibles",
        "start": 1686.0,
        "end": 1689.0
    },
    {
        "text": " en cualquier base de datos, hay muchos requerimientos que hay que cumplir",
        "start": 1689.0,
        "end": 1693.0
    },
    {
        "text": " y bueno, y eso es una de las etapas en la que estamos trabajando también actualmente",
        "start": 1693.0,
        "end": 1698.0
    },
    {
        "text": " el equipo por el que está conformado a nuestra empresa",
        "start": 1699.0,
        "end": 1702.0
    },
    {
        "text": " en principio somos Rodrigo y yo, ambos ingenieros eléctricos, se agresados del Ar",
        "start": 1702.0,
        "end": 1708.0
    },
    {
        "text": " y después tenemos dos integrantes más que son Diana y Camila",
        "start": 1708.0,
        "end": 1712.0
    },
    {
        "text": " que cubren las áreas de contador público y de relaciones laborales",
        "start": 1712.0,
        "end": 1715.0
    },
    {
        "text": " y redes sociales nosotros como de la rama electrónica",
        "start": 1715.0,
        "end": 1719.0
    },
    {
        "text": " lo que menos nos gustaba era estar continuamente actualizando o Instagram",
        "start": 1719.0,
        "end": 1723.0
    },
    {
        "text": " con un nuevo contito de cómo estaba pasando el equipo",
        "start": 1723.0,
        "end": 1726.0
    },
    {
        "text": " y tampoco estar llenando planillas de la empresa y calculando fin de mes",
        "start": 1726.0,
        "end": 1731.0
    },
    {
        "text": " cuáles eran nuestros ingresos y cuando teníamos que pagar de IVA",
        "start": 1731.0,
        "end": 1734.0
    },
    {
        "text": " por eso fundamental rodearse de gente que tenga experiencias en esas áreas",
        "start": 1734.0,
        "end": 1738.0
    },
    {
        "text": " ahí donde tuvimos también mucho apoyo de las incubadoras",
        "start": 1738.0,
        "end": 1740.0
    },
    {
        "text": " porque no brindan asesoría en nivel de esos segmentos",
        "start": 1740.0,
        "end": 1744.0
    },
    {
        "text": " por ejemplo como tuvimos que firmar contratos con Oelar, con distribuidores",
        "start": 1744.0,
        "end": 1747.0
    },
    {
        "text": " en el exterior podíamos contar con horas prátis de bogados",
        "start": 1747.0,
        "end": 1751.0
    },
    {
        "text": " que de otra forma no serían las abaratas y por supuesto lo mismo también",
        "start": 1751.0,
        "end": 1755.0
    },
    {
        "text": " en distintas áreas tanto como contabilidad y también el área de innovación",
        "start": 1755.0,
        "end": 1761.0
    },
    {
        "text": " y poder poder identificar correctamente que estamos trabajando bien",
        "start": 1761.0,
        "end": 1766.0
    },
    {
        "text": " en lo que es nuestra, se supone de ver eso a nuestras partidicias",
        "start": 1766.0,
        "end": 1769.0
    },
    {
        "text": " nosotros hasta el momento estábamos trabajando con nuestra cuenta",
        "start": 1769.0,
        "end": 1772.0
    },
    {
        "text": " en el área de diseño industrial diseñando la carcasa",
        "start": 1772.0,
        "end": 1775.0
    },
    {
        "text": " pero hablar con un profesional con mucha experiencia en esa área",
        "start": 1775.0,
        "end": 1778.0
    },
    {
        "text": " nos pudo nos permitir identificar cuál era nuestros desperfectos",
        "start": 1778.0,
        "end": 1781.0
    },
    {
        "text": " en el equipo al momento de querer convertirlo en algo industrializado",
        "start": 1781.0,
        "end": 1786.0
    },
    {
        "text": " finalmente como consejos para los emprendedores o los que pretenden arrancar",
        "start": 1786.0,
        "end": 1791.0
    },
    {
        "text": " emprender primero que nada tener una fuerte confianza en el equipo",
        "start": 1791.0,
        "end": 1795.0
    },
    {
        "text": " algo que hemos visto por fuerte no fue tanto en nuestro caso",
        "start": 1795.0,
        "end": 1799.0
    },
    {
        "text": " pero hemos visto emprendimientos que sí fallan por esto",
        "start": 1799.0,
        "end": 1802.0
    },
    {
        "text": " que antes de emprender tenés que estar seguro de que las personas",
        "start": 1802.0,
        "end": 1806.0
    },
    {
        "text": " con las que vas a emprender se están poniendo la camiseta",
        "start": 1806.0,
        "end": 1808.0
    },
    {
        "text": " del emprendimiento tanto como vos",
        "start": 1808.0,
        "end": 1810.0
    },
    {
        "text": " no porque sea tu amigo solo significa que el emprendimiento va a estruvar",
        "start": 1810.0,
        "end": 1813.0
    },
    {
        "text": " tristemente depende mucho la persona de la persona",
        "start": 1813.0,
        "end": 1816.0
    },
    {
        "text": " tiene que ser realmente comprometido con el proyecto",
        "start": 1816.0,
        "end": 1819.0
    },
    {
        "text": " y esto está muy ligado a confiar en el producto",
        "start": 1819.0,
        "end": 1822.0
    },
    {
        "text": " cuando surge con problema que va a surgir siempre va a haber algunas fallas",
        "start": 1822.0,
        "end": 1826.0
    },
    {
        "text": " tenés que estar preparado para afrontar y confieren que el producto",
        "start": 1826.0,
        "end": 1830.0
    },
    {
        "text": " realmente es capaz de ser comercializado",
        "start": 1830.0,
        "end": 1833.0
    },
    {
        "text": " y de invitar una diferencia en el área en el que estás tratando de trabajar",
        "start": 1833.0,
        "end": 1837.0
    },
    {
        "text": " por lo que encontrar un competidor no no tienes que verlo como una desventaja",
        "start": 1837.0,
        "end": 1841.0
    },
    {
        "text": " sino a veces también como una ventaja positiva porque te alivien algunos pasos",
        "start": 1841.0,
        "end": 1846.0
    },
    {
        "text": " también firmar un acuerdo de socios no necesitas contratar un abogado",
        "start": 1846.0,
        "end": 1850.0
    },
    {
        "text": " y firmar el acuerdo sino en un papel describir los que van a ser socios de la empresa",
        "start": 1850.0,
        "end": 1855.0
    },
    {
        "text": " aquí se está comprometiendo cada uno si va a llevarse partes iguales",
        "start": 1855.0,
        "end": 1859.0
    },
    {
        "text": " si no es así con más razón firmar cuáles van a ser las partes",
        "start": 1859.0,
        "end": 1862.0
    },
    {
        "text": " lamentablemente hemos visto varios emprendimientos que tenían un gran futuro",
        "start": 1862.0,
        "end": 1867.0
    },
    {
        "text": " que han fracasado justamente por esta parte porque al momento de poner en papel",
        "start": 1867.0,
        "end": 1872.0
    },
    {
        "text": " yo me voy a llevar 50% de la empresa y vos también",
        "start": 1872.0,
        "end": 1875.0
    },
    {
        "text": " yo quiero el 60% y vos el 40 ahí donde la mitad ya no vale tanto",
        "start": 1875.0,
        "end": 1880.0
    },
    {
        "text": " y donde estaba metido el negocio con medio",
        "start": 1880.0,
        "end": 1884.0
    },
    {
        "text": " se empiezan a complicar las situaciones y como les decía en emprendimiento",
        "start": 1884.0,
        "end": 1888.0
    },
    {
        "text": " que han terminado sólo por eso detalle",
        "start": 1888.0,
        "end": 1892.0
    },
    {
        "text": " también desde nuestra experiencia que el producto final no existe",
        "start": 1892.0,
        "end": 1895.0
    },
    {
        "text": " algo que nos pasaba a nosotros sobre todo porque somos ingenieros",
        "start": 1895.0,
        "end": 1898.0
    },
    {
        "text": " es que queríamos brindar una herramienta que realmente tuviera completamente",
        "start": 1898.0,
        "end": 1901.0
    },
    {
        "text": " terminada que no tuviera ningún tipo de desperfecto",
        "start": 1901.0,
        "end": 1904.0
    },
    {
        "text": " nos rompíamos la cabeza sin algún momento nosotros notábamos",
        "start": 1904.0,
        "end": 1907.0
    },
    {
        "text": " que si hacías determinada combinación iba a generar",
        "start": 1907.0,
        "end": 1910.0
    },
    {
        "text": " se le unbáguen la interfaz esto no es la verdad es que no es así como funciona",
        "start": 1910.0,
        "end": 1915.0
    },
    {
        "text": " hay que mostrar el equipo al cliente no quemarse con un dispositivo",
        "start": 1915.0,
        "end": 1919.0
    },
    {
        "text": " que está completamente fuera de despero",
        "start": 1919.0,
        "end": 1922.0
    },
    {
        "text": " si empezar a mostrar el equipo desde las primeras etapas",
        "start": 1922.0,
        "end": 1925.0
    },
    {
        "text": " para que el propio cliente sea el que te vaya quedando la herramienta",
        "start": 1925.0,
        "end": 1928.0
    },
    {
        "text": " hacia el lugar que le va a funcionar y de esa manera",
        "start": 1928.0,
        "end": 1931.0
    },
    {
        "text": " puedas vendarlo mejor",
        "start": 1931.0,
        "end": 1933.0
    },
    {
        "text": " y también como les comentaba anteriormente buscar exactamente las competencias",
        "start": 1933.0,
        "end": 1937.0
    },
    {
        "text": " ya que no es algo que sea malo tener competición con petidores",
        "start": 1937.0,
        "end": 1942.0
    },
    {
        "text": " nosotros al principio no lo hicimos",
        "start": 1942.0,
        "end": 1945.0
    },
    {
        "text": " y vendíamos nuestro equipo como un instrumento único en el mundo",
        "start": 1945.0,
        "end": 1949.0
    },
    {
        "text": " que no tengan nada similar",
        "start": 1949.0,
        "end": 1951.0
    },
    {
        "text": " y la verdad es que al momento de hacer la búsqueda de competencias",
        "start": 1951.0,
        "end": 1955.0
    },
    {
        "text": " siempre hay algo que es similar que si no es competidor directo",
        "start": 1955.0,
        "end": 1957.0
    },
    {
        "text": " va a ser un competidor indirecto",
        "start": 1957.0,
        "end": 1959.0
    },
    {
        "text": " y tienes que ser capaz de conocerlo para que cuando le vas a vender al cliente",
        "start": 1959.0,
        "end": 1962.0
    },
    {
        "text": " le puedas decir el mío es mejor que este por el que es razón",
        "start": 1962.0,
        "end": 1965.0
    },
    {
        "text": " y al mismo tiempo también para saber cómo funciona sus modelos de negocio",
        "start": 1965.0,
        "end": 1968.0
    },
    {
        "text": " nosotros por ejemplo en Uruguay estamos trabajando con un modelo de negocio",
        "start": 1968.0,
        "end": 1972.0
    },
    {
        "text": " que es venta del equipo sin suscripción",
        "start": 1972.0,
        "end": 1974.0
    },
    {
        "text": " porque veíamos que el mercado no lo permitía",
        "start": 1974.0,
        "end": 1976.0
    },
    {
        "text": " pero en el exterior saber que hay equipos con determinadas similitudes",
        "start": 1976.0,
        "end": 1980.0
    },
    {
        "text": " que están podiendo venderse en un régimen de suscripción con recurrentes",
        "start": 1980.0,
        "end": 1984.0
    },
    {
        "text": " que es lo más recomendado",
        "start": 1984.0,
        "end": 1986.0
    },
    {
        "text": " nos da una buena premisa de que nuestro equipo también puede ser comercial esa manera",
        "start": 1986.0,
        "end": 1990.0
    },
    {
        "text": " y bueno y finalmente por más que parezca obvio o vender",
        "start": 1990.0,
        "end": 1994.0
    },
    {
        "text": " nosotros nos pasaba lo mismo también",
        "start": 1994.0,
        "end": 1997.0
    },
    {
        "text": " los dos queríamos estar continuamente desarrollando el equipo",
        "start": 1997.0,
        "end": 2000.0
    },
    {
        "text": " ser lo que estábamos desarrollando firmware y convirtiendo el equipo",
        "start": 2000.0,
        "end": 2004.0
    },
    {
        "text": " en una mejor herramienta pero al momento de tener que estar llamando todas las semanas al cliente",
        "start": 2004.0,
        "end": 2009.0
    },
    {
        "text": " para preguntarlo si había valorado la propuesta",
        "start": 2009.0,
        "end": 2011.0
    },
    {
        "text": " y si tenía pensado de comprar la herramienta",
        "start": 2011.0,
        "end": 2014.0
    },
    {
        "text": " ya era una discusión de cuál de los dos era que no lo iba a hacer",
        "start": 2014.0,
        "end": 2019.0
    },
    {
        "text": " entonces hay que estar focalizadas del principio en eso",
        "start": 2019.0,
        "end": 2022.0
    },
    {
        "text": " y en lo posible también tratar de dentro del propio emprendimiento",
        "start": 2022.0,
        "end": 2026.0
    },
    {
        "text": " designar roles de que uno sea el que está enfocado más al área de comercialización",
        "start": 2026.0,
        "end": 2031.0
    },
    {
        "text": " y el otro sea la fortuna con la parte de mismas de de operaciones",
        "start": 2031.0,
        "end": 2035.0
    },
    {
        "text": " Bueno esto era todo lo que quería contarles",
        "start": 2035.0,
        "end": 2038.0
    },
    {
        "text": " muchas gracias por ahora nos he escuchado",
        "start": 2038.0,
        "end": 2040.0
    },
    {
        "text": " lo dejamos con esta frase que esto le decía, lo daría a Santos",
        "start": 2040.0,
        "end": 2043.0
    },
    {
        "text": " el profesor Du del Arco en el que solemos trabajar",
        "start": 2043.0,
        "end": 2046.0
    },
    {
        "text": " que Dinaban es el estetocopio del Ficio de la Péuta",
        "start": 2046.0,
        "end": 2049.0
    },
    {
        "text": " es nuestro objetivo convertir a Dinaban en la herramienta completamente necesaria",
        "start": 2049.0,
        "end": 2054.0
    },
    {
        "text": " que no haya un Ficio de la Péuta que sienta que está completo en su Dinaban",
        "start": 2054.0,
        "end": 2058.0
    },
    {
        "text": " y afortunadamente vamos avanzando correctamente por ese camino",
        "start": 2058.0,
        "end": 2062.0
    },
    {
        "text": " muchas gracias",
        "start": 2062.0,
        "end": 2064.0
    },
    {
        "text": " Bueno la frase",
        "start": 2064.0,
        "end": 2067.0
    },
    {
        "text": " una pregunta en la primerísima setapa",
        "start": 2067.0,
        "end": 2072.0
    },
    {
        "text": " cuando recién empezaban a formar un emprendimiento, una presita",
        "start": 2072.0,
        "end": 2078.0
    },
    {
        "text": " ¿Cuáles fueron como las que las dos dificultades más grandes que se enfrentaron?",
        "start": 2078.0,
        "end": 2083.0
    },
    {
        "text": " ¿Cuáles fueron?",
        "start": 2083.0,
        "end": 2085.0
    },
    {
        "text": " ¿Qué pasaron?",
        "start": 2085.0,
        "end": 2086.0
    },
    {
        "text": " ¿No?",
        "start": 2086.0,
        "end": 2087.0
    },
    {
        "text": " Imagino yo que terminando el proyecto de lado y diciendo",
        "start": 2087.0,
        "end": 2090.0
    },
    {
        "text": " queremos armar algo a partir de esto",
        "start": 2090.0,
        "end": 2093.0
    },
    {
        "text": " Claro, sí, como que una de las dificultades más grandes que tuvimos",
        "start": 2093.0,
        "end": 2099.0
    },
    {
        "text": " que querer tener una empresa sin saber cómo tener una empresa",
        "start": 2099.0,
        "end": 2103.0
    },
    {
        "text": " o sea, no es lo mismo decir, bueno voy a formar una empresa",
        "start": 2103.0,
        "end": 2106.0
    },
    {
        "text": " que decir, bueno voy a formar una sociedad por las acciones simplificadas",
        "start": 2106.0,
        "end": 2110.0
    },
    {
        "text": " que va a estar aportando tanta plata de G.I. y donde ambos socios tengan",
        "start": 2110.0,
        "end": 2115.0
    },
    {
        "text": " determinados pagos que hacer mensualmente",
        "start": 2115.0,
        "end": 2118.0
    },
    {
        "text": " ahí fue donde nosotros tuvimos la suerte de contar con el apoyo de las incubadoras",
        "start": 2118.0,
        "end": 2122.0
    },
    {
        "text": " por eso es lo que recomendamos mucho",
        "start": 2122.0,
        "end": 2124.0
    },
    {
        "text": " y a esas incubadoras a comenzar el proyecto",
        "start": 2124.0,
        "end": 2128.0
    },
    {
        "text": " que supieron guiar correctamente en esos eventos, saber elegir el tipo de empresa",
        "start": 2128.0,
        "end": 2132.0
    },
    {
        "text": " que sea necesaria para pagar lo mínimo posible cuando no tiene plata básicamente",
        "start": 2132.0,
        "end": 2138.0
    },
    {
        "text": " y bueno, yo otro desafío grande que nosotros tuvimos fue lo que sería básicamente",
        "start": 2138.0,
        "end": 2143.0
    },
    {
        "text": " un resumen del Canvas o sea, saber identificar correctamente para nuestro equipo",
        "start": 2143.0,
        "end": 2147.0
    },
    {
        "text": " cómo venderse lo y a qué clientes, ya que nosotros dáramos los dos de la rama electrónica",
        "start": 2147.0,
        "end": 2152.0
    },
    {
        "text": " teníamos muy claro cómo quería como que fuera el instrumento de los del punto vista",
        "start": 2152.0,
        "end": 2156.0
    },
    {
        "text": " de Harry Software, cómo queríamos que se viera y cómo vamos a mejorar los componentes",
        "start": 2156.0,
        "end": 2161.0
    },
    {
        "text": " pero teníamos que saber también cómo comercializarlo",
        "start": 2161.0,
        "end": 2164.0
    },
    {
        "text": " y bueno, esa era nuestra rama de híbil en ese momento",
        "start": 2164.0,
        "end": 2168.0
    },
    {
        "text": " un poco agregando a lo que venía diciendo Jorge",
        "start": 2168.0,
        "end": 2173.0
    },
    {
        "text": " cuando nosotros en las primeras etapas",
        "start": 2173.0,
        "end": 2175.0
    },
    {
        "text": " que éramos tres que después uno de los socios se abrió",
        "start": 2175.0,
        "end": 2181.0
    },
    {
        "text": " y bueno y como emprendedor tenés que saber hacer todo",
        "start": 2181.0,
        "end": 2185.0
    },
    {
        "text": " contabilidad redes sociales, seleccionar segmentos de mercado, llamar al cliente,",
        "start": 2185.0,
        "end": 2192.0
    },
    {
        "text": " desarrollo de dejar oar meter código en el software todo",
        "start": 2192.0,
        "end": 2199.0
    },
    {
        "text": " entonces bueno, ahí es que la incubadora en las primeras etapas",
        "start": 2199.0,
        "end": 2204.0
    },
    {
        "text": " tanto en asesoramiento contable como en las legales",
        "start": 2204.0,
        "end": 2208.0
    },
    {
        "text": " fueron los que más frutos les hagamos en nuestro caso",
        "start": 2208.0,
        "end": 2212.0
    },
    {
        "text": " bien, pregunta Marcelo en el chat",
        "start": 2212.0,
        "end": 2216.0
    },
    {
        "text": " dice no me queda muy claro cómo funciona la incubadora",
        "start": 2216.0,
        "end": 2219.0
    },
    {
        "text": " es algo que hay que pagar o cobran un cierto procedente de las ganancias",
        "start": 2219.0,
        "end": 2224.0
    },
    {
        "text": " hay distintos tipos de incubadora, por ejemplo la incubadora",
        "start": 2224.0,
        "end": 2229.0
    },
    {
        "text": " que tuvimos en primera instancia que fue incubo el electro",
        "start": 2229.0,
        "end": 2232.0
    },
    {
        "text": " fue por un proceso de selección",
        "start": 2232.0,
        "end": 2235.0
    },
    {
        "text": " vos tenés un proyecto, lo diagramás, contás como es",
        "start": 2235.0,
        "end": 2239.0
    },
    {
        "text": " hacer un informe más o menos y ahí te presentás",
        "start": 2239.0,
        "end": 2244.0
    },
    {
        "text": " presentás unas slides y que si te has seleccionado para la incubación",
        "start": 2244.0,
        "end": 2249.0
    },
    {
        "text": " ya está, ellos te dan esa financiación",
        "start": 2249.0,
        "end": 2254.0
    },
    {
        "text": " y también no te pierden a cambio, hay otro tipo de incubadoras",
        "start": 2254.0,
        "end": 2257.0
    },
    {
        "text": " que bueno van son socios, entonces se llevan un porcentaje de las ganancias",
        "start": 2257.0,
        "end": 2263.0
    },
    {
        "text": " hay otras incubadoras, por ejemplo acá como dijeño",
        "start": 2263.0,
        "end": 2267.0
    },
    {
        "text": " que vos pagas una cuota mensual mínima",
        "start": 2267.0,
        "end": 2271.0
    },
    {
        "text": " que bueno en fin después, o sea, tenés acceso a todos los consultores",
        "start": 2271.0,
        "end": 2277.0
    },
    {
        "text": " la oficina, salva de reuniones y bueno, hay si facturas más de tanta plata",
        "start": 2277.0,
        "end": 2283.0
    },
    {
        "text": " hay esas zapas regalías",
        "start": 2283.0,
        "end": 2286.0
    },
    {
        "text": " claro, por lo general la consulte las incubadoras te cobran",
        "start": 2286.0,
        "end": 2291.0
    },
    {
        "text": " algo despreciable para lo que ofrecen pero suelen cobrar",
        "start": 2291.0,
        "end": 2294.0
    },
    {
        "text": " incubo el electro es un caso excepcional, la verdad no sé si algún caso similar",
        "start": 2294.0,
        "end": 2298.0
    },
    {
        "text": " para el área de software, lo que sí suelen hacer los",
        "start": 2298.0,
        "end": 2302.0
    },
    {
        "text": " los del área de software es suponiendo que no está entiendo ingreso",
        "start": 2302.0,
        "end": 2305.0
    },
    {
        "text": " en el momento para pagar por mes 10 mil pesos, más o menos que lo que sale",
        "start": 2305.0,
        "end": 2310.0
    },
    {
        "text": " que en realidad los negocios de software también por lo menos",
        "start": 2310.0,
        "end": 2313.0
    },
    {
        "text": " que han lo que conozco y lo que hemos podido conversar",
        "start": 2313.0,
        "end": 2316.0
    },
    {
        "text": " al tener la ventaja de que pueden empezar a trabajar como independiente",
        "start": 2316.0,
        "end": 2320.0
    },
    {
        "text": " entre comillas del principio, tienen un pequeño margen como para",
        "start": 2320.0,
        "end": 2324.0
    },
    {
        "text": " estar pagando una oficina y genio justamente le está dando una oficina",
        "start": 2324.0,
        "end": 2328.0
    },
    {
        "text": " por la tercera parte de lo que saldría la oficina más barata en cualquier",
        "start": 2328.0,
        "end": 2331.0
    },
    {
        "text": " otro lado y con todo el extra de los consultores, a las de reuniones,",
        "start": 2331.0,
        "end": 2336.0
    },
    {
        "text": " acceso a muchos eventos, también estamos continuamente siendo invitados",
        "start": 2336.0,
        "end": 2340.0
    },
    {
        "text": " a eventos del área de emprendedurismo y también lo que es muy",
        "start": 2340.0,
        "end": 2344.0
    },
    {
        "text": " importante tener en cuenta es el área de una gestión del emprendimiento",
        "start": 2344.0,
        "end": 2349.0
    },
    {
        "text": " para presentarse a los fondos de emprendedurismo, por ejemplo capital",
        "start": 2349.0,
        "end": 2353.0
    },
    {
        "text": " semilla, el objetivo por el que gran mayoría se presenta a una incubadora",
        "start": 2353.0,
        "end": 2358.0
    },
    {
        "text": " es para ser seleccionado a un capital semilla y ahí tener los fondos",
        "start": 2358.0,
        "end": 2361.0
    },
    {
        "text": " con lo que va a poder sobrevivir el emprendimiento en sus primeros años.",
        "start": 2361.0,
        "end": 2365.0
    },
    {
        "text": " Esa esa esoria, las incubadoras, por ejemplo, ingeño,",
        "start": 2365.0,
        "end": 2368.0
    },
    {
        "text": " en Cuba eléctro, el ejecutivo nosotros, tienen mucha experiencia",
        "start": 2368.0,
        "end": 2371.0
    },
    {
        "text": " están fuertemente ligados con lo que son los fondos de Annie",
        "start": 2371.0,
        "end": 2374.0
    },
    {
        "text": " por lo que saben muy bien cómo funciona y cómo tiene que ser la postulación",
        "start": 2374.0,
        "end": 2377.0
    },
    {
        "text": " para que el emprendimiento tenga la mayor posibilidad de éxito",
        "start": 2377.0,
        "end": 2380.0
    },
    {
        "text": " de esas seleccionadas.",
        "start": 2380.0,
        "end": 2381.0
    },
    {
        "text": " Son instituciones patrocinadores, ¿no?",
        "start": 2381.0,
        "end": 2384.0
    },
    {
        "text": " Esa es la otra.",
        "start": 2384.0,
        "end": 2385.0
    },
    {
        "text": " Que te ayudan a presentarte.",
        "start": 2385.0,
        "end": 2388.0
    },
    {
        "text": " Pero está buena, se que comenta en que incuba eléctro,",
        "start": 2388.0,
        "end": 2392.0
    },
    {
        "text": " si seguramente sea de las pocas que no cobran nada.",
        "start": 2392.0,
        "end": 2396.0
    },
    {
        "text": " Claro, sí, sí, la verdad que nosotros sepamos, no hay ninguna otra,",
        "start": 2396.0,
        "end": 2399.0
    },
    {
        "text": " a Andi tiene algunas incubadoras también, pero por lo general,",
        "start": 2399.0,
        "end": 2403.0
    },
    {
        "text": " lo que suele hacer es ofrecer préstamos sin recargo,",
        "start": 2403.0,
        "end": 2406.0
    },
    {
        "text": " pero no es que te esté dando bravo a ti las cosas.",
        "start": 2406.0,
        "end": 2409.0
    },
    {
        "text": " Claro.",
        "start": 2409.0,
        "end": 2410.0
    },
    {
        "text": " Sí, y yo también agregaría el ando-geneficio de la incubadora",
        "start": 2410.0,
        "end": 2414.0
    },
    {
        "text": " es como yo le digo el cello, o sea, como usted decía,",
        "start": 2414.0,
        "end": 2418.0
    },
    {
        "text": " por más que esté pagando algo, o sea, no en el ejecutivo,",
        "start": 2418.0,
        "end": 2421.0
    },
    {
        "text": " pero en ingenio que también es obviamente la de conozco,",
        "start": 2421.0,
        "end": 2424.0
    },
    {
        "text": " por más que pague esa algo, o sea, no entra cualquiera,",
        "start": 2424.0,
        "end": 2427.0
    },
    {
        "text": " y es un mecánismo también como competitivo y donde tenés que demostrar",
        "start": 2427.0,
        "end": 2431.0
    },
    {
        "text": " que tenés que tener ese tamaduré, cierto valor para aportar",
        "start": 2431.0,
        "end": 2436.0
    },
    {
        "text": " y cierto potencial como emprendimiento.",
        "start": 2436.0,
        "end": 2439.0
    },
    {
        "text": " Entonces, que un incubador até acepte también como un cellito,",
        "start": 2439.0,
        "end": 2443.0
    },
    {
        "text": " una validación que hay en externo que se dedica a eso,",
        "start": 2443.0,
        "end": 2446.0
    },
    {
        "text": " de esa manera, apoya tu emprendimiento.",
        "start": 2446.0,
        "end": 2449.0
    },
    {
        "text": " Claro.",
        "start": 2449.0,
        "end": 2450.0
    },
    {
        "text": " Sí, doy.",
        "start": 2450.0,
        "end": 2451.0
    },
    {
        "text": " Y incluso también otro punto de favor,",
        "start": 2451.0,
        "end": 2454.0
    },
    {
        "text": " es que hacen ahora este año,",
        "start": 2454.0,
        "end": 2457.0
    },
    {
        "text": " realizaron muchos talleres sobre distintos tipos, por ejemplo,",
        "start": 2457.0,
        "end": 2462.0
    },
    {
        "text": " valoraciones como comenzar con el pie derecho frente a un inversor,",
        "start": 2462.0,
        "end": 2467.0
    },
    {
        "text": " en el caso de empresas que quieren ya buscar rondas de inversión.",
        "start": 2467.0,
        "end": 2473.0
    },
    {
        "text": " Entonces, tenés que saber cuándo vale tu empresa,",
        "start": 2473.0,
        "end": 2476.0
    },
    {
        "text": " cuándo si te invierte en tanta plata, cuándo porcentaje de tu empresa le va a saber.",
        "start": 2476.0,
        "end": 2483.0
    },
    {
        "text": " Y muchos otros, un porcentaje de retorno de la inversión y muchas otros valores",
        "start": 2483.0,
        "end": 2488.0
    },
    {
        "text": " que bueno, a priori no son triviales.",
        "start": 2488.0,
        "end": 2492.0
    },
    {
        "text": " Claro, sí, hubo comentado con eso también, hace poco,",
        "start": 2492.0,
        "end": 2497.0
    },
    {
        "text": " también hicieron una ronda de inversiones, de inversionistas del exterior.",
        "start": 2497.0,
        "end": 2500.0
    },
    {
        "text": " Nosotros, en el caso fue particular porque los inversiones que estamos teniendo",
        "start": 2500.0,
        "end": 2504.0
    },
    {
        "text": " son directamente de fondos de Annie, de la agencia de nación,",
        "start": 2504.0,
        "end": 2509.0
    },
    {
        "text": " de limitización, innovación, pero se hacen rondas de inversiones con inversionistas",
        "start": 2509.0,
        "end": 2514.0
    },
    {
        "text": " tarcerizados o otras personas que están interesadas con hacer proyectos.",
        "start": 2514.0,
        "end": 2518.0
    },
    {
        "text": " Y ahí es donde es ese yo de estar en la incubadora también funciona mucho.",
        "start": 2518.0,
        "end": 2523.0
    },
    {
        "text": " Bueno, bien, hay una otra pregunta, comentario, algo.",
        "start": 2523.0,
        "end": 2529.0
    },
    {
        "text": " Bueno, para...",
        "start": 2529.0,
        "end": 2536.0
    }
]