[
    {
        "text": " Ahí estamos grabando. Bueno, gente le presentó Andrea Barrios, bienvenida Andrea y de vuelta",
        "start": 0.0,
        "end": 13.76
    },
    {
        "text": " gracias por colaborar con la materia y estaría bueno que usted presente es un poquito abog misma.",
        "start": 13.76,
        "end": 19.96
    },
    {
        "text": " Bueno, buenos días a todos. Bueno, soy Andrea Barrios, soy abogada y docente de legislación de",
        "start": 20.92,
        "end": 29.36
    },
    {
        "text": " Antología Farmacéutica y Procrea intelectual de la Facultad de Química. Bueno, por supuesto,",
        "start": 29.36,
        "end": 35.46
    },
    {
        "text": " del Odelar. Agradecerte mejor que como todos los años la confianza hace 4 años ya que estamos",
        "start": 35.46,
        "end": 44.32
    },
    {
        "text": " colaborando con el curso. Y por lo menos. Por lo menos, ¿no? Igual, para mí es un clasar realmente",
        "start": 44.32,
        "end": 51.08
    },
    {
        "text": " porque como todos los años siempre digo de la cosa más interesante, ese es el trabajo,",
        "start": 51.08,
        "end": 57.0
    },
    {
        "text": " este es un disciplinario y bueno, estos temas tecnológicos a mí me atrapan, pero obviamente",
        "start": 57.0,
        "end": 65.64
    },
    {
        "text": " tienen un componente técnico y un componente jurídico que la única forma de abordarnos es justamente",
        "start": 65.64,
        "end": 73.24000000000001
    },
    {
        "text": " internacionalmente. Así que bueno, realmente un clasar. Y bueno, específicamente les cuento que desde hace unos",
        "start": 73.24,
        "end": 83.56
    },
    {
        "text": " años con Jorge estamos colaborando justamente en brindales a ustedes algunos tips,",
        "start": 83.56,
        "end": 89.84
    },
    {
        "text": " algunas bases de algunos aspectos que tienen que tener en cuenta para que sus negocios sean exitosos,",
        "start": 89.84,
        "end": 96.72
    },
    {
        "text": " considerando y por eso el vídeo que les mandamos, bueno, que en mundo cada día es más desafiante,",
        "start": 96.72,
        "end": 103.96
    },
    {
        "text": " cada vez es más difícil, este es sobre salir en el mercado, cada vez tanto no quienes producen bienes",
        "start": 103.96,
        "end": 113.03999999999999
    },
    {
        "text": " como brindan servicios, buscan, verdad, diferentes maneras de competir y diferentes maneras de obtener",
        "start": 113.03999999999999,
        "end": 122.8
    },
    {
        "text": " ventajas de esa competencia, ventaja competitiva y para eso el derecho se ha transformado en un",
        "start": 122.8,
        "end": 129.68
    },
    {
        "text": " instrumento en algunas áreas y vamos a ver que el derecho da algunas soluciones que pueden ser",
        "start": 129.68,
        "end": 138.0
    },
    {
        "text": " relevantes para el negocio del software y otras que no que de repente son relevantes para otras",
        "start": 138.0,
        "end": 145.24
    },
    {
        "text": " áreas de la tecnología y de repente no les da específicamente una respuesta, por eso",
        "start": 145.24,
        "end": 151.0
    },
    {
        "text": " nos parece importante mostrarles las herramientas que ustedes van a tener acceso en el momento que",
        "start": 151.0,
        "end": 157.8
    },
    {
        "text": " salgan a este mercado, muy pasando ahora sí, siguiente, bueno, el objetivo del módulo es introducirles",
        "start": 157.8,
        "end": 170.28
    },
    {
        "text": " un poquito más a la idea de que el conocimiento es un activo en una empresa y que es de los activos",
        "start": 170.28,
        "end": 180.44
    },
    {
        "text": " más presiados en las empresas y por supuesto en tecnología de las cosas que tienen mayor valor y bueno,",
        "start": 180.44,
        "end": 187.64
    },
    {
        "text": " lo primero, el primer objetivo que tenemos es que ustedes comprendan que el conocimiento es un bien,",
        "start": 187.64,
        "end": 193.32
    },
    {
        "text": " que es un bien que es transable y que una vez que se genera el sed bien, verdad, es importante en",
        "start": 193.32,
        "end": 203.36
    },
    {
        "text": " todo ese ciclo de generación y hasta su transferencia, así es que se va a transferir, bueno, ¿cómo se",
        "start": 203.36,
        "end": 210.12
    },
    {
        "text": " protege cómo se gestiona de una manera eficiente? Por otro lado, estuviera las herramientas de",
        "start": 210.12,
        "end": 217.4
    },
    {
        "text": " propiedad electoral por eso el video, el video solamente les presentaba tres de las herramientas,",
        "start": 217.4,
        "end": 222.84
    },
    {
        "text": " vamos a ver que algunas otras y bueno, ¿y cómo esas herramientas de propiedad electoral ayudan",
        "start": 222.84,
        "end": 230.16
    },
    {
        "text": " colaborar en esas estrategias de competitividad de las empresas? Y por último, analizar algunas",
        "start": 230.16,
        "end": 236.28
    },
    {
        "text": " recomendaciones que son específicas para las empresas de software, porque bueno,",
        "start": 236.28,
        "end": 241.4
    },
    {
        "text": " ustedes saben, todos los sectores de la tecnología tienen particularidades y por lo tanto,",
        "start": 241.4,
        "end": 247.28
    },
    {
        "text": " las estrategias de protección de sus activos van a depender del tipo de activos y del tipo de sector,",
        "start": 247.28,
        "end": 254.44
    },
    {
        "text": " ¿verdad? Entonces es importante, bueno, manejar esas particularidades y ver de esa caja de herramientas",
        "start": 254.44,
        "end": 261.64
    },
    {
        "text": " que el derecho nos da, ¿cuáles son relevantes en cada una de las etapas en que la empresa va a",
        "start": 261.64,
        "end": 268.02
    },
    {
        "text": " transitando? Bien, entonces vamos a empezar simplemente definiendo que el conocimiento es un bien y vamos a",
        "start": 268.02,
        "end": 280.8
    },
    {
        "text": " hablar desde que se genera ese conocimiento a su transferencia, ¿cómo se va transitando? ¿verdad?",
        "start": 280.8,
        "end": 287.12
    },
    {
        "text": " en estas estrategias que yo les venía a hablar. Lo primero es definir lo que es el conocimiento y",
        "start": 287.12,
        "end": 296.6
    },
    {
        "text": " cuando hablamos de conocimiento como bien, como bien activo, ese conocimiento no puede ser otro",
        "start": 296.6,
        "end": 303.6
    },
    {
        "text": " que aquel que se ha aplicado en una empresa, en un sector de actividad, pues no estamos hablando de",
        "start": 303.6,
        "end": 311.12
    },
    {
        "text": " conocimiento científico, no estamos hablando de la respuesta a los fenómenos de la naturaleza,",
        "start": 311.12,
        "end": 318.28000000000003
    },
    {
        "text": " la descripción de lo que existe, sino que estamos hablando de conocimiento que se desarrolla para",
        "start": 318.28000000000003,
        "end": 323.52
    },
    {
        "text": " solucionar un problema técnico concreto, ¿sí? Y esas resoluciones de problemas técnicos",
        "start": 323.52,
        "end": 329.04
    },
    {
        "text": " vemos que se pueden, como por ejemplo, traducir el mejoramiento de productos, el mejoramiento de",
        "start": 329.04,
        "end": 335.84000000000003
    },
    {
        "text": " procesos, el desarrollo de productos, también el desarrollo de procesos nuevos, o incluso de procesos",
        "start": 335.84,
        "end": 341.67999999999995
    },
    {
        "text": " alternativos en nuevas aplicaciones de productos ya conocidos. Estos son definiciones y ejemplos de",
        "start": 341.67999999999995,
        "end": 348.88
    },
    {
        "text": " lo que se considera desde el punto de vista técnico, ¿verdad? este el conocimiento como activo. Y por",
        "start": 348.88,
        "end": 357.03999999999996
    },
    {
        "text": " otro lado, existe también conocimiento que tiene otro objetivo y no es solucionar un problema técnico",
        "start": 357.04,
        "end": 366.04
    },
    {
        "text": " sino diferenciarse en el mercado. Si ustedes recuerdan el video que les hicimos llegar antes,",
        "start": 366.04,
        "end": 372.28000000000003
    },
    {
        "text": " tiene específicamente algunas cuestiones que están relacionadas con la diferenciación.",
        "start": 372.28000000000003,
        "end": 379.56
    },
    {
        "text": " ¿Algún nos acuerda aquí apuntaba?",
        "start": 380.90000000000003,
        "end": 384.68
    },
    {
        "text": " ¿Algún lo vio? Porque pasaron, pudieron barlos.",
        "start": 387.04,
        "end": 396.04
    },
    {
        "text": " Es así.",
        "start": 396.04,
        "end": 399.04
    },
    {
        "text": " Yo lo hice la semana pasada porque pensé que era para la clase anterior y lo que me acuerdo es que",
        "start": 399.04,
        "end": 404.84000000000003
    },
    {
        "text": " habían como tres tipos de uno era como patentar una idea, no me acuerdo de bien como era, pero me",
        "start": 404.84000000000003,
        "end": 414.44
    },
    {
        "text": " acuerdo que era un diseño porque con las últimas como un logo, después lo otro era, no me acuerdo",
        "start": 414.44,
        "end": 423.32
    },
    {
        "text": " si era lo mismo, porque había algo diseño industrial, creo que decía, y la tercera no me acuerdo.",
        "start": 423.32,
        "end": 430.16
    },
    {
        "text": " Es una diferencia en diferencia. Claro, claro. Cuando tú quieres diferenciar en el mercado, lo que",
        "start": 430.16,
        "end": 438.88
    },
    {
        "text": " quieres hacer es lograr que el producto tuyo sea distintivo y hay una finalidad con, es justamente",
        "start": 438.88,
        "end": 445.84
    },
    {
        "text": " fidelizar la clienteela. ¿Cómo lo haces? Bueno, lo haces a través de las marcas y ese fue uno",
        "start": 445.84,
        "end": 451.44
    },
    {
        "text": " de los perus puntos que habrá el que te olvidaste de decir. Y lo otro es en relación al diseño.",
        "start": 451.44,
        "end": 457.64
    },
    {
        "text": " El diseño industrial también tiene que dar. En el ejemplo que le ponía el video era una lata,",
        "start": 457.64,
        "end": 464.32
    },
    {
        "text": " una lata común de duevida, le ponía una lata con un diseño especial y también le ponía unos",
        "start": 464.32,
        "end": 470.64
    },
    {
        "text": " dápices del avio que en el mercado se diferenciaban por su marca, pero todos los productos y todos los",
        "start": 470.64,
        "end": 476.88
    },
    {
        "text": " servicios que uno da, verdad, tienen una marca y pueden incluso si son productos tan jibles,",
        "start": 476.88,
        "end": 484.44
    },
    {
        "text": " pueden llegar a tener un diseño industrial, o sea las formas ornamentales de los productos tienen un",
        "start": 484.44,
        "end": 491.8
    },
    {
        "text": " diseño industrial. Por eso es que es tan importante porque digo, la tecnología que está atrás,",
        "start": 491.8,
        "end": 499.0
    },
    {
        "text": " verdad, de los embases y de las formas ornamentales que forman parte de las formas de los productos,",
        "start": 499.0,
        "end": 506.56
    },
    {
        "text": " también es algo importante para lo que es la diferenciación en el mercado y para lograr",
        "start": 506.56,
        "end": 512.16
    },
    {
        "text": " atraer a la clienteela que es lo que quieren todo, todo este empresario. Una consulta con eso.",
        "start": 512.16,
        "end": 519.48
    },
    {
        "text": " Entonces, por ejemplo, la gotillita de Fanta que es como muy característica, no la podría copiar,",
        "start": 519.48,
        "end": 525.32
    },
    {
        "text": " digamos, yo está, no sé si se ha patentado. Sí, patentado con diseño industrial.",
        "start": 525.32,
        "end": 532.36
    },
    {
        "text": " Sí, la forma de las cosas en general, las cosas que tienen una forma particular,",
        "start": 532.36,
        "end": 540.64
    },
    {
        "text": " o sea, nada que sea genérico va a ser patentable porque para ser patentable tiene que ser una forma",
        "start": 540.64,
        "end": 547.12
    },
    {
        "text": " ornamental, singular, verdad, tiene que tener una novedad. En caso de tener novedad van a lograr",
        "start": 547.12,
        "end": 556.12
    },
    {
        "text": " una patente de diseño. También existen las marcas que tienen, que son tribimensionales. La gotilla",
        "start": 556.12,
        "end": 565.92
    },
    {
        "text": " de Coca-Cola, este tal y como la conocemos, la chiquita también, esa ya fue registrada como marca,",
        "start": 565.92,
        "end": 572.44
    },
    {
        "text": " ni siquiera como diseño industrial. Vamos a ver por qué, en un rato, pero sí, básicamente",
        "start": 572.44,
        "end": 581.32
    },
    {
        "text": " eso. Entonces, el conocimiento que yo, de alguna manera, les estaba planteando, lo que viene a dar acá",
        "start": 581.32,
        "end": 587.6400000000001
    },
    {
        "text": " es justamente activos de dos tipos. Por un lado, activos que están relacionados con la solución",
        "start": 587.6400000000001,
        "end": 594.2800000000001
    },
    {
        "text": " de problemas técnicos y por otro lado, activos dirigidos a diferenciarse en el mercado. Sí,",
        "start": 594.2800000000001,
        "end": 600.0400000000001
    },
    {
        "text": " y yo. Bueno, la duda que me viene con eso de ejemplo de Fonda de Comentad, eso está limitado",
        "start": 600.04,
        "end": 608.56
    },
    {
        "text": " igual al país donde está patentada la idea, ¿no? Es importante que... Sí, quería decirles algo más",
        "start": 608.56,
        "end": 616.28
    },
    {
        "text": " antes de continuar, es que es importante que las ideas no se patentan, lo que se patentan son",
        "start": 616.28,
        "end": 622.88
    },
    {
        "text": " soluciones, que no es lo mismo, porque vamos a verlo en un rato, pero las ideas en general",
        "start": 622.88,
        "end": 629.72
    },
    {
        "text": " está de alguna manera segura o a nivel constitucional la libre verdad circulación de las ideas.",
        "start": 629.72,
        "end": 637.4399999999999
    },
    {
        "text": " Entonces, la idea como tal no puede ser protegida, lo que es protegida es la forma en que yo resuelvo",
        "start": 637.4399999999999,
        "end": 645.96
    },
    {
        "text": " un problema, ¿verdad? La solución a ese problema técnico, pero no la idea. Se entiende la",
        "start": 645.96,
        "end": 653.6
    },
    {
        "text": " diferencia, por eso no está bien decir que se patenta una idea, lo que se patenta es una solución",
        "start": 653.6,
        "end": 659.2800000000001
    },
    {
        "text": " de engológica, ¿no? Esto simplemente son algunas cuestiones técnicas, pero me parece",
        "start": 659.2800000000001,
        "end": 665.76
    },
    {
        "text": " importante, si ustedes están en facos de ingeniería, todos me imagino, digo, como ingenieros",
        "start": 665.76,
        "end": 671.72
    },
    {
        "text": " tienen que saber, las ideas no son protegibles, la única forma de proteger una idea es",
        "start": 671.72,
        "end": 677.28
    },
    {
        "text": " consecreto, o sea, solo si yo no quiero que alguien sepa que tenga una idea, lo mejor que",
        "start": 677.28,
        "end": 684.76
    },
    {
        "text": " puedo hacer es no contársela nada, sí, ya no. Esto es también, o sea, por esto es porque",
        "start": 684.76,
        "end": 693.0400000000001
    },
    {
        "text": " con lo que hay más de una solución al mismo problema, porque si hubiera una idea que se",
        "start": 694.28,
        "end": 700.6
    },
    {
        "text": " pueda patentar con el primero que la solución, ya está. Es así, exactamente por esa razón, y me",
        "start": 700.6,
        "end": 708.48
    },
    {
        "text": " encanta que lo haya dicho, porque realmente me da cuenta que comprendiste el concepto, es",
        "start": 708.48,
        "end": 714.6800000000001
    },
    {
        "text": " exactamente por eso. Hay una pregunta, Andrea en el chat, te la digo, ¿sí dale? Y se desarrollar un",
        "start": 714.6800000000001,
        "end": 722.16
    },
    {
        "text": " producto que te permite diferenciarte en el mercado, en qué categoría cae. Cuando desarrollas un",
        "start": 722.16,
        "end": 729.84
    },
    {
        "text": " producto, ¿a qué te referís? ¿Te referís al diseño al aspecto morfológico o al producto,",
        "start": 729.84,
        "end": 735.72
    },
    {
        "text": " en sí? Porque la diferenciación, para mí, está en la morfología del producto y en la marca.",
        "start": 735.72,
        "end": 743.1600000000001
    },
    {
        "text": " Imagino que debe referirse a un producto de sojo, ¿no? Bueno, el producto en sí, la solución",
        "start": 743.1600000000001,
        "end": 749.64
    },
    {
        "text": " tecnológica está en la parte de resolución de problemas técnicos, la parte morfológica que",
        "start": 749.64,
        "end": 755.96
    },
    {
        "text": " puedes tener en songueres, la marca, y podría eventualmente discutirse una patente de diseño",
        "start": 755.96,
        "end": 763.0
    },
    {
        "text": " en la parte gráfica. Pero bueno, ahí había que ver este estadón. Ahora, el código fuente,",
        "start": 763.0,
        "end": 773.36
    },
    {
        "text": " desde mi punto de vista, siempre va a ser una resolución de problema técnico. Y vamos a ver que en",
        "start": 773.36,
        "end": 779.76
    },
    {
        "text": " algunos países eso es patentable y en otros no, pero lo vemos en un rato, si no digo toda la",
        "start": 779.76,
        "end": 786.3199999999999
    },
    {
        "text": " clase en esta día, porque a veces... A veces me pasa eso. Pero me encanta que se animen a preguntar",
        "start": 786.3199999999999,
        "end": 793.48
    },
    {
        "text": " porque realmente me sé que hacen más dinámica la clase y a mí me reivierte. Bueno, entonces",
        "start": 793.48,
        "end": 799.96
    },
    {
        "text": " le decía el conocimiento, termina siendo un bien, o sea, algo que en realidad se supone, ¿verdad?",
        "start": 799.96,
        "end": 808.32
    },
    {
        "text": " o se espera que sea algo transmisible en forma libre, deja de tener sentido que se transmita el",
        "start": 808.32,
        "end": 815.0
    },
    {
        "text": " forma libre cuando ese conocimiento, ¿verdad? Es útil para que alguien se diferencia en el",
        "start": 815.0,
        "end": 820.76
    },
    {
        "text": " mercado para que alguien tenga un nuevo producto. Entonces, el problema y el drama que tiene el conocimiento",
        "start": 820.76,
        "end": 828.0
    },
    {
        "text": " como bien es justamente el uso, no rival, ¿qué significa este concepto de uso, no rival? Es un",
        "start": 828.0,
        "end": 837.24
    },
    {
        "text": " concepto que viene del economía. Cuando yo tengo un bien que es tan gible, o sea, no sé,",
        "start": 837.24,
        "end": 843.68
    },
    {
        "text": " hablemos de mi celular, ¿vale? Bueno, no sé si lo están viendo porque con el fondo no sé si te",
        "start": 843.68,
        "end": 849.04
    },
    {
        "text": " ve, pero todos saben lo que son celulares. Este celular, ¿vale? Mientras yo no estoy usando impido que el",
        "start": 849.04,
        "end": 857.48
    },
    {
        "text": " resto del planeta lo use, ¿sí? Entonces lo que ocurre con bien es tan gibles es que una vez que yo",
        "start": 857.48,
        "end": 864.8399999999999
    },
    {
        "text": " me apropio de un bien tan gible, el resto del planeta no lo puede usar. Resonó pasa con el conocimiento.",
        "start": 864.8399999999999,
        "end": 871.28
    },
    {
        "text": " El drama que plantea los economistas como la falla de mercado y es que el conocimiento lo pueden usar",
        "start": 871.28,
        "end": 878.8399999999999
    },
    {
        "text": " muchas personas al mismo tiempo sin evitar, ¿verdad? Que una que la otra le use, ¿vale? Y esto,",
        "start": 878.84,
        "end": 887.84
    },
    {
        "text": " verdad, es lo que genera, verdad, la necesidad de que el derecho de una respuesta. Entonces, el",
        "start": 887.84,
        "end": 897.6800000000001
    },
    {
        "text": " derecho como uno de los mecanismos de apropiación de ese conocimiento. Vamos a ver que hay otros. Entonces,",
        "start": 897.6800000000001,
        "end": 906.36
    },
    {
        "text": " fíjense esa necesidad de apropiación determina que se tengan que desarrollar mecanismos para",
        "start": 906.92,
        "end": 915.52
    },
    {
        "text": " para esa apropiación. Esa apropiación que está normal, yo me pongo esta camisa y no la puedo usar",
        "start": 915.52,
        "end": 921.64
    },
    {
        "text": " Belém, Belém no puedo usar esta camisa raya. Se puede comprar la misma, pero no, o sea, la misma",
        "start": 921.64,
        "end": 926.72
    },
    {
        "text": " en un pomo de lo, pero no usar la misma camisa. La estoy usando yo, Belém, o la puedo usar, ¿sí?",
        "start": 926.72,
        "end": 933.04
    },
    {
        "text": " O Belém porque la tengo ahí. Andrea, una pregunta, pregunta sí, para eso existe un sistema de",
        "start": 933.04,
        "end": 940.92
    },
    {
        "text": " patentes encargado de hacer o valer esa propiedad de conocimiento. Bueno, eso vamos, eso vamos sí,",
        "start": 940.92,
        "end": 947.24
    },
    {
        "text": " es específicamente eso, pero vamos a ver que hay otros mecanismos y a mí me interesa en software",
        "start": 947.24,
        "end": 952.4399999999999
    },
    {
        "text": " específicamente que vean todos los mecanismos, porque lo bueno que tiene este sector es que han usado",
        "start": 952.4399999999999,
        "end": 959.04
    },
    {
        "text": " todos los mecanismos, es de las cosas que más me gustan del sector. No sé qué da solamente",
        "start": 959.04,
        "end": 963.88
    },
    {
        "text": " con la propia intelectual, como el único mecanismo que de alguna manera les asegura la apropiación,",
        "start": 963.88,
        "end": 969.04
    },
    {
        "text": " ¿no? Pero sí, es cierto, la patentes es una de las maneras. Entonces, ¿cómo les decía?",
        "start": 969.04,
        "end": 975.0
    },
    {
        "text": " Existen distintos mecanismos para apropiarse. Uno de ellos son los mecanismos directos del propio",
        "start": 975.0,
        "end": 981.5999999999999
    },
    {
        "text": " mercado, o sea, si yo estoy en un mercado donde la tecnología que estoy manejando",
        "start": 981.5999999999999,
        "end": 989.0
    },
    {
        "text": " desde punta y nadie más la puede replicar porque no tiene, bueno, no tienen las capacidades, o no",
        "start": 989.0,
        "end": 997.88
    },
    {
        "text": " tiene la infraestructura para llevarla adelante, es el propio mercado que está regulando mi",
        "start": 997.88,
        "end": 1005.72
    },
    {
        "text": " apropiación. No soy yo, ¿sí entiendo esto? Esto le puede pasar a la NASA, por ejemplo, con algunas",
        "start": 1005.72,
        "end": 1012.68
    },
    {
        "text": " cuestiones que unos proyectos que ellos hacen, hay proyectos que solamente los pueden replicar,",
        "start": 1012.68,
        "end": 1018.68
    },
    {
        "text": " ¿verdad? Estruturas similares. Estoy poniendo un ejemplo, pero, digo, hay montones y en un",
        "start": 1018.68,
        "end": 1025.1599999999999
    },
    {
        "text": " urbaya hay muchos también, porque nosotros no tenemos tecnología de punta en todas las áreas.",
        "start": 1025.1599999999999,
        "end": 1029.56
    },
    {
        "text": " Eso tenía un paso. Pero bueno, en ese caso yo no estoy dejando el hidado al mercado y es una",
        "start": 1030.6799999999998,
        "end": 1035.8
    },
    {
        "text": " decisión como empresario, no hacer nada, decir, bueno, el mercado me protege porque mis competidores",
        "start": 1035.8,
        "end": 1041.72
    },
    {
        "text": " no están a mi nivel, eso puede cambiar. Luego tengo mecanismos tecnológicos. Acá es cuando yo,",
        "start": 1041.72,
        "end": 1049.16
    },
    {
        "text": " en el propio producto que desarrollo, le introdujo algún tipo de barrera tecnológica, esto ocurre mucho",
        "start": 1049.16,
        "end": 1057.8
    },
    {
        "text": " en software y en hardware. Yo, acá es cuando yo le introdujo algún mecanismo que controles que el",
        "start": 1057.8,
        "end": 1066.84
    },
    {
        "text": " producto se utilice, como yo digo, que se tiene que introduzque, que utilizar. Es el caso, por",
        "start": 1066.84,
        "end": 1074.1999999999998
    },
    {
        "text": " ejemplo, del tema de las licencias, cuando yo entengo alguna licencia de software y está",
        "start": 1074.1999999999998,
        "end": 1080.28
    },
    {
        "text": " lesco en el código alguna, algún mecanismo para que en caso de que esa licencia sea violada,",
        "start": 1080.28,
        "end": 1086.6799999999998
    },
    {
        "text": " por ejemplo, es una licencia para un uso, bueno, este que en sistema me avise, verdad de alguna forma,",
        "start": 1086.6799999999998,
        "end": 1094.6
    },
    {
        "text": " que fue violado ese, ese, esa licencia. No han pasado últimamente muchas veces, me han consultado",
        "start": 1094.6,
        "end": 1104.32
    },
    {
        "text": " muchas veces sobre todo arquitecto, esto es un hubo, así le digo, tuve cuatro casos este año de arquitecto,",
        "start": 1104.32,
        "end": 1110.8
    },
    {
        "text": " se ve que los, los dueños de, de las licencias de software, de, de varios programas, pues son",
        "start": 1110.8,
        "end": 1118.6
    },
    {
        "text": " varios, no son los mismos, este, están controlando esto otra vez de mediante tecnológicas.",
        "start": 1118.6,
        "end": 1123.8799999999999
    },
    {
        "text": " Bueno, esa es una manera, la propia intelectual que es otra manera y entre ellas la paténtesis,",
        "start": 1126.4399999999998,
        "end": 1132.28
    },
    {
        "text": " uno de los instrumentos, vamos a ver que hay más y después formas contractuales, es decir, cuando yo",
        "start": 1132.28,
        "end": 1138.04
    },
    {
        "text": " realmente lo que hago es convenir con este, verdad, mis proveedores o con mis empleados o con",
        "start": 1138.04,
        "end": 1148.0
    },
    {
        "text": " los consultores que trabajan conmigo, acuerdos de confidencialidad, verdad, que de alguna manera me",
        "start": 1148.0,
        "end": 1153.6399999999999
    },
    {
        "text": " aseguran que, de confidencialidad y no competencia, que me aseguran de que, quienes tengan acceso,",
        "start": 1153.6399999999999,
        "end": 1159.12
    },
    {
        "text": " mi conocimiento, no lo pueden replicar. Básicamente, esas son algunas de las maneras de los",
        "start": 1159.12,
        "end": 1165.56
    },
    {
        "text": " mecanismos que existen, podrían existir otros, podrían generarse otros, obviamente, y bueno,",
        "start": 1165.56,
        "end": 1173.6799999999998
    },
    {
        "text": " y por supuesto yo les puse algunos ejemplos dentro de los mecanismos tecnológicos hay cantidad.",
        "start": 1173.6799999999998,
        "end": 1178.08
    },
    {
        "text": " Hay una duda, Andrea, pregunta si en el caso de la NASA, por ejemplo, los gobiernos de otros países,",
        "start": 1178.08,
        "end": 1185.04
    },
    {
        "text": " no tendrían la capacidad de copiar lo que hace la NASA. Bueno, claro, ese es justamente el",
        "start": 1185.04,
        "end": 1191.12
    },
    {
        "text": " tema que vos tenés que analizar cuando dejás librado en tema de la propiación del conocimiento al",
        "start": 1191.12,
        "end": 1198.8
    },
    {
        "text": " mercado. Cuando volvemos al gas librado así, no es el caso de la NASA, la NASA es de los que patentan",
        "start": 1198.8,
        "end": 1204.6399999999999
    },
    {
        "text": " más, ellos tienen todo tipo de mecanismos, tienen proyectos confidenciales, tienen, o sea,",
        "start": 1204.6399999999999,
        "end": 1211.4399999999998
    },
    {
        "text": " tienen absolutamente todos los mecanismos, utilizan todos los mecanismos y además los combinan, y",
        "start": 1211.4399999999998,
        "end": 1216.4799999999998
    },
    {
        "text": " esto es importante que lo tengas en cuenta, porque estas cosas no se manejan en forma gelada,",
        "start": 1216.48,
        "end": 1221.72
    },
    {
        "text": " no es que yo uso un mecanismo tecnológico, y por lo tanto no uso propiedad intelectual, no, yo",
        "start": 1221.72,
        "end": 1226.96
    },
    {
        "text": " convino cosas, y justamente de las cosas que quisiera que se llevaran de esta clase es que cuando yo",
        "start": 1226.96,
        "end": 1233.0
    },
    {
        "text": " voy a elaborar, verdad, una estrategia de protección de ese conocimiento, porque el considero que",
        "start": 1233.0,
        "end": 1239.08
    },
    {
        "text": " este conocimiento es un bien relevante para la empresa, voy a combinar todo esto, no voy a usar un",
        "start": 1239.08,
        "end": 1246.28
    },
    {
        "text": " solo instrumento, lo voy a combinar y voy a hacer creativo, y la NASA es de los lugares más",
        "start": 1246.28,
        "end": 1252.32
    },
    {
        "text": " interesantes de ver, porque tienen todo tipo de mecanismo, por supuesto, patentan, y por supuesto,",
        "start": 1252.32,
        "end": 1258.6
    },
    {
        "text": " hay espionajes, y por supuesto, pasa de todo, pero es como les digo, yo le puse el ejemplo de la",
        "start": 1258.6,
        "end": 1264.96
    },
    {
        "text": " NASA, porque me pareció un lugar donde hay tecnología de punta que desde un UI sería muy difícil",
        "start": 1264.96,
        "end": 1270.88
    },
    {
        "text": " copiar, eso no significa que los rusos, o los chinos, verrá, o los japoneses, no lo puedan hacer,",
        "start": 1270.88,
        "end": 1277.28
    },
    {
        "text": " lo que digo es desde un UI porque uno va comparando y va diciendo, bueno, desde este lado sí,",
        "start": 1277.28,
        "end": 1282.44
    },
    {
        "text": " desde este lado no, no creo que exista un lugar en el mundo, y por hoy que este excento de",
        "start": 1282.44,
        "end": 1289.64
    },
    {
        "text": " posibilidad de que alguien esté locóquilo, eso es como algo que es endémico, de todas",
        "start": 1289.64,
        "end": 1297.5600000000002
    },
    {
        "text": " maneras quiero decirles, lo voy a hablar de la copia dentro de un rato, porque la copia también",
        "start": 1297.5600000000002,
        "end": 1302.24
    },
    {
        "text": " tiene su valor, bueno, y pasemos un poquito al ciclo de la gestión del conocimiento, más que nada",
        "start": 1302.24,
        "end": 1310.8400000000001
    },
    {
        "text": " para que ustedes, porque lo que me interesa de esto, es que ustedes vean que cuando uno genera",
        "start": 1310.8400000000001,
        "end": 1316.8000000000002
    },
    {
        "text": " cualquier tipo de activo relacionado con el conocimiento, tiene verdad un etapas que se van",
        "start": 1316.8,
        "end": 1325.0
    },
    {
        "text": " cumpliendo, y desde que se inicia, verdad, esa generación del conocimiento desde que yo consigo",
        "start": 1325.0,
        "end": 1331.3999999999999
    },
    {
        "text": " esa idea que, como les dije, no era protegible, verdad, yo tengo que empezar a pensar en la estrategia",
        "start": 1331.3999999999999,
        "end": 1338.56
    },
    {
        "text": " que voy a tener a lo largo de todo el ciclo, desde que genero, me lo apropio, lo valorizo y lo",
        "start": 1338.56,
        "end": 1345.76
    },
    {
        "text": " transfero, lo transfero, o me lo quedo y lo transfero en mi propia empresa a la fase productiva,",
        "start": 1345.76,
        "end": 1351.68
    },
    {
        "text": " bueno, en la etapa de generación del conocimiento, tienen que tener claro que esto puede ocurrir de",
        "start": 1356.16,
        "end": 1364.72
    },
    {
        "text": " varias maneras, acá les puse un par, la empresa puede generar el conocimiento, lo que se dice in-house,",
        "start": 1364.72,
        "end": 1372.64
    },
    {
        "text": " es decir, en el propio empresa, puede tener su propio equipo desarrollador, o puede a su vez",
        "start": 1372.64,
        "end": 1381.64
    },
    {
        "text": " subcontratar desarrollos, o puede incorporar tecnología de terceros, entonces es muy importante",
        "start": 1381.64,
        "end": 1390.76
    },
    {
        "text": " que, desde la etapa de generación del conocimiento, yo tenga claro cómo voy a generarse",
        "start": 1390.76,
        "end": 1396.2800000000002
    },
    {
        "text": " conocimiento, si ese conocimiento lo voy a generar con personal que es dependiente de mi empresa,",
        "start": 1396.28,
        "end": 1403.6
    },
    {
        "text": " si voy a contratar personal dependiente de otra empresa o consultores, o si voy a licenciar",
        "start": 1403.6,
        "end": 1413.32
    },
    {
        "text": " tecnología que voy a utilizar en esos desarrollos, en cualquiera de los tres casos, voy a tener que tener",
        "start": 1413.32,
        "end": 1420.0
    },
    {
        "text": " una base contra actual firme, que quiero decir con esto, cuando yo genero el conocimiento en el",
        "start": 1420.0,
        "end": 1426.12
    },
    {
        "text": " momento que lo estoy generando, quizás no me planteé qué relación tengo con las personas que forman",
        "start": 1426.12,
        "end": 1432.32
    },
    {
        "text": " parte de ese equipo investigador o de ese equipo desarrollador, pero es de las cosas más importantes,",
        "start": 1432.32,
        "end": 1439.0
    },
    {
        "text": " porque, porque mientras yo estoy generando el conocimiento y ese conocimiento todavía no existe,",
        "start": 1439.0,
        "end": 1444.96
    },
    {
        "text": " no tengo ningún problema, pero una vez que el logro generar ese conocimiento, si ese conocimiento",
        "start": 1444.96,
        "end": 1451.52
    },
    {
        "text": " es útil y varioso, seguramente voy a empezar a tener problemas, entonces mi consejo y primer tip",
        "start": 1451.52,
        "end": 1459.3600000000001
    },
    {
        "text": " para esta clase es generer una base contra actual sólido, los empleados de una empresa que están",
        "start": 1459.3600000000001,
        "end": 1467.44
    },
    {
        "text": " en régimen del derecho del trabajo, es decir que están en planillas de trabajo, y que fueron",
        "start": 1467.44,
        "end": 1473.68
    },
    {
        "text": " contratados para desarrollar por una empresa, todo lo que desarrollen le pertenece a la empresa,",
        "start": 1473.68,
        "end": 1480.24
    },
    {
        "text": " 0-3, si esa persona es un empleado, ahora si el equipo investigador o desarrollador está",
        "start": 1480.24,
        "end": 1489.66
    },
    {
        "text": " subcontratado con contratos de arrendamientos de servicio, que es muy común en la industria del software,",
        "start": 1491.14,
        "end": 1497.76
    },
    {
        "text": " tengo que asegurarme que sus contratos tengan cláusulas de propia intelectual que aseguren la",
        "start": 1498.24,
        "end": 1505.08
    },
    {
        "text": " transferencia de esos resultados, de esa consultoria o de ese rendamiento de servicios o rendamiento",
        "start": 1505.08,
        "end": 1512.08
    },
    {
        "text": " de obras que yo estoy firmando en relación a la empresa original que es la que encarga el",
        "start": 1512.08,
        "end": 1518.52
    },
    {
        "text": " desarrollo, me siguen, ¿se están entendiendo?",
        "start": 1518.52,
        "end": 1521.6
    },
    {
        "text": " No es en el estilo, primero que mencionaste sería in-house, in-house es cuando yo decido hacer el",
        "start": 1521.6,
        "end": 1530.76
    },
    {
        "text": " desarrollo adentro de mi empresa, eso lo puedo hacer tanto con empleados propios como con empleados",
        "start": 1530.76,
        "end": 1539.56
    },
    {
        "text": " contratados, o sea empleados, mejor dicho con empresas contratadas, pero también puedo encargarle",
        "start": 1539.56,
        "end": 1548.24
    },
    {
        "text": " el trabajo en tercero, entonces en realidad cuando hablamos de el desarrollo in-house, el",
        "start": 1548.36,
        "end": 1557.4
    },
    {
        "text": " desarrollo in-house se da cuando el proyecto lo tengo adentro del empresa, la su contratación de",
        "start": 1557.4,
        "end": 1563.6
    },
    {
        "text": " desarrollo es cuando yo lo mando hacer afuera, pero en el momento en que yo hago un desarrollo in-house",
        "start": 1563.6,
        "end": 1573.28
    },
    {
        "text": " también puedo contratar gente que no sea en relación de dependencia y ahí es importante que existan",
        "start": 1573.28,
        "end": 1580.52
    },
    {
        "text": " contratos y que esos contratos establezcan cláusulas de propia intelectual bien claras.",
        "start": 1580.52,
        "end": 1585.44
    },
    {
        "text": " Y eso sería lo que por ejemplo, vos trabajas para la empresa, lo que vos ases para esa empresa es",
        "start": 1586.48,
        "end": 1593.76
    },
    {
        "text": " propiedad de la empresa.",
        "start": 1593.76,
        "end": 1594.84
    },
    {
        "text": " Sí, también.",
        "start": 1594.84,
        "end": 1596.84
    },
    {
        "text": " Sí, sí, sí.",
        "start": 1596.84,
        "end": 1597.84
    },
    {
        "text": " Te quedo claro. Y bueno, y después por otro lado, cuando yo compro la tecnología de hecha,",
        "start": 1597.84,
        "end": 1603.76
    },
    {
        "text": " tengo que asegurarme tener la licencia, más si la voy a usar en desarrollo propio, no",
        "start": 1603.76,
        "end": 1611.04
    },
    {
        "text": " de desarrollo para tercero, y es importante estudiar los alcances de las licencias de tecnología.",
        "start": 1611.04,
        "end": 1617.9199999999998
    },
    {
        "text": " Por eso, yo les digo siempre cuando estoy empezando a desarrollar algo, si voy a usar plataformas,",
        "start": 1618.92,
        "end": 1626.04
    },
    {
        "text": " tengo que asegurarme que esas plataformas me permitan el uso que yo les doy dan. Y para eso,",
        "start": 1626.04,
        "end": 1632.4
    },
    {
        "text": " lamentablemente, muchos chachos hay que leer. Y hay gente que no le gusta leer. Yo,",
        "start": 1632.4,
        "end": 1638.92
    },
    {
        "text": " namento, digo, tienen que leer. Y si no lo leen ustedes, saben que alguien lo lea.",
        "start": 1638.92,
        "end": 1643.44
    },
    {
        "text": " Se los digo porque tengo montón de clientes de software que me piden que lea la licencia",
        "start": 1644.44,
        "end": 1649.8400000000001
    },
    {
        "text": " a yo. Ningún problema, yo las leo. Pero lo que quiero decirles es que alguien les tiene que",
        "start": 1649.8400000000001,
        "end": 1655.0
    },
    {
        "text": " analizar los contratos y si no son ustedes, mire que se entienden perfectamente los contratos,",
        "start": 1655.0,
        "end": 1659.6000000000001
    },
    {
        "text": " no requieren una especialización particular, pero es muy importante leer los contratos,",
        "start": 1659.6000000000001,
        "end": 1665.28
    },
    {
        "text": " porque yo ya me ha pasado en varias oportunidades desarrollos realmente interesantes que, bueno,",
        "start": 1665.28,
        "end": 1672.48
    },
    {
        "text": " no pudieron enagenerse, no pudieron transferirse porque no se contaba con las licencias,",
        "start": 1672.48,
        "end": 1677.3600000000001
    },
    {
        "text": " porque se trabajó sobre versiones, verdad, que sobre licencias que no permitían el desarrollo.",
        "start": 1677.3600000000001,
        "end": 1684.8
    },
    {
        "text": " Una duda pregunta que esa parte de licencia de tecnología, visto desde la empresa esa que lo",
        "start": 1687.8,
        "end": 1695.44
    },
    {
        "text": " vende sería transferencia. Sí, claro, que transfieren para vos, la licencia de tecnología es",
        "start": 1695.44,
        "end": 1702.2
    },
    {
        "text": " una transferencia, es una forma en que la empresa se nutre de tecnología. Por supuesto que a su",
        "start": 1702.2,
        "end": 1710.76
    },
    {
        "text": " vez la empresa la utiliza en sus desarrollos propios, pero sí, claro, el ejemplo que les iba a poner,",
        "start": 1710.76,
        "end": 1717.44
    },
    {
        "text": " miren, Google Earth para ponerles un caso, un caso que es conocido por todo el mundo, yo",
        "start": 1717.44,
        "end": 1724.88
    },
    {
        "text": " tuve un caso de un desarrollo de software, una empresa de desarrollo un software que les",
        "start": 1724.88,
        "end": 1730.88
    },
    {
        "text": " interesaba a la UTI, y ese desarrollo, yo no les puedo contar mucho más, pero obviamente que es un",
        "start": 1730.88,
        "end": 1738.24
    },
    {
        "text": " caso, ese desarrollo necesitaba la georeferenciación de Google Earth y funcionaba espectacular la UTI que",
        "start": 1738.24,
        "end": 1748.4
    },
    {
        "text": " se le encantaba. En el momento en que se iba a hacer el contrato, los agado de UTI le pidieron",
        "start": 1748.4,
        "end": 1754.44
    },
    {
        "text": " a la empresa que le mostraran las licencias de todos los sistemas informáticos que se utilizaban",
        "start": 1754.44,
        "end": 1761.16
    },
    {
        "text": " dentro de lo que era esa aplicación. Ahí fue cuando apareció, entonces ellos no estaban dispuestos",
        "start": 1761.16,
        "end": 1768.24
    },
    {
        "text": " a salir todo lo que había usado y yo me leí, miren, leí como 17 contratos de licencia y de los",
        "start": 1768.24,
        "end": 1775.88
    },
    {
        "text": " 17 contratos de licencia, creo que había cuatro nada más que les permitían desarrollar. El resto",
        "start": 1775.88,
        "end": 1782.2800000000002
    },
    {
        "text": " eran para desarrollos no comerciales, por lo tanto, una vez que ellos transferían la tecnología,",
        "start": 1782.2800000000002,
        "end": 1788.4
    },
    {
        "text": " tenían que encontrar la manera de negociar con todos esas contra partes que habían utilizado",
        "start": 1788.4,
        "end": 1794.72
    },
    {
        "text": " esas plataformas, ¿entienden? Bien, por otro lado les decía, a veces las empresas no desarrollan",
        "start": 1794.72,
        "end": 1803.92
    },
    {
        "text": " en house, a veces se asocian a la universidad, entonces también es interesa a la universidad",
        "start": 1803.92,
        "end": 1812.16
    },
    {
        "text": " a que está ingeniería o a cualquier otro centro de investigación. En esos casos, digo, uno tiene",
        "start": 1812.16,
        "end": 1818.96
    },
    {
        "text": " que desde el principio, ¿verdad? Selebrar contratos donde quede claramente estipulado, donde están",
        "start": 1818.96,
        "end": 1827.1200000000001
    },
    {
        "text": " los aportes, o sea, cuales son las aportes de cada una de las partes y sobre todo cómo se comparten",
        "start": 1827.1200000000001,
        "end": 1833.0
    },
    {
        "text": " los resultados. Y lo mismo pasa a la universidad, como les decía, también tiene líneas de investigación",
        "start": 1833.0,
        "end": 1839.52
    },
    {
        "text": " y en house, también tienen proyectos que son de la propia universidad y también deberían",
        "start": 1839.52,
        "end": 1846.52
    },
    {
        "text": " ir a este trabajo dentro de lo que es la universidad tener en cuenta todo esto. ¿Por qué les digo esto?",
        "start": 1846.52,
        "end": 1852.12
    },
    {
        "text": " Porque mientras uno desarrolla dentro de la universidad de la República como estudiante,",
        "start": 1852.12,
        "end": 1859.28
    },
    {
        "text": " o como docente, o como investigador, está protegido por todas las excepciones de las leyes de",
        "start": 1859.28,
        "end": 1866.0
    },
    {
        "text": " propia intelectual, excepciones que están relacionadas con la investigación científica,",
        "start": 1866.0,
        "end": 1871.08
    },
    {
        "text": " con la docencia, con el acceso a la información. Pero una vez que yo ese desarrollo lo termino,",
        "start": 1871.08,
        "end": 1878.9199999999998
    },
    {
        "text": " por ejemplo, ya me se proyectó el fin de carrera, lo sé si le suena, mientras sí se proyectó el",
        "start": 1878.9199999999998,
        "end": 1884.52
    },
    {
        "text": " fin de carrera, yo estoy protegido y puedo usar y copiar y hacer todo lo que quiere. Ahora, una vez",
        "start": 1884.52,
        "end": 1891.1599999999999
    },
    {
        "text": " que tengo el resultado bien resultado está bueno y lo quiero usar y ya dejé de ser estudiante,",
        "start": 1891.1599999999999,
        "end": 1896.76
    },
    {
        "text": " ya dejé de ser investigador y eso pasa una empresa y la empresa va de alguna manera lucrar con",
        "start": 1896.76,
        "end": 1905.04
    },
    {
        "text": " ese producto, ahí es donde cobra relevancia todo lo que yo les estoy diciendo. Entonces,",
        "start": 1905.04,
        "end": 1910.92
    },
    {
        "text": " estar dentro de la universidad de la República no te exonerá, me tener en cuenta todo esto lo que",
        "start": 1910.92,
        "end": 1916.56
    },
    {
        "text": " estamos hablando, porque si ese producto lo quiere extranferir al sector productivo,",
        "start": 1916.56,
        "end": 1921.92
    },
    {
        "text": " ese producto debería cumplir con los estandarís que yo les estoy diciendo. ¿Entienden?",
        "start": 1922.92,
        "end": 1928.3200000000002
    },
    {
        "text": " Bueno, entiendo que sí porque si no alguien diría que no, este bien. Por otro lado,",
        "start": 1932.4,
        "end": 1938.2
    },
    {
        "text": " este es la universidad también trabaja en asociación con empresas, con otras universidades y con",
        "start": 1938.2,
        "end": 1944.16
    },
    {
        "text": " otros centros de investigación y acá lo recomiendo que si usted está en el lado de la universidad,",
        "start": 1944.16,
        "end": 1949.3600000000001
    },
    {
        "text": " este en claro, quiénes son los socios, o sea cómo me asocio en esta etapa de generación de",
        "start": 1949.7199999999998,
        "end": 1955.12
    },
    {
        "text": " conocimiento, tengo que tener claro con quién me voy a asociar para investigar, ¿qué es lo que me",
        "start": 1955.12,
        "end": 1961.4799999999998
    },
    {
        "text": " va a de alguna manera reclamar o qué es lo que le va a corresponder? Y esto es importante resolverlo",
        "start": 1961.4799999999998,
        "end": 1970.0
    },
    {
        "text": " antes de que los resultados sean un éxito, porque los resultados son un éxito es muy difícil",
        "start": 1970.0,
        "end": 1975.4399999999998
    },
    {
        "text": " ponerse a jugar. En esta etapa de apropiación, se haya generé ese conocimiento, ¿verdad? En esta etapa de",
        "start": 1975.44,
        "end": 1992.44
    },
    {
        "text": " apropiación que ya tengo el conocimiento, creo que en un momento que me escaban de dar cuenta,",
        "start": 1992.44,
        "end": 2001.24
    },
    {
        "text": " tengo que empezar a pensar en una estrategia de protección, ¿por qué tengo que pensar inmediatamente en",
        "start": 2005.44,
        "end": 2023.0800000000002
    },
    {
        "text": " una estrategia de protección? Bueno, tengo que pensar en una estrategia de protección inmediatamente",
        "start": 2023.0800000000002,
        "end": 2027.68
    },
    {
        "text": " porque, como les decía, ese conocimiento, una vez que, por algún motivo, se hace público,",
        "start": 2027.68,
        "end": 2033.5600000000002
    },
    {
        "text": " voy a requerir este tarde o temprano de algún mecanismo que me asegure, ¿verdad?",
        "start": 2033.5600000000002,
        "end": 2043.24
    },
    {
        "text": " ser el único o ser al menos la única persona que pueda explotar en un determinado mercado",
        "start": 2043.24,
        "end": 2051.2000000000003
    },
    {
        "text": " de conocimiento, porque si no todo mi esfuerzo de investigación y desarrollo va a terminar una vez que",
        "start": 2051.2,
        "end": 2056.7999999999997
    },
    {
        "text": " lo haga público, ¿sí? Entonces, lo importante para desarrollar esta estrategia de protección",
        "start": 2056.7999999999997,
        "end": 2066.0
    },
    {
        "text": " que de alguna manera es la que me va a determinar la posibilidad de apropiar ese conocimiento, lo más",
        "start": 2066.0,
        "end": 2073.64
    },
    {
        "text": " importante es que en el día 1 tenga claro que ese conocimiento no se puede revelar, ¿sí?",
        "start": 2073.64,
        "end": 2081.6
    },
    {
        "text": " O lo tanto, desde el principio, me tengo que basar en una estrategia primero de secreto. Yo siempre",
        "start": 2081.6,
        "end": 2090.3199999999997
    },
    {
        "text": " hablo de que uno tiene una estrategia de protección, pero también tiene una estrategia de divulgación del",
        "start": 2090.3199999999997,
        "end": 2098.2
    },
    {
        "text": " conocimiento. No puede tener una estrategia de protección sola, porque la estrategia de protección",
        "start": 2098.2,
        "end": 2104.3199999999997
    },
    {
        "text": " único que hace es proteger el conocimiento, pero mientras yo estoy preocupado por proteger el",
        "start": 2104.3199999999997,
        "end": 2109.56
    },
    {
        "text": " conocimiento, hay muchas situaciones en las cuales necesito divulgar el conocimiento.",
        "start": 2109.56,
        "end": 2115.56
    },
    {
        "text": " A ver si algunos díurtees se le ocurre, ¿por qué quisiera yo divulgar el conocimiento incluso en",
        "start": 2116.24,
        "end": 2122.3999999999996
    },
    {
        "text": " alguna etapa temprana? ¿Qué les parece? ¿Por qué cuando voy a generar conocimiento podría yo",
        "start": 2122.4,
        "end": 2129.56
    },
    {
        "text": " querer divulgarlo? ¿Apa que queréis generar expectativas? Perfecto. O sea, quiero generar demanda.",
        "start": 2129.56,
        "end": 2138.84
    },
    {
        "text": " Eso, brillante, sí, esa es una posibilidad. ¿Qué más?",
        "start": 2138.84,
        "end": 2143.64
    },
    {
        "text": " A ver, ¿qué les ver si es útil, digamos? Porque puede estar muy bueno, pero porque no es no es",
        "start": 2144.16,
        "end": 2150.72
    },
    {
        "text": " práctico o no le lleva la mayoría de la gente.",
        "start": 2150.72,
        "end": 2155.24
    },
    {
        "text": " Podéje de generar un prototipo para probarlo y determinar si vale la pena seguir adelante o no con el",
        "start": 2155.7999999999997,
        "end": 2162.0
    },
    {
        "text": " proyecto. Bien, hay más. ¿Qué más? ¿Qué necesitas para desarrollar?",
        "start": 2162.0,
        "end": 2168.48
    },
    {
        "text": " Inversiones. Sí, inversiones. Voy a necesitar plata, socios, capitalistas, y yo tengo que convencer de",
        "start": 2169.48,
        "end": 2180.12
    },
    {
        "text": " que tengo algo bueno. Bueno, muchas gracias. Entonces, desde el día 1, desde que estoy consiguiendo esa",
        "start": 2180.12,
        "end": 2186.0
    },
    {
        "text": " idea, por les decía, tengo que generar esa protección a través del secreto. No puedo revelar mis",
        "start": 2186.0,
        "end": 2194.04
    },
    {
        "text": " ideas sin un acuerdo de confidencialidad. ¿Por qué? Porque como les decía, las ideas no se protejen.",
        "start": 2194.04,
        "end": 2199.64
    },
    {
        "text": " Entonces, voy a tener que conseguir, verdad, que las personas que tenan al tanto de mi proyecto o que",
        "start": 2201.04,
        "end": 2208.36
    },
    {
        "text": " tengan acceso a detalles de mi proyecto, sí, por lo menos reciban esa información con un acuerdo",
        "start": 2208.36,
        "end": 2216.16
    },
    {
        "text": " de confidencialidad. Les siguen. Entonces, eso ocurre con inversores, eso ocurre con posibles",
        "start": 2216.16,
        "end": 2226.6
    },
    {
        "text": " organismo de financiación. Yo les decía, si quieren presentar un proyecto a la ani o quieren",
        "start": 2226.6,
        "end": 2232.24
    },
    {
        "text": " presentar un proyecto al balgueteramericano de desarrollo o a cualquier agencia de financiamiento,",
        "start": 2232.24,
        "end": 2238.16
    },
    {
        "text": " ustedes se van a tratar de asegurar que los evaluadores de esos proyectos tengan acuerdo de",
        "start": 2238.16,
        "end": 2243.2799999999997
    },
    {
        "text": " confidencialidad, que los llamados de alguna manera aseguren que todo el personal que va a tratar",
        "start": 2243.28,
        "end": 2251.48
    },
    {
        "text": " esos datos lo haga de forma confidencial. ¿Sí? Porque de esa forma, ustedes se aseguran, llegar a",
        "start": 2251.48,
        "end": 2259.2000000000003
    },
    {
        "text": " el momento en que cuando el conocimiento se genera, ¿vale? Voy a tener que proteger, porque si lo",
        "start": 2259.2000000000003,
        "end": 2266.44
    },
    {
        "text": " divulgue antes, esa divulgación va a afectar esa estrategia. ¿Sí? Entonces, como les decía,",
        "start": 2266.44,
        "end": 2274.56
    },
    {
        "text": " voy a tener también una estrategia de divulgación. Y siempre digo yo, cuando tengo que revelar el",
        "start": 2274.56,
        "end": 2282.76
    },
    {
        "text": " secreto, bueno, acá lo dice, para promocionarlo en una negociación y ahí voy a tener los famosos",
        "start": 2282.76,
        "end": 2289.6
    },
    {
        "text": " endying, como se se ubican la sigla, pero bueno, la sigla corresponde a no display or agreement,",
        "start": 2289.6,
        "end": 2296.44
    },
    {
        "text": " que son los contratos de confidencialidad y por supuesto, para poder elaborar una estrategia de",
        "start": 2296.44,
        "end": 2306.4
    },
    {
        "text": " protección. ¿Sí? Entonces, es muy, muy, muy importante que esto lo manejen desde el día a",
        "start": 2306.4,
        "end": 2314.3199999999997
    },
    {
        "text": " 1. ¿Sí? Por eso, yo les decía, con bello de confidencialidad, con los empleados, con los",
        "start": 2314.32,
        "end": 2320.7200000000003
    },
    {
        "text": " consultores, con los socios, con los inversores, así arranco protegiendo en la etapa de generación del",
        "start": 2320.7200000000003,
        "end": 2328.6400000000003
    },
    {
        "text": " conocimiento, en la etapa de apropiación, ¿Sí? Ya sigo con estos con bello de confidencialidad,",
        "start": 2328.6400000000003,
        "end": 2335.76
    },
    {
        "text": " pero en piezo a pensar que estrategia voy a hacer para protegernos, ¿Sí? Y esa estrategia me va",
        "start": 2335.76,
        "end": 2344.0
    },
    {
        "text": " a permitir en algún momento hacerlo público sin morir en el intento, me voy a contarlo",
        "start": 2344.0,
        "end": 2349.4
    },
    {
        "text": " de dígido, sí, ya. El hecho de especificar en los contratos, sobre todo con los empleados,",
        "start": 2349.4,
        "end": 2357.24
    },
    {
        "text": " de que no puedan trabajar con clientes de la empresa también es un acto para prevenir",
        "start": 2357.24,
        "end": 2363.04
    },
    {
        "text": " escape de conocimiento. Sí, claro, sí, justamente para evitar la competencia de",
        "start": 2364.16,
        "end": 2370.0
    },
    {
        "text": " esleal, sí, se promueven, yo promuevo que todos los convenios de confidencialidad sean",
        "start": 2370.0,
        "end": 2376.92
    },
    {
        "text": " no con financiaridad y no competencia, tanto con los empleados como los clientes, como",
        "start": 2376.92,
        "end": 2381.68
    },
    {
        "text": " los inversores, sí, es muy importante establecer esto, se sorprendería la cantidad de casos donde",
        "start": 2381.68,
        "end": 2389.16
    },
    {
        "text": " la gente es infiel, se los digo así, o sea, a pesar de haber firmado, es infiel, pero bueno,",
        "start": 2389.16,
        "end": 2399.0
    },
    {
        "text": " la realidad es que uno tiene que al menos tener un convenio porque si uno tiene un convenio,",
        "start": 2399.0,
        "end": 2403.36
    },
    {
        "text": " tiene un juicio, si uno no tiene un convenio, es muy difícil probar qué fue lo que se consideraba",
        "start": 2403.36,
        "end": 2409.08
    },
    {
        "text": " con financiación. Bueno, ¿cómo le decía? Voy entonces a ver la caja de herramientas que tengo",
        "start": 2409.08,
        "end": 2417.4
    },
    {
        "text": " para apropiarme del conocimiento y acá tienen algunas de ellas. Fíjense que en el video que el",
        "start": 2417.4,
        "end": 2423.6
    },
    {
        "text": " espátil expuse apenas tenía un ejemplo de tres cosas, las patentes, los diseños,",
        "start": 2423.6,
        "end": 2428.6
    },
    {
        "text": " industrias y las marcas, pero si ustedes ven, hay un montón de otros instrumentos y hay más",
        "start": 2428.6,
        "end": 2433.7999999999997
    },
    {
        "text": " que no estar acá. En general, se habla de propiedad industrial y de propiedad literal y artística,",
        "start": 2433.7999999999997,
        "end": 2440.4
    },
    {
        "text": " la propiedad industrial, patentes, modelos de utilidad, estas son creaciones de tipo inventivo,",
        "start": 2440.4,
        "end": 2445.64
    },
    {
        "text": " el software es considerado como objeto, materia patentable en países como Estados Unidos,",
        "start": 2446.3599999999997,
        "end": 2455.16
    },
    {
        "text": " como Japón, no en Uruguay. Por esa razón les marqué derechos de autor con rojo,",
        "start": 2455.16,
        "end": 2460.3199999999997
    },
    {
        "text": " bueno, derechos de autor y derechos con ex, forman parte de lo que es la propiedad",
        "start": 2460.3199999999997,
        "end": 2465.16
    },
    {
        "text": " industrial y artística y les marqué la propiedad industrial y artística porque en el punto de vista",
        "start": 2465.16,
        "end": 2470.0
    },
    {
        "text": " jurídico en Uruguay el software tiene protección por derechos de autor, igual que los músicos,",
        "start": 2470.0,
        "end": 2476.84
    },
    {
        "text": " muchachos, es muy linda, esa parte es muy... Pero bueno, la realidad es que por eso se considera",
        "start": 2476.84,
        "end": 2483.88
    },
    {
        "text": " una hora literaria, así está definida. A ver, se ha discutido muchísimo la naturaleza jurídica",
        "start": 2483.88,
        "end": 2493.72
    },
    {
        "text": " de las soluciones del software. Pero bueno, la realidad es que las patentes dan derechos de exclusividad",
        "start": 2493.72,
        "end": 2499.56
    },
    {
        "text": " y la que harían que la industria del software se viera realmente afectada. Ustedes ven realmente",
        "start": 2499.56,
        "end": 2508.0
    },
    {
        "text": " juicios guerras de patentes entre las empresas, en otros países en Estados Unidos, por ejemplo,",
        "start": 2508.0,
        "end": 2513.56
    },
    {
        "text": " es muy común que las empresas patentan para trancarse mutuamente, ¿verdad? Y luego negociar la",
        "start": 2513.56,
        "end": 2523.3599999999997
    },
    {
        "text": " manera de vivirse en mercado o la manera de vivirse en los adelantos tecnológicos, porque todas",
        "start": 2523.36,
        "end": 2527.84
    },
    {
        "text": " lo unchan por tener las mismas tipos de prestación. Pero la realidad es que creo que los que más",
        "start": 2527.84,
        "end": 2536.8
    },
    {
        "text": " se benefician del sistema de patentes son los abogados de esas empresas. Vieron de millones,",
        "start": 2536.8,
        "end": 2541.36
    },
    {
        "text": " le dolares, el litigios y no siempre llegan a soluciones que realmente acomodan a todo el mundo.",
        "start": 2541.36,
        "end": 2548.76
    },
    {
        "text": " ¿Para una mejor que tú me estás hablando?",
        "start": 2549.76,
        "end": 2551.7200000000003
    },
    {
        "text": " No, no, estoy diciendo algo y está muy enros, la había estado en tu casa.",
        "start": 2553.8,
        "end": 2557.6400000000003
    },
    {
        "text": " Yo te dije que está, bueno, entonces le decía, las herramientas son estas, ahora les voy a explicar un",
        "start": 2559.48,
        "end": 2568.4
    },
    {
        "text": " poquito más cómo funciona. ¿Por qué se protege por patentes? Bueno, se protege por patentes,",
        "start": 2568.4,
        "end": 2574.44
    },
    {
        "text": " porque los objetos son invenciones que cumplan con tres requisitos. Esa son soluciones técnicas",
        "start": 2574.44,
        "end": 2580.2000000000003
    },
    {
        "text": " que tengan novedad, actividad inventiva y aplicación industrial, ¿qué significa esto?",
        "start": 2580.2000000000003,
        "end": 2585.7200000000003
    },
    {
        "text": " Significa que no cualquier inventos patentables, va a ser patentable en la medida que sea nuevo,",
        "start": 2585.7200000000003,
        "end": 2592.2000000000003
    },
    {
        "text": " es decir, que no haya sido reportado antes. Y además, tiene que cumplir lo que se llama actividad",
        "start": 2592.2000000000003,
        "end": 2599.04
    },
    {
        "text": " inventiva, que es una novedad calificada y por lo tanto implica que no solamente tiene que ser",
        "start": 2599.04,
        "end": 2604.88
    },
    {
        "text": " novedoso, sino que tiene que implicar un paso más allá en el estado de la técnica o en el estado",
        "start": 2604.88,
        "end": 2610.44
    },
    {
        "text": " del arte. Y esto implica obviamente que no son patentables, verdad? Las pequeñas mejoras.",
        "start": 2610.44,
        "end": 2622.2
    },
    {
        "text": " Entonces, en la industria del software esto puede ser crítico, porque como ustedes saben,",
        "start": 2623.16,
        "end": 2629.04
    },
    {
        "text": " hay muchísimas aplicaciones que de alguna manera solucionan el mismo problema técnico de forma",
        "start": 2629.04,
        "end": 2635.7999999999997
    },
    {
        "text": " muy similar, no igual, pero que no necesariamente implican actividad inventiva. Y por lo tanto,",
        "start": 2635.7999999999997,
        "end": 2641.7999999999997
    },
    {
        "text": " la mayoría de esas aplicaciones no tendrían protección e incluso estarían infringiendo la patente",
        "start": 2641.7999999999997,
        "end": 2647.64
    },
    {
        "text": " del original, con lo cual hay países en el mundo, que además no son solamente los países",
        "start": 2647.64,
        "end": 2654.12
    },
    {
        "text": " grandes como Estados Unidos y Japón, en la Unión Europea en general no patentan software,",
        "start": 2654.12,
        "end": 2660.08
    },
    {
        "text": " o sea, realmente hay una posición muy fuerte en esto para permitir que haya una avance diferente",
        "start": 2660.08,
        "end": 2667.56
    },
    {
        "text": " en lo que es el software. Ahora, cuando veamos derechos de autor, les voy a explicar un poquito por qué.",
        "start": 2667.56,
        "end": 2672.6
    },
    {
        "text": " Bueno, la protección por patente te da una protección nacional e internacional. Yo protejo territorio por",
        "start": 2673.48,
        "end": 2679.3199999999997
    },
    {
        "text": " territorio, y esto es importante porque si voy a exportar, me da una protección interesante. Yo",
        "start": 2679.3199999999997,
        "end": 2687.4
    },
    {
        "text": " puedo elegir el mercado al cual me dirijo y proteger país por país. Los derechos que me confiere en",
        "start": 2687.4,
        "end": 2694.36
    },
    {
        "text": " las patentes, lo que pueden dar de paternidad, es decir, tengo derecho a decir, yo soy el autor de esa",
        "start": 2694.36,
        "end": 2700.52
    },
    {
        "text": " inmanción, pero además hay derechos patrimoniales que son lo que realmente cuentan. Es el derecho a usar",
        "start": 2700.52,
        "end": 2708.0
    },
    {
        "text": " la patente a transmitir la patente, o sea, las licencias, con las sesiones y sobre todo el derecho",
        "start": 2708.0,
        "end": 2715.4
    },
    {
        "text": " impedir que el tercero fabrice, venda o utilice importe o almacene, ¿verdad? Cualquier producto",
        "start": 2715.4,
        "end": 2723.08
    },
    {
        "text": " o servicio que tenga algún tipo de relación directa con esa patente se da en cuenta que la ley en",
        "start": 2723.08,
        "end": 2730.48
    },
    {
        "text": " buclara, yo puedo impedir fabricación, vento, utilización, importación, incluso almacenamiento.",
        "start": 2730.48,
        "end": 2736.6
    },
    {
        "text": " Esto implica que la propiedad de la que tiene medidas que incluso se dan en la frontera. Yo puedo en un depósito",
        "start": 2736.6,
        "end": 2744.72
    },
    {
        "text": " o anero trancar el ingreso al mercado en producto sólo porque es no patente en ese país.",
        "start": 2744.72,
        "end": 2750.92
    },
    {
        "text": " Por eso está interesante. ¿Por qué protegimos mediante secreto? Que es el primero,",
        "start": 2753.64,
        "end": 2761.44
    },
    {
        "text": " les diría, la primera estrategia que les dije, porque lo más fácil es mantener secreto y más",
        "start": 2761.44,
        "end": 2767.6
    },
    {
        "text": " capra y no más. Es lo más fácil al principio. A medida que va generándose ese conocimiento se",
        "start": 2767.6,
        "end": 2775.24
    },
    {
        "text": " empieza a tomar un poco más difícil, pero la realidad es que hay una ventaja increíble del secreto y es que",
        "start": 2775.24,
        "end": 2780.2799999999997
    },
    {
        "text": " si no, si se logra mantener la confidencialidad, si se logra de alguna manera mantener",
        "start": 2781.2400000000002,
        "end": 2786.92
    },
    {
        "text": " el secreto de cómo se fabrica algo, de cómo se produce algo, hay virtualmente una duración",
        "start": 2786.92,
        "end": 2793.6000000000004
    },
    {
        "text": " indefinida. Perdón, olvides decirles que las patentes son por 20 años. Eso creo que el video",
        "start": 2793.6000000000004,
        "end": 2800.2000000000003
    },
    {
        "text": " ponemos la transparencia, lo voy a poner para la próxima. Las patentes son solamente por 20 años,",
        "start": 2800.2000000000003,
        "end": 2805.1200000000003
    },
    {
        "text": " cumplido el caso de 20 años, el conocimiento pasa al dominio público. Esto que implica, implica que",
        "start": 2805.12,
        "end": 2812.04
    },
    {
        "text": " cualquiera puede copiar, y está bien que lo hagan, porque el Estado hizo un pacto con ese inventor",
        "start": 2812.04,
        "end": 2820.3599999999997
    },
    {
        "text": " por el cual le dio esa patente por 20 años. Trascurrido el plazo, considera que ese conocimiento",
        "start": 2820.3599999999997,
        "end": 2826.56
    },
    {
        "text": " le pertenece a algún mundo. Al mundo, entonces es muy importante que ustedes vean la cantidad de",
        "start": 2826.56,
        "end": 2834.2
    },
    {
        "text": " documentos de patentes que hay publicados a nivel mundial y que solamente una ínfima parte de ellos",
        "start": 2834.2,
        "end": 2840.96
    },
    {
        "text": " están vigientes en Uruguay. Aquestos que no están vigientes en Uruguay son parte del dominio público",
        "start": 2840.96,
        "end": 2847.3599999999997
    },
    {
        "text": " y están ahí para ser copiados. Bien, en cuanto al secreto, como el secreto no se revela, como el",
        "start": 2847.3599999999997,
        "end": 2857.64
    },
    {
        "text": " secreto no se publica, como no está sujeto a tiempo, barránea, condición y no requieren",
        "start": 2857.64,
        "end": 2863.8799999999997
    },
    {
        "text": " ningún tipo de trámite administrativo, porque en el otro caso yo necesito que un país me",
        "start": 2863.88,
        "end": 2868.12
    },
    {
        "text": " reconozca ese monopón. En este caso no hay un procedimiento de concesión del secreto. Entonces,",
        "start": 2868.12,
        "end": 2875.36
    },
    {
        "text": " tienes la ventaja. La desventaja es la fragilidad que tienen relación a la piratería, pero la fragilidad",
        "start": 2875.36,
        "end": 2882.96
    },
    {
        "text": " depende también de la área tecnológica, porque digo todo esto depende de la ingeniería inversa.",
        "start": 2882.96,
        "end": 2889.32
    },
    {
        "text": " Ustedes tienen claro lo que es. Básicamente la posibilidad que puede tener cualquier técnico",
        "start": 2889.32,
        "end": 2894.6800000000003
    },
    {
        "text": " del producto sacar el proceso de producción o de fabricación. Si eso es sencillo, el secreto no",
        "start": 2894.6800000000003,
        "end": 2904.2400000000002
    },
    {
        "text": " va a ser la mejor forma de proteger ese conocimiento. Si es complejo o edificultoso o falta",
        "start": 2904.2400000000002,
        "end": 2912.0
    },
    {
        "text": " algunas cuestiones que puedo de alguna manera esconder, entonces ese secreto va a ser muchísimo",
        "start": 2912.0,
        "end": 2918.64
    },
    {
        "text": " más efectivo que una patente, porque la patente como les decía tiene un fin.",
        "start": 2918.64,
        "end": 2924.56
    },
    {
        "text": " Bueno, la confidencialidad es importante que la tengan clara. Hay confidencialidad por ley,",
        "start": 2929.32,
        "end": 2936.84
    },
    {
        "text": " es decir, todo lo funcionario públicos, los centes universitarios, Jorge y yo, por ejemplo,",
        "start": 2937.36,
        "end": 2943.44
    },
    {
        "text": " que somos funcionarios públicos, ¿verdad? Estamos obligados por ley a guardar confidencialidad respecto",
        "start": 2943.44,
        "end": 2950.04
    },
    {
        "text": " de la información que llega a nuestro conocimiento en el ejercicio de nuestro caro. Los profesionales,",
        "start": 2950.04,
        "end": 2956.1600000000003
    },
    {
        "text": " universitarios, tienen lo que se llama el secreto profesional. Los trabajadores también tienen",
        "start": 2956.1600000000003,
        "end": 2963.0
    },
    {
        "text": " una organización de volarse secreto en relación al trabajo que realizan en una empresa.",
        "start": 2963.0,
        "end": 2968.48
    },
    {
        "text": " Las sanciones están establecidas en el código penal, muchos. Esto implica prisión.",
        "start": 2970.12,
        "end": 2975.88
    },
    {
        "text": " Es difícil que alguien vaya a preso por reverar un secreto cuando es la primera vez que tiene un",
        "start": 2977.36,
        "end": 2982.56
    },
    {
        "text": " delito, ¿verdad? Pero si es el segundo delito, seguramente van presos. La primera vez es muy difícil,",
        "start": 2982.56,
        "end": 2989.88
    },
    {
        "text": " porque obviamente es una pena bastante chica, pero la realidad es que cuando uno ya tiene un delito,",
        "start": 2989.88,
        "end": 2997.56
    },
    {
        "text": " verdad, en su haber, bueno, el segundo delito ya no es escarselable.",
        "start": 2997.56,
        "end": 3006.36
    },
    {
        "text": " Digo esto porque la gente, a veces, piensa que estamos todos muy lejos de meter un delito y eso no es",
        "start": 3008.36,
        "end": 3015.2000000000003
    },
    {
        "text": " así. Estamos todos muy cerca de meter un delito cuando salimos a la calle y atropellamos a alguien.",
        "start": 3015.72,
        "end": 3020.8399999999997
    },
    {
        "text": " Y eso es algo que puede pasar, que ojalá no le pase, pero la realidad es que eso es algo que le",
        "start": 3020.8399999999997,
        "end": 3027.52
    },
    {
        "text": " puede pasar a cualquiera en cualquier momento. Entonces, os voy con eso. Andrea, hay una duda sobre",
        "start": 3027.52,
        "end": 3035.48
    },
    {
        "text": " la protección por patentes, por ejemplo, en el caso de Disney, no sé, podemos hacer Mickey Mouse",
        "start": 3035.48,
        "end": 3041.9199999999996
    },
    {
        "text": " el guayo o está protegido también en el guay. No, porque Mickey Mouse no está por patentes. Mickey Mouse",
        "start": 3041.92,
        "end": 3047.4
    },
    {
        "text": " es por derechos de autónulos, vamos a ver ahora. Me dan un segundo más que salvo de confiancialidad",
        "start": 3047.4,
        "end": 3053.4
    },
    {
        "text": " y he puesto derechos de autor y hablamos de Mickey. Aparte de Mickey es de mis personas en",
        "start": 3053.4,
        "end": 3058.6
    },
    {
        "text": " redes. Y además de ver decir que es de los personajes que ha logrado mayor negociación internacional",
        "start": 3058.6,
        "end": 3066.52
    },
    {
        "text": " entre los países. Así que ahora les cuenta. Pero bueno, la patente de lo que protege tecnología,",
        "start": 3066.52,
        "end": 3076.84
    },
    {
        "text": " muchachos, protege a paratos, protege fórmulas químicas, protege de verdad cualquier invento,",
        "start": 3076.84,
        "end": 3083.04
    },
    {
        "text": " un automóvil, un motor, todo a parato, además todo a parato que pueda tener asociación un software,",
        "start": 3085.04,
        "end": 3093.24
    },
    {
        "text": " también, la rato hardware puede ser protegido por patentes. Pero los personajes de las películas",
        "start": 3093.24,
        "end": 3102.24
    },
    {
        "text": " audiovisuales, las películas de Disney y los cuentos son obras literarias artísticas. Ahora vamos",
        "start": 3102.24,
        "end": 3108.04
    },
    {
        "text": " a ver. Las obras cinematográficas son parte de los derechos de autor y tiene una protección",
        "start": 3108.04,
        "end": 3112.8799999999997
    },
    {
        "text": " distinta, igual que el software. Y ya les voy a contar cómo. Bien, la otra forma de proteger la",
        "start": 3112.8799999999997,
        "end": 3121.56
    },
    {
        "text": " confidencialidad es con un contrato. Entonces, en el primer caso, yo no hago un contrato, simplemente",
        "start": 3121.56,
        "end": 3127.96
    },
    {
        "text": " apelo a que la persona va a cumplir con la ley. Yo no les aconsejo esto, aconsejo siempre",
        "start": 3127.96,
        "end": 3136.04
    },
    {
        "text": " firmar un contrato, porque en los contratos de confidencialidad yo establezco en el objeto del",
        "start": 3136.04,
        "end": 3142.2
    },
    {
        "text": " contrato que es lo que considero confidencial. En cuando me remito a la ley, se supone que",
        "start": 3142.2,
        "end": 3151.16
    },
    {
        "text": " todo sería confidencial. Pero para ahí tengo que probar cuál es ese conocimiento a que",
        "start": 3151.16,
        "end": 3158.3999999999996
    },
    {
        "text": " tuvo acceso a empleado o el funcionario o el consultor, ¿verdad? Era confidencial. En cambio,",
        "start": 3158.3999999999996,
        "end": 3167.64
    },
    {
        "text": " cuando yo con un contrato, determinó claramente el objeto, determinó claramente el plazo, porque en el",
        "start": 3167.64,
        "end": 3173.64
    },
    {
        "text": " caso de la ley no hay plazo, o sea, la confidencialidad de pobre vida. Yo hace 25 años que me",
        "start": 3173.64,
        "end": 3180.48
    },
    {
        "text": " recibí de abogada y tengo que mantener la confidencialidad en mi primer cliente de hace 25 años",
        "start": 3180.48,
        "end": 3185.88
    },
    {
        "text": " que les aseguro de no va a corno el nombre. Sí, me acuerdo, se me hajó.",
        "start": 3185.88,
        "end": 3189.68
    },
    {
        "text": " Es mejor. Bien, pero bueno, tengo que mantener la confidencialidad, incluso de ese primer cliente,",
        "start": 3189.68,
        "end": 3199.4
    },
    {
        "text": " porque es para siempre, porque la ley no establece un plazo. Ahora, ¿qué pasa en tecnología?",
        "start": 3199.4,
        "end": 3204.72
    },
    {
        "text": " ¿Tiene sentido que ustedes guardan confidencialidad de una tecnología que desarrollaron una empresa",
        "start": 3204.72,
        "end": 3211.0
    },
    {
        "text": " durante toda su vida? No tiene sentido. Entonces, en general, de acuerdo a la área tecnológica,",
        "start": 3211.0,
        "end": 3218.8799999999997
    },
    {
        "text": " en los contatos estables en plazos, cinco, diez años, veinte años, en función, verdad, de la tecnología.",
        "start": 3218.8799999999997,
        "end": 3226.4399999999996
    },
    {
        "text": " En sólvan los plazos que yo he visto son bastante cortos, porque se ve que, como es una tecnología",
        "start": 3226.4399999999996,
        "end": 3232.4399999999996
    },
    {
        "text": " que está todo el tiempo, para un sector, está todo el tiempo sacando productos nuevos, no les",
        "start": 3232.44,
        "end": 3238.04
    },
    {
        "text": " interesa tener un plazo muy amplio de confidencialidad. Pero si les interesa, mantén a la confidencialidad",
        "start": 3238.04,
        "end": 3244.88
    },
    {
        "text": " en algunos productos. Y ahí está establecer específicamente. ¿Sí? Después se nos apreunda.",
        "start": 3244.88,
        "end": 3251.0
    },
    {
        "text": " Sí, todas las que quieras. Cuando vos firmás un contrato para una empresa software, a menudo,",
        "start": 3251.0,
        "end": 3258.12
    },
    {
        "text": " digamos, te pone una cláusula que te dice que no te puedes ir a trabajar con un cliente ellos.",
        "start": 3258.12,
        "end": 3264.16
    },
    {
        "text": " Sí. No te están ahí como patentando entre comillas a vos. O sea, no, capa que no tiene",
        "start": 3264.16,
        "end": 3270.92
    },
    {
        "text": " nada que haber, pero... No. Lo que está pasando a trazar la empresa es que tú no te vas con",
        "start": 3270.92,
        "end": 3276.64
    },
    {
        "text": " o con un competidor o con un cliente. Y más que nada, es para que, porque hay una definitiva, si vos",
        "start": 3276.64,
        "end": 3282.04
    },
    {
        "text": " es un desarrollador y tenés un cliente que se lleva a tus desarrolladores y deja de contratarte,",
        "start": 3282.04,
        "end": 3288.16
    },
    {
        "text": " deja de ser retable en la empresa. O sea, la razón por la cual ellos te ponen esa",
        "start": 3288.16,
        "end": 3293.2799999999997
    },
    {
        "text": " limitación a ti como empleado por si te algo, es justamente para preservar la relación que",
        "start": 3293.2799999999997,
        "end": 3299.2
    },
    {
        "text": " tienen con su cliente. De la misma manera que a ti te ponen la cláusula de que vos no te",
        "start": 3299.2,
        "end": 3304.12
    },
    {
        "text": " puede decir con un cliente o con un proveedor, le ponen a los clientes. Si los proveedores",
        "start": 3304.12,
        "end": 3308.6
    },
    {
        "text": " una cláusula de que no se pueden llevar a los empleados. Sí. La realidad es que cuando hablamos",
        "start": 3308.6,
        "end": 3315.36
    },
    {
        "text": " de transferencia tecnológica, yo lo sé, ustedes tienen claro lo que significa, pero hay varios",
        "start": 3315.36,
        "end": 3320.56
    },
    {
        "text": " tipos de transferencia tecnológica. Y uno de ellos es lo que se llama transferencia",
        "start": 3320.56,
        "end": 3324.88
    },
    {
        "text": " tecnológica informal. ¿Cómo transfero la tecnología en forma informal con la gente? Porque",
        "start": 3324.88,
        "end": 3333.04
    },
    {
        "text": " donde está la tecnología? Acá muchos. Entonces, si yo me llevo al desarrollador de la empresa",
        "start": 3333.04,
        "end": 3340.6
    },
    {
        "text": " de Jorge, me estoy llevando el conocimiento que Jorge tiene y me estoy llevando su",
        "start": 3340.6,
        "end": 3346.24
    },
    {
        "text": " forza de trabajo. Entonces, Jorge debería cuidar bien a su desarrollador para que no se",
        "start": 3346.24,
        "end": 3352.2
    },
    {
        "text": " quiera ir. Eso es aparte. Pero si lo cuida, verdad, y el otro lo que haces, no sé, un remate",
        "start": 3352.2,
        "end": 3358.6
    },
    {
        "text": " para ver si le puede pagar más, para ver si lo puede robar, la forma que tiene Jorge",
        "start": 3358.6,
        "end": 3363.56
    },
    {
        "text": " de evitar que se vaya a su desarrollador es precisamente poner a un tipo de restricción.",
        "start": 3363.56,
        "end": 3369.04
    },
    {
        "text": " Y, generalmente, se ponen multas o se ponen sanciones para caso en cumplimiento. ¿A? ¿Entendió?",
        "start": 3369.04,
        "end": 3376.48
    },
    {
        "text": " ¿Y si le he dicho? Sí, sí. Hay un par de cositas. También hay un tema de cuál fue o cuál es",
        "start": 3376.48,
        "end": 3388.6
    },
    {
        "text": " el valor que aportaba por toda la empresa. La empresa no se tiene un área comercial que salió y",
        "start": 3388.6,
        "end": 3395.2
    },
    {
        "text": " buscó a ser cliente, le llevó meses, viajó, invitió, eso también, en alguna forma, se trata",
        "start": 3395.2,
        "end": 3402.56
    },
    {
        "text": " como de cuidar. Pregunta acá que, por ejemplo, en Uruguay, no sé, una empresa como GeneXus o",
        "start": 3402.56,
        "end": 3409.16
    },
    {
        "text": " Artech GeneXus, que capaz que tiene algo protegido, no sé, hace más de 20 años, ¿qué pasó?",
        "start": 3409.16,
        "end": 3416.44
    },
    {
        "text": " Si eso llega a 20 años, cada duca se puede usar y copiar, como sería. Bueno, habría que ver",
        "start": 3416.44,
        "end": 3421.48
    },
    {
        "text": " cuál es por qué instrumento lo tiene protegido. Por eso, ya recién les conté un instrumento",
        "start": 3421.48,
        "end": 3427.44
    },
    {
        "text": " que es patente, es un 20 años. Ahora les voy a contar la derecho de autor, que es mucho más,",
        "start": 3427.44,
        "end": 3433.12
    },
    {
        "text": " o sea, por eso habría que ver si GeneXus lo que tiene es un derecho de autor. Si tiene un derecho de",
        "start": 3433.12,
        "end": 3439.56
    },
    {
        "text": " autor, seguramente todavía lo tiene vigente. Pero ahora no vemos. Ya no. No, que también puede",
        "start": 3439.56,
        "end": 3447.52
    },
    {
        "text": " haber que no ser un con, digamos, que no tener que tratar con el con el personal, sino que haya",
        "start": 3447.52,
        "end": 3454.48
    },
    {
        "text": " un acuerdo entre las corporaciones de no. Por ejemplo, sé que en un momento acá en Uruguay",
        "start": 3454.48,
        "end": 3458.8
    },
    {
        "text": " había ando siempre esa tecnología que se robaban los empleados de uno al otro y en algún momento",
        "start": 3458.8,
        "end": 3467.32
    },
    {
        "text": " como que se ha un acuerdo que ninguna empresa podría tomar a Link a esa trabajado recientemente",
        "start": 3467.32,
        "end": 3472.32
    },
    {
        "text": " en la otra. Entonces, no es siempre capaz que no siempre es sobre un empleado en el contrato,",
        "start": 3472.32,
        "end": 3477.48
    },
    {
        "text": " sino también es un acuerdo empresarial que ayuda a eso a parar un poco la pelota con el robo",
        "start": 3477.48,
        "end": 3486.48
    },
    {
        "text": " de personal. Sí, a ver, como yo le decía el tema transferencia tecnológica es importante y",
        "start": 3486.48,
        "end": 3495.44
    },
    {
        "text": " obviamente cuando uno contrata personal y contacta personal calificado, ustedes, muchachos son todos",
        "start": 3495.44,
        "end": 3501.64
    },
    {
        "text": " muy valosos para un empresa y cuanto mayores penísean quieran, se transforman en personas mucho más",
        "start": 3501.64,
        "end": 3506.92
    },
    {
        "text": " valiosas. Entonces, no solamente para el que lo tiene, sino para el resto que de repente se los",
        "start": 3506.92,
        "end": 3514.44
    },
    {
        "text": " quiere de alguna manera contratar, pero por otro lado, hay lugares donde formamos gente justamente",
        "start": 3514.44,
        "end": 3523.48
    },
    {
        "text": " para que sea valiosa y eso es la universidad la república. Entonces, si vos querés realmente tener",
        "start": 3523.48,
        "end": 3529.52
    },
    {
        "text": " un técnico formado, ¿verdad? Y no tener la dificultad de repente de bueno, de que tenga un",
        "start": 3529.52,
        "end": 3538.8
    },
    {
        "text": " contrato de no competencia o que tenga la obligación de no trabajar en algún en algún en algún",
        "start": 3538.8,
        "end": 3546.4
    },
    {
        "text": " tiempo con clientes o proveedores, seguramente vas a tener que ir a la universidad a alguien que",
        "start": 3546.4,
        "end": 3552.72
    },
    {
        "text": " esté haciendo verdad un proyecto de investigación o que esté haciendo un pozo grado porque esa gente ahí sí va a",
        "start": 3552.72,
        "end": 3559.0
    },
    {
        "text": " quitar capacidades y esas no sean las mismo tipos de capacidades que se adquieren cuando se trabajan en",
        "start": 3559.0,
        "end": 3564.12
    },
    {
        "text": " una empresa, pero bueno, la realidad es que la universidad la república sí es un semillero de gente",
        "start": 3564.12,
        "end": 3570.96
    },
    {
        "text": " capaz de que las empresas se llevan precisamente para aprovechar ese conocimiento que están alquiremos,",
        "start": 3570.96,
        "end": 3578.76
    },
    {
        "text": " tanto en el grado como en el pojo grado, pero las empresas no invierten en generar capacidades en",
        "start": 3578.76,
        "end": 3587.2
    },
    {
        "text": " sus propias estaf para que después se vayan. La universidad sí, no es la única, pero bueno, es que",
        "start": 3587.2,
        "end": 3596.7999999999997
    },
    {
        "text": " tenemos roles distintos, ¿no? Bien, distintos. Entonces, bueno, la realidad es eso, los contato generalmente y en el",
        "start": 3596.7999999999997,
        "end": 3604.8799999999997
    },
    {
        "text": " general de ustedes es muchísima rotación de gente que muchísimos oportunidades, bueno, se da justamente",
        "start": 3604.8799999999997,
        "end": 3612.0
    },
    {
        "text": " la verdad esa es la guerra, vamos por el gran recomillas para ver quién consigue los mejores",
        "start": 3612.0,
        "end": 3620.0
    },
    {
        "text": " profesionales, ¿no? Y bueno, la realidad es que los abogados tratamos de defender a nuestros clientes y por eso",
        "start": 3620.0,
        "end": 3628.6
    },
    {
        "text": " deponemos a los empleados, a los clientes, a los proveedores, cláusulas de todo tipo, pero así es así.",
        "start": 3628.6,
        "end": 3635.04
    },
    {
        "text": " Bien, no faltaba dentro de todo la secaja de herramientas que yo le decía, hablóles un poco de derechos",
        "start": 3636.0,
        "end": 3643.0
    },
    {
        "text": " de autor que en definitiva es el instrumento que Uruguay acepta para proteger el software, software",
        "start": 3643.0,
        "end": 3649.96
    },
    {
        "text": " tal cual, ¿no? Si el software está sucede a un aparato, podría llegar a protegerlo por patentes,",
        "start": 3649.96,
        "end": 3656.32
    },
    {
        "text": " pero solamente el software que utiliza en el funcionamiento del aparato. Bueno, ¿por qué protegimos por",
        "start": 3657.52,
        "end": 3664.7599999999998
    },
    {
        "text": " derechos de autor? Bueno, derechos de autor también me da una protección internacional y además",
        "start": 3664.76,
        "end": 3672.1200000000003
    },
    {
        "text": " me permite proteger toda obra, toda creación, intelectual, original expresada en una forma reproducible,",
        "start": 3672.1200000000003,
        "end": 3680.32
    },
    {
        "text": " ¿sí? ¿Qué es lo que se protege? Bueno, se protege en las formas del dominio literario, artístico o",
        "start": 3680.32,
        "end": 3686.5600000000004
    },
    {
        "text": " científico, la creación debe ser original, vean la diferencia, la creación debe ser original,",
        "start": 3686.5600000000004,
        "end": 3693.2000000000003
    },
    {
        "text": " no no vedosa, ¿sí? Hay una diferencia muy importante entre el concepto de novedad y el concepto",
        "start": 3693.2,
        "end": 3700.8399999999997
    },
    {
        "text": " de originalidad. Y esto es importante que lo tengan claro porque es la base por la cual el software",
        "start": 3700.8399999999997,
        "end": 3708.4399999999996
    },
    {
        "text": " no es patentable en parte del mundo, que justamente el concepto de novedad tan cual lo establece el",
        "start": 3708.4399999999996,
        "end": 3716.24
    },
    {
        "text": " sistema de patent. Esa novedad que yo les decía calificada, esa novedad que implica que un invento",
        "start": 3716.24,
        "end": 3722.7999999999997
    },
    {
        "text": " tenga que ser, ¿verdad? Este nuevo, pero además que vaya un paso más allá es decir algo que realmente",
        "start": 3722.7999999999997,
        "end": 3731.04
    },
    {
        "text": " demuestre que hay una actividad inventiva, ¿verdad? Un desarrollo que determina un producto nuevo o",
        "start": 3731.04,
        "end": 3739.12
    },
    {
        "text": " diferente. En este caso no es así, en este caso los derechos de autorprotegen, creaciones,",
        "start": 3739.12,
        "end": 3745.2799999999997
    },
    {
        "text": " intelectuales, del dominio literario, artístico, científico, originales. Y esto, el concepto original",
        "start": 3745.2799999999997,
        "end": 3754.0
    },
    {
        "text": " y la distinto porque yo puedo establecer distintas formas de reproducir la misma idea y sin embargo",
        "start": 3754.0,
        "end": 3763.48
    },
    {
        "text": " considerar las todas ellas originales para vamos a dar algunos ejemplos. También es independiente",
        "start": 3763.48,
        "end": 3769.44
    },
    {
        "text": " del destino género o mérito, es decir, no importa si es en el caso de las patentes es necesario",
        "start": 3769.44,
        "end": 3776.6
    },
    {
        "text": " que tenga una aplicación industrial. En el caso del derecho de autor no es necesario que",
        "start": 3776.6,
        "end": 3781.64
    },
    {
        "text": " tenga una aplicación concreta, no es necesario que se establezca que género es ni tampoco es necesario",
        "start": 3781.64,
        "end": 3788.4
    },
    {
        "text": " que se establezca si sirve o no sirve. Si es lindo, feo, si gusta o no gusta, el mérito de la obra no",
        "start": 3788.4,
        "end": 3795.2400000000002
    },
    {
        "text": " es importante. Y la protección en el caso del derecho de autor no está sujeto a una formalidad,",
        "start": 3795.2400000000002,
        "end": 3800.88
    },
    {
        "text": " es decir, no hay un procedimiento de aprobación como el caso de las patentes, donde hay un estudio,",
        "start": 3800.88,
        "end": 3806.36
    },
    {
        "text": " donde hay una resolución donde el Estado concede el monopolio. Acá no es así, acá una vez que yo",
        "start": 3806.36,
        "end": 3812.96
    },
    {
        "text": " creo la obra tengo la protección.",
        "start": 3812.96,
        "end": 3815.4
    },
    {
        "text": " Andrea, hay un par de preguntas. Capajita bueno que te salga, chicos, pero una empieza",
        "start": 3818.4,
        "end": 3826.2400000000002
    },
    {
        "text": " a preguntar si no es muy subjetivo eso de original.",
        "start": 3826.2400000000002,
        "end": 3829.44
    },
    {
        "text": " Claro, es totalmente subjetivo, totalmente difícil de entender, acá por eso les puse dos",
        "start": 3829.44,
        "end": 3838.12
    },
    {
        "text": " ejemplos de la Virgen María, porque vean ustedes la idea de la Virgen María, que es un icono",
        "start": 3838.12,
        "end": 3844.3199999999997
    },
    {
        "text": " religioso, católico que todo el mundo conoce y que a nivel internacional todos los autores la han",
        "start": 3844.3199999999997,
        "end": 3851.04
    },
    {
        "text": " retratado, ocultido, verdad, de todas las maneras posibles, es una idea que no le pertenece a nadie y",
        "start": 3851.04,
        "end": 3858.88
    },
    {
        "text": " que cada autor, verdad, va a demostrar la idea que tiene a través de su propia obra y acá les",
        "start": 3858.88,
        "end": 3866.44
    },
    {
        "text": " muestros dos ejemplos. Nadie puede decir que el monumento a la santísima Virgen María del",
        "start": 3866.44,
        "end": 3873.04
    },
    {
        "text": " Mendozino Ramón Villarreal de 1983 tiene relación con la piedad de Miguel Ángel y sin embargo estamos",
        "start": 3873.04,
        "end": 3881.76
    },
    {
        "text": " hablando de la Virgen María, ¿sí entienden? Entonces lo que importa en este caso no es la idea en sí,",
        "start": 3881.76,
        "end": 3890.48
    },
    {
        "text": " sino la expresión de la idea y para irnos a algo que lo conocen más ustedes acá tienen",
        "start": 3890.48,
        "end": 3897.84
    },
    {
        "text": " expresiones de la misma idea y es por eso que el derecho de autor funciona para el software y es",
        "start": 3897.84,
        "end": 3905.2400000000002
    },
    {
        "text": " por eso que la mayoría de la neta se tira que tiene que hacer derechos de autor y no patentes,",
        "start": 3905.2400000000002,
        "end": 3910.32
    },
    {
        "text": " porque si fuera patentes el primero que hubiera hecho un procesador de texto hubiera sido el único",
        "start": 3910.32,
        "end": 3917.72
    },
    {
        "text": " que lo podía proteger y los demás tuvieron el trabajo al mercado jamás, bueno no 20 años después,",
        "start": 3917.72,
        "end": 3923.16
    },
    {
        "text": " sí, 20 años después con copias, ¿no? Sí, monopólio, el monopólio lo tiene uno solo, el primero,",
        "start": 3923.16,
        "end": 3931.04
    },
    {
        "text": " se entendió esto?",
        "start": 3932.16,
        "end": 3933.24
    },
    {
        "text": " Sí, sí, sí, sí, sí, y no sé si contesté la pregunta que me hiciste Jorge, ¿hay alguna pregunta más? Si no",
        "start": 3935.68,
        "end": 3942.72
    },
    {
        "text": " seguimos. ¿Qué me reficio te da tener el monopólio a hacer el primero? Bueno, en el caso de las",
        "start": 3942.72,
        "end": 3949.56
    },
    {
        "text": " patentes el beneficio de tener el monopólio de tener una patente es que nadie más como te decía,",
        "start": 3949.56,
        "end": 3954.72
    },
    {
        "text": " hace un rato, si vos mirás los derechos, yo igual esto se les voy a dejar, bueno, me imagino,",
        "start": 3954.72,
        "end": 3959.3599999999997
    },
    {
        "text": " ya lo tienen, oí me pase, no, no me pase, mira, en ese derecho usaba patente solito, en ese",
        "start": 3959.3599999999997,
        "end": 3968.7599999999998
    },
    {
        "text": " derecho transmitir la que vos quieras, a impedir que tercero fabricen, venda no utilicen importan",
        "start": 3968.76,
        "end": 3974.0800000000004
    },
    {
        "text": " almacenen, o sea, esto significa por 20 años, nadie puede hacer absolutamente nada que lesione tus",
        "start": 3974.0800000000004,
        "end": 3983.32
    },
    {
        "text": " derechos a esa invención. Claro, yo le decía luego de los 20 años, luego de los 20 años todos te copian,",
        "start": 3983.32,
        "end": 3990.8
    },
    {
        "text": " salen a todo el mercado. Pensé que tener el monopólio a hacer el primero después los 20 años",
        "start": 3990.8,
        "end": 3997.36
    },
    {
        "text": " que a pues que tenías algo... No, le echiste. No, bueno, yo que sé, vas a hacer siempre el que",
        "start": 3997.36,
        "end": 4003.6000000000004
    },
    {
        "text": " descubriste, o el que inventaste tal cosa, eso está clarísimo, pero en la parte moral que yo te",
        "start": 4003.6000000000004,
        "end": 4009.0
    },
    {
        "text": " decía, eso no lo perdiste, no, pero no vas a hacer siempre el primero, ¿no? Pero bueno,",
        "start": 4009.0,
        "end": 4014.92
    },
    {
        "text": " es como, yo le no sé, medicamentos se ve mucho, ustedes lo tienen que ver muy claramente con un",
        "start": 4014.92,
        "end": 4020.48
    },
    {
        "text": " medicamento, ¿cómo ustedes vienen un medicamento? No sé, un oncológico nuevo, cuando lo van a comprar",
        "start": 4020.48,
        "end": 4027.2400000000002
    },
    {
        "text": " al mercado, ¿cuánto cuesta un medicamento oncológico nuevo? 4, 5, 6, 8, 10, 10, 10, 10, 10",
        "start": 4027.2400000000002,
        "end": 4034.48
    },
    {
        "text": " pesos por semana, para un paciente, lo hemos visto. Cuando vos tenés un producto que pasó el",
        "start": 4034.48,
        "end": 4044.52
    },
    {
        "text": " dominio público y empiezan a ver genericos, ¿cuánto vale el ibuprofeno? Muchachos. Entiendan",
        "start": 4044.52,
        "end": 4051.6
    },
    {
        "text": " lo que les digo, o sea, el primer, la primera vez que salió el ibuprofeno tenía un precio,",
        "start": 4051.6,
        "end": 4056.28
    },
    {
        "text": " digo, ahora el ibuprofeno, con todas las marcas, ubican todos los que se le hubo profeno, ¿no?",
        "start": 4056.28,
        "end": 4061.88
    },
    {
        "text": " Es eso. Yo que es el perifar, el ibupirac, yo que es la cantidad, el actrón, todo eso sí",
        "start": 4061.88,
        "end": 4069.08
    },
    {
        "text": " el ibuprofeno, ¿por qué tenemos tantas marcas de ibuprofeno? Porque el ibuprofeno está",
        "start": 4069.08,
        "end": 4075.2
    },
    {
        "text": " la economía público, ¿entienden? Entonces, todos copian y bueno, y por supuesto hay competencia",
        "start": 4075.2,
        "end": 4084.0
    },
    {
        "text": " en los productos, son cológicos, en los antirrotrovirales, en los medicamentos que estoy poniendo",
        "start": 4084.0,
        "end": 4092.2
    },
    {
        "text": " un ejemplo de la industria farmacéutica, porque es la que depende más del sistema de patentes",
        "start": 4092.2,
        "end": 4095.72
    },
    {
        "text": " en lo que es Uruguay, ¿no? Pues la vacuna con la vacuna para el COVID, ¿sabes?",
        "start": 4095.72,
        "end": 4099.96
    },
    {
        "text": " Eso es eso. La vacuna para el COVID todavía no fue patentada, porque las patentes demoran",
        "start": 4099.96,
        "end": 4104.92
    },
    {
        "text": " cuatro, cinco años en concederlas. Entonces, todavía no tenemos evidencia que hayan presentado",
        "start": 4104.92,
        "end": 4112.28
    },
    {
        "text": " la patente en algún país del mundo, porque cuando tú presentas la patente tienes 18 meses",
        "start": 4112.28,
        "end": 4116.92
    },
    {
        "text": " para publicarla, y todavía no pasaron 18 meses, entonces todavía no se publicó ninguna",
        "start": 4116.92,
        "end": 4122.12
    },
    {
        "text": " parte del mundo, ¿no sabemos si está presentada? Pero qué onda con eso? Porque hay en la",
        "start": 4122.12,
        "end": 4127.5599999999995
    },
    {
        "text": " pude, si hay en la patenta, ponen el que patenta la Pfizer que hace, sino, por ejemplo.",
        "start": 4127.5599999999995,
        "end": 4133.76
    },
    {
        "text": " Bueno, sí, hay que ver si es igual o no, porque no es la misma vacuna, ¿díteres son tecnologías",
        "start": 4133.76,
        "end": 4139.24
    },
    {
        "text": " en fin? Ah, ¿vódeis? Está, está, bien, bien, está, pero el concepto es como lo de María",
        "start": 4139.24,
        "end": 4144.36
    },
    {
        "text": " la comedia de la vigen María. No, no es lo mismo, porque es patentes, ¿no es lo mismo?",
        "start": 4144.36,
        "end": 4149.88
    },
    {
        "text": " No es lo mismo, yo tengo que tener un producto nuevo, ¿no? En el caso de la, o sea, en el caso",
        "start": 4150.4400000000005,
        "end": 4156.6
    },
    {
        "text": " de la vacuna de Pfizer, justamente estudió el tema, pues me lo pidieron que lo estudiara,",
        "start": 4156.6,
        "end": 4161.88
    },
    {
        "text": " lo que está patentado la tecnología, verdad, de la DNA mensajero. Eso que significa, significa",
        "start": 4161.88,
        "end": 4168.8
    },
    {
        "text": " que la DNA mensajero le pertenece a una empresa, la forma de la síntesis por DNA mensajero,",
        "start": 4168.8,
        "end": 4176.4800000000005
    },
    {
        "text": " le pertenece a una empresa que fa esa, ¿no? Pero entonces la vacuna que es por la clásica,",
        "start": 4176.48,
        "end": 4183.799999999999
    },
    {
        "text": " ¿no? Que es que te inyectan el virus medio muerto algo así o inactivo. Creo que no es como",
        "start": 4183.799999999999,
        "end": 4189.719999999999
    },
    {
        "text": " la mayoría de las vacunas que hacen que actúan de esa forma, entonces si hay que patentar",
        "start": 4189.719999999999,
        "end": 4194.44
    },
    {
        "text": " a eso, nadie podría, o sea, solo se podría sentir de lo que quiere decir, ¿tá, Palomín?",
        "start": 4194.44,
        "end": 4198.759999999999
    },
    {
        "text": " Yo voy a te voy a explicar la técnica de insectar un virus inactivado en un vehículo,",
        "start": 4198.76,
        "end": 4204.88
    },
    {
        "text": " ¿tá? Eso está en el dominio público. Pero cuando vos haces una formulación, sobre la",
        "start": 4204.88,
        "end": 4210.400000000001
    },
    {
        "text": " base de un conocimiento dominio público, pero para algo en particular que no se conocía",
        "start": 4210.400000000001,
        "end": 4214.72
    },
    {
        "text": " antes, se considera nuevo. ¿Centiendes? No podés apropiarte de la tecnología, pero sí",
        "start": 4214.72,
        "end": 4222.96
    },
    {
        "text": " podés apropiarte de la formulación de una vacuna singular. ¿Y eso es porque es novedoso,",
        "start": 4222.96,
        "end": 4229.08
    },
    {
        "text": " ¿no? Porque es novedoso, o sea, vos podés patentar el producto, podés patentar el proceso,",
        "start": 4229.08,
        "end": 4235.52
    },
    {
        "text": " podés patentar el uso. Entonces lo que vos estudias en la estrategia de protección es que de todo",
        "start": 4235.52,
        "end": 4244.08
    },
    {
        "text": " eso podés protege. ¿Cuál es en un producto famoséptico la patente más abarcativa? Bueno,",
        "start": 4244.08,
        "end": 4251.36
    },
    {
        "text": " es la patente de producto químico. Si yo tengo la patente del ingrediente activo,",
        "start": 4251.36,
        "end": 4256.04
    },
    {
        "text": " decir de el ibuprofeno, o si es algo o de la piscilina, ¿tá? Yo soy vuela en un producto",
        "start": 4256.04,
        "end": 4262.679999999999
    },
    {
        "text": " en el mundo. Bueno, en los países donde lo protege, supongan que el mundo. Por lo tanto,",
        "start": 4262.679999999999,
        "end": 4269.2
    },
    {
        "text": " nadie más va a poder usar, nadie va a poder asformular un producto con ese principio activo.",
        "start": 4269.2,
        "end": 4276.32
    },
    {
        "text": " Ahora bien, pasan 20 años, el ibuprofeno pasa al dominio público y van a poder",
        "start": 4276.32,
        "end": 4283.08
    },
    {
        "text": " formular este producto, todos los que quieren. Mañana viene Espefar y hace un profeno flex,",
        "start": 4283.08,
        "end": 4292.48
    },
    {
        "text": " porque tiene un relajante muscular, y ahí ya me olvides de cuál el relajante muscular tiene.",
        "start": 4292.48,
        "end": 4298.679999999999
    },
    {
        "text": " Esa combinación de dos productos que son conocidos en nueva. Nadie en la reporta antes,",
        "start": 4298.679999999999,
        "end": 4304.759999999999
    },
    {
        "text": " la va a poder patentar. 20 años de ese producto. ¿Entienden? Está clarito.",
        "start": 4304.76,
        "end": 4311.360000000001
    },
    {
        "text": " Está claro. Hay una good chat sobre un poquito, entiendo que es la diferencia entre patentar",
        "start": 4311.360000000001,
        "end": 4319.08
    },
    {
        "text": " y derecho autor. A ver si es más genera que la otra o si es más diversidad o no. Son distintas,",
        "start": 4319.08,
        "end": 4327.08
    },
    {
        "text": " o sea, tú vas a tener exclusividad sobre la obra que hiciste, porque acá también del sumo",
        "start": 4327.08,
        "end": 4333.400000000001
    },
    {
        "text": " de la obra. Vamos a ver los derechos que tenés. No es que Microsoft no tenga derechos sobre",
        "start": 4333.4,
        "end": 4339.879999999999
    },
    {
        "text": " su sistema operativo, ni Apple sobre su sistema operativo, por supuesto que sí. Lo que pasa",
        "start": 4339.879999999999,
        "end": 4347.639999999999
    },
    {
        "text": " la diferencia es que ambos son en su tipo originales y pueden convivir. Si fueran patentables,",
        "start": 4347.639999999999,
        "end": 4357.5599999999995
    },
    {
        "text": " no serían, no podrían convivir. Es muy difícil. Podría convivir un pedacito de repente.",
        "start": 4357.56,
        "end": 4363.8
    },
    {
        "text": " No sé, una cosa que se había que en algún momento se patenta fue el doble clic, el doble clic",
        "start": 4363.8,
        "end": 4369.360000000001
    },
    {
        "text": " del ratón. ¿Está en los que se erdoña el doble clic? Si vos se erdoña el doble clic,",
        "start": 4369.360000000001,
        "end": 4377.080000000001
    },
    {
        "text": " nadie puede hacer doble clic en ningún programa. Es una locura y eso pasa en Estados Unidos",
        "start": 4377.080000000001,
        "end": 4383.52
    },
    {
        "text": " solamente porque en Estados Unidos todo es patentable. Entonces acá no te patentan el doble clic,",
        "start": 4383.52,
        "end": 4390.120000000001
    },
    {
        "text": " no te lo protejen de ninguna manera. Entiendo lo que les dijo, o sea, y podemos discutir a muerte",
        "start": 4390.120000000001,
        "end": 4398.92
    },
    {
        "text": " si hacer doble clic en un icono, eso no es loco. Desde el punto de vista técnico, capaz que",
        "start": 4398.92,
        "end": 4408.56
    },
    {
        "text": " lo iran su momento. Yo lo digo que no, la primera vez que se les ocurrió eso,",
        "start": 4408.56,
        "end": 4413.280000000001
    },
    {
        "text": " que yo ser brillante, maravilloso, pero yo si yo me hago dueño del doble clic, entonces nadie va",
        "start": 4413.280000000001,
        "end": 4421.120000000001
    },
    {
        "text": " a poder abrir una aplicación con un doble clic. Le voy a estar en contra de otra manera de",
        "start": 4421.120000000001,
        "end": 4425.68
    },
    {
        "text": " haber una aplicación, pero no un doble clic. Se entiende lo que digo por 20 años.",
        "start": 4425.68,
        "end": 4431.52
    },
    {
        "text": " O vender eso, o vender. Si licenciar. Licenciarle a patente del doble clic.",
        "start": 4432.080000000001,
        "end": 4440.160000000001
    },
    {
        "text": " Claro, eso es lo que se hacen Samsung y Apple con los teléfonos, se licencian entre sí, se cruza",
        "start": 4440.160000000001,
        "end": 4447.4800000000005
    },
    {
        "text": " las licencias, porque yo tengo una cosa, pues tenéis otra y además viste en general,",
        "start": 4447.4800000000005,
        "end": 4453.52
    },
    {
        "text": " encuentran la manera de neutralizarse. Entonces yo no te dejo usar esto, bueno, me resusó",
        "start": 4453.52,
        "end": 4459.120000000001
    },
    {
        "text": " lo otro, termina negociando, no tengo otra. Pero ese es un sistema para un verso que se maneja",
        "start": 4459.12,
        "end": 4465.72
    },
    {
        "text": " a nivel de norteamericano por el sistema de protección que tiene. Acá no pasa eso, acá podrían",
        "start": 4465.72,
        "end": 4471.68
    },
    {
        "text": " convivir porque como les digo, las ideas, en ese caso, se dían forma distintas expresiones de una",
        "start": 4471.68,
        "end": 4478.12
    },
    {
        "text": " idea. Y ahí estaríamos en esto que yo les decía ahora. Y ahí me da pregunta acá, ¿qué pasa?",
        "start": 4478.12,
        "end": 4485.68
    },
    {
        "text": " Odigos, tienen tres códigos fuentes distintos estos programas. Suficientemente distintos para considerarse",
        "start": 4485.68,
        "end": 4492.88
    },
    {
        "text": " originales. ¿Está? Y preguntan qué pasa así sin saberlo, hace algo muy parecido, algo que ya está",
        "start": 4492.88,
        "end": 4499.92
    },
    {
        "text": " patentado. Bueno, eso pasa todo el tiempo. Y en realidad la buena práctica es hacer una buqueda",
        "start": 4499.92,
        "end": 4510.360000000001
    },
    {
        "text": " de patentes antes de salir al mercado con un producto. Si yo sé que mi producto puede tener algo",
        "start": 4510.36,
        "end": 4515.759999999999
    },
    {
        "text": " patentado que puede infrigir la patente de otro, es de buena práctica hacer un estudio del estado de la",
        "start": 4515.759999999999,
        "end": 4522.36
    },
    {
        "text": " técnica en forma previa. Hay sectores de la tecnología que no tienen otra. Los laboratorios farmacéuticos,",
        "start": 4522.36,
        "end": 4528.839999999999
    },
    {
        "text": " por eso yo voy clasen química de estos temas porque ellos se les van a vida en esto. O sea,",
        "start": 4528.839999999999,
        "end": 4534.12
    },
    {
        "text": " ningún laboratorio farmacéutico saca un producto en mercado sin hacer un estudio por menorizado de",
        "start": 4534.12,
        "end": 4539.08
    },
    {
        "text": " patentes, no tienen otra. En el software no se da esto porque en el software lo que tenemos son",
        "start": 4539.08,
        "end": 4544.64
    },
    {
        "text": " derechos de autor. A ver, no quiere decir que tú no puedes copiar código fuente, pero bueno, en",
        "start": 4544.64,
        "end": 4550.36
    },
    {
        "text": " definitiva, si no copias el código fuente y desarrollaste una idea similar pero de una forma",
        "start": 4550.36,
        "end": 4555.36
    },
    {
        "text": " diferente va a ser original y por lo tanto no vas a tener este problema. Ahora bien, si ese",
        "start": 4555.36,
        "end": 4561.92
    },
    {
        "text": " mismo software no vas a llevar a Estados Unidos donde sí es patentable, bueno, ahí vas a tener que",
        "start": 4561.92,
        "end": 4567.64
    },
    {
        "text": " estudiar en insitu en el país si le está violando la patente de algo. ¿Se entendió?",
        "start": 4567.64,
        "end": 4574.0
    },
    {
        "text": " Y esto se hace mucho, porque bueno, es de las cosas en las cuales yo me dedico. No hay otra.",
        "start": 4576.12,
        "end": 4582.280000000001
    },
    {
        "text": " O sea, los juicios pueden ser millonarios. Es la diferencia entre que una empresa",
        "start": 4582.280000000001,
        "end": 4587.360000000001
    },
    {
        "text": " sobreviva y se une éxito a su Cuba. Bueno, ¿qué cara el terística tiene verdad?",
        "start": 4587.36,
        "end": 4597.639999999999
    },
    {
        "text": " El derecho de autor. El derecho de autor no es por 20 años. Fíjense que es toda la vida del",
        "start": 4597.639999999999,
        "end": 4602.88
    },
    {
        "text": " autor y 70 años después de su muerte. Siempre los autores son personas físicas, aunque después",
        "start": 4602.88,
        "end": 4611.16
    },
    {
        "text": " eso le pertenezco una empresa. Por supuesto, no este territorial no se requiere una protección",
        "start": 4611.16,
        "end": 4619.44
    },
    {
        "text": " país por país como en el caso de las patentes, no se requiere tampoco ningún tipo de inscripción",
        "start": 4619.44,
        "end": 4625.28
    },
    {
        "text": " y si se recomienda la inscripción de la biblioteca nacional a Canurúayo en las bibliotecas nacionales",
        "start": 4625.28,
        "end": 4632.48
    },
    {
        "text": " de los países que les puedan interesar, más que nada como un mecanismo de prueba,",
        "start": 4632.48,
        "end": 4637.88
    },
    {
        "text": " de que fuiste el primero que resolvió ese tema de esa forma o que escribió ese código",
        "start": 4637.88,
        "end": 4645.4400000000005
    },
    {
        "text": " de esa forma. Bueno, una pregunta. ¿Qué pasa si es más de uno o una empresa?",
        "start": 4645.4400000000005,
        "end": 4655.64
    },
    {
        "text": " ¿Cómo si es más de una persona? Que es tipo toda su vida y 70 años después de su muerte.",
        "start": 4657.32,
        "end": 4665.52
    },
    {
        "text": " Pero ¿qué pasa si no se registra el nombre de una persona?",
        "start": 4665.52,
        "end": 4668.280000000001
    },
    {
        "text": " No, siempre se rey, siempre se pone el nombre del del autor.",
        "start": 4669.56,
        "end": 4672.6
    },
    {
        "text": " Y si fue más un autor.",
        "start": 4673.120000000001,
        "end": 4674.88
    },
    {
        "text": " Si si fomos de un autor son 70 años después del último que se muere.",
        "start": 4675.56,
        "end": 4679.400000000001
    },
    {
        "text": " OK.",
        "start": 4680.0,
        "end": 4680.360000000001
    },
    {
        "text": " Y siempre va a una persona física. Nunca va a...",
        "start": 4682.280000000001,
        "end": 4685.200000000001
    },
    {
        "text": " No, lo que pasa que está relacionado con una persona física, pero el una cosa es el autor y otra",
        "start": 4686.200000000001,
        "end": 4694.4400000000005
    },
    {
        "text": " cosa es la titularidad del derecho de autor. Son dos cosas distintas.",
        "start": 4694.44,
        "end": 4698.639999999999
    },
    {
        "text": " Lo mismo pasa en patentes.",
        "start": 4698.879999999999,
        "end": 4700.32
    },
    {
        "text": " Yo tengo el inventor que el inventor siempre es una persona física, una empresa no puede inventar nada.",
        "start": 4700.599999999999,
        "end": 4705.32
    },
    {
        "text": " Muchachos por una empresa es una persona jurídica.",
        "start": 4705.32,
        "end": 4707.599999999999
    },
    {
        "text": " Las personas jurídicas no inventan nada.",
        "start": 4707.96,
        "end": 4709.96
    },
    {
        "text": " Y yo siempre digo, las personas jurídicas no se cazan, no inventan.",
        "start": 4710.48,
        "end": 4714.599999999999
    },
    {
        "text": " ¿Verdad? No se han nada.",
        "start": 4714.879999999999,
        "end": 4716.32
    },
    {
        "text": " ¿Por qué? Porque son libros, ¿Verdad? Porque son estatutos.",
        "start": 4716.5599999999995,
        "end": 4721.2
    },
    {
        "text": " Entonces, siempre el que va a generar conocimientos es una persona física.",
        "start": 4721.5599999999995,
        "end": 4725.92
    },
    {
        "text": " Por eso el plazo está asociado a la vida del autor.",
        "start": 4726.04,
        "end": 4731.08
    },
    {
        "text": " Ahora, el autor tiene por qué ser el titular.",
        "start": 4731.76,
        "end": 4734.36
    },
    {
        "text": " ¿Titular? En lo mismo que propietario.",
        "start": 4735.76,
        "end": 4738.28
    },
    {
        "text": " Entonces, en general, las obras nacen en el autor.",
        "start": 4739.24,
        "end": 4744.36
    },
    {
        "text": " Es decir, el autor es de alguna manera el titular original.",
        "start": 4744.76,
        "end": 4749.32
    },
    {
        "text": " Ahora, si el autor lo está haciendo en relación de dependencia",
        "start": 4749.639999999999,
        "end": 4754.04
    },
    {
        "text": " y ya tiene un contrato para desarrollar,",
        "start": 4754.599999999999,
        "end": 4757.88
    },
    {
        "text": " entonces el titular va a ser la empresa directamente.",
        "start": 4758.28,
        "end": 4760.799999999999
    },
    {
        "text": " Por eso, todos los formularios que ustedes tienen en las bibliotecas nacionales dicen",
        "start": 4761.0,
        "end": 4764.44
    },
    {
        "text": " autor titular.",
        "start": 4764.799999999999,
        "end": 4766.5599999999995
    },
    {
        "text": " ¿Puedes poner la misma persona o no?",
        "start": 4767.679999999999,
        "end": 4769.679999999999
    },
    {
        "text": " El autor, el Jorge Gorral, el titular es la empresa para la cual trabaja.",
        "start": 4770.2,
        "end": 4774.84
    },
    {
        "text": " ¿Entienden?",
        "start": 4777.0,
        "end": 4777.679999999999
    },
    {
        "text": " Perfecto.",
        "start": 4778.12,
        "end": 4778.799999999999
    },
    {
        "text": " Igual el plazo está asociado a la vida del Jorge.",
        "start": 4778.96,
        "end": 4782.04
    },
    {
        "text": " Que ojalá sea la habla.",
        "start": 4783.360000000001,
        "end": 4784.400000000001
    },
    {
        "text": " Bueno, me olvides de Waldeen.",
        "start": 4787.360000000001,
        "end": 4789.12
    },
    {
        "text": " ¿Por qué tenemos 70 años después de su muerte?",
        "start": 4789.96,
        "end": 4793.24
    },
    {
        "text": " Bueno, ¿por qué antes era 50 años después del amor del autor?",
        "start": 4793.72,
        "end": 4797.28
    },
    {
        "text": " Y les cuento que el tema era justamente Mickey Mouse.",
        "start": 4797.72,
        "end": 4800.92
    },
    {
        "text": " Waldeen, ¿eh? Era la persona la cual estaba asociado a los derechos de autor de Mickey Mouse.",
        "start": 4801.400000000001,
        "end": 4806.0
    },
    {
        "text": " Y como ustedes saben, le está cogelado de hombre.",
        "start": 4806.48,
        "end": 4808.88
    },
    {
        "text": " Y ya estaba llegando los 50 años después de su muerte.",
        "start": 4809.56,
        "end": 4813.24
    },
    {
        "text": " Y se decidió pasar a 70 años precisamente para aumentar el plazo de protección",
        "start": 4813.92,
        "end": 4821.08
    },
    {
        "text": " para Waldeen, ¿eh?",
        "start": 4821.4,
        "end": 4822.28
    },
    {
        "text": " Pero la acción, ¿eh?",
        "start": 4822.28,
        "end": 4823.24
    },
    {
        "text": " O sea, no hay malinitada no sé cómo es.",
        "start": 4823.24,
        "end": 4824.8
    },
    {
        "text": " Pero además, les cuento que ahora ya estamos llegando a los 70 años",
        "start": 4826.84,
        "end": 4831.56
    },
    {
        "text": " de la muerte de Waldeen, ¿eh?",
        "start": 4831.56,
        "end": 4832.8
    },
    {
        "text": " Y se está discutiendo llegar a los 100 años.",
        "start": 4833.400000000001,
        "end": 4836.4800000000005
    },
    {
        "text": " Se afiquen el poder que tienen las empresas.",
        "start": 4838.56,
        "end": 4841.08
    },
    {
        "text": " O sea, se está discutiendo a nivel internacional",
        "start": 4841.76,
        "end": 4844.28
    },
    {
        "text": " a aumentar el plazo de protección del derecho de autor",
        "start": 4844.64,
        "end": 4847.360000000001
    },
    {
        "text": " para seguir aumentando las regalías",
        "start": 4847.84,
        "end": 4850.4800000000005
    },
    {
        "text": " de que recibe una empresa",
        "start": 4851.12,
        "end": 4853.76
    },
    {
        "text": " porque se está llegando a la fecha de caducidad de esos derechos.",
        "start": 4854.28,
        "end": 4860.320000000001
    },
    {
        "text": " Yo creo que en software esto es medio ridículo.",
        "start": 4862.88,
        "end": 4865.360000000001
    },
    {
        "text": " Yo no sé si un sistema va a durar",
        "start": 4865.96,
        "end": 4870.12
    },
    {
        "text": " toda la vida de un doctor y 70 o 100 años después de la muerte, ¿eh?",
        "start": 4870.320000000001,
        "end": 4874.56
    },
    {
        "text": " Conscierando la velocidad que tienen ustedes",
        "start": 4874.56,
        "end": 4877.2
    },
    {
        "text": " en el área tecnológica, ¿no?",
        "start": 4877.76,
        "end": 4880.4400000000005
    },
    {
        "text": " Pero bueno, quizás pueda tener sentido en otras áreas.",
        "start": 4881.04,
        "end": 4884.8
    },
    {
        "text": " Obviamente, Mickey Mouse sigue siendo importante.",
        "start": 4885.88,
        "end": 4888.88
    },
    {
        "text": " No sólo Mickey Mouse.",
        "start": 4888.96,
        "end": 4890.2
    },
    {
        "text": " Hay otros también.",
        "start": 4890.88,
        "end": 4892.360000000001
    },
    {
        "text": " Sinacho.",
        "start": 4893.4400000000005,
        "end": 4894.4400000000005
    },
    {
        "text": " No, en realidad, quería preguntar,",
        "start": 4895.4400000000005,
        "end": 4897.400000000001
    },
    {
        "text": " llegado el momento que pasen los 70 o los 100 años o lo tiempo que pase,",
        "start": 4898.04,
        "end": 4903.52
    },
    {
        "text": " hay que pasar con Mickey Mouse y todas las figuras de Inespacer,",
        "start": 4903.8,
        "end": 4906.2
    },
    {
        "text": " alzar de la familia público.",
        "start": 4906.2,
        "end": 4907.28
    },
    {
        "text": " Claro, claro.",
        "start": 4907.28,
        "end": 4908.28
    },
    {
        "text": " Claro.",
        "start": 4908.28,
        "end": 4909.28
    },
    {
        "text": " Claro.",
        "start": 4909.28,
        "end": 4910.28
    },
    {
        "text": " Pasan al hacer de la familia público y entonces cualquiera puede sacar",
        "start": 4911.320000000001,
        "end": 4914.92
    },
    {
        "text": " camisetas con Mickey Mouse, ¿verdad?",
        "start": 4914.92,
        "end": 4917.320000000001
    },
    {
        "text": " O cualquier otro de los personajes de Vindex,",
        "start": 4917.320000000001,
        "end": 4919.72
    },
    {
        "text": " los viejos personajes de Vindex, ¿no?",
        "start": 4920.2,
        "end": 4921.96
    },
    {
        "text": " Claro, seguramente.",
        "start": 4921.96,
        "end": 4922.96
    },
    {
        "text": " Ok, dibujo o Disney.",
        "start": 4922.96,
        "end": 4925.28
    },
    {
        "text": " Seguramente.",
        "start": 4925.28,
        "end": 4926.28
    },
    {
        "text": " Hace muchos años que ya oí el Disney como ustedes comprenderán no dibuja más.",
        "start": 4926.28,
        "end": 4931.92
    },
    {
        "text": " No, no.",
        "start": 4932.64,
        "end": 4933.64
    },
    {
        "text": " Por suerte no dibuja más.",
        "start": 4933.64,
        "end": 4935.44
    },
    {
        "text": " Porque si no sería un fenómeno.",
        "start": 4936.28,
        "end": 4938.04
    },
    {
        "text": " Vendría más, sí, guay, papá.",
        "start": 4938.52,
        "end": 4940.04
    },
    {
        "text": " Ah, no, eso es tan claro.",
        "start": 4940.04,
        "end": 4941.64
    },
    {
        "text": " Eso es tan claro.",
        "start": 4941.64,
        "end": 4942.64
    },
    {
        "text": " Vendría un pregunta de orden porque nos queda media hora y también hay algunas preguntas.",
        "start": 4944.4,
        "end": 4949.44
    },
    {
        "text": " ¿Para qué quieres avanzar un poco más y después si me volverá preguntas?",
        "start": 4949.44,
        "end": 4953.12
    },
    {
        "text": " No sé, como quieras.",
        "start": 4953.12,
        "end": 4954.44
    },
    {
        "text": " Digo, ¿vose que yo soy abierta en esto?",
        "start": 4954.44,
        "end": 4956.639999999999
    },
    {
        "text": " Me gusta que participen, pero no me acuerdo cuántas nos quedan,",
        "start": 4956.639999999999,
        "end": 4961.24
    },
    {
        "text": " pero bueno, tratamos viendo eso.",
        "start": 4961.24,
        "end": 4962.24
    },
    {
        "text": " Mira, queda bastante más.",
        "start": 4962.24,
        "end": 4964.24
    },
    {
        "text": " Mira bastante.",
        "start": 4964.24,
        "end": 4965.24
    },
    {
        "text": " Viste que vos me dijiste que a chicar a la presentación igual no pasó la pitana.",
        "start": 4965.24,
        "end": 4969.919999999999
    },
    {
        "text": " No sé si no, no está.",
        "start": 4969.919999999999,
        "end": 4970.919999999999
    },
    {
        "text": " Yo no, te juro que no sé cómo hacer esto.",
        "start": 4970.919999999999,
        "end": 4973.24
    },
    {
        "text": " Bueno, a ver, lo más importante que hay interés, eso me gusta.",
        "start": 4973.24,
        "end": 4977.48
    },
    {
        "text": " Sí, está igual.",
        "start": 4977.48,
        "end": 4978.48
    },
    {
        "text": " Este no sé, digo, ¿quereje dejar las preguntas para el final?",
        "start": 4978.48,
        "end": 4982.32
    },
    {
        "text": " Ahí va, vamos a hacer un poco más y después me tengo preguntas.",
        "start": 4982.32,
        "end": 4985.24
    },
    {
        "text": " Bueno, vale.",
        "start": 4985.24,
        "end": 4986.24
    },
    {
        "text": " ¿Por qué protegemos por marcas?",
        "start": 4986.24,
        "end": 4988.04
    },
    {
        "text": " Este, bueno, las marcas, este, ya se los había puesto en el vídeo,",
        "start": 4988.04,
        "end": 4993.879999999999
    },
    {
        "text": " también tienen protección nacional e internacional, este, y bueno, la realidad",
        "start": 4993.879999999999,
        "end": 4999.32
    },
    {
        "text": " y qué tengo que ir país por país.",
        "start": 4999.32,
        "end": 5001.28
    },
    {
        "text": " Este, en este caso, no tengo una protección tan amplia como en derechos de autor,",
        "start": 5001.28,
        "end": 5005.799999999999
    },
    {
        "text": " que solamente creo la obra y tengo la protección, en este caso te okey,",
        "start": 5005.8,
        "end": 5011.76
    },
    {
        "text": " país por país, yo te registro la marca.",
        "start": 5011.76,
        "end": 5014.04
    },
    {
        "text": " Sí.",
        "start": 5014.04,
        "end": 5015.04
    },
    {
        "text": " Que me aporta una marca, me aporta distintividad, me aporta origen empresarial,",
        "start": 5015.04,
        "end": 5020.88
    },
    {
        "text": " es decir, el consumidor va a determinar el origen empresarial en función",
        "start": 5020.88,
        "end": 5027.04
    },
    {
        "text": " de justamente esa marca, va a decir, bueno, este, este producto me gusta,",
        "start": 5027.04,
        "end": 5031.96
    },
    {
        "text": " porque sapo, lo este producto me gusta, porque es Microsoft.",
        "start": 5031.96,
        "end": 5035.6
    },
    {
        "text": " También hay un tema de calidad, la marca está asociada a determinados estándares de calidad,",
        "start": 5035.6,
        "end": 5041.120000000001
    },
    {
        "text": " o sea, nosotros sabemos si elegimos determinar un producto,",
        "start": 5041.120000000001,
        "end": 5044.0
    },
    {
        "text": " porque tienes determinada marca que nos da nosotros una garantía de calidad.",
        "start": 5044.0,
        "end": 5049.0
    },
    {
        "text": " ¿Cuáles son los derechos que contienen las marcas?",
        "start": 5049.0,
        "end": 5051.88
    },
    {
        "text": " Bueno, el uso de la marca y impedir, verdad, que otros la use.",
        "start": 5051.88,
        "end": 5059.4800000000005
    },
    {
        "text": " Y además, el derecho a transmitir esa marca,",
        "start": 5059.4800000000005,
        "end": 5062.360000000001
    },
    {
        "text": " una marca como IBM, como Google,",
        "start": 5062.36,
        "end": 5064.88
    },
    {
        "text": " es verdad, como Microsoft, como Apple,",
        "start": 5064.88,
        "end": 5067.599999999999
    },
    {
        "text": " razón marcas que son vayosísimas, son activos muy importantes de las empresas,",
        "start": 5067.599999999999,
        "end": 5072.12
    },
    {
        "text": " que tienen un valor muy, muy importante, hay algunas marcas que ni siquiera",
        "start": 5072.12,
        "end": 5075.88
    },
    {
        "text": " se puede cuantificar el valor que tiene,",
        "start": 5075.88,
        "end": 5078.96
    },
    {
        "text": " por la importancia que tiene,",
        "start": 5078.96,
        "end": 5080.92
    },
    {
        "text": " pero son, generalmente, los activos más importantes que tiene una empresa.",
        "start": 5080.92,
        "end": 5085.16
    },
    {
        "text": " Bueno, ¿cuál es la estrategia de Google?",
        "start": 5087.96,
        "end": 5091.96
    },
    {
        "text": " Me refiero a la estrategia de protección de Google.",
        "start": 5091.96,
        "end": 5094.4800000000005
    },
    {
        "text": " Google tiene todo, tiene secretos,",
        "start": 5094.4800000000005,
        "end": 5096.8
    },
    {
        "text": " tienen los niños, tienen los hombres comerciales,",
        "start": 5096.8,
        "end": 5098.92
    },
    {
        "text": " tiene diseños, tienen derechos de autor,",
        "start": 5098.92,
        "end": 5101.32
    },
    {
        "text": " tiene más de 51.000 patentes en la última vez que revise la página,",
        "start": 5101.32,
        "end": 5107.0
    },
    {
        "text": " tiene marcas, o sea, tiene de todo,",
        "start": 5107.0,
        "end": 5111.24
    },
    {
        "text": " y el secreto de supermanencia no está solamente en diseñar productos,",
        "start": 5111.24,
        "end": 5117.52
    },
    {
        "text": " sino en protegerlos bien,",
        "start": 5117.52,
        "end": 5119.08
    },
    {
        "text": " y en no permitir que otros se los copien",
        "start": 5119.08,
        "end": 5121.12
    },
    {
        "text": " y ensarmos primeros y estar todo el tiempo,",
        "start": 5121.12,
        "end": 5124.5199999999995
    },
    {
        "text": " generando nuevos activos.",
        "start": 5124.5199999999995,
        "end": 5127.5199999999995
    },
    {
        "text": " Vean este.",
        "start": 5130.599999999999,
        "end": 5132.2
    },
    {
        "text": " Un ejemplo de Google, su opito, el guaymo,",
        "start": 5132.2,
        "end": 5138.36
    },
    {
        "text": " que fue conocido como Google Sales Driving Car Project.",
        "start": 5138.36,
        "end": 5143.28
    },
    {
        "text": " Es una pesa desarrolladora de vehículos autónomos,",
        "start": 5143.28,
        "end": 5146.5199999999995
    },
    {
        "text": " que, bueno, por supuesto, es de AlfaBank.",
        "start": 5146.5199999999995,
        "end": 5149.88
    },
    {
        "text": " Y bueno, la tecnología de desarrollar por Google",
        "start": 5149.88,
        "end": 5151.96
    },
    {
        "text": " permite no tomo mi consistencia autónomamente por la ciudad,",
        "start": 5151.96,
        "end": 5154.76
    },
    {
        "text": " por la carretera, bueno, en fin,",
        "start": 5154.76,
        "end": 5156.28
    },
    {
        "text": " detectar vehículos y sean extraficos, seguramente lo vieron.",
        "start": 5156.28,
        "end": 5160.4400000000005
    },
    {
        "text": " Este utito, ¿verdad?",
        "start": 5160.4400000000005,
        "end": 5162.4400000000005
    },
    {
        "text": " Está protegido absolutamente por todos estos instrumentos.",
        "start": 5162.4400000000005,
        "end": 5166.4800000000005
    },
    {
        "text": " Si ustedes buscan, en la página,",
        "start": 5166.4800000000005,
        "end": 5170.4400000000005
    },
    {
        "text": " van a encontrar la cantidad de patentes,",
        "start": 5170.4400000000005,
        "end": 5173.68
    },
    {
        "text": " el diseño que hablamos hace un rato,",
        "start": 5173.68,
        "end": 5176.12
    },
    {
        "text": " el diseño particular que tiene el autito está protegido,",
        "start": 5176.12,
        "end": 5180.5599999999995
    },
    {
        "text": " por supuesto el software,",
        "start": 5180.5599999999995,
        "end": 5184.4
    },
    {
        "text": " por todos los instrumentos conocidos.",
        "start": 5184.4,
        "end": 5189.599999999999
    },
    {
        "text": " Fíjense, acá les muestra en esta diapo",
        "start": 5190.96,
        "end": 5193.76
    },
    {
        "text": " que tienen incluso los links,",
        "start": 5193.76,
        "end": 5196.32
    },
    {
        "text": " algunas de las patentes, secretos que, obviamente,",
        "start": 5196.32,
        "end": 5200.32
    },
    {
        "text": " no nos van a contar, pero que seguramente tiene,",
        "start": 5200.32,
        "end": 5203.96
    },
    {
        "text": " hay derechos de autor, las marcas,",
        "start": 5204.12,
        "end": 5206.92
    },
    {
        "text": " acá tienen todas las marcas protegidas,",
        "start": 5206.92,
        "end": 5208.76
    },
    {
        "text": " más de 30 marcas, más de 250 patentes,",
        "start": 5208.76,
        "end": 5213.12
    },
    {
        "text": " diseño, en fin.",
        "start": 5213.12,
        "end": 5215.96
    },
    {
        "text": " Es realmente una estrategia que cubre",
        "start": 5215.96,
        "end": 5218.56
    },
    {
        "text": " todas las aristas del producto.",
        "start": 5218.56,
        "end": 5220.64
    },
    {
        "text": " Entonces, muchachos.",
        "start": 5220.64,
        "end": 5221.92
    },
    {
        "text": " Cuando yo hablo, le decía al principio,",
        "start": 5221.92,
        "end": 5224.68
    },
    {
        "text": " que cuando hablamos de conocimiento aplicado a un sector,",
        "start": 5224.68,
        "end": 5230.24
    },
    {
        "text": " tenemos por un lado el propio auto en sí,",
        "start": 5230.4,
        "end": 5234.28
    },
    {
        "text": " que en sí mismo, verdad, es un producto digno de una patente.",
        "start": 5234.28,
        "end": 5240.48
    },
    {
        "text": " Y por otro lado, tenemos el diseño,",
        "start": 5240.48,
        "end": 5242.76
    },
    {
        "text": " tenemos la marca que no diferencia en otros altos,",
        "start": 5242.76,
        "end": 5246.16
    },
    {
        "text": " por lo tanto, tanto el producto como solución técnica,",
        "start": 5246.16,
        "end": 5250.28
    },
    {
        "text": " como todos los instrumentos que se usan para proteger su calidad,",
        "start": 5250.28,
        "end": 5255.5599999999995
    },
    {
        "text": " su origen empresarial y para evitar su copia,",
        "start": 5255.5599999999995,
        "end": 5258.679999999999
    },
    {
        "text": " lo hacen singular y de alguna manera lo valorizan,",
        "start": 5258.68,
        "end": 5263.16
    },
    {
        "text": " verdad, lo ponen en valor y determina que el producto",
        "start": 5263.16,
        "end": 5267.0
    },
    {
        "text": " sea un producto codiciado.",
        "start": 5267.0,
        "end": 5269.0
    },
    {
        "text": " ¿Por qué?",
        "start": 5269.0,
        "end": 5269.6
    },
    {
        "text": " Porque no puede ser copiado, porque nadie más puede ser",
        "start": 5269.6,
        "end": 5272.0
    },
    {
        "text": " un auto con esta forma.",
        "start": 5272.0,
        "end": 5273.8
    },
    {
        "text": " Sí.",
        "start": 5273.8,
        "end": 5274.320000000001
    },
    {
        "text": " El Google Glass.",
        "start": 5277.08,
        "end": 5278.240000000001
    },
    {
        "text": " Bueno, pedí por Google, en ese ejemplo.",
        "start": 5278.240000000001,
        "end": 5281.08
    },
    {
        "text": " En el 2014 se presentó la marca Google Glass.",
        "start": 5281.08,
        "end": 5286.200000000001
    },
    {
        "text": " O sea, ellos insisten y a veces pierden, ¿no?",
        "start": 5286.2,
        "end": 5289.76
    },
    {
        "text": " La EUSPTO es la oficina de Estados Unidos de patentes y marcas.",
        "start": 5289.76,
        "end": 5294.96
    },
    {
        "text": " Ellos argumentaron que podía generar confusiones en el consumidor,",
        "start": 5294.96,
        "end": 5299.08
    },
    {
        "text": " ya que similar a otras marcas existen que se en el mercado.",
        "start": 5299.08,
        "end": 5301.72
    },
    {
        "text": " O sea, no le dieron la marca Google Glass,",
        "start": 5301.72,
        "end": 5304.44
    },
    {
        "text": " porque consideraban que era parecida a otras marcas que ya existían.",
        "start": 5304.44,
        "end": 5309.48
    },
    {
        "text": " La empresa Estebord del Estáelo se había puesto el registro",
        "start": 5309.48,
        "end": 5312.84
    },
    {
        "text": " por la similitu que la marca solicita,",
        "start": 5312.84,
        "end": 5314.76
    },
    {
        "text": " tiene con su marca, se ha registrada, Wright Hong Glass.",
        "start": 5314.76,
        "end": 5319.68
    },
    {
        "text": " Glass es un término de escritivo, un término genérico",
        "start": 5319.68,
        "end": 5322.56
    },
    {
        "text": " que como tal no puede contar con la protección legislativa",
        "start": 5322.56,
        "end": 5325.04
    },
    {
        "text": " de las marcas, afirmó la oficina.",
        "start": 5325.04,
        "end": 5327.4400000000005
    },
    {
        "text": " Ahora se pega Google, la pelent fallo,",
        "start": 5327.4400000000005,
        "end": 5329.28
    },
    {
        "text": " para lo cual uno de los argumentos se va a demostrar",
        "start": 5329.28,
        "end": 5331.56
    },
    {
        "text": " que la marca no causará causación debido",
        "start": 5331.56,
        "end": 5333.76
    },
    {
        "text": " a la enorme campaña de promoción y publicidad",
        "start": 5333.76,
        "end": 5335.84
    },
    {
        "text": " que la identificará.",
        "start": 5335.84,
        "end": 5336.84
    },
    {
        "text": " ¿Ah?",
        "start": 5336.84,
        "end": 5337.84
    },
    {
        "text": " Acá tienen la marca Google Glass al Ayus Pitio.",
        "start": 5342.68,
        "end": 5346.32
    },
    {
        "text": " Esto es cómo la presentaron y al final la terminaron abandonando.",
        "start": 5346.32,
        "end": 5351.96
    },
    {
        "text": " Este precisamente por todo este proceso.",
        "start": 5351.96,
        "end": 5354.8
    },
    {
        "text": " Hay.",
        "start": 5358.8,
        "end": 5359.8
    },
    {
        "text": " Bueno.",
        "start": 5361.6,
        "end": 5362.12
    },
    {
        "text": " Fíjense en la oficina de patente acá tienen un gráfico",
        "start": 5367.84,
        "end": 5374.84
    },
    {
        "text": " que les marca la cantidad de patentes por año",
        "start": 5374.84,
        "end": 5378.84
    },
    {
        "text": " que tienen las empresas de software.",
        "start": 5378.84,
        "end": 5381.84
    },
    {
        "text": " Fíjense el negro, el CVM, el azul es Microsoft,",
        "start": 5381.84,
        "end": 5386.84
    },
    {
        "text": " este colorcito, medio celestito, sábbol, Google es el rojo.",
        "start": 5386.84,
        "end": 5391.84
    },
    {
        "text": " Bueno, llena de electric, bueno, está Intel,",
        "start": 5391.84,
        "end": 5394.84
    },
    {
        "text": " estos telecomunicaciones y llanto.",
        "start": 5395.84,
        "end": 5397.84
    },
    {
        "text": " Y ahí ven la cantidad de patentes que presentan por año.",
        "start": 5397.84,
        "end": 5401.84
    },
    {
        "text": " Fíjense realmente lo interesante que es la forma",
        "start": 5401.84,
        "end": 5408.84
    },
    {
        "text": " que ellos manejan en Estados Unidos estos sistemas de protección.",
        "start": 5408.84,
        "end": 5412.84
    },
    {
        "text": " Bueno, esto pasamos a otro tema.",
        "start": 5415.84,
        "end": 5417.84
    },
    {
        "text": " Yo les decía más temporalos si que iban a hablar de la copia.",
        "start": 5417.84,
        "end": 5422.84
    },
    {
        "text": " Yo siempre me gusta hablar de esto porque en definitiva",
        "start": 5423.84,
        "end": 5427.84
    },
    {
        "text": " muchas veces en la universidad de la República solemos pensar",
        "start": 5427.84,
        "end": 5431.84
    },
    {
        "text": " que copia está muy mal.",
        "start": 5431.84,
        "end": 5433.84
    },
    {
        "text": " Y yo les digo que sí es cierto, copia está muy mal,",
        "start": 5433.84,
        "end": 5436.84
    },
    {
        "text": " sobre todo cuando uno lo hace en un parcial o en un exá,",
        "start": 5436.84,
        "end": 5439.84
    },
    {
        "text": " eso está muy mal y esto es de acolo con eso.",
        "start": 5439.84,
        "end": 5442.84
    },
    {
        "text": " Pero les tengo que decir que yo soy una activista",
        "start": 5442.84,
        "end": 5445.84
    },
    {
        "text": " de la copia en tecnología, porque yo entiendo que el sistema",
        "start": 5445.84,
        "end": 5449.84
    },
    {
        "text": " de propia intelectual está concebido para que en algún momento",
        "start": 5450.84,
        "end": 5454.84
    },
    {
        "text": " todo ese conocimiento pasa al dominio público,",
        "start": 5454.84,
        "end": 5457.84
    },
    {
        "text": " como yo les decía, las patentes duran 20 años",
        "start": 5457.84,
        "end": 5460.84
    },
    {
        "text": " y pasan al dominio público.",
        "start": 5460.84,
        "end": 5462.84
    },
    {
        "text": " Las marcas tienen un plazo de protección de 10 años",
        "start": 5462.84,
        "end": 5465.84
    },
    {
        "text": " y si no son renovadas pasan al dominio público.",
        "start": 5465.84,
        "end": 5468.84
    },
    {
        "text": " Los derechos de autor son toda la vida del autor",
        "start": 5468.84,
        "end": 5471.84
    },
    {
        "text": " y 70 años después de su muerte y luego pasan al dominio público.",
        "start": 5471.84,
        "end": 5475.84
    },
    {
        "text": " Por lo tanto, todo el sistema está avanzado",
        "start": 5476.84,
        "end": 5480.84
    },
    {
        "text": " para que el conocimiento pase al dominio público,",
        "start": 5480.84,
        "end": 5483.84
    },
    {
        "text": " sea retibulgado y pasado al dominio público.",
        "start": 5483.84,
        "end": 5487.84
    },
    {
        "text": " Por lo tanto, una vez que está en el dominio público,",
        "start": 5487.84,
        "end": 5491.84
    },
    {
        "text": " ese conocimiento puede ser copiado.",
        "start": 5491.84,
        "end": 5495.84
    },
    {
        "text": " La respuesta está pregunta a muchos chachos,",
        "start": 5495.84,
        "end": 5498.84
    },
    {
        "text": " es si el lícito copiar.",
        "start": 5498.84,
        "end": 5500.84
    },
    {
        "text": " Pero el lícito copiar en condiciones de las mentallas,",
        "start": 5500.84,
        "end": 5503.84
    },
    {
        "text": " el lícito copiar cuando se que la patente terminó,",
        "start": 5503.84,
        "end": 5507.84
    },
    {
        "text": " el lícito copiar cuando pasaron 70 años después de la muerte",
        "start": 5507.84,
        "end": 5510.84
    },
    {
        "text": " de un autor en derechos de autor.",
        "start": 5510.84,
        "end": 5512.84
    },
    {
        "text": " Lo que no está bien es copiar algo que está protegido.",
        "start": 5512.84,
        "end": 5515.84
    },
    {
        "text": " Ahí sí, no se los recomiendo de ningún acuerdo.",
        "start": 5515.84,
        "end": 5519.84
    },
    {
        "text": " Bueno, ¿y por qué protegemos por secretos?",
        "start": 5524.84,
        "end": 5527.84
    },
    {
        "text": " Bueno, como les decía más temprano,",
        "start": 5527.84,
        "end": 5530.84
    },
    {
        "text": " porque cuando protejo por secreto,",
        "start": 5531.84,
        "end": 5534.84
    },
    {
        "text": " tengo una protección un poco más extensa",
        "start": 5534.84,
        "end": 5539.84
    },
    {
        "text": " que en los instrumentos de propio intelectual.",
        "start": 5539.84,
        "end": 5542.84
    },
    {
        "text": " Bueno, el valor del conocimiento está precisamente",
        "start": 5544.84,
        "end": 5551.84
    },
    {
        "text": " en la posibilidad que puedo discluir de alguna manera",
        "start": 5551.84,
        "end": 5555.84
    },
    {
        "text": " a los terceros en el mercado.",
        "start": 5555.84,
        "end": 5558.84
    },
    {
        "text": " El valor está dado por el uso exclusivo,",
        "start": 5559.84,
        "end": 5562.84
    },
    {
        "text": " pero eso ya les puse uso en exclusividad,",
        "start": 5562.84,
        "end": 5565.84
    },
    {
        "text": " ver sus uso compartidos.",
        "start": 5565.84,
        "end": 5567.84
    },
    {
        "text": " Si yo puedo asegurar el uso en exclusividad,",
        "start": 5567.84,
        "end": 5570.84
    },
    {
        "text": " en un mercado, a un individuo, a una empresa,",
        "start": 5570.84,
        "end": 5574.84
    },
    {
        "text": " voy a tener un conocimiento que va a tener un valor",
        "start": 5574.84,
        "end": 5579.84
    },
    {
        "text": " totalmente diferente,",
        "start": 5579.84,
        "end": 5581.84
    },
    {
        "text": " a cuando yo no puedo asegurar un uso exclusivo",
        "start": 5581.84,
        "end": 5585.84
    },
    {
        "text": " y estoy entregando un conocimiento de uso compartido.",
        "start": 5585.84,
        "end": 5588.84
    },
    {
        "text": " Ojo, está mal desarrollar un conocimiento",
        "start": 5588.84,
        "end": 5591.84
    },
    {
        "text": " que está en lo niño público",
        "start": 5591.84,
        "end": 5594.84
    },
    {
        "text": " y transferíselo a una empresa para nada,",
        "start": 5594.84,
        "end": 5597.84
    },
    {
        "text": " no está mal.",
        "start": 5597.84,
        "end": 5599.84
    },
    {
        "text": " Lo que pasa es que el valor es totalmente distinto.",
        "start": 5599.84,
        "end": 5602.84
    },
    {
        "text": " Y entonces lo ven, los productos no van en lo mismo",
        "start": 5602.84,
        "end": 5605.84
    },
    {
        "text": " cuando tienen monopolio cuando no lo tienen.",
        "start": 5605.84,
        "end": 5608.84
    },
    {
        "text": " Lo medicamento no van en lo mismo",
        "start": 5608.84,
        "end": 5611.84
    },
    {
        "text": " cuando hay un solo proveedor a cuando hay un montón de proveedores.",
        "start": 5611.84,
        "end": 5614.84
    },
    {
        "text": " Y lo mismo ocurre en software.",
        "start": 5615.84,
        "end": 5617.84
    },
    {
        "text": " O sea, cuando yo tengo el monopolio,",
        "start": 5617.84,
        "end": 5619.84
    },
    {
        "text": " cuando yo quiero el último celular que salió con las últimas aplicaciones,",
        "start": 5619.84,
        "end": 5624.84
    },
    {
        "text": " con las últimas chiches,",
        "start": 5624.84,
        "end": 5626.84
    },
    {
        "text": " tiene un valor totalmente distinto,",
        "start": 5626.84,
        "end": 5628.84
    },
    {
        "text": " a un producto que hay competencia.",
        "start": 5628.84,
        "end": 5631.84
    },
    {
        "text": " ¿Cómo es que se llama este nuevo que salió,",
        "start": 5631.84,
        "end": 5634.84
    },
    {
        "text": " que se doblan, que se me fue el nombre?",
        "start": 5634.84,
        "end": 5636.84
    },
    {
        "text": " El flip.",
        "start": 5636.84,
        "end": 5638.84
    },
    {
        "text": " El flip, ahí está.",
        "start": 5638.84,
        "end": 5640.84
    },
    {
        "text": " Tiene un valor totalmente distinto,",
        "start": 5640.84,
        "end": 5642.84
    },
    {
        "text": " a este que tengo yo, que se les denueve.",
        "start": 5642.84,
        "end": 5645.84
    },
    {
        "text": " Ya creo que no lo conseguís.",
        "start": 5645.84,
        "end": 5647.84
    },
    {
        "text": " Es una antigüedad.",
        "start": 5647.84,
        "end": 5649.84
    },
    {
        "text": " También eso tiene un valor.",
        "start": 5649.84,
        "end": 5651.84
    },
    {
        "text": " Y por supuesto, la evaluación de ese conocimiento está en valor,",
        "start": 5654.84,
        "end": 5659.84
    },
    {
        "text": " depende de un montón de factores, que ustedes tienen que tener en cuenta.",
        "start": 5659.84,
        "end": 5663.84
    },
    {
        "text": " Uno son los costos de producción,",
        "start": 5663.84,
        "end": 5666.84
    },
    {
        "text": " otros son los costos de sustitución.",
        "start": 5666.84,
        "end": 5668.84
    },
    {
        "text": " Ya, no todo se trata de bueno de proteger.",
        "start": 5668.84,
        "end": 5673.84
    },
    {
        "text": " Así, yo protejo y ya con eso aseguro un valor.",
        "start": 5673.84,
        "end": 5678.84
    },
    {
        "text": " No.",
        "start": 5678.84,
        "end": 5679.84
    },
    {
        "text": " Protejo y aseguro uno sus exclusivos.",
        "start": 5679.84,
        "end": 5682.84
    },
    {
        "text": " Pero si los costos de producción son altos,",
        "start": 5682.84,
        "end": 5685.84
    },
    {
        "text": " no voy a poder lograr verdad el redito económico que pretende.",
        "start": 5685.84,
        "end": 5691.84
    },
    {
        "text": " Si existen costos de sustitución bajos,",
        "start": 5691.84,
        "end": 5694.84
    },
    {
        "text": " es decir, cualquiera me puede sacar un producto que compita conmigo,",
        "start": 5694.84,
        "end": 5699.84
    },
    {
        "text": " verdad, abajo, precio, tampoco voy a hacer competitivo.",
        "start": 5699.84,
        "end": 5704.84
    },
    {
        "text": " Entonces, hay otros factores que también pesan",
        "start": 5704.84,
        "end": 5707.84
    },
    {
        "text": " y que una tiene que tener en cuenta la puesta valor.",
        "start": 5707.84,
        "end": 5710.84
    },
    {
        "text": " Los mercados, la competencia, los productos alternativos.",
        "start": 5710.84,
        "end": 5714.84
    },
    {
        "text": " En fin, el gusto del consumidor, como anciana hace un rat.",
        "start": 5714.84,
        "end": 5717.84
    },
    {
        "text": " Entonces, por eso es muy importante tener en cuenta un montón de aspectos.",
        "start": 5717.84,
        "end": 5722.84
    },
    {
        "text": " La otra opción es uno de ellos.",
        "start": 5722.84,
        "end": 5724.84
    },
    {
        "text": " Y bueno, la única forma y lo que les puedo decir es que se debe preservar ese conocimiento",
        "start": 5724.84,
        "end": 5730.84
    },
    {
        "text": " y la única forma de preservar ese conocimiento para luego tener la posibilidad",
        "start": 5730.84,
        "end": 5734.84
    },
    {
        "text": " de valorizarnos es no revelarlo.",
        "start": 5734.84,
        "end": 5737.84
    },
    {
        "text": " Por eso, del principio les hablé de la confidencialidad",
        "start": 5737.84,
        "end": 5741.84
    },
    {
        "text": " y la importancia del secreto y estamos terminando también con este mismo concepto.",
        "start": 5741.84,
        "end": 5747.84
    },
    {
        "text": " Veamos un poco lo que es la transferencia tecnológica,",
        "start": 5748.84,
        "end": 5751.84
    },
    {
        "text": " que es como lo último que nos interesa.",
        "start": 5751.84,
        "end": 5753.84
    },
    {
        "text": " Es el proceso de transferir de una organización a otra,",
        "start": 5753.84,
        "end": 5757.84
    },
    {
        "text": " los resultados de las actividades de investigaciones de desarrollo",
        "start": 5757.84,
        "end": 5761.84
    },
    {
        "text": " para promover el desarrollo de la comercialización.",
        "start": 5761.84,
        "end": 5766.84
    },
    {
        "text": " Ahí tiene la cita de la definición.",
        "start": 5766.84,
        "end": 5770.84
    },
    {
        "text": " Hay mecanismos formales y mecanismos informales.",
        "start": 5770.84,
        "end": 5773.84
    },
    {
        "text": " Los mecanismos formales son contratos.",
        "start": 5774.84,
        "end": 5777.84
    },
    {
        "text": " Ustedes lo conocen, las licencias de software.",
        "start": 5777.84,
        "end": 5781.84
    },
    {
        "text": " Es un mecanismo formal de transferencia tecnológico.",
        "start": 5781.84,
        "end": 5784.84
    },
    {
        "text": " Cuando yo firmo unos términos y condiciones,",
        "start": 5784.84,
        "end": 5787.84
    },
    {
        "text": " estoy firmando una licencia de software,",
        "start": 5787.84,
        "end": 5790.84
    },
    {
        "text": " en la cual me están diciendo cómo yo puedo usar ese producto.",
        "start": 5790.84,
        "end": 5795.84
    },
    {
        "text": " Bueno, una compra venta de instalación comercial.",
        "start": 5795.84,
        "end": 5798.84
    },
    {
        "text": " Si yo compro una empresa montada con conocimiento,",
        "start": 5798.84,
        "end": 5802.84
    },
    {
        "text": " estoy inquidiendo tecnología.",
        "start": 5802.84,
        "end": 5804.84
    },
    {
        "text": " Si a ViuTes lo ven, en software se da muchísimo.",
        "start": 5804.84,
        "end": 5807.84
    },
    {
        "text": " Ustedes tienen una empresa de tecnología pequeña,",
        "start": 5807.84,
        "end": 5810.84
    },
    {
        "text": " que tiene un gran éxito comercial",
        "start": 5810.84,
        "end": 5812.84
    },
    {
        "text": " y puede venir al bien grande que le interese a absorbarlo.",
        "start": 5812.84,
        "end": 5815.84
    },
    {
        "text": " Es una manera de inquidir tecnología también,",
        "start": 5815.84,
        "end": 5818.84
    },
    {
        "text": " comprar un establecimiento comercial montado con una organización",
        "start": 5818.84,
        "end": 5822.84
    },
    {
        "text": " que tenga activos intangibles, notegidos.",
        "start": 5822.84,
        "end": 5827.84
    },
    {
        "text": " Si no, no se se interesa comprar.",
        "start": 5827.84,
        "end": 5829.84
    },
    {
        "text": " La inquisición de bienes o contrataciones de servicios.",
        "start": 5829.84,
        "end": 5832.84
    },
    {
        "text": " Es decir, cuando yo adquiero tecnologías,",
        "start": 5832.84,
        "end": 5835.84
    },
    {
        "text": " si yo me compro infraestructura o sí contratos servicios profesionales,",
        "start": 5835.84,
        "end": 5840.84
    },
    {
        "text": " estoy inquidiendo tecnología de la forma formal.",
        "start": 5840.84,
        "end": 5843.84
    },
    {
        "text": " ¿Por qué? Porque tengo un contract.",
        "start": 5843.84,
        "end": 5845.84
    },
    {
        "text": " Los propios contratos de franquicias,",
        "start": 5845.84,
        "end": 5847.84
    },
    {
        "text": " o sea, cuando yo me paso a tener una franquicia de una empresa más grande,",
        "start": 5847.84,
        "end": 5855.84
    },
    {
        "text": " paso a tener conocimiento que me transfiere el franquiciante.",
        "start": 5855.84,
        "end": 5859.84
    },
    {
        "text": " ¿Entienden lo que es una franquicia?",
        "start": 5859.84,
        "end": 5861.84
    },
    {
        "text": " Con las dudas, sí.",
        "start": 5861.84,
        "end": 5864.84
    },
    {
        "text": " Bueno, y los mecanismos informales.",
        "start": 5864.84,
        "end": 5867.84
    },
    {
        "text": " Los mecanismos informales,",
        "start": 5867.84,
        "end": 5869.84
    },
    {
        "text": " el primero es la imitación, o sea,",
        "start": 5869.84,
        "end": 5872.84
    },
    {
        "text": " y tratar de imitar la tecnología que eso lo aprendemos",
        "start": 5872.84,
        "end": 5876.84
    },
    {
        "text": " desde que estamos en la universidad a imitar algunas cosas",
        "start": 5876.84,
        "end": 5879.84
    },
    {
        "text": " y de esa forma aprendemos capacidades, ¿verdad?",
        "start": 5879.84,
        "end": 5883.84
    },
    {
        "text": " Es un mecanismo informal y eso mecanismo hábil para adquirir tecnologías.",
        "start": 5883.84,
        "end": 5889.84
    },
    {
        "text": " La movilidad de técnicos, te decía hace un rato.",
        "start": 5889.84,
        "end": 5892.84
    },
    {
        "text": " Seguarme, verdad, el técnico de mi competidor o de mi proveedor.",
        "start": 5892.84,
        "end": 5898.84
    },
    {
        "text": " Y por supuesto, utilizar la información tecnológica disponible.",
        "start": 5898.84,
        "end": 5903.84
    },
    {
        "text": " Yo tengo bases de datos internacionales con conocimiento, ¿verdad?",
        "start": 5903.84,
        "end": 5908.84
    },
    {
        "text": " ¿Qué está mi exposición?",
        "start": 5908.84,
        "end": 5910.84
    },
    {
        "text": " ¿Y qué es el domínio público?",
        "start": 5910.84,
        "end": 5912.84
    },
    {
        "text": " ¿Puedo copiarlo cuando tenga ganas?",
        "start": 5912.84,
        "end": 5914.84
    },
    {
        "text": " Sin problema.",
        "start": 5914.84,
        "end": 5916.84
    },
    {
        "text": " Bueno, y por último queríamos vincular la propiedad intelectual",
        "start": 5919.84,
        "end": 5923.84
    },
    {
        "text": " con las estrategias de competitividad de las empresas.",
        "start": 5923.84,
        "end": 5926.84
    },
    {
        "text": " Y voy a ir un poco más rápido en esto.",
        "start": 5926.84,
        "end": 5928.84
    },
    {
        "text": " Básicamente, ¿qué es la competitividad?",
        "start": 5928.84,
        "end": 5932.84
    },
    {
        "text": " O sea, la estrategia competitiva se describe a través de acciones ofensivas o defensivas.",
        "start": 5932.84,
        "end": 5938.84
    },
    {
        "text": " Entonces, básicamente las empresas realizan este tipo de acciones",
        "start": 5939.84,
        "end": 5944.84
    },
    {
        "text": " para generar o crear una posición defendible en un determinado sector.",
        "start": 5944.84,
        "end": 5949.84
    },
    {
        "text": " Y para hacer frente a estas fuerzas competitivas y generar un retorro de la inversión,",
        "start": 5949.84,
        "end": 5955.84
    },
    {
        "text": " que es lo que hacen, bueno, el poder de negociación de los compradores obviantes,",
        "start": 5955.84,
        "end": 5959.84
    },
    {
        "text": " el poder de negociación de proveedores o de neores,",
        "start": 5959.84,
        "end": 5962.84
    },
    {
        "text": " la amenaza de nuevos competidores entrantes,",
        "start": 5962.84,
        "end": 5964.84
    },
    {
        "text": " la amenaza de productos sustitutos o los rivaledad entre los competidores.",
        "start": 5965.84,
        "end": 5969.84
    },
    {
        "text": " Entonces, todo esto determina que yo tengo que encontrar estrategias que me defiendan de estas amenazas",
        "start": 5969.84,
        "end": 5977.84
    },
    {
        "text": " o incluso estrategias que lo que aban es ir al ataque y evitar que me daño.",
        "start": 5977.84,
        "end": 5987.84
    },
    {
        "text": " Hay tres estrategias de competitividad según Porter, acaso, las puse.",
        "start": 5989.84,
        "end": 5993.84
    },
    {
        "text": " Yo no sé si en el bueno momento usted lo ha dado la oportunidad de leer a Porter,",
        "start": 5994.84,
        "end": 5997.84
    },
    {
        "text": " pero es interesante. Porter dice que las empresas tienen tres estrategias básicas.",
        "start": 5997.84,
        "end": 6006.84
    },
    {
        "text": " La de bajos costos son empresas que presiden de generar conocimiento y apropiarse de él",
        "start": 6006.84,
        "end": 6013.84
    },
    {
        "text": " y lo que hacen es copiar. Copiar y hacerlo barato.",
        "start": 6013.84,
        "end": 6017.84
    },
    {
        "text": " Esa es una estrategia de bajo costo.",
        "start": 6017.84,
        "end": 6019.84
    },
    {
        "text": " Luego tengo una estrategia de diferenciación,",
        "start": 6020.84,
        "end": 6022.84
    },
    {
        "text": " y en este caso lo que hago es diferenciar productos o servicios respecto a los de los competidores,",
        "start": 6022.84,
        "end": 6028.84
    },
    {
        "text": " o sea tratar de hacer algo distinto innovador.",
        "start": 6028.84,
        "end": 6031.84
    },
    {
        "text": " Y después hay otra estrategia que es de deposicionamiento o segmento del mercado.",
        "start": 6031.84,
        "end": 6037.84
    },
    {
        "text": " En este caso, los productos y servicios son dirigidos a satisfacer demandas concretas.",
        "start": 6037.84,
        "end": 6043.84
    },
    {
        "text": " Lo que hago es desarrollar productos de nicho, de alto valor, de alto contenido tecnológico,",
        "start": 6044.84,
        "end": 6049.84
    },
    {
        "text": " pero muy específicos. Entienden más o menos las tres.",
        "start": 6049.84,
        "end": 6052.84
    },
    {
        "text": " Y básicamente lo que me interesaba dejarles es que en cualquiera de las tres,",
        "start": 6052.84,
        "end": 6058.84
    },
    {
        "text": " ustedes van a tener tres estrategias que deciden hacer como empresarios,",
        "start": 6058.84,
        "end": 6062.84
    },
    {
        "text": " van a tener acciones que involucran propia intelectual y van a tener que usar estos instrumentos",
        "start": 6062.84,
        "end": 6067.84
    },
    {
        "text": " tanto en forma ofensiva como defensivo.",
        "start": 6067.84,
        "end": 6070.84
    },
    {
        "text": " Los instrumentos que están a su disposición son la información tecnológica,",
        "start": 6070.84,
        "end": 6074.84
    },
    {
        "text": " es decir, yo tengo que buscar la información para adquirir tecnología,",
        "start": 6074.84,
        "end": 6080.84
    },
    {
        "text": " pero también para diseñar la estrategia de protección.",
        "start": 6080.84,
        "end": 6083.84
    },
    {
        "text": " ¿Para qué me sirve tener información tecnológica para saber cuáles son los competidores,",
        "start": 6083.84,
        "end": 6091.84
    },
    {
        "text": " para saber cuáles son los productos en el mercado,",
        "start": 6091.84,
        "end": 6094.84
    },
    {
        "text": " que de alguna manera compiten con mi producto,",
        "start": 6094.84,
        "end": 6097.84
    },
    {
        "text": " ¿quién empresas están investigando qué cosa? ¿Verdad?",
        "start": 6098.84,
        "end": 6102.84
    },
    {
        "text": " Y ahí se combina lo que es la información tecnológica con lo que se llama vigilancia tecnológica",
        "start": 6102.84,
        "end": 6108.84
    },
    {
        "text": " o incluso con lo que se llama también inteligencia competitivo.",
        "start": 6108.84,
        "end": 6111.84
    },
    {
        "text": " Son tres instrumentos que se pueden utilizar para diseñar estrategias.",
        "start": 6111.84,
        "end": 6117.84
    },
    {
        "text": " En una vigilancia tecnológica yo lo que hago es vigilar, perdón,",
        "start": 6117.84,
        "end": 6123.84
    },
    {
        "text": " o vigilo, un sector como se va comportando,",
        "start": 6124.84,
        "end": 6128.84
    },
    {
        "text": " o vigilo una empresa competidora,",
        "start": 6128.84,
        "end": 6131.84
    },
    {
        "text": " y veo que productos vas sacando el mercado,",
        "start": 6131.84,
        "end": 6133.84
    },
    {
        "text": " ¿qué con quiénes está aliando, qué clientes tiene,",
        "start": 6133.84,
        "end": 6138.84
    },
    {
        "text": " y en función de eso yo puedo inferir,",
        "start": 6138.84,
        "end": 6141.84
    },
    {
        "text": " digo, ¿para dónde está esa empresa, bueno,",
        "start": 6141.84,
        "end": 6146.84
    },
    {
        "text": " reumviando su investigación y desarrollo?",
        "start": 6146.84,
        "end": 6149.84
    },
    {
        "text": " Eso lo que se llama vigilancia.",
        "start": 6149.84,
        "end": 6151.84
    },
    {
        "text": " La vigilancia es lícita, lo que nos lícitos el espionaje.",
        "start": 6152.84,
        "end": 6156.84
    },
    {
        "text": " O no hablamos de vigilancia, lo que hablamos es estudiar la información disponible en internet,",
        "start": 6156.84,
        "end": 6162.84
    },
    {
        "text": " o sea, yo lo que hago es vigilar, bueno, los anuncios de la empresa,",
        "start": 6162.84,
        "end": 6167.84
    },
    {
        "text": " la página web, verdad, estudio, las patentes que presenta, ¿verdad?",
        "start": 6167.84,
        "end": 6172.84
    },
    {
        "text": " Y en función de las patentes que presentan, me puedo dar cuenta,",
        "start": 6172.84,
        "end": 6176.84
    },
    {
        "text": " ¿viste qué tipo de productos está desarrollado?",
        "start": 6176.84,
        "end": 6180.84
    },
    {
        "text": " Pero mismo ocurre con la inteligencia competitiva.",
        "start": 6180.84,
        "end": 6183.84
    },
    {
        "text": " En el caso de la inteligencia competitiva, vamos un poquito más allá,",
        "start": 6183.84,
        "end": 6187.84
    },
    {
        "text": " porque no solamente queremos saber lo que hacen los competidores",
        "start": 6187.84,
        "end": 6190.84
    },
    {
        "text": " para formular nuestro modelo de negocios o para identificar socios,",
        "start": 6190.84,
        "end": 6194.84
    },
    {
        "text": " verdad y competidores, sino la inteligencia competitiva",
        "start": 6194.84,
        "end": 6198.84
    },
    {
        "text": " ya utilizamos la información tecnológica y toda esta información",
        "start": 6198.84,
        "end": 6202.84
    },
    {
        "text": " que se genera para conocer mejor el mercado,",
        "start": 6202.84,
        "end": 6206.84
    },
    {
        "text": " conocer mejor a nuestros consumidores y a nuestros competidores.",
        "start": 6206.84,
        "end": 6209.84
    },
    {
        "text": " Y entonces, elaborar estrategias a la relación a nuestros productos",
        "start": 6209.84,
        "end": 6213.84
    },
    {
        "text": " que de alguna manera vinculen justamente esta información.",
        "start": 6213.84,
        "end": 6220.84
    },
    {
        "text": " Bueno, creo que está mostraminado.",
        "start": 6223.84,
        "end": 6228.84
    },
    {
        "text": " Las acciones que involucran propia inteligencia actual,",
        "start": 6228.84,
        "end": 6231.84
    },
    {
        "text": " que además tienen relación con esto, nos ayudan en desarrollos",
        "start": 6231.84,
        "end": 6238.84
    },
    {
        "text": " que impliquen la utilización de plataformas o desarrollos de terceros,",
        "start": 6238.84,
        "end": 6242.84
    },
    {
        "text": " identificar en forma temprana las plataformas informáticas utilizadas",
        "start": 6242.84,
        "end": 6246.84
    },
    {
        "text": " en cada desarrollo, en lo que yo les decía al principio.",
        "start": 6246.84,
        "end": 6250.84
    },
    {
        "text": " Yo tengo que identificar, ¿verdad, esas licencias o plataformas",
        "start": 6250.84,
        "end": 6255.84
    },
    {
        "text": " que voy a utilizar de esos terceros para ver si esas licencias me permiten",
        "start": 6255.84,
        "end": 6261.84
    },
    {
        "text": " o no trabajar sobre ellas?",
        "start": 6261.84,
        "end": 6264.84
    },
    {
        "text": " Estionar las licencias a los productos de software propietario que fuera necesaria,",
        "start": 6264.84,
        "end": 6268.84
    },
    {
        "text": " es decir, en este caso negociarlas, para garantizar que la nueva tecnología",
        "start": 6268.84,
        "end": 6272.84
    },
    {
        "text": " pueda ser utilizada sin inconvenir.",
        "start": 6272.84,
        "end": 6275.84
    },
    {
        "text": " Estudiar el alcance de las licencias a los productos de software libre",
        "start": 6275.84,
        "end": 6279.84
    },
    {
        "text": " utilizados en los desarrollos.",
        "start": 6279.84,
        "end": 6282.84
    },
    {
        "text": " Ojo, el software libre no significa que esté disponible para cualquier uso.",
        "start": 6282.84,
        "end": 6287.84
    },
    {
        "text": " A mí me sorprendió, me leído muchas licencias de software libre,",
        "start": 6287.84,
        "end": 6291.84
    },
    {
        "text": " que son mucho más retrictivas que las licencias del software propietario,",
        "start": 6291.84,
        "end": 6295.84
    },
    {
        "text": " se sorprenderían a veces.",
        "start": 6295.84,
        "end": 6297.84
    },
    {
        "text": " Y por último, una cosa que me interesa que un concepto que me interesa",
        "start": 6297.84,
        "end": 6302.84
    },
    {
        "text": " que tengan tanto para si desarrollan como para si compran software",
        "start": 6302.84,
        "end": 6307.84
    },
    {
        "text": " es justamente hacer una auditoría de los componentes de producto final.",
        "start": 6307.84,
        "end": 6312.84
    },
    {
        "text": " O sea, si el producto lo hice yo, es más fácil de saluditaría.",
        "start": 6312.84,
        "end": 6316.84
    },
    {
        "text": " Ahora si el producto lo voy a comprar, es bueno asegurarme",
        "start": 6316.84,
        "end": 6320.84
    },
    {
        "text": " que esos componentes, verdad, hayan sido auditados.",
        "start": 6320.84,
        "end": 6326.84
    },
    {
        "text": " En el caso de desarrollos nuevos, es importante hacer búsqueda de información",
        "start": 6326.84,
        "end": 6331.84
    },
    {
        "text": " tecnológica para identificar el agrado de novedad.",
        "start": 6331.84,
        "end": 6334.84
    },
    {
        "text": " Y el desarrollo de una estrategia de protección por supuesto diseñada para el mundo.",
        "start": 6334.84,
        "end": 6339.84
    },
    {
        "text": " Ustedes no pueden asociar la estrategia de protección solamente a un territorio.",
        "start": 6339.84,
        "end": 6346.84
    },
    {
        "text": " Tienen que pensar que el producto al que ustedes están apuntando",
        "start": 6346.84,
        "end": 6350.84
    },
    {
        "text": " es un producto que puede ser utilizado a nivel mundial.",
        "start": 6350.84,
        "end": 6354.84
    },
    {
        "text": " Y cuando eso ocurre, la estrategia tiene que ser pensada para el mundo.",
        "start": 6354.84,
        "end": 6358.84
    },
    {
        "text": " Porque es así como yo lo pongo en valor realmente.",
        "start": 6358.84,
        "end": 6362.84
    },
    {
        "text": " Bueno, yo que ahí terminé.",
        "start": 6364.84,
        "end": 6366.84
    },
    {
        "text": " Y tengo cinco minutos más.",
        "start": 6366.84,
        "end": 6369.84
    },
    {
        "text": " Lo hice la más rápido que pude, por favor, decime que lo te he encontrado.",
        "start": 6369.84,
        "end": 6375.84
    },
    {
        "text": " Bueno, ahora sí, la pregunta.",
        "start": 6375.84,
        "end": 6378.84
    },
    {
        "text": " Aquí hemos preguntas.",
        "start": 6378.84,
        "end": 6380.84
    },
    {
        "text": " Yo, maquillote una pregunta con el tema del ocultamiento que decían para proteger.",
        "start": 6382.84,
        "end": 6391.84
    },
    {
        "text": " Si en realidad, voy a poner un ejemplo y quiero saber si está haciendo sección de ocultamiento.",
        "start": 6391.84,
        "end": 6398.84
    },
    {
        "text": " Si vos tenés, por ejemplo, genera un producto.",
        "start": 6398.84,
        "end": 6402.84
    },
    {
        "text": " En una empresa.",
        "start": 6403.84,
        "end": 6406.84
    },
    {
        "text": " Y vende ese producto para el exterior.",
        "start": 6406.84,
        "end": 6410.84
    },
    {
        "text": " O sea, vos como empresa no querés venderlo, por ejemplo, Nourwai para poder diferenciarte de tus competitivares.",
        "start": 6410.84,
        "end": 6417.84
    },
    {
        "text": " En Uruguay, pero sí vender el producto para fuera.",
        "start": 6417.84,
        "end": 6420.84
    },
    {
        "text": " Ahí estás haciendo como para Uruguay en una especie de ocultamiento.",
        "start": 6420.84,
        "end": 6424.84
    },
    {
        "text": " No.",
        "start": 6424.84,
        "end": 6425.84
    },
    {
        "text": " No, no.",
        "start": 6425.84,
        "end": 6426.84
    },
    {
        "text": " O es algo más estratégico.",
        "start": 6426.84,
        "end": 6427.84
    },
    {
        "text": " ¿Vos podés decidir a qué mercado te dirigí?",
        "start": 6428.84,
        "end": 6430.84
    },
    {
        "text": " ¿Cómo empresa no está sobriado vender en un determinado mercado?",
        "start": 6430.84,
        "end": 6433.84
    },
    {
        "text": " O puede dedicarte solamente a exportar.",
        "start": 6433.84,
        "end": 6437.84
    },
    {
        "text": " De hecho, hay muchas empresas de Nourwai que solamente producen para mercados de importación.",
        "start": 6437.84,
        "end": 6442.84
    },
    {
        "text": " No está mala esa.",
        "start": 6442.84,
        "end": 6444.84
    },
    {
        "text": " No, pero yo ya lo he preguntado era no si está bien o está mal.",
        "start": 6444.84,
        "end": 6447.84
    },
    {
        "text": " Si estaba dentro de ocultamiento para proteger como vos.",
        "start": 6447.84,
        "end": 6455.84
    },
    {
        "text": " Es un diferencial tuyo, tienes herramienta en el rubro.",
        "start": 6455.84,
        "end": 6460.84
    },
    {
        "text": " A ocultarlo en Uruguay y vendarlo en otro lado.",
        "start": 6460.84,
        "end": 6464.84
    },
    {
        "text": " O sea, cuando te referís a ocultarlo, ¿a qué estás refiriendo a qué no lo estás promocionando en Uruguay o te está refiriendo a alguna otra cosa?",
        "start": 6464.84,
        "end": 6475.84
    },
    {
        "text": " Porque honestamente cuando vos vende es el producto.",
        "start": 6475.84,
        "end": 6479.84
    },
    {
        "text": " Supone que ese producto tuviera destinado, no sé, decimos, ¿váis qué te interese?",
        "start": 6479.84,
        "end": 6484.84
    },
    {
        "text": " No sé, estamos unidos.",
        "start": 6484.84,
        "end": 6485.84
    },
    {
        "text": " Perú, yo me sé.",
        "start": 6485.84,
        "end": 6486.84
    },
    {
        "text": " Falkiera.",
        "start": 6486.84,
        "end": 6487.84
    },
    {
        "text": " Escajanta, perú.",
        "start": 6487.84,
        "end": 6488.84
    },
    {
        "text": " O sea, vos en realidad, ¿sá es una empresa instalada en Uruguay que desarrolla un producto que va a vender que lo va a vender en Perú?",
        "start": 6488.84,
        "end": 6495.84
    },
    {
        "text": " Lo que tenés que hacer es una estrategia de protección en Perú.",
        "start": 6495.84,
        "end": 6499.84
    },
    {
        "text": " Pero también te esca hacer una estrategia de protección en Uruguay.",
        "start": 6499.84,
        "end": 6502.84
    },
    {
        "text": " Porque el lugar de fabricación es Uruguay.",
        "start": 6502.84,
        "end": 6505.84
    },
    {
        "text": " Entonces, a ti te conviene hacer una estrategia de protección que incluya todos los países que forman parte de tu cadena productiva.",
        "start": 6505.84,
        "end": 6514.84
    },
    {
        "text": " Pero además, si es un producto que es interesante y que vos decís, bueno, yo empiezo por Perú.",
        "start": 6514.84,
        "end": 6521.84
    },
    {
        "text": " Pero resulta que una vez que yo el logro tener esta división marcada de Perú y gano una determinada, tengo determinado colchón,",
        "start": 6521.84,
        "end": 6530.84
    },
    {
        "text": " empiezo a exportar a otros lugares.",
        "start": 6530.84,
        "end": 6532.84
    },
    {
        "text": " Entonces, cuando diseñas la estrategia también diseñé a una estrategia que incluya la expansión del enterriz.",
        "start": 6532.84,
        "end": 6538.84
    },
    {
        "text": " La expansión del negocio.",
        "start": 6538.84,
        "end": 6540.84
    },
    {
        "text": " ¿Por qué?",
        "start": 6540.84,
        "end": 6541.84
    },
    {
        "text": " ¿Y un texto?",
        "start": 6541.84,
        "end": 6542.84
    },
    {
        "text": " Sí, ahora sí.",
        "start": 6542.84,
        "end": 6543.84
    },
    {
        "text": " El hecho de formación tica es muy común.",
        "start": 6543.84,
        "end": 6545.84
    },
    {
        "text": " Arrancan, ¿verdad?",
        "start": 6545.84,
        "end": 6547.84
    },
    {
        "text": " trabajando en un país, obviamente, que es el país donde tienen su plan de industrial.",
        "start": 6547.84,
        "end": 6551.84
    },
    {
        "text": " Y bueno, y después eso es una pequeña producción y empiezan a vender.",
        "start": 6551.84,
        "end": 6556.84
    },
    {
        "text": " Pero cuando hacen la estrategia de protección patentan en el mundo.",
        "start": 6557.84,
        "end": 6561.84
    },
    {
        "text": " No deja ni una isla del pacífico libre.",
        "start": 6561.84,
        "end": 6564.84
    },
    {
        "text": " Porque si vos dejas una isla del pacífico libre, te agarran un producto que compra en un producto en cualquier farmaciano de Europa",
        "start": 6564.84,
        "end": 6574.84
    },
    {
        "text": " y te van a la isla y te ponen la planta.",
        "start": 6574.84,
        "end": 6576.84
    },
    {
        "text": " ¿Entendés?",
        "start": 6576.84,
        "end": 6578.84
    },
    {
        "text": " ¿Entonces digo, lo que tienes que estudiar cuando hacer la estrategia de protección es que tan fácil te pongo copia.",
        "start": 6578.84,
        "end": 6585.84
    },
    {
        "text": " Si vos y no mirá, yo le pongo medidas tecnológicas, no hay manera de saber, no hay manera de copiar, no hay manera de acceder.",
        "start": 6586.84,
        "end": 6592.84
    },
    {
        "text": " En software, no sé si pasa.",
        "start": 6592.84,
        "end": 6596.84
    },
    {
        "text": " Yo he visto que dado la medida de seguridad siempre va a haber un hacker capaz de lograr.",
        "start": 6596.84,
        "end": 6604.84
    },
    {
        "text": " ¿Qué más tengo en un cliente hackers que me encantan?",
        "start": 6604.84,
        "end": 6610.84
    },
    {
        "text": " Son mi preferido. No encantan.",
        "start": 6611.84,
        "end": 6613.84
    },
    {
        "text": " Pero me encantan, me encantan, me divierten.",
        "start": 6613.84,
        "end": 6616.84
    },
    {
        "text": " Entonces, bueno, lo que te quiero decir es que en software es mejor complicado.",
        "start": 6616.84,
        "end": 6620.84
    },
    {
        "text": " Pero bueno, voy a buscar la manera de proteger eso para que no venga un peruano a hacer lo mismo y te ropa tu marca.",
        "start": 6620.84,
        "end": 6627.84
    },
    {
        "text": " ¿Entendés?",
        "start": 6627.84,
        "end": 6628.84
    },
    {
        "text": " Y más allá que no lo vendas en Uruguay también protegeros.",
        "start": 6628.84,
        "end": 6631.84
    },
    {
        "text": " Y bueno, porque digo si tu negocio es un éxito, alguien se va a enterar de que vos estás vendiendo a perú.",
        "start": 6631.84,
        "end": 6637.84
    },
    {
        "text": " Yo no sé si ustedes son conscientes, pero el sistema de aduana se llama Lucía.",
        "start": 6638.84,
        "end": 6643.84
    },
    {
        "text": " No sé si alguna vez se escucharon hablar del sistema de aduana.",
        "start": 6643.84,
        "end": 6646.84
    },
    {
        "text": " No.",
        "start": 6646.84,
        "end": 6647.84
    },
    {
        "text": " No de exportación que pase por Lucía, ¿no?",
        "start": 6647.84,
        "end": 6651.84
    },
    {
        "text": " Lo podéis ver.",
        "start": 6651.84,
        "end": 6652.84
    },
    {
        "text": " Se vos podéis ver. No sale en la cantidad.",
        "start": 6652.84,
        "end": 6655.84
    },
    {
        "text": " Eso es parte de la información.",
        "start": 6655.84,
        "end": 6656.84
    },
    {
        "text": " Te no los ganó, no les di el ejemplo.",
        "start": 6656.84,
        "end": 6658.84
    },
    {
        "text": " Pero de la información que puedes sacar para saber qué están exportando a tus competidores.",
        "start": 6658.84,
        "end": 6663.84
    },
    {
        "text": " O de saber exactamente qué importan y qué exportan.",
        "start": 6663.84,
        "end": 6668.84
    },
    {
        "text": " Yo tengo empresas que estudian a Lucía para ver qué componentes traen sus competidores para ver qué es lo que están haciendo.",
        "start": 6668.84,
        "end": 6678.84
    },
    {
        "text": " No sé si me seguían y es totalmente legal.",
        "start": 6678.84,
        "end": 6681.84
    },
    {
        "text": " Totalmente legal porque la información está online.",
        "start": 6681.84,
        "end": 6686.84
    },
    {
        "text": " Perfecto.",
        "start": 6686.84,
        "end": 6687.84
    },
    {
        "text": " Y vos sacan las conclusiones que querés.",
        "start": 6687.84,
        "end": 6689.84
    },
    {
        "text": " Ahora te cuento otra.",
        "start": 6689.84,
        "end": 6691.84
    },
    {
        "text": " También tengo clientes que están haciendo estrategias de secreto.",
        "start": 6691.84,
        "end": 6694.84
    },
    {
        "text": " Ten un empresa muy interesante que hace esas bolsas biodegradables.",
        "start": 6694.84,
        "end": 6702.84
    },
    {
        "text": " Esas que son de material vegetal.",
        "start": 6702.84,
        "end": 6707.84
    },
    {
        "text": " Y como tienen componentes muy específicos,",
        "start": 6707.84,
        "end": 6713.84
    },
    {
        "text": " importantes cosas que no necesitan para justamente que los competidores nos sepan la formulación.",
        "start": 6713.84,
        "end": 6722.84
    },
    {
        "text": " ¿Te seguís?",
        "start": 6722.84,
        "end": 6723.84
    },
    {
        "text": " Sí, sí, sí.",
        "start": 6723.84,
        "end": 6725.84
    },
    {
        "text": " Totalmente.",
        "start": 6725.84,
        "end": 6726.84
    },
    {
        "text": " Estos también se da eso.",
        "start": 6726.84,
        "end": 6728.84
    },
    {
        "text": " De que te han pedado también.",
        "start": 6728.84,
        "end": 6730.84
    },
    {
        "text": " Saben lo que traen, pero no lo que usa.",
        "start": 6730.84,
        "end": 6733.84
    },
    {
        "text": " Claro.",
        "start": 6733.84,
        "end": 6734.84
    },
    {
        "text": " Y las que ya traen todas, ¿entendés?",
        "start": 6734.84,
        "end": 6737.84
    },
    {
        "text": " Buenísimo.",
        "start": 6737.84,
        "end": 6738.84
    },
    {
        "text": " Un chale de la pregunta de Dios.",
        "start": 6738.84,
        "end": 6741.84
    },
    {
        "text": " O no lo tenía más Dios.",
        "start": 6741.84,
        "end": 6744.84
    },
    {
        "text": " No sé, en realidad, iba de la manera de lo comentaba de compra en el farmaco y se van a producir una isla.",
        "start": 6744.84,
        "end": 6750.84
    },
    {
        "text": " En el software pasa eso también.",
        "start": 6750.84,
        "end": 6752.84
    },
    {
        "text": " O sea, por ejemplo, podré yo a Estados Unidos y patendo pedido allá, por ejemplo.",
        "start": 6752.84,
        "end": 6756.84
    },
    {
        "text": " O ahí también ya prima el tema de derechos de autor y también en realidad ya no es aplicable.",
        "start": 6756.84,
        "end": 6762.84
    },
    {
        "text": " No sé si me explico.",
        "start": 6762.84,
        "end": 6764.84
    },
    {
        "text": " Mira, este Diego, la patente solamente la logra el primero que llega.",
        "start": 6765.84,
        "end": 6770.84
    },
    {
        "text": " Pero lo importante que tengas en cuenta es que la novedad es mundial.",
        "start": 6770.84,
        "end": 6774.84
    },
    {
        "text": " O sea, si pedido ya es un éxito ya acá, no vas a tener de ninguna manera chance de proteger al resto del mundo.",
        "start": 6774.84,
        "end": 6784.84
    },
    {
        "text": " Porque en los lugares donde no fue protegida ya están en el dominio público.",
        "start": 6784.84,
        "end": 6788.84
    },
    {
        "text": " Se las van a poder copiar, pero nunca nadie más la va a poder proteger.",
        "start": 6788.84,
        "end": 6792.84
    },
    {
        "text": " Este es importante que lo sepan, se empatente, protege el primero.",
        "start": 6793.84,
        "end": 6797.84
    },
    {
        "text": " El principio se llama First of All.",
        "start": 6797.84,
        "end": 6801.84
    },
    {
        "text": " El primero que presenta el consama, el la solicitud.",
        "start": 6801.84,
        "end": 6806.84
    },
    {
        "text": " Es el único que viene chance siempre y cuando ponga con las tres requisitos.",
        "start": 6806.84,
        "end": 6811.84
    },
    {
        "text": " Pero entonces...",
        "start": 6811.84,
        "end": 6813.84
    },
    {
        "text": " Es el propio mundo.",
        "start": 6813.84,
        "end": 6815.84
    },
    {
        "text": " Sí, sí, pero es un poco un poco oiris, pero entonces si yo, por ejemplo, estoy con la oreja para esperando a cualquier cosa.",
        "start": 6815.84,
        "end": 6821.84
    },
    {
        "text": " Y la patente en cualquier lado, esfuerzo a que la otra empresa no tenga control sobre lo que acaba de producir.",
        "start": 6822.84,
        "end": 6830.84
    },
    {
        "text": " Ya lo van a que si vos produciste ya las están revelando desde el punto de vista, o sea, desde el punto de vista de lo que se le estábamos de la técnica,",
        "start": 6830.84,
        "end": 6838.84
    },
    {
        "text": " o sea lo que os ponde vos estudias cuando el examinador estudia.",
        "start": 6838.84,
        "end": 6842.84
    },
    {
        "text": " Si es novedoso, el estudio le estábamos de la técnica. ¿Qué se considera estado de la técnica?",
        "start": 6842.84,
        "end": 6847.84
    },
    {
        "text": " Viste ahí venimos al tema conceptual. Si vos vas a la definición de la ley, la ley dice que estaba en la técnica,",
        "start": 6848.84,
        "end": 6853.84
    },
    {
        "text": " se conjunto con los cimientos técnicos desarrollados antes de la presentación de la solicitud.",
        "start": 6853.84,
        "end": 6858.84
    },
    {
        "text": " Y cuando lo atravesa un poquito más a lo que es el sistema de patentes,",
        "start": 6858.84,
        "end": 6862.84
    },
    {
        "text": " si las oficinas de patentes en sí, lo que estudian las oficinas son todos las bases de datos internacionales de patentes de todo el mundo,",
        "start": 6862.84,
        "end": 6870.84
    },
    {
        "text": " que están asociadas por lo supuesto y que ahora en Internet son fáciles de conseguir.",
        "start": 6870.84,
        "end": 6875.84
    },
    {
        "text": " Entonces primero, ven todo el sistema de patentes, después ven,",
        "start": 6875.84,
        "end": 6879.84
    },
    {
        "text": " todas las bases de datos internacionales y de productos, o sea, si vos tenés un producto en el mercado que no lo hayas patentado,",
        "start": 6879.84,
        "end": 6886.84
    },
    {
        "text": " ya es parte del estado de la técnica desde el punto de vista jurídico.",
        "start": 6886.84,
        "end": 6890.84
    },
    {
        "text": " Si vos estás vendiendo, yo tení un cliente que su realidad me pidió para presentar una pintura que tiene la capacidad de ser inserficida.",
        "start": 6891.84,
        "end": 6902.84
    },
    {
        "text": " No saben lo bien que funciona, eso lo sapaste.",
        "start": 6902.84,
        "end": 6906.84
    },
    {
        "text": " Entonces, si vos pintás la pared, los moquitos se posan y se caen muertos.",
        "start": 6906.84,
        "end": 6911.84
    },
    {
        "text": " Las moquitas también, pero los moquitos increíbles.",
        "start": 6911.84,
        "end": 6914.84
    },
    {
        "text": " Yo lo sé por eso puedo decirles que funciona muy bien y no es toque.",
        "start": 6915.84,
        "end": 6920.84
    },
    {
        "text": " Está igual tienen 15 años atrás, son las oficinas.",
        "start": 6934.84,
        "end": 6938.84
    },
    {
        "text": " El está recontento porque le dice todo el mundo que tiene la patent pending, es lo que él le interesaba.",
        "start": 6939.84,
        "end": 6945.84
    },
    {
        "text": " Patent pending y es cierto, está patent pending, mi respuesta es no se la van a dar.",
        "start": 6945.84,
        "end": 6951.84
    },
    {
        "text": " ¿Por qué no se la van a dar? Porque el tipo sea como 5 años que la estaba vendiendo.",
        "start": 6951.84,
        "end": 6956.84
    },
    {
        "text": " El examinador, lo primero que va a ver es que esa pintura ya estaba en el mercado, ya la estaba vendiendo.",
        "start": 6956.84,
        "end": 6965.84
    },
    {
        "text": " Igual el consiguió un negocio buenísimo con un mexicano que parece que el tipo está encantado.",
        "start": 6969.84,
        "end": 6974.84
    },
    {
        "text": " Está, no tendrá un abogado que le estudia el tema, pero no está comprando un monopolio, ¿entienden?",
        "start": 6974.84,
        "end": 6980.84
    },
    {
        "text": " Está comprando una formulación de una pintura que es excelente que mata lo dicho.",
        "start": 6980.84,
        "end": 6985.84
    },
    {
        "text": " ¿Verdad? Está mal eso, no, no está mal, pero no es lo mismo.",
        "start": 6985.84,
        "end": 6990.84
    },
    {
        "text": " Yo puedo comprar una pintura que mata a dichos y ser el único en todo el mundo.",
        "start": 6990.84,
        "end": 6995.84
    },
    {
        "text": " No va a ser el caso de esta pintura.",
        "start": 6995.84,
        "end": 6999.84
    },
    {
        "text": " ¿Se la va a poder copiar el primero que la saque de la formula? ¿Se entiende?",
        "start": 6999.84,
        "end": 7005.84
    },
    {
        "text": " Estamos en hora, no sé alguna pregunta.",
        "start": 7005.84,
        "end": 7007.84
    },
    {
        "text": " Ahí va, yo sacra de cimientos acá en el chat.",
        "start": 7010.84,
        "end": 7012.84
    },
    {
        "text": " Sí, pica de 42 mensajes, pero la hora que no podía. Me nababa para leerlos.",
        "start": 7012.84,
        "end": 7018.84
    },
    {
        "text": " ¿Alguna cortita del estribo y la morga de la pintura?",
        "start": 7019.84,
        "end": 7023.84
    },
    {
        "text": " Tremenda de la barra.",
        "start": 7023.84,
        "end": 7026.84
    },
    {
        "text": " No, es buenísimo. Es que la recepciónista de mi opicina, este cuchonador.",
        "start": 7026.84,
        "end": 7032.84
    }
]