[
    {
        "text": " Decidemos el para militar más para esto y el hogar.",
        "start": 0.0,
        "end": 16.96
    },
    {
        "text": " la aplicación de la entrolema del camino más corto respecto con promasión dinámica.",
        "start": 106.96,
        "end": 116.8
    },
    {
        "text": " Y vamos a tratar de volver a entrar si me está la pata.",
        "start": 120.75999999999999,
        "end": 125.36
    },
    {
        "text": " Si, ahora sí se acuerdan, si estaban acá.",
        "start": 132.35999999999999,
        "end": 135.44
    },
    {
        "text": " El problema que teníamos, vamos a caracá.",
        "start": 137.08,
        "end": 143.76000000000002
    },
    {
        "text": " Vean mi pantalla así.",
        "start": 145.28,
        "end": 146.28
    },
    {
        "text": " Era en un grafo dirigido encontrar el camino más corto entre un orígeno de estilo.",
        "start": 150.0,
        "end": 165.44
    },
    {
        "text": " Era un grafo dirigido que tiene pesos en las aritas.",
        "start": 166.96,
        "end": 183.4
    },
    {
        "text": " Entonces tiene un peso C su F a, C un peso su A, B, T, una caques entre S y C y otra caques entre C y B.",
        "start": 183.4,
        "end": 205.64000000000001
    },
    {
        "text": " Ah, pero no me están escuchando.",
        "start": 205.64,
        "end": 211.79999999999998
    },
    {
        "text": " Está bien, sólo reclarse, vos no me cuite.",
        "start": 218.44,
        "end": 222.44
    },
    {
        "text": " Una segunda chegou Stellen.",
        "start": 223.24,
        "end": 230.12
    },
    {
        "text": " Los virto Speed Range 완성ando al mismo tiempo.",
        "start": 232.35999999999999,
        "end": 235.96
    },
    {
        "text": " Bueno, que sea que son pocos, no vamos a perder al fan acá del lamento del fauro.",
        "start": 252.44,
        "end": 275.44
    },
    {
        "text": " Bueno, entonces tenemos este grau ferrigil con pesos en las aritas. Estos costos son lo que nos cuesta llegar de un nodo a otro de alguna manera para representar modelar con chicosas.",
        "start": 276.44,
        "end": 302.44
    },
    {
        "text": " El caso clásico es una red de datos y es lo que nos cuesta utilizar en el aso en nuestra red.",
        "start": 302.44,
        "end": 312.44
    },
    {
        "text": " Pero ese costo puede representar muchas cosas para enfrentar el beneficio que nos trae venderle un producto, comprastele un producto a ese y vendarsele a",
        "start": 313.44,
        "end": 329.44
    },
    {
        "text": " el esfuerzo que hay que hacer para llevar un producto del estado a, a, a, y entonces ya habíamos visto una solución para esto que era de extra, un acorimorí.",
        "start": 329.44,
        "end": 349.44
    },
    {
        "text": " Y hay un avista que grie que extra nos exigía que los costos de este grau fueron no negativo.",
        "start": 350.44,
        "end": 361.44
    },
    {
        "text": " Y eso, la forma que teníamos de demostrar que funcionaba de la exigía que se ofrece.",
        "start": 362.44,
        "end": 371.44
    },
    {
        "text": " Pero es una restricción bastante fuerte que pensando en modelar distintos tipos de procesos, nos limita bastante y si estábamos hablando de venderle algo comprolar algo a, y venderse la vez,",
        "start": 371.44,
        "end": 389.44
    },
    {
        "text": " y esa procedimiento puede implicar una ganancia o puede implicar una pérdida.",
        "start": 390.44,
        "end": 396.44
    },
    {
        "text": " Podemos ser que estemos queriendo enfrentar a valer negativos en nuestro grafo y encontrar el camino más corto nuestro grafo considerando su valer negativo.",
        "start": 397.44,
        "end": 411.44
    },
    {
        "text": " Lo que pasa es lo que empieza a hacer en una complicación es cuando esos valeres, cuando esos valeres negativos están en un camino que forma un siglo.",
        "start": 412.44,
        "end": 431.44
    },
    {
        "text": " En el caso de este que está en la literatura, donde tenemos...",
        "start": 432.44,
        "end": 446.44
    },
    {
        "text": " posto assez camping.",
        "start": 447.44,
        "end": 454.44
    },
    {
        "text": " donde tenemos un un ciclo con estos pésos a cara",
        "start": 454.44,
        "end": 461.44
    },
    {
        "text": " ¿Qué nos pasa casi? ¿Por qué los ciclos negativos generan",
        "start": 479.44,
        "end": 483.44
    },
    {
        "text": " un problema? No solo un problema para nuestra solución, un problema para nuestro modelo",
        "start": 483.44,
        "end": 488.44
    },
    {
        "text": " estamos queriendo modelar un proceso y permitimos que esas ciclos negativos",
        "start": 488.44,
        "end": 493.44
    },
    {
        "text": " capaces de generar situaciones que no son ficticias",
        "start": 493.44,
        "end": 498.44
    },
    {
        "text": " por ejemplo si estamos modelando",
        "start": 498.44,
        "end": 502.44
    },
    {
        "text": " un proceso de",
        "start": 504.44,
        "end": 508.44
    },
    {
        "text": " de venta de productos de una persona a otra",
        "start": 509.44,
        "end": 514.44
    },
    {
        "text": " un ciclo negativo nos puede estar significando que a mí lo que me comiene es comprarle",
        "start": 514.44,
        "end": 523.44
    },
    {
        "text": " este nuevo venderse lo a esto, acá tengo una pérdida pero si se lo vendo",
        "start": 523.44,
        "end": 528.44
    },
    {
        "text": " acá tengo una pequeña ganancia, acá tengo una pérdida nuevo y acá tengo una gran ganancia",
        "start": 528.44,
        "end": 535.44
    },
    {
        "text": " y si cuando se lo vendo al mismo que se lo compre a principio, vuelvo a tener una ganancia",
        "start": 535.44,
        "end": 542.44
    },
    {
        "text": " y si hago esto muchas veces cada vez tengo una ganancia mayor",
        "start": 542.44,
        "end": 547.44
    },
    {
        "text": " y eso puede ser que en el momento suceda porque alguien se equivojo al ponerle peor de las cosas",
        "start": 547.44,
        "end": 553.44
    },
    {
        "text": " pero obviamente no funciona así sino haría ganaría dinero de la nada",
        "start": 553.44,
        "end": 560.44
    },
    {
        "text": " esto es la misma problema con nuestro modelo, estamos queriendo un ciclo que no debería",
        "start": 561.44,
        "end": 565.44
    },
    {
        "text": " decirte o en todo caso si en una situación donde existe un ciclo",
        "start": 565.44,
        "end": 572.44
    },
    {
        "text": " ya no puedo pensar en el concepto de camina más corto porque yo puedo hacer lo tan corto como",
        "start": 572.44,
        "end": 579.44
    },
    {
        "text": " quiera, así que me parece algo que da me dando vuelta sin este ciclo y voy haciendo",
        "start": 579.44,
        "end": 584.44
    },
    {
        "text": " más corto, que es más corto y cuando quiero vuelvo a salir y voy a estar",
        "start": 584.44,
        "end": 591.44
    },
    {
        "text": " el concepto de camina más corto directamente no se me cito",
        "start": 591.44,
        "end": 596.44
    },
    {
        "text": " entonces para resolver esta situación nuestros amigos",
        "start": 596.44,
        "end": 603.44
    },
    {
        "text": " Belmaniforca era en Belmanera el que se inventó aquello de la camación dinámica",
        "start": 603.44,
        "end": 608.44
    },
    {
        "text": " la palabra para una sencilla dinámica para venderse a un burro que está",
        "start": 608.44,
        "end": 615.44
    },
    {
        "text": " cuando estaba pensando en estas ideas de bueno vivido un problema en su problema",
        "start": 620.44,
        "end": 625.44
    },
    {
        "text": " y en una cantidad polinómica de su problema hacia partir de hecho construyo la",
        "start": 625.44,
        "end": 632.44
    },
    {
        "text": " emol釀 y etc. Una de las primeras aplicaciones que tuvo esto fue el",
        "start": 632.44,
        "end": 641.44
    },
    {
        "text": " cálculo de camina más corto de mi rafo porque sin contrarro compro problemas del",
        "start": 641.44,
        "end": 645.44
    },
    {
        "text": " estilo está aquí que es cuando aplicaba a Dixtra a un rafo de este estilo",
        "start": 645.44,
        "end": 658.44
    },
    {
        "text": " pero aquí algunas cosas que trajerten manipulate como cualquier",
        "start": 662.44,
        "end": 672.44
    },
    {
        "text": " valor youtube de los otros programos.",
        "start": 672.44,
        "end": 681.44
    },
    {
        "text": " Con una estrategia grilla, como la de distra, acá no hay un ciclo negativo, no tiene nada",
        "start": 681.44,
        "end": 693.2
    },
    {
        "text": " raro de este gráfico.",
        "start": 693.2,
        "end": 699.48
    },
    {
        "text": " Si la aplicaba la estrategia grilla de A, me quedo con mi camino más corto, hacia",
        "start": 699.48,
        "end": 706.1600000000001
    },
    {
        "text": " una parte, hacia el arranco de la secuera, como funcionaba la distra, arrancaba generando",
        "start": 706.16,
        "end": 713.3199999999999
    },
    {
        "text": " un conjunto S de nods, y decía, bueno, ahora de todo lo que está en afuera, me quedo con",
        "start": 713.3199999999999,
        "end": 724.4399999999999
    },
    {
        "text": " el que tengo el camino más corto hacia ese nodo que está inmediatamente afuera en mi",
        "start": 724.4399999999999,
        "end": 732.78
    },
    {
        "text": " y decía, bueno, acá es B, entonces sumo.",
        "start": 732.78,
        "end": 741.9
    },
    {
        "text": " Sumo B, mi conjunto S y después sumo U, pero el camino más corto terminaba haciendo este",
        "start": 741.9,
        "end": 750.86
    },
    {
        "text": " que está acá, porque yo sumía que no había posibilidad, como todos los valores eran",
        "start": 750.86,
        "end": 756.18
    },
    {
        "text": " positivos, de dar una vuelta más larga por otro lado y que eso resultara en un camino",
        "start": 756.18,
        "end": 761.06
    },
    {
        "text": " de costo más corto.",
        "start": 761.06,
        "end": 765.4599999999999
    },
    {
        "text": " En esta situación que tenemos acá, si vemos la globalidad de la cosa y el por acá arriba,",
        "start": 765.4599999999999,
        "end": 775.14
    },
    {
        "text": " me cuesta 5 menos a y menos 1 y por acá arriba a B. Sin embargo, distra me habrá dicho",
        "start": 775.14,
        "end": 781.9399999999999
    },
    {
        "text": " que fuera por acá un costo de 1.",
        "start": 781.9399999999999,
        "end": 784.7399999999999
    },
    {
        "text": " Entonces, no está... y se queda con lo mejor que tiene en ese momento y no mira que sucede",
        "start": 784.74,
        "end": 793.3
    },
    {
        "text": " más adelante.",
        "start": 793.3,
        "end": 801.3
    },
    {
        "text": " Entonces las posibles soluciones que se debemos, que se nos fueron buriendos, las ejecutimos",
        "start": 801.3,
        "end": 806.3
    },
    {
        "text": " que hace pasaba, era decir, bueno, que pasa si me saco los valores negativos de ahí,",
        "start": 806.3,
        "end": 816.2199999999999
    },
    {
        "text": " subiendo todos los costos parejos de forma que, bueno, sigo teniendo de la vista a un",
        "start": 816.2199999999999,
        "end": 823.06
    },
    {
        "text": " al igual, se le petó un poco más arriba.",
        "start": 823.06,
        "end": 826.78
    },
    {
        "text": " Lo teniendo un grazo igual, pero a todo con valores positivos y poder aplicar.",
        "start": 826.78,
        "end": 832.5799999999999
    },
    {
        "text": " Y haremos visto un caso en el que eso no está a ver.",
        "start": 832.58,
        "end": 852.5
    },
    {
        "text": " Queden ya que ver con el aumento proporcional",
        "start": 852.5,
        "end": 864.78
    },
    {
        "text": " a la cantidad en definitiva, así hago crecer a todos los costos de estos artistas.",
        "start": 864.78,
        "end": 869.66
    },
    {
        "text": " También por ejemplo, tres para que estos valores vase a ser 0, 6, 5 y 5.",
        "start": 869.66,
        "end": 883.06
    },
    {
        "text": " En realidad, algunos caminos, el costo total, algunos caminos de ese ante, los aumenten más",
        "start": 883.06,
        "end": 890.3
    },
    {
        "text": " que el costo total de la de otros caminos.",
        "start": 890.3,
        "end": 892.66
    },
    {
        "text": " Entonces, a este camino por acá me quedó a la que valía 4, me quedó valiendo 10 y este",
        "start": 892.66,
        "end": 899.3399999999999
    },
    {
        "text": " que valía 3, me quedó valiendo 12.",
        "start": 899.34,
        "end": 906.34
    },
    {
        "text": " ¿Por qué?",
        "start": 906.34,
        "end": 911.4200000000001
    },
    {
        "text": " Porque aumenté a todos los costos de todas las artistas, en el valor igual, entonces",
        "start": 911.4200000000001,
        "end": 916.98
    },
    {
        "text": " que aumenté camino proporcionalmente a su largo, en este costo de camino proporcionalmente",
        "start": 916.98,
        "end": 922.82
    },
    {
        "text": " y no estamos hablando del largo, estamos hablando del costo de cada una de esas.",
        "start": 922.82,
        "end": 927.82
    },
    {
        "text": " Entonces, esta solución tampoco funciona y lo que se lo ocurrió a estos muchachos",
        "start": 927.82,
        "end": 940.46
    },
    {
        "text": " del manifold en los 50, fue una solución de promoción dinámica.",
        "start": 940.46,
        "end": 951.46
    },
    {
        "text": " ¿Qué es resolver el problema o dividir el problema de calcular el camino más corto",
        "start": 951.46,
        "end": 958.3000000000001
    },
    {
        "text": " entre dos no's en su problema?",
        "start": 958.3000000000001,
        "end": 963.02
    },
    {
        "text": " Y acá es que dice, ni hablar, se ha priori que no tiene que quedar un árbol resultado",
        "start": 963.02,
        "end": 970.46
    },
    {
        "text": " como en distra.",
        "start": 970.46,
        "end": 973.9399999999999
    },
    {
        "text": " No, porque me fingí a distra que alcula el camino más corto de uno a todos y ve el",
        "start": 973.9399999999999,
        "end": 982.38
    },
    {
        "text": " valor no necesariamente.",
        "start": 982.38,
        "end": 987.78
    },
    {
        "text": " Al final no queda un árbol, ya no, porque no hay al no ver ciclos negativos, van a",
        "start": 987.78,
        "end": 994.9
    },
    {
        "text": " ver que los caminos más cortos son siempre, no tienen ciclos.",
        "start": 994.9,
        "end": 1003.78
    },
    {
        "text": " Que si tuvieran ciclos, eso es importante, vamos a volver a este ejemplo acá.",
        "start": 1003.78,
        "end": 1017.9
    },
    {
        "text": " ¿Qué pasa si...",
        "start": 1017.9,
        "end": 1024.9
    },
    {
        "text": " No, no se puede ocupar esto.",
        "start": 1024.9,
        "end": 1027.9
    },
    {
        "text": " ¿Qué pasa si incluso si estos palabras no son negativos, no tengo un ciclo negativo?",
        "start": 1047.9,
        "end": 1060.9
    },
    {
        "text": " Tengo un todo para estos ciclos.",
        "start": 1060.9,
        "end": 1065.9
    },
    {
        "text": " ¿Tiene sentido que yo tenga un sitio en un camino más corto?",
        "start": 1065.9,
        "end": 1084.9
    },
    {
        "text": " Bueno, no tiene sentido.",
        "start": 1084.9,
        "end": 1089.9
    },
    {
        "text": " Exactamente, porque si querés, yo voy a sacar y ya está.",
        "start": 1090.9,
        "end": 1093.9
    },
    {
        "text": " Para qué voy a pasar dos veces por el mismo modo, si puedo no pasar, o que es el mismo",
        "start": 1093.9,
        "end": 1100.46
    },
    {
        "text": " mundo.",
        "start": 1100.46,
        "end": 1101.46
    },
    {
        "text": " Y al no ver ciclos negativos, yo no gano nada dando de vuelta a un ciclo.",
        "start": 1101.46,
        "end": 1110.9
    },
    {
        "text": " Entonces, eso es una, una, una elemento importante para para vernos fort.",
        "start": 1110.9,
        "end": 1122.9
    },
    {
        "text": " ¿Por qué?",
        "start": 1122.9,
        "end": 1123.9
    },
    {
        "text": " Porque vernos fortale la banca de la premisa de que cualquier, de cualquier camino entre",
        "start": 1123.9,
        "end": 1132.9
    },
    {
        "text": " todo y el destino, entre un origen en un destino, en un grafo dirigido sin ciclos negativos,",
        "start": 1132.9,
        "end": 1151.9
    },
    {
        "text": " en un grafo, en dinos, va a tener como mucho en el meso, arita.",
        "start": 1152.9,
        "end": 1167.9
    },
    {
        "text": " La demostración de eso es esa que acabamos, sí, acabamos de decir un poquito más informadamente.",
        "start": 1167.9,
        "end": 1174.9
    },
    {
        "text": " El camino más corto no repiten, y si no repiten, tiene como mucho, y si tiene como mucho,",
        "start": 1175.9,
        "end": 1184.9
    },
    {
        "text": " en el menos, tiene como mucho, en el menos una altas.",
        "start": 1184.9,
        "end": 1191.9
    },
    {
        "text": " Es la demostración.",
        "start": 1191.9,
        "end": 1192.9
    },
    {
        "text": " Entonces, el turco, el ingenio, esta persona fue decir, bueno, tal como he dividido",
        "start": 1193.9,
        "end": 1206.9
    },
    {
        "text": " en su problema, yo sé que como mucho, voy a tener en el menos un, en el menos un,",
        "start": 1207.9,
        "end": 1215.9
    },
    {
        "text": " la lista, en mi camino más corto.",
        "start": 1215.9,
        "end": 1218.9
    },
    {
        "text": " Entonces, lo que se le ocurrió fue dividir el problema de computar el camino óptimo,",
        "start": 1218.9,
        "end": 1228.9
    },
    {
        "text": " deje un noriño hasta ese, en el menos un, en el menos un, salto.",
        "start": 1228.9,
        "end": 1252.9
    },
    {
        "text": " Y cómo ha dividido esto en problemas más chicos?",
        "start": 1253.9,
        "end": 1258.9
    },
    {
        "text": " Y bueno, en la cantidad de sal, en la cantidad de aristas que se ven en el camino,",
        "start": 1258.9,
        "end": 1264.9
    },
    {
        "text": " en la cantidad de sal.",
        "start": 1264.9,
        "end": 1266.9
    },
    {
        "text": " Y lo que digo es, si mi camino tiene, tiene un gamo sacadante ejemplo,",
        "start": 1266.9,
        "end": 1275.9
    },
    {
        "text": " había algún caso, dejamos de un caso donde había un camino en el corto,",
        "start": 1276.9,
        "end": 1284.9
    },
    {
        "text": " que estos, en el menos un, aristas, hay uno con el menos dos aristas.",
        "start": 1284.9,
        "end": 1291.9
    },
    {
        "text": " Entonces, pasamos al mismo caso, a la misma de lógica que veníamos manejando antes.",
        "start": 1291.9,
        "end": 1296.9
    },
    {
        "text": " Bueno, si mi solución tiene y aristas, pero hay otra con que es más corta en cantidad de aristas,",
        "start": 1297.9,
        "end": 1309.9
    },
    {
        "text": " con y menos un aristas, pero tiene un corto menor, es como esta lista está participando",
        "start": 1309.9,
        "end": 1317.9
    },
    {
        "text": " o no está participando de la solución.",
        "start": 1317.9,
        "end": 1320.9
    },
    {
        "text": " La lógica no la que veníamos pensando, no?",
        "start": 1321.9,
        "end": 1323.9
    },
    {
        "text": " El elemento de mi conjunto participa en la solución, no participa en la solución.",
        "start": 1323.9,
        "end": 1330.9
    },
    {
        "text": " Ahora los elementos que participan, no participan en la solución son las aristas.",
        "start": 1330.9,
        "end": 1335.9
    },
    {
        "text": " Entonces, digo, bueno, si yo ahora lo que tengo es que mi función hot de I,",
        "start": 1336.9,
        "end": 1350.9
    },
    {
        "text": " de lo que representa,",
        "start": 1350.9,
        "end": 1353.9
    },
    {
        "text": " el corto, de llegar a ti, a mi nuevo destino,",
        "start": 1366.9,
        "end": 1379.9
    },
    {
        "text": " usando como mucho, esto es importante.",
        "start": 1379.9,
        "end": 1389.9
    },
    {
        "text": " Y aristas.",
        "start": 1390.9,
        "end": 1396.9
    },
    {
        "text": " Entonces, ahora, pueden empezar a pensar este problema en términos de subfademos.",
        "start": 1396.9,
        "end": 1403.9
    },
    {
        "text": " Entonces, digo, ¿qué pasa si el camino, el camino, hemos corto desde un...",
        "start": 1403.9,
        "end": 1415.9
    },
    {
        "text": " Vido que caes de llegar a ti, y este no acá es la realidad desde dónde se ve.",
        "start": 1416.9,
        "end": 1424.9
    },
    {
        "text": " Eso es una cosa que puede ser dentro de la institución latínica.",
        "start": 1424.9,
        "end": 1430.9
    },
    {
        "text": " Entonces, puede decir, bueno, si el camino es más corto en realidad tiene,",
        "start": 1430.9,
        "end": 1434.9
    },
    {
        "text": " estamos haciendo que tiene como mucho aristas, pero si la realidad tiene como mucho y menos un aristas,",
        "start": 1434.9,
        "end": 1439.9
    },
    {
        "text": " entonces, mi realidad es que el óptimo de I arrancando de B hasta T,",
        "start": 1440.9,
        "end": 1448.9
    },
    {
        "text": " es igual a el óptimo, como mucho y menos una aristas,",
        "start": 1448.9,
        "end": 1456.9
    },
    {
        "text": " y el camino de B.",
        "start": 1457.9,
        "end": 1463.9
    },
    {
        "text": " Y lo otro que sea que, volviendo al ejército acá,",
        "start": 1463.9,
        "end": 1471.9
    },
    {
        "text": " si el camino más corto hasta mi destino,",
        "start": 1471.9,
        "end": 1478.9
    },
    {
        "text": " es a partir de B, es hacia alguna parte, es a través de lo de B,",
        "start": 1478.9,
        "end": 1487.9
    },
    {
        "text": " lo que yo sé es que a mí me cuesta el corto de esta arista,",
        "start": 1487.9,
        "end": 1494.9
    },
    {
        "text": " más el óptimo de todo esto,",
        "start": 1494.9,
        "end": 1501.9
    },
    {
        "text": " que es el óptimo de llegar en I,",
        "start": 1501.9,
        "end": 1506.9
    },
    {
        "text": " menos una aristas desde W, y acá hasta la diferencia.",
        "start": 1506.9,
        "end": 1513.9
    },
    {
        "text": " Hasta ahí se siga.",
        "start": 1516.9,
        "end": 1519.9
    },
    {
        "text": " Man, ¿vió esto?",
        "start": 1520.9,
        "end": 1524.9
    },
    {
        "text": " Man, ¿vió esto?",
        "start": 1528.9,
        "end": 1531.9
    },
    {
        "text": " Eh...",
        "start": 1532.9,
        "end": 1535.9
    },
    {
        "text": " Está ahí, voy a...",
        "start": 1540.9,
        "end": 1544.9
    },
    {
        "text": " Si yo tuviera...",
        "start": 1544.9,
        "end": 1548.9
    },
    {
        "text": " no puedo sol de votar acá, ¿no?",
        "start": 1549.9,
        "end": 1553.9
    },
    {
        "text": " Estaría bueno ponerles que voten...",
        "start": 1553.9,
        "end": 1556.9
    },
    {
        "text": " Así me van diciendo que está pasando, bueno,",
        "start": 1556.9,
        "end": 1560.9
    },
    {
        "text": " es otra canción.",
        "start": 1560.9,
        "end": 1563.9
    },
    {
        "text": " ¿Pues hay reacciones y con reacciones?",
        "start": 1563.9,
        "end": 1568.9
    },
    {
        "text": " Ah, con reacciones.",
        "start": 1568.9,
        "end": 1571.9
    },
    {
        "text": " No sé, pasa que esta canción no puedo habilitar.",
        "start": 1571.9,
        "end": 1576.9
    },
    {
        "text": " No puedo.",
        "start": 1581.9,
        "end": 1584.9
    },
    {
        "text": " Vale, me haga un dedo para el diario.",
        "start": 1584.9,
        "end": 1589.9
    },
    {
        "text": " Entonces, estábamos en que si yo llego a T a través de W,",
        "start": 1595.9,
        "end": 1603.9
    },
    {
        "text": " entonces el camino más corto es el costo de llegar a W,",
        "start": 1603.9,
        "end": 1607.9
    },
    {
        "text": " más el óptimo de llegar en un paso menos desde W hasta T.",
        "start": 1607.9,
        "end": 1613.9
    },
    {
        "text": " Entonces, en ese caso, en el caso de C,",
        "start": 1615.9,
        "end": 1620.9
    },
    {
        "text": " el camino,",
        "start": 1620.9,
        "end": 1623.9
    },
    {
        "text": " C,",
        "start": 1623.9,
        "end": 1627.9
    },
    {
        "text": " usa y alistas.",
        "start": 1629.9,
        "end": 1634.9
    },
    {
        "text": " Y la primera lista.",
        "start": 1636.9,
        "end": 1640.9
    },
    {
        "text": " Es W.",
        "start": 1641.9,
        "end": 1647.9
    },
    {
        "text": " Entonces, el óptimo,",
        "start": 1647.9,
        "end": 1652.9
    },
    {
        "text": " en niaristas desde W hasta el estino,",
        "start": 1652.9,
        "end": 1658.9
    },
    {
        "text": " es igual a el costo de llegar a W desde W,",
        "start": 1658.9,
        "end": 1664.9
    },
    {
        "text": " más el óptimo de llegar en un paso menos,",
        "start": 1664.9,
        "end": 1669.9
    },
    {
        "text": " a W desde W.",
        "start": 1669.9,
        "end": 1676.9
    },
    {
        "text": " Y entonces ahí ya algo que parecía bastante anti-infinitivo,",
        "start": 1676.9,
        "end": 1682.9
    },
    {
        "text": " nos queda armado para una recursión del estilo de las que usamos",
        "start": 1682.9,
        "end": 1688.9
    },
    {
        "text": " para pensar en problemas en niarmiques.",
        "start": 1688.9,
        "end": 1693.9
    },
    {
        "text": " Entonces, lo que nos queda es una recursión que dice,",
        "start": 1694.9,
        "end": 1699.9
    },
    {
        "text": " vamos a ver,",
        "start": 1699.9,
        "end": 1703.9
    },
    {
        "text": " sí, y es mayor que cero,",
        "start": 1703.9,
        "end": 1708.9
    },
    {
        "text": " es decir, si tengo mayor algún paso en mi camino,",
        "start": 1708.9,
        "end": 1715.9
    },
    {
        "text": " el óptimo,",
        "start": 1715.9,
        "end": 1720.9
    },
    {
        "text": " en mi pasos desde W hasta el estino,",
        "start": 1720.9,
        "end": 1727.9
    },
    {
        "text": " es igual al mínimo de algunas de dos cosas,",
        "start": 1727.9,
        "end": 1732.9
    },
    {
        "text": " al mínimo del óptimo de llegar en límeno en un paso desde W,",
        "start": 1732.9,
        "end": 1742.9
    },
    {
        "text": " por algún otro lado,",
        "start": 1742.9,
        "end": 1747.9
    },
    {
        "text": " o,",
        "start": 1748.9,
        "end": 1753.9
    },
    {
        "text": " se encuentra que acá yo tenía un solo,",
        "start": 1753.9,
        "end": 1756.9
    },
    {
        "text": " un solo W, pero podría tener otros",
        "start": 1756.9,
        "end": 1762.9
    },
    {
        "text": " y tener pasos por el camino protocolado.",
        "start": 1762.9,
        "end": 1765.9
    },
    {
        "text": " Entonces, tengo que considerar todas esas posibilidades",
        "start": 1765.9,
        "end": 1769.9
    },
    {
        "text": " y tengo que considerar el mínimo de todas esas posibilidades,",
        "start": 1769.9,
        "end": 1775.9
    },
    {
        "text": " el mínimo de todos los dos leves,",
        "start": 1775.9,
        "end": 1778.9
    },
    {
        "text": " que pertenésseme al conjunto de vertices,",
        "start": 1778.9,
        "end": 1783.9
    },
    {
        "text": " de grafo,",
        "start": 1783.9,
        "end": 1787.9
    },
    {
        "text": " del óptimo de llegar en límeno en un paso desde cada uno de esos dos leves,",
        "start": 1787.9,
        "end": 1796.9
    },
    {
        "text": " más el costo de llegar a W a cada uno de esos dos.",
        "start": 1796.9,
        "end": 1802.9
    },
    {
        "text": " Esta reclusión se entiende?",
        "start": 1803.9,
        "end": 1809.9
    },
    {
        "text": " Acundo, dice que sí,",
        "start": 1814.9,
        "end": 1817.9
    },
    {
        "text": " si vamos de la que sí ustedes,",
        "start": 1817.9,
        "end": 1822.9
    },
    {
        "text": " y va.",
        "start": 1823.9,
        "end": 1826.9
    },
    {
        "text": " Entonces, con esta recursión en la mano,",
        "start": 1831.9,
        "end": 1836.9
    },
    {
        "text": " tenemos la receta de Hago para armar nuestro igual.",
        "start": 1840.9,
        "end": 1847.9
    },
    {
        "text": " Y nuestra comina es que acuerrimos el shortest path,",
        "start": 1853.9,
        "end": 1864.9
    },
    {
        "text": " al cual entra un grafo,",
        "start": 1864.9,
        "end": 1867.9
    },
    {
        "text": " un origen y un destino.",
        "start": 1867.9,
        "end": 1871.9
    },
    {
        "text": " Esta es la violeta de França,",
        "start": 1871.9,
        "end": 1874.9
    },
    {
        "text": " acá tenemos un destino definido como en la vida,",
        "start": 1874.9,
        "end": 1879.9
    },
    {
        "text": " a diferencia de la distra que era de un origen a todos,",
        "start": 1880.9,
        "end": 1885.9
    },
    {
        "text": " por su forma de trabajar,",
        "start": 1885.9,
        "end": 1889.9
    },
    {
        "text": " necesitaba fortalecer y de todos.",
        "start": 1889.9,
        "end": 1891.9
    },
    {
        "text": " Acá tenemos un destino en mente.",
        "start": 1891.9,
        "end": 1894.9
    },
    {
        "text": " Y sí, vamos a tener que explorar los caminos,",
        "start": 1894.9,
        "end": 1898.9
    },
    {
        "text": " pero lo que terminamos teniendo es el camino más corto de un origen.",
        "start": 1898.9,
        "end": 1903.9
    },
    {
        "text": " En este recorismo tenemos Eni,",
        "start": 1904.9,
        "end": 1915.9
    },
    {
        "text": " que es igual a la carinalidad de Ben,",
        "start": 1915.9,
        "end": 1921.9
    },
    {
        "text": " es que la cantidad de nuevos ejes,",
        "start": 1921.9,
        "end": 1927.9
    },
    {
        "text": " tenemos una raíz",
        "start": 1927.9,
        "end": 1932.9
    },
    {
        "text": " en mente como en todos los problemas de la masiminámica.",
        "start": 1934.9,
        "end": 1939.9
    },
    {
        "text": " Y este a raíz que es evidimensional,",
        "start": 1940.9,
        "end": 1943.9
    },
    {
        "text": " porque tenemos por un lado la cantidad máxima de aristas",
        "start": 1943.9,
        "end": 1948.9
    },
    {
        "text": " de los caminos y por otro lado los nodos de origen.",
        "start": 1948.9,
        "end": 1953.9
    },
    {
        "text": " Dejamos de eso.",
        "start": 1953.9,
        "end": 1956.9
    },
    {
        "text": " Tenemos algo de 0,",
        "start": 1956.9,
        "end": 1959.9
    },
    {
        "text": " en una dimensión y en la otra dimensión,",
        "start": 1960.9,
        "end": 1964.9
    },
    {
        "text": " todos los...",
        "start": 1964.9,
        "end": 1969.9
    },
    {
        "text": " de 0 a niminos 1,",
        "start": 1969.9,
        "end": 1971.9
    },
    {
        "text": " porque es la cantidad máxima de aristas de un camino en este recorismo.",
        "start": 1971.9,
        "end": 1979.9
    },
    {
        "text": " Y en la otra dimensión todos los vertices.",
        "start": 1979.9,
        "end": 1984.9
    },
    {
        "text": " Y como es mi paso base,",
        "start": 1985.9,
        "end": 1991.9
    },
    {
        "text": " digamos, de este recorismo.",
        "start": 1991.9,
        "end": 1994.9
    },
    {
        "text": " Bueno,",
        "start": 1994.9,
        "end": 1997.9
    },
    {
        "text": " si cambias la restricción de que no tengas ciclas negativos,",
        "start": 1997.9,
        "end": 2002.9
    },
    {
        "text": " porque cuidar de caminos más cortos de esta casa,",
        "start": 2002.9,
        "end": 2006.9
    },
    {
        "text": " regrimos funciona también.",
        "start": 2006.9,
        "end": 2008.9
    },
    {
        "text": " Sí, funciona.",
        "start": 2008.9,
        "end": 2011.9
    },
    {
        "text": " De hecho,",
        "start": 2012.9,
        "end": 2015.9
    },
    {
        "text": " se puede... o sea, funciona.",
        "start": 2015.9,
        "end": 2017.9
    },
    {
        "text": " En el sentido de dar eso hasta casa.",
        "start": 2017.9,
        "end": 2020.9
    },
    {
        "text": " Te da los caminos.",
        "start": 2020.9,
        "end": 2022.9
    },
    {
        "text": " Si se mete en un ciclo negativo,",
        "start": 2022.9,
        "end": 2025.9
    },
    {
        "text": " le van a empezar a dar vuelta,",
        "start": 2025.9,
        "end": 2027.9
    },
    {
        "text": " pero no va a estar dando vuelta.",
        "start": 2027.9,
        "end": 2029.9
    },
    {
        "text": " Por el tiempo,",
        "start": 2029.9,
        "end": 2030.9
    },
    {
        "text": " y le dar las vueltas a sacar.",
        "start": 2030.9,
        "end": 2032.9
    },
    {
        "text": " Pero sí,",
        "start": 2032.9,
        "end": 2034.9
    },
    {
        "text": " es una forma que, por ahí,",
        "start": 2034.9,
        "end": 2037.9
    },
    {
        "text": " de detectar ciclas negativos en grazos.",
        "start": 2037.9,
        "end": 2044.9
    },
    {
        "text": " Entonces,",
        "start": 2048.9,
        "end": 2051.9
    },
    {
        "text": " en la inicialización,",
        "start": 2051.9,
        "end": 2053.9
    },
    {
        "text": " digo que, bueno,",
        "start": 2053.9,
        "end": 2055.9
    },
    {
        "text": " llegar en 0 saltos",
        "start": 2055.9,
        "end": 2058.9
    },
    {
        "text": " desde el destino definitiva,",
        "start": 2058.9,
        "end": 2064.9
    },
    {
        "text": " lo va a leer,",
        "start": 2064.9,
        "end": 2066.9
    },
    {
        "text": " el destino llegó al destino de 0 saltos,",
        "start": 2066.9,
        "end": 2068.9
    },
    {
        "text": " esto es lo sé.",
        "start": 2068.9,
        "end": 2069.9
    },
    {
        "text": " Y llegar en 0 saltos",
        "start": 2069.9,
        "end": 2076.9
    },
    {
        "text": " desde cualquier otro, ¿no?",
        "start": 2076.9,
        "end": 2078.9
    },
    {
        "text": " ¿Cuánto vale?",
        "start": 2082.9,
        "end": 2084.9
    },
    {
        "text": " Bueno, para mi...",
        "start": 2084.9,
        "end": 2086.9
    },
    {
        "text": " Para mi algoritmo acaba de valer infinito.",
        "start": 2086.9,
        "end": 2089.9
    },
    {
        "text": " O sea,",
        "start": 2089.9,
        "end": 2091.9
    },
    {
        "text": " yo no puedo llegar en 0 saltos",
        "start": 2091.9,
        "end": 2093.9
    },
    {
        "text": " desde cualquier otro",
        "start": 2093.9,
        "end": 2095.9
    },
    {
        "text": " y no sea el propio destino.",
        "start": 2096.9,
        "end": 2098.9
    },
    {
        "text": " Para todo...",
        "start": 2103.9,
        "end": 2105.9
    },
    {
        "text": " ve...",
        "start": 2107.9,
        "end": 2108.9
    },
    {
        "text": " ...into el destino.",
        "start": 2108.9,
        "end": 2110.9
    },
    {
        "text": " Y lo que pasó a hacer ahora es usar la recusión.",
        "start": 2113.9,
        "end": 2117.9
    },
    {
        "text": " Entonces, para cada...",
        "start": 2118.9,
        "end": 2120.9
    },
    {
        "text": " para cada...",
        "start": 2121.9,
        "end": 2123.9
    },
    {
        "text": " ...vertice,",
        "start": 2124.9,
        "end": 2126.9
    },
    {
        "text": " ve...",
        "start": 2127.9,
        "end": 2129.9
    },
    {
        "text": " ...no me importa el orden.",
        "start": 2130.9,
        "end": 2132.9
    },
    {
        "text": " Y lo que sí me importa es que arranco la cantidad de saltos,",
        "start": 2137.9,
        "end": 2140.9
    },
    {
        "text": " pero acá me llego.",
        "start": 2140.9,
        "end": 2142.9
    },
    {
        "text": " Para cada cantidad máxima de saltos,",
        "start": 2145.9,
        "end": 2148.9
    },
    {
        "text": " y para cada...",
        "start": 2153.9,
        "end": 2156.9
    },
    {
        "text": " ...vertice en el conjunto de vértices,",
        "start": 2156.9,
        "end": 2160.9
    },
    {
        "text": " acá lo que hago es...",
        "start": 2160.9,
        "end": 2162.9
    },
    {
        "text": " ...computar m...",
        "start": 2162.9,
        "end": 2165.9
    },
    {
        "text": " ...de...",
        "start": 2165.9,
        "end": 2167.9
    },
    {
        "text": " ...y...",
        "start": 2167.9,
        "end": 2169.9
    },
    {
        "text": " ...de...",
        "start": 2169.9,
        "end": 2172.9
    },
    {
        "text": " ...y...",
        "start": 2172.9,
        "end": 2174.9
    },
    {
        "text": " ...de...",
        "start": 2174.9,
        "end": 2177.9
    },
    {
        "text": " ...como...",
        "start": 2177.9,
        "end": 2180.9
    },
    {
        "text": " ...como...",
        "start": 2180.9,
        "end": 2182.9
    },
    {
        "text": " ...todo esto me traca.",
        "start": 2182.9,
        "end": 2184.9
    },
    {
        "text": " El mínimo...",
        "start": 2184.9,
        "end": 2187.9
    },
    {
        "text": " ...de...",
        "start": 2187.9,
        "end": 2189.9
    },
    {
        "text": " ...m...",
        "start": 2189.9,
        "end": 2191.9
    },
    {
        "text": " ...de...",
        "start": 2191.9,
        "end": 2192.9
    },
    {
        "text": " ...y menos 1...",
        "start": 2192.9,
        "end": 2194.9
    },
    {
        "text": " ...ve...",
        "start": 2194.9,
        "end": 2197.9
    },
    {
        "text": " ...o...",
        "start": 2197.9,
        "end": 2199.9
    },
    {
        "text": " ...el mínimo...",
        "start": 2199.9,
        "end": 2202.9
    },
    {
        "text": " ...para todos los...",
        "start": 2204.9,
        "end": 2206.9
    },
    {
        "text": " ...doleses,",
        "start": 2206.9,
        "end": 2208.9
    },
    {
        "text": " y ahora, de...",
        "start": 2208.9,
        "end": 2211.9
    },
    {
        "text": " ...y...",
        "start": 2211.9,
        "end": 2214.9
    },
    {
        "text": " ...de...",
        "start": 2214.9,
        "end": 2215.9
    },
    {
        "text": " ...m...",
        "start": 2215.9,
        "end": 2217.9
    },
    {
        "text": " ...de...",
        "start": 2217.9,
        "end": 2218.9
    },
    {
        "text": " ...y menos 1...",
        "start": 2218.9,
        "end": 2221.9
    },
    {
        "text": " ...ve...",
        "start": 2221.9,
        "end": 2223.9
    },
    {
        "text": " ...más...",
        "start": 2223.9,
        "end": 2224.9
    },
    {
        "text": " ...y...",
        "start": 2224.9,
        "end": 2226.9
    },
    {
        "text": " ...ve...",
        "start": 2226.9,
        "end": 2227.9
    },
    {
        "text": " ...a dónde.",
        "start": 2227.9,
        "end": 2229.9
    },
    {
        "text": " Y es todo, ya hice termina...",
        "start": 2232.9,
        "end": 2235.9
    },
    {
        "text": " ...mí...",
        "start": 2235.9,
        "end": 2237.9
    },
    {
        "text": " ...aí se termina el manfor.",
        "start": 2237.9,
        "end": 2240.9
    },
    {
        "text": " De vuelvo...",
        "start": 2248.9,
        "end": 2251.9
    },
    {
        "text": " ...en grafo,",
        "start": 2251.9,
        "end": 2253.9
    },
    {
        "text": " ...en la raíz de la matriz está...",
        "start": 2253.9,
        "end": 2255.9
    },
    {
        "text": " ...que en definitiva,",
        "start": 2255.9,
        "end": 2257.9
    },
    {
        "text": " en la que va a tener...",
        "start": 2257.9,
        "end": 2259.9
    },
    {
        "text": " ...en todas las oposiciones son...",
        "start": 2259.9,
        "end": 2261.9
    },
    {
        "text": " ...los camin...",
        "start": 2261.9,
        "end": 2263.9
    },
    {
        "text": " ...el valor,",
        "start": 2263.9,
        "end": 2264.9
    },
    {
        "text": " el costo de camin más cortos...",
        "start": 2264.9,
        "end": 2266.9
    },
    {
        "text": " ...hasta...",
        "start": 2266.9,
        "end": 2268.9
    },
    {
        "text": " ...es...",
        "start": 2268.9,
        "end": 2270.9
    },
    {
        "text": " ...y...",
        "start": 2270.9,
        "end": 2271.9
    },
    {
        "text": " ...el material que me importa es...",
        "start": 2271.9,
        "end": 2273.9
    },
    {
        "text": " ...que tiene como mucho en el menso...",
        "start": 2273.9,
        "end": 2276.9
    },
    {
        "text": " ...saltos.",
        "start": 2276.9,
        "end": 2278.9
    },
    {
        "text": " Les de...",
        "start": 2280.9,
        "end": 2281.9
    },
    {
        "text": " ...de que es eso, ¿no?",
        "start": 2281.9,
        "end": 2283.9
    },
    {
        "text": " ¿Dónde?",
        "start": 2283.9,
        "end": 2285.9
    },
    {
        "text": " Cuando yo cae el culo del camino...",
        "start": 2285.9,
        "end": 2288.9
    },
    {
        "text": " ...los...",
        "start": 2288.9,
        "end": 2289.9
    },
    {
        "text": " ...no por los cuales paso...",
        "start": 2289.9,
        "end": 2291.9
    },
    {
        "text": " ...no les estoy calculando también...",
        "start": 2291.9,
        "end": 2293.9
    },
    {
        "text": " ...el...",
        "start": 2293.9,
        "end": 2294.9
    },
    {
        "text": " ...sú camino más corto a ese que yo quiero ir.",
        "start": 2294.9,
        "end": 2297.9
    },
    {
        "text": " Sí, sí, esa es el que estaba...",
        "start": 2297.9,
        "end": 2299.9
    },
    {
        "text": " ...diciéndome de introverado recién.",
        "start": 2299.9,
        "end": 2301.9
    },
    {
        "text": " Lo que termina viendo...",
        "start": 2301.9,
        "end": 2303.9
    },
    {
        "text": " ...en...",
        "start": 2303.9,
        "end": 2304.9
    },
    {
        "text": " ...la matriz...",
        "start": 2304.9,
        "end": 2305.9
    },
    {
        "text": " ...es...",
        "start": 2305.9,
        "end": 2306.9
    },
    {
        "text": " ...en cada posición de la matriz...",
        "start": 2306.9,
        "end": 2308.9
    },
    {
        "text": " ...termina viendo...",
        "start": 2308.9,
        "end": 2309.9
    },
    {
        "text": " ...la...",
        "start": 2309.9,
        "end": 2310.9
    },
    {
        "text": " ...el camino más corto de como mucho...",
        "start": 2310.9,
        "end": 2312.9
    },
    {
        "text": " ...y...",
        "start": 2312.9,
        "end": 2314.9
    },
    {
        "text": " ...saltos...",
        "start": 2314.9,
        "end": 2315.9
    },
    {
        "text": " ...desde...",
        "start": 2315.9,
        "end": 2316.9
    },
    {
        "text": " ...el nodo...",
        "start": 2316.9,
        "end": 2318.9
    },
    {
        "text": " ...be.",
        "start": 2318.9,
        "end": 2319.9
    },
    {
        "text": " Que dice...",
        "start": 2319.9,
        "end": 2323.9
    },
    {
        "text": " ...que dice...",
        "start": 2323.9,
        "end": 2324.9
    },
    {
        "text": " ...segundo el mismo...",
        "start": 2324.9,
        "end": 2325.9
    },
    {
        "text": " ...mien, bien, bien.",
        "start": 2325.9,
        "end": 2326.9
    },
    {
        "text": " Y si va a mar...",
        "start": 2326.9,
        "end": 2328.9
    },
    {
        "text": " ...es el segundo mínimo donde buscas...",
        "start": 2328.9,
        "end": 2330.9
    },
    {
        "text": " ...ahí tenés que recordarlos...",
        "start": 2330.9,
        "end": 2332.9
    },
    {
        "text": " ...en el posible de la derecha...",
        "start": 2332.9,
        "end": 2334.9
    },
    {
        "text": " ...contra el mínimo, sí.",
        "start": 2334.9,
        "end": 2336.9
    },
    {
        "text": " Y eso afecta...",
        "start": 2338.9,
        "end": 2339.9
    },
    {
        "text": " ...el orden de ejecución...",
        "start": 2339.9,
        "end": 2341.9
    },
    {
        "text": " ...de este...",
        "start": 2341.9,
        "end": 2343.9
    },
    {
        "text": " ...recuerden que ahora...",
        "start": 2343.9,
        "end": 2346.9
    },
    {
        "text": " ...si quisieramos encontrar...",
        "start": 2346.9,
        "end": 2348.9
    },
    {
        "text": " ...el camino más corto, no solo...",
        "start": 2348.9,
        "end": 2350.9
    },
    {
        "text": " ...el costo del camino más corto...",
        "start": 2350.9,
        "end": 2352.9
    },
    {
        "text": " ...si no el camino más corto...",
        "start": 2352.9,
        "end": 2354.9
    },
    {
        "text": " ...proficialmente he dicho...",
        "start": 2354.9,
        "end": 2356.9
    },
    {
        "text": " ...que es lo que venimos...",
        "start": 2356.9,
        "end": 2357.9
    },
    {
        "text": " ...hacemos ahora, ¿no?",
        "start": 2357.9,
        "end": 2358.9
    },
    {
        "text": " Recuilamos...",
        "start": 2358.9,
        "end": 2359.9
    },
    {
        "text": " ...en el óptimo de esta función...",
        "start": 2359.9,
        "end": 2362.9
    },
    {
        "text": " ...y después calculamos...",
        "start": 2362.9,
        "end": 2364.9
    },
    {
        "text": " ...el conjunto de elementos que...",
        "start": 2364.9,
        "end": 2367.9
    },
    {
        "text": " ...genera...",
        "start": 2367.9,
        "end": 2368.9
    },
    {
        "text": " ...y se ve...",
        "start": 2368.9,
        "end": 2369.9
    },
    {
        "text": " ...bueno, si quisieramos...",
        "start": 2369.9,
        "end": 2371.9
    },
    {
        "text": " ...calcular...",
        "start": 2371.9,
        "end": 2373.9
    },
    {
        "text": " ...es lo que haristas...",
        "start": 2373.9,
        "end": 2375.9
    },
    {
        "text": " ...forman ese camino más...",
        "start": 2375.9,
        "end": 2376.9
    },
    {
        "text": " ...es ese camino óptimo...",
        "start": 2376.9,
        "end": 2377.9
    },
    {
        "text": " ...lo que tenemos que hacer es...",
        "start": 2377.9,
        "end": 2378.9
    },
    {
        "text": " ...y el boguero para atrás en la matriz...",
        "start": 2378.9,
        "end": 2380.9
    },
    {
        "text": " ...y comparando...",
        "start": 2380.9,
        "end": 2381.9
    },
    {
        "text": " ...pues es el mínimo de la palver...",
        "start": 2381.9,
        "end": 2383.9
    },
    {
        "text": " ...que vamos encontrando ahí.",
        "start": 2383.9,
        "end": 2385.9
    },
    {
        "text": " Entonces, bueno, la correctitud de esto...",
        "start": 2387.9,
        "end": 2391.9
    },
    {
        "text": " ...como siempre se deduce...",
        "start": 2391.9,
        "end": 2393.9
    },
    {
        "text": " ...direcamente la preinducción de la recorción...",
        "start": 2393.9,
        "end": 2397.9
    },
    {
        "text": " ...es académica...",
        "start": 2397.9,
        "end": 2398.9
    },
    {
        "text": " ...y es la complejidad de...",
        "start": 2398.9,
        "end": 2401.9
    },
    {
        "text": " ...en tiempo de esta...",
        "start": 2401.9,
        "end": 2403.9
    },
    {
        "text": " ...un de...",
        "start": 2403.9,
        "end": 2404.9
    },
    {
        "text": " ...aguardismo...",
        "start": 2404.9,
        "end": 2406.9
    },
    {
        "text": " ...estado por esta maño de la matriz...",
        "start": 2406.9,
        "end": 2408.9
    },
    {
        "text": " ...y por...",
        "start": 2408.9,
        "end": 2410.9
    },
    {
        "text": " ...eh...",
        "start": 2410.9,
        "end": 2412.9
    },
    {
        "text": " ...por el...",
        "start": 2412.9,
        "end": 2415.9
    },
    {
        "text": " ...eso que acaba de decir...",
        "start": 2416.9,
        "end": 2418.9
    },
    {
        "text": " ...como...",
        "start": 2418.9,
        "end": 2419.9
    },
    {
        "text": " ...el tamaño de la matriz...",
        "start": 2419.9,
        "end": 2421.9
    },
    {
        "text": " ...pienes...",
        "start": 2421.9,
        "end": 2422.9
    },
    {
        "text": " ...en el por e y medio...",
        "start": 2422.9,
        "end": 2425.9
    },
    {
        "text": " ...en igual...",
        "start": 2425.9,
        "end": 2426.9
    },
    {
        "text": " ...en igual lado...",
        "start": 2426.9,
        "end": 2428.9
    },
    {
        "text": " ...este...",
        "start": 2428.9,
        "end": 2430.9
    },
    {
        "text": " ...pienes por e y medio...",
        "start": 2430.9,
        "end": 2433.9
    },
    {
        "text": " ...pienes...",
        "start": 2433.9,
        "end": 2435.9
    },
    {
        "text": " ...ordenen...",
        "start": 2435.9,
        "end": 2436.9
    },
    {
        "text": " ...cuadrado...",
        "start": 2436.9,
        "end": 2437.9
    },
    {
        "text": " ...porque tengo acá...",
        "start": 2437.9,
        "end": 2438.9
    },
    {
        "text": " ...y es como mucha n-1...",
        "start": 2438.9,
        "end": 2439.9
    },
    {
        "text": " ...y b...",
        "start": 2439.9,
        "end": 2440.9
    },
    {
        "text": " ...es n...",
        "start": 2440.9,
        "end": 2441.9
    },
    {
        "text": " ...en esta maño de b...",
        "start": 2441.9,
        "end": 2443.9
    },
    {
        "text": " ...entonces...",
        "start": 2443.9,
        "end": 2444.9
    },
    {
        "text": " ...por acá paso...",
        "start": 2444.9,
        "end": 2446.9
    },
    {
        "text": " ...y ni cuadrado veces...",
        "start": 2446.9,
        "end": 2448.9
    },
    {
        "text": " ...como mucho...",
        "start": 2448.9,
        "end": 2449.9
    },
    {
        "text": " ...y después...",
        "start": 2449.9,
        "end": 2450.9
    },
    {
        "text": " ...en cada uno de estos ciclos...",
        "start": 2450.9,
        "end": 2451.9
    },
    {
        "text": " ...tengo que calcular este mínimo de taca...",
        "start": 2451.9,
        "end": 2453.9
    },
    {
        "text": " ...que...",
        "start": 2453.9,
        "end": 2454.9
    },
    {
        "text": " ...como decía Omar...",
        "start": 2454.9,
        "end": 2456.9
    },
    {
        "text": " ...es recorrar los n posibles doblebes...",
        "start": 2456.9,
        "end": 2458.9
    },
    {
        "text": " ...así que acá...",
        "start": 2458.9,
        "end": 2459.9
    },
    {
        "text": " ...para cada...",
        "start": 2459.9,
        "end": 2460.9
    },
    {
        "text": " ...para cada...",
        "start": 2460.9,
        "end": 2462.9
    },
    {
        "text": " ...guelta de estos...",
        "start": 2462.9,
        "end": 2464.9
    },
    {
        "text": " ...que bucle...",
        "start": 2464.9,
        "end": 2465.9
    },
    {
        "text": " ...me meto en...",
        "start": 2465.9,
        "end": 2466.9
    },
    {
        "text": " ...en...",
        "start": 2466.9,
        "end": 2467.9
    },
    {
        "text": " ...en...",
        "start": 2467.9,
        "end": 2468.9
    },
    {
        "text": " ...en...",
        "start": 2468.9,
        "end": 2469.9
    },
    {
        "text": " ...paso de nuevo...",
        "start": 2469.9,
        "end": 2470.9
    },
    {
        "text": " ...así que termino...",
        "start": 2470.9,
        "end": 2471.9
    },
    {
        "text": " ...correndo esto en...",
        "start": 2471.9,
        "end": 2472.9
    },
    {
        "text": " ...en y cubo...",
        "start": 2472.9,
        "end": 2473.9
    },
    {
        "text": " ...ahí se entiende?",
        "start": 2476.9,
        "end": 2477.9
    },
    {
        "text": " ...bás, como que si...",
        "start": 2495.9,
        "end": 2496.9
    },
    {
        "text": " ...la...",
        "start": 2496.9,
        "end": 2497.9
    },
    {
        "text": " ...si se entendió bien el agorimo entonces...",
        "start": 2497.9,
        "end": 2500.9
    },
    {
        "text": " ...eh...",
        "start": 2500.9,
        "end": 2501.9
    },
    {
        "text": " ...capás que lo que...",
        "start": 2501.9,
        "end": 2502.9
    },
    {
        "text": " ...eh...",
        "start": 2502.9,
        "end": 2503.9
    },
    {
        "text": " ...eh...",
        "start": 2503.9,
        "end": 2504.9
    },
    {
        "text": " ...jamos para...",
        "start": 2504.9,
        "end": 2505.9
    },
    {
        "text": " ...para...",
        "start": 2505.9,
        "end": 2506.9
    },
    {
        "text": " ...per ustedes mismos...",
        "start": 2506.9,
        "end": 2507.9
    },
    {
        "text": " ...es...",
        "start": 2507.9,
        "end": 2508.9
    },
    {
        "text": " ...un ejecución del agorimo...",
        "start": 2508.9,
        "end": 2509.9
    },
    {
        "text": " ...que es media larga...",
        "start": 2509.9,
        "end": 2511.9
    },
    {
        "text": " ...que se nos va...",
        "start": 2511.9,
        "end": 2513.9
    },
    {
        "text": " ...en el tiempo...",
        "start": 2513.9,
        "end": 2515.9
    },
    {
        "text": " ...que esta pueden ver...",
        "start": 2515.9,
        "end": 2518.9
    },
    {
        "text": " ...en el...",
        "start": 2518.9,
        "end": 2519.9
    },
    {
        "text": " ...en la página...",
        "start": 2519.9,
        "end": 2521.9
    },
    {
        "text": " ...300...",
        "start": 2521.9,
        "end": 2522.9
    },
    {
        "text": " ...20...",
        "start": 2522.9,
        "end": 2523.9
    },
    {
        "text": " ...20...",
        "start": 2523.9,
        "end": 2524.9
    },
    {
        "text": " ...20...",
        "start": 2524.9,
        "end": 2525.9
    },
    {
        "text": " ...no se que va a dar...",
        "start": 2531.9,
        "end": 2533.9
    },
    {
        "text": " ...y onda...",
        "start": 2536.9,
        "end": 2537.9
    },
    {
        "text": " ...no se está ganando por la base.",
        "start": 2554.9,
        "end": 2556.9
    },
    {
        "text": " No está ganando por la base.",
        "start": 2562.9,
        "end": 2564.9
    },
    {
        "text": "uto...",
        "start": 2570.9,
        "end": 2571.9
    },
    {
        "text": " ...t Asahair,",
        "start": 2578.9,
        "end": 2579.64
    },
    {
        "text": " El Ministerio de la Clipura.",
        "start": 2583.9,
        "end": 2592.9
    },
    {
        "text": " Es el ejemplo que es de ejecución que hay en el libro.",
        "start": 2592.9,
        "end": 2600.9
    },
    {
        "text": " No lo hacemos ahora porque es un poco tedioso, pero es ir ajustando este,",
        "start": 2600.9,
        "end": 2607.9
    },
    {
        "text": " a ver como verán, están las inicializaciones acá, las que decíamos,",
        "start": 2607.9,
        "end": 2616.9
    },
    {
        "text": " llegar a T en como muchos 0 pasos, como muchos 1, 2, 3, 4, 5 pasos,",
        "start": 2616.9,
        "end": 2623.9
    },
    {
        "text": " este grafo tiene 6 nodos, como muchos 5 pasos, todos estos vanisionizados en 0,",
        "start": 2623.9,
        "end": 2632.9
    },
    {
        "text": " todos los lugares de la matriz que tica llegar a T desde cualquier otro nodo",
        "start": 2633.9,
        "end": 2642.9
    },
    {
        "text": " que no se ate en 0 pasos, es infinito.",
        "start": 2642.9,
        "end": 2645.9
    },
    {
        "text": " Y a partir de eso se va construyendo la matriz siguiendo esta...",
        "start": 2645.9,
        "end": 2652.9
    },
    {
        "text": " Esta gorimo, esto que acabamos de ver es un arrolimo muy utilizado",
        "start": 2652.9,
        "end": 2664.9
    },
    {
        "text": " en los sistemas de redes computadora para circular caminas más copas,",
        "start": 2664.9,
        "end": 2669.9
    },
    {
        "text": " porque además tiene una versión de esta gorimo que se puede computar de forma distribuida",
        "start": 2669.9,
        "end": 2676.9
    },
    {
        "text": " entre distintos aparatos que están conectados en Internet",
        "start": 2676.9,
        "end": 2680.9
    },
    {
        "text": " y que se van pasando esta matriz que vamos a aculando y van a aculando los huecos",
        "start": 2681.9,
        "end": 2690.9
    },
    {
        "text": " cada uno por su lado cuando que vende la red trasredor de ellos.",
        "start": 2690.9,
        "end": 2695.9
    },
    {
        "text": " Bueno, hasta acá si queda alguna duda se vamos por acá y cerramos hecho con una masión diante.",
        "start": 2702.9,
        "end": 2708.9
    },
    {
        "text": " Bien, ¿hay dos?",
        "start": 2711.9,
        "end": 2716.9
    },
    {
        "text": " Una pregunta, ¿el capítulo 7 va para esta semana? ¿Le jodemos para el clases?",
        "start": 2717.9,
        "end": 2724.9
    },
    {
        "text": " No, vamos a arrancar ahora, si están agurridos...",
        "start": 2724.9,
        "end": 2728.9
    },
    {
        "text": " Nada, vale.",
        "start": 2728.9,
        "end": 2730.9
    },
    {
        "text": " Es que si no arrancamos de ahora en una de los tiempos por eso.",
        "start": 2730.9,
        "end": 2734.9
    },
    {
        "text": " ¿El capítulo 7?",
        "start": 2735.9,
        "end": 2739.9
    },
    {
        "text": " El...",
        "start": 2739.9,
        "end": 2741.9
    },
    {
        "text": " Se llama el network flow en inglés, este...",
        "start": 2741.9,
        "end": 2747.9
    },
    {
        "text": " flujo...",
        "start": 2747.9,
        "end": 2749.9
    },
    {
        "text": " flujo en redes o algo así, se dice que es la producción.",
        "start": 2749.9,
        "end": 2753.9
    },
    {
        "text": " El por mi parte no, este es que no ayuda, supongo.",
        "start": 2753.9,
        "end": 2757.9
    },
    {
        "text": " De Facundo.",
        "start": 2757.9,
        "end": 2759.9
    },
    {
        "text": " Es que no quiere ver la trofa.",
        "start": 2760.9,
        "end": 2764.9
    },
    {
        "text": " El capítulo... cuando se entra en el sistema, en el de la trofa, lo que despista un poco es...",
        "start": 2769.9,
        "end": 2778.9
    },
    {
        "text": " ¿y por qué me contase esto? ¿No? ¿A qué cuento de que me estás viniendo a contar esto?",
        "start": 2778.9,
        "end": 2785.9
    },
    {
        "text": " Si, hasta ahora lo que veníamos viendo eran formas de tomar un problema cualquiera y resolverlo.",
        "start": 2786.9,
        "end": 2796.9
    },
    {
        "text": " Era estrategias de cómo recorrer, bueno, partes de un problema, de cómo dividir el problema, de cómo guardar lo que iba a conocer el problema de que se fue en el fenómeno.",
        "start": 2796.9,
        "end": 2811.9
    },
    {
        "text": " Y que estaba haciendo mejor la mejor strucción, ¿no?",
        "start": 2812.9,
        "end": 2815.9
    },
    {
        "text": " Y, de repente, saltamos a este tema que lo que intenta resolver es el siguiente problema.",
        "start": 2815.9,
        "end": 2823.9
    },
    {
        "text": " Y ustedes me van a decir, ¿por qué me contase esto?",
        "start": 2823.9,
        "end": 2829.9
    },
    {
        "text": " Y ahora les voy a contar por qué les cuento esto.",
        "start": 2831.9,
        "end": 2835.9
    },
    {
        "text": " Las básicas del Android Flow, es que tengo de nuevo un grafo dirigido.",
        "start": 2836.9,
        "end": 2844.9
    },
    {
        "text": " No, no estáis de... tenemos algo de ejemplo.",
        "start": 2844.9,
        "end": 2849.9
    },
    {
        "text": " Con un origen y un destino de un supuesto flujo.",
        "start": 2852.9,
        "end": 2859.9
    },
    {
        "text": " Imagínense que ahora estos...",
        "start": 2866.9,
        "end": 2872.9
    },
    {
        "text": " Estas alistas son tubos de flujo que permiten pasar a algunos de los flujos, no, son fluidos, que se cuida por ahí.",
        "start": 2872.9,
        "end": 2885.9
    },
    {
        "text": " Y tienen capacidades, no, va a dar alguna vuelta para ahí y va a ir desde el origen hasta el destino.",
        "start": 2886.9,
        "end": 2895.9
    },
    {
        "text": " Y tienen capacidades que son el grosor de este tubo.",
        "start": 2895.9,
        "end": 2903.9
    },
    {
        "text": " ¿Cuánto agua puede pasar para ahí?",
        "start": 2903.9,
        "end": 2908.9
    },
    {
        "text": " Puede pasar 20 litos por segundo o acá pueden pasar 10 litos por segundo y acá 30, y acá 20, y acá 10.",
        "start": 2909.9,
        "end": 2922.9
    },
    {
        "text": " Pues esto es lo que está un poco raro, ¿por qué estamos hablando delitos por segundo?",
        "start": 2929.9,
        "end": 2933.9
    },
    {
        "text": " Porque es la capacidad, la cantidad de cosas que pueden pasar por ese arista en un determinado momento.",
        "start": 2934.9,
        "end": 2945.9
    },
    {
        "text": " Entonces, yo tengo que pensar en términos de RAID, de cadencia en las que puede pasar cosas.",
        "start": 2945.9,
        "end": 2954.9
    },
    {
        "text": " Pero puede ser agua, puede ser camiones en una carretera, o pueden ser paquetes IPNR, o puede ser tareas que puede pensarse entre un lugar ni otro.",
        "start": 2954.9,
        "end": 2969.9
    },
    {
        "text": " Pero imagínense que es un tubo por el cual pasa agua y que le pueden pasar a este tubo de acá 20 litos de agua por segundo.",
        "start": 2969.9,
        "end": 2981.9
    },
    {
        "text": " Si nosotros quisíamos encontrar cuál es la máxima cantidad de agua que puede mandar a partir de ese ASEAT, ¿qué empezamos a ver?",
        "start": 2982.9,
        "end": 2997.9
    },
    {
        "text": " Imagínense que yo empiezo a mirar, bueno, me quedo una especie de cosa a grí, bueno, por este acá puedo mandar 20 litos de agua por segundo, así que ya arranco por ahí.",
        "start": 2998.9,
        "end": 3015.9
    },
    {
        "text": " Y si después estoy aparado en un, por donde cuáles tengo 20 litos de agua que me están llegando a un, por donde los puedo mandar.",
        "start": 3016.9,
        "end": 3031.9
    },
    {
        "text": " Por acá puedo mandar 10 y por acá 30, tengo 20, bueno, los mando por acá, por donde pueden ir 30 litos de agua por segundo.",
        "start": 3031.9,
        "end": 3042.9
    },
    {
        "text": " Y una vez que estoy en vez, no me están llegando 20, acá, van 20, van 20.",
        "start": 3042.9,
        "end": 3049.9
    },
    {
        "text": " Me están llegando 20 y bueno, pasan los 20 por este tubo y llego a el destino con esos 20 litos de agua.",
        "start": 3050.9,
        "end": 3062.9
    },
    {
        "text": " Bueno, pero tengo tubos vacíos por ahí, entonces arranco de nuevo en ESE y digo mando otros 10 litros de agua por acá, que yo que entra en ese tubo.",
        "start": 3063.9,
        "end": 3080.9
    },
    {
        "text": " Cuando llego a ver, cuando estoy acá recuerden que estas, ahí estas son dirigidas, esos tubos son un poco raro porque el sol es dejan pasar agua en la dirección.",
        "start": 3081.9,
        "end": 3092.9
    },
    {
        "text": " Cuando llego acá, qué hago con esos 10 litros de agua? No puedo mandarlos, acá hay tubo este destasino, pero ven que hay algo que no está bien acá.",
        "start": 3095.9,
        "end": 3105.9
    },
    {
        "text": " Esa actitud grí que tomamos, capaz que no es la correcta.",
        "start": 3106.9,
        "end": 3111.9
    },
    {
        "text": " El cómo resolver este problema es cómo decir, bueno, mira nosotros que estamos viendo lo que hagas todo el grazo,",
        "start": 3113.9,
        "end": 3122.9
    },
    {
        "text": " ya sabemos que si por acá a veces mandar 20 litros, cuieramos mandados, solo 10 y los otros 10 que subiramos mandados por acá, acá ahora estaremos ocupando solo 10.",
        "start": 3122.9,
        "end": 3140.9
    },
    {
        "text": " Así que podría reenviar estos 10 por acá y ocupar completamente este tubo, ocupar completamente este tubo, y acá parcialmente.",
        "start": 3141.9,
        "end": 3157.9
    },
    {
        "text": " Entonces, nos estarían llegando de ESE no 20 litros de agua, sino 10 litros de agua por segundo.",
        "start": 3158.9,
        "end": 3165.9
    },
    {
        "text": " Y podría mandar más, bueno así, intuitivamente ya nos empieza a parecer que no, por qué no puedo mandar más.",
        "start": 3166.9,
        "end": 3176.9
    },
    {
        "text": " Juega tiempo este end año, en este, en el problema como lo tenemos ahora es instantáneo, no hay picos de flujo, no es todo estable como le llamamos el problema en régimen.",
        "start": 3177.9,
        "end": 3195.9
    },
    {
        "text": " Pasan 20 litros de agua, no empieza a pasar una cantidad de agua y suba este 20, no pasa un 20.",
        "start": 3196.9,
        "end": 3202.9
    },
    {
        "text": " Es una buena pregunta.",
        "start": 3202.9,
        "end": 3205.9
    },
    {
        "text": " Omar responde, por qué no podemos mandar más de 30?",
        "start": 3208.9,
        "end": 3213.9
    },
    {
        "text": " Y bueno, porque acá a la salida de ESE, pueden mandar como mucho 30.",
        "start": 3214.9,
        "end": 3225.9
    },
    {
        "text": " Así que capaz que por ahí en otro lado, puedo mandar menos, pero acá ya sé que no puedo mandar más de 30.",
        "start": 3225.9,
        "end": 3232.9
    },
    {
        "text": " Así que está bien, es un buen íntem, me pasa el mismo si corto acá.",
        "start": 3232.9,
        "end": 3237.9
    },
    {
        "text": " Y acá nos vamos metiendo en otro tema, que es el corte mínimo, que no lo vamos a ver hoy, me parece, vamos a llegar.",
        "start": 3238.9,
        "end": 3245.9
    },
    {
        "text": " Pero es que yo puedo cortar este grazo de muchas maneras, puedo en conjuntos, por ejemplo acá, de que el origen de un lado y todos los nuevos del otro, me fijé y en ese corte sólo pueden pasar 30 litros de agua, si su moto del 30.",
        "start": 3245.9,
        "end": 3263.9
    },
    {
        "text": " Y si sólo corto así, vamos a borrar un poco para ver no ser tan dorvido.",
        "start": 3264.9,
        "end": 3272.9
    },
    {
        "text": " Si sólo corto así, cuáles son las alitas que atraviesan ese corte entre, de se dan cuenta que el corte siempre me queda el origen de un lado y el estino del otro, aunque hace conjunto distintos nuevos, me queda el origen de un lado y el estino del otro.",
        "start": 3274.9,
        "end": 3290.9
    },
    {
        "text": " A través de ese corte pueden pasar, bueno, 10, más 30, más 10, 50 litros de agua por el mismo.",
        "start": 3291.9,
        "end": 3299.9
    },
    {
        "text": " Entonces, hay algunos cortes a través de los cuales pueden pasar más lluvidos que por otros.",
        "start": 3299.9,
        "end": 3309.9
    },
    {
        "text": " A través de, si yo corto, son cortes en los que siempre tienen que estar en el origen de un lado, de eso es importante.",
        "start": 3309.9,
        "end": 3317.9
    },
    {
        "text": " Y el destino del otro.",
        "start": 3317.9,
        "end": 3319.9
    },
    {
        "text": " Si yo corto acá, me queda algo parecido a los de hoy, nos trainte a letras que pueden hacer.",
        "start": 3320.9,
        "end": 3327.9
    },
    {
        "text": " Y entonces empieza a aparecer la intuición de todos los cortes que tengo, hay uno que, bueno, uno o más, que son mínimos, que es de todas las capacidades de esos cortes, hay uno que es la mínima capacidad de un corte.",
        "start": 3328.9,
        "end": 3344.9
    },
    {
        "text": " Más o menos intuitivamente podemos ver que la mínima capacidad de un corte va a ser la máxima cantidad de líquido o de su hilo que puedo hacer pasar entre el origen de este.",
        "start": 3345.9,
        "end": 3356.9
    },
    {
        "text": " Tienes que suponer que no hay ciclos para el modelo.",
        "start": 3357.9,
        "end": 3362.9
    },
    {
        "text": " Ciclos.",
        "start": 3363.9,
        "end": 3365.9
    },
    {
        "text": " Y que lo puede ver.",
        "start": 3369.9,
        "end": 3370.9
    },
    {
        "text": " Lo que es, es lo que no tenemos acá son capacidades negativas, son siempre positivas.",
        "start": 3372.9,
        "end": 3381.9
    },
    {
        "text": " Acabéis de más corte, bueno, por ahora, después vamos a definir bien, pero por ahora introduje el concepto un poco intuitivamente.",
        "start": 3382.9,
        "end": 3393.9
    },
    {
        "text": " Me refiero a corto el conjunto de vértices en dos, en dos partes, una que tiene al origen y otra que tiene al destino.",
        "start": 3393.9,
        "end": 3404.9
    },
    {
        "text": " Y me refiero a la cantidad de ruido que pasa por el corte, es la cantidad de su hilo que pasa por las aristas que atraviesan el corte.",
        "start": 3405.9,
        "end": 3419.9
    },
    {
        "text": " Es un gozo con esto, ¿no?",
        "start": 3424.9,
        "end": 3426.9
    },
    {
        "text": " No depende el dibujo, ¿qué crees? ¿Qué lo que depende el dibujo?",
        "start": 3427.9,
        "end": 3436.9
    },
    {
        "text": " Claro que un grafo lo puede dibujar de muchas formas y de tener como lo dibujes.",
        "start": 3438.9,
        "end": 3443.9
    },
    {
        "text": " Ah, bueno, pero no, si yo, si yo he dividido con un conjunto de vértices en dos, no importa si yo dibujo esta lista, una vuelta rara por acá.",
        "start": 3443.9,
        "end": 3455.9
    },
    {
        "text": " En algún momento, estoy diciendo, es una lista que salta de un vértice que está en una de las mitad a un parte de otra mitad de su ocorrido.",
        "start": 3457.9,
        "end": 3470.9
    },
    {
        "text": " Y eso no me va a depender de cómo lo dibujen, es siempre así, si hay una lista, hay aristas que son interiores a veces su conjunto y otras alitras que atraviesan de un su conjunto.",
        "start": 3472.9,
        "end": 3485.9
    },
    {
        "text": " Hay algo.",
        "start": 3487.9,
        "end": 3489.9
    },
    {
        "text": " No.",
        "start": 3490.9,
        "end": 3492.9
    },
    {
        "text": " Pero bueno, ahora después no vamos a meter eso y entonces empiezan a ver por qué es que yo le digo, bueno, esto.",
        "start": 3504.9,
        "end": 3513.9
    },
    {
        "text": " Acuento de qué.",
        "start": 3514.9,
        "end": 3516.9
    },
    {
        "text": " Bueno, la primera aplicación de esto, de yo decir, encontrar cuál es el flujo máximo que hay entre un origen de un destino, un tiempo de empezar.",
        "start": 3517.9,
        "end": 3530.9
    },
    {
        "text": " Bueno, cuánto camiones puedo mandar por estas rutas, cuánto es la máxima cantidad de carga que puede mandar por esta casa.",
        "start": 3530.9,
        "end": 3537.9
    },
    {
        "text": " Eso es bastante derecho y eso podría usar.",
        "start": 3537.9,
        "end": 3540.9
    },
    {
        "text": " Pero se puede usar para una cosa que no está en inscritividad, que es.",
        "start": 3541.9,
        "end": 3546.9
    },
    {
        "text": " Hay un problema que aparece todo el tiempo.",
        "start": 3546.9,
        "end": 3549.9
    },
    {
        "text": " En la solución de problemas computacionales, que es el de la, el del.",
        "start": 3554.9,
        "end": 3560.9
    },
    {
        "text": " La asignación en grafo mi partito, es decir, tengo cosas.",
        "start": 3561.9,
        "end": 3566.9
    },
    {
        "text": " Que puedo poner en lugares.",
        "start": 3567.9,
        "end": 3571.9
    },
    {
        "text": " Y la puedo poner en algunos lugares que te la puedo poner acá, acá, acá.",
        "start": 3578.9,
        "end": 3583.9
    },
    {
        "text": " Y esta la puedo poner acá, está acá.",
        "start": 3583.9,
        "end": 3588.9
    },
    {
        "text": " Y esta depende de lo que puedo poner acá.",
        "start": 3589.9,
        "end": 3592.9
    },
    {
        "text": " Pero estos lugares tienen las determinadas.",
        "start": 3592.9,
        "end": 3594.9
    },
    {
        "text": " Son, imagínense que son almacenes y estas cosas son cosas que quiero borrar en almacenes.",
        "start": 3594.9,
        "end": 3599.9
    },
    {
        "text": " Entonces tengo la terminada capacidad de los lugares para poner cosas adentro.",
        "start": 3599.9,
        "end": 3606.9
    },
    {
        "text": " Ese es un problema que aparece por todos lados, es decir, de la asignación de recursos.",
        "start": 3606.9,
        "end": 3611.9
    },
    {
        "text": " Quiero poner, distribuir tareas en servidores, quiero me guardar alimentos en almacenes, quiero poner gente en vuelos, quiero.",
        "start": 3612.9,
        "end": 3628.9
    },
    {
        "text": " cualquier problema de asignación de recursos a una terminada de mandat, también haciendo algo para decir a esto.",
        "start": 3628.9,
        "end": 3637.9
    },
    {
        "text": " Y si yo imagino que.",
        "start": 3638.9,
        "end": 3643.9
    },
    {
        "text": " Ahora imagínense que yo imagino que este lugar que tiene una determinada capacidad.",
        "start": 3648.9,
        "end": 3656.9
    },
    {
        "text": " Lo que es es una capacidad de flujo como una extravada.",
        "start": 3656.9,
        "end": 3663.9
    },
    {
        "text": " Y entonces lo que digo es, a este lugar le pueden entrar una determinada cantidad de flujo.",
        "start": 3664.9,
        "end": 3675.9
    },
    {
        "text": " Y le pongo una capacidad, no sé, le pueden entrar 30 objetos.",
        "start": 3675.9,
        "end": 3686.9
    },
    {
        "text": " A este, ya que le pueden entrar 20 objetos.",
        "start": 3686.9,
        "end": 3692.9
    },
    {
        "text": " Y a este, 10, y a este, no sé, 30.",
        "start": 3692.9,
        "end": 3698.9
    },
    {
        "text": " Y estos objetos ocupan un determinado espacio.",
        "start": 3698.9,
        "end": 3706.9
    },
    {
        "text": " Que es, ocupan el espacio, no sé, 10.",
        "start": 3707.9,
        "end": 3711.9
    },
    {
        "text": " Y este, entonces lo ocupan siempre 10 acá.",
        "start": 3711.9,
        "end": 3716.9
    },
    {
        "text": " Pero este acá, un pas 5, y acá, este 5.",
        "start": 3716.9,
        "end": 3724.9
    },
    {
        "text": " Y qué pasa si yo imagino que todo esto es realidad, es un flujo que quiero mandar de acá, acá.",
        "start": 3724.9,
        "end": 3735.9
    },
    {
        "text": " Y en definitiva lo que quiero es acomodar la mayor cantidad de estos objetos en estos lugares.",
        "start": 3736.9,
        "end": 3743.9
    },
    {
        "text": " Y eso es equivalente a mandar la mayor cantidad de flujo de acá para acá.",
        "start": 3743.9,
        "end": 3756.9
    },
    {
        "text": " Porque si yo digo, bueno, el flujo va a pasar por acá, es que voy a ubicar este objeto acá.",
        "start": 3757.9,
        "end": 3770.9
    },
    {
        "text": " Y si acá pasar a flujo así, y por acá así, es que voy a ubicar este objeto y este objeto acá.",
        "start": 3770.9,
        "end": 3783.9
    },
    {
        "text": " Cuando digo objeto, y cualquier cosa, una tarea en un sabido.",
        "start": 3784.9,
        "end": 3789.9
    },
    {
        "text": " O, todas esas cosas teníamos diciendo.",
        "start": 3789.9,
        "end": 3793.9
    },
    {
        "text": " ¿Centiendo eso?",
        "start": 3793.9,
        "end": 3795.9
    },
    {
        "text": " Esta no es la única aplicación de la flujo, pero es como la más clásica.",
        "start": 3801.9,
        "end": 3810.9
    },
    {
        "text": " Y es la que, por eso a que a principios de speed tampoco, por aquí me estás hablando de la flujo ahora, que es como algo muy específico.",
        "start": 3810.9,
        "end": 3821.9
    },
    {
        "text": " Y no es una forma de resolver problemas.",
        "start": 3821.9,
        "end": 3824.9
    },
    {
        "text": " Bueno, es que en realidad es una forma de resolver problemas.",
        "start": 3824.9,
        "end": 3829.9
    },
    {
        "text": " ¿Qué sería en las salistas?",
        "start": 3829.9,
        "end": 3831.9
    },
    {
        "text": " Pregunta Rafael, ¿qué sería en las salitas de la flujo de imparto?",
        "start": 3831.9,
        "end": 3834.9
    },
    {
        "text": " El peso de las salistas es la capacidad de esas salistas.",
        "start": 3834.9,
        "end": 3838.9
    },
    {
        "text": " Es, en este caso, representa hasta cuántos objetos de este tipo.",
        "start": 3838.9,
        "end": 3849.9
    },
    {
        "text": " O sea, cuánto flujo tengo que utilizar para poner este objeto en este lugar.",
        "start": 3849.9,
        "end": 3860.9
    },
    {
        "text": " Si se fijan, ahora vamos a formalizar, pero una de las reglas del Benbrochlo, es que todo lo que entra a un nodo tiene que salir.",
        "start": 3860.9,
        "end": 3874.9
    },
    {
        "text": " Todo el flujo que entra, eso es como medio natural, si tengo, imagínense estuvo, todo el flujo que entra a un lugar donde se juntan esos tubos,",
        "start": 3874.9,
        "end": 3883.9
    },
    {
        "text": " tiene que salir por el lado. Y si no sale, no pueden entrar.",
        "start": 3883.9,
        "end": 3889.9
    },
    {
        "text": " Entonces, en esta representación que estoy haciendo del problema de poner cosas en lugares,",
        "start": 3889.9,
        "end": 3900.9
    },
    {
        "text": " esta capacidad atrás de los lugares significa modelo o representa la capacidad de ese lugar.",
        "start": 3900.9,
        "end": 3911.9
    },
    {
        "text": " Y esta capacidad en ellace que junta acá entre este y este es cuánto utiliza este objeto cuando lo pongo en este lugar.",
        "start": 3912.9,
        "end": 3927.9
    },
    {
        "text": " Si se fijan, esta capacidad la podría poner acá también.",
        "start": 3927.9,
        "end": 3931.9
    },
    {
        "text": " Y no me cambia nada.",
        "start": 3931.9,
        "end": 3934.9
    },
    {
        "text": " Porque lo que entra acá sale acá.",
        "start": 3935.9,
        "end": 3939.9
    },
    {
        "text": " He hecho la tengo que poner esto.",
        "start": 3942.9,
        "end": 3945.9
    },
    {
        "text": " Pues acá voy a poner...",
        "start": 3948.9,
        "end": 3951.9
    },
    {
        "text": " ...y cuánto ocupa, cuánto el espacio ocupa este objeto.",
        "start": 3952.9,
        "end": 3959.9
    },
    {
        "text": " ¿Por qué? Porque así limito el lujo, como eso va a un cuenta, que el flujo máximo, lo que pueda tener es lo que sale de ese.",
        "start": 3960.9,
        "end": 3969.9
    },
    {
        "text": " Entonces, al poner capacidades que representan cuanto volúmenos, ocupa este objeto, al ponerla acá entre ese y el objeto, estoy diciendo bueno.",
        "start": 3969.9,
        "end": 3981.9
    },
    {
        "text": " Para este objeto va a ocupar 10 sumidades de lo que hicimos.",
        "start": 3982.9,
        "end": 3988.9
    },
    {
        "text": " Entonces, esto se vuelve, nada más, se vuelve no un problema el que vimos sino una forma de resolver problemas.",
        "start": 3990.9,
        "end": 3999.9
    },
    {
        "text": " ¿Se entendió eso?",
        "start": 4003.9,
        "end": 4005.9
    },
    {
        "text": " Después vamos a volver acá, nos preocupen y vamos a empezar directamente como se modela a un problema así.",
        "start": 4006.9,
        "end": 4017.9
    },
    {
        "text": " Pero lo que me parece importante es que tenga una oición un poquito más lejos del parque está moviendo esto, porque sino como...",
        "start": 4018.9,
        "end": 4026.9
    },
    {
        "text": " ...y ahora me contás, me ducho pero...",
        "start": 4026.9,
        "end": 4030.9
    },
    {
        "text": " Entonces, vamos a formalizar un poco la cosa.",
        "start": 4037.9,
        "end": 4044.9
    },
    {
        "text": " Tenemos un grafo, vamos a ver ahora, al nuestros flujos en el mismo tiempo.",
        "start": 4048.9,
        "end": 4063.9
    },
    {
        "text": " M green file, un grafo de hi продamuoso y la récona de combatラ1, y la prevena de ir.",
        "start": 4063.9,
        "end": 4071.9
    },
    {
        "text": " Y un flujo,",
        "start": 4087.9,
        "end": 4091.9
    },
    {
        "text": " En G, cumple la siguiente propiedad.",
        "start": 4093.9,
        "end": 4117.9
    },
    {
        "text": " Esta, tiene una capacidad, cd,",
        "start": 4117.9,
        "end": 4140.9
    },
    {
        "text": " un barrio, un barrio, un barrio, un barrio, un barrio, un barrio, un barrio, un barrio, un barrio, un barrio, un barrio, un barrio, un barrio, un barrio, un barrio, un barrio, un barrio, un barrio, un barrio, un barrio, un barrio, un barrio, un barrio, un barrio, un barrio, un barrio, un barrio, un barrio, un barrio, un barrio, un barrio, un barrio, un barrio, un barrio, un barrio, un barrio, un barrio, un barrio, un barrio, un barrio, un barrio, un barrio, un barrio, un barrio, un barrio, un barrio, un barrio, un barrio, un barrio, un barrio, un barrio, un barrio, un barrio, un barrio, un barrio, un barrio",
        "start": 4170.9,
        "end": 4200.9
    },
    {
        "text": " desacto eländico meולado donde estaba estuvo el besore, donde estaba el besore y Prepero que",
        "start": 4200.9,
        "end": 4204.879999999999
    },
    {
        "text": " el backed de mi hemos nieu",
        "start": 4204.879999999999,
        "end": 4220.679999999999
    },
    {
        "text": " empezó, he submitado al gistuche y todos en tu gigación",
        "start": 4220.679999999999,
        "end": 4225.36
    },
    {
        "text": " internos de la idea de flujo y y son son los especiales porque porque a ese no entra nada",
        "start": 4225.36,
        "end": 4244.88
    },
    {
        "text": " entra en una lista y de T no sale ninguna rica",
        "start": 4244.88,
        "end": 4260.88
    },
    {
        "text": " otra cosa es bueno eso es para bastante ilumitivo a mi origen no le llega nada y de mi destino no sale nada",
        "start": 4274.88,
        "end": 4283.88
    },
    {
        "text": " lo otro que que vamos a asumir es que todas las capacidades de su vez son enteros",
        "start": 4284.88,
        "end": 4300.88
    },
    {
        "text": " de nuevo hay soluciones para esto no entero pero vamos a trabajar con valesenteros",
        "start": 4301.88,
        "end": 4309.88
    },
    {
        "text": " porque porque esta es una herramienta poderosa para resolver problemas combinatorios donde lo que estamos tratando de ubicar son cosas en lugares",
        "start": 4309.88,
        "end": 4321.88
    },
    {
        "text": " no es problemas discreto sin fenómeno",
        "start": 4321.88,
        "end": 4331.88
    },
    {
        "text": " todos los no los las vertices",
        "start": 4334.88,
        "end": 4340.88
    },
    {
        "text": " los vertices distintos de ese tienen al menos una arista incidente",
        "start": 4352.88,
        "end": 4371.88
    },
    {
        "text": " le llega a una lista",
        "start": 4371.88,
        "end": 4378.88
    },
    {
        "text": " no tengo dos distintos de origen al que no le llegue",
        "start": 4378.88,
        "end": 4387.88
    },
    {
        "text": " y entonces ahora podemos empezar a formalizar un poco lo que decíamos de todo el fútbol",
        "start": 4388.88,
        "end": 4394.88
    },
    {
        "text": " llega a preguntar a fael",
        "start": 4394.88,
        "end": 4399.88
    },
    {
        "text": " a la",
        "start": 4400.88,
        "end": 4402.88
    },
    {
        "text": " dice esta última una condición te asegura que hay un camino entre ese y cualquier",
        "start": 4402.88,
        "end": 4411.88
    },
    {
        "text": " entonces para formalizar lo que veníamos diciendo hoy de",
        "start": 4412.88,
        "end": 4426.88
    },
    {
        "text": " cuando todo el líquido ya no es todo el ruido que llega a una lista",
        "start": 4427.88,
        "end": 4436.88
    },
    {
        "text": " a un vértice tiene que salir de ese vértice y vamos a decir también que todo lo que sale de ese",
        "start": 4436.88,
        "end": 4450.88
    },
    {
        "text": " con octaves y con el",
        "start": 4451.88,
        "end": 4457.88
    },
    {
        "text": " entonces vamos a escribir estas esta condición",
        "start": 4459.88,
        "end": 4464.88
    },
    {
        "text": " definición de",
        "start": 4469.88,
        "end": 4474.88
    },
    {
        "text": " flujo",
        "start": 4474.88,
        "end": 4479.88
    },
    {
        "text": " un flujo",
        "start": 4481.88,
        "end": 4487.88
    },
    {
        "text": " de ciete",
        "start": 4487.88,
        "end": 4494.88
    },
    {
        "text": " es una función f que hace un mapeo es una función de las alitas",
        "start": 4494.88,
        "end": 4502.88
    },
    {
        "text": " en los real",
        "start": 4503.88,
        "end": 4509.88
    },
    {
        "text": " una función f de las aristas",
        "start": 4509.88,
        "end": 4514.88
    },
    {
        "text": " y eso es lo que viene a ser la cantidad de flujo que pasa por uno de esas",
        "start": 4518.88,
        "end": 4525.88
    },
    {
        "text": " aristas",
        "start": 4526.88,
        "end": 4529.88
    },
    {
        "text": " eso es no son las capacidades no crees que la cantidad de flujo que supeja",
        "start": 4529.88,
        "end": 4532.88
    },
    {
        "text": " y",
        "start": 4532.88,
        "end": 4539.88
    },
    {
        "text": " y",
        "start": 4539.88,
        "end": 4542.88
    },
    {
        "text": " ese flujo esta función es que o ese flujo tiene que satisfacer",
        "start": 4542.88,
        "end": 4547.88
    },
    {
        "text": " dos condiciones",
        "start": 4547.88,
        "end": 4550.88
    },
    {
        "text": " una",
        "start": 4550.88,
        "end": 4553.88
    },
    {
        "text": " para cada",
        "start": 4553.88,
        "end": 4558.88
    },
    {
        "text": " para cada lista de",
        "start": 4558.88,
        "end": 4563.88
    },
    {
        "text": " el flujo de c",
        "start": 4565.88,
        "end": 4570.88
    },
    {
        "text": " es",
        "start": 4570.88,
        "end": 4575.88
    },
    {
        "text": " pasa nada o algo por ahí",
        "start": 4575.88,
        "end": 4579.88
    },
    {
        "text": " es",
        "start": 4579.88,
        "end": 4584.88
    },
    {
        "text": " menor igual que la capacidad de la lista",
        "start": 4584.88,
        "end": 4589.88
    },
    {
        "text": " esto ya lo habíamos dicho pero ahora lo estamos formalizando",
        "start": 4589.88,
        "end": 4594.88
    },
    {
        "text": " esto es la condición de capacidad",
        "start": 4594.88,
        "end": 4601.88
    },
    {
        "text": " y la segunda propiedad que tiene que cumplir es son propiedades conservación",
        "start": 4601.88,
        "end": 4608.88
    },
    {
        "text": " aristabe",
        "start": 4609.88,
        "end": 4615.88
    },
    {
        "text": " que no es",
        "start": 4615.88,
        "end": 4618.88
    },
    {
        "text": " también distinto de ese",
        "start": 4618.88,
        "end": 4623.88
    },
    {
        "text": " distinto de este",
        "start": 4623.88,
        "end": 4628.88
    },
    {
        "text": " la cantidad de flujo que entra",
        "start": 4628.88,
        "end": 4633.88
    },
    {
        "text": " la suma de todos los flujos",
        "start": 4634.88,
        "end": 4639.88
    },
    {
        "text": " que entra a",
        "start": 4639.88,
        "end": 4643.88
    },
    {
        "text": " que entra a",
        "start": 4643.88,
        "end": 4646.88
    },
    {
        "text": " la suba motoría esta vez en los que",
        "start": 4646.88,
        "end": 4653.88
    },
    {
        "text": " que llegan",
        "start": 4653.88,
        "end": 4658.88
    },
    {
        "text": " a ver",
        "start": 4664.88,
        "end": 4667.88
    },
    {
        "text": " es igual a",
        "start": 4667.88,
        "end": 4673.88
    },
    {
        "text": " todo lo que sale",
        "start": 4673.88,
        "end": 4678.88
    },
    {
        "text": " a la suma",
        "start": 4681.88,
        "end": 4688.88
    },
    {
        "text": " de todo lo que sale",
        "start": 4688.88,
        "end": 4692.88
    },
    {
        "text": " y",
        "start": 4693.88,
        "end": 4696.88
    },
    {
        "text": " está",
        "start": 4696.88,
        "end": 4699.88
    },
    {
        "text": " entiendo eso",
        "start": 4699.88,
        "end": 4704.88
    },
    {
        "text": " bien",
        "start": 4704.88,
        "end": 4709.88
    },
    {
        "text": " y vamos",
        "start": 4709.88,
        "end": 4712.88
    },
    {
        "text": " a",
        "start": 4712.88,
        "end": 4717.88
    },
    {
        "text": " hay un nuevo especial que todos recuerden que",
        "start": 4717.88,
        "end": 4721.88
    },
    {
        "text": " la suma de",
        "start": 4721.88,
        "end": 4725.88
    },
    {
        "text": " a cada esto no es ni el origen ni el estilo",
        "start": 4725.88,
        "end": 4733.88
    },
    {
        "text": " eso es",
        "start": 4733.88,
        "end": 4736.88
    },
    {
        "text": " la función de fe para cada lista y tiene que cumplir eso",
        "start": 4736.88,
        "end": 4740.88
    },
    {
        "text": " toda la suma de todas las feces de las avistas que llegan a uno",
        "start": 4740.88,
        "end": 4744.88
    },
    {
        "text": " tiene que ser igual a la suma de todas las feces que salen",
        "start": 4744.88,
        "end": 4749.88
    },
    {
        "text": " y es igual a su vida que entra",
        "start": 4749.88,
        "end": 4752.88
    },
    {
        "text": " no reafis de nuevo",
        "start": 4752.88,
        "end": 4753.88
    },
    {
        "text": " tiene que salir",
        "start": 4753.88,
        "end": 4755.88
    },
    {
        "text": " si no es un mirro origen",
        "start": 4755.88,
        "end": 4758.88
    },
    {
        "text": " y ahora",
        "start": 4758.88,
        "end": 4760.88
    },
    {
        "text": " cuál es la cantidad total de flujo que pasa por nuestro rafo",
        "start": 4760.88,
        "end": 4766.88
    },
    {
        "text": " y bueno, esto y la pintidudivamente era no",
        "start": 4766.88,
        "end": 4769.88
    },
    {
        "text": " todo lo que puede salir de ese",
        "start": 4769.88,
        "end": 4772.88
    },
    {
        "text": " entonces",
        "start": 4772.88,
        "end": 4774.88
    },
    {
        "text": " vdf",
        "start": 4775.88,
        "end": 4778.88
    },
    {
        "text": " es el valor del flujo total",
        "start": 4778.88,
        "end": 4782.88
    },
    {
        "text": " es igual a la suma",
        "start": 4782.88,
        "end": 4786.88
    },
    {
        "text": " a la suma",
        "start": 4786.88,
        "end": 4790.88
    },
    {
        "text": " de todos los flujos saliendo",
        "start": 4790.88,
        "end": 4794.88
    },
    {
        "text": " por las avistas e",
        "start": 4794.88,
        "end": 4798.88
    },
    {
        "text": " saliendo",
        "start": 4799.88,
        "end": 4802.88
    },
    {
        "text": " de",
        "start": 4802.88,
        "end": 4804.88
    },
    {
        "text": " el nuevo vdf",
        "start": 4804.88,
        "end": 4806.88
    },
    {
        "text": " todos las y sumamos",
        "start": 4806.88,
        "end": 4808.88
    },
    {
        "text": " todos los flujos que salen de ese",
        "start": 4808.88,
        "end": 4810.88
    },
    {
        "text": " eso es igual a",
        "start": 4810.88,
        "end": 4812.88
    },
    {
        "text": " el flujo total",
        "start": 4812.88,
        "end": 4814.88
    },
    {
        "text": " que está atravesando",
        "start": 4814.88,
        "end": 4817.88
    },
    {
        "text": " mira, frontera",
        "start": 4817.88,
        "end": 4818.88
    },
    {
        "text": " todo lo que sale de ese",
        "start": 4818.88,
        "end": 4820.88
    },
    {
        "text": " llega",
        "start": 4820.88,
        "end": 4822.88
    },
    {
        "text": " a tener",
        "start": 4822.88,
        "end": 4826.88
    },
    {
        "text": " esto lo vamos a",
        "start": 4827.88,
        "end": 4830.88
    },
    {
        "text": " tal",
        "start": 4830.88,
        "end": 4833.88
    },
    {
        "text": " como",
        "start": 4833.88,
        "end": 4835.88
    },
    {
        "text": " f",
        "start": 4835.88,
        "end": 4837.88
    },
    {
        "text": " h",
        "start": 4837.88,
        "end": 4840.88
    },
    {
        "text": " db",
        "start": 4840.88,
        "end": 4842.88
    },
    {
        "text": " es",
        "start": 4842.88,
        "end": 4844.88
    },
    {
        "text": " igual a",
        "start": 4844.88,
        "end": 4846.88
    },
    {
        "text": " la sumatoria",
        "start": 4846.88,
        "end": 4850.88
    },
    {
        "text": " de los flujos",
        "start": 4856.88,
        "end": 4858.88
    },
    {
        "text": " de las avistas e",
        "start": 4858.88,
        "end": 4862.88
    },
    {
        "text": " van viendo de v",
        "start": 4864.88,
        "end": 4866.88
    },
    {
        "text": " y f",
        "start": 4866.88,
        "end": 4868.88
    },
    {
        "text": " n",
        "start": 4868.88,
        "end": 4870.88
    },
    {
        "text": " es igual a la sumatoria",
        "start": 4870.88,
        "end": 4872.88
    },
    {
        "text": " de las flujos de las avistas e entrando",
        "start": 4872.88,
        "end": 4878.88
    },
    {
        "text": " a d",
        "start": 4878.88,
        "end": 4880.88
    },
    {
        "text": " la sumatoria",
        "start": 4886.88,
        "end": 4890.88
    },
    {
        "text": " de las avistas e",
        "start": 4890.88,
        "end": 4894.88
    },
    {
        "text": " la sumatoria",
        "start": 4894.88,
        "end": 4898.88
    },
    {
        "text": " es igual a la sumatoria",
        "start": 4898.88,
        "end": 4902.88
    },
    {
        "text": " y f",
        "start": 4902.88,
        "end": 4904.88
    },
    {
        "text": " y f",
        "start": 4904.88,
        "end": 4906.88
    },
    {
        "text": " y f",
        "start": 4906.88,
        "end": 4908.88
    },
    {
        "text": " y f",
        "start": 4908.88,
        "end": 4910.88
    },
    {
        "text": " y f",
        "start": 4910.88,
        "end": 4912.88
    },
    {
        "text": " y f",
        "start": 4912.88,
        "end": 4914.88
    },
    {
        "text": " y f",
        "start": 4914.88,
        "end": 4918.88
    },
    {
        "text": " y f",
        "start": 4918.88,
        "end": 4920.88
    },
    {
        "text": " y f",
        "start": 4920.88,
        "end": 4924.88
    },
    {
        "text": " y f",
        "start": 4924.88,
        "end": 4927.88
    },
    {
        "text": " y f",
        "start": 4927.88,
        "end": 4932.88
    },
    {
        "text": " y f",
        "start": 4932.88,
        "end": 4934.88
    },
    {
        "text": " y f",
        "start": 4934.88,
        "end": 4937.88
    },
    {
        "text": " f",
        "start": 4938.88,
        "end": 4942.88
    },
    {
        "text": " definir es intentar pasar la mayor cantidad posible de fujo por ese en gra.",
        "start": 4942.88,
        "end": 4953.32
    },
    {
        "text": " Ese es nuestro problema y cómo vamos a resolverlo, hay un mar de soluciones de este",
        "start": 4955.8,
        "end": 4966.92
    },
    {
        "text": " pero que no estén muy cansados.",
        "start": 4973.2,
        "end": 4974.88
    },
    {
        "text": " Hay un, la primera solución de este problema le hicieron dos personas, pues se",
        "start": 4980.4800000000005,
        "end": 4986.22
    },
    {
        "text": " mangan unos fort y el orto y el otro, fujo, y el otro, fujo.",
        "start": 4986.22,
        "end": 4990.84
    },
    {
        "text": " Y siguiendo la siguiente, la siguiente lógica.",
        "start": 4994.4800000000005,
        "end": 5000.88
    },
    {
        "text": " Tenemos una otra página.",
        "start": 5002.88,
        "end": 5008.24
    },
    {
        "text": " Imagínense que volvemos a tener el grazo de hoy.",
        "start": 5017.4400000000005,
        "end": 5021.4400000000005
    },
    {
        "text": " Uh,",
        "start": 5022.28,
        "end": 5023.98
    },
    {
        "text": " pero a ellos.",
        "start": 5029.639999999999,
        "end": 5033.12
    },
    {
        "text": " Y acá tengo una clasica de 20, acá hay un adiós, una de 30, y aquí hay un adiós,",
        "start": 5033.12,
        "end": 5059.24
    },
    {
        "text": " se apuera lo que vimos hoy, los pasos que vimos hoy dijimos a ranco tratando de pasar todo lo que",
        "start": 5059.24,
        "end": 5072.96
    },
    {
        "text": " puedo por acá. Y ahí estoy podiendo pasar 20 unidades, por qué? Porque hay tengo este camino entre",
        "start": 5072.96,
        "end": 5094.28
    },
    {
        "text": " así que elegí un camino cualquier entre 60 y 50 y me fijé cuál es la mayor cantidad de su juego",
        "start": 5094.28,
        "end": 5104.28
    },
    {
        "text": " puedo pasar por este camino. ¿Cuál es la mayor cantidad que puedo hacer por un camino aquí?",
        "start": 5104.28,
        "end": 5110.88
    },
    {
        "text": " Vale, la capacidad de la capacidad de la lista de la lista más",
        "start": 5110.88,
        "end": 5137.6
    },
    {
        "text": " que me llamaron para el teléfono y sin generar teniendo?",
        "start": 5140.88,
        "end": 5157.96
    },
    {
        "text": " ¿Cuánto de la capacidad, la mayor cantidad de su juego que puedo hacer pasar por un camino",
        "start": 5157.96,
        "end": 5164.64
    },
    {
        "text": " cualquier de la resta que le di? Bueno, es como mucho la capacidad de la lista más angosta de ese camino, de un",
        "start": 5164.64,
        "end": 5172.64
    },
    {
        "text": " trincollo de botella en ese camino que es la lista más angosta. ¿Cuál es la lista más angosta de este camino?",
        "start": 5172.64,
        "end": 5179.72
    },
    {
        "text": " ¿Cuánto de la lista más angosta de este camino?",
        "start": 5179.72,
        "end": 5189.72
    },
    {
        "text": " Elhea esta acá, 5 y 20, bueno yo creo a nivel claro리 de este camino primero de岐eros y",
        "start": 5190.4800000000005,
        "end": 5202.0
    },
    {
        "text": " dentro del animal que no lo preguémamos entonces no sololo, no, ten wire, liquid",
        "start": 5202.0,
        "end": 5211.54
    },
    {
        "text": " hay un coño de botella en ese camino que es 20.",
        "start": 5211.54,
        "end": 5215.08
    },
    {
        "text": " Entonces, puedo hacer pasar 20.",
        "start": 5215.08,
        "end": 5217.6
    },
    {
        "text": " Y ahora lo que habíamos visto era un...",
        "start": 5217.6,
        "end": 5221.0
    },
    {
        "text": " Haga, ya sé, un coño.",
        "start": 5221.0,
        "end": 5224.16
    },
    {
        "text": " Habíamos visto nada.",
        "start": 5224.16,
        "end": 5224.86
    },
    {
        "text": " ¿Qué pasa si...",
        "start": 5224.86,
        "end": 5226.3
    },
    {
        "text": " Ahora quiero pasar, y esto es por acá.",
        "start": 5226.3,
        "end": 5228.3
    },
    {
        "text": " Ahh!",
        "start": 5241.58,
        "end": 5242.18
    },
    {
        "text": " R rhythm!",
        "start": 5262.0199999999995,
        "end": 5263.04
    },
    {
        "text": " Es el problema del teletrabajo, pasan cosas.",
        "start": 5271.54,
        "end": 5275.84
    },
    {
        "text": " Quería pasar ahora 10 unidades por acá.",
        "start": 5281.94,
        "end": 5284.64
    },
    {
        "text": " Lo que hoy hicimos fue como medio como viendo esto desde arriba,",
        "start": 5286.64,
        "end": 5291.04
    },
    {
        "text": " viendo el gafo volando de azúcar.",
        "start": 5291.04,
        "end": 5295.04
    },
    {
        "text": " Pero qué pasa si no lo estamos viendo entero.",
        "start": 5297.04,
        "end": 5299.54
    },
    {
        "text": " Qué podemos hacer.",
        "start": 5299.64,
        "end": 5300.64
    },
    {
        "text": " Bueno, podemos decir qué pasa si empujamos.",
        "start": 5301.44,
        "end": 5310.34
    },
    {
        "text": " Vamos a ver un adecuador.",
        "start": 5316.64,
        "end": 5317.84
    },
    {
        "text": " Qué pasa si cuando tratamos de pasar este flujo por acá,",
        "start": 5319.44,
        "end": 5324.44
    },
    {
        "text": " que llega acá y no tiene por donde salir.",
        "start": 5324.84,
        "end": 5328.44
    },
    {
        "text": " Qué pasa si miramos el fuego que está llegando.",
        "start": 5330.14,
        "end": 5334.64
    },
    {
        "text": " Y lo empujamos para atrás.",
        "start": 5334.64,
        "end": 5337.74
    },
    {
        "text": " Empujamos para atrás.",
        "start": 5342.34,
        "end": 5343.34
    },
    {
        "text": " Si empujamos para atrás a este flujo y tienes por donde salir.",
        "start": 5343.34,
        "end": 5347.34
    },
    {
        "text": " Entonces había otro camino posible para ese flujo.",
        "start": 5349.74,
        "end": 5352.54
    },
    {
        "text": " Y capaz que si lo empujo para atrás me queda espacio para pasar yo por acá.",
        "start": 5353.74,
        "end": 5358.14
    },
    {
        "text": " No es un poco raro, pero más o menos.",
        "start": 5359.64,
        "end": 5366.64
    },
    {
        "text": " Ahora lo que es muy ingenioso de estas personas de Ford y Full Person",
        "start": 5376.14,
        "end": 5383.34
    },
    {
        "text": " fue que encontrar una manera sencilla de representar esa idea de empujar para atrás.",
        "start": 5384.34,
        "end": 5392.54
    },
    {
        "text": " Y si inventaron el concepto de gafo residual.",
        "start": 5400.14,
        "end": 5405.54
    },
    {
        "text": " Entonces en este caso vamos a borrar esto.",
        "start": 5406.54,
        "end": 5412.74
    },
    {
        "text": " Si pasamos 20 mil adecuadores por acá.",
        "start": 5427.74,
        "end": 5434.24
    },
    {
        "text": " Esto es la que pasaría 20.",
        "start": 5435.74,
        "end": 5437.74
    },
    {
        "text": " Y gafo residual de esto es otro igual con los mismos nos.",
        "start": 5443.74,
        "end": 5451.24
    },
    {
        "text": " Láximas peronadistas y los mismos vértices.",
        "start": 5456.74,
        "end": 5462.24
    },
    {
        "text": " Pero.",
        "start": 5463.24,
        "end": 5465.24
    },
    {
        "text": " No son las mismos aristas para las mismos vértices.",
        "start": 5468.24,
        "end": 5470.24
    },
    {
        "text": " Como es eso de empujar hacia atrás.",
        "start": 5470.24,
        "end": 5472.24
    },
    {
        "text": " Es una artilugia.",
        "start": 5478.24,
        "end": 5479.24
    },
    {
        "text": " Esa es la que la mente es una artilugia para encontrar la solución.",
        "start": 5479.24,
        "end": 5482.24
    },
    {
        "text": " Pero es una artilugia que tiene cierta intuición.",
        "start": 5482.24,
        "end": 5484.24
    },
    {
        "text": " Pero es que pueden imaginar.",
        "start": 5484.24,
        "end": 5486.24
    },
    {
        "text": " A Fui Carosan.",
        "start": 5487.24,
        "end": 5488.24
    },
    {
        "text": " Pero son pensando bueno y cómo.",
        "start": 5489.24,
        "end": 5492.24
    },
    {
        "text": " Y se esto pasa esta cantidad de flujo por acá.",
        "start": 5493.24,
        "end": 5496.24
    },
    {
        "text": " Porque era lo lo mejor que podía hacer viendo de una forma de gris desde ese.",
        "start": 5496.24,
        "end": 5502.24
    },
    {
        "text": " Pero la realidad.",
        "start": 5502.24,
        "end": 5503.24
    },
    {
        "text": " No era la mejor.",
        "start": 5504.24,
        "end": 5505.24
    },
    {
        "text": " Había otra solución y.",
        "start": 5505.24,
        "end": 5508.24
    },
    {
        "text": " Como la encuentro bueno está pasando esta cantidad de flujo y te quedaba la intenta es.",
        "start": 5508.24,
        "end": 5513.24
    },
    {
        "text": " Quiero tirar para atrás cuando tengo flujo que está llegando por otro lado.",
        "start": 5514.24,
        "end": 5519.24
    },
    {
        "text": " Trato de empujarlo si.",
        "start": 5520.24,
        "end": 5521.24
    },
    {
        "text": " Casa que no puedo ponerlo pero si pueden empujarlo para que pase por otro lado.",
        "start": 5521.24,
        "end": 5525.24
    },
    {
        "text": " Lo ha dado.",
        "start": 5525.24,
        "end": 5526.24
    },
    {
        "text": " Esta es la intuición atrás.",
        "start": 5527.24,
        "end": 5529.24
    },
    {
        "text": " Y la van a ver que la el artilugio para.",
        "start": 5530.24,
        "end": 5533.24
    },
    {
        "text": " Para formalizar eso no está en tu sitio.",
        "start": 5534.24,
        "end": 5537.24
    },
    {
        "text": " Pero una vez que tienen esa intuición se entienda un poco mejor la idea de.",
        "start": 5538.24,
        "end": 5542.24
    },
    {
        "text": " El.",
        "start": 5543.24,
        "end": 5544.24
    },
    {
        "text": " El.",
        "start": 5544.24,
        "end": 5545.24
    },
    {
        "text": " Grafor es igual que como es.",
        "start": 5545.24,
        "end": 5547.24
    },
    {
        "text": " Es un grafo que tiene lo mismo nos.",
        "start": 5548.24,
        "end": 5550.24
    },
    {
        "text": " La misma es.",
        "start": 5551.24,
        "end": 5552.24
    },
    {
        "text": " Vértices.",
        "start": 5552.24,
        "end": 5553.24
    },
    {
        "text": " Pero que.",
        "start": 5555.24,
        "end": 5556.24
    },
    {
        "text": " Vamos a borrar esto.",
        "start": 5558.24,
        "end": 5559.24
    },
    {
        "text": " Si lo mismo vértices.",
        "start": 5564.24,
        "end": 5566.24
    },
    {
        "text": " Pero tiene a estas distintas.",
        "start": 5566.24,
        "end": 5568.24
    },
    {
        "text": " Cuando.",
        "start": 5569.24,
        "end": 5570.24
    },
    {
        "text": " Y se pasar flujo para una lista.",
        "start": 5571.24,
        "end": 5574.24
    },
    {
        "text": " Me fijo cuánto hice pasar.",
        "start": 5576.24,
        "end": 5578.24
    },
    {
        "text": " Hacia el por esa lista en este caso 20.",
        "start": 5579.24,
        "end": 5581.24
    },
    {
        "text": " Y creo una lista en sentido contrario.",
        "start": 5582.24,
        "end": 5585.24
    },
    {
        "text": " Con la misma capacidad de lo que hice pasar para.",
        "start": 5587.24,
        "end": 5590.24
    },
    {
        "text": " Entonces creo a esta lista y se pasa por acá y se pasa.",
        "start": 5590.24,
        "end": 5593.24
    },
    {
        "text": " Y se pasar.",
        "start": 5593.24,
        "end": 5594.24
    },
    {
        "text": " 20 por esta acá así que ahora creo una lista.",
        "start": 5594.24,
        "end": 5597.24
    },
    {
        "text": " De capacidad 20 y el sentido contrario.",
        "start": 5597.24,
        "end": 5600.24
    },
    {
        "text": " Y se pasar.",
        "start": 5602.24,
        "end": 5603.24
    },
    {
        "text": " 20 por acá.",
        "start": 5604.24,
        "end": 5605.24
    },
    {
        "text": " Así que creo la lista de capacidad 20 de sentido contrario.",
        "start": 5606.24,
        "end": 5609.24
    },
    {
        "text": " Y se pasar.",
        "start": 5610.24,
        "end": 5611.24
    },
    {
        "text": " 20 por acá.",
        "start": 5612.24,
        "end": 5613.24
    },
    {
        "text": " Así que creo la lista de capacidad 20 de sentido contrario.",
        "start": 5614.24,
        "end": 5617.24
    },
    {
        "text": " Las otras por las que no hice pasar nada.",
        "start": 5618.24,
        "end": 5621.24
    },
    {
        "text": " Me queda igual.",
        "start": 5622.24,
        "end": 5623.24
    },
    {
        "text": " Una misma capacidad.",
        "start": 5628.24,
        "end": 5629.24
    },
    {
        "text": " Y además me creo.",
        "start": 5640.24,
        "end": 5642.24
    },
    {
        "text": " Otras artistas que representan la capacidad de recibir.",
        "start": 5643.24,
        "end": 5646.24
    },
    {
        "text": " Yo por acá hice pasar acá tenía 30 de capacidad y hice pasar.",
        "start": 5648.24,
        "end": 5652.24
    },
    {
        "text": " 20.",
        "start": 5653.24,
        "end": 5654.24
    },
    {
        "text": " Me quedan.",
        "start": 5654.24,
        "end": 5655.24
    },
    {
        "text": " 10 para hacer pasar.",
        "start": 5656.24,
        "end": 5658.24
    },
    {
        "text": " A estas artistas las que tienen la misma dirección que las originales.",
        "start": 5664.24,
        "end": 5668.24
    },
    {
        "text": " Ellas son las artistas.",
        "start": 5668.24,
        "end": 5669.24
    },
    {
        "text": " Palantes las forward.",
        "start": 5670.24,
        "end": 5672.24
    },
    {
        "text": " Las artistas que van en la dirección contraria.",
        "start": 5673.24,
        "end": 5675.24
    },
    {
        "text": " El fujo que hice pasar se llamó bajo.",
        "start": 5675.24,
        "end": 5678.24
    },
    {
        "text": " Entonces ahora una vez que tengo esto.",
        "start": 5681.24,
        "end": 5684.24
    },
    {
        "text": " Si se fijan.",
        "start": 5686.24,
        "end": 5687.24
    },
    {
        "text": " Yo puedo hacer pasar por acá.",
        "start": 5689.24,
        "end": 5692.24
    },
    {
        "text": " Flujo que antes no podía hacer pasar.",
        "start": 5698.24,
        "end": 5701.24
    },
    {
        "text": " Y puedo encontrar un camino entre s y t de capacidad 10 que pesta vuelta.",
        "start": 5702.24,
        "end": 5711.24
    },
    {
        "text": " Esto del del.",
        "start": 5718.24,
        "end": 5720.24
    },
    {
        "text": " El.",
        "start": 5721.24,
        "end": 5722.24
    },
    {
        "text": " El.",
        "start": 5724.24,
        "end": 5725.24
    },
    {
        "text": " El.",
        "start": 5726.24,
        "end": 5727.24
    },
    {
        "text": " El.",
        "start": 5728.24,
        "end": 5729.24
    },
    {
        "text": " El.",
        "start": 5729.24,
        "end": 5730.24
    },
    {
        "text": " El artilugio como decía Nicolás hace un rato que encontraron.",
        "start": 5730.24,
        "end": 5734.24
    },
    {
        "text": " For the full person para modelar la idea de empujar para estar.",
        "start": 5735.24,
        "end": 5740.24
    },
    {
        "text": " ¿Por qué?",
        "start": 5740.24,
        "end": 5741.24
    },
    {
        "text": " Porque una vez que yo hice pasar.",
        "start": 5741.24,
        "end": 5743.24
    },
    {
        "text": " 10 unidades de flujo por este camino que incluye.",
        "start": 5744.24,
        "end": 5747.24
    },
    {
        "text": " 1 un.",
        "start": 5747.24,
        "end": 5749.24
    },
    {
        "text": " 1 de la lista barcual.",
        "start": 5749.24,
        "end": 5750.24
    },
    {
        "text": " Esta lista.",
        "start": 5750.24,
        "end": 5753.24
    },
    {
        "text": " Vamos a hacer la mejor.",
        "start": 5753.24,
        "end": 5756.24
    },
    {
        "text": " Entonces.",
        "start": 5767.24,
        "end": 5768.24
    },
    {
        "text": " Lo que se traduce eso si yo hice pasar por.",
        "start": 5768.24,
        "end": 5771.24
    },
    {
        "text": " Por.",
        "start": 5771.24,
        "end": 5772.24
    },
    {
        "text": " Por.",
        "start": 5772.24,
        "end": 5773.24
    },
    {
        "text": " Flujo por esa lista.",
        "start": 5773.24,
        "end": 5774.24
    },
    {
        "text": " Lo que hago es restábole al flujo que está pasando.",
        "start": 5774.24,
        "end": 5779.24
    },
    {
        "text": " Por la lista originalmente esa capacidad.",
        "start": 5779.24,
        "end": 5781.24
    },
    {
        "text": " Entonces me queda.",
        "start": 5781.24,
        "end": 5782.24
    },
    {
        "text": " El grazo de flujo.",
        "start": 5783.24,
        "end": 5784.24
    },
    {
        "text": " Ahora me queda.",
        "start": 5784.24,
        "end": 5785.24
    },
    {
        "text": " Me queda esta manera.",
        "start": 5805.24,
        "end": 5807.24
    },
    {
        "text": " Acabas 10.",
        "start": 5810.24,
        "end": 5812.24
    },
    {
        "text": " Me acabas 20.",
        "start": 5813.24,
        "end": 5815.24
    },
    {
        "text": " Me acabas 10.",
        "start": 5818.24,
        "end": 5819.24
    },
    {
        "text": " Me acabas 20.",
        "start": 5820.24,
        "end": 5823.24
    },
    {
        "text": " Y este es el.",
        "start": 5828.24,
        "end": 5831.24
    },
    {
        "text": " Estos son los.",
        "start": 5831.24,
        "end": 5832.24
    },
    {
        "text": " No son las capacidades sino que son los flujos, ¿no?",
        "start": 5832.24,
        "end": 5835.24
    },
    {
        "text": " F de.",
        "start": 5835.24,
        "end": 5836.24
    },
    {
        "text": " De.",
        "start": 5836.24,
        "end": 5837.24
    },
    {
        "text": " De.",
        "start": 5837.24,
        "end": 5838.24
    },
    {
        "text": " De igual a 20.",
        "start": 5838.24,
        "end": 5839.24
    },
    {
        "text": " Cuando este.",
        "start": 5839.24,
        "end": 5840.24
    },
    {
        "text": " E.",
        "start": 5840.24,
        "end": 5842.24
    },
    {
        "text": " F.",
        "start": 5842.24,
        "end": 5843.24
    },
    {
        "text": " De.",
        "start": 5843.24,
        "end": 5844.24
    },
    {
        "text": " De igual a 10 y así.",
        "start": 5844.24,
        "end": 5846.24
    },
    {
        "text": " Pero además genero de nuevo.",
        "start": 5849.24,
        "end": 5853.24
    },
    {
        "text": " Un grazo recibal.",
        "start": 5853.24,
        "end": 5855.24
    },
    {
        "text": " Entonces ahora me he estado en el 2 grazos.",
        "start": 5855.24,
        "end": 5857.24
    },
    {
        "text": " El grazo de flujo.",
        "start": 5857.24,
        "end": 5858.24
    },
    {
        "text": " Y el grazo recibal.",
        "start": 5858.24,
        "end": 5860.24
    },
    {
        "text": " El grazo del flujo es la cantidad de flujo que está pasando realmente.",
        "start": 5861.24,
        "end": 5864.24
    },
    {
        "text": " Parece grazo.",
        "start": 5864.24,
        "end": 5865.24
    },
    {
        "text": " Y el grazo recibal es un grazo auxiliar que utilizo para representar esta idea de ir empujando flujo para.",
        "start": 5865.24,
        "end": 5875.24
    },
    {
        "text": " Está bien eso.",
        "start": 5879.24,
        "end": 5880.24
    },
    {
        "text": " Entonces.",
        "start": 5880.24,
        "end": 5881.24
    },
    {
        "text": " Después de generar de encontrar este camino en el grazo recibal, este es.",
        "start": 5881.24,
        "end": 5886.24
    },
    {
        "text": " Este es.",
        "start": 5886.24,
        "end": 5887.24
    },
    {
        "text": " Este va a llamar jefrimo.",
        "start": 5887.24,
        "end": 5889.24
    },
    {
        "text": " El que llegamos para acá.",
        "start": 5889.24,
        "end": 5890.24
    },
    {
        "text": " Este es.",
        "start": 5890.24,
        "end": 5891.24
    },
    {
        "text": " Este es.",
        "start": 5891.24,
        "end": 5892.24
    },
    {
        "text": " Este es.",
        "start": 5892.24,
        "end": 5893.24
    },
    {
        "text": " El primero.",
        "start": 5893.24,
        "end": 5894.24
    },
    {
        "text": " Voy a volver al computador el grazo recibal.",
        "start": 5894.24,
        "end": 5897.24
    },
    {
        "text": " E.",
        "start": 5897.24,
        "end": 5898.24
    },
    {
        "text": " Y me va a quedar.",
        "start": 5898.24,
        "end": 5901.24
    },
    {
        "text": " De esta forma porque.",
        "start": 5901.24,
        "end": 5904.24
    },
    {
        "text": " Como.",
        "start": 5904.24,
        "end": 5905.24
    },
    {
        "text": " Y.",
        "start": 5905.24,
        "end": 5906.24
    },
    {
        "text": " Me va a quedar.",
        "start": 5906.24,
        "end": 5907.24
    },
    {
        "text": " De esta forma porque.",
        "start": 5907.24,
        "end": 5908.24
    },
    {
        "text": " Como.",
        "start": 5908.24,
        "end": 5909.24
    },
    {
        "text": " Acá no pasó nada.",
        "start": 5909.24,
        "end": 5911.24
    },
    {
        "text": " Acá pasé 10 en esta vista.",
        "start": 5911.24,
        "end": 5914.24
    },
    {
        "text": " Así.",
        "start": 5914.24,
        "end": 5915.24
    },
    {
        "text": " A ver.",
        "start": 5915.24,
        "end": 5916.24
    },
    {
        "text": " Y.",
        "start": 5916.24,
        "end": 5917.24
    },
    {
        "text": " Y.",
        "start": 5917.24,
        "end": 5918.24
    },
    {
        "text": " Y.",
        "start": 5918.24,
        "end": 5919.24
    },
    {
        "text": " Y.",
        "start": 5919.24,
        "end": 5920.24
    },
    {
        "text": " Y.",
        "start": 5920.24,
        "end": 5921.24
    },
    {
        "text": " Y.",
        "start": 5921.24,
        "end": 5922.24
    },
    {
        "text": " Y.",
        "start": 5922.24,
        "end": 5923.24
    },
    {
        "text": " Y.",
        "start": 5923.24,
        "end": 5924.24
    },
    {
        "text": " Y.",
        "start": 5924.24,
        "end": 5925.24
    },
    {
        "text": " Y.",
        "start": 5925.24,
        "end": 5926.24
    },
    {
        "text": " Y.",
        "start": 5926.24,
        "end": 5927.24
    },
    {
        "text": " Y.",
        "start": 5927.24,
        "end": 5928.24
    },
    {
        "text": " Y.",
        "start": 5928.24,
        "end": 5929.24
    },
    {
        "text": " Y.",
        "start": 5929.24,
        "end": 5930.24
    },
    {
        "text": " Y.",
        "start": 5930.24,
        "end": 5931.24
    },
    {
        "text": " Y.",
        "start": 5931.24,
        "end": 5932.24
    },
    {
        "text": " Y.",
        "start": 5932.24,
        "end": 5933.24
    },
    {
        "text": " Y.",
        "start": 5934.24,
        "end": 5935.24
    },
    {
        "text": " Y.",
        "start": 5935.24,
        "end": 5936.24
    },
    {
        "text": " Suiten los 28 позes.",
        "start": 5936.24,
        "end": 5937.24
    },
    {
        "text": " Y.",
        "start": 5937.24,
        "end": 5939.24
    },
    {
        "text": " vamos a ver que le ha organizer.",
        "start": 5939.24,
        "end": 5948.24
    },
    {
        "text": "ichtigamente.",
        "start": 5948.24,
        "end": 5951.24
    },
    {
        "text": " Han visto 11 frequently.",
        "start": 5951.24,
        "end": 5952.24
    },
    {
        "text": " T聞en si la cre breakout para estar situada en una�la a estas miles.",
        "start": 5952.24,
        "end": 5956.24
    },
    {
        "text": " Cuenten unться resistance a sus júnicas.",
        "start": 5956.24,
        "end": 5958.24
    },
    {
        "text": " Unesta.",
        "start": 5958.24,
        "end": 5959.24
    },
    {
        "text": " Y.",
        "start": 5959.24,
        "end": 5960.24
    },
    {
        "text": " Manté esto.",
        "start": 5960.24,
        "end": 5961.24
    },
    {
        "text": " Tieno altar.",
        "start": 5961.24,
        "end": 5962.24
    },
    {
        "text": " y",
        "start": 5962.24,
        "end": 5966.24
    },
    {
        "text": " y",
        "start": 5966.24,
        "end": 5972.24
    },
    {
        "text": " y",
        "start": 5972.24,
        "end": 5978.24
    },
    {
        "text": " y",
        "start": 5978.24,
        "end": 5984.24
    },
    {
        "text": " y",
        "start": 5984.24,
        "end": 5988.24
    },
    {
        "text": " y",
        "start": 5988.24,
        "end": 5991.24
    },
    {
        "text": " y",
        "start": 5991.24,
        "end": 5995.24
    },
    {
        "text": " y",
        "start": 5995.24,
        "end": 6001.24
    },
    {
        "text": " y",
        "start": 6001.24,
        "end": 6005.24
    },
    {
        "text": " y",
        "start": 6005.24,
        "end": 6009.24
    },
    {
        "text": " y",
        "start": 6009.24,
        "end": 6013.24
    },
    {
        "text": " y",
        "start": 6013.24,
        "end": 6015.24
    },
    {
        "text": " y",
        "start": 6015.24,
        "end": 6019.24
    },
    {
        "text": " y",
        "start": 6019.24,
        "end": 6023.24
    },
    {
        "text": " y",
        "start": 6023.24,
        "end": 6025.24
    },
    {
        "text": " y",
        "start": 6025.24,
        "end": 6029.24
    },
    {
        "text": " y",
        "start": 6029.24,
        "end": 6031.24
    },
    {
        "text": " y",
        "start": 6031.24,
        "end": 6037.24
    },
    {
        "text": " y",
        "start": 6037.24,
        "end": 6039.24
    },
    {
        "text": " y",
        "start": 6039.24,
        "end": 6041.24
    },
    {
        "text": " y",
        "start": 6041.24,
        "end": 6043.24
    },
    {
        "text": " y",
        "start": 6043.24,
        "end": 6045.24
    },
    {
        "text": " y",
        "start": 6045.24,
        "end": 6047.24
    },
    {
        "text": " y",
        "start": 6047.24,
        "end": 6049.24
    },
    {
        "text": " y",
        "start": 6049.24,
        "end": 6057.24
    },
    {
        "text": " y",
        "start": 6057.24,
        "end": 6059.24
    },
    {
        "text": " y",
        "start": 6059.24,
        "end": 6063.24
    },
    {
        "text": " y",
        "start": 6063.24,
        "end": 6065.24
    },
    {
        "text": " y",
        "start": 6065.24,
        "end": 6069.24
    },
    {
        "text": " y",
        "start": 6069.24,
        "end": 6070.24
    },
    {
        "text": " y",
        "start": 6070.24,
        "end": 6071.24
    },
    {
        "text": " y",
        "start": 6071.24,
        "end": 6075.24
    },
    {
        "text": " un horro de hondeo,",
        "start": 6075.24,
        "end": 6077.24
    },
    {
        "text": " que han 10 minutos de clase.",
        "start": 6078.639999999999,
        "end": 6080.639999999999
    },
    {
        "text": " Bueno, les cuento cómo es un grafo residual",
        "start": 6083.639999999999,
        "end": 6086.04
    },
    {
        "text": " y la clase que viene arrancamos de cada nuevo,",
        "start": 6086.04,
        "end": 6089.24
    },
    {
        "text": " así no se entrebella.",
        "start": 6089.24,
        "end": 6092.24
    },
    {
        "text": " Tiene las mismas manos,",
        "start": 6093.44,
        "end": 6095.04
    },
    {
        "text": " las mismas fértices que tiene el grafo de flujo.",
        "start": 6095.04,
        "end": 6098.04
    },
    {
        "text": " Para cada arista",
        "start": 6099.84,
        "end": 6101.84
    },
    {
        "text": " en el grafo, cada arista",
        "start": 6102.84,
        "end": 6104.84
    },
    {
        "text": " uve, en el grafo de flujo.",
        "start": 6105.84,
        "end": 6109.84
    },
    {
        "text": " Tengo una capacidad residual,",
        "start": 6111.84,
        "end": 6116.84
    },
    {
        "text": " que es la capacidad de salista,",
        "start": 6116.84,
        "end": 6118.84
    },
    {
        "text": " menos el grupo que estoy pasando.",
        "start": 6118.84,
        "end": 6120.84
    },
    {
        "text": " Lo que hago es generar una arista en sentido contrario,",
        "start": 6121.84,
        "end": 6126.84
    },
    {
        "text": " con la capacidad residual.",
        "start": 6127.84,
        "end": 6129.84
    },
    {
        "text": " Después, actualizé el ssmi flujo",
        "start": 6138.84,
        "end": 6143.84
    },
    {
        "text": " para los grafos residual,",
        "start": 6143.84,
        "end": 6146.84
    },
    {
        "text": " y luego lo voy a utilizar para tratar de pasar de nuevo",
        "start": 6146.84,
        "end": 6150.84
    },
    {
        "text": " su otra vez de cómo vamos a hacer eso,",
        "start": 6150.84,
        "end": 6153.84
    },
    {
        "text": " vamos a hablar de la clase.",
        "start": 6154.84,
        "end": 6156.84
    },
    {
        "text": " Por fin, no va a haber tiempo de dar cortado",
        "start": 6156.84,
        "end": 6159.84
    },
    {
        "text": " en medio de una explicación.",
        "start": 6159.84,
        "end": 6162.84
    },
    {
        "text": " Pero tiene que ver con cada vez",
        "start": 6164.84,
        "end": 6167.84
    },
    {
        "text": " voy a hacer una iteración,",
        "start": 6167.84,
        "end": 6169.84
    },
    {
        "text": " en la que cada vez voy a tomar un camino entre el origen y el destino,",
        "start": 6169.84,
        "end": 6172.84
    },
    {
        "text": " voy a tratar de pasar todo el juego que pueda por ese camino,",
        "start": 6172.84,
        "end": 6175.84
    },
    {
        "text": " me voy a encontrar el cuyo de volteña,",
        "start": 6176.84,
        "end": 6178.84
    },
    {
        "text": " desde el camino, y pasar todo el que pueda por ahí.",
        "start": 6178.84,
        "end": 6180.84
    },
    {
        "text": " Voy a calcular la clase grafo residual,",
        "start": 6181.84,
        "end": 6184.84
    },
    {
        "text": " y voy a tener nuevo sobre él,",
        "start": 6185.84,
        "end": 6187.84
    },
    {
        "text": " tratar de pasar todo el fútbol de pola.",
        "start": 6187.84,
        "end": 6189.84
    },
    {
        "text": " Eso es el empujar para la delas que habíamos hoy.",
        "start": 6190.84,
        "end": 6194.84
    },
    {
        "text": " Y así, sobre ese gran aforecidual que es compute,",
        "start": 6196.84,
        "end": 6199.84
    },
    {
        "text": " voy a volver a calcular un nuevo aforecidual,",
        "start": 6199.84,
        "end": 6202.84
    },
    {
        "text": " a partir de la partida,",
        "start": 6202.84,
        "end": 6204.84
    },
    {
        "text": " y volver a tratar de pasar el fútbol a través de sus altas.",
        "start": 6204.84,
        "end": 6209.84
    },
    {
        "text": " Eso termina en un algoritmo,",
        "start": 6210.84,
        "end": 6214.84
    },
    {
        "text": " que, a casi que viene, vamos a demostrar",
        "start": 6214.84,
        "end": 6216.84
    },
    {
        "text": " que tiene un horno, una contagiedad en el tiempo,",
        "start": 6216.84,
        "end": 6221.84
    },
    {
        "text": " que depende de la capacidad máxima de todas esas aristas,",
        "start": 6221.84,
        "end": 6227.84
    },
    {
        "text": " y que depende de la cantidad de novas de grafas.",
        "start": 6227.84,
        "end": 6232.84
    },
    {
        "text": " Y dejamos para acá.",
        "start": 6233.84,
        "end": 6234.84
    },
    {
        "text": " Buena clase de enza.",
        "start": 6234.84,
        "end": 6238.84
    }
]