[
    {
        "text": " Vamos uno, vamos a repasar Jordan, forma de Jordan y vamos a hacer el ejemplito de",
        "start": 0.0,
        "end": 6.5200000000000005
    },
    {
        "text": " cine, el pizarrón, a mano, no es nada, va a pasar tarde o va a pasar sal, a eso que se",
        "start": 6.5200000000000005,
        "end": 10.84
    },
    {
        "text": " van a poner matrices ahí y vamos a entender qué quiere decir los diferentes",
        "start": 10.84,
        "end": 16.96
    },
    {
        "text": " conceptos, por lo menos dos o tres así. Después vamos a hablar a el número de",
        "start": 16.96,
        "end": 20.8
    },
    {
        "text": " bloques de asociados aún a un valor propio de un tamaño fijo, eso fue lo que",
        "start": 20.8,
        "end": 29.04
    },
    {
        "text": " quedó pronto teóricamente al final de la clase pasada, vamos a escribir el",
        "start": 29.04,
        "end": 35.8
    },
    {
        "text": " lema respectivo y entender qué es lo que nos estaba diciendo en el celema. Vamos a",
        "start": 35.8,
        "end": 41.4
    },
    {
        "text": " hacer un ejercicio en el pizarrón, un ejercicio que está en el práctico pero",
        "start": 41.4,
        "end": 44.519999999999996
    },
    {
        "text": " como ejemplo lo vamos a hacer, pero para seguir con esto de tratar de suavizar",
        "start": 44.519999999999996,
        "end": 50.379999999999995
    },
    {
        "text": " todo el tema Jordan y entender lo que estamos haciendo, te haurema de caer el",
        "start": 50.379999999999995,
        "end": 53.92
    },
    {
        "text": " gammilton y ya lo presentamos en Eveses, lo vamos a hacer, vamos a hablar de",
        "start": 53.92,
        "end": 58.68
    },
    {
        "text": " polinomio minimal y vamos a cerrar la clase de vuelta jugando el pizarro con",
        "start": 58.68,
        "end": 63.28
    },
    {
        "text": " opciones, siéntese polinomio minimal, siéntese el característico, pa pa y este",
        "start": 63.28,
        "end": 67.28
    },
    {
        "text": " y esta matriz con esta forma de sora, podemos recordar también lo que quería",
        "start": 67.28,
        "end": 73.78
    },
    {
        "text": " hacer multiplicidad geométrica y algebreica o algebreica y algeometer que",
        "start": 73.78,
        "end": 77.12
    },
    {
        "text": " mejor dicho, y jugar con esas cosas, o sea hoy me suena clase bastante suave",
        "start": 77.12,
        "end": 83.48
    },
    {
        "text": " en ese sentido, y la clase que viene, la del viernes, empezamos con un repaso",
        "start": 83.48,
        "end": 89.76
    },
    {
        "text": " como hacemos siempre, vamos a hablar cortito de descomposición espectral, pero eso",
        "start": 89.76,
        "end": 96.9
    },
    {
        "text": " no llevará 15 minutos, están al libro también, es muy sencillo, es un concepto",
        "start": 96.9,
        "end": 100.64
    },
    {
        "text": " muy sencillo, pero nos ayuda para la parte siguiente que es un método de",
        "start": 100.64,
        "end": 105.84
    },
    {
        "text": " cálculo de forma de Jordan, que son esas cuentas que yo le dije que a mi",
        "start": 105.84,
        "end": 109.16
    },
    {
        "text": " ni plín, pero para programar bien en barba, porque la realidad es decir, una",
        "start": 109.88,
        "end": 115.2
    },
    {
        "text": " forma de Jordan, la teoría está barba, pero si después no sé cómo hacerle",
        "start": 115.2,
        "end": 119.72
    },
    {
        "text": " la máquina, calcularla, este lo otro, entonces esa es una de las tantas",
        "start": 119.72,
        "end": 127.4
    },
    {
        "text": " nemitas que sirven para las aplicaciones futuras, pero sirven también para,",
        "start": 127.4,
        "end": 131.48
    },
    {
        "text": " a, mira con esto se calcula rápido cuando se los bloque, pa pa,",
        "start": 131.48,
        "end": 134.72
    },
    {
        "text": " bueno y un ejemplo y después la segunda mitad de la clase del viernes, nos vamos",
        "start": 135.28,
        "end": 142.2
    },
    {
        "text": " a sucesiones de matrices, empezamos con sucesiones matrices y a jugar con las",
        "start": 142.2,
        "end": 149.78
    },
    {
        "text": " primeras aplicaciones, bueno entonces, empezamos hoy, tenemos la juz en",
        "start": 149.78,
        "end": 157.2
    },
    {
        "text": " cerro, empezamos con uno de paso de Jordan rapísimos, hemos construido, hemos",
        "start": 157.2,
        "end": 171.92
    },
    {
        "text": " demostrado que si tenemos una transformación lineal de BMW, con todo los pasos,",
        "start": 171.92,
        "end": 188.38
    },
    {
        "text": " hemos hecho todo los pasos para demostrar que si tenemos una tal transformación",
        "start": 188.38,
        "end": 192.92
    },
    {
        "text": " lineal de dimensión finita, entonces existe una base, una base que la llamamos de",
        "start": 192.92,
        "end": 199.11999999999998
    },
    {
        "text": " Jordan, entonces existe B, base de B, base que la llamamos Jordan a partir de la",
        "start": 199.11999999999998,
        "end": 211.67999999999998
    },
    {
        "text": " construcción, la construimos, nos llevó dos clases o tres contra la base, tal que",
        "start": 211.67999999999998,
        "end": 217.0
    },
    {
        "text": " que la matrices associada a FI en esa base B, tenía que formar, bueno, primero que nada,",
        "start": 217.0,
        "end": 231.8
    },
    {
        "text": " tenía, lo primero que hacíamos era la descomposición en las transformaciones FI, FI, FI,",
        "start": 231.8,
        "end": 248.0
    },
    {
        "text": " C, el resto cero, ok, y que esto se escribía así también, el terreno de Jordan sigue",
        "start": 248.56,
        "end": 265.4
    },
    {
        "text": " de este trabajo, después yo voy a seguir escribiendo y no termina acá.",
        "start": 265.4,
        "end": 268.4
    },
    {
        "text": " Esto también los escribíamos así, Fis 1 más, Fis 2 más, Fis 2. ¿Cierto?",
        "start": 268.4,
        "end": 277.4
    },
    {
        "text": " Hay algunas preguntas para repasar juntos y que no sea sólo le profe que escriben le pizarro.",
        "start": 277.4,
        "end": 283.4
    },
    {
        "text": " ¿Quién me dice un poquito quiénes serán cada una de estas Fis 1 y por ejemplo Fis 1, quién era Fis 1?",
        "start": 283.4,
        "end": 289.4
    },
    {
        "text": " ¿O cómo la construimos?",
        "start": 289.4,
        "end": 292.4
    },
    {
        "text": " En las huiles son todos ceros, no puntito, son todos ceros, cero por todos lados.",
        "start": 295.4,
        "end": 302.4
    },
    {
        "text": " No es una diagonal exactamente porque las Fis 2 y son matrices también,",
        "start": 302.4,
        "end": 306.4
    },
    {
        "text": " digamos, no, otra formación es genial, se lo le da por esto maldito.",
        "start": 306.4,
        "end": 309.4
    },
    {
        "text": " A ver, acá si quién es una matrix, cuya forma tiene esta forma donde las Fis 2 y son transformaciones niñas,",
        "start": 312.4,
        "end": 322.4
    },
    {
        "text": " la misma va a ser bueno.",
        "start": 322.4,
        "end": 325.4
    },
    {
        "text": " Los bloques, esos bloques que características tenían, ¿de dónde surgían?",
        "start": 328.4,
        "end": 333.4
    },
    {
        "text": " El kernel de lambda menos, el kernel.",
        "start": 333.4,
        "end": 336.4
    },
    {
        "text": " Exactamente, bueno, esa es una primer o un primer punto que me interesa en el Isar.",
        "start": 336.4,
        "end": 342.4
    },
    {
        "text": " El kernel de Fis menos lambda y por la identidad a la N i, ¿cierto?",
        "start": 342.4,
        "end": 351.4
    },
    {
        "text": " Bien, la disco le ha dicho los valores propios.",
        "start": 351.4,
        "end": 359.4
    },
    {
        "text": " Es verdad, pero a la vez no es verdad.",
        "start": 360.4,
        "end": 364.4
    },
    {
        "text": " ¿Por qué?",
        "start": 364.4,
        "end": 365.4
    },
    {
        "text": " En la construcción del Teorema de Jordan nosotros lo hicimos usando un polinomio,",
        "start": 365.4,
        "end": 370.4
    },
    {
        "text": " que no era el polinomio característico, el característico,",
        "start": 370.4,
        "end": 374.4
    },
    {
        "text": " digamos, todavía nunca pudimos probar porque es el Teorema de Caile Hamilton,",
        "start": 374.4,
        "end": 384.4
    },
    {
        "text": " que el característico anula el operador, es la de la transformación niña.",
        "start": 385.4,
        "end": 389.4
    },
    {
        "text": " Pero si nosotros construimos juntos un polinomio que tenía como raíz a la transformación niña,",
        "start": 389.4,
        "end": 396.4
    },
    {
        "text": " ¿cierto? que anula la de la transformación niña.",
        "start": 396.4,
        "end": 399.4
    },
    {
        "text": " Y es, a partir de eso que le tomamos, a partir del dato del cuerpo,",
        "start": 399.4,
        "end": 404.4
    },
    {
        "text": " el sajero que ha metido cerrado, tomamos todas sus raíces de ese polinomio.",
        "start": 404.4,
        "end": 408.4
    },
    {
        "text": " Entonces las lambda que tenemos por ahora,",
        "start": 409.4,
        "end": 412.4
    },
    {
        "text": " algunas pueden ser valores propios y otras, ¿no?",
        "start": 413.4,
        "end": 419.4
    },
    {
        "text": " Porque ese polinomio puede ser muy grande.",
        "start": 419.4,
        "end": 422.4
    },
    {
        "text": " Pero en principio todos sabemos que después que tienes la base de Jordan y después que tenemos el Teorema,",
        "start": 422.4,
        "end": 433.4
    },
    {
        "text": " como extremos el Teorema de Caile Hamilton, podemos hacer toda la misma construcción",
        "start": 433.4,
        "end": 438.4
    },
    {
        "text": " usando en medio del polinomio ceda original, que era un polinomio que construimos juntos,",
        "start": 438.4,
        "end": 444.4
    },
    {
        "text": " que mostramos que existía, podemos hacer toda la construcción con el polinomio característico.",
        "start": 444.4,
        "end": 450.4
    },
    {
        "text": " ¿Sí?",
        "start": 450.4,
        "end": 451.4
    },
    {
        "text": " Sólo que necesitamos, primero, demostrar Teorema de Caile Hamilton. Muy bien.",
        "start": 451.4,
        "end": 456.4
    },
    {
        "text": " Ahora sí, si usas el característico, lo que dijo Nico, ¿verdad?",
        "start": 456.4,
        "end": 460.4
    },
    {
        "text": " Esos lambda son los valores propios, ¿ok? Por lo tanto está bien lo que dijo.",
        "start": 460.4,
        "end": 465.4
    },
    {
        "text": " ¿Y qué va a pasar en el caso que profe y su tío sosae da que tiene algunos lambda que algunos son valores propios y otros no?",
        "start": 465.4,
        "end": 473.4
    },
    {
        "text": " Y lo que va a pasar, ¿qué esos el kernel va a ser 0? O sea, no agregan nada.",
        "start": 473.4,
        "end": 481.4
    },
    {
        "text": " El kernel no va a tener kernel ese pedazo. O sea, si justo es el lambda que tomaste,",
        "start": 481.4,
        "end": 486.4
    },
    {
        "text": " no ponele. No era lo propio, esto no se va a anular, no va a tener el kernel no va a ser nada, va a ser solo el 0.",
        "start": 486.4,
        "end": 496.4
    },
    {
        "text": " Y por lo tanto, es como que estás poniendo matrices, estás haciendo una matrices muy grandota,",
        "start": 496.4,
        "end": 501.4
    },
    {
        "text": " donde estás poniendo cosas que no tienen ningún sentido, digamos,",
        "start": 501.4,
        "end": 505.4
    },
    {
        "text": " agregando información que no tiene ningún sentido.",
        "start": 505.4,
        "end": 510.4
    },
    {
        "text": " Pero bueno, entonces todo esto lo repaso porque una cuestión es la construcción teórica y después viene la parte imprática,",
        "start": 510.4,
        "end": 519.4
    },
    {
        "text": " que está muy bien lo que dijo Nico, estos es definitiva son los valores propios.",
        "start": 519.4,
        "end": 523.4
    },
    {
        "text": " En principio los N.I. son los exponentes en Z, después vas a usar los exponentes en el característico que en principio puede ser más chicos también.",
        "start": 523.4,
        "end": 533.4
    },
    {
        "text": " Claro, bueno, dicho todo esto que esa era una de las tantas cosas que yo quería,",
        "start": 534.4,
        "end": 541.4
    },
    {
        "text": " ya lo habíamos observado pero lo quiero reafirma, una cuestión de la construcción teórica y después de hecho,",
        "start": 541.4,
        "end": 548.4
    },
    {
        "text": " no sé, habría que buscar alguna demostración, podríamos buscar una demostración si es que hay,",
        "start": 548.4,
        "end": 553.4
    },
    {
        "text": " de Kylie Hamilton, queríamos en ejercicio y buscarla, que no use la forma de lloradan,",
        "start": 553.4,
        "end": 557.4
    },
    {
        "text": " la que vamos a hacer nosotros y usando lloradan, pero si alguno hubiera sin usar lloradan,",
        "start": 557.4,
        "end": 565.4
    },
    {
        "text": " sería bueno buscarla, entonces puedes hacer la base de lloradan usando ya directamente el polenema que era el deléctrico.",
        "start": 565.4,
        "end": 572.4
    },
    {
        "text": " Bueno, muy bien, dicho todo esto, esta fisuy cada una de estas va justamente desde el kernel,",
        "start": 572.4,
        "end": 581.4
    },
    {
        "text": " de F, menos lambda I por la identidad a la N.I., al quedarme el de F, menos lambda I por la identidad a la N.I.",
        "start": 582.4,
        "end": 595.4
    },
    {
        "text": " Y acá agrego dos cosas en este repaso de lloradan, primero que esos N.I. lo dijimos lo generalmente,",
        "start": 595.4,
        "end": 602.4
    },
    {
        "text": " eran los exponentes de la factorización, esta es la, era, T, menos lambda I, la N.I. por T, menos lambda II,",
        "start": 602.4,
        "end": 614.4
    },
    {
        "text": " la N.I. por T, menos lambda S, la N.I. repito, algunos de estos son malos desprepidos otros,",
        "start": 614.4,
        "end": 622.4
    },
    {
        "text": " no, y tenemos derecho a escribirse así porque estamos asumiendo que el cuerpo es algerialicamente cerrado y tiene todas las raíces.",
        "start": 622.4,
        "end": 628.4
    },
    {
        "text": " Una cosa más, nosotros no llevo un ratito, de mostrar que la fisuy iba de aquí, aquí al mismo,",
        "start": 629.4,
        "end": 637.4
    },
    {
        "text": " no llevo un ratito a hacer esa cuentita, no era un regalo de Dios, nosotros tomamos probamos que este es exactamente igual que el lado.",
        "start": 637.4,
        "end": 645.4
    },
    {
        "text": " Y eso era fundamental para que la matriz tuviera esta forma, si no no estaba sino de ceritos, azules por todo el lado.",
        "start": 645.4,
        "end": 652.4
    },
    {
        "text": " Y el otro punto muy importante para repasar, aunque ya está implícito en toda esta construcción, es que el V se escribe justamente como el K-1.",
        "start": 653.4,
        "end": 663.4
    },
    {
        "text": " Por la identidad, la N1, suma directa, suma directa, y K-1.",
        "start": 666.4,
        "end": 674.4
    },
    {
        "text": " A la N1 se acuerdan eso, que el espacio vectorial todo se describe como suma directa de esos K-1.",
        "start": 675.4,
        "end": 683.4
    },
    {
        "text": " Ahí está clarísimo la primera parte de Soro. Cada uno de estos fisuy, cada uno de su cuadrado, jugamos con la letra de esa canción de niño, cada uno de su cuadrado,",
        "start": 685.4,
        "end": 695.4
    },
    {
        "text": " cada uno jugando en su cuadradito, desde este espacio en sí mismo. Esto tiene que ver con lo que ya les comete, va a ser la descomposición espectral,",
        "start": 696.4,
        "end": 705.4
    },
    {
        "text": " que vamos a echarlar hablando de descomposición espectral. Es esta parte, es esto que está acá, saltamos.",
        "start": 705.4,
        "end": 710.4
    },
    {
        "text": " Pero lo dejamos para entre un rato.",
        "start": 710.4,
        "end": 713.4
    },
    {
        "text": " Vamos bien con el repaso, ¿qué hicimos después? ¿Cuál es la parte que viene ahora?",
        "start": 714.4,
        "end": 720.4
    },
    {
        "text": " Bueno, la fisuy ni la fis, ni la fisuy tiene porque ser ni el potente.",
        "start": 721.4,
        "end": 730.4
    },
    {
        "text": " Pero ciertamente Fim en los landa ahí, por la identidad, son ni el potente, restrictas a estos espacios.",
        "start": 730.4,
        "end": 737.4
    },
    {
        "text": " Y ahí vino el truco de la segunda parte, o sea, está vendría a ser una primera gran parte que hicimos juntos de Jordan,",
        "start": 737.4,
        "end": 743.4
    },
    {
        "text": " y la segunda parte para terminar de describir la matriz de su órgane, estomamos cada uno de estos.",
        "start": 744.4,
        "end": 750.4
    },
    {
        "text": " ¿De verdad? Cada uno de estos, fisuy, digamos, en el pedacito de base que le corresponde,",
        "start": 750.4,
        "end": 757.4
    },
    {
        "text": " porque esta base es muy granota, tiene un pedacito que mueve fisu uno, que es la base de este caden.",
        "start": 757.4,
        "end": 765.4
    },
    {
        "text": " ¿De verdad? Después tenés un pedacito de la base granota, que es la base de Fim en los landa 2,",
        "start": 765.4,
        "end": 771.4
    },
    {
        "text": " ponente de la N2 a la barra, entonces ahí se te va armando con la base, todas se te va armando en la matriz.",
        "start": 771.4,
        "end": 779.4
    },
    {
        "text": " Entonces me dejan llamar B suí a cada pedacito de base, digamos que B es B su uno, unión,",
        "start": 780.4,
        "end": 789.4
    },
    {
        "text": " unión y junta, por supuesto, unión y junta B suése. Los pedacitos de base pongan por ahí de cada uno de estos espacios.",
        "start": 789.4,
        "end": 798.4
    },
    {
        "text": " Entonces lo que hicimos es todo el trabajo de ahora de describir esta, este pedazo, este obloque.",
        "start": 799.4,
        "end": 807.4
    },
    {
        "text": " Y en esos más allá de que nosotros estos no son el poder del gran troco que hicimos es los que hubo un poquito diferente a lo que hemos hecho, pero es lo mismo.",
        "start": 807.4,
        "end": 817.4
    },
    {
        "text": " Su mamá, pero me falta la landa acá, esta me falta landa y polenita.",
        "start": 829.4,
        "end": 844.4
    },
    {
        "text": " Su mamá si restamos la matriz landa y polenitidad, nada más que eso, ¿y qué?",
        "start": 846.4,
        "end": 851.4
    },
    {
        "text": " Yo les quiero un poquito distinto a las cosas porque me interesa que lo mismo que verlo de vuelta, pero un poquito distinto,",
        "start": 852.4,
        "end": 859.4
    },
    {
        "text": " porque capaz que encaja mejor las piezas en la comprensión de cada bull. ¿Y cuál es el gran troco? ¿que esto lo sabéis bien como se comporte?",
        "start": 859.4,
        "end": 867.4
    },
    {
        "text": " ¿Qué es esto acá? Pues es una matriz que tiene landas, en este caso, la landa ahí en toda la diagonal y punto, una matriz muy sencilla.",
        "start": 867.4,
        "end": 874.4
    },
    {
        "text": " Y esta otra, y esta otra paso esa misel potente. ¿Por qué en el potente? Porque la está restringiendo al pedacito, que arna el de fíjima, en la landa ahí en la N.",
        "start": 875.4,
        "end": 885.4
    },
    {
        "text": " ¿Se entiende? Y hacer el potente, decimos de todo, la destrozamos, que la recortamos para un lado, para el otro, que les hicimos unas cadenas de crecientes y unas cadenas crecientes que relacionamos la construcción de la...",
        "start": 885.4,
        "end": 902.4
    },
    {
        "text": " Bueno, llevo un buen rato, pero el hicimos de goma y acá fue que en esta parte no es exactamente fissuísis, sino estos, que casi lo mismo, porque su mando de landa o rotada de landa por la identidad,",
        "start": 902.4,
        "end": 915.4
    },
    {
        "text": " describimos completamente el comportamiento de llorrar a cada una de estas. ¿Se acuerdan él? La base construida en forma de triángulo, de tal manera que las columnas terminaban siendo los pedacitos de los bloques de llorrar.",
        "start": 915.4,
        "end": 930.4
    },
    {
        "text": " No la voy a escribir porque nos llevan mucho tiempo, pero en definitiva cada una de estas matrices, en la base b suí, esa base b suí, la desarromamos toda, esta b suí, cada una de esta termina siendo todo el triángulo gigante que generamos, cada una de estas maternotriángulo gigantes.",
        "start": 931.4,
        "end": 958.4
    },
    {
        "text": " Y cada una de estas entonces ganaba, automada de la forma, esa es la bien grande y por acá abajo terminábamos, digamos.",
        "start": 958.4,
        "end": 975.4
    },
    {
        "text": " ¿Dónde teníamos? ¿Cómo le ponimos este jm, creo que no? De landa y jm, de landa y, por algún momento,",
        "start": 976.4,
        "end": 1004.4
    },
    {
        "text": " podría parecer porque no un jm y no lo que usar, jm de landa y, por tu suspensivo, y después por al final te quedaban matrices chiquititas que eran simplemente landa y landa y,",
        "start": 1004.4,
        "end": 1027.4
    },
    {
        "text": " lo sigo el landa y, ¿entiendes? Ojo, puede ser que no haya ninguna uno por uno, puede ser que no haya ninguna, pero la forma general era así, ¿se acuerdan?",
        "start": 1027.4,
        "end": 1040.4
    },
    {
        "text": " ¿Varios bloques de tamaño máximo? M, ¿a ver podría haber bloques más chico hasta algunos bloques?",
        "start": 1040.4,
        "end": 1048.4
    },
    {
        "text": " ¿Cierto? Todo el resto es 0, todo el resto es 0.",
        "start": 1048.4,
        "end": 1065.4
    },
    {
        "text": " ¿Ok? 0, 0, esa es la forma de yo. Ahora, a la vez cada una de estas la jm de landa, la forma genérica, ¿cómo tenia la forma?",
        "start": 1065.4,
        "end": 1084.4
    },
    {
        "text": " Bueno, tenia, le llamó el landa y, pero acá le podíamos poner 0, ¿no? Porque se acuerdan que le pusimos el nombre nu, y el valor propio en realidad, porque ya le resté landa, así que discuto de me,",
        "start": 1084.4,
        "end": 1101.4
    },
    {
        "text": " si soy forma liquidadoso, en estas deberías ser todos 0, ¿ceros? ¿ceros? ¿ceros? ¿qué se transforman en landa aquí? Porque le tengo que sumar este pedacito, ¿no?",
        "start": 1102.4,
        "end": 1116.4
    },
    {
        "text": " Entonces, el jm de landa, lo que tenía era 0, 0, 0, 0, 0, 0, es una matriz, m por m, m por m, todos 0, 0, 0, abajo y los unos aquí arriba, me quedó fea dibujada, pero usted se la conoce como.",
        "start": 1116.4,
        "end": 1138.4
    },
    {
        "text": " Bueno, tan siquiera es numerar diferente, la última base, cada una de estas surgía, de tomar cada una de las columnas del triángulo,",
        "start": 1138.4,
        "end": 1154.4
    },
    {
        "text": " y tomándose una columna para arriba y tenías una base de este pedacito, tomándose otra columna, ¿si acuerdan? Después tenías un escalón, entonces aparecían los llordas más chiquitos,",
        "start": 1154.4,
        "end": 1168.4
    },
    {
        "text": " si en vez de subir, lo anotamos bajando, aparecen como le gusta camila, con los unos abajo, ¿no verdad? Porque le cambias el orden, lo único que haces es el cambio del orden,",
        "start": 1169.4,
        "end": 1180.4
    },
    {
        "text": " entonces en vez de subir, lo anotás bajando, las columnas y se terminó y ya y te queda la forma que capaz queda el que más aparece en el 2, con los unos abajo, da igual, se han cuenta que apenas es un cambio de orden en el último paso,",
        "start": 1180.4,
        "end": 1194.4
    },
    {
        "text": " totalmente, intrascendente para nosotros no va a complicar para nada, toma la forma que quiera.",
        "start": 1195.4,
        "end": 1201.4
    },
    {
        "text": " El desarmado de llorra es tremendo, ¿no? Como cada paso te va desarmando, te va desarmando, te va desarmando y lo agra es definitivamente la expresión llorla.",
        "start": 1203.4,
        "end": 1212.4
    },
    {
        "text": " Bien, esto es cada uno de estos bloquecitos, después de devolverle, después de devolverle, el valor propio correspondiente.",
        "start": 1213.4,
        "end": 1225.4
    },
    {
        "text": " Ojo, algunos estos valores porque podría ser ser, también, nadie dice que no, podría ser que algún lambda ahí fuera ser, no hay ningún problema,",
        "start": 1225.4,
        "end": 1233.4
    },
    {
        "text": " pero el primero que hacer es para trasladar a qué bloque metarlo acá, es devolverle el valor propio a la diagonal, que yo lo había escrito más en la llano verdad, porque bueno, en definitiva, ahí sale y quité en la cola de la idea.",
        "start": 1234.4,
        "end": 1247.4
    },
    {
        "text": " Se entendió este repaso, es maravilloso lo que dice llorra, ¿cómo lográs desarmar completamente nuestra formación llena?",
        "start": 1247.4,
        "end": 1258.4
    },
    {
        "text": " Y la formación es inínales, yo diría que yo lo dije en lo primera clase, que al quebra inínal y estadísticas son las bombáticas que aparecen por todos lados en aplicaciones en cualquier área, digamos tecnológicas, científicas de las.",
        "start": 1259.4,
        "end": 1278.4
    },
    {
        "text": " Así que en particular la descripción de llorra ni todos estos procesos son fundamentales, entender para un montón de matemáticos detrás de un montón de aplicaciones que por hoy aparecen, no sé si decir la vida real, porque la verdad ya no sé si le quedará.",
        "start": 1279.4,
        "end": 1300.4
    },
    {
        "text": " Bueno, muy bien, entonces aquí aparece un concepto que lo presentamos ya en una clase antes, no quiero borrar porque así esto mismo dibujo me ayuda, que esa notación, VLanda y así aparece en el libro, es el número de bloques, y llorra,",
        "start": 1301.4,
        "end": 1325.4
    },
    {
        "text": " y también le voy a poner VLanda L, en el número de bloques de llorra, de valor propio, Landa y tamaño L por él.",
        "start": 1325.4,
        "end": 1349.4
    },
    {
        "text": " Si vos haces en definitiva digamos, si yo sumo, a ver si lo digo bien, la suma en él.",
        "start": 1349.4,
        "end": 1373.4
    },
    {
        "text": " Y dejar un espacio.",
        "start": 1379.4,
        "end": 1402.4
    },
    {
        "text": " Vamos a leerlo, yo agarro, todos los, la cantidad de bloques de llorra que hay para el valor propio, Landa de tamaño L por él, me fijo cuando salgo, los mutulicos por él.",
        "start": 1403.4,
        "end": 1421.4
    },
    {
        "text": " El largo, o el ancho, el que tiene en la matriz, son todas cuadradas. Ahora la suma, pero variando él, del eleguo, hasta el más grande para ese valor propio.",
        "start": 1422.4,
        "end": 1439.4
    },
    {
        "text": " Y ahora, varió el valor propio, varió el andal, lo propio, la suma en el valor de lo cual toda esa, la abril, es saltándole.",
        "start": 1440.4,
        "end": 1449.4
    },
    {
        "text": " No se explica, ¿por qué?",
        "start": 1449.4,
        "end": 1459.4
    },
    {
        "text": " Claro, vos como que visualizás la cantidad de bloques del arruéle, valvariar él, me dice el anda fijo, ¿no?",
        "start": 1460.4,
        "end": 1474.4
    },
    {
        "text": " Ah, me está dando todo este tamaño. La cantidad de bloques de uno, la cantidad de bloques de dos, la cantidad de bloques de M, pero lo multiplico por la altura de cada bloque.",
        "start": 1475.4,
        "end": 1487.4
    },
    {
        "text": " Entonces, me da toda esta altura, pero después todavía hago el asumalo valor propio, entonces me da toda la altura.",
        "start": 1487.4,
        "end": 1495.4
    },
    {
        "text": " Y la altura de esta matriz es en el porén, ¿no? ¿Por qué es la disminución del espacio?",
        "start": 1496.4,
        "end": 1501.4
    },
    {
        "text": " Excelente, lo pueden escribir, por favor, porque creo que pisa ron lo explica todo, pero y la gente de Opefín lo está bien en este momento, es que la explicación es exactamente lo que está dibujado.",
        "start": 1501.4,
        "end": 1515.4
    },
    {
        "text": " Bien, ahora bien, ¿qué fue lo que el cierre del número de bloques de llorna?",
        "start": 1516.4,
        "end": 1529.4
    },
    {
        "text": " Los bloques de llorna estos se llaman, como que lo notamos en la corta ahí, lo propio el anda y te mangue.",
        "start": 1530.4,
        "end": 1541.4
    },
    {
        "text": " Y el lema que aparece ahora y todavía no quiero borrar más allá de que, ¿no?",
        "start": 1541.4,
        "end": 1550.4
    },
    {
        "text": " Me acuerdo, creo que la segunda clase que vi con la profesora de idade, que puse ese lipa también, termine el lipa, no?",
        "start": 1551.4,
        "end": 1559.4
    },
    {
        "text": " A más, el de toda la carrera matemático, pero por otro lado, y se le di.",
        "start": 1559.4,
        "end": 1562.4
    },
    {
        "text": " Y la profesora de idade, me muy lindo tu clase, pero tus pisa ron son un caracol, pero eso es así, termina así al medio.",
        "start": 1562.4,
        "end": 1569.4
    },
    {
        "text": " Y eso no se hace, pero bueno, hoy no queda otra forma, un chancho va a el caracol, va a terminar acá con un lema.",
        "start": 1569.4,
        "end": 1577.4
    },
    {
        "text": " Así que, recuerda la profes, explicándome que eso no se hace, y ahí aprendí por lo menos a destacar un poquito más cuidado.",
        "start": 1578.4,
        "end": 1589.4
    },
    {
        "text": " El lema es que justamente este número, ve, el anda, el, no depende de la base de llorvan elegida, construida o elegida.",
        "start": 1590.4,
        "end": 1611.4
    },
    {
        "text": " Bien, esto lo dijimos al final de la clase pasada, lo repasamos juntos el por qué?",
        "start": 1612.4,
        "end": 1619.4
    },
    {
        "text": " Primero, tiene sentido este lema, vamos a explicar el sentido del lema, este, ¿qué es esto que no depende de la base elegida?",
        "start": 1622.4,
        "end": 1629.4
    },
    {
        "text": " Nosotros hicimos una construcción de una base de llorvan, y como decíamos, en otro curso, o podrían tener otra técnica para demostrar el llorvan y construir este otra base, o mismo,",
        "start": 1630.4,
        "end": 1648.4
    },
    {
        "text": " en los momentos de elección en el proceso, que bueno, un compañero sobre un ejercicio 11 por 11, un compañero lo hace una manera y el que un compañero lo hace otra.",
        "start": 1649.4,
        "end": 1658.4
    },
    {
        "text": " Entonces, en principio, ¿quién nos garantiza que la forma de llorvan es única? O sea, que los bloques de tamaño más grande, asociados al primer valor propio, a Santiago y a Camila le dan la misma cantidad, ¿por qué?",
        "start": 1658.4,
        "end": 1672.4
    },
    {
        "text": " O lo has luado que más chicos del segundo valor propio, ¿a qué deben llegar a abrirle, tiene que dar la misma cantidad? ¿por qué?",
        "start": 1673.4,
        "end": 1680.4
    },
    {
        "text": " Se entiende, la pregunta es válida, porque en principio la base es la alguna la va construyendo.",
        "start": 1681.4,
        "end": 1685.4
    },
    {
        "text": " Bueno, y la respuesta, la misma clase pasada, porque cuando vos fijás el valor propio, vamos acá, ahora cuando vos fijás el tamaño, estás en uno de estos, por ejemplo,",
        "start": 1686.4,
        "end": 1699.4
    },
    {
        "text": " o de los chicos o algún intermedio, ¿cuántos de estos JTZ y Y?",
        "start": 1699.4,
        "end": 1706.4
    },
    {
        "text": " Aquí correspondían en la base que construimos juntos para este Vsui, ¿te acuerdan que esto lo llamamos Vsui?",
        "start": 1707.4,
        "end": 1720.4
    },
    {
        "text": " Ahora, este le llamamos Vsui uno, Vsui, Vsui, ¿sí? Bueno, y le constríamos una base Vsui a cada uno de ellos.",
        "start": 1721.4,
        "end": 1730.4
    },
    {
        "text": " Esta base Vsui tenía esta forma, ¿sí? ¿Aci?",
        "start": 1731.4,
        "end": 1741.4
    },
    {
        "text": " Y así, ¿sí? ¿Aci? ¿Aci? ¿Aci? ¿Tenía como de la triangular?",
        "start": 1748.4,
        "end": 1753.4
    },
    {
        "text": " Los elementos, la construcción de cada bloque, la tomamos así, ¿sí? ¿Acuáran?",
        "start": 1753.4,
        "end": 1762.4
    },
    {
        "text": " Todos estos, todos estos, todos estos, se terminó acá abajo.",
        "start": 1762.4,
        "end": 1768.4
    },
    {
        "text": " Saltábamos y decíamos ahora los un poquito más cortos, todos estos, todos estos, todos estos. ¿Sacuérdan?",
        "start": 1769.4,
        "end": 1779.4
    },
    {
        "text": " De hecho, los pusimos de abajo para arriba, pero si lo han puesto de arriba para abajo, los unos aparecían abajo de la diagonal.",
        "start": 1779.4,
        "end": 1787.4
    },
    {
        "text": " Fue lo que dijimos así otro. Finalmente, los más chiquititos acá y perfectamente podía haber algunos de tamaño 1, ¿por qué no?",
        "start": 1788.4,
        "end": 1796.4
    },
    {
        "text": " El tamaño 2 y alguno de tamaño 1, ¿por qué no?",
        "start": 1797.4,
        "end": 1801.4
    },
    {
        "text": " Bien y alguno de tamaño 1. Esto de tamaño 1 son los que corresponden esta parte acá.",
        "start": 1802.4,
        "end": 1807.4
    },
    {
        "text": " ¿Cierto? El tamaño 2 un poquito más grande, ¿sí? ¿Sí? Bueno, ¿a qué correspondían la altura de cada uno de estos? ¿Sacuérdan?",
        "start": 1808.4,
        "end": 1821.4
    },
    {
        "text": " Claro, la altura total era el nivel de ni potencia de esta transformación lineal y eso tenía que ver con este N.A.",
        "start": 1822.4,
        "end": 1834.4
    },
    {
        "text": " Esa es la altura total. Bueno, ¿pero cuántos bloques de estos sabías? ¿Sacuérdan?",
        "start": 1835.4,
        "end": 1841.4
    },
    {
        "text": " O sea, ¿cuántos de esta altura, cuántos de esta altura? Porque cada uno de estos, estos acá habría 3 bloques grandes.",
        "start": 1842.4,
        "end": 1850.4
    },
    {
        "text": " 3 por el dibujo, ¿no? 3 de los un poquito más chiquitos y así la cantidad, el ancho del escalón era justamente la cantidad de los bloques yo eran que había en cada caso.",
        "start": 1851.4,
        "end": 1865.4
    },
    {
        "text": " ¿Sacuérdan que analizamos que correspondía justamente?",
        "start": 1866.4,
        "end": 1870.4
    },
    {
        "text": " Luzimos, creo que lo dijimos mejor que lo que está escrito en el libro, pero corresponde cada uno de estos corresponde.",
        "start": 1871.4,
        "end": 1883.4
    },
    {
        "text": " Voy a poner la línea nada más a la dimensión.",
        "start": 1886.4,
        "end": 1891.4
    },
    {
        "text": " Porque lo visualizamos en las bases, pusimos las bases, las dos construcciones de base, la creciente y la decreciente y esto se dijimos a corresponde a esto y esto es lo que voy a escribir ahora nada más.",
        "start": 1891.4,
        "end": 1905.4
    },
    {
        "text": " Este número, la diferencia de estos dos, a ver que se vea bien que es una diferencia, este menos este.",
        "start": 1951.4,
        "end": 1973.4
    },
    {
        "text": " Y es justamente la cantidad de vectores que aparecían el tapa y tapa.",
        "start": 1974.4,
        "end": 1987.4
    },
    {
        "text": " Si se acuerdan estos, le tomábamos, lo voy a completar el dibujo, le tomábamos el mu, le tomábamos el mu, lo vamos transformando por mu.",
        "start": 1988.4,
        "end": 2014.4
    },
    {
        "text": " Se acuerdan, entonces iba transformando el oce tapa y tapa.",
        "start": 2015.4,
        "end": 2021.4
    },
    {
        "text": " Los nuevos que aparecían, porque entonces que quiere decir, por ejemplo, miren este salto acá, se acuerdan.",
        "start": 2021.4,
        "end": 2030.4
    },
    {
        "text": " Estos, primeros tres son transformados de lo de la base original, el pedacito original, si querían haber el pedacito más chico, no original.",
        "start": 2030.4,
        "end": 2039.4
    },
    {
        "text": " Y hay nuevos, el tamaño del bloque, la cantidad de los bloques de su oran de esta altura son los elementos nuevos que tuviste que agregar, los que no son transformados de antes.",
        "start": 2040.4,
        "end": 2054.4
    },
    {
        "text": " Este análisis lo hicimos, estos justamente es esa diferencia, los que tenéis que agregar.",
        "start": 2054.4,
        "end": 2061.4
    },
    {
        "text": " Lo hicimos en la cadena, lo dibujamos en la cadena, están oven fin, puedan repasarlo, pero al quebraicamente ese número formalmente.",
        "start": 2062.4,
        "end": 2073.4
    },
    {
        "text": " Son los que había que ir agregando. Entonces, ¿cuánto tenéis que agregar acá? Y bueno, estos tres, porque había la base, tiene tres más que no eran transformados de elementos de la base anterior.",
        "start": 2073.4,
        "end": 2086.4
    },
    {
        "text": " Y así se van construyendo paso a paso hasta lograr la base de la base grande. Era la base del kernel, era la base que teníamos.",
        "start": 2087.4,
        "end": 2099.4
    },
    {
        "text": " Y esta la observamos que se podía escribir de esta manera, en realidad la construcción fue hacia abajo.",
        "start": 2099.4,
        "end": 2106.4
    },
    {
        "text": " Bien, pero este número, aquí, mire este número, aquí no hay ninguna base de nada, elegí la base que quiera hasta debo, Alexandra que viniste tarde, elegí la base que quiera, aquí no hay ninguna base.",
        "start": 2107.4,
        "end": 2122.4
    },
    {
        "text": " Este es un número, quiere decir que este número es totalmente independiente, acá sería de tamaño i, le puse i, dejenme corregir acá, le pongo i, para no tener que cambiar los exponentes y menos un.",
        "start": 2122.4,
        "end": 2139.4
    },
    {
        "text": " Eso no tiene que dar con la base, es un concepto que va independiente de la base que construyas, es un número, la resta de dos invenciones.",
        "start": 2140.4,
        "end": 2152.4
    },
    {
        "text": " Entonces, Gabriel le dijo una base, Santiago le dije otra base, y bueno, a mí me da igual porque la cantidad de la misma, la base todas tienen la misma cantidad de elemento, eso ya lo probamos en galuno.",
        "start": 2152.4,
        "end": 2163.4
    },
    {
        "text": " Y por lo tanto, la diferencia de las dimensiones también de la misma se elija la base que se elija, creo claro, bueno, fundamental porque este lema lo que está diciendo, la notamos ahí, y eso es una conclusión muy importante, la forma de llorrar es única, este lema lo que usted dice es que la forma de llorrar es única.",
        "start": 2164.4,
        "end": 2185.4
    },
    {
        "text": " Y eso es central, existe, lo llevo como el tres clase y es única, porque el lema te dice la cantidad de bloque que tienes que tener, después que se sabe los bloque, te dice de valor propio y lambda, y de cada bloque de eso, de tamaño y por ello, o sea que usted está diciendo todo exactamente como la base, como es la comena matriz.",
        "start": 2186.4,
        "end": 2204.4
    },
    {
        "text": " Le puedes reordenar, si le cambias la base de lugar a los elementos, los bloque de llorrar, si te pueden cambiar de lugar, Gabriel.",
        "start": 2205.4,
        "end": 2213.4
    },
    {
        "text": " ¿Alguien se le están tratando de ferir la línea de la línea de la línea de la línea de la línea de la línea de la línea de la línea?",
        "start": 2213.4,
        "end": 2221.4
    },
    {
        "text": " Porque las imágenes son cada más chicas, o sea la imagen de mu incluye la imagen de mu cuadrado, incluye la imagen y así, esta en la cadena de creciente.",
        "start": 2222.4,
        "end": 2241.4
    },
    {
        "text": " Acá está cortado con el kernel, después la corta con el kernel, las imágenes son de creciente y los kernel se enan crecientes, se acuerdan en las dos cadenas, entonces cada eso más chica.",
        "start": 2242.4,
        "end": 2253.4
    },
    {
        "text": " Y la cantidad de vectores que tienes que agregar paso a paso se es la diferencia entre las invencias. Vean lo por favor de vuelta con las notas de la clase pasada o con la grabación de definir la clase pasada.",
        "start": 2254.4,
        "end": 2267.4
    },
    {
        "text": " Vean que este lema con este esquema, con estas notaciones y con lo que dijimos en la clase pasada, que estaba todo el dibujo de las dos bases, tenemos la barra en la computada del hermano, la seis balitas, la ponen ahí, la he dado la otra y van parando el top y mezclando la dos.",
        "start": 2267.4,
        "end": 2285.4
    },
    {
        "text": " Vamos arriba, excelente, hemos dado algunos de los pasos que dijimos que vamos a dar. Así que la forma de suren existe y es única y vamos a hacer el ejercicio que está en práctico 2,5a.",
        "start": 2286.4,
        "end": 2304.4
    },
    {
        "text": " Pero lo vamos a hacer simplemente para visualizar un poco este comportamiento de suren. ¿Qué dice? Dice así.",
        "start": 2305.4,
        "end": 2318.4
    },
    {
        "text": " Encontrar la forma de suren, es muy sencillo, pero encontrar una forma, ya sabemos que es la forma de suren asociada a la matriz.",
        "start": 2318.4,
        "end": 2342.4
    },
    {
        "text": " 0, 1, 1, 0, 0, 1, 0, 0, 0, 0.",
        "start": 2349.4,
        "end": 2355.4
    },
    {
        "text": " Si en que casi están de la forma suren, me acaban de decir la cantidad, la multiplicidad geométrica es la cantidad de bloques asociados de ese valor propio.",
        "start": 2356.4,
        "end": 2373.4
    },
    {
        "text": " Puede decirlo así, es la cantidad de sumandos que tiene con el lambda fijo esta sumatoria, no toda la sumatoria porque si no hay que variar el lambda.",
        "start": 2374.4,
        "end": 2387.4
    },
    {
        "text": " O variamos el lambda porque justo acá quedo de sumatoria propio solo, pero digamos si estamos hablando de un valor propio, la cantidad de sumandos. ¿Tener acuerdo? ¿Por qué decís?",
        "start": 2387.4,
        "end": 2401.4
    },
    {
        "text": " Sí, la cantidad de sumando, no, no es la cantidad de sumando porque puse todos juntos los del mismo tamaño. Sería en realidad la suma parcía en la quino, ¿verdad?",
        "start": 2402.4,
        "end": 2418.4
    },
    {
        "text": " La cantidad de 1, la cantidad de 2, la cantidad de L, etcétera, porque los puse todos juntos, no puse todos los bloques.",
        "start": 2418.4,
        "end": 2429.4
    },
    {
        "text": " La cantidad de la puse toda Junta, todos los de tamaño aca conté todos los de tamaño L.",
        "start": 2429.4,
        "end": 2441.4
    },
    {
        "text": " Bueno, eso suma, ese es un número que tiene que dar justo la de tamaño L y digamos suma la sumatoria total.",
        "start": 2441.4,
        "end": 2451.4
    },
    {
        "text": " No es la cantidad de sumando porque le puse todos juntos, sino la suma quedaría con el lambda fijo. Es la cantidad como dijo a un compañero, la cantidad de bloques en total que tenés cuando les contás así.",
        "start": 2452.4,
        "end": 2468.4
    },
    {
        "text": " 1, 2, 3, 4, 5, 6, 7, 8, 9, 9, 9, 9, 8, esto es la multiplicidad geométrica. ¿Pero por qué? Es la multiplicidad geométrica, es rica.",
        "start": 2468.4,
        "end": 2480.4
    },
    {
        "text": " Ay, se llama la bisa de la matemática, no, es porque cuando vos el proceso que hizo Francisco es que al cuidar el que aneme las lámdes de la entidad.",
        "start": 2480.4,
        "end": 2491.4
    },
    {
        "text": " Ahora vamos a hacer lo mismo en aquella matriz. Si quieren, le devuelvo, voy a borrar un poquito para que no haya,",
        "start": 2492.4,
        "end": 2505.4
    },
    {
        "text": " vio que la unía en las cuales ponen igual, igual, igual, igual, igual, igual, igual, igual, y van cambiando porque van haciendo la cuenta que la siguiente, la siguiente, entonces juntos igual.",
        "start": 2505.4,
        "end": 2514.4
    },
    {
        "text": " Bueno, vamos a unos comentarios, acá vamos a sacar el igual porque vamos a referirnos a cada uno de estos bloques, un bloque fijo, pongamos un lambda fijo.",
        "start": 2514.4,
        "end": 2525.4
    },
    {
        "text": " Y acá la anda el lambda, la anda diferente de tamaño. Bien, este ponele que es, justo además en el ejercicio había sólo un valor propio,",
        "start": 2526.4,
        "end": 2539.4
    },
    {
        "text": " o sea que se adapta muchísimo, están analizando un bloque, muy bien, y lo que hizo Francisco es le restó, ponele que están la matriz, y le restó el lambda por la entidad.",
        "start": 2539.4,
        "end": 2553.4
    },
    {
        "text": " O sea que le sacó a la matriz, no lo voy a hacer para, como lo diario, que está antes, este, le saco el lambda todo el adiagonal. Bien,",
        "start": 2553.4,
        "end": 2563.4
    },
    {
        "text": " lo real, miremos uno cualquiera de eso, lambda, lambda, lambda, pero uno, uno, uno, se, ponele que este es un té por té.",
        "start": 2563.4,
        "end": 2587.4
    },
    {
        "text": " Le resté el lambda al adiagonal, vieron que cada uno vive en su mundo, así como cada uno de los fiso y vive en su mundo, cada uno de estos bloques vive en su mundo, así construimos la base, todo el resto es cero.",
        "start": 2588.4,
        "end": 2607.4
    },
    {
        "text": " Entonces, cuando yo agan análisis, ámelo es la amplia identidad, me fijen el kernel, lo que da a tener que mirar es que pasa aquí, que pasa aquí, que pasa aquí, que pasa en cada lado.",
        "start": 2608.4,
        "end": 2619.4
    },
    {
        "text": " Empecemos con el del medio, digamos, le retas lambda por la entidad, ¿cuál es el kernel? O sea que este pone todo los lambda, en el medio, ¿cuál es la dimensión del kernel?",
        "start": 2619.4,
        "end": 2633.4
    },
    {
        "text": " A ver lo acá. ¿Por qué uno?",
        "start": 2634.4,
        "end": 2642.4
    },
    {
        "text": " Exacto. ¿Ese pone todo el adiagonal?",
        "start": 2642.4,
        "end": 2651.4
    },
    {
        "text": " Pero, más que triangular, es todo uno, amado, pero es una papa, pero también es verdad lo que dijiste, o sea, al cedemular superior, lo de las punta de los escalones distintos, lo de esa cual era la que estaba también en el libro Rojo, a su chucho, que es el color, otra forma justificana.",
        "start": 2652.4,
        "end": 2666.4
    },
    {
        "text": " Uno, así que, y este este pone, m por m, a x, j, j por j, t, uno por uno, siempre es uno. Entonces, ¿cuánto suma el kernel 1? ¿cuánto suma el kernel 1?",
        "start": 2666.4,
        "end": 2677.4
    },
    {
        "text": " Acá hay uno, acá hay uno, acá hay uno, acá hay, ¡ah! Entonces, estás contando la cantidad de bloques, es exactamente lo que dije, ¿no?",
        "start": 2678.4,
        "end": 2686.4
    },
    {
        "text": " El kernel de cada lado, cada lado, el propio, es la cantidad de bloques, porque cada uno se suma uno, al kernel, un muchacho va a palquear, el un muchacho va a palquear.",
        "start": 2686.4,
        "end": 2697.4
    },
    {
        "text": " El primero, ¿no? En esta organización sería el primero, el primero de la base va a palquear, ¿no? ¿cierto?",
        "start": 2698.4,
        "end": 2705.4
    },
    {
        "text": " Por eso, la multiplicidad geometrica es la cantidad de bloques de su órgano, ¿no?",
        "start": 2706.4,
        "end": 2714.4
    },
    {
        "text": " En el caso de la base va a palquear, ¿no?",
        "start": 2715.4,
        "end": 2718.4
    },
    {
        "text": " Sí, señor, en aquel ejemplo tendríamos sólo una columna de tamaño máximo, sólo una, porque ahí son...",
        "start": 2725.4,
        "end": 2736.4
    },
    {
        "text": " Primero que nada, estamos con un valor de propio suelo, ¿no? Entonces, ya estamos restringidos a un diagrama de esto, pero además sólo hay una columna de tamaño máximo, se los comió todo esa columna, no queda más nada, exactamente.",
        "start": 2736.4,
        "end": 2748.4
    },
    {
        "text": " ¿Cería Aiba? Y esa es la otra forma que yo había pensado hacer, así que ya de paso le contesto Santiago y hago la forma, pensé que ustedes me van a hacer esta, no tan formal, yo pensé de una forma más ingeniería, ¿no?",
        "start": 2750.4,
        "end": 2763.4
    },
    {
        "text": " El hígil, dije así, me están volviendo mi amas, me alegro, ese es medio peligroso, esto. Dije así, vamos a tomar una base uvw, supongamos que esta matriz A está dado en esta base v3, uvw, si es una matriz, en alguna base está, ¿cierto?",
        "start": 2763.4,
        "end": 2792.4
    },
    {
        "text": " Entonces, ¿qué quiere decir uvw? Yo mira ya la organización, entonces, ¿qué quiere decir? Bueno, que el u va a parar acero, al ver esto nula, ¿no? Hace la cuenta, el u sería el primero, además si es una base ya sabemos, mejor escribirla así por que una base tiene orden, entonces mejor en paréntesis y no como conjunta.",
        "start": 2793.4,
        "end": 2815.4
    },
    {
        "text": " El u va a parar acero, porque es el primero, lo multiplica por un 0, 0, aquí ya es matriz va a parar acero, a ver a lv, el v va a parar a u, ¿cierto? Si yo multiplico por 0, 1, 0, 1, 0, 1, 0, 0, me da el u, el primero, el segundo va al primero, que además tiene que ver con aquellas forma de leer las bases, pero el tercero, el w, exactamente, u más v, no te dio en la base,",
        "start": 2815.4,
        "end": 2844.4
    },
    {
        "text": " entonces es una diferencia, y yo pensé que le iban a hacer así, entonces dije yo, esto que quiere decir, que el uv está en el que anhel, de A, esto que quiere decir, que v está en el que anhel de quien, lo se escucho, exactamente, ¿cabas?",
        "start": 2844.4,
        "end": 2866.4
    },
    {
        "text": " La siguiente paso, se acuerda la cadena creciente de que anheles, y acá lo que tenemos es que w menos v, aquí va a parar w menos v, si w para v más v,",
        "start": 2866.4,
        "end": 2887.4
    },
    {
        "text": " claro, w va a parar a u más v, v va a parar a u, entonces w va a parar a u más v menos u, o sea va a parar a v, por lo tanto w v pertenece a quien, a el que anhel de A, cu, y cada uno está en el que anhel siguiente digamos así,",
        "start": 2887.4,
        "end": 2908.4
    },
    {
        "text": " entonces w v menos v, sí sí sí, perdón, por lo tanto w v pertenece a quien, a quien se acuerda así, ojo lo que hizo, por lo que está perfecto porque es más, pero esto es más a mano, ¿no?",
        "start": 2908.4,
        "end": 2931.4
    },
    {
        "text": " y entonces cuál es la base que armamos, x1 x2 x3, es la base de llor, una base de llor, si me ocurre a mí, es una base de llor donde x1 es w menos v, x2 es v y x3, es u, ¿y acuerdo?",
        "start": 2931.4,
        "end": 2958.4
    },
    {
        "text": " y en esa base, en esa base la matriz te queda 0, 0, 0, 0, 0, 0, 0, si es que? por favor si está bien, si lo convencí, las dos formas son correcta, me encantó, realidad que facúndole ha hecho de forma formal digamos así,",
        "start": 2958.4,
        "end": 2984.4
    },
    {
        "text": " porque esta otra es muy natural de hacerlo, y ojo que podrían aparecer a otros también, mira, del x1 vas a parar del x2, w menos v voy a parar a v, entonces cero, ¿no?",
        "start": 2984.4,
        "end": 3007.4
    },
    {
        "text": " ¿Qué le podría hacer a través? A ver la imagen del primero, te puse a través, la puse a través entonces, acá lo hice algo a camis, la disculpen, acá quedaría si 0, 0, 0, 0, 1, 0, 1, gracias por la correcienda, ahora si está bien, la imagen del primero sería el segundo,",
        "start": 3007.4,
        "end": 3035.4
    },
    {
        "text": " la imagen del segundo puse a través todavía, vamos a chequear, la imagen del segundo sería el tercero ahora, ahora me quedo bien, entonces me quedo algo a camis, si lo ponemos a través, x le damos vuelta el orden, nos queda como, y lo mismo, ¿no?",
        "start": 3037.4,
        "end": 3055.4
    },
    {
        "text": " ¿Qué o claro? Alexander a pesar de que nos viste vaciando las cosas claras, te acordas de galdoz, bien, es un buen momento para preguntas, comentarios, sugerencias,",
        "start": 3055.4,
        "end": 3074.4
    },
    {
        "text": " la base v prima es una original la que viene da por la matriz, yo no sé ni qué es, pero la matriz en una base tiene, porque digamos es una transformación niña al que, incluso no sé ni qué son los factores,",
        "start": 3074.4,
        "end": 3093.4
    },
    {
        "text": " una, tres factores que les llame WBW, lo que me dice es como si ordenan el ubo para, pa, pa, pa, si harto, más preguntas, Sara como andamos, bien, me encanta que estén en ese proceso de assimilación,",
        "start": 3093.4,
        "end": 3120.4
    },
    {
        "text": " yo con el iba clase pasaba, entonces en assimilación nunca llegaba a entender en clase, y después me bajó el fútbol, pero de noche algo se procesaba por ahí,",
        "start": 3121.4,
        "end": 3139.4
    },
    {
        "text": " si estamos entonces vamos a caerle y jamitón, tenemos que lograr demostrar caerle y jamitón antes que termine de la clase, puedo, les parece bien, puedo borrar los pizarrones,",
        "start": 3139.4,
        "end": 3156.4
    },
    {
        "text": " ¿cómo lo ha ido a ferir esto como el objetivo?",
        "start": 3156.4,
        "end": 3160.4
    },
    {
        "text": " A ver, medio que lo hice con el método de la demostración, porque de hecho fui destacando dónde estaban los elementos en la construcción de la base,",
        "start": 3168.4,
        "end": 3178.4
    },
    {
        "text": " está en chiquito que está, en medio de la que nos quedó, primero que nada, que hay un solo valor propio, entonces esto es la primera parte de la demostración ya no es necesario, cuando me fui la segunda parte en la construcción de la base observamos que estaban en el que,",
        "start": 3179.4,
        "end": 3194.4
    },
    {
        "text": " este está en el que, en el de A cuadrado y no en el que, en el de A, o sea podría haber puesto que están la diferencia de los dos, es muy importante porque son de los que vas ganando, digamos,",
        "start": 3194.4,
        "end": 3205.4
    },
    {
        "text": " en la construcción de la, no en esta, esta tenía que ver con la siguiente cadena, esta la construcción se acuerda el primer diagrama que hicimos, que íbamos completando la base del que, en el que, con pedacitos de colores, y cada uno de estos tenía un color distinto,",
        "start": 3205.4,
        "end": 3222.4
    },
    {
        "text": " pero este sería naranja, este sería rojo y este sería el final que estaban en el que, en el resto, se acuerdan, estaba, bueno no tiene nombre del espacio pero, lo podríamos llamar B, tenía el que, en el de A, el que, en el de A cuadrado, y acá,",
        "start": 3222.4,
        "end": 3251.4
    },
    {
        "text": " el que, en el de A, y a la cuarta se acero, y lo que fuimos tomamos, este, este, rojo, por acá, es uno solo, no, no es una base, cada uno tenía un dimensión uno, cada pedacito extra digamos,",
        "start": 3252.4,
        "end": 3272.4
    },
    {
        "text": " después el naranja por acá, y ya que tenemos un verde, y el verde por acá, y entre los tres, este, bueno armamos la base de lo que era el que era el que era la matriz, como el valor de propiedad 0, con eso no se fue suficiente, porque están todos dentro del que era el que era el monóxia,",
        "start": 3272.4,
        "end": 3299.4
    },
    {
        "text": " y que es cierto, todos asosciados, el valor propio 0, disculpe, vamos a decirle con cuidado,",
        "start": 3299.4,
        "end": 3309.4
    },
    {
        "text": " tendríamos que haber hecho el análisis, corresponde, este sería el bloque de 0 y haría mucho el análisis de bloque de valor propio 3, tenemos que hacer el análisis, ver cómo es la forma de se ordan asosciada,",
        "start": 3309.4,
        "end": 3325.4
    },
    {
        "text": " claro, o sea hago las cuentas con el análisis, y después le sumo 3, 3, 3, 3, 4, 5, 5 y 5, la llevamos, bueno, gurises vamos arriba,",
        "start": 3325.4,
        "end": 3348.4
    },
    {
        "text": " estamos, nos vamos a caile de Hamilton, bueno, que grande, poder demostrar caile de Hamilton, le vienen a dejar un deber a Gabriel para la clase del verde,",
        "start": 3348.4,
        "end": 3368.4
    },
    {
        "text": " lee un poquito de caile, dejadme un poquito, en qué fechas nacieron, donde vivieron, y en más o menos en qué pocas demostraron el teoremate,",
        "start": 3368.4,
        "end": 3380.4
    },
    {
        "text": " mínimo, mínimo, para saber la matemática de que estamos discutiendo de qué pocas, y donde trabajaban también, en qué académico trabajó,",
        "start": 3380.4,
        "end": 3393.4
    },
    {
        "text": " de animar, Gabriel, bueno, le doy lo junto, ahora ponemos la tesis, el famoso teoremate caile de Hamilton,",
        "start": 3393.4,
        "end": 3406.4
    },
    {
        "text": " una matriz sobre, parece kilogramos, sobre el cuerpo ca, y sea, si suadrete el soporteño que era el teoremate,",
        "start": 3406.4,
        "end": 3420.4
    },
    {
        "text": " la matriz cuadrada de Niporene, sobre el cuerpo ca, que más iba a destacar algo más, pero,",
        "start": 3420.4,
        "end": 3430.4
    },
    {
        "text": " ah, sí, acá estamos escribiendo el tema de caile de Hamilton con la matriz, pero si alguien, o otro libro, o nosotros mismos,",
        "start": 3430.4,
        "end": 3439.4
    },
    {
        "text": " en algún momento lo hacemos con una transformación lineana, es lo mismo, porque la transformación lineal, fide, vende, alcanza,",
        "start": 3439.4,
        "end": 3445.4
    },
    {
        "text": " con tomar entonces, es una base y tomar su matriz, o sea, ponen el intercumulo,",
        "start": 3445.4,
        "end": 3451.4
    },
    {
        "text": " si el tema de acá es el hija de Hamilton, lo ponen en Google y te aparece que dice, se ha fui una transformación lineal y si suadete,",
        "start": 3451.4,
        "end": 3458.4
    },
    {
        "text": " determinante de él, siendo a la matriz social, él lo mismo, o sea, sabemos que el tema de la matriz y transformación",
        "start": 3458.4,
        "end": 3465.4
    },
    {
        "text": " es lineal, es como una base fija, él lo mismo, es el mismo, la misma compresión, y lo que dice el teoremate caile de Hamilton,",
        "start": 3465.4,
        "end": 3472.4
    },
    {
        "text": " el el dejamento es famoso, que lo venimos, es que si suadete, es 0, que el polión, mi ocará el terístico, el lúnal de operador,",
        "start": 3472.4,
        "end": 3484.4
    },
    {
        "text": " y una vez más repaso, no podemos poner a acá dentro, en lugar de la T, porque no tiene sentido,",
        "start": 3484.4,
        "end": 3492.4
    },
    {
        "text": " esto T por I es el producto constante por matriz, T por I es constante un número del cuerpo real complejo,",
        "start": 3492.4,
        "end": 3504.4
    },
    {
        "text": " clacional, por la matriz identidad, si pusiera la A esto es matriz por matriz, es otro producto que no tiene que dar,",
        "start": 3504.4,
        "end": 3513.4
    },
    {
        "text": " entonces no podemos sustituir ahí nomás, no es así, y sin embargo vale que da ser, es el famoso terema de Calejane,",
        "start": 3513.4,
        "end": 3520.4
    },
    {
        "text": " vamos a demostrar, mucho tiempo que lo, y es muy sencilla la demostración, ahora con todas las técnicas que hemos logrado,",
        "start": 3520.4,
        "end": 3534.4
    },
    {
        "text": " entonces primero que nada se ajota la matriz de Jordan, asociada a la matriz,",
        "start": 3534.4,
        "end": 3544.4
    },
    {
        "text": " que quiere decir que para una base de Jordan la matriz de la asociada es Ej,",
        "start": 3544.4,
        "end": 3560.4
    },
    {
        "text": " dicho de otra manera, tienes una matriz de cambio de base de tal forma que Ej, P, la menos 1 a P,",
        "start": 3560.4,
        "end": 3569.4
    },
    {
        "text": " o sea a Ej, son 11 mejantes, P es la matriz de cambio de base, que base, no sé, no sé,",
        "start": 3570.4,
        "end": 3580.4
    },
    {
        "text": " nosotros ya sabemos que podemos construir una base que es la base de Jordan, y por lo tanto la cambia es la base y la matriz de cambio de base es invertible,",
        "start": 3580.4,
        "end": 3587.4
    },
    {
        "text": " ya sabemos todo eso de Calú, única el base, P es la matriz de cambio de base,",
        "start": 3587.4,
        "end": 3592.4
    },
    {
        "text": " entonces el polinomio característico de A evaluado en A, primer paso, sustituyo a diacáxicos podemos espejar a no,",
        "start": 3593.4,
        "end": 3607.4
    },
    {
        "text": " o sea así como puse que J, P es la menos 1 a P, A es P, J, P es la menos 1, o cierto, y de P es J,",
        "start": 3608.4,
        "end": 3616.4
    },
    {
        "text": " entonces me queda C, SuA, D, J, P es la menos 1, o sea hay un error de U,",
        "start": 3616.4,
        "end": 3622.4
    },
    {
        "text": " la matriz de la mano mejor tiene imediatamente, y acá ya que Alexander a Novino,",
        "start": 3622.4,
        "end": 3628.4
    },
    {
        "text": " en todas las clases le vamos a recordar Sara y Nacho, ¿qué es esto de Si SuA, D, A o Si SuA, D, P es J, P es la menos 1,",
        "start": 3629.4,
        "end": 3639.4
    },
    {
        "text": " o qué es lo que tengo que hacer, agarro el característico y qué es lo que tengo que hacer,",
        "start": 3639.4,
        "end": 3643.4
    },
    {
        "text": " reemplazo en lugar de el polinomio característico está en T, variable T, le pongo A, si es 7 cuadrado,",
        "start": 3646.4,
        "end": 3657.4
    },
    {
        "text": " a cuadrado, ¿no verdad? Si dice T, A, la 5, A, la 5, y acá lo mismo, ¿no verdad?",
        "start": 3659.4,
        "end": 3665.4
    },
    {
        "text": " Eso es lo que quiere decir que el polinomio anula la transformación lineal o la matriz,",
        "start": 3665.4,
        "end": 3670.4
    },
    {
        "text": " bien, pero a ver, pensemos juntos, si en lugar de T pongo, P es J, P es la menos 1,",
        "start": 3671.4,
        "end": 3678.4
    },
    {
        "text": " en lugar de T cuadrado, ¿qué pongo?",
        "start": 3679.4,
        "end": 3683.4
    },
    {
        "text": " ¿por qué? Porque cuando ponga P es J, P es la menos 1, P es J, P es la menos 1, se va a en lo del medio, ¿cierto?",
        "start": 3684.4,
        "end": 3694.4
    },
    {
        "text": " Ah, entonces en todos lados va a pasar lo mismo, entonces esto es P, ¿no verdad?",
        "start": 3695.4,
        "end": 3707.4
    },
    {
        "text": " ¿A alguien puede decir, no aprofegir y el término independiente me está haciendo Trump, ¿qué pasa con el término independiente?",
        "start": 3707.4,
        "end": 3713.4
    },
    {
        "text": " ¿Por qué el polinomio puede tener un término independiente?",
        "start": 3714.4,
        "end": 3718.4
    },
    {
        "text": " 8, ¿cómo hacíamos con el término independiente? ¿cabríes?",
        "start": 3720.4,
        "end": 3725.4
    },
    {
        "text": " 8 veces sin entidad, eso 8 por el término solo, saco un término independiente, que de 8 en el medio, exactamente,",
        "start": 3728.4,
        "end": 3734.4
    },
    {
        "text": " 8 veces se le entidan en el medio, exactamente, también este truco, son 4 trucos y si me mostramos cae leja,",
        "start": 3735.4,
        "end": 3742.4
    },
    {
        "text": " este es el primero, quedo claro, entonces para demostrar que esto da 0, tengo que demostrar que este 0,",
        "start": 3743.4,
        "end": 3749.4
    },
    {
        "text": " ya chique la cosa, porque demostrarlo para la matriz, ya sea más fácil, bien, vamos a otros pasitos más,",
        "start": 3750.4,
        "end": 3757.4
    },
    {
        "text": " bien, ahora que pasa, yo afirmo a firmación intermedia y vamos a demostrar esta firmación que el polinomio carácterístico asociado va,",
        "start": 3757.4,
        "end": 3764.4
    },
    {
        "text": " es igual al polinomio carácterístico asociado a J, es otra cosa distinta ¿no?",
        "start": 3765.4,
        "end": 3771.4
    },
    {
        "text": " acá lo que dije es que el polinomio carácterístico asociado, no hay evaluado nada, lo mismo que va, bueno, no es lo mismo,",
        "start": 3771.4,
        "end": 3777.4
    },
    {
        "text": " da el evaluado a J por p y p y no es 1, va, ahora afirmo que estos 2 carácterísticos son iguales, este truco ya lo hicimos en práctico,",
        "start": 3778.4,
        "end": 3796.4
    },
    {
        "text": " alguna vez, pero vamos a hacerlo detenidamente, entonces poco demostración, quita de la firmación,",
        "start": 3796.4,
        "end": 3802.4
    },
    {
        "text": " el xisuadet es el determinante de A, menos T dc por la identidad, que es el determinante,",
        "start": 3803.4,
        "end": 3816.4
    },
    {
        "text": " acá hago dos pasos en 1, porque ya estamos acostumbrados, el lugar de A pongo pejo tapela menos 1,",
        "start": 3817.4,
        "end": 3824.4
    },
    {
        "text": " y el lugar de T por la identidad pongo lo que dijo Gabriel recién, P, si quieren por la identidad por P y la menos 1,",
        "start": 3825.4,
        "end": 3834.4
    },
    {
        "text": " entonces saco este factor común dentro del paréntesis P, J menos T dc es la identidad,",
        "start": 3835.4,
        "end": 3847.4
    },
    {
        "text": " P, la menos 1, y este truco también ya me lo dijeron muchas veces, ¿qué pasa con el determinante del producto?",
        "start": 3848.4,
        "end": 3855.4
    },
    {
        "text": " Es el determinante de P, el del medio que queda, justamente si su j de T, ¿no verdad?",
        "start": 3861.4,
        "end": 3870.4
    },
    {
        "text": " El carácterístico asociado a J, y el determinante de P, la menos 1, y Alexandra,",
        "start": 3871.4,
        "end": 3880.4
    },
    {
        "text": " la primera pregunta para tiene el curso, ¿qué pasa con el determinante de P y el determinante de P, la menos 1?",
        "start": 3880.4,
        "end": 3884.4
    },
    {
        "text": " Es 1, acá ya estamos en números, y los números con mutan, ya se nos salimos del tema de la matricieta,",
        "start": 3884.4,
        "end": 3892.4
    },
    {
        "text": " los números entonces este con este se va y nos queda si su j de T, hemos probado la firmación segundo truco de Caileja,",
        "start": 3893.4,
        "end": 3901.4
    },
    {
        "text": " ya vamos a chicando la cosa, entonces me voy al pizarro de la izquierda, otro roro idáctico,",
        "start": 3901.4,
        "end": 3909.4
    },
    {
        "text": " nunca te vas a hacer de la derecha de la izquierda, en las pizarrores, ¿por qué se supone que se azarabra?",
        "start": 3909.4,
        "end": 3919.4
    },
    {
        "text": " Porque se supone que escribimos la izquierda de derecha.",
        "start": 3919.4,
        "end": 3925.4
    },
    {
        "text": " Entonces, ¿qué quiero probar? Fáltalo en un par de pasitos chiquitos, quiero probar, quiero probar que si suade a es 0,",
        "start": 3950.4,
        "end": 3963.4
    },
    {
        "text": " pero si suade a, resumenta que es lo mismo que si su j de a, acá vamos a probar que los ponen en los iguales,",
        "start": 3963.4,
        "end": 3972.4
    },
    {
        "text": " y por otro lado si suade a es lo mismo que p, o si suade j por p de la menos 1, pero más aún,",
        "start": 3972.4,
        "end": 3988.4
    },
    {
        "text": " voy a usar esta parte y la otra parte debe usar mejor, si quiero probar que esto es 0, entonces alcanza con probar",
        "start": 3988.4,
        "end": 4000.4
    },
    {
        "text": " alcanza y es la más desequivalente que si suade j es 0, ¿cierto? Porque si el del medio es 0, entonces todo es 0,",
        "start": 4001.4,
        "end": 4012.4
    },
    {
        "text": " y además como su invertible esto es en realidad es un si suade sin, ¿no? Si suade a, si suade a, si suade j es 0,",
        "start": 4012.4,
        "end": 4019.4
    },
    {
        "text": " pero si suade j, ahora sí voy a usar lo que acabamos de mostrar en la firmación, si suade j es lo mismo que si su j de j,",
        "start": 4019.4,
        "end": 4028.4
    },
    {
        "text": " porque los polinesios son los mismos, por lo tanto necesito para terminar, necesito probar que si su j de j es 0,",
        "start": 4028.4,
        "end": 4040.4
    },
    {
        "text": " o sea, desde el punto de instalógico lo que estaríamos diciendo es, para probar Caile Hamilton alcanza con probar Caile Hamilton para matriz de Jordan,",
        "start": 4040.4,
        "end": 4050.4
    },
    {
        "text": " y lo que acabamos de decir, porque si lo probas para matriz de una forma de Jordan cualquiera lo tienes que probar en general,",
        "start": 4050.4,
        "end": 4057.4
    },
    {
        "text": " y ahora para la forma de Jordan un par de trucos más y se termino, alcanza con probar que si su j de j es 0,",
        "start": 4057.4,
        "end": 4064.4
    },
    {
        "text": " pero las formas de Jordan lo tienen ahí dibujado, lo hemos hecho muchas veces, la matriz de Jordan tienen todos sus bloques de Jordan, ¿no?",
        "start": 4064.4,
        "end": 4076.4
    },
    {
        "text": " Entonces supongamos, en vez de hacer 80 bloques de Jordan vamos a hacer 2 para que sentí en el proceso,",
        "start": 4076.4,
        "end": 4083.4
    },
    {
        "text": " que la matriz de Jordan tiene 2 bloques, se pararon 2 bloques de Jordan cada uno, ¿no?",
        "start": 4083.4,
        "end": 4089.4
    },
    {
        "text": " No es necesario que tengas solo 2, porque si fueran 88,4 para arriba, 4 para abajo, si fueran 75,",
        "start": 4089.4,
        "end": 4097.4
    },
    {
        "text": " 73 para arriba y 2 para abajo, no importa, la edición que quieran, cortas en 2, la gran matriz, la cortas en 2 bloques que también sean de Jordan, ¿ok?",
        "start": 4097.4,
        "end": 4108.4
    },
    {
        "text": " Entonces apóquese a entienda a esto que hacemos separando en 2, se puede repetirlo, repetirlo, repetirlo, repetirlo, ¿ya está?",
        "start": 4108.4,
        "end": 4113.4
    },
    {
        "text": " Bueno, ¿qué pasa? Yo afirmo esto y es bastante no fácil, pero si lo piensa en un poquito, creo que van a estar convencidos.",
        "start": 4113.4,
        "end": 4126.4
    },
    {
        "text": " El polimio característico de J es el producto de los características, pensemos juntos.",
        "start": 4126.4,
        "end": 4137.4
    },
    {
        "text": " A ver, ¿cómo era esto un profesivo tenés el J se parte en 2, 0, 0, J1, J2?",
        "start": 4137.4,
        "end": 4146.4
    },
    {
        "text": " Cada uno en su cuadrado, lo le vas al cubo, cada uno en su cuadrado, lo le vas a la 7, cada uno en su cuadrado,",
        "start": 4147.4,
        "end": 4154.4
    },
    {
        "text": " la resta 5 veces el J a la 3, cada uno actúa en su mundo en su cuadrado.",
        "start": 4154.4,
        "end": 4163.4
    },
    {
        "text": " Entonces cuando hace el característico, lo que te está diciendo que hagas el polinomio, 8 veces te al cubo, lo haces con cada uno,",
        "start": 4163.4,
        "end": 4172.4
    },
    {
        "text": " porque cada uno vive en su mundo, J1 por un lado no se toca con J2 y J2 por lo que cuando se hace el producto de las matrices,",
        "start": 4172.4,
        "end": 4181.4
    },
    {
        "text": " J1 con J1, J2 con J2, ¿cierto? Entonces cuando hagas el característico al final de las cuentas, ¿vogás haciendo las cuentas acá?",
        "start": 4181.4,
        "end": 4191.4
    },
    {
        "text": " Y acá por separada ¿no verdad? Y entonces el determinante, el que se determinante te queda el producto de las 2,",
        "start": 4192.4,
        "end": 4200.4
    },
    {
        "text": " te lo hago del determinante ¿Está bien? Entonces veanlo por favor, chequenlo por favor, pero en definitiva",
        "start": 4200.4,
        "end": 4210.4
    },
    {
        "text": " ¿por qué te queda el producto de la 1?",
        "start": 4222.4,
        "end": 4227.4
    },
    {
        "text": " Perdón, esto era más sencillo, la explicación que le di era para la otra parte, ¿discuto?",
        "start": 4227.4,
        "end": 4233.4
    },
    {
        "text": " En esto es más sencillo, que si su J de T es el 1 de T por si su J2 de T es más sencillo,",
        "start": 4233.4,
        "end": 4240.4
    },
    {
        "text": " es el determinante, cuando hace el determinante de 2 bloque, es el determinante cada bloque, ¿sí?",
        "start": 4240.4,
        "end": 4245.4
    },
    {
        "text": " Perdón, me fui a la explicación de la siguiente parte, les discuto, este evidente, esto porque se acuerdan el determinante,",
        "start": 4246.4,
        "end": 4254.4
    },
    {
        "text": " la resta es la fundamentalidad para hacer el determinante, tener 0, hacer el determinante, y más, camí de le preguntó a Fagundo,",
        "start": 4254.4,
        "end": 4262.4
    },
    {
        "text": " le dijo ¿cómo hiciste el desarrollo ahí? Bueno lo mismo, ¿a qué se saca?",
        "start": 4262.4,
        "end": 4266.4
    },
    {
        "text": " El resto 0, o sea, desarrollas por líneo lo que quieran, o sea, esta parte es evidente,",
        "start": 4267.4,
        "end": 4273.4
    },
    {
        "text": " yo me fui a la explicación de la siguiente parte, porque ahora que ya desarmaste esto, ahora bien este otro truco,",
        "start": 4273.4,
        "end": 4280.4
    },
    {
        "text": " si se dan cuenta, ya tengo desarmado por bloques, en la SEW índice, lo único que necesito ahora que pasa",
        "start": 4280.4,
        "end": 4290.4
    },
    {
        "text": " cuando miró así, j1, majotados, esto es lo que yo quería decirle cada uno de su cuadrado, lo que viene ahora,",
        "start": 4291.4,
        "end": 4300.4
    },
    {
        "text": " pues tenés un polinomio, que lo evaluase en la matriz jota que tiene esta forma, que se escribe j1 majotados,",
        "start": 4304.4,
        "end": 4311.4
    },
    {
        "text": " no, su madre directa, cada operación que ases en el polinomio, la se es por separado,",
        "start": 4311.4,
        "end": 4317.4
    },
    {
        "text": " te alcubo, te alas 5, etcétera, esto es lo que yo quería decirle es lo mismo que,",
        "start": 4318.4,
        "end": 4322.4
    },
    {
        "text": " y su jota, le j1, este, más, en este caso es más, a ver, más allá, y su jota,",
        "start": 4322.4,
        "end": 4337.4
    },
    {
        "text": " viejotados, este más chico, este más, porque a la matriz la vas trabajando,",
        "start": 4337.4,
        "end": 4345.4
    },
    {
        "text": " lo que hablo que por separado, porque entre sí no se mezcla, se salcubo, a la 8,",
        "start": 4345.4,
        "end": 4350.4
    },
    {
        "text": " todo lo que te diga el polinomio, que tienes que hacerle ajotas, se lo hace j1,",
        "start": 4350.4,
        "end": 4355.4
    },
    {
        "text": " y se lo hace ajotados, y el resultado, lo ponés en cada uno de su cuadrado.",
        "start": 4355.4,
        "end": 4359.4
    },
    {
        "text": " Bueno, muy bien, y entonces, esto, ahora utilizo esto que está acá,",
        "start": 4360.4,
        "end": 4374.4
    },
    {
        "text": " si su jota este es el producto de los dos, lo utilizo para cada uno y me queda,",
        "start": 4374.4,
        "end": 4380.4
    },
    {
        "text": " si su jota 1, de jota 1, por, si su jota 2, de jota 1,",
        "start": 4381.4,
        "end": 4391.4
    },
    {
        "text": " más, si su jota 1, de jota 2, por, si su jota 2, de jota 2.",
        "start": 4392.4,
        "end": 4405.4
    },
    {
        "text": " ¿Qué quiero probar que cero? Yo quiero probar que esto es cero, lo pongo en rojo para que se vea.",
        "start": 4411.4,
        "end": 4418.4
    },
    {
        "text": " Quiero probar que esto es cero, pongamos un signo de interrodación,",
        "start": 4418.4,
        "end": 4425.4
    },
    {
        "text": " alcanza con probar que cada uno de los dos bloques, de cada uno de los dos,",
        "start": 4425.4,
        "end": 4430.4
    },
    {
        "text": " sumando directos, es cero, entonces lo que vamos a probar que sigri en el sasave,",
        "start": 4430.4,
        "end": 4435.4
    },
    {
        "text": " que este alcanza a probar este cero y que este es cero.",
        "start": 4436.4,
        "end": 4444.4
    },
    {
        "text": " No terminé todavía, pero falta solo patir el penal para terminar la demostración,",
        "start": 4444.4,
        "end": 4449.4
    },
    {
        "text": " pero antes de patir el penal, pensemos juntos. ¿Qué fue lo que hizo el profe?",
        "start": 4449.4,
        "end": 4455.4
    },
    {
        "text": " Paso 1, para demostrar Cali Hamilton alcanza con demostrar Cali Hamilton",
        "start": 4455.4,
        "end": 4462.4
    },
    {
        "text": " para las formas de lloran. ¿Por qué? Porque si proba que este es cero, si suade a cero.",
        "start": 4463.4,
        "end": 4470.4
    },
    {
        "text": " Paso 2, ahora desarmamos en 2, pero si es en 2, lo pongo desarmado de vuelta y de vuelta y de vuelta o en vez de 2,",
        "start": 4471.4,
        "end": 4479.4
    },
    {
        "text": " lo hice en 2 para que se vea, dirácticamente, pero lo podríamos haber hecho en 17,",
        "start": 4479.4,
        "end": 4483.4
    },
    {
        "text": " en bloques o en 48, lo que se ha necesario describir,",
        "start": 4483.4,
        "end": 4486.4
    },
    {
        "text": " lo que estoy mostrando es alcanza con probar que el teorema de Cali Hamilton vale para cada bloquecito de lloran,",
        "start": 4487.4,
        "end": 4496.4
    },
    {
        "text": " para cada bloquecito de lloran. O sea que y eso es esta disalición en práctico,",
        "start": 4497.4,
        "end": 4506.4
    },
    {
        "text": " pero por la duela vamos a decir alcanza con probar que este es cero, que este es cero,",
        "start": 4506.4,
        "end": 4511.4
    },
    {
        "text": " que cada uno de los bloquesitos es cero, pero para cerrar recuerden que el polinomio carácterístico,",
        "start": 4511.4,
        "end": 4520.4
    },
    {
        "text": " a un bloque cualquiera, Jr de landa, evaluante, cuantos vale justamente,",
        "start": 4520.4,
        "end": 4527.4
    },
    {
        "text": " T menos landa a la r.",
        "start": 4528.4,
        "end": 4535.4
    },
    {
        "text": " Cuando vos agarras el amaltriz y lloran, un bloque de lloran,",
        "start": 4536.4,
        "end": 4543.4
    },
    {
        "text": " cuando vos agras un bloque de lloran, ¿sí? ¿Qué quiere decir landa? La anda,",
        "start": 4544.4,
        "end": 4550.4
    },
    {
        "text": " la anda, la anda, la anda, una, uno, uno, uno, cero, cero, a reponerre.",
        "start": 4550.4,
        "end": 4555.4
    },
    {
        "text": " Y el determinante todo lo sabemos con toda,",
        "start": 4555.4,
        "end": 4559.4
    },
    {
        "text": " acá le estoy haciendo T menos landa a esa polidentidad,",
        "start": 4560.4,
        "end": 4565.4
    },
    {
        "text": " entonces esto me va a dar justamente T menos landa, el determinante landa,",
        "start": 4565.4,
        "end": 4568.4
    },
    {
        "text": " el elevado de la r. Este determinante es así.",
        "start": 4568.4,
        "end": 4571.4
    },
    {
        "text": " Y bueno, y si vos hacía el polinomio ahora, pero en vez de este tengo que poner",
        "start": 4572.4,
        "end": 4577.4
    },
    {
        "text": " quien Jr, Jr de landa menos landa por la identidad, el elevado de la r, ¿cuánto da?",
        "start": 4577.4,
        "end": 4586.4
    },
    {
        "text": " Cero, ¿por qué esto te quede? Le sacaste la diagonal y te quedo una matriz de la",
        "start": 4587.4,
        "end": 4592.4
    },
    {
        "text": " reportera de nivel de la hipotencia, r. Exactamente, esto es cero y se terminó",
        "start": 4592.4,
        "end": 4599.4
    },
    {
        "text": " cae de jaminito. ¿Cómo fue la demostración de cada mejá de mito? Vale para cualquier matriz,",
        "start": 4599.4,
        "end": 4604.4
    },
    {
        "text": " y solamente si vale para la lloran. Y después de ser más de todos los bloques de lloran",
        "start": 4604.4,
        "end": 4609.4
    },
    {
        "text": " en los pedacitos de lloran y después en cada pedacito es evidente,",
        "start": 4609.4,
        "end": 4613.4
    },
    {
        "text": " una cuenta que ya les vamos a hacer. ¿Entendió? Mágico y muy bonito también,",
        "start": 4613.4,
        "end": 4622.4
    },
    {
        "text": " el teoremaet. Se no fue la clase chico, cinco minutos pasado, arrancamos la clase que viene con todo",
        "start": 4622.4,
        "end": 4630.4
    },
    {
        "text": " el juego del polinomio minimal y bueno, desconegamos en posición espectral y método de cálculo de forma de lloran",
        "start": 4630.4,
        "end": 4638.4
    },
    {
        "text": " con ejemplos intermedios. Y ojalá podamos empezar con el límite de sucesiones de matrices.",
        "start": 4638.4,
        "end": 4644.4
    }
]