[
    {
        "text": " Bien.",
        "start": 0.0,
        "end": 21.18
    },
    {
        "text": " Nosotros dijimos que esta parte del curso tenía este módulo de la Lugar de América Latina",
        "start": 21.18,
        "end": 27.44
    },
    {
        "text": " y Uruguay tenía tres módulos, uno que era América Latina, otro que es globalización e",
        "start": 27.44,
        "end": 41.32
    },
    {
        "text": " integración y una última parte que es Uruguay.",
        "start": 41.32,
        "end": 53.84
    },
    {
        "text": " En la clase de hoy y en la clase del viernes nos vamos a dedicar a esta segunda parte del curso",
        "start": 53.84,
        "end": 61.32000000000001
    },
    {
        "text": " donde vamos a ver un poco qué es la globalización, cuáles son los conceptos, pero fundamentalmente",
        "start": 61.32000000000001,
        "end": 66.24000000000001
    },
    {
        "text": " nos vamos a concentrar en lo que es el proceso de integración y dentro de integración vamos",
        "start": 66.24000000000001,
        "end": 71.36
    },
    {
        "text": " a ver fundamentalmente lo que refiere a el Mercosur que es uno de los procesos más importantes",
        "start": 71.36,
        "end": 81.56
    },
    {
        "text": " de integración que tiene la región y que tiene nuestro país.",
        "start": 81.56,
        "end": 86.76
    },
    {
        "text": " Sí, todos estos procesos de la globalización y de la integración son procesos que tienen",
        "start": 86.76,
        "end": 93.68
    },
    {
        "text": " su dimensión económica y que tienen un impacto fortísimo a nivel de las economías.",
        "start": 93.68,
        "end": 98.4
    },
    {
        "text": " Por eso nos interesa en especial analizar las entonces nosotros nos vamos a hacer preguntas",
        "start": 98.4,
        "end": 105.2
    },
    {
        "text": " del estilo qué es la globalización, si es buena o es mala, como deben insertarse",
        "start": 105.2,
        "end": 135.08
    },
    {
        "text": " los países ante estos cambios, qué implica cuáles son los desafíos.",
        "start": 135.08,
        "end": 149.88000000000002
    },
    {
        "text": " Sí, en globalización nosotros vamos a ver primero que nada, cuáles son los antecedentes,",
        "start": 149.88,
        "end": 172.44
    },
    {
        "text": " es el concepto de globalización y los determinantes iras características de este proceso.",
        "start": 172.44,
        "end": 192.84
    },
    {
        "text": " En integración vamos a ver cuál es el concepto, cuáles son los procesos de integración",
        "start": 192.84,
        "end": 212.96
    },
    {
        "text": " relevantes en particular en la región y para Uruguay, ¿no?",
        "start": 212.96,
        "end": 228.52
    },
    {
        "text": " Pero no vamos a dejar de mencionar a otros porque en realidad ahora no solo es muy importante",
        "start": 228.52,
        "end": 232.8
    },
    {
        "text": " en los procesos de integración a nivel de la región sino que importan cómo esos bloques",
        "start": 232.8,
        "end": 236.68
    },
    {
        "text": " de integración se relacionan con otros bloques, no?",
        "start": 236.68,
        "end": 240.0
    },
    {
        "text": " Prosidentemente como que el proceso de las negociaciones que está haciendo el Mercosur",
        "start": 240.0,
        "end": 245.48000000000002
    },
    {
        "text": " con la Unión Europea son importantes. Y en particular yo voy a avanzar un poquito más",
        "start": 245.48000000000002,
        "end": 254.68
    },
    {
        "text": " y no sé si llegó hoy pero la gasa que viene seguro voy a distinguir entre el concepto",
        "start": 254.68,
        "end": 259.12
    },
    {
        "text": " de proceso de integración a diferencia del mecanismo de integración.",
        "start": 259.12,
        "end": 268.48
    },
    {
        "text": " Y si bien nos vamos a concentrar, en tercer punto en analizar que es el Mercosur, también",
        "start": 268.48,
        "end": 281.48
    },
    {
        "text": " vamos a mencionar cuáles son otros mecanismos de integración relevantes para Uruguay y también",
        "start": 281.48,
        "end": 295.0
    },
    {
        "text": " solo en la región. Y ¿por qué voy a distinguir proceso de integración?",
        "start": 295.0,
        "end": 299.40000000000003
    },
    {
        "text": " Porque yo me voy a animar a decirles que el único proceso fuerte de integración que",
        "start": 299.40000000000003,
        "end": 303.24
    },
    {
        "text": " vive Uruguay es el Mercosur. El resto son mecanismos porque no logran una integración",
        "start": 303.24,
        "end": 311.16
    },
    {
        "text": " real. Por ejemplo la aladi, por ejemplo la unasur, por ejemplo la cejip, otros ejemplos para",
        "start": 311.16,
        "end": 326.08000000000004
    },
    {
        "text": " que ustedes la oya etc. Para que ustedes dimensionen un poco cuáles son los acuerdos internacionales",
        "start": 326.08000000000004,
        "end": 335.56
    },
    {
        "text": " y intentos de procesos integracionistas más relevantes que vi Uruguay que algunos van",
        "start": 335.56,
        "end": 340.20000000000005
    },
    {
        "text": " con más éxito, otros van con menos éxito y que todos tienen sus dificultades. De",
        "start": 340.2,
        "end": 345.03999999999996
    },
    {
        "text": " hecho si es la noticia de ayer importante, ¿cuál fue?",
        "start": 345.03999999999996,
        "end": 348.64
    },
    {
        "text": " Ademas, el partido. Obvio esa fue la más importante. Pero sí le nos vuelven mundial. La",
        "start": 348.64,
        "end": 362.12
    },
    {
        "text": " de los lácteos. Venía una amenaza de una... Es más, nosotros les colgamos la presentación",
        "start": 362.12,
        "end": 368.59999999999997
    },
    {
        "text": " y actualizamos con Federico las últimas... O sea pusimos todos actualizados los últimos",
        "start": 368.6,
        "end": 374.08000000000004
    },
    {
        "text": " datos. Terminamos de preparar el curso hace pocos días. Terminamos de actualizar los datos",
        "start": 374.08000000000004,
        "end": 382.68
    },
    {
        "text": " de toda esta parte el fin de semana y habíamos puesto como ejemplo que Brasil estaba amenizando",
        "start": 382.68,
        "end": 389.64000000000004
    },
    {
        "text": " con poner una cuota de lácteos. Me quedo vieja la presentación porque en realidad cuando",
        "start": 389.64000000000004,
        "end": 394.52000000000004
    },
    {
        "text": " ven la parte de práctico la última parte dice bueno, era como un ejemplo para mostrarle",
        "start": 394.52,
        "end": 398.59999999999997
    },
    {
        "text": " las dificultades que se dan para concretar una integración plena porque cada país tiene",
        "start": 398.59999999999997,
        "end": 403.59999999999997
    },
    {
        "text": " sus intereses y el comercio internacional que a veces tiene más barreras, más distorsiones",
        "start": 403.59999999999997,
        "end": 409.64
    },
    {
        "text": " que a veces no solo van con las cuestiones a la arancelaria sino que tienen otra forma",
        "start": 409.64,
        "end": 414.2
    },
    {
        "text": " como las justificaciones sanitarias, la cuestión ambiental. Entonces ya ser prohíben el",
        "start": 414.2,
        "end": 424.15999999999997
    },
    {
        "text": " ingreso de lácteos de Uruguay a Brasil. Entonces el análisis se me agregó un detalle más.",
        "start": 424.16,
        "end": 431.16
    },
    {
        "text": " Entonces esto es muy dinámico. Bien. Entonces ese es un poco el panorama y ya no fue los",
        "start": 431.16,
        "end": 439.68
    },
    {
        "text": " adelantando en algunos conceptos. Bien. De materiales, ustedes van a tener las fichas que",
        "start": 439.68,
        "end": 451.04
    },
    {
        "text": " están recomendadas del año pasado. Después en la presentación, en las presentaciones que",
        "start": 451.04,
        "end": 455.84000000000003
    },
    {
        "text": " tienen van a tener más conceptos de los que están en las fichas porque están toda la información",
        "start": 455.84000000000003,
        "end": 460.40000000000003
    },
    {
        "text": " actualizada. Si nosotros, en vez de como ya les recomendamos mucho material adicional en",
        "start": 460.40000000000003,
        "end": 466.32000000000005
    },
    {
        "text": " América Latina y en Uruguay para actualizar los datos, para que no sea demasiado y en realidad",
        "start": 466.32000000000005,
        "end": 473.12
    },
    {
        "text": " queríamos destacar los conceptos vamos a dejarla solo en la ficha. Sí, pero, perdón,",
        "start": 473.12,
        "end": 478.40000000000003
    },
    {
        "text": " la ficha y la presentación. Lo que sí van a encontrar que en la presentación tienen alguna",
        "start": 478.4,
        "end": 484.28
    },
    {
        "text": " información adicional que no están en la ficha. O sea que tienen que estudiar los dos materiales.",
        "start": 484.28,
        "end": 489.2
    },
    {
        "text": " Lo que van a encontrar es una presentación muy detallada y muy escrita de forma tal de que",
        "start": 489.2,
        "end": 494.64
    },
    {
        "text": " tengan la información bastante completa. No es la más a menos presentación, es más que más",
        "start": 494.64,
        "end": 500.23999999999995
    },
    {
        "text": " un material de lectura. ¿De acuerdo? Bien. Vamos a ir ahora a analizar un poco esto del proceso de",
        "start": 500.23999999999995,
        "end": 507.91999999999996
    },
    {
        "text": " globalización. Si bien nos vamos a dar demasiado detalle, nos vamos a concentrar en alguno de los",
        "start": 507.92,
        "end": 516.48
    },
    {
        "text": " conceptos más importantes. Por eso, lo deje acá. Borro esto que después volvemos.",
        "start": 516.48,
        "end": 522.64
    },
    {
        "text": " Bueno, ¿cuál es a los principales antecedentes de la globalización?",
        "start": 522.64,
        "end": 539.6
    },
    {
        "text": " El primer antecedente fuerte es la internacionalización comercial.",
        "start": 539.6,
        "end": 557.6800000000001
    },
    {
        "text": " Así es del siglo XV y principios del siglo XVI. ¿Qué se da?",
        "start": 557.68,
        "end": 576.52
    },
    {
        "text": " Se dan los primeros procesos fuertes de capitalismo. Se da, se sientan las bases en materia de acumulación",
        "start": 576.52,
        "end": 592.8
    },
    {
        "text": " de capital. ¿Qué otro proceso fuerte se da? Y ese capital les fue a buscar otra frontera.",
        "start": 592.8,
        "end": 615.3599999999999
    },
    {
        "text": " ¿Qué otro proceso fuerte se da importante? La revolución industrial. Segunda mitad del siglo XVIII.",
        "start": 615.36,
        "end": 632.32
    },
    {
        "text": " Con la revolución industrial, el sistema capitalista se termina de instaurar. ¿Sí? ¿El sistema capitalista?",
        "start": 632.32,
        "end": 651.96
    },
    {
        "text": " ¿Y quién lidera este proceso? ¿Quién es el líder hegemónico del proceso? Lo dijimos",
        "start": 651.96,
        "end": 662.8000000000001
    },
    {
        "text": " en otro día. ¿Se acuerdan con ellos de América Latina? Dijimos que cambiaba el líder hegemónico desde",
        "start": 662.8,
        "end": 671.04
    },
    {
        "text": " la Terra de Reino Unido a Estados Unidos. En este momento, ¿dienes la Terra? ¿Qué es líder el",
        "start": 671.04,
        "end": 685.68
    },
    {
        "text": " sector manufacturero? Y es un país hegemónico, básicamente hasta la primera guerra mundial.",
        "start": 685.68,
        "end": 692.4
    },
    {
        "text": " ¿Y en esta época qué se da fuerte? ¿Es el auge del comercio internacional?",
        "start": 692.4,
        "end": 706.84
    },
    {
        "text": " Se da también fuerte la división internacional del trabajo. ¿Y hay un patrón de intercambio comercial?",
        "start": 706.84,
        "end": 731.5600000000001
    },
    {
        "text": " Bien definido. Surgen aquello de los exportadores por un lado de materia prima y por otro lado de productos",
        "start": 737.5600000000001,
        "end": 759.0400000000001
    },
    {
        "text": " manufacturados. Bien.",
        "start": 759.04,
        "end": 764.5999999999999
    },
    {
        "text": " Y aquí es donde se ha todo el proceso de expansión del sistema capitalista y de todo el proceso",
        "start": 764.6,
        "end": 786.52
    },
    {
        "text": " del colonialismo. ¿Qué son los antecedentes directos del proceso de globalización? Es recién el concepto de globalización como tal?",
        "start": 786.52,
        "end": 799.76
    },
    {
        "text": " Surge recién en el siglo XX. ¿Dónde el comercio internacional? ¿Es el factor determinante?",
        "start": 799.76,
        "end": 822.88
    },
    {
        "text": " ¿No? El factor fundamental queda origen a la globalización y a la internacionalización de la economía.",
        "start": 829.76,
        "end": 850.8
    },
    {
        "text": " El siglo XX está internacionalización de la economía cambia y se suman nuevos factores. ¿Cuáles son esos factores? ¿Eso factores son?",
        "start": 850.8,
        "end": 866.5999999999999
    },
    {
        "text": " La internacionalización productiva. La internacionalización tecnológica.",
        "start": 866.6,
        "end": 884.24
    },
    {
        "text": " La financiera y los aspectos culturales ideológicos. O sea, te suman dimensiones a ese proceso de internacionalización que antes estaba dado fundamentalmente por el comercio internacional.",
        "start": 884.24,
        "end": 909.16
    },
    {
        "text": " Empieza a cobrar otras dimensiones. Entonces, este nuevo proceso de internacionalización, ¿no? Es como una primera aproximación al concepto de globalización.",
        "start": 909.16,
        "end": 936.0799999999999
    },
    {
        "text": " ¿Es la internacionalización? En su máxima expresión.",
        "start": 939.16,
        "end": 950.7199999999999
    },
    {
        "text": " Con el tiempo, ese concepto empieza a evolucionar. Entonces, va cubrando como nuevas dimensiones o nuevos aspectos que van unidos a los cambios en las comunicaciones, que van unidos a los cambios en los medios de transporte, que van unidos en la internacionalización del capital y los aspectos financieros en las nuevas herramientas, en los propios procesos de integración que se van acentuando.",
        "start": 970.16,
        "end": 995.16
    },
    {
        "text": " De hecho, hoy los temas de comunicación son claves, ¿no? Bien. ¿Cuáles son las características o determinantes del proceso de globalización?",
        "start": 996.16,
        "end": 1017.16
    },
    {
        "text": " En primer lugar, es un proceso histórico. ¿Qué significa que es un proceso histórico? ¿Va cambiando a lo largo del tiempo? ¿No puede finalizar en un determinado momento, sino que se sigue expandiendo, sigue cambiando, sigue tomando nuevas dimensiones?",
        "start": 1018.16,
        "end": 1041.1599999999999
    },
    {
        "text": " Cuando empieza a surgir el concepto de globalización como tal, cada vez más parece que cambia más vertiginosamente.",
        "start": 1042.16,
        "end": 1050.16
    },
    {
        "text": " Pero es un concepto que va tomando características y se va modificando en función del tiempo. No se estanca.",
        "start": 1051.16,
        "end": 1061.16
    },
    {
        "text": " Segundo, seguimos hablando de internacionalización.",
        "start": 1062.16,
        "end": 1072.16
    },
    {
        "text": " Siempre en su máxima expresión.",
        "start": 1076.16,
        "end": 1080.16
    },
    {
        "text": " Y siempre a nivel productivo y en los distintos sectores de actividad.",
        "start": 1081.16,
        "end": 1091.16
    },
    {
        "text": " Segundario de los servicios financieros.",
        "start": 1092.16,
        "end": 1100.16
    },
    {
        "text": " Sí.",
        "start": 1100.16,
        "end": 1103.16
    },
    {
        "text": " Tercero. Necesariamente lleva una mayor interdependencia e interacción. Provoca, conduce a una interacción",
        "start": 1103.16,
        "end": 1118.16
    },
    {
        "text": " y interdependencia entre las economías.",
        "start": 1119.16,
        "end": 1124.16
    },
    {
        "text": " Cada vez más los países están interactual más, son más interdependentes.",
        "start": 1130.16,
        "end": 1136.16
    },
    {
        "text": " Las economías dependen más de lo que pasa entre sus vecinos o en otro lado del mundo.",
        "start": 1136.16,
        "end": 1142.16
    },
    {
        "text": " Un aspecto clave es el desarrollo en términos de transporte y comunicaciones.",
        "start": 1148.16,
        "end": 1162.16
    },
    {
        "text": " Sumado a esto todos los temas informáticos, todo lo digital, la red hoy.",
        "start": 1163.16,
        "end": 1176.16
    },
    {
        "text": " Y otro tema que no es menor no implica una integración homogénea.",
        "start": 1177.16,
        "end": 1190.16
    },
    {
        "text": " En todas las regiones, mi planeta y de todas.",
        "start": 1190.16,
        "end": 1199.16
    },
    {
        "text": " Hay desigualdades en los procesos de interacción y interdependencia.",
        "start": 1207.16,
        "end": 1212.16
    },
    {
        "text": " Depende de los más diversos factores.",
        "start": 1212.16,
        "end": 1215.16
    },
    {
        "text": " Hay economías a veces que no tienen la conexión a la red que tienen otras.",
        "start": 1220.16,
        "end": 1224.16
    },
    {
        "text": " Por ejemplo, hay economías que funcionan más como economías cerradas que otras.",
        "start": 1224.16,
        "end": 1230.16
    },
    {
        "text": " Por su tamaño, por su capacidad de tener una situación política, por su historia, por su geografía.",
        "start": 1231.16,
        "end": 1237.16
    },
    {
        "text": " Entonces, si ven en estos grandes conceptos hay las más diversas situaciones.",
        "start": 1237.16,
        "end": 1244.16
    },
    {
        "text": " Bien.",
        "start": 1244.16,
        "end": 1246.16
    },
    {
        "text": " Todos estos procesos de globalización, internacionalización, interacción cada vez más fuerte de las economías tienen los más diversos debates y posiciones a favor y en contra.",
        "start": 1255.16,
        "end": 1267.16
    },
    {
        "text": " Pero son procesos que de alguna forma y lo más importante es que son como irreversibles, sin ninguna economía puede negarse a ser parte de los hechos pasa eso.",
        "start": 1268.16,
        "end": 1279.16
    },
    {
        "text": " Entonces, la pregunta no es más, no es tanto si la globalización es buena o es mala. La pregunta para mí es más, ¿cuáles son los desafíos que tienen los países para enfrentar el proceso de globalización?",
        "start": 1279.16,
        "end": 1293.16
    },
    {
        "text": " ¿Cuáles son las condiciones que deben dar? ¿Cómo deben prepararse las economías, los sectores, las empresas, el Estado hasta la población misma para enfrentar este proceso de mayor globalización, de mayor interconnección, de mayor facilidad para el movimiento de los bienes y los servicios de los factores productivos hasta de los trabajadores mismos?",
        "start": 1294.16,
        "end": 1316.16
    },
    {
        "text": " Hay temas mucho más allá de si es bueno o si es malo. Son procesos que están presentes, que evolucionan y evolucionan cada vez más rápido y que es muy difícil que un país pueda que haya aislado.",
        "start": 1317.16,
        "end": 1332.16
    },
    {
        "text": " Es como negarse a tener internet.",
        "start": 1334.16,
        "end": 1337.16
    },
    {
        "text": " Y bueno, podrás ser malo estar todo el día conectado, pero también es una forma de comunicación, es tener un lugar en el mundo y en la sociedad.",
        "start": 1338.16,
        "end": 1346.16
    },
    {
        "text": " Si uno no tiene correo electrónico, imagínense, cómo no tener celular, es como rar.",
        "start": 1346.16,
        "end": 1352.16
    },
    {
        "text": " Los pocos que se negaron ya lo tienen seguro.",
        "start": 1353.16,
        "end": 1356.16
    },
    {
        "text": " A diferentes cálamos y mucho más compleja es el mismo tipo de razonamiento.",
        "start": 1358.16,
        "end": 1362.16
    },
    {
        "text": " El tema es cómo las economías se preparan o qué condiciones se generan para enfrentar esos procesos.",
        "start": 1363.16,
        "end": 1368.16
    },
    {
        "text": " Entonces, surge el tema de cuáles son los grandes debates y desafíos que surge en a través del proceso de globalización y que también van cambiando con el tiempo.",
        "start": 1370.16,
        "end": 1386.16
    },
    {
        "text": " Tradicionalmente hay como dos visiones extremas y todas las que quieran en el medio.",
        "start": 1387.16,
        "end": 1394.16
    },
    {
        "text": " Por un lugar, por una parte a que ellos dicen que la globalización es buena.",
        "start": 1399.16,
        "end": 1404.16
    },
    {
        "text": " Y es buena por qué, básicamente, por el concepto de que provoca convergencia entre los países y entre las distintas economías.",
        "start": 1405.16,
        "end": 1418.16
    },
    {
        "text": " Convergencia entre aquellos países que tienen diferente nivel de desarrollo.",
        "start": 1418.16,
        "end": 1425.16
    },
    {
        "text": " Que tienen diferente nivel de desarrollo.",
        "start": 1426.16,
        "end": 1432.16
    },
    {
        "text": " Yo les diría que difícil está para concretarse eso como tal.",
        "start": 1443.16,
        "end": 1448.16
    },
    {
        "text": " No se ha verificado en todos estos años.",
        "start": 1450.16,
        "end": 1453.16
    },
    {
        "text": " De que esto necesariamente ocurre.",
        "start": 1456.16,
        "end": 1458.16
    },
    {
        "text": " ¿Cuáles son los factores que según esta teoría estarían jugando a favor de esta convergencia?",
        "start": 1459.16,
        "end": 1467.16
    },
    {
        "text": " Fundamentalmente el rol de la inversión extranjera directa.",
        "start": 1471.16,
        "end": 1476.16
    },
    {
        "text": " El movimiento de capital.",
        "start": 1479.16,
        "end": 1481.16
    },
    {
        "text": " La colaboración científica tecnológica.",
        "start": 1485.16,
        "end": 1488.16
    },
    {
        "text": " Por otro lado, están los que dicen que es mala.",
        "start": 1499.16,
        "end": 1503.16
    },
    {
        "text": " Acuérdense que dijimos que eran los extremos en el medio de las más diversas posiciones.",
        "start": 1504.16,
        "end": 1509.16
    },
    {
        "text": " Porque siempre es desigual.",
        "start": 1510.16,
        "end": 1513.16
    },
    {
        "text": " Y entonces, si es desigual, los países subdesarrrollados.",
        "start": 1519.16,
        "end": 1527.16
    },
    {
        "text": " Son más vulnerables.",
        "start": 1531.16,
        "end": 1533.16
    },
    {
        "text": " Y están más acotados de poder y tienen menos autonomía para tomar decisiones.",
        "start": 1540.16,
        "end": 1547.16
    },
    {
        "text": " Entonces, se acuaran que cuando vimos el tema de la idea, también tenía que yo de la sepa.",
        "start": 1548.16,
        "end": 1554.16
    },
    {
        "text": " En realidad, tienen las entuars.",
        "start": 1554.16,
        "end": 1556.16
    },
    {
        "text": " En realidad, ni una cosa ni la otra.",
        "start": 1558.16,
        "end": 1560.16
    },
    {
        "text": " Se dan de los dos tipos de procesos.",
        "start": 1560.16,
        "end": 1563.16
    },
    {
        "text": " Son procesos que se dan en la realidad y en realidad las economías, los estados, las empresas.",
        "start": 1564.16,
        "end": 1570.16
    },
    {
        "text": " Tienen que ver cómo los enfrentan para poder capitalizados.",
        "start": 1570.16,
        "end": 1574.16
    },
    {
        "text": " Hay economías que están en mejores condiciones que otras.",
        "start": 1576.16,
        "end": 1579.16
    },
    {
        "text": " Hay economías que han podido hacer procesos de desarrollo que acompañan",
        "start": 1581.16,
        "end": 1585.16
    },
    {
        "text": " de la procesos de internacionalización, de globalización, de poder orientar la inversión,",
        "start": 1586.16,
        "end": 1590.16
    },
    {
        "text": " de poder hacer colaboración científica tecnológica.",
        "start": 1591.16,
        "end": 1594.16
    },
    {
        "text": " Y también hay otras procesos que son parte de las procesas de integración que tienen que ver con todo lo que es la cooperación internacional.",
        "start": 1594.16,
        "end": 1600.16
    },
    {
        "text": " Los acuerdos de cooperación internacional están orientados de alguna manera a favorecer entre tomar",
        "start": 1602.16,
        "end": 1611.16
    },
    {
        "text": " de los que están más desarrollados y a los que están men.",
        "start": 1612.16,
        "end": 1615.16
    },
    {
        "text": " De diferentes formas que se están procesos que se están desatando.",
        "start": 1615.16,
        "end": 1620.16
    },
    {
        "text": " Y cada vez cobran más relevancia.",
        "start": 1620.16,
        "end": 1622.16
    },
    {
        "text": " Sea nivel comercial, sea nivel científico tecnológica, sea en ayúas humanitarias, sea institucional.",
        "start": 1622.16,
        "end": 1630.16
    },
    {
        "text": " Pero en la teoría económica más tradicional, las dos posiciones más extremas van desde los que dicen.",
        "start": 1634.16,
        "end": 1640.16
    },
    {
        "text": " Es buena ayuda a la convergencia, es un proceso y a otras que dicen es mala.",
        "start": 1641.16,
        "end": 1645.16
    },
    {
        "text": " Asentúan los desequilibrios, asentúan las diferencias entre las regiones y entre los países.",
        "start": 1646.16,
        "end": 1650.16
    },
    {
        "text": " Existen un conjunto de asimetrías y heterogeneidades entre los países, entre países y androregiones,",
        "start": 1671.16,
        "end": 1677.16
    },
    {
        "text": " que son características que vienen de la antigua división internacional del trabajo,",
        "start": 1677.16,
        "end": 1684.16
    },
    {
        "text": " que van cobrando nuevas dimensiones y nuevas dimensiones.",
        "start": 1688.16,
        "end": 1693.16
    },
    {
        "text": " Entonces, a esto, deben sumarse nuevos procesos, que cada vez más en los tiempos actuales son cada vez más relevantes.",
        "start": 1693.16,
        "end": 1698.16
    },
    {
        "text": " Por un lado, la globalización financiera.",
        "start": 1698.16,
        "end": 1701.16
    },
    {
        "text": " Los capitales ahora son capitales globales.",
        "start": 1724.16,
        "end": 1728.16
    },
    {
        "text": " El rol que cumple una gente que pasa a ser fundamental, que son las empresas transnacionales.",
        "start": 1732.16,
        "end": 1740.16
    },
    {
        "text": " No son de ningún país en particular, son de todos, son globales.",
        "start": 1741.16,
        "end": 1746.16
    },
    {
        "text": " Estas empresas transnacionales, cada vez son más importantes en su rol a nivel de la producción y del comercio mundial.",
        "start": 1747.16,
        "end": 1752.16
    },
    {
        "text": " ¿Cuántas veces hay empresas que eran nacionales y que ahora son parte de un capital globales? ¿Son parte de una empresa transnacional?",
        "start": 1771.16,
        "end": 1778.16
    },
    {
        "text": " ¿Se producen desplazamientos de actividades?",
        "start": 1791.16,
        "end": 1795.16
    },
    {
        "text": " ¿En busca de menores costos?",
        "start": 1801.16,
        "end": 1806.16
    },
    {
        "text": " ¿Un ejemplo de esto?",
        "start": 1815.16,
        "end": 1817.16
    },
    {
        "text": " ¿Eh? China. ¿Con qué?",
        "start": 1820.16,
        "end": 1823.16
    },
    {
        "text": " ¿La producción en China? ¿En qué formas, por ejemplo, se le ocurre?",
        "start": 1824.16,
        "end": 1829.16
    },
    {
        "text": " Y la fabricación las en China, o ahora surgen también Indonesia, India. ¿Cuántas marcas hay?",
        "start": 1839.16,
        "end": 1846.16
    },
    {
        "text": " A ver, de hombres se venas, pero de chicas. ¿Cuáles son las casas así que más?",
        "start": 1846.16,
        "end": 1852.16
    },
    {
        "text": " Hay poca variedad, sino...",
        "start": 1854.16,
        "end": 1856.16
    },
    {
        "text": " ¿Para conocidas, como siempre, todos?",
        "start": 1856.16,
        "end": 1859.16
    },
    {
        "text": " Todas, no solamente se da en las grandes marcas internacionales, pero acá en Montevideo si van al shopping, por 18 Julio o cualquiera las casas las contamos con los dedos y no llegamos los dos.",
        "start": 1859.16,
        "end": 1871.16
    },
    {
        "text": " Dañen casas, límites, pongo ejemplo de mujeres, son desobias.",
        "start": 1871.16,
        "end": 1876.16
    },
    {
        "text": " ¿No?",
        "start": 1877.16,
        "end": 1878.16
    },
    {
        "text": " Muchos son diseños nacionales o diseños que los mandan a ser a Europa o Estados Unidos y las fabricaciones en China.",
        "start": 1879.16,
        "end": 1886.16
    },
    {
        "text": " Y dentro de China no es en cualquier lugar, no es lo mismo, Beijing, que es carísimo, cualquier cosa que ustedes quieran comprar en Beijing es imposible.",
        "start": 1886.16,
        "end": 1895.16
    },
    {
        "text": " Yo fui el año pasado y que impactadísima, no era imposible.",
        "start": 1895.16,
        "end": 1899.16
    },
    {
        "text": " Este...",
        "start": 1900.16,
        "end": 1902.16
    },
    {
        "text": " Ouanzo, que es donde están, por ejemplo, zonas de las grandes fábricas o otros lugares en China.",
        "start": 1902.16,
        "end": 1908.16
    },
    {
        "text": " Pero yo pote una marca Uruguaya hacer un diseño en un lugar y mandar a hacer las fabricaciones y me mandan en un contenido.",
        "start": 1908.16,
        "end": 1919.16
    },
    {
        "text": " Así que todo viene de...",
        "start": 1920.16,
        "end": 1925.16
    },
    {
        "text": " Y ya en las más diversas calidad, porque ahora es una nueva sociedad que venía de China y era una cosa de mala calidad.",
        "start": 1925.16,
        "end": 1932.16
    },
    {
        "text": " Ahora, valían en todas las calidad.",
        "start": 1932.16,
        "end": 1935.16
    },
    {
        "text": " Los autos y cómo van copiándose los diseños y las diferentes marcas.",
        "start": 1935.16,
        "end": 1942.16
    },
    {
        "text": " En Beijing hay un auto chino de esos marcas, ¿qué es esto que hay acá?",
        "start": 1942.16,
        "end": 1947.16
    },
    {
        "text": " En todos, Audi, Mercedes-Benz, BMWs, doches.",
        "start": 1948.16,
        "end": 1957.16
    },
    {
        "text": " Eso también no encontré ningún chérdi.",
        "start": 1957.16,
        "end": 1962.16
    },
    {
        "text": " No vi.",
        "start": 1962.16,
        "end": 1965.16
    },
    {
        "text": " Pero son las más diversas realidades, pero también en otros lugares.",
        "start": 1965.16,
        "end": 1970.16
    },
    {
        "text": " Y hay muchas fábricas que se cerraron sus producciones y las llevaron a otros lugares.",
        "start": 1970.16,
        "end": 1976.16
    },
    {
        "text": " Por ejemplo, de a Philips, ¿dónde es? ¿De la casa matriz? ¿Dónde está? ¿Saben?",
        "start": 1976.16,
        "end": 1982.16
    },
    {
        "text": " ¿Las Philips?",
        "start": 1982.16,
        "end": 1984.16
    },
    {
        "text": " Holanda, Indóven. La casa matriz de la Philips es una ciudad chica en Holanda, que se llama Indóven, que estaba menos de una hora de Amsterdam.",
        "start": 1984.16,
        "end": 1992.16
    },
    {
        "text": " En la Plaza Central de Indóven, Indóven se caracteriza la característica de que en la segunda de la Rua Mundial la destrozaron.",
        "start": 1992.16,
        "end": 1999.16
    },
    {
        "text": " Entonces, una ciudad muy nueva, entonces, difícil relativamente bajos. ¿Dónde hay una universidad fuerte?",
        "start": 1999.16,
        "end": 2006.16
    },
    {
        "text": " Estaba la casa matriz de Philips, y hay una presa muy importante que fabrica las matrices de los microchips, de las máquinas que hacen los microchips.",
        "start": 2006.16,
        "end": 2017.16
    },
    {
        "text": " 15.000 personas trabajan en esa empresa, entonces más o menos son dos compañeros de trabajo en la ciudad.",
        "start": 2017.16,
        "end": 2024.16
    },
    {
        "text": " Hay todos los barrios que eran la zona de fabricación de las Philips, y eso hace mucho tiempo ser hoy pasaron a hacer producciones en otro lugar.",
        "start": 2025.16,
        "end": 2035.16
    },
    {
        "text": " Y hoy se transformaron en barrios residenciales. Entonces, ¿dónde es ese tipo de movimientos que dan?",
        "start": 2035.16,
        "end": 2043.16
    },
    {
        "text": " Y bueno, ejemplos de estos tenemos en los más diversos niveles. Y también, por ejemplo, el tema del fenómeno chino, que es un fenómeno que a nivel de Uruguay y a nivel de la región tenemos que estudiar,",
        "start": 2044.16,
        "end": 2060.16
    },
    {
        "text": " sobre todo en este proceso fuerte de integración que estamos viendo es que hoy en día pasa hacer un actor relevante, pero sobre todo la economía china, porque ha tenido un proceso de crecimiento importante,",
        "start": 2060.16,
        "end": 2070.16
    },
    {
        "text": " es la economía que ha sido más dinámico y si bien se ha el lentecido igual sigue creciendo a tasas del 6% y 7%.",
        "start": 2070.16,
        "end": 2079.16
    },
    {
        "text": " En este proceso de apertura en los chinos, ¿cómo está jugando? No, por ejemplo, en las inversiones en la región, y es un actor sumamente importante.",
        "start": 2079.16,
        "end": 2089.16
    },
    {
        "text": " En el hecho de un tema que está en algún momento íbamos a tocar, pero hay economías que tienen que de alguna forma hasta arreglamentar cómo es el proceso de compra de la tierra para que otros estados no sean los que estén comprando tierras detrás.",
        "start": 2089.16,
        "end": 2109.16
    },
    {
        "text": " Pero, por ejemplo, todo lo que son inversiones chinas y la inversión extranjera directa de China en América Latina, hoy es un proceso que está siendo sumamente relevante.",
        "start": 2109.16,
        "end": 2118.16
    },
    {
        "text": " Y por eso se firman acuerdos, por eso se firman estrategias, pero hay diferencias culturales fuertes. Entonces, ahí hasta en primer lugar, son capitales que hasta son necesarios.",
        "start": 2118.16,
        "end": 2134.16
    },
    {
        "text": " Hay que haber un acuerdo de cuáles son los protocolos hasta a veces cuando se ven en infraestructuras, en la construcción, en cuáles son las formas.",
        "start": 2135.16,
        "end": 2147.16
    },
    {
        "text": " Los chinos han tenido un discurso fuerte, entonces el proceso con América Latina, a través del cual se mueven, en realidad es una forma de cooperación que busca el beneficio de todos.",
        "start": 2147.16,
        "end": 2159.16
    },
    {
        "text": " Pues en los hechos a veces no se sabe bien cómo va a terminar. Hace un tiempo se anunció de hace poco, en Uruguay se anunció un poco la búsqueda untratado del libre comercio con China.",
        "start": 2159.16,
        "end": 2171.16
    },
    {
        "text": " Si ustedes me iben preguntan a mí, me parecía bastante difícil que se concretaron el acuerdo del libre comercio con China.",
        "start": 2171.16,
        "end": 2177.16
    },
    {
        "text": " Si algunos acuerdos de complementaría comercial para Uruguay, China hoy es muy relevante, el primer destino de exportación de la carde de China, pero a su vez,",
        "start": 2177.16,
        "end": 2187.16
    },
    {
        "text": " el primer lugar de importación de carnes es Uruguay. Y también están siendo hacia otro tipo de cortes que permiten un mayor aprovechamiento, por ejemplo, compran mucha carne con hueso, que antes se tiraba.",
        "start": 2187.16,
        "end": 2202.16
    },
    {
        "text": " Entonces, o la madera de piños que está siendo para los chinos, China le sirve. No sé para que la quieren bien, pero en realidad juega y juega mucho nuestra balanza comercial",
        "start": 2202.16,
        "end": 2216.16
    },
    {
        "text": " y juega con un socio comercial importante. Y de China viene mucha cosa. Bien en auto, bien en... Pero por ejemplo, todo lo que son agroquímicos también de China y han hecho una baja fuerte, lo que son los agroquímicos.",
        "start": 2216.16,
        "end": 2231.16
    },
    {
        "text": " Ahora, como hay mayores normativas, hay muchas fábricas en China que estarían cerrando y eso nos podría estar dando una idea de que puedan estar subiendo.",
        "start": 2231.16,
        "end": 2239.16
    },
    {
        "text": " Pero esto es como juega la divina de una divinanza. Pero es el tipo de ejercicio que a veces estamos jugando.",
        "start": 2239.16,
        "end": 2247.16
    },
    {
        "text": " Y cuando hablamos de los procesos de integración y de los acuerdos, hay una ejercicio muy fuerte de escenarios, se ve cómo pueden estar jugando.",
        "start": 2247.16,
        "end": 2255.16
    },
    {
        "text": " No puede ser cualquier acuerdo, va a depender mucho de la complementaria comercial que tenga a qué sectores les juega favoria, que sectores les juega en contra.",
        "start": 2255.16,
        "end": 2263.16
    },
    {
        "text": " Pero todo esto cuenta de que hay un desplazamiento de actividades buscando cuáles son los lugares de menores costos.",
        "start": 2263.16,
        "end": 2272.16
    },
    {
        "text": " Y a veces, en términos tendenciales han cambiado. Porque lugares que antes eran baratos, por ejemplo, en la mano de obra después se han podido encarecer.",
        "start": 2272.16,
        "end": 2281.16
    },
    {
        "text": " Entonces, eso también es dinámico. Bueno, si yo veo a nivel de los países, hay distintas dimensiones.",
        "start": 2281.16,
        "end": 2296.16
    },
    {
        "text": " Entonces, esto puede operar diferente y el plano político a veces juega en otras características.",
        "start": 2296.16,
        "end": 2309.16
    },
    {
        "text": " Y después, esta mayor apertura y este mayor intercambio en todos los aspectos de los países con la de esta internacionalización también acuta el poder y hace perder autonomía de los estados nacionales.",
        "start": 2309.16,
        "end": 2337.16
    },
    {
        "text": " Y por lo tanto, de los gobiernos. Entonces, empiezan a generar también algún tipo de tensiones.",
        "start": 2339.16,
        "end": 2348.16
    },
    {
        "text": " Algunos indicadores que podemos ver para ver estos procesos. Por ejemplo, la evolución de la inversión extranjera directa.",
        "start": 2370.16,
        "end": 2385.16
    },
    {
        "text": " En Uruguay, ha tenido un proceso enorme de crecimiento en la inversión extranjera directa hacia Uruguay. Uruguay ha sido un país atractivo en inversiones extranjera directas.",
        "start": 2385.16,
        "end": 2394.16
    },
    {
        "text": " ¿Cuáles son los argumentos para invertir en Uruguay? Primero que nada, Uruguay tiene un régimen de fomento a las inversiones bastante atractivo a través de exoneraciones impositivas.",
        "start": 2394.16,
        "end": 2406.16
    },
    {
        "text": " ¿Crees saben cómo funciona eso?",
        "start": 2406.16,
        "end": 2408.16
    },
    {
        "text": " Hay un régimen de promoción de inversiones. Esa es el régimen de promoción de inversiones.",
        "start": 2411.16,
        "end": 2416.16
    },
    {
        "text": " Lo que hace es un conjunto de cuentos impositivos donde se deben presentar proyectos, donde se valoran diferentes items.",
        "start": 2416.16,
        "end": 2425.16
    },
    {
        "text": " Por ejemplo, la generación de empleo, por ejemplo, la incorporación de innovación, la incorporación tecnológica, por ejemplo, la ubicación geográfica que nos te toca concentrado en un monte de video.",
        "start": 2425.16,
        "end": 2436.16
    },
    {
        "text": " Y, claro, y una vez que el proyecto se instala en generar la beneficios a través del descuento impositivo dentro de las ganancias.",
        "start": 2437.16,
        "end": 2445.16
    },
    {
        "text": " Y es bastante atractivo. Otra característica que tiene Uruguay que vio una economía pequeña, entonces, si un mercado interno a chico, es que tiene una institucionalidad muy estable.",
        "start": 2445.16,
        "end": 2455.16
    },
    {
        "text": " Uruguay es muy difícil que las políticas cambien. En ese sentido, es atractivo, es muy serio.",
        "start": 2456.16,
        "end": 2463.16
    },
    {
        "text": " Hay indicadores bastante altos de niveles de bienestar, es una democracia fuerte y consolidada.",
        "start": 2463.16,
        "end": 2469.16
    },
    {
        "text": " Los niveles de corrupción son muy bajos. Los niveles de transparencia son bastante, siempre está muy bien posicionado.",
        "start": 2469.16,
        "end": 2477.16
    },
    {
        "text": " Independientemente de cuál sea el gobierno de turno. Y a su vez, si bien es una economía pequeña, su ubicación estratégica puede ser una puerta de entrada al red de toda la región.",
        "start": 2478.16,
        "end": 2488.16
    },
    {
        "text": " Tiene buenas comunicaciones con toda la región y puede ser un buen piloto para después poder instalarse en economías que son cercanas.",
        "start": 2488.16,
        "end": 2498.16
    },
    {
        "text": " Y que a veces por su tamaño o por sus características pueden tener. Entonces, después, una puerta de entrada, no solo al mercador Uruguay, sino un mercado mucho más amplio como es Mercosur, el Conosur y demás.",
        "start": 2499.16,
        "end": 2510.16
    },
    {
        "text": " Después, tiene otro conjunto de beneficios fiscales y exoneraciones, como son Zona Franca, que están un poco en debate también.",
        "start": 2513.16,
        "end": 2521.16
    },
    {
        "text": " Bueno, algunos comentarios sobre este tema de la globalización. Para meternos un poco más en lo que es el proceso de integración, propiamente dicho.",
        "start": 2522.16,
        "end": 2533.16
    },
    {
        "text": " Comentarios o reflexiones. Muchos de los que ya hemos realizado mientras.",
        "start": 2533.16,
        "end": 2551.16
    },
    {
        "text": " En primer lugar. La globalización está instalada y parece que no es un proceso que sea reversible. Toma diferentes dimensiones y diferentes enfascin.",
        "start": 2552.16,
        "end": 2570.16
    },
    {
        "text": " Pero sobre todo, no contribuye hacia un mundo homogéneo.",
        "start": 2571.16,
        "end": 2579.16
    },
    {
        "text": " Las diferencias persisten y en algunos situaciones hasta se asentulan.",
        "start": 2584.16,
        "end": 2590.16
    },
    {
        "text": " Tampoco unifica en términos ideológicos, culturales y valores. Globalizar no es que las valores occidentales se generalizan en todo el mundo.",
        "start": 2591.16,
        "end": 2605.16
    },
    {
        "text": " De alguna manera, la existencia de un mundo plural persista.",
        "start": 2610.16,
        "end": 2615.16
    },
    {
        "text": " Hay una creciente interconexión.",
        "start": 2621.16,
        "end": 2627.16
    },
    {
        "text": " De todas las economías a nivel mundial, ¿no?",
        "start": 2631.16,
        "end": 2636.16
    },
    {
        "text": " Pero esto no significa una única civilización.",
        "start": 2636.16,
        "end": 2643.16
    },
    {
        "text": " Con existen diferentes culturas, diferentes culturas económicas, diferentes modos de vida, diferentes modos de producción.",
        "start": 2650.16,
        "end": 2657.16
    },
    {
        "text": " Que siempre van a seguir siendo diferentes.",
        "start": 2657.16,
        "end": 2664.16
    },
    {
        "text": " Entonces, si esto se da así, nos preguntamos.",
        "start": 2664.16,
        "end": 2670.16
    },
    {
        "text": " Las economías en desarrollo. ¿Sí? ¿Cómo pueden participar de condiciones más equitativas?",
        "start": 2670.16,
        "end": 2679.16
    },
    {
        "text": " Deben contar con instrumentos que les permitan formar parte de este proceso de forma tarde poder capitalizar los beneficios de la globalización.",
        "start": 2681.16,
        "end": 2696.16
    },
    {
        "text": " ¿Cómo sean estas condiciones? ¿Sí? Esas son un poco las preguntas. ¿Cuáles son los desafíos de poder ser parte del proceso de globalización y no quedar siempre con mayores diferencias?",
        "start": 2696.16,
        "end": 2709.16
    },
    {
        "text": " ¿Cuáles son las dificultades? ¿Qué en estos procesos globales donde existen los capitales transnacionales, las empresas transnacionales, donde las comunicaciones cada vez más fluidas?",
        "start": 2710.16,
        "end": 2723.16
    },
    {
        "text": " Los gobiernos a niveles y que los gobiernos tienen más acuerdos y necesitan estar más integrados con otras economías en los más diversos planos, los gobiernos nacionales, como tal, tienen menos margen de maniobra",
        "start": 2723.16,
        "end": 2738.16
    },
    {
        "text": " para de alguna forma generar políticas que promuevan los desarrollos a nivel nacional.",
        "start": 2738.16,
        "end": 2745.16
    },
    {
        "text": " Porque, por ejemplo, Uruguay es una economía pequeña, pero parte importante de nuestra economía depende de nuestros vínculos con otras economías, con nuestros vínculos comerciales, por ejemplo, en la región.",
        "start": 2745.16,
        "end": 2759.16
    },
    {
        "text": " Estamos siempre pendientes. Cuando se dio la crisis financiera del 2008, y, bueno, pareció que había una que no terminó repercutiendo negativamente, y, bueno, había un margen con una desarrollo institucional de unas políticas que fueron bastante buenas en el sentido de poder blindar la economía, pero no siempre es posible.",
        "start": 2759.16,
        "end": 2787.16
    },
    {
        "text": " Y el margen de maniobra es muy reducido. Eso no lo vive solo igual, lo vive en las más diversas economías, no dependiendo solo del tamaño.",
        "start": 2787.16,
        "end": 2798.16
    },
    {
        "text": " Sentiendo un poco cuáles son las reflexiones. Entonces, en realidad, a los desafíos a nivel de la política pública y de la política económica son amplios, lo mismo que a nivel de las empresas.",
        "start": 2798.16,
        "end": 2809.16
    },
    {
        "text": " Como hacemos para competir cuando existen otras empresas que trabajan a nivel de producir en otros lugares del mundo, que tienen mejores niveles de competencia, que tienen otros capitales, otros respaldos o mayor lexibilidad.",
        "start": 2809.16,
        "end": 2826.16
    },
    {
        "text": " De acuerdo. Este es un poco el marco general de lo que son los procesos de globalización en los grandes conceptos. Después, podríamos pasar un curso entero dedicado a analizar este tema.",
        "start": 2827.16,
        "end": 2847.16
    },
    {
        "text": " El otro tema grande que nos interesa ver es la integración, los procesos de integración.",
        "start": 2847.16,
        "end": 2862.16
    },
    {
        "text": " El tema grande que nos interesa ver es la integración, los procesos de integración, los procesos de integración, los procesos de integración, los procesos de integración, los procesos de integración, los procesos de integración, los procesos de integración, los procesos de integración, los procesos de integración, los procesos de integración, los procesos de integración, los procesos de integración, los procesos de integración, los procesos de integración, los procesos de integración, los procesos de integración, los procesos de integración, los procesos de integración, los procesos de integración, los procesos de integración, los procesos de integración, los procesos de integración, los procesos de integración, los procesos de integración, los procesos de integración, los procesos de integración, los procesos de integración, los procesos de integración, los procesos de integración, los procesos de integr",
        "start": 2877.16,
        "end": 2878.16
    },
    {
        "text": " Bueno, ¿qué vamos a ver un poco respecto a la integración?",
        "start": 2907.16,
        "end": 2919.16
    },
    {
        "text": " Algunas preguntas, ¿en qué consiste la integración?",
        "start": 2919.16,
        "end": 2927.16
    },
    {
        "text": " Si podemos dar una definición acabada, eso es difícil. ¿Cuál es el rol del estado?",
        "start": 2932.16,
        "end": 2942.16
    },
    {
        "text": " ¿Es posible en el marco de la integración?",
        "start": 2949.16,
        "end": 2966.16
    },
    {
        "text": " En el marco de la globalización, regular los procesos de integración,",
        "start": 2966.16,
        "end": 2991.16
    },
    {
        "text": " ¿cómo se insertan los procesos de integración en ese proceso de globalización? ¿Qué desafíos tienen? ¿Qué tapas? ¿Cuáles son las dimensiones? ¿Cómo se controlan?",
        "start": 2996.16,
        "end": 3015.16
    },
    {
        "text": " Entonces, antes de empezar, vamos a, con los procesos mismos concretos, vamos a ver algo de teoría. ¿Qué procesos de integración? ¿Qué entienden ustedes o cuándo hablan de integración?",
        "start": 3015.16,
        "end": 3042.16
    },
    {
        "text": " ¿Qué es el marco sur? ¿Qué más? ¿Qué piensan del marco sur?",
        "start": 3045.16,
        "end": 3059.16
    },
    {
        "text": " Cuando yo tenía 8 años, estaban empezando el proceso del marco sur, en el 91 los firmaron, yo nací en diciembre de la 80.",
        "start": 3059.16,
        "end": 3073.16
    },
    {
        "text": " Entonces, ahí la cusina era firmaron el acuerdo de asunción y había unos que decían que era bueno y otros decían que era malo.",
        "start": 3073.16,
        "end": 3083.16
    },
    {
        "text": " Entonces, estaban como las dos posiciones. En realidad, los procesos de integración son como irreversibles,",
        "start": 3083.16,
        "end": 3091.16
    },
    {
        "text": " se estaban dando todo el proceso de la comunidad económica europea, que terminó en la UE y se ha al proceso de integración a nivel del marco sur.",
        "start": 3091.16,
        "end": 3097.16
    },
    {
        "text": " Entonces, la discusión era, es bueno pero bueno, es bueno, ¿qué pasa si no integramos con 12 economías grandes en zonas de libre circulación de bienes?",
        "start": 3097.16,
        "end": 3108.16
    },
    {
        "text": " Hablando de imaginaciones generales, sin demasiado detalle, ahora lo vamos a especificar bien, con 12 normes potencias al lado de nuestra región como son argentinos y así nos comen vivo.",
        "start": 3108.16,
        "end": 3121.16
    },
    {
        "text": " Ahora, podimos quedarnos solo aislados y que ellos se integren.",
        "start": 3121.16,
        "end": 3126.16
    },
    {
        "text": " Bueno, ya que estamos, nos unimos, después vemos.",
        "start": 3126.16,
        "end": 3131.16
    },
    {
        "text": " La pregunta es, ¿y el debate que se dio en la época de gestación del marco sur, o que se fue contratado, hoy es otra totalmente diferente?",
        "start": 3132.16,
        "end": 3142.16
    },
    {
        "text": " Es como Uruguay sin integrar ese proceso, como se generan las condiciones, cuáles son las exigencias o las condiciones o que tienen que tener ese tipo de acuerdo para de alguna manera proteger a las economías más débiles?",
        "start": 3142.16,
        "end": 3155.16
    },
    {
        "text": " Hay un conjunto de funcionamientos del marco sur, que a veces funcionan como en contra, pero a veces, a favor, por ejemplo, el marco sur actúa por consenso.",
        "start": 3156.16,
        "end": 3164.16
    },
    {
        "text": " Por consenso significa que todas las partes tienen que estar de acuerdo, eso protege a las economías más chicas, porque si fuera por producción o por territorio, o por...",
        "start": 3164.16,
        "end": 3177.16
    },
    {
        "text": " Y bueno, ahí marchaba. Pero funcionar por consenso tiene como contra cara que tenemos que estar todos de acuerdo.",
        "start": 3178.16,
        "end": 3186.16
    },
    {
        "text": " Por eso, cuando hubieron los conflictos políticos y con los nuevos socios, o cuando hubo que tomar medidas con paraguay, tuvieron que esperar a ver cómo funcionaba.",
        "start": 3186.16,
        "end": 3196.16
    },
    {
        "text": " Porque si alguno no estaba acuerdo, no se hacía operativo.",
        "start": 3196.16,
        "end": 3201.16
    },
    {
        "text": " Lo que empezó en aspectos comerciales, después de ir vivo en profundización comercial y en otras dimensiones, hoy no solamente funcionan los temas comerciales al nivel de marco sur.",
        "start": 3202.16,
        "end": 3212.16
    },
    {
        "text": " Hay un marco sur político, hay diferentes acordos, hay un parlamento del marco sur que no tenemos mucho conocimiento ni sabemos si opera mucho.",
        "start": 3212.16,
        "end": 3221.16
    },
    {
        "text": " La cel marco sur está en Uruguay porque es uno de los países chicos, es una forma de proteger a las representación parlamentánea en Argentina y en Paraguay lo eligen directamente los ciudadanos,",
        "start": 3221.16,
        "end": 3235.16
    },
    {
        "text": " en Brasil y las próximas elecciones ya lo eligen, y Uruguay se elige dentro de la cámara, es una elección indicta, algunos de los representantes forman parte del parlamento del marco sur.",
        "start": 3235.16,
        "end": 3247.16
    },
    {
        "text": " Hay una dimensión social que ha trabajado bastante más que otras dimensiones.",
        "start": 3248.16,
        "end": 3252.16
    },
    {
        "text": " Entonces, el marco sur se ha concretado con una interacción bastante compleja, con avances y no avances y con estas dificultades que a veces las economías sufren presiones hasta de los propios sectores y bueno, no nos dejan exportar leche, pero así desde ayer de tal.",
        "start": 3254.16,
        "end": 3275.16
    },
    {
        "text": " Entonces, ya están los cancilleres en conversa, los ministros de agricultura, todo el mundo alarma porque en realidad es un destino importante.",
        "start": 3277.16,
        "end": 3286.16
    },
    {
        "text": " Bien, alguno de los procesos de integración, así que le llame la atención o que... Ninguno en general.",
        "start": 3289.16,
        "end": 3300.16
    },
    {
        "text": " Profundizaremos en esto. Bueno, existen teorías y conceptos de nuestro presente de irración.",
        "start": 3307.16,
        "end": 3315.16
    },
    {
        "text": " Las primeras teorías siempre surgen del punto de vista del comercio internacional, porque fueron las primeras etapas de la integración, las primeras etapas de la internacionalización.",
        "start": 3316.16,
        "end": 3325.16
    },
    {
        "text": " Entonces, si vamos a ver a nivel de la teoría económica, lo que nos vamos a ver es en las primeras teorías del comercio internacional.",
        "start": 3325.16,
        "end": 3334.16
    },
    {
        "text": " Estas teorías se preguntan básicamente en qué se basa el comercio, o cómo deben los países",
        "start": 3337.16,
        "end": 3361.16
    },
    {
        "text": " insertarse comercialmente.",
        "start": 3362.16,
        "end": 3368.16
    },
    {
        "text": " La teoría más tradicional es las ventajas comparativas.",
        "start": 3368.16,
        "end": 3387.16
    },
    {
        "text": " Es un punto de vista más de corte estático y está basada en la teoría del comercio internacional de David Ricardo.",
        "start": 3387.16,
        "end": 3413.16
    },
    {
        "text": " Y después está la teoría de las ventajas competitivas.",
        "start": 3418.16,
        "end": 3432.16
    },
    {
        "text": " ¿Qué es de corte más dinamico y está asociada al desarrollo?",
        "start": 3432.16,
        "end": 3461.16
    },
    {
        "text": " El comercio internacional es una necesidad de los países para poder aprovisionarse de muchos bienes y servicios que no disponen y poder colocar al",
        "start": 3461.16,
        "end": 3480.16
    },
    {
        "text": " comercio.",
        "start": 3480.16,
        "end": 3487.16
    },
    {
        "text": " Hay una tendencia al libre comercio.",
        "start": 3487.16,
        "end": 3495.16
    },
    {
        "text": " Pero estamos hoy en los últimos tiempos en una tendencia más que el libro Comercio de las regulaciones y a las distorsiones.",
        "start": 3496.16,
        "end": 3507.16
    },
    {
        "text": " Pero vamos más a la cuestión más histórica y más de la teoría económica.",
        "start": 3507.16,
        "end": 3518.16
    },
    {
        "text": " Pero hay quienes son los defensores de esta idea y los defensores del libre comercio sostienen que el libre comercio como tal beneficia a los países y a los individuos de los países.",
        "start": 3518.16,
        "end": 3540.16
    },
    {
        "text": " Y cuáles son los fundamentos de estos beneficios.",
        "start": 3540.16,
        "end": 3547.16
    },
    {
        "text": " En primer lugar, permite el acceso a nuevos bienes y servicios.",
        "start": 3547.16,
        "end": 3564.16
    },
    {
        "text": " También permite el acceso a bienes y servicios más baratos y eso beneficia el consumidor final o a los productores con los que se pueden dar a los productores.",
        "start": 3564.16,
        "end": 3593.16
    },
    {
        "text": " Los productores con insumos más baratos permiten el acceso a nuevos mercados con insumos más baratos que dan mayor competitividad que permiten la colocación de productos.",
        "start": 3593.16,
        "end": 3622.16
    },
    {
        "text": " Los que están en contra dicen bueno los defensores.",
        "start": 3622.16,
        "end": 3640.16
    },
    {
        "text": " Es difícil que los beneficios se generalicen o alcancen a todos los sectores.",
        "start": 3640.16,
        "end": 3665.16
    },
    {
        "text": " Entonces por ejemplo puede de generar desplazamiento de productores. Traigo insumos más baratos, traigo producción más barata y afecto a la industria nacional.",
        "start": 3665.16,
        "end": 3682.16
    },
    {
        "text": " También señalan que no existe competencia perfecta y si no existe competencia perfecta intervienen factores que pueden estar conspirando como ser.",
        "start": 3682.16,
        "end": 3704.16
    },
    {
        "text": " La tecnología versus regulación, aumento de productividad versus salarios.",
        "start": 3704.16,
        "end": 3711.16
    },
    {
        "text": " Entonces, ahí así metrías de información.",
        "start": 3711.16,
        "end": 3723.16
    },
    {
        "text": " Y en esta tipo de argumentos podemos ir analizando cuáles son los elementos a favor o en contra.",
        "start": 3723.16,
        "end": 3730.16
    },
    {
        "text": " Entonces, que están siempre operando.",
        "start": 3730.16,
        "end": 3733.16
    },
    {
        "text": " En esta lógica a favor o en contra nos preguntamos ¿Cuál es la incidencia o cuál es el rol del estado?",
        "start": 3733.16,
        "end": 3744.16
    },
    {
        "text": " Básicamente para evitar asimetrías, evitar los prefuicios y favorecer los beneficios.",
        "start": 3753.16,
        "end": 3770.16
    },
    {
        "text": " Y los estados como pueden operar, los estados intervienen a través de una serie de políticas y de regulaciones que se concretan en un conjunto de instrumentos del comercio internacional.",
        "start": 3770.16,
        "end": 3793.16
    },
    {
        "text": " ¿Cuáles son esos instrumentos?",
        "start": 3793.16,
        "end": 3814.16
    },
    {
        "text": " Vamos a acá en numerar y definir estos principales instrumentos y vamos a ver cuáles son los conceptos.",
        "start": 3814.16,
        "end": 3837.16
    },
    {
        "text": " Entonces, los conceptos sí es importante que ustedes lo sientan y se los acuerden y aprendan que son cada uno.",
        "start": 3837.16,
        "end": 3842.16
    },
    {
        "text": " Minda pregunta de parcial porque queda bien muy diversión.",
        "start": 3842.16,
        "end": 3848.16
    },
    {
        "text": " Siempre aparece alguna.",
        "start": 3848.16,
        "end": 3851.16
    },
    {
        "text": " Bueno, instrumentos de política comercial.",
        "start": 3851.16,
        "end": 3863.16
    },
    {
        "text": " Aranceles. ¿Qué es un arancel?",
        "start": 3863.16,
        "end": 3874.16
    },
    {
        "text": " ¿Qué es un arancel profesional?",
        "start": 3874.16,
        "end": 3881.16
    },
    {
        "text": " Bueno, asociado el comercio internacional ¿qué es?",
        "start": 3881.16,
        "end": 3888.16
    },
    {
        "text": " Es un impuesto que se le cobra y que va a traer algo. Es un impuesto a los productos importados.",
        "start": 3888.16,
        "end": 3893.16
    },
    {
        "text": " ¿Estos impuestos pueden ser de dos tipos? ¿Advalorén o de suma fijo? ¿Qué es frecuencia entre un impuesto a valoren y uno de suma fijo?",
        "start": 3904.16,
        "end": 3921.16
    },
    {
        "text": " ¿Y qué es un impuesto? ¿Qué es un impuesto?",
        "start": 3921.16,
        "end": 3925.16
    },
    {
        "text": " Bueno, avalo con un tabo a otra cuando vean micro.",
        "start": 3925.16,
        "end": 3931.16
    },
    {
        "text": " Un impuesto es algo que tengo que pagar, que el Estado me lo cobra por su poder de coerción, pero que no tengo ningún beneficio directo.",
        "start": 3931.16,
        "end": 3942.16
    },
    {
        "text": " Cuando yo pago mi RFF, cuando pago el IVA, no tengo ningún beneficio directo asociado al pago de sin puesto.",
        "start": 3942.16,
        "end": 3951.16
    },
    {
        "text": " Cuando pago una tasa así, cuando pago una tasa en general esta asociado un servicio,",
        "start": 3951.16,
        "end": 3957.16
    },
    {
        "text": " o cuando pago una contribución, el Estado cobra tributos.",
        "start": 3957.16,
        "end": 3962.16
    },
    {
        "text": " Los tributos son de diferentes tipos. Los impuestos no pueden identificar ningún beneficio directo y lo estoy obligado a pagarlo.",
        "start": 3962.16,
        "end": 3972.16
    },
    {
        "text": " Las contribuciones, por ejemplo las contribuciones a la seguridad social, lo que tengo es un beneficio a futuro,",
        "start": 3972.16,
        "end": 3981.16
    },
    {
        "text": " estoy generando un derecho a futuro y las tasas lo que tengo asociado son grandes conceptos económicos.",
        "start": 3981.16,
        "end": 3987.16
    },
    {
        "text": " A veces tengo cosas que ya mantrasas que son impuestos en la realidad, pero un impuesto es solo, tengo que pagar y no tengo ningún beneficio directo asociado.",
        "start": 3987.16,
        "end": 3996.16
    },
    {
        "text": " Los impuestos a Valorien son aquellos que son un porcentaje del precio.",
        "start": 3997.16,
        "end": 4002.16
    },
    {
        "text": " Y los impuestos de suma fija es una cantidad de dinero por unidad producida y de vendida, en este caso por unidad importado.",
        "start": 4004.16,
        "end": 4015.16
    },
    {
        "text": " Bien, el más conocido es el Arancel, un impuesto a la importación, es lo mismo, es el la misma.",
        "start": 4016.16,
        "end": 4026.16
    },
    {
        "text": " El otro instrumento son las cuotas.",
        "start": 4028.16,
        "end": 4031.16
    },
    {
        "text": " ¿Qué son las cuotas? Yo les dije el deseado y el problema es que Brasil estaba amenazando que ha por una cuota para los lácteos. ¿Qué significa?",
        "start": 4032.16,
        "end": 4048.16
    },
    {
        "text": " Una cantidad limitada, topiada, una cantidad limitada.",
        "start": 4049.16,
        "end": 4055.16
    },
    {
        "text": " Entre el Mercosur y la Unión Europea están el bloque agrícola, el problema son las cuotas de comercio.",
        "start": 4056.16,
        "end": 4067.16
    },
    {
        "text": " Por ejemplo, en la carne el pisto era un 78 mil toneladas anuales y parece que en la última negociación la semana pasada, leí la prensada.",
        "start": 4067.16,
        "end": 4079.16
    },
    {
        "text": " La Unión Europea dijo 70 mil, que es muy poco para el Mercosur y parece que querían llegar a 200 mil toneladas, eso era lo que estaba hablando.",
        "start": 4080.16,
        "end": 4088.16
    },
    {
        "text": " En Arroz parece que ofrecieron 40 mil toneladas y después del otro tema es como lo repartimos entre el Mercosur.",
        "start": 4090.16,
        "end": 4096.16
    },
    {
        "text": " Ahí hay otro, y ese también es un denso discusión.",
        "start": 4096.16,
        "end": 4100.16
    },
    {
        "text": " En Arroz, por ejemplo, están hablando de una cuota de libre comercio, sin alancel.",
        "start": 4100.16,
        "end": 4107.16
    },
    {
        "text": " De 40 mil toneladas, yo voy a preguntar a mí a ustedes, les viene bien con 10 mil toneladas, les sobra por año.",
        "start": 4107.16,
        "end": 4115.16
    },
    {
        "text": " Yo le dije, mira, tenemos el 55% de las afra vendidas y con el 55% vendimos 45 mil toneladas a la Unión Europea, entonces ni para empezar.",
        "start": 4115.16,
        "end": 4125.16
    },
    {
        "text": " Y es el 12% de nuestras exportaciones, de este año.",
        "start": 4126.16,
        "end": 4131.16
    },
    {
        "text": " Pero bueno, hay 10 mil toneladas que entrarían mejor que el resto, el resto paga las aranceles para me yocar.",
        "start": 4132.16,
        "end": 4140.16
    },
    {
        "text": " Eso pierde competitividad. El arancel me hace perder competitividad porque me hace mascaro mi producto.",
        "start": 4141.16,
        "end": 4147.16
    },
    {
        "text": " Hay veces que no importa el arancel, igual se vende.",
        "start": 4148.16,
        "end": 4152.16
    },
    {
        "text": " Pongo otro ejemplo de la arroz, pero no prometo, porque nunca se se. No pongo de la otra más.",
        "start": 4152.16,
        "end": 4157.16
    },
    {
        "text": " Uruguay vende a Perú, una variedad de arroz que se llama Arroz Takuari.",
        "start": 4157.16,
        "end": 4162.16
    },
    {
        "text": " Ese arroz lo consume la alta cocina peruana.",
        "start": 4162.16,
        "end": 4166.16
    },
    {
        "text": " Te se encanta, los peruanos, de ese arroz por su calía culinaria, por cómo se cocina.",
        "start": 4166.16,
        "end": 4171.16
    },
    {
        "text": " Entonces lo pagan, lo come el estrato más alto.",
        "start": 4171.16,
        "end": 4176.16
    },
    {
        "text": " Se vende una cantidad enorme por año y Perú tiene un sistema de aranceles que cobra a la arroz uruguayo que era bastante elevado.",
        "start": 4176.16,
        "end": 4186.16
    },
    {
        "text": " Llego a ser muy alto, ahora bajó muchísimo.",
        "start": 4186.16,
        "end": 4189.16
    },
    {
        "text": " Igual era buen negocio venderlo porque lo pagaban alto.",
        "start": 4189.16,
        "end": 4194.16
    },
    {
        "text": " Entonces, y de hecho ahora que el arancel bajó, uruguay lo sigue vendiendo relativamente igual.",
        "start": 4195.16,
        "end": 4203.16
    },
    {
        "text": " O sea lo que queda con el precio, pop acá es más o menos lo mismo.",
        "start": 4203.16,
        "end": 4207.16
    },
    {
        "text": " Quiere decir que el intermediario se está bien especiendo.",
        "start": 4207.16,
        "end": 4209.16
    },
    {
        "text": " Ese son los tipos anánis que no hacen comerciéndome a acerales que son complejos.",
        "start": 4209.16,
        "end": 4213.16
    },
    {
        "text": " Y todos los distorsiones que hay en el medio.",
        "start": 4213.16,
        "end": 4216.16
    },
    {
        "text": " Bien, entonces las jotas son cantidades admitidas de libre importación,",
        "start": 4217.16,
        "end": 4230.16
    },
    {
        "text": " libre de aranceles o con aranceles bajos.",
        "start": 4237.16,
        "end": 4245.16
    },
    {
        "text": " Otra instruventa que es muy utilizada y que muchas veces me facilita el tema de la rellamentación internacional,",
        "start": 4247.16,
        "end": 4261.16
    },
    {
        "text": " son los subsidios directos o indirectos.",
        "start": 4261.16,
        "end": 4264.16
    },
    {
        "text": " ¿Qué es esto?",
        "start": 4277.16,
        "end": 4281.16
    },
    {
        "text": " Es un pago que ha sido estado y en conclusión la sociedad en su conjunto.",
        "start": 4285.16,
        "end": 4291.16
    },
    {
        "text": " A productos nacionales, por exportar.",
        "start": 4291.16,
        "end": 4299.16
    },
    {
        "text": " Uruguay no tiene mucho de estas cosas.",
        "start": 4299.16,
        "end": 4307.16
    },
    {
        "text": " Entonces, sobre todo en los alimentos en los mercados internacionales de alimentos son mercados muy disorcionados,",
        "start": 4307.16,
        "end": 4316.16
    },
    {
        "text": " porque muchas economías tienen muchos subsidios.",
        "start": 4316.16,
        "end": 4319.16
    },
    {
        "text": " Entonces, Uruguay a veces compite con producción que está altamente subsidiada.",
        "start": 4319.16,
        "end": 4324.16
    },
    {
        "text": " ¿Tenemos que esperar el próximo aumento y no hacer considerado subsidio?",
        "start": 4324.16,
        "end": 4328.16
    },
    {
        "text": " También, pero en este caso estamos hablando de comercio internacional, por eso me acoto en esto.",
        "start": 4328.16,
        "end": 4335.16
    },
    {
        "text": " Entonces, esto es lo que tiene, es que es eso.",
        "start": 4335.16,
        "end": 4339.16
    },
    {
        "text": " Les doy un beneficio por el hecho de exportar.",
        "start": 4339.16,
        "end": 4342.16
    },
    {
        "text": " Competir a veces con algunos sectores que están altamente subsidiados y es complejo.",
        "start": 4345.16,
        "end": 4352.16
    },
    {
        "text": " ¿Por qué?",
        "start": 4352.16,
        "end": 4354.16
    },
    {
        "text": " Por ejemplo, nosotros competimos, nuestro principal competidor en el tema Rostr, es Estados Unidos.",
        "start": 4359.16,
        "end": 4366.16
    },
    {
        "text": " Estados Unidos está altamente subsidiada en la región.",
        "start": 4366.16,
        "end": 4369.16
    },
    {
        "text": " Y está en un subsidio que está bajo una forma que es un seguro.",
        "start": 4369.16,
        "end": 4373.16
    },
    {
        "text": " Es un seguro por rendimiento de presión, generan en las Rostras por presión.",
        "start": 4373.16,
        "end": 4377.16
    },
    {
        "text": " Si el precio no llega a eterno, se le paga el productora.",
        "start": 4377.16,
        "end": 4380.16
    },
    {
        "text": " Es una ley que se va actualizando, se llama la Farmil, la Ley Agricola y el febrero del 2014 es la última.",
        "start": 4380.16,
        "end": 4386.16
    },
    {
        "text": " Entonces, ellos pueden vender a precios mucho más bajos que Uruguay, porque Uruguay tiene que goberir costos.",
        "start": 4387.16,
        "end": 4393.16
    },
    {
        "text": " Después, por ejemplo, se vende a Brasil.",
        "start": 4393.16,
        "end": 4398.16
    },
    {
        "text": " Brasila a veces se autobastece y tiene producción nacional, pero subsidia fuerte.",
        "start": 4398.16,
        "end": 4403.16
    },
    {
        "text": " Entonces, el productor gana mucho más y a pesar de las diferencias a veces que se dan en calidad, no se compite igual.",
        "start": 4403.16,
        "end": 4412.16
    },
    {
        "text": " Los mercados alimenticios son altamente subsidados y los sectores nacionales tienen peso en las disiones de los gobiernos.",
        "start": 4413.16,
        "end": 4420.16
    },
    {
        "text": " Y son de las dificultades más grandes que hay.",
        "start": 4420.16,
        "end": 4423.16
    },
    {
        "text": " Bueno, otra serie de instrumentos. Estos bien no terminamos para estos instrumentos.",
        "start": 4423.16,
        "end": 4428.16
    },
    {
        "text": " 3, 4.",
        "start": 4435.16,
        "end": 4437.16
    },
    {
        "text": " Estandar técnicos.",
        "start": 4438.16,
        "end": 4441.16
    },
    {
        "text": " Ozanitarios.",
        "start": 4450.16,
        "end": 4452.16
    },
    {
        "text": " Son disposiciones que tienen determinados requerimientos en términos técnicos o fitos anitarios.",
        "start": 4456.16,
        "end": 4463.16
    },
    {
        "text": " Si no se cumple con esa disposición, no se fue importar, por ejemplo.",
        "start": 4464.16,
        "end": 4468.16
    },
    {
        "text": " Hay países que regulan, ¿no?",
        "start": 4469.16,
        "end": 4472.16
    },
    {
        "text": " Ejemplos donde operen esto que se les ocurra en los alimentos, en la aplicación de productos.",
        "start": 4472.16,
        "end": 4479.16
    },
    {
        "text": " Europa, por ejemplo, tiene estándares, fitos anitarios muy altos y cada vez más.",
        "start": 4479.16,
        "end": 4484.16
    },
    {
        "text": " Entonces, por ejemplo, si se utilizan determinadas aplicaciones,",
        "start": 4484.16,
        "end": 4491.16
    },
    {
        "text": " determinado tipo de productos en los cultivos, los que usan determinadas sustancias o principios activos,",
        "start": 4491.16,
        "end": 4498.16
    },
    {
        "text": " esos no entran. De los mercados más regulados, por ejemplo, son francias y alemanias.",
        "start": 4498.16,
        "end": 4503.16
    },
    {
        "text": " Entonces, analizan calidad, analizan o estándares técnicos para los autos.",
        "start": 4505.16,
        "end": 4510.16
    },
    {
        "text": " Temas de contaminación de medioambiente en los alimentos, en los productos agroquímicos,",
        "start": 4512.16,
        "end": 4518.16
    },
    {
        "text": " en los remedios, en los medicamentos.",
        "start": 4519.16,
        "end": 4521.16
    },
    {
        "text": " Hay una cantidad de estándares que se hacen analisis de calidad.",
        "start": 4522.16,
        "end": 4525.16
    },
    {
        "text": " Quien hace el análisis en Uruguay, por ejemplo?",
        "start": 4525.16,
        "end": 4527.16
    },
    {
        "text": " El Latu es uno de los... después, por ejemplo, el Ministerio de Salud Pública,",
        "start": 4529.16,
        "end": 4534.16
    },
    {
        "text": " el Ministerio de Ganadería, el Ministerio de Industria, pero el Latu es uno de los que hace,",
        "start": 4534.16,
        "end": 4539.16
    },
    {
        "text": " se dedica pila de analisis tanto para la producción que se exporta como lo que es sin importa.",
        "start": 4539.16,
        "end": 4544.16
    },
    {
        "text": " La Nivela Nacional también. Digo, no lo oculto, solo porque acá estoy hablando más de más internacional.",
        "start": 4545.16,
        "end": 4550.16
    },
    {
        "text": " Bien, también participan de estos procesos hasta laboratorios privados.",
        "start": 4551.16,
        "end": 4557.16
    },
    {
        "text": " Y a veces hay países que van a hacer los analisis a otros, a terceros países.",
        "start": 4558.16,
        "end": 4562.16
    },
    {
        "text": " Este instrumento cada vez es más importante.",
        "start": 4564.16,
        "end": 4566.16
    },
    {
        "text": " ¿Por qué edita a veces y esconde protecciones?",
        "start": 4567.16,
        "end": 4571.16
    },
    {
        "text": " Que digo, bueno, por un tema sanitario, por un tema ambiental,",
        "start": 4571.16,
        "end": 4576.16
    },
    {
        "text": " o por un tema de estándar, pero en realidad estoy haciendo una protección en cubierta de la producción nacional.",
        "start": 4576.16,
        "end": 4582.16
    },
    {
        "text": " Puede tener un doble objetivo.",
        "start": 4583.16,
        "end": 4585.16
    },
    {
        "text": " Son importantísimos también para que no traigan cualquier cosa.",
        "start": 4588.16,
        "end": 4590.16
    },
    {
        "text": " Otra instrumento, los derechos compensatorios.",
        "start": 4590.16,
        "end": 4597.16
    },
    {
        "text": " Son pagos para contrarrestar pagos de subsidios en las importaciones.",
        "start": 4610.16,
        "end": 4617.16
    },
    {
        "text": " La verdad, caballitos que pocos extremos,",
        "start": 4620.16,
        "end": 4622.16
    },
    {
        "text": " ec이라는 a unown,",
        "start": 4623.16,
        "end": 4624.16
    },
    {
        "text": " exitátos,",
        "start": 4625.16,
        "end": 4625.92
    },
    {
        "text": " tenant lasыхas,",
        "start": 4628.16,
        "end": 4630.16
    },
    {
        "text": " como googles la riesgo de la height de la brecha.",
        "start": 4637.16,
        "end": 4639.16
    },
    {
        "text": " Quiero obvio que robara 200 dólares de Respondible,",
        "start": 4640.16,
        "end": 4642.16
    },
    {
        "text": " el procedimiento menor te quieren eso.",
        "start": 4642.16,
        "end": 4646.16
    },
    {
        "text": " Antidampi. Son sanciones por vender aprecios por debajo del costo de producción.",
        "start": 4646.16,
        "end": 4672.92
    },
    {
        "text": " Alexten.",
        "start": 4672.92,
        "end": 4680.92
    },
    {
        "text": " ¿Eh?",
        "start": 4680.92,
        "end": 4689.92
    },
    {
        "text": " ¿Sí?",
        "start": 4689.92,
        "end": 4691.92
    },
    {
        "text": " ¿Ese es el problema de mongrasí?",
        "start": 4691.92,
        "end": 4695.92
    },
    {
        "text": " Sí, hay varios, ¿no? Porque los argumentos van y vienen.",
        "start": 4695.92,
        "end": 4698.92
    },
    {
        "text": " También dicen que hay un tema con la fecha,",
        "start": 4698.92,
        "end": 4701.92
    },
    {
        "text": " y que en realidad estamos verendiendo más de una sáfera.",
        "start": 4701.92,
        "end": 4707.92
    },
    {
        "text": " No parte de toda producción, no es esto, hay que ir como una triangulación.",
        "start": 4707.92,
        "end": 4715.92
    },
    {
        "text": " Pero hice algunas declaraciones que el canciller dice que el canciller de los sísmos estaba el tanto de la medida.",
        "start": 4715.92,
        "end": 4721.92
    },
    {
        "text": " El problema es el estulada del observador, no leí la nota.",
        "start": 4721.92,
        "end": 4729.92
    },
    {
        "text": " Bueno, por eso, porque yo les decía, son sectores, hay sectores donde el peso tiene, son muy importantes.",
        "start": 4729.92,
        "end": 4737.92
    },
    {
        "text": " Hay élites de presión muy fuerte a nivel político y están muy bien representados.",
        "start": 4737.92,
        "end": 4747.92
    },
    {
        "text": " Bien.",
        "start": 4747.92,
        "end": 4767.92
    },
    {
        "text": " En América Latina.",
        "start": 4767.92,
        "end": 4779.92
    },
    {
        "text": " ¿Cuáles son los antecedentes del proceso integración actual?",
        "start": 4779.92,
        "end": 4788.92
    },
    {
        "text": " En América Latina existen.",
        "start": 4788.92,
        "end": 4796.92
    },
    {
        "text": " ¿Varios intentos de integración?",
        "start": 4796.92,
        "end": 4811.92
    },
    {
        "text": " En general, estos intentos apuntan aspectos comerciales.",
        "start": 4811.92,
        "end": 4831.92
    },
    {
        "text": " Dentro de los más importantes, vamos a destacar algunos.",
        "start": 4831.92,
        "end": 4834.92
    },
    {
        "text": " Uno es la alcalca.",
        "start": 4834.92,
        "end": 4841.92
    },
    {
        "text": " La asociación latinoamericana de libre comercio.",
        "start": 4841.92,
        "end": 4854.92
    },
    {
        "text": " Esta es de 1960.",
        "start": 4854.92,
        "end": 4861.92
    },
    {
        "text": " Lo que buscaba esto era la creación de una zona de libre comercio en América Latina.",
        "start": 4861.92,
        "end": 4877.92
    },
    {
        "text": " El otro proceso fuerte y de cuál heruber forma parte es la aladi.",
        "start": 4877.92,
        "end": 4887.92
    },
    {
        "text": " La asociación latinoamericana de integración.",
        "start": 4887.92,
        "end": 4904.92
    },
    {
        "text": " La aladi es de 1980.",
        "start": 4905.92,
        "end": 4908.92
    },
    {
        "text": " Tienes cedas en Montevideo. ¿Saben dónde quedan?",
        "start": 4908.92,
        "end": 4914.92
    },
    {
        "text": " Acabas covieron de la embajada de Estados Unidos y un poco más.",
        "start": 4914.92,
        "end": 4923.92
    },
    {
        "text": " ¿Qué te les dice que está ahí?",
        "start": 4923.92,
        "end": 4925.92
    },
    {
        "text": " El IBS. Es un edificio verde que está atrás del IBS.",
        "start": 4925.92,
        "end": 4929.92
    },
    {
        "text": " El edificio de la Unión Postal.",
        "start": 4929.92,
        "end": 4937.92
    },
    {
        "text": " El objetivo de la aladi era dar un marco más flexible al comercio en la región.",
        "start": 4937.92,
        "end": 4944.92
    },
    {
        "text": " Para los miembros socios. ¿Es un marco más flexible?",
        "start": 4944.92,
        "end": 4952.92
    },
    {
        "text": " Al comercio. Y es un acuerdo de tipo multilateral.",
        "start": 4952.92,
        "end": 4963.92
    },
    {
        "text": " Y lo que tiene es un conjunto de normas a nivel de la región.",
        "start": 4963.92,
        "end": 4968.92
    },
    {
        "text": " Pero nunca he tenido demasiado peso.",
        "start": 4968.92,
        "end": 4980.92
    },
    {
        "text": " ¿Cuáles son los otros acuerdos en la región importante?",
        "start": 4980.92,
        "end": 4987.92
    },
    {
        "text": " Bueno, junto al marco sur que es el que vamos a ver en más detalle.",
        "start": 4987.92,
        "end": 4999.92
    },
    {
        "text": " Uno es la comunidad andina de comercio.",
        "start": 4999.92,
        "end": 5006.92
    },
    {
        "text": " Después el otro es el mercado común centroamericano.",
        "start": 5006.92,
        "end": 5014.92
    },
    {
        "text": " Y otro es el NAFTA que es el trato de libre comercio de América del Norte.",
        "start": 5014.92,
        "end": 5030.92
    },
    {
        "text": " Básicamente se han centrado mucho en acuerdos de corte comercial.",
        "start": 5031.92,
        "end": 5037.92
    },
    {
        "text": " Los procesos que integran otros.",
        "start": 5037.92,
        "end": 5045.92
    },
    {
        "text": " Cuando se empiezan a dar estos procesos fuerte, la década es 60.",
        "start": 5045.92,
        "end": 5055.92
    },
    {
        "text": " Y se dan con todo un proceso fuerte de tendencia a la apertura.",
        "start": 5055.92,
        "end": 5060.92
    },
    {
        "text": " Y donde el comercio de la región empieza a ser relevante.",
        "start": 5060.92,
        "end": 5064.92
    },
    {
        "text": " Y en particular para Uruguay. ¿A comienzos de la década? ¿Cuáles son los antecedentes de Uruguay?",
        "start": 5064.92,
        "end": 5069.92
    },
    {
        "text": " ¿A que esto es un poco en América Latina? ¿A que esto es Uruguay?",
        "start": 5069.92,
        "end": 5076.92
    },
    {
        "text": " ¿A que esto es Uruguay? ¿A que esto es Uruguay? ¿A que esto es Uruguay?",
        "start": 5076.92,
        "end": 5083.92
    },
    {
        "text": " Que la década es 60 y más en el setenda.",
        "start": 5107.92,
        "end": 5113.92
    },
    {
        "text": " El comercio en la región empieza a ser relevante.",
        "start": 5113.92,
        "end": 5120.92
    },
    {
        "text": " En Uruguay, empieza a tener un saldo negativo.",
        "start": 5121.92,
        "end": 5127.92
    },
    {
        "text": " En este momento para la década es el 70.",
        "start": 5136.92,
        "end": 5140.92
    },
    {
        "text": " Lo que está a mi gente es la asociación Latinoamericana de libre comercio.",
        "start": 5140.92,
        "end": 5147.92
    },
    {
        "text": " Alal.",
        "start": 5148.92,
        "end": 5151.92
    },
    {
        "text": " En este proceso, en este acuerdo, en el marco de este acuerdo,",
        "start": 5153.92,
        "end": 5160.92
    },
    {
        "text": " para Uruguay era difícil revertir.",
        "start": 5167.92,
        "end": 5171.92
    },
    {
        "text": " Mavine imposible.",
        "start": 5172.92,
        "end": 5176.92
    },
    {
        "text": " El saldo negativo.",
        "start": 5176.92,
        "end": 5179.92
    },
    {
        "text": " El saldo externo negativo.",
        "start": 5179.92,
        "end": 5183.92
    },
    {
        "text": " Entonces empieza un fuerte proceso a nivel de la región de integración con dos acuerdos bilaterales.",
        "start": 5185.92,
        "end": 5192.92
    },
    {
        "text": " ¿Qué son? El cauce y el pec.",
        "start": 5192.92,
        "end": 5199.92
    },
    {
        "text": " El cauce es el convenio argentino Uruguayo de cooperación económica.",
        "start": 5201.92,
        "end": 5215.92
    },
    {
        "text": " Y el pec es el protocolo de expansión comercial.",
        "start": 5216.92,
        "end": 5239.92
    },
    {
        "text": " El cauce es de 1974 y el pec es el 1975.",
        "start": 5239.92,
        "end": 5246.92
    },
    {
        "text": " El cauce, los firmes argentinos y el pec los firmes con Brasil.",
        "start": 5252.92,
        "end": 5258.92
    },
    {
        "text": " Una vez que Uruguay firma el tratado con Argentina,",
        "start": 5258.92,
        "end": 5264.92
    },
    {
        "text": " Brasil le ofrece Uruguay la posibilidad de un acuerdo comercial bilateral con condiciones similares.",
        "start": 5264.92,
        "end": 5271.92
    },
    {
        "text": " El que tuvo más importancia de los dos fue el tratado con Argentina, el pec fue de menor.",
        "start": 5274.92,
        "end": 5281.92
    },
    {
        "text": " Y después, en el año 1986, Argentina y Brasil,",
        "start": 5281.92,
        "end": 5291.92
    },
    {
        "text": " firman otro acuerdo que se llama protocolo de integración y cooperación económica.",
        "start": 5291.92,
        "end": 5306.92
    },
    {
        "text": " Entonces establecieron negociaciones sectoriales a fin de complementación productiva entre las ramas manufactureras.",
        "start": 5307.92,
        "end": 5318.92
    },
    {
        "text": " Y es el antecedente más importante que se firman a nivel de previo al marco sur.",
        "start": 5318.92,
        "end": 5326.92
    },
    {
        "text": " Imagínense que en el 91 se firma el tratado de asunción del marco sur.",
        "start": 5326.92,
        "end": 5333.92
    },
    {
        "text": " El pec fue de menor.",
        "start": 5336.92,
        "end": 5343.92
    },
    {
        "text": " Si no vamos concretamente a los procesos y etapas de la integración,",
        "start": 5366.92,
        "end": 5389.92
    },
    {
        "text": " podemos identificar que tenemos diferentes modalidades y que los procesos de integración no se dan en forma automática,",
        "start": 5389.92,
        "end": 5399.92
    },
    {
        "text": " sino van por diferentes etapas.",
        "start": 5399.92,
        "end": 5404.92
    },
    {
        "text": " En busca de insertarse de integrarse regionalmente, de integrar, de que puedan ser entendidos como diferentes procesos.",
        "start": 5404.92,
        "end": 5417.92
    },
    {
        "text": " De que puedan ver las diferencias de la integración regional y de que puedan ver las diferencias.",
        "start": 5417.92,
        "end": 5437.92
    },
    {
        "text": " Y más muchas veces se declara de una forma y en la realidad no se desees de otra.",
        "start": 5437.92,
        "end": 5444.92
    },
    {
        "text": " Vamos a ir como en diferentes grados de integración desde lo más simple, a lo menos integrado de lo más integrado.",
        "start": 5444.92,
        "end": 5452.92
    },
    {
        "text": " Las zonas de tarifas preferenciales.",
        "start": 5452.92,
        "end": 5468.92
    },
    {
        "text": " Son acuerdos de preferencias comerciales en algunos rubros por montos o cufos.",
        "start": 5468.92,
        "end": 5478.92
    },
    {
        "text": " Por ejemplo, el cauce y el pec.",
        "start": 5478.92,
        "end": 5486.92
    },
    {
        "text": " Son acuerdos de preferencias comerciales para algunos rubros, teniendo algunos cufos o algunos montos.",
        "start": 5486.92,
        "end": 5493.92
    },
    {
        "text": " Puede ser en cantidades o en montos de cortar.",
        "start": 5493.92,
        "end": 5498.92
    },
    {
        "text": " Ese es el como el menor grado.",
        "start": 5498.92,
        "end": 5502.92
    },
    {
        "text": " Se basan siempre lógicas de complementaría comercial.",
        "start": 5502.92,
        "end": 5506.92
    },
    {
        "text": " Otro son las zonas de libre comercio.",
        "start": 5506.92,
        "end": 5513.92
    },
    {
        "text": " Es un poquito más de integración.",
        "start": 5513.92,
        "end": 5518.92
    },
    {
        "text": " Y lo que implica las zonas de libre comercio es la eliminación de las barreras comerciales entre dos o más países.",
        "start": 5518.92,
        "end": 5526.92
    },
    {
        "text": " Pero cada uno mantiene su propia política económica.",
        "start": 5526.92,
        "end": 5530.92
    },
    {
        "text": " Entonces, se liberan las barreras comerciales, pueden ser entre dos o más, pero cada uno mantiene su política.",
        "start": 5530.92,
        "end": 5551.92
    },
    {
        "text": " Comercial con el resto del mundo.",
        "start": 5551.92,
        "end": 5558.92
    },
    {
        "text": " El mercosurro empezó siendo una zona de libre comercio.",
        "start": 5558.92,
        "end": 5566.92
    },
    {
        "text": " Otro es la unión adiovanera.",
        "start": 5566.92,
        "end": 5573.92
    },
    {
        "text": " Ahí, perdón.",
        "start": 5573.92,
        "end": 5580.92
    },
    {
        "text": " ¿Qué implica?",
        "start": 5580.92,
        "end": 5582.92
    },
    {
        "text": " Es la zona de libre comercio más un arancel externo común.",
        "start": 5582.92,
        "end": 5595.92
    },
    {
        "text": " Un cuarto es un mercado común.",
        "start": 5603.92,
        "end": 5610.92
    },
    {
        "text": " Es una unión adiovanera.",
        "start": 5610.92,
        "end": 5617.92
    },
    {
        "text": " Es una unión adiovanera.",
        "start": 5617.92,
        "end": 5624.92
    },
    {
        "text": " Con libre circulación.",
        "start": 5624.92,
        "end": 5633.92
    },
    {
        "text": " De factores productivos.",
        "start": 5633.92,
        "end": 5641.92
    },
    {
        "text": " Con políticas comerciales comunes.",
        "start": 5641.92,
        "end": 5652.92
    },
    {
        "text": " Y con coordinación de política macroeconómica.",
        "start": 5652.92,
        "end": 5662.92
    },
    {
        "text": " La comunidad económica europea.",
        "start": 5662.92,
        "end": 5667.92
    },
    {
        "text": " Y en quinto lugar tenemos la unión económica.",
        "start": 5667.92,
        "end": 5678.92
    },
    {
        "text": " ¿Qué implica, además de toda la anterior?",
        "start": 5678.92,
        "end": 5685.92
    },
    {
        "text": " Una moneda común.",
        "start": 5685.92,
        "end": 5694.92
    },
    {
        "text": " Un banco central que unifica la política financiera y monetaria común.",
        "start": 5695.92,
        "end": 5710.92
    },
    {
        "text": " Una única autoridad monetaria.",
        "start": 5710.92,
        "end": 5713.92
    },
    {
        "text": " El ejemplo, la unión europea.",
        "start": 5713.92,
        "end": 5715.92
    },
    {
        "text": " La unión europea transito de un mercado común a una unión europea.",
        "start": 5715.92,
        "end": 5723.92
    },
    {
        "text": " Muchas veces se da que nos declara, se declara ser un tipo,",
        "start": 5723.92,
        "end": 5740.92
    },
    {
        "text": " pero eso se transforme imperfecta.",
        "start": 5740.92,
        "end": 5743.92
    },
    {
        "text": " Porque no se están cumpliendo todas las condiciones.",
        "start": 5743.92,
        "end": 5746.92
    },
    {
        "text": " Se gara a coordinar las políticas macroeconómicas.",
        "start": 5746.92,
        "end": 5749.92
    },
    {
        "text": " Y a veces para cuando se quiera agregar un socio y se le ponen determinadas condiciones.",
        "start": 5749.92,
        "end": 5756.92
    },
    {
        "text": " Acuérdense con la unión europea, con la crisis griega.",
        "start": 5756.92,
        "end": 5765.92
    },
    {
        "text": " Se entendió las etapas, se entendió las diferencias y cómo se van agregando, van escalonadas.",
        "start": 5765.92,
        "end": 5772.92
    },
    {
        "text": " Y que cada una va un poco más en el grado integración.",
        "start": 5772.92,
        "end": 5776.92
    },
    {
        "text": " Estos an niveles ideal.",
        "start": 5776.92,
        "end": 5778.92
    },
    {
        "text": " En la práctica después existen problemas, diferencias, unificar las políticas no es fácil.",
        "start": 5778.92,
        "end": 5784.92
    },
    {
        "text": " Ahora hay un proceso entre alguna crítica, de alguna forma, todo el proceso del Brexit.",
        "start": 5784.92,
        "end": 5794.92
    },
    {
        "text": " Ahora con todo este tema de España y Cataluña, como impactan temas de la política de la unión europea,",
        "start": 5794.92,
        "end": 5800.92
    },
    {
        "text": " si Cataluña se declara independiente. ¿Seguirá formando parte de la unión europea o no?",
        "start": 5800.92,
        "end": 5810.92
    },
    {
        "text": " Los procesos políticos, cómo van de la mano de los procesos económicos y cómo estas dimensiones de procesos",
        "start": 5810.92,
        "end": 5815.92
    },
    {
        "text": " que empiezan siendo económicos, tienen implicancias políticas fuertes.",
        "start": 5815.92,
        "end": 5821.92
    },
    {
        "text": " Bien.",
        "start": 5821.92,
        "end": 5824.92
    },
    {
        "text": " La clase que viene, vamos a dar en Mercosur, vamos a dar las características del Mercosur, la evolución",
        "start": 5825.92,
        "end": 5831.92
    },
    {
        "text": " y vamos a analizar un poco en detalle al resto de los procesos de integración a nivel de Uruguay.",
        "start": 5831.92,
        "end": 5836.92
    },
    {
        "text": " Y cuáles son las características que hay en que este diferencia. Y como de alguna forma se complementa.",
        "start": 5836.92,
        "end": 5842.92
    },
    {
        "text": " No vemos el vierno.",
        "start": 5842.92,
        "end": 5844.92
    }
]