[
    {
        "text": " Vamos, vamos arriba.",
        "start": 0.0,
        "end": 5.28
    },
    {
        "text": " Repasamos un poquito rápido lo que hagamos esto la he pasado y terminamos el tema de este",
        "start": 5.28,
        "end": 11.6
    },
    {
        "text": " propuesta valor y muestra el negocio.",
        "start": 11.6,
        "end": 13.8
    },
    {
        "text": " Bueno, hagamos al lado de lo propuesta valor, ¿también?",
        "start": 13.8,
        "end": 19.0
    },
    {
        "text": " ¿Por qué comprábamos en terminado del lugar o en terminado marca de ropa y que necesidad",
        "start": 19.0,
        "end": 26.36
    },
    {
        "text": " de esa tipacidad eso?",
        "start": 26.36,
        "end": 29.48
    },
    {
        "text": " Y habíamos asociado a la propuesta de valor con el negocio del cliente.",
        "start": 29.48,
        "end": 36.24
    },
    {
        "text": " Recordando que negocios en también los generales no siempre, nuestro cliente van a ser un negocio",
        "start": 36.24,
        "end": 42.28
    },
    {
        "text": " con un objetivo financiero.",
        "start": 42.28,
        "end": 46.0
    },
    {
        "text": " Habíamos hablado también bastante de esta formulita, ¿no?",
        "start": 46.0,
        "end": 48.6
    },
    {
        "text": " El valor es el beneficio que obtiene el cliente por nuestro producto servicio y eso obviamente",
        "start": 48.6,
        "end": 57.04
    },
    {
        "text": " es positivo, ¿no?",
        "start": 57.04,
        "end": 59.2
    },
    {
        "text": " Es de términos positivo o por lo menos se hacemos algo mínimamente que sirve para algo.",
        "start": 59.2,
        "end": 64.88
    },
    {
        "text": " Después, restando aparece el costo que va a pagar por el producto servicio que le vamos",
        "start": 64.88,
        "end": 68.8
    },
    {
        "text": " a dar y restando también aparece el riesgo y casi que si la seditar ahora podría",
        "start": 68.8,
        "end": 76.84
    },
    {
        "text": " ser una percepción de riesgo, porque se van a que ya hemos dicho que no necesariamente",
        "start": 76.84,
        "end": 82.44
    },
    {
        "text": " tenía que ser un riesgo real, podía ser un riesgo percibido en lo que pusiera en riesgo",
        "start": 82.44,
        "end": 88.32000000000001
    },
    {
        "text": " para que la redundancia nuestra propuesta de valor.",
        "start": 88.32000000000001,
        "end": 93.04
    },
    {
        "text": " Y habíamos hablado del riesgo que representaría, por ejemplo, para un cliente establecido,",
        "start": 93.04,
        "end": 99.96000000000001
    },
    {
        "text": " una empresa establecida, comprarle a 4, 5 o 6 amigos que se juntan en favor, incluso",
        "start": 99.96,
        "end": 107.44
    },
    {
        "text": " cuando el precio sea el mejor y cuando el precio es el mejor y que la propuesta técnica",
        "start": 107.44,
        "end": 116.32
    },
    {
        "text": " también sea la mejor.",
        "start": 116.32,
        "end": 117.72
    },
    {
        "text": " O sea, el riesgo que percibe el cliente es algo súper importante, más allá de que sea",
        "start": 117.72,
        "end": 125.6
    },
    {
        "text": " nada así o no sea tan así.",
        "start": 125.6,
        "end": 130.84
    },
    {
        "text": " Realizamos un par de ejemplos de Instagram y en particular, este, que me parece que estaba",
        "start": 130.84,
        "end": 136.68
    },
    {
        "text": " muy bueno porque acá lo que hizo esta gente fue convertir, o lo que entiendo que hizo",
        "start": 136.68,
        "end": 142.84
    },
    {
        "text": " fue convertir la propuesta valor en un tagline, como en el moto de esa empresa.",
        "start": 142.84,
        "end": 152.32
    },
    {
        "text": " Y de hecho, está bien conciso y además incluye la propuesta valor para cada segmento.",
        "start": 152.32,
        "end": 160.51999999999998
    },
    {
        "text": " O sea, esta gente tiene 12 metros de cliente, una es el adulto mayor que usa el sistema de",
        "start": 160.51999999999998,
        "end": 166.56
    },
    {
        "text": " seguridad y el otro es la familia.",
        "start": 166.56,
        "end": 169.28
    },
    {
        "text": " Entonces va al grano, al hueso diciendo seguridad para el adulto mayor y la habilidad",
        "start": 169.28,
        "end": 175.32
    },
    {
        "text": " para la restra familia.",
        "start": 175.32,
        "end": 179.07999999999998
    },
    {
        "text": " Bueno, a pesar de hablamos de KPIs, dijimos que, bueno, a ver, primero es un tema importante",
        "start": 180.08,
        "end": 187.44
    },
    {
        "text": " porque es parte de la cultura general de los que es negocios y bien particular también",
        "start": 187.44,
        "end": 193.84
    },
    {
        "text": " en los negocios de software, en el útil de software se usa, pero además también porque",
        "start": 193.84,
        "end": 198.44
    },
    {
        "text": " cuando hablamos de propuesta valor, muchas veces va a impactar en KPIs, estaría bueno",
        "start": 198.44,
        "end": 203.88000000000002
    },
    {
        "text": " relacionar la propuesta valor con KPIs.",
        "start": 203.88000000000002,
        "end": 206.92000000000002
    },
    {
        "text": " Picholo Bruto, una KPIs es una métrica de algunas expectas importantes del negocio",
        "start": 206.92,
        "end": 213.39999999999998
    },
    {
        "text": " el cliente.",
        "start": 213.39999999999998,
        "end": 214.39999999999998
    },
    {
        "text": " Y, dicho, también el de Bruto, nuestra propuesta de valor idealmente debiera impactar",
        "start": 214.39999999999998,
        "end": 220.72
    },
    {
        "text": " alguna KPIs del cliente, porque a ver, no es que siempre tenga que ser así, pero en la",
        "start": 220.72,
        "end": 227.48
    },
    {
        "text": " medida que no impacte ninguna KPIs, ¿qué quiere decir por consecuencia?",
        "start": 227.48,
        "end": 231.32
    },
    {
        "text": " Que el valor que le damos no le está moviendo en la aguja a ninguna de las métricas relevantes",
        "start": 231.32,
        "end": 236.48
    },
    {
        "text": " del negocio del cliente.",
        "start": 236.48,
        "end": 237.48
    },
    {
        "text": " Después hablamos de el Value Proposition Campas.",
        "start": 237.48,
        "end": 245.95999999999998
    },
    {
        "text": " Pero puede usar también para a la hora de vender o sea para proponer valores que cabellas.",
        "start": 245.95999999999998,
        "end": 251.95999999999998
    },
    {
        "text": " Eso de nuestros usuarios, tipo, mejoren en 10% el tiempo.",
        "start": 251.95999999999998,
        "end": 257.4
    },
    {
        "text": " Totalmente, totalmente, totalmente.",
        "start": 257.4,
        "end": 259.15999999999997
    },
    {
        "text": " Y eso lo van a ver en algunos casos de éxito.",
        "start": 259.15999999999997,
        "end": 261.64
    },
    {
        "text": " De hecho, los mejores casos de éxito son los que tienen medida de impacto, que es eso",
        "start": 261.64,
        "end": 265.44
    },
    {
        "text": " justamente lo que usted ha dicho en lo que ha dicho.",
        "start": 265.44,
        "end": 268.68
    },
    {
        "text": " Y ahí se dice así, no se dice que estás mostrando en el caso de éxito el impacto que",
        "start": 268.68,
        "end": 275.52
    },
    {
        "text": " tuvo tu proyecto o tu software o tu soluciones general.",
        "start": 275.52,
        "end": 279.68
    },
    {
        "text": " Entonces, ponos realmente le decís que le mejorás la KPI tal, sino que decí, o sea,",
        "start": 279.68,
        "end": 286.68
    },
    {
        "text": " la cuantificaz.",
        "start": 286.68,
        "end": 287.68
    },
    {
        "text": " No decir, mira, en promedio, nuestros clientes mejoran por lo menos un 10% en tal cosa.",
        "start": 287.68,
        "end": 292.48
    },
    {
        "text": " Y, oye, ese mensaje va a resonar en el segmento o en el público objetivo que tenga ese problema,",
        "start": 293.48,
        "end": 300.96000000000004
    },
    {
        "text": " obviamente.",
        "start": 300.96000000000004,
        "end": 301.96000000000004
    },
    {
        "text": " Por eso es importante saber a quién le está hablando, o sea, cuál es el segmento de clientes.",
        "start": 301.96000000000004,
        "end": 306.56
    },
    {
        "text": " Y tener mensajes de valor que sí que están tergeteados al segmento de cliente que",
        "start": 306.56,
        "end": 311.8
    },
    {
        "text": " le queréis hablar.",
        "start": 311.8,
        "end": 313.28000000000003
    },
    {
        "text": " Después cuando en Marketing vean la parte de Canales de Marketing, ahí van a ver un",
        "start": 313.28000000000003,
        "end": 317.28000000000003
    },
    {
        "text": " poquito más claro que vos puedes usar un canal, o sea, una forma de llegar a un segmento",
        "start": 317.28,
        "end": 322.55999999999995
    },
    {
        "text": " cliente y otra otro.",
        "start": 322.55999999999995,
        "end": 324.03999999999996
    },
    {
        "text": " Entonces ahí te podes como multiplexar un poco las comunicaciones de valor que haces",
        "start": 324.03999999999996,
        "end": 328.96
    },
    {
        "text": " voz.",
        "start": 328.96,
        "end": 329.96
    },
    {
        "text": " Es un poco más tricky la página web, por ejemplo, porque está ahí, está como pasiva y",
        "start": 329.96,
        "end": 335.4
    },
    {
        "text": " todo el mundo puede ver tu página web sin importar de qué segmento de cliente vengan.",
        "start": 335.4,
        "end": 340.47999999999996
    },
    {
        "text": " Eso también es una discusión interesante.",
        "start": 340.47999999999996,
        "end": 342.59999999999997
    },
    {
        "text": " Y de hecho, muchas veces usan la landing page para eso, ¿no?",
        "start": 342.6,
        "end": 346.08000000000004
    },
    {
        "text": " A alguna campaña y mando una landing page, cosa de que esa landing le hace mucho sentido",
        "start": 346.08000000000004,
        "end": 351.8
    },
    {
        "text": " a ese segmento de cliente que recibió la campaña.",
        "start": 351.8,
        "end": 354.68
    },
    {
        "text": " No, eso justo de donde trabajo yo, por ejemplo, se investiga a Pira, o de táxipo",
        "start": 354.68,
        "end": 361.64000000000004
    },
    {
        "text": " ni movillaria.",
        "start": 361.64000000000004,
        "end": 362.64000000000004
    },
    {
        "text": " Y lo que tienen es que tose aparte de tener el sitio de ella donde está, naturalmente,",
        "start": 362.64000000000004,
        "end": 368.72
    },
    {
        "text": " puede decir y buscar tipo para el cliente de eso.",
        "start": 368.72,
        "end": 372.04
    },
    {
        "text": " Ellos tienen dipanuncios también, yo que se ven a RmNB en Craigslist, en cosas así.",
        "start": 372.04,
        "end": 378.52000000000004
    },
    {
        "text": " No se dice justamente eso, me acuerdo que traquean también ese adecuado de por dónde",
        "start": 378.52000000000004,
        "end": 382.40000000000003
    },
    {
        "text": " llegar a nuestro sitio, de las otras cosas.",
        "start": 382.40000000000003,
        "end": 385.8
    },
    {
        "text": " Y después, por ejemplo, he visto que usan las métricas esas para justificar proyectos,",
        "start": 385.8,
        "end": 391.76000000000005
    },
    {
        "text": " por ejemplo, separan equipos y tienen equipos dedicados a mejorar un cabri.",
        "start": 391.76000000000005,
        "end": 396.36
    },
    {
        "text": " Bueno, exacto, exacto.",
        "start": 397.2,
        "end": 398.52000000000004
    },
    {
        "text": " Eso es una tremenda definición de la que es un KPI.",
        "start": 398.52000000000004,
        "end": 400.72
    },
    {
        "text": " Y a ver, yo dije KPI es a nivel empresa como para no complicarla, pero en realidad hay",
        "start": 400.72,
        "end": 405.44
    },
    {
        "text": " varios niveles de KPI.",
        "start": 405.44,
        "end": 407.08000000000004
    },
    {
        "text": " Pasar a mí mismo con los OKJ, con la forma de que se tean y se miden los objetivos,",
        "start": 407.08000000000004,
        "end": 411.64
    },
    {
        "text": " ¿no?",
        "start": 411.64,
        "end": 412.64
    },
    {
        "text": " Pero hay varios niveles de KPI.",
        "start": 412.64,
        "end": 413.64
    },
    {
        "text": " Hay un KPI que es tipo, no sé, el nivel del CEO, el nivel del C-level, por ejemplo,",
        "start": 413.64,
        "end": 418.04
    },
    {
        "text": " del management, que es tipo un dashboard que va a que muy grosero, no sé, con el",
        "start": 418.04,
        "end": 422.36
    },
    {
        "text": " ingreso con la cantidad de ventales, cosas muy groseras.",
        "start": 422.36,
        "end": 426.8
    },
    {
        "text": " Pero pues cada área tiene también su conjunto de KPI que están alineadas con esas",
        "start": 426.8,
        "end": 430.92
    },
    {
        "text": " capas y más generales, y ahí puede haciendo como un drill down, ¿no?",
        "start": 430.92,
        "end": 433.92
    },
    {
        "text": " Y lo que os dice, está igual, o sea, miden el esfuerzo que invierten en marketing en cada",
        "start": 433.92,
        "end": 440.12
    },
    {
        "text": " uno de los canales para después reforzar en la medida de la cual es en la KPI.",
        "start": 440.12,
        "end": 444.64
    },
    {
        "text": " Y bueno, y el primer cambas que vamos a ver que vimos, que es este de valio por proposición",
        "start": 444.64,
        "end": 454.15999999999997
    },
    {
        "text": " cambas, lo que busca es ver cuánto fit hay, ¿no?",
        "start": 454.15999999999997,
        "end": 461.24
    },
    {
        "text": " ¿Cuánta coincidencia hay entre lo que hace, lo que le duele y lo que lo satisface a ese",
        "start": 461.24,
        "end": 468.8
    },
    {
        "text": " segmento de clienta, ese tipo de cliente y lo que nosotros hacemos en productos servicios",
        "start": 468.8,
        "end": 474.44
    },
    {
        "text": " y cómo la livíamos de los dolores y cómo le mejoramos, le hacemos un bust a la aljalfa",
        "start": 474.44,
        "end": 481.76
    },
    {
        "text": " de las ganancias o a las o a lo que le hace bien ahí se cliente.",
        "start": 481.76,
        "end": 486.84
    },
    {
        "text": " Entonces, aguarda ese que el valio por proposición cambas es uno por cada segmento de cliente",
        "start": 486.84,
        "end": 493.08
    },
    {
        "text": " y se pone en los customer jobs, se pone que cosas hace ese cliente, o sea, esa instancia",
        "start": 493.08,
        "end": 499.88
    },
    {
        "text": " de segmento de cliente, o sea, qué cosas hacen su día a día y esas cosas le generan dolores",
        "start": 499.88,
        "end": 506.8
    },
    {
        "text": " y satisfacciones y las ponemos.",
        "start": 506.8,
        "end": 509.44
    },
    {
        "text": " Y después, a ver, lo que está a la derecha no tiene nada que haber con tecnología,",
        "start": 509.44,
        "end": 513.92
    },
    {
        "text": " estamos guardando, o sea, es entender, meterse en la cabeza en los zapatos de ese tipo de",
        "start": 513.92,
        "end": 518.84
    },
    {
        "text": " cliente, este tipo de agua, esta persona ahí, gulamos, leemos artículos, leemos, escuchamos",
        "start": 518.84,
        "end": 525.04
    },
    {
        "text": " revistas, o sea, nos tratamos de parar en los zapatos de ese segmento cliente, decimos",
        "start": 525.04,
        "end": 529.92
    },
    {
        "text": " a esta persona, ejecuta típicamente estas cosas, no, no sé, responsable de el revenido",
        "start": 529.92,
        "end": 537.7199999999999
    },
    {
        "text": " de la sucursal y responsable de recruiting, un manager de un franchise, por ejemplo, entonces",
        "start": 537.7199999999999,
        "end": 545.8399999999999
    },
    {
        "text": " ponemos todo lo que hace y después hicimos, bueno, ¿y qué le dole y tratamos entender cuáles",
        "start": 545.8399999999999,
        "end": 551.88
    },
    {
        "text": " son los pains, ¿no? Ejecutanas estareas, ¿qué pain tiene? ¿Y cuáles son los gains?",
        "start": 551.88,
        "end": 556.4399999999999
    },
    {
        "text": " ¿Qué nios? ¿Cuáles son las cosas que lo hacen feliz, que le mejoran las KPIs, que",
        "start": 556.4399999999999,
        "end": 559.96
    },
    {
        "text": " lo dejan contento? Y toda la visión derecha que están rojos es simplemente entender el mundo",
        "start": 559.96,
        "end": 565.76
    },
    {
        "text": " de mi cliente, entender el negocio de mi cliente. Y lo que está en izquierda en verde es,",
        "start": 565.76,
        "end": 570.64
    },
    {
        "text": " bueno, yo nosotros, ¿qué vamos a hacer para ayudarlo con esos dolores y ayudarlo con esas",
        "start": 570.64,
        "end": 577.68
    },
    {
        "text": " alegrías? ¿Entienden?",
        "start": 577.68,
        "end": 579.16
    },
    {
        "text": " Bueno, acá hay algunos ejemplos, habíamos visto el de Starbox y en particular para los",
        "start": 581.88,
        "end": 590.24
    },
    {
        "text": " estudiantes, para ese segmento cliente en particular. Bueno, hablamos también algunos",
        "start": 590.24,
        "end": 598.48
    },
    {
        "text": " comentar donde la propuesta valor de las empresas en las que trabajan. Y habíamos empezado",
        "start": 598.48,
        "end": 605.32
    },
    {
        "text": " a hablar de modelo de negocio y en particular del business model Canvas, que lo voy a poner",
        "start": 605.32,
        "end": 610.6
    },
    {
        "text": " acá, que tenía como cuatro grandes partes que lo que aparece en el izquierda abajo y son",
        "start": 610.6,
        "end": 617.44
    },
    {
        "text": " nueve bloques que lo constituyen. Lo más importante del Value Proposición Canvas es la",
        "start": 617.44,
        "end": 625.28
    },
    {
        "text": " parte del medio, que es justamente la propuesta de valor. Por eso, la propuesta valor junto",
        "start": 625.28,
        "end": 630.44
    },
    {
        "text": " con los cementos clientes son las primeras dos cosas que hay que hacer. Y que vamos a",
        "start": 630.44,
        "end": 635.24
    },
    {
        "text": " ver qué después, eso es literalmente el laburo que ya se hizo con el Value Proposición",
        "start": 635.24,
        "end": 639.6800000000001
    },
    {
        "text": " Canvas si es que se llevó a hacer un Value Proposición Canvas. Por eso, de hecho, el",
        "start": 639.68,
        "end": 645.5999999999999
    },
    {
        "text": " Value Proposición Canvas, si se hace, se suele hacer antes con VINEMO del Canvas, porque",
        "start": 645.5999999999999,
        "end": 649.8
    },
    {
        "text": " VINEMO del Canvas tiene esas secciones y muchas más y siete más. Entonces, lo del medio",
        "start": 649.8,
        "end": 656.3599999999999
    },
    {
        "text": " del Canvas, del VINEMO del Canvas, es la propuesta de valor. O sea, qué valor le doy a mis",
        "start": 656.3599999999999,
        "end": 662.68
    },
    {
        "text": " clientes? Y si tengo varios segmentos de cliente que en el VINEMO del Canvas sí puedo poner",
        "start": 662.68,
        "end": 668.16
    },
    {
        "text": " más de un segmento de cliente, lo ideal es poner para cada uno cuál es la propuesta",
        "start": 668.16,
        "end": 674.28
    },
    {
        "text": " de valor que tengo. Obviamente, si tiene sentido, capaz que tengo, o sea, tres segmentos",
        "start": 674.28,
        "end": 680.12
    },
    {
        "text": " de cliente, pero en realidad la propuesta valor es la misma para los tres. Bueno, perfecto.",
        "start": 680.12,
        "end": 684.7199999999999
    },
    {
        "text": " Ahí no vamos a hacer copy paste. Ahora, muchas veces pasa que el valor que yo le doy a un",
        "start": 684.7199999999999,
        "end": 690.64
    },
    {
        "text": " segmento de cliente no es exactamente el mismo que lo otro. Y ahí creo que el ejemplo",
        "start": 690.64,
        "end": 694.48
    },
    {
        "text": " que yo le estoy comentado, que creo que bastante, bastante sencillo, es el de los marketing",
        "start": 694.48,
        "end": 699.24
    },
    {
        "text": " places. En general, los marketing places, o sea, las soluciones que juntan proveedor y",
        "start": 699.24,
        "end": 704.72
    },
    {
        "text": " compradores, la propuesta valor que tiene para el comprador es bien distinta, la propuesta",
        "start": 704.72,
        "end": 709.04
    },
    {
        "text": " valor que tiene para la proveedor. Y también podría pasar que hay algunos elementos que son",
        "start": 709.04,
        "end": 715.5600000000001
    },
    {
        "text": " comunes a los dos propuestas valor. Entonces, bueno, medio que entre comillas sacamos con un",
        "start": 715.5600000000001,
        "end": 720.6800000000001
    },
    {
        "text": " factor común y ponemos, la gente se pone, value drivers, value drivers generales y no",
        "start": 720.68,
        "end": 726.68
    },
    {
        "text": " sé, este ahorro de no sé qué. Ese ahorro aplica para todos los segmentos. Entonces,",
        "start": 726.68,
        "end": 732.0
    },
    {
        "text": " capaz que lo podemos poner con un post-it arriba al todo diciendo que es un, un value driver",
        "start": 732.0,
        "end": 736.8
    },
    {
        "text": " general. Y después, para este segmento, además de la ahorro, le aportó esto. Para este otro,",
        "start": 736.8,
        "end": 743.0
    },
    {
        "text": " le aportó de todos. Y después, esa propuesta valor tiene que ser entregada y ahí no vamos",
        "start": 743.0,
        "end": 752.28
    },
    {
        "text": " moviendo hacia la derecha, tiene que ser entregada a esos segmentos de clientes. ¿Cómo hacemos",
        "start": 752.28,
        "end": 757.0
    },
    {
        "text": " para que nuestro negocio entre esa propuesta valor a esos clientes? Bueno, la entrega, hasta",
        "start": 757.0,
        "end": 764.0
    },
    {
        "text": " incluso a veces física, logística, etcétera, es a través de un canal, que puede ser un canal",
        "start": 764.0,
        "end": 770.16
    },
    {
        "text": " de distribución, un canal de comunicación, un canal de venta. O sea, hay varios tipos de canales.",
        "start": 770.16,
        "end": 775.16
    },
    {
        "text": " Y ahí también si hace sentido está bueno por algún comentario de qué tipo de canal estamos",
        "start": 775.16,
        "end": 781.16
    },
    {
        "text": " hablando. Ahora, alguna forma necesitamos para comunicarnos con esos clientes para hacer",
        "start": 781.16,
        "end": 787.0799999999999
    },
    {
        "text": " que llegarnos nuestro valor. Ahora, ese canal, que como así puede ser físico, no sé, en algunos",
        "start": 787.0799999999999,
        "end": 793.4399999999999
    },
    {
        "text": " modelos de negocio, bueno, el canal es, no sé, una cadena logística, por ejemplo, bueno,",
        "start": 793.4399999999999,
        "end": 798.12
    },
    {
        "text": " para un camión, como está el dibujito ahí, y entrega egoísicamente. Bueno, el anunestro",
        "start": 798.12,
        "end": 803.12
    },
    {
        "text": " típicamente digital, pero podría ser, por ejemplo, un canal de venta directo, que es si los clientes",
        "start": 803.12,
        "end": 810.36
    },
    {
        "text": " vienen a mi página y me compran y descargan, etcétera, desde mi sitio, o puede ser un canal de venta",
        "start": 810.36,
        "end": 816.48
    },
    {
        "text": " indirecto, como es el ejemplo típico de un store. Ahora, más allá del canal que es importante,",
        "start": 816.48,
        "end": 824.04
    },
    {
        "text": " hay que ver usando ese canal, ¿qué relación queremos tener con nuestros clientes? ¿O qué tipo",
        "start": 824.04,
        "end": 831.4399999999999
    },
    {
        "text": " de relación? Y por eso aparece el corazóncito de ese. Y ese tipo de relación tiene mucho que ver tanto",
        "start": 831.4399999999999,
        "end": 837.24
    },
    {
        "text": " con la propuesta de valor, como con el segmento cliente, como con el mercado que estamos apuntando.",
        "start": 837.24,
        "end": 843.4399999999999
    },
    {
        "text": " Porque, porque un mercado de nicho es razonable tener, por ejemplo, un tipo de relación personalizada",
        "start": 843.4399999999999,
        "end": 850.7199999999999
    },
    {
        "text": " 1 a 1, ¿tá? Porque son menos clientes en ese segmento de nicho. Ahora, en el mercado masivo,",
        "start": 850.72,
        "end": 858.6
    },
    {
        "text": " y habíamos hablado, por ejemplo, de Japspot, ¿sí? ¿cuándo? En el mercado masivo, no tiene sentido que",
        "start": 858.6,
        "end": 863.36
    },
    {
        "text": " Japspot esté llamando a cada uno para los más de los $50 dólares después por mes que le vamos a pagar.",
        "start": 863.36,
        "end": 868.2
    },
    {
        "text": " Entonces, en ese caso, en la relación con el cliente, nos van a querer crear que es súper personalizada,",
        "start": 868.2,
        "end": 874.48
    },
    {
        "text": " de blabla, en realidad es totalmente automatizada y de última cada tanto, se escala a algún incidente,",
        "start": 874.48,
        "end": 880.5600000000001
    },
    {
        "text": " por algún mail que yo me dan de o algo de estilo.",
        "start": 880.5600000000001,
        "end": 882.76
    },
    {
        "text": " Después, lo que está abajo, como para terminar la parte de la derecha, es una vez que yo entregué esa",
        "start": 887.6800000000001,
        "end": 894.12
    },
    {
        "text": " propuesta de valor a esos segmentos de cliente a través de ese canal y que ese canal me permite mantener",
        "start": 894.12,
        "end": 900.84
    },
    {
        "text": " ese tipo de relación con los clientes, bueno, que es lo que va a tener yo, yo voy a obtener mi valor,",
        "start": 900.84,
        "end": 905.96
    },
    {
        "text": " que en general obviamente es a través de ingresos, a través de dinero, de vuelta no siempre,",
        "start": 905.96,
        "end": 911.72
    },
    {
        "text": " pero en general es a través de un flujo de ingresos. Y ahí, que llama Revenue Streams, en inglés,",
        "start": 911.72,
        "end": 916.96
    },
    {
        "text": " esas son los flujos entre ingresos literal, no hay que poner cuánta plata voy a hacer.",
        "start": 916.96,
        "end": 922.08
    },
    {
        "text": " Acá rase que esto no es un plan de negocio, esto es un modelo de negocio.",
        "start": 922.08,
        "end": 926.48
    },
    {
        "text": " Acá estamos mostrando la lógica que va a tener el modelo del producto, de lo que vamos a hacer,",
        "start": 926.96,
        "end": 933.6
    },
    {
        "text": " o alguno que está en el rationale, o sea, cuál es la lógica que tiene. Entonces, no es necesario decir,",
        "start": 933.6,
        "end": 939.24
    },
    {
        "text": " ah, voy a vender esto a 10 mil dólares o a 5. Capas que si ya lo saben, lo pueden poner,",
        "start": 939.24,
        "end": 945.4
    },
    {
        "text": " porque ya está aquí en piedra, pero justamente de hecho, acá, capas que pongo, bueno,",
        "start": 945.4,
        "end": 950.04
    },
    {
        "text": " el Revenue Stream va a ser una licencia premium y no tengo que decir, si son 10 dólares,",
        "start": 950.76,
        "end": 955.68
    },
    {
        "text": " 20 o 50, eso lo veré después. Lo importante es ver qué tipos de ingresos va a tener,",
        "start": 955.68,
        "end": 960.4399999999999
    },
    {
        "text": " si es, por ejemplo, por la licencia premium y si es IO, por ads, por publicidad, o si es",
        "start": 960.4399999999999,
        "end": 970.16
    },
    {
        "text": " por servicios a medida, o si por si no sé, capas que lo venden como marca blanca, otras empresas",
        "start": 970.16,
        "end": 975.16
    },
    {
        "text": " que redistribuyen mi producto, en fin, ahí pondremos por qué concepto mi empresa va a recibir",
        "start": 975.16,
        "end": 981.1999999999999
    },
    {
        "text": " y que eso. Y después, todo lo que está en la izquierda es cómo construyo ese valor, cómo construyo",
        "start": 981.1999999999999,
        "end": 987.64
    },
    {
        "text": " esa propuesta valor. Y lo más importante, si se quiere, son los bloques 6 y 7, los recursos claves,",
        "start": 987.64,
        "end": 997.8399999999999
    },
    {
        "text": " la circunidad clave, porque es como que el límite de mi empecita es como si fuera ese, o sea,",
        "start": 997.8399999999999,
        "end": 1003.56
    },
    {
        "text": " las actividades que yo ejecuto en mi día a día y que son claves son estas y ahí ponemos",
        "start": 1004.1199999999999,
        "end": 1009.92
    },
    {
        "text": " cuáles son actividades claves y de vuelta clave, pagar los sueldos es obvio que lo vamos a hacer,",
        "start": 1009.92,
        "end": 1016.2399999999999
    },
    {
        "text": " entonces no es clave, entonces no ensucien un canvas, vinimos del canvas con cosas que van a ser",
        "start": 1016.2399999999999,
        "end": 1022.1199999999999
    },
    {
        "text": " obvias, pongan lo que es clave ese negocio, ahora si en realidad, o sea, si ponen pagar sueldo,",
        "start": 1022.1199999999999,
        "end": 1028.8799999999999
    },
    {
        "text": " quien lea el canvas va a decir, pa, pagar sueldo acá es la actividad y tal vez sí, pero ojo,",
        "start": 1028.88,
        "end": 1035.64
    },
    {
        "text": " no, componer una variedad que como la ponen como key activity, esa variedad deja de ser",
        "start": 1035.64,
        "end": 1041.68
    },
    {
        "text": " variedad y pasa a tomar una relevancia que seguramente no tenga, no sé, si tengo una plantilla de miles",
        "start": 1041.68,
        "end": 1046.7600000000002
    },
    {
        "text": " empleados y pagar el sueldo, es un temun, bueno perfecto, ahí sí, tendrás sentido,",
        "start": 1046.7600000000002,
        "end": 1052.16
    },
    {
        "text": " entienden, y bueno, como en Uber que lo choferes, o sea, tiene su parte, entonces lo podrías",
        "start": 1052.72,
        "end": 1059.64
    },
    {
        "text": " incluir ahí en parte de su sueldo, no sé, parecido, pero pero ojo que ahí, acuérdate que Uber,",
        "start": 1059.64,
        "end": 1066.96
    },
    {
        "text": " no o sea, los choferes no son empleados de ellos, o sea que tampoco es sueldo, son clientes,",
        "start": 1066.96,
        "end": 1072.8400000000001
    },
    {
        "text": " claro, son clientes y no sé, o sea, eso es la medida que está todo automatizado, no sé",
        "start": 1072.8400000000001,
        "end": 1078.28
    },
    {
        "text": " hasta que punto será clave, mira que no lo sé, tal vez lo sea para el negocio de Uber, no",
        "start": 1078.28,
        "end": 1082.76
    },
    {
        "text": " tengo ni idea, a ver, en general, por esto, modelos de negocios digitales, o sea, en",
        "start": 1082.76,
        "end": 1088.8799999999999
    },
    {
        "text": " tecnología en software, en particular, típicamente, efectividades claves tienen que ver con la parte",
        "start": 1088.8799999999999,
        "end": 1094.04
    },
    {
        "text": " comercial, con el delivery de ese producto servicio y a veces también con la pujventa, o sea, no sé,",
        "start": 1094.04,
        "end": 1101.36
    },
    {
        "text": " la prospección comercial, la setividad de marketing, esas son típicas, no, que actividades,",
        "start": 1102.08,
        "end": 1108.7199999999998
    },
    {
        "text": " el desarrollo del producto en sí, la actualización de versiones, el desarrollo de los proyectos",
        "start": 1108.7199999999998,
        "end": 1115.36
    },
    {
        "text": " a medida, o sea, obviamente que estamos hablando de software, tipo, programar en algún lado va a",
        "start": 1115.36,
        "end": 1120.32
    },
    {
        "text": " tener que ser clave, está de todo esto, y después tal vez alguna actividad de pujventa, esas",
        "start": 1120.32,
        "end": 1124.6799999999998
    },
    {
        "text": " suelen serlas las típicas, y después esas actividades, cómo las logros, bueno, las logros con",
        "start": 1124.6799999999998,
        "end": 1130.4399999999998
    },
    {
        "text": " recursos, recursos humanos, materiales, inversión, propiedad de actual, los hay recursos, y por eso",
        "start": 1130.44,
        "end": 1136.1000000000001
    },
    {
        "text": " abajo recursos, porque son los que soportan esas actividades, y nosotros es como que nuestra",
        "start": 1136.1000000000001,
        "end": 1143.4
    },
    {
        "text": " empresa sería como esos dos bloquecitos, no, en seis y en siete, lo que está a la izquierda,",
        "start": 1143.4,
        "end": 1149.52
    },
    {
        "text": " que es lo que partners, los socioclaves, esos son obviamente por definición, son otras empresas,",
        "start": 1149.52,
        "end": 1157.88
    },
    {
        "text": " u otras organizaciones, pero que me ayudan a mi a generar mi propuesta valor, son lo que están",
        "start": 1157.88,
        "end": 1164.24
    },
    {
        "text": " afuera, son con los cuales yo interactúo y en general tengo algún tipo de relación comercial,",
        "start": 1164.24,
        "end": 1169.5200000000002
    },
    {
        "text": " y de vuelta con ayuda de ellos es que yo genero mi propuesta valor, porque mi empresa no está en",
        "start": 1169.5200000000002,
        "end": 1177.2
    },
    {
        "text": " el ether, no, o sea, no, no, no, no hacemos absolutamente todo de PAP, lo que se necesita para",
        "start": 1177.2,
        "end": 1183.3600000000001
    },
    {
        "text": " producir esa propuesta valor, o sea, en general tenemos alianzas, tenemos partners, dependemos de otros,",
        "start": 1183.36,
        "end": 1189.3999999999999
    },
    {
        "text": " y bueno, y todo eso que está a la izquierda, siempre requiere costos, o sea, implica costos,",
        "start": 1190.3999999999999,
        "end": 1195.9199999999998
    },
    {
        "text": " entonces ahí ponemos algo parecido como poníamos en el revenue stream, o sea, en vez de decir,",
        "start": 1195.9199999999998,
        "end": 1201.6
    },
    {
        "text": " el sueldo del signo va a ser tanto, no, ponemos sueldo de developers, y ahí sí, en general en",
        "start": 1201.6,
        "end": 1208.04
    },
    {
        "text": " tecnología, los sueldo es un factor determinante, mucho más todo bien en empresas servicios,",
        "start": 1208.04,
        "end": 1212.6
    },
    {
        "text": " que escalan particularmente con el GELCAM, bueno, gracias a personas, y bueno, y todo eso, no",
        "start": 1212.6,
        "end": 1217.9199999999998
    },
    {
        "text": " sé, si por algún motivo que hasta desconozco el ejemplo, ustedes se les ocurre mostrar,",
        "start": 1217.9199999999998,
        "end": 1223.6799999999998
    },
    {
        "text": " mostrar montar su propio, su propio RAC, con servers, con drives, con ser redundancia, con",
        "start": 1223.6799999999998,
        "end": 1232.24
    },
    {
        "text": " su nube privada, o lo que sea, bueno, asumiendo que eso no es trivial, el costo que tiene eso lo pondría",
        "start": 1232.24,
        "end": 1237.8
    },
    {
        "text": " acá, por ejemplo, no es como un soltadijorgen, sobre todo con el 5 y el 9, o sea, ahí lo que",
        "start": 1237.8,
        "end": 1247.6
    },
    {
        "text": " tiene que tener en cuenta son cosas contantes, o no, no, no, en un flujo de ingreso no es cómo",
        "start": 1247.6,
        "end": 1255.52
    },
    {
        "text": " te va a entrar plata 2, o es todo el plato que no te contás, no, es por qué motivo te va a entrar plata,",
        "start": 1255.52,
        "end": 1261.8799999999999
    },
    {
        "text": " por qué con si te va a tener plata, o sea, puede ser algo constante o puede ser algo tipo",
        "start": 1262.44,
        "end": 1268.64
    },
    {
        "text": " episodio, o sea, no sé, cada tanto pasa algo, pero por ejemplo, yo tengo un capital que le invierto",
        "start": 1268.64,
        "end": 1273.88
    },
    {
        "text": " en esto, no es para lo que va ahí, no, no, por ejemplo, si yo tenés al, tenés un gasto muy grande,",
        "start": 1273.88,
        "end": 1281.4
    },
    {
        "text": " que tenés que hacer unas faladores para tener ese negocio funcionando, eso iría también, iría",
        "start": 1281.4,
        "end": 1287.44
    },
    {
        "text": " la estructura de costos, bueno eso está bueno porque a ver, no está claro, por lo menos yo",
        "start": 1287.44,
        "end": 1293.4
    },
    {
        "text": " no tengo la respuesta, te diría que si recién vas a empezar a armar este boliche como para presentarlo,",
        "start": 1293.4,
        "end": 1299.6000000000001
    },
    {
        "text": " para picharlo, si lo pongas, ahora si el boliche ya está armado y querés pivotar, analizar,",
        "start": 1299.6000000000001,
        "end": 1306.48
    },
    {
        "text": " lo cambiarlo, recibir una segunda ronda inversión, o sea, o sea, es como que no, juego con la importancia,",
        "start": 1306.48,
        "end": 1313.0
    },
    {
        "text": " o sea, a ver, si estás en el segundo caso, esa guita ya la pusiste, te última en otro lado,",
        "start": 1313.0,
        "end": 1318.88
    },
    {
        "text": " poné, mira, te cobro tanto, porque quiero recuperar el muerto que puse, pero no va a ser",
        "start": 1318.88,
        "end": 1323.52
    },
    {
        "text": " la lógica de este negocio, ahora si para entrar a este negocio hay que affrontar ese costo, yo lo",
        "start": 1323.52,
        "end": 1328.44
    },
    {
        "text": " conmigo, por ejemplo, la idea que me ocurre ahí, por ejemplo, que tengas que desarrollar un algoritmo",
        "start": 1328.44,
        "end": 1333.48
    },
    {
        "text": " muy particular y que lo necesitas para empezar a funcionar, para no necesiera que me lo, sí, pero yo",
        "start": 1333.48,
        "end": 1340.72
    },
    {
        "text": " ahí te retruco que yo no pondría el algoritmo, porque si pongas el algoritmo como estructura de costos,",
        "start": 1340.72,
        "end": 1346.1200000000001
    },
    {
        "text": " a mí me dice que lo compraste. O capaz que lo tenés que seguir, no sé, no sé, ahí va, o sea,",
        "start": 1346.1200000000001,
        "end": 1352.32
    },
    {
        "text": " puedo comprar una empresa que ya lo tiene, o sea, que ya haces eso. Ok, y bueno, eso también está",
        "start": 1352.32,
        "end": 1359.44
    },
    {
        "text": " bueno que decís, porque en general, si ustedes ponen un item en la parte de estructura de costos,",
        "start": 1359.44,
        "end": 1365.1200000000001
    },
    {
        "text": " quiere decir que para vos es, es solo plata, entre comer y llanto, o sea, eso es solo plata, o sea que",
        "start": 1365.12,
        "end": 1370.08
    },
    {
        "text": " lo adquirí o algo como diquizado, o bueno, o mismo, o tipo, no sé, sueldo es divero, pero está,",
        "start": 1370.08,
        "end": 1375.6
    },
    {
        "text": " hay que pagar, ahora en el ejemplo, y solo como ejemplo, no, en ese ejemplo que decías, si",
        "start": 1375.6,
        "end": 1380.76
    },
    {
        "text": " nosotros vamos a desarrollar ese algoritmo súper específico, en realidad, va a ir o estaría",
        "start": 1380.76,
        "end": 1386.76
    },
    {
        "text": " representado entre los sueldo que publiciste en la estructura de costos y bueno, y el equipo de",
        "start": 1386.76,
        "end": 1390.7199999999998
    },
    {
        "text": " desarrolladores que tenés en la parte de recursos, pero si son cosas que son, o sea, después",
        "start": 1390.72,
        "end": 1396.84
    },
    {
        "text": " son ajenas, lo que vas a mantener ahí con... Y lo que te dice hoy, o sea, si estás armando esto,",
        "start": 1396.84,
        "end": 1401.88
    },
    {
        "text": " yo no, no, no, no, María, como el, el chanchorreño como dicen, y lo pondría comunitén, pero sepan que lo",
        "start": 1401.88,
        "end": 1407.24
    },
    {
        "text": " típico del modelo de negocio es con el negocio andando, eso es lo típico, pero justo si estás",
        "start": 1407.24,
        "end": 1412.64
    },
    {
        "text": " armando el modelo y vas a pichar por inversión, por ejemplo, yo lo pondría. Bien, acá es donde,",
        "start": 1412.64,
        "end": 1422.2800000000002
    },
    {
        "text": " que creo que por acá habíamos cortado, o no sé, llevamos a esto, acá es donde empezamos a ver",
        "start": 1422.2800000000002,
        "end": 1427.96
    },
    {
        "text": " que el Value Proposición Canvas, que hemos visto recién, se usa dentro, o sea, o lo podemos",
        "start": 1427.96,
        "end": 1435.44
    },
    {
        "text": " proyectar o colocar dentro del mínimo de Canvas, ojo que no es tipo COPP, o sea, esto es algo más",
        "start": 1435.44,
        "end": 1441.92
    },
    {
        "text": " conceptual, o sea, de hecho, en el Vindemodel Canvas, en la parte de segmento de cliente, no dice que",
        "start": 1441.92,
        "end": 1451.64
    },
    {
        "text": " tengas poner todos los castomer jobs, todos los painstores, los gains, o sea, en realidad, si se quiere",
        "start": 1451.64,
        "end": 1458.68
    },
    {
        "text": " el Value Proposión Canvas, es como un doble clic de esas dos secciones del Vindemodel Canvas.",
        "start": 1458.68,
        "end": 1464.6000000000001
    },
    {
        "text": " Bueno, estas, creo que ya la comenté.",
        "start": 1464.6,
        "end": 1472.76
    },
    {
        "text": " Acá hay un par de ejemplos, sí, el de Netflix y el de Starbucks. A ver, acá la verdad que no tengo",
        "start": 1476.76,
        "end": 1486.32
    },
    {
        "text": " idea cuán realista si a esto es simplemente como para bajarlo a tierra con algo que con algo",
        "start": 1486.32,
        "end": 1491.1999999999998
    },
    {
        "text": " que conozcan y que la complicidad no esté en eteter el negocio o el problema.",
        "start": 1491.2,
        "end": 1496.76
    },
    {
        "text": " Bueno, en el caso de Netflix, propuesta de valor, un buen precio, accesible en todo el lado,",
        "start": 1499.76,
        "end": 1506.96
    },
    {
        "text": " me imagino ubicuo, desde el celular, tables, laptop, televisor, etcétera. Con venientes,",
        "start": 1506.96,
        "end": 1516.0800000000002
    },
    {
        "text": " supongo que viene por el lado de que al hacer un streaming o de man, no sé, no tengo que ir a buscar",
        "start": 1516.8,
        "end": 1522.8
    },
    {
        "text": " la película, el blockbuster y nada de eso. ¿A qué mercado apuntamos? Y bueno, acá le",
        "start": 1522.8,
        "end": 1530.8
    },
    {
        "text": " hay esta gente le pasa algo particular, que es tipo a todos, entonces, tipo, el segmento cliente",
        "start": 1530.8,
        "end": 1536.6399999999999
    },
    {
        "text": " es todo el mundo. Bueno, por eso pusieron en mercado masivo. Igual de última, también sirve como para",
        "start": 1536.6399999999999,
        "end": 1542.08
    },
    {
        "text": " ver ese concepto que se lo hemos visto en una clase anterior, porque obviamente cualquiera,",
        "start": 1542.08,
        "end": 1546.24
    },
    {
        "text": " eventualmente podrían dar puesto, porque en algún punto también está bueno caracterizar un poco",
        "start": 1546.24,
        "end": 1552.08
    },
    {
        "text": " el segmento cliente, porque ponerle un nombre de, no sé, incluso, no sé, adulto mayor. Bueno,",
        "start": 1552.08,
        "end": 1557.52
    },
    {
        "text": " está, pero capaz que no le vendeza todos los adultos mayores, son los adultos mayores que no sé,",
        "start": 1557.52,
        "end": 1562.08
    },
    {
        "text": " que puedan pagar esto, que tenga una familia, no sé, que los que les de apoyo, no sé, o lo que sea",
        "start": 1562.08,
        "end": 1569.84
    },
    {
        "text": " miniamete autobalido, en fin, ahora que poner alguna caracterización. En este caso, bueno,",
        "start": 1570.32,
        "end": 1575.1999999999998
    },
    {
        "text": " no caracterizan nada, pusieron más marketing. Y después, bueno, la gente de cable y satélite,",
        "start": 1575.1999999999998,
        "end": 1583.36
    },
    {
        "text": " ahí no sé, no me quedan buenas, supongo que bueno, ahí lo veo más como partners que como",
        "start": 1583.36,
        "end": 1592.8799999999999
    },
    {
        "text": " sementan clientes, pero en fin le vuelta a profil, no? Es como se fue ese sustituto, dice ahí.",
        "start": 1592.88,
        "end": 1597.92
    },
    {
        "text": " Claro, el sustituto, tipo, no sé, tienes directividad, un sustituto para directividad, por ejemplo,",
        "start": 1597.92,
        "end": 1604.4
    },
    {
        "text": " no? Claro, pero en el mínimo de campas no pone sus tututos, por eso, no, no, claro, pero yo digo",
        "start": 1604.4,
        "end": 1611.0400000000002
    },
    {
        "text": " que yo lo que digo es que como son los clientes que tienen directividad, ah, bueno ahí sí,",
        "start": 1611.0400000000002,
        "end": 1616.96
    },
    {
        "text": " como los clientes que buscan tipo un sustituto del cable, algo de eso, al menos de lo interpreto así.",
        "start": 1616.96,
        "end": 1623.3600000000001
    },
    {
        "text": " Después, ¿cómo hacer llegar esa propuesta de valor a esos segmentos clientes? Bueno, con el",
        "start": 1626.64,
        "end": 1633.3600000000001
    },
    {
        "text": " sitio de los tipos.com, con la mobile app y con la televisión inteligente o el set of box o el",
        "start": 1633.3600000000001,
        "end": 1642.24
    },
    {
        "text": " el dispositivo que hace inteligente al televisor. ¿Cómo va a ser la relación con los clientes?",
        "start": 1642.72,
        "end": 1648.72
    },
    {
        "text": " El service, o sea, completamente automatizada, no te voy a estar haciendo uno ni personalizado,",
        "start": 1648.72,
        "end": 1654.8
    },
    {
        "text": " ni te estoy llamando, no, vos servite con mismo. Y obviamente a la abajo a la derecha, o sea,",
        "start": 1654.8,
        "end": 1664.88
    },
    {
        "text": " porque concepto le va a entrar plata a este modelo de negocio por las suscripciones.",
        "start": 1664.88,
        "end": 1668.72
    },
    {
        "text": " Y después lo de izquierda, bueno, ¿cómo hacen Netflix? Supuestamente para generar esa propuesta",
        "start": 1674.3200000000002,
        "end": 1680.16
    },
    {
        "text": " valor. Bueno, tiene actividad esclave que es el general desarrollado del software de de reproducción.",
        "start": 1680.16,
        "end": 1687.92
    },
    {
        "text": " Ahí también me quedó me quedó tan claro lo de content license.",
        "start": 1688.48,
        "end": 1693.44
    },
    {
        "text": " Eso es un propio película, papá, Dios, ellos tienen su propio",
        "start": 1696.48,
        "end": 1699.2
    },
    {
        "text": " propio. No, y aparte, porque si vos querés adquirir contenido que no es tuyo para pasar en",
        "start": 1699.2,
        "end": 1704.0
    },
    {
        "text": " la plataforma, tenés que pagar los derechos de la descripción. Asumo que debe ser algo de",
        "start": 1704.0,
        "end": 1708.48
    },
    {
        "text": " conseguir las licencias para poder estrimar las películas. Pero eso es lo que está abajo,",
        "start": 1708.48,
        "end": 1712.96
    },
    {
        "text": " viste que los repetieron de vuelta. Ahí la verdad no me quedó claro.",
        "start": 1712.96,
        "end": 1715.8
    },
    {
        "text": " Asumo que está en key activity porque tenés el trabajo de conseguir las licencias.",
        "start": 1715.8,
        "end": 1721.28
    },
    {
        "text": " Claro, y después de la licencia lo que pagan, bueno, tener el derecho exclusivo de,",
        "start": 1721.28,
        "end": 1726.64
    },
    {
        "text": " por ejemplo, Netflix hasta como 500 millones de dólares en retener los derechos de Deofi para",
        "start": 1728.32,
        "end": 1733.8
    },
    {
        "text": " transmitir un estado suñido. Por ejemplo, por decir algo. Para mí, si pues eso sería más",
        "start": 1733.8,
        "end": 1739.6000000000001
    },
    {
        "text": " representaría más de esta trabajo, a ver, en realidad no, no, no, caliente los salutos,",
        "start": 1740.1599999999999,
        "end": 1744.48
    },
    {
        "text": " ha comunciado la idea, no es como pararnos cada uno, es entender un ejemplo que todos conocemos",
        "start": 1744.48,
        "end": 1749.32
    },
    {
        "text": " como en Netflix y tratar como de mapear, le bajar a tierra, es la herramienta a esta, el",
        "start": 1749.32,
        "end": 1753.12
    },
    {
        "text": " vínimo del campo, ¿no? Incluso en recursos también nos adapta a Center, no se me da",
        "start": 1753.12,
        "end": 1757.36
    },
    {
        "text": " entender que los tipos tienen exhausteados, todo eso, no tengo ni idea, no sea negóticamente si",
        "start": 1757.36,
        "end": 1762.6
    },
    {
        "text": " algunos saben si los costían ellos o los costían en algún cloud provider. Una consulta en key activity",
        "start": 1762.6,
        "end": 1769.04
    },
    {
        "text": " también puede entrar en marketing. Sí, perfectamente podría. Sí, sí. Y de hecho, seguramente,",
        "start": 1769.04,
        "end": 1776.72
    },
    {
        "text": " este modelo de negocio es viejo y de vuelta, también es que no tengo ni idea quién hizo esto,",
        "start": 1776.72,
        "end": 1780.56
    },
    {
        "text": " capaz que fue un estudiante, o sea, que estamos usando como una mera excusa, ¿no? Sí, seguramente",
        "start": 1780.56,
        "end": 1785.8799999999999
    },
    {
        "text": " viejo, porque seguramente ahora en key activities me imagino que dirían hacer el contenido,",
        "start": 1785.8799999999999,
        "end": 1792.6
    },
    {
        "text": " porque al principio en Netflix no generaba contenido y ahora sí.",
        "start": 1792.6,
        "end": 1795.6399999999999
    },
    {
        "text": " Bueno, de hecho lo veía con un recurso, ¿no? El content está con un recurso. Y después partners,",
        "start": 1799.36,
        "end": 1807.0
    },
    {
        "text": " bueno, Hollywood, hay un tan poco de algo, pero bueno, Hollywood, lo proveer Internet y los",
        "start": 1807.0,
        "end": 1812.56
    },
    {
        "text": " proveedores de los dispositivos inteligentes. Y en los costos está se mataron, ¿no? Sí, costos",
        "start": 1812.56,
        "end": 1820.84
    },
    {
        "text": " variables y los costos de licencias. Y bueno, este, bueno, píchelo un poquito, usted me va a",
        "start": 1820.84,
        "end": 1830.12
    },
    {
        "text": " ser que usó un envuelo que me lo ponga al heryó y se haya que ver esa mala atención o",
        "start": 1830.12,
        "end": 1833.56
    },
    {
        "text": " hay como lo dicen, le vuelta. No, no pretendo como que todos los puntitos cierren. Si fuese así,",
        "start": 1833.56,
        "end": 1839.0
    },
    {
        "text": " le hubiese borrado y le hubiese curado yo, es simplemente como para bajar a tierra la herramienta",
        "start": 1839.0,
        "end": 1844.6799999999998
    },
    {
        "text": " en algunos ejemplos que conocan.",
        "start": 1844.68,
        "end": 1846.6000000000001
    },
    {
        "text": " Una reflexión también que me mereces la pena y hasta lo digo en carne propia, ¿no?",
        "start": 1853.6000000000001,
        "end": 1859.0
    },
    {
        "text": " En Netflix, ¿no? Starbox no me parece particularmente un lugar barato ni ni siquiera razonable de",
        "start": 1861.6000000000001,
        "end": 1870.8
    },
    {
        "text": " precios, si lo que queres es entrar, merentario y salir. O sea, por lo menos la relación calidad,",
        "start": 1870.8,
        "end": 1877.56
    },
    {
        "text": " precio, si es para entrar, para agarrar a egoírtes, personalmente no me parece para nada barato,",
        "start": 1877.56,
        "end": 1883.96
    },
    {
        "text": " ni muy gourmet, ni muy elaborado para el precio que te cobran. Pero justamente, ahora, si yo me",
        "start": 1883.96,
        "end": 1891.44
    },
    {
        "text": " pongo el sombrero de segmentos clientes de profesional que va a la agudar a Starbox, me encanta Starbox",
        "start": 1891.44,
        "end": 1898.56
    },
    {
        "text": " y me es baratísimo porque porque estoy tres horas, capaz que en esas tres horas consuman",
        "start": 1898.56,
        "end": 1903.2
    },
    {
        "text": " o sea 500 pesos, pero cuál sería mi alternativa? O ir y venir hasta mi casa que es una hora entre",
        "start": 1903.2,
        "end": 1910.3999999999999
    },
    {
        "text": " auto y la nasta y la calentura y que no produjo, etcétera, o ir a un coboor que está pagando por",
        "start": 1910.3999999999999,
        "end": 1916.44
    },
    {
        "text": " hora o tener una oficina en el centro o donde sea, entonces está bueno también como ver que tal vez",
        "start": 1916.44,
        "end": 1923.72
    },
    {
        "text": " para un segmento porque le agrega, le aporta un valor, entonces con el mismo precio ya automáticamente",
        "start": 1923.72,
        "end": 1929.96
    },
    {
        "text": " pasa hasta hacer barato, eso que te ofrece Starbox, se entiende? Y yo literalmente lo uso para eso,",
        "start": 1929.96,
        "end": 1938.44
    },
    {
        "text": " lo único malo es que la wifi siempre es muy alimentable y bueno, uso el teléfono.",
        "start": 1938.44,
        "end": 1944.0
    },
    {
        "text": " ¿Algún comentario que alguien queda hacer de esto? Que queda claro, la herramienta de",
        "start": 1944.0,
        "end": 1956.12
    },
    {
        "text": " vínimo del canvas, cómo se le, más o menos cómo se arma, ven que hay como una ese rational,",
        "start": 1956.12,
        "end": 1961.28
    },
    {
        "text": " como esa lógica y también acá está bueno porque y esto también, para que lo haya",
        "start": 1961.28,
        "end": 1967.76
    },
    {
        "text": " viendo para el proyecto, ¿no? Está bueno porque tiene como que se rara el canvas y obviamente",
        "start": 1967.76,
        "end": 1975.56
    },
    {
        "text": " a principios lo van a hacer, por eso es la de las primeras entregables que le pedimos y el capa",
        "start": 1975.56,
        "end": 1979.44
    },
    {
        "text": " que le erran y lo vamos a corregir o a te unido y vuelta, pero está bueno porque en la medida que lo",
        "start": 1979.44,
        "end": 1984.8799999999999
    },
    {
        "text": " ha puliendo, va diciendo, claro, esto no, este costo está acá porque está lo cual cosa, o esto me",
        "start": 1984.8799999999999,
        "end": 1991.96
    },
    {
        "text": " has sentido para llegar a este segmento de cliente o por ejemplo, pero para cómo hacer para",
        "start": 1991.96,
        "end": 1996.2
    },
    {
        "text": " llegarles, de hecho como como preguntaba hoy la compañía, creo que era dar con cómo hago para",
        "start": 1996.2,
        "end": 2000.48
    },
    {
        "text": " llegar al más market, si no pongo marketing como una actividad clave, eso pareciera hacer una",
        "start": 2000.48,
        "end": 2006.68
    },
    {
        "text": " pregunta y perválida, ¿no? Porque pareciera que la publicidad y el marketing in Netflix es barato o",
        "start": 2006.68,
        "end": 2012.44
    },
    {
        "text": " o casi gratis, si no lo ponen como como una actividad como un costo o a ningún lado lo pusieron,",
        "start": 2012.44,
        "end": 2018.48
    },
    {
        "text": " ¿no? Entonces está bueno como para ir descubriendo esos posibles agujeros que tenga la lógica de negocio o el",
        "start": 2018.48,
        "end": 2025.0800000000002
    },
    {
        "text": " modelo de negocio. También eso puede defender también del estado en el que pasa el",
        "start": 2025.08,
        "end": 2030.06
    },
    {
        "text": " de la empresa, puede ser poner ahora a todos algunos a saber que en Netflix sea entonces capaz que",
        "start": 2030.06,
        "end": 2034.24
    },
    {
        "text": " no tiene que ir market tanto en marketing, pero saben eso porque en un momento le hiciste. Sí, sí,",
        "start": 2034.24,
        "end": 2041.36
    },
    {
        "text": " te la llevo, te la llevo, también es cierto que en general la herramienta de bíneo del",
        "start": 2041.36,
        "end": 2047.04
    },
    {
        "text": " canvas, si bien puede ir cambiando en general cambia por algún pivot, por algún cambio de la",
        "start": 2047.04,
        "end": 2052.16
    },
    {
        "text": " estrategia, no es tipo una película que constantemente va cambiando, o sea no es como muy el objetivo,",
        "start": 2052.16,
        "end": 2058.16
    },
    {
        "text": " pero no sé, la verdad que para mí o se lo comieron o de vuelta o esto lo hicimos un estudiante",
        "start": 2058.16,
        "end": 2066.48
    },
    {
        "text": " depogrado y se comió eso. ¿Hay alguna pregunta de este tema de bíneo del canvas?",
        "start": 2066.48,
        "end": 2073.0
    },
    {
        "text": " Bueno, ahora vamos a ver algo muy parecido que la motivación que los autores dan para",
        "start": 2074.0,
        "end": 2087.88
    },
    {
        "text": " este otro canvas es que los contextos de startups son tan inciertos, volátiles y mucho más",
        "start": 2087.88,
        "end": 2097.72
    },
    {
        "text": " rados a la experimentación ágil, que incluso pedir un bíneo del canvas hasta que",
        "start": 2097.72,
        "end": 2103.74
    },
    {
        "text": " apaga que puede ser demasiado mucho. Entonces esta gente inventó el LinCambas, que Lin es una",
        "start": 2103.74,
        "end": 2113.7999999999997
    },
    {
        "text": " metodología, LinStartup, que el ateriquito ahí le dice que lo van a ver en tema en el tema de",
        "start": 2113.7999999999997,
        "end": 2118.48
    },
    {
        "text": " emprendedurismo y ahí también una referencia biográfica a la metodología, ¿qué es una metodología",
        "start": 2118.48,
        "end": 2125.2799999999997
    },
    {
        "text": " básicamente? Que hice hace algo, salí rápido con algo, me di, aprendé, modificalo y lanzada de",
        "start": 2125.28,
        "end": 2133.6000000000004
    },
    {
        "text": " vuelta a una segunda versión sea lo que sea, o sea bien alineado a la filosofía ágil y esta",
        "start": 2133.6000000000004,
        "end": 2141.32
    },
    {
        "text": " gente propone el LinCambas que es bastante parecido, pero cambiando algunas secciones y asumiendo",
        "start": 2141.32,
        "end": 2149.2000000000003
    },
    {
        "text": " que sabes menos o que tenés más certeza para más incertezas, o sea que sabes menos que tenés",
        "start": 2149.2,
        "end": 2155.8399999999997
    },
    {
        "text": " más incertezas o menos certezas. Y apunta por ejemplo en vez de decir bueno, ¿quiénes son tus",
        "start": 2155.8399999999997,
        "end": 2164.4399999999996
    },
    {
        "text": " socios, tus actividades? Esta gente dice eso lo ves después enfocate en la tapa previa, cuál",
        "start": 2164.4399999999996,
        "end": 2171.16
    },
    {
        "text": " la tapa previa, cuál es tu problema, ¿mientificaste bien tu problema? ¿Cuáles son las alternativas? ¿Cuáles",
        "start": 2171.16,
        "end": 2176.7599999999998
    },
    {
        "text": " es la solución que vos proponeces de problema y cuáles son las métricas tus capéis de tu negocio?",
        "start": 2176.76,
        "end": 2182.0400000000004
    },
    {
        "text": " Y bueno, a ver después que también vamos a hablar bastante de esto de problema, solución y negocio",
        "start": 2183.96,
        "end": 2190.0400000000004
    },
    {
        "text": " en ese orden. Y de hecho es una propuesta que les hacemos para el proyecto, en general lo primero",
        "start": 2190.0400000000004,
        "end": 2197.4
    },
    {
        "text": " que tenemos que hacer es validar que existe el problema que vamos a atacar, o sea que es un problema",
        "start": 2197.4,
        "end": 2202.28
    },
    {
        "text": " que alguien tiene, que parece estar tonto, no, de decirlo, pero al principio, o sea el problema,",
        "start": 2202.28,
        "end": 2208.2000000000003
    },
    {
        "text": " lo tenemos nosotros en la cabeza o capaz que trega a todos loco, que nos digeró así, yo también tengo",
        "start": 2208.2000000000003,
        "end": 2214.4
    },
    {
        "text": " su problema, pero al día lo primero que hay que hacer es validar el problema, o sea, ¿quién tiene",
        "start": 2214.4,
        "end": 2218.44
    },
    {
        "text": " este problema? ¿Cuánta gente tiene este problema? ¿Cuáles son los pains? ¿Cuáles son los gains de hacer",
        "start": 2218.44,
        "end": 2225.0800000000004
    },
    {
        "text": " eso o de no hacerlo? ¿Cuál es el tamaño de ese potencial gente mercado que tiene ese problema?",
        "start": 2225.0800000000004,
        "end": 2231.28
    },
    {
        "text": " Entonces primero valía el problema, después de validar mis soluciones de ese problema, porque capaz",
        "start": 2231.28,
        "end": 2236.0800000000004
    },
    {
        "text": " que el problema existe es enorme, pero mis soluciones es una porquería, ¿tá? Y después que valide que",
        "start": 2236.0800000000004,
        "end": 2242.8
    },
    {
        "text": " tenga un problema y valide que tenga una solución, mucha gente dice, ¿tá? ¿Listo? ¿Ya está?",
        "start": 2242.8,
        "end": 2247.44
    },
    {
        "text": " Prolimo de solución, ¿no? ¿No? ¿No? ¿Está? Porque es algo que quiera hacer una ONG, capaz que",
        "start": 2247.44,
        "end": 2251.6800000000003
    },
    {
        "text": " tenés un problema de solución, pero no tenés un negocio. Entonces hay que ver primero que problema hay,",
        "start": 2251.6800000000003,
        "end": 2256.4
    },
    {
        "text": " segundo, si tu solución es acorde, y tercero que tengas un negocio alrededor de esa pareja,",
        "start": 2256.56,
        "end": 2263.28
    },
    {
        "text": " problema y solución. Y bueno, después la griga, ¿cuál es como tu diferenciador o tu ventaja con",
        "start": 2263.28,
        "end": 2269.92
    },
    {
        "text": " respecto a esos competidores? Y bueno, el resto es casi igual. Yani, pues, es también que si bien",
        "start": 2269.92,
        "end": 2277.92
    },
    {
        "text": " existe el problema, o que más tanta gente lo tiene, hay una solución que no las saben. O sea, bueno,",
        "start": 2277.92,
        "end": 2284.56
    },
    {
        "text": " podría hacer una solución, pero no haya ya existe. Sí, sí, sí, podría decir, o sea, a ver, de hecho,",
        "start": 2285.52,
        "end": 2290.56
    },
    {
        "text": " la... Yo, puede gastar tiempo en hacer una solución que no haya ya existe mientras estás haciendo la",
        "start": 2290.56,
        "end": 2295.36
    },
    {
        "text": " descubre, y entonces tenés que ver eso también, que no exista. O sea, pueta de problema, no sé si me",
        "start": 2295.36,
        "end": 2301.2799999999997
    },
    {
        "text": " plico, pero como que pueta de problema, pero la gente que tiene problema no sabe que la solución",
        "start": 2301.2799999999997,
        "end": 2307.04
    },
    {
        "text": " existe. Perfectamente, puede pasar. A ver, lo hace que es como que cada combinación de las que",
        "start": 2307.04,
        "end": 2312.24
    },
    {
        "text": " dijiste que podría pasar es como que te va a decir algo distintos de tu negocio, ¿no? De hecho,",
        "start": 2312.24,
        "end": 2317.2
    },
    {
        "text": " distinta, o sea, en general, los problemas de alguna forma se resuelven, pero justamente a veces se",
        "start": 2317.2,
        "end": 2323.6
    },
    {
        "text": " resuelven tan mal que genera un espacio de problema, como una ventana de oportunidad, que es como un",
        "start": 2323.6,
        "end": 2329.04
    },
    {
        "text": " mercado esperando, acá hay una buena solución. Y en ese caso, en general, más que sus soluciones se habla",
        "start": 2329.04,
        "end": 2335.6
    },
    {
        "text": " como de alternativas o de sustituutos para ese problema, y bueno, y si vovas con una solución,",
        "start": 2335.6,
        "end": 2340.7999999999997
    },
    {
        "text": " obviamente tenés una mina de oro, de vuelta, habría que hacer el tercer análisis,",
        "start": 2340.8,
        "end": 2345.1200000000003
    },
    {
        "text": " efectivamente, validar, pues, capaz que, no sé, tenés tremenda solución, pero no es rentable.",
        "start": 2345.1200000000003,
        "end": 2350.88
    },
    {
        "text": " ¿Por qué? Porque no sé, porque le he estado al arte de esa tecnología, todavía no llegó a",
        "start": 2350.88,
        "end": 2355.1200000000003
    },
    {
        "text": " ciertas mesetas de economía de escala, por ejemplo. No sé, imagínate algo con IoT o tabuñísimo,",
        "start": 2355.1200000000003,
        "end": 2361.28
    },
    {
        "text": " pero en realidad cada tag no sé, sale 5 dólares, y si le querés cobrar 7 dólares, no te da a cobrar",
        "start": 2361.28,
        "end": 2368.32
    },
    {
        "text": " el problema, no porque la solución actual ya le cobra 7, hay que hacer todos sus análisis.",
        "start": 2368.32,
        "end": 2372.8
    },
    {
        "text": " No, hay que analizar las posibles soluciones que habría, que habrían la obra para ver si es",
        "start": 2372.8,
        "end": 2378.7200000000003
    },
    {
        "text": " piable ya. Totalmente, totalmente. Acuérdense por ahora un poquito de saterna, hay que validar el",
        "start": 2378.7200000000003,
        "end": 2385.6000000000004
    },
    {
        "text": " problema, hay que validar que nuestra solución sea compatible con ese problema, o sea que la gente o",
        "start": 2385.6000000000004,
        "end": 2391.6000000000004
    },
    {
        "text": " los clientes quieran mis soluciones de ese problema, y, en tercer lugar, hay que validar que yo pueda",
        "start": 2391.6,
        "end": 2398.7999999999997
    },
    {
        "text": " montar un negocio arriba de todo eso. Y bueno, y esta gente con este link ambas dice, o como todo,",
        "start": 2398.7999999999997,
        "end": 2408.16
    },
    {
        "text": " hay aie escuelas, esta gente dice que hacer este link ambas es un poco más, como menos",
        "start": 2408.16,
        "end": 2414.04
    },
    {
        "text": " bureaucratico, un poco más ágil, y se supone que una vez que vas validando esto, después,",
        "start": 2414.04,
        "end": 2419.48
    },
    {
        "text": " decimos, y ahora, ¿qué con qué actividades hago esto, con qué recursos, con qué partners?",
        "start": 2419.48,
        "end": 2425.4
    },
    {
        "text": " Jamito, una consulta faltarían considerar los recursos ahí, no?",
        "start": 2427.4,
        "end": 2434.04
    },
    {
        "text": " Lo pasa que esta gente no lo propone en realidad, en el vídeo de moda y gamas, sí, aparece",
        "start": 2435.2400000000002,
        "end": 2439.84
    },
    {
        "text": " los recursos. Estaja, bien. Te dice, primero hace esto, y si vas bien, de última después lo",
        "start": 2439.84,
        "end": 2447.48
    },
    {
        "text": " complementas, alegraga, zanálisis, o hacéis mismo un pínimo de gambas.",
        "start": 2447.48,
        "end": 2451.36
    },
    {
        "text": " Está bien perfecto. De hecho, acá también hay un poco la, este es el contrapunto que esta gente dice,",
        "start": 2451.36,
        "end": 2457.2
    },
    {
        "text": " ¿no? Ve que te dice, el link ambas está diseñado para startups, y está más el iníado con el",
        "start": 2457.2,
        "end": 2462.84
    },
    {
        "text": " link startup process, que lo quedan adentro más adelante, y está mucho más entrado en el usuario,",
        "start": 2462.84,
        "end": 2467.72
    },
    {
        "text": " no porque habla del problema del usuario, de las soluciones del usuario, de las alternativas del usuario,",
        "start": 2467.72,
        "end": 2472.44
    },
    {
        "text": " la y un xerin proposition, o sea, en qué me diferencia yo, en qué me diferencia con respecto",
        "start": 2472.44,
        "end": 2479.76
    },
    {
        "text": " al usuario, de mis competidores, está muy centrado en el usuario, y en realidad el vienes model",
        "start": 2479.76,
        "end": 2484.56
    },
    {
        "text": " canvas, no está centrado en el usuario, aparece en los segmentos del cliente por ahí, pero",
        "start": 2484.56,
        "end": 2489.44
    },
    {
        "text": " no le he estado, está como se ha centrado en toda esa lógica, en esa operacional o",
        "start": 2489.44,
        "end": 2497.4
    },
    {
        "text": " mana o estratégico, la marketing plans, me parece que ahí se le fue un poquito de la moto,",
        "start": 2497.4,
        "end": 2502.1600000000003
    },
    {
        "text": " y después esto que dicen, design for company, las variedades del business, o sea, para empresas que",
        "start": 2503.1600000000003,
        "end": 2507.84
    },
    {
        "text": " validaron el negocio, es un ní, porque muchas veces vos haces un pínimo de gambas, y no lo tenia",
        "start": 2507.84,
        "end": 2513.6
    },
    {
        "text": " validado, simplemente tenés que darte cuenta, que no sé, de todos los post-it que pusiste, hay 8,",
        "start": 2513.6,
        "end": 2519.0
    },
    {
        "text": " que ponele escribirle hipótesis, y después de última ejecutarse experimentos para",
        "start": 2519.0,
        "end": 2524.12
    },
    {
        "text": " rivalidad, o sea, como si uno de las dos visiones, fue ese tan netamente superior,",
        "start": 2524.12,
        "end": 2529.8399999999997
    },
    {
        "text": " nunca más hubiera sabado el otro, ni realidad se usa los dos, y bueno, como dice ahí también,",
        "start": 2529.8399999999997,
        "end": 2537.08
    },
    {
        "text": " los dos son una forma de ficiente y concisa de representar la lógica de negocio.",
        "start": 2537.08,
        "end": 2541.3599999999997
    },
    {
        "text": " Bueno, hay una pregunta, hay una pregunta desde link canvas, o de los canvas, en general,",
        "start": 2546.08,
        "end": 2552.2
    },
    {
        "text": " ¿y qué es el que está haciendo en el proyecto?",
        "start": 2554.12,
        "end": 2556.12
    },
    {
        "text": " Ya empezando a hablar del proyecto, yo creo que en el proyecto hayamos puesto el bínimo de",
        "start": 2556.12,
        "end": 2565.3199999999997
    },
    {
        "text": " gambas, pero en realidad si quieren poner, sobre todo al principio, un link canvas está perfecto",
        "start": 2565.3199999999997,
        "end": 2570.72
    },
    {
        "text": " igual, o incluso si quieren poner, bueno, los dos a principios, no, porque me parece demasiado",
        "start": 2570.72,
        "end": 2576.08
    },
    {
        "text": " mucho, pero sí entonces el libro de elegir uno u otro, lo importante es que pongan algo que",
        "start": 2576.08,
        "end": 2582.3599999999997
    },
    {
        "text": " esté pensado, o sea que no es lo primero que se lo ocurra, bueno ahora hablamos un poquito",
        "start": 2582.36,
        "end": 2587.36
    }
]