[
    {
        "text": " En la clase de hoy nos vamos a dedicar a continuar con los temas que veníamos viendo",
        "start": 0.0,
        "end": 22.7
    },
    {
        "text": " de índices de precios y salarios. Ustedes en la clase pasada estuvieron",
        "start": 22.7,
        "end": 44.86
    },
    {
        "text": " trabajando todo lo que tenía que ver con inflación e IPC. ¿Qué vieron con el tema",
        "start": 44.86,
        "end": 54.22
    },
    {
        "text": " de inflación e IPC? En primer lugar lo que vieron fue el concepto de inflación",
        "start": 54.22,
        "end": 59.34
    },
    {
        "text": " que acabamos de repasar recién cuando empezamos a ver algo del práctico 2.",
        "start": 59.34,
        "end": 68.86
    },
    {
        "text": " Analizamos solamente en el práctico 2 las últimas datos de inflación.",
        "start": 68.86,
        "end": 73.86
    },
    {
        "text": " Como les decíamos, la inflación es el crecimiento generalizado y continuo de los precios",
        "start": 73.86,
        "end": 89.66
    },
    {
        "text": " de la economía. Me interesaba esta definición porque básicamente estos dos conceptos serán",
        "start": 89.66,
        "end": 100.25999999999999
    },
    {
        "text": " los fundamentales para que existiera inflación se tenían que agresar dos condiciones, lo",
        "start": 100.25999999999999,
        "end": 104.53999999999999
    },
    {
        "text": " de generalizado y lo de continuo. Lo distinguimos y lo habrán distinguido de otro dos conceptos",
        "start": 104.53999999999999,
        "end": 110.25999999999999
    },
    {
        "text": " 1 que es la deflación que era la baja de los precios, es como el fenómeno contrario",
        "start": 110.25999999999999,
        "end": 118.22
    },
    {
        "text": " y otro que es la deflación que es la baja de la inflación, es decir los precios suben",
        "start": 118.22,
        "end": 127.18
    },
    {
        "text": " pero cada vez suben menos. Proceso que yo les comentaba estamos viviendo actualmente",
        "start": 127.18,
        "end": 132.82
    },
    {
        "text": " que es cada en estos últimos meses cada vez que se anuncian los datos de la inflación",
        "start": 132.82,
        "end": 139.02
    },
    {
        "text": " es un poquito más bajo. Bien, con un 5, con 32 estamos. En los últimos 12 meses en el",
        "start": 139.02,
        "end": 146.46
    },
    {
        "text": " último año de julio a julio, de julio 2017 a julio 2016. Bien, ¿cómo se mide la inflación?",
        "start": 146.46,
        "end": 158.94
    },
    {
        "text": " Digimos, la inflación se mide a través de un índice de precio. Se mide como la variación",
        "start": 158.94,
        "end": 174.62
    },
    {
        "text": " porcentual de un índice de precio y el general el que se usa siempre es el IPC. Cada vez",
        "start": 174.62,
        "end": 183.42000000000002
    },
    {
        "text": " que me están dando los datos de inflación me están realizando la variación del IPC",
        "start": 183.42000000000002,
        "end": 188.3
    },
    {
        "text": " porque el IPC lo que me mide es el índice de precios al consumo, es un índice de precios",
        "start": 188.3,
        "end": 195.5
    },
    {
        "text": " de una canasta de referencia del consumo de los sovales. Se pueden utilizar otro tipo",
        "start": 195.5,
        "end": 206.5
    },
    {
        "text": " de índice de precios les comentaba. Este IPC lo mide y lo da el Instituto Nacional",
        "start": 206.5,
        "end": 216.06
    },
    {
        "text": " de Estadística y refleja la evolución del costo de adquirir una canasta de bienes y servicios",
        "start": 216.06,
        "end": 225.06
    },
    {
        "text": " representativa del consumo promedio de un tipo familiar. La estimación de esa canasta",
        "start": 225.06,
        "end": 234.86
    },
    {
        "text": " tipo se hace a través de una encuesta de gastos que se realiza aproximadamente cada diez",
        "start": 234.86,
        "end": 245.62
    },
    {
        "text": " años. La referencia que tenemos ahora es de diciembre del 2010. ¿No? Y lo que sea",
        "start": 245.62,
        "end": 255.02
    },
    {
        "text": " ya hace todos los meses es actualizar los precios. El supuesto que está detrás de",
        "start": 255.02,
        "end": 260.62
    },
    {
        "text": " seccesa a canasta es relativamente una permanencia en el tiempo. ¿Sí?",
        "start": 260.62,
        "end": 267.42
    },
    {
        "text": " Este tipo de índices donde los ponderadores que son las cantidades permanecen fijos y",
        "start": 267.42,
        "end": 272.74
    },
    {
        "text": " lo que varían son los precios se llaman los índices de tipo de las peyes. Que lo que",
        "start": 272.74,
        "end": 280.38
    },
    {
        "text": " tienen básicamente son ponderadores hijos. Si yo hiciera variar también los ponderadores",
        "start": 280.38,
        "end": 292.3
    },
    {
        "text": " se llama un índice de tipo de paz. Me interesa saber esto porque acá yo lo que estoy",
        "start": 292.3,
        "end": 299.5
    },
    {
        "text": " analizando es de la misma canasta cuánto va evolucionando su valor, su costo. Voy",
        "start": 299.5,
        "end": 307.82
    },
    {
        "text": " siempre comparando las mismos ponderadores con los precios añoar. ¿De acuerdo?",
        "start": 307.82,
        "end": 314.82
    },
    {
        "text": " De esta forma el índice de precios al consumo es un indicador agregado que estima la variación",
        "start": 319.21999999999997,
        "end": 326.02
    },
    {
        "text": " mensual de los precios de bienes y servicios de que consumen los hogares, ¿Sí? Y por",
        "start": 326.02,
        "end": 333.46
    },
    {
        "text": " eso todos los meses se relevan cuáles son esos precios de referencia y como van variando.",
        "start": 333.46,
        "end": 340.46
    },
    {
        "text": " Sí? Para algunos datos, la serie de índices de precios en Uruguay se inicia en 1914.",
        "start": 340.46,
        "end": 347.46
    },
    {
        "text": " Con base en 1913. Y a partir de estudio sobre las condiciones de vida a la población, después",
        "start": 364.46,
        "end": 376.46
    },
    {
        "text": " esto se ha ido perfeccionando y se ha ido modificando. Y el primer índice, el primer índice,",
        "start": 376.46,
        "end": 385.46
    },
    {
        "text": " proveniente de una encuesta de grasos, es del año 1963. ¿Para qué sirve el índice?",
        "start": 386.46,
        "end": 401.46
    },
    {
        "text": " El índice se tiene diferentes usos, ¿Sí? Por ejemplo, para el ajuste de determinados",
        "start": 404.46,
        "end": 411.46
    },
    {
        "text": " contratos. Se encuentran indexados por IPC. ¿Ejemplo de contratos que tengan conozca a ustedes",
        "start": 411.46,
        "end": 422.46
    },
    {
        "text": " que están indexados por IPC? Los salarios, por ejemplo. En los consejos de salarios, en general",
        "start": 422.46,
        "end": 432.46
    },
    {
        "text": " está apautado algún crecimiento y un ajuste por IPC por la inflación que se prevé después",
        "start": 432.46,
        "end": 445.46
    },
    {
        "text": " por la inflación efectiva y si hay o no algún aumento salarial para ese sector. ¿Sí?",
        "start": 445.46,
        "end": 452.46
    },
    {
        "text": " Después también se utiliza en el cálculo de la unidad indexada. Por eso muchas veces,",
        "start": 453.46,
        "end": 463.46
    },
    {
        "text": " cuando hay préstamos de vivienda por unidades indexadas a nivel de la población trabajadora,",
        "start": 463.46,
        "end": 469.46
    },
    {
        "text": " en la expectativa de que los salarios se ajustan por IPC, la unidad indexada es un mejor negocio",
        "start": 469.46,
        "end": 477.46
    },
    {
        "text": " porque en la medida que yo tengo ingresos que se van ajustando por IPC, mis pasivos también.",
        "start": 478.46,
        "end": 485.46
    },
    {
        "text": " También se usan para el cálculo de los salarios reales. Los salarios reales, lo que me van a buscar",
        "start": 486.46,
        "end": 497.46
    },
    {
        "text": " es el poder adquisitivo del salario. Cuando en términos de bienes puedo comprar con mi salario.",
        "start": 497.46,
        "end": 503.46
    },
    {
        "text": " Por lo tanto, me puede interesar necesito la inflación para poder sacar el efecto de los precios",
        "start": 503.46,
        "end": 510.46
    },
    {
        "text": " de los salarios nominales. Yo puedo ganar tanta plata por mes, pero si los precios me suben y",
        "start": 510.46,
        "end": 518.46
    },
    {
        "text": " mantengo mi mismo salario, puedo comprar menos. En términos reales, pierdo poder adquisitivo.",
        "start": 518.46,
        "end": 523.46
    },
    {
        "text": " Por eso me interesa no solamente el dato del salario nominal, sino del salario real.",
        "start": 523.46,
        "end": 529.46
    },
    {
        "text": " Si los precios van por encima de la justicia al real, pierdo poder adquisitivo.",
        "start": 530.46,
        "end": 536.46
    },
    {
        "text": " Si mi salario se ajusta por encima de la inflación, gano poder adquisitivo.",
        "start": 536.46,
        "end": 542.46
    },
    {
        "text": " Por eso, cuando analizamos los indicadores de salarios, no va a interesar ver tanto los",
        "start": 544.46,
        "end": 549.46
    },
    {
        "text": " indicadores nominales como reales. Y después también todos los ajustes de las remuneraciones,",
        "start": 549.46,
        "end": 558.46
    },
    {
        "text": " que ya computamos, y otros ingresos, y también el ajuste de la variable consumo en el sistema de cuentas nacionales.",
        "start": 558.46,
        "end": 578.46
    },
    {
        "text": " Todos esos utilidades tienen el IPC. Las economías en general están altamente invexadas al IPC,",
        "start": 578.46,
        "end": 592.46
    },
    {
        "text": " o sea, hay muchas cosas que se van ajustando por el IPC. Bien.",
        "start": 592.46,
        "end": 599.46
    },
    {
        "text": " En esta clase nos vamos a dedicar en especial a la análisis del índice medio de salarios,",
        "start": 599.46,
        "end": 621.46
    },
    {
        "text": " y del índice de salario real.",
        "start": 622.46,
        "end": 630.46
    },
    {
        "text": " Voy a escribirse en algunas palabras, corir y quedando a la clase, porque van a tener todo el material.",
        "start": 630.46,
        "end": 636.46
    },
    {
        "text": " La idea era poder ir viendo a todos mientras lo iba comentando.",
        "start": 636.46,
        "end": 642.46
    },
    {
        "text": " El índice medio de salarios localicula el Instituto Nacional de Estadística desde el año 1968.",
        "start": 642.46,
        "end": 665.46
    },
    {
        "text": " Se ha realizado un cambio en el cálculo en el héroe de 2003, en base de diciembre del 2002.",
        "start": 673.46,
        "end": 694.46
    },
    {
        "text": " Para qué se dispone del índice medio de salarios?",
        "start": 694.46,
        "end": 701.46
    },
    {
        "text": " En base a, en el héroe de 2002, en base a diciembre de 2002.",
        "start": 701.46,
        "end": 709.46
    },
    {
        "text": " Para qué se busca contar con un indicador actualizado,",
        "start": 709.46,
        "end": 723.46
    },
    {
        "text": " de la evolución, de los ingresos de los trabajadores,",
        "start": 724.46,
        "end": 745.46
    },
    {
        "text": " y de los que se han entendido a las recomendaciones de organismos internacionales,",
        "start": 745.46,
        "end": 766.46
    },
    {
        "text": " y de los que se han entendido, los criterios establecidos por el marco legal y la práctica estadística.",
        "start": 766.46,
        "end": 789.46
    },
    {
        "text": " Para este objetivo hay distintas etapas.",
        "start": 797.46,
        "end": 811.46
    },
    {
        "text": " Se selecciona una muestra representativa de actividades del país.",
        "start": 811.46,
        "end": 831.46
    },
    {
        "text": " El sector público como del sector privado.",
        "start": 832.46,
        "end": 846.46
    },
    {
        "text": " Luego se selecciona una muestra de organismos y empresas informantes.",
        "start": 847.46,
        "end": 864.46
    },
    {
        "text": " Este es stratificado primero de sectores y después de unidades dentro de sectores, o sea organismos y empresas.",
        "start": 864.46,
        "end": 874.46
    },
    {
        "text": " Luego se selecciona una muestra, siguen los estratos de categorías representativas.",
        "start": 874.46,
        "end": 891.46
    },
    {
        "text": " Y de luego se determina una estructura de ponderaciones.",
        "start": 891.46,
        "end": 905.46
    },
    {
        "text": " La ponderación es el peso relativo de cada una de esas categorías.",
        "start": 921.46,
        "end": 945.46
    },
    {
        "text": " Lo que voy a estar haciendo variar son los que me interesa saber es el salario.",
        "start": 946.46,
        "end": 957.46
    },
    {
        "text": " ¿Cuáles son los antecedentes?",
        "start": 958.46,
        "end": 969.46
    },
    {
        "text": " Originalmente fue definido como un índice de las peeres.",
        "start": 970.46,
        "end": 981.46
    },
    {
        "text": " O sea, esas ponderaciones estaban fijas y se actualizaban cada tanto tiempo, termina siendo una canasta de tipos de trabajo.",
        "start": 981.46,
        "end": 998.46
    },
    {
        "text": " El año 1968 fue el año base.",
        "start": 999.46,
        "end": 1012.46
    },
    {
        "text": " Eso fue a través de la ley 13.728.",
        "start": 1012.46,
        "end": 1024.46
    },
    {
        "text": " El índice medio de salarios debía ser suficientemente representativo de los ingresos de los trabajadores comprendidos en los grandes sectores de la actividad pública y privada.",
        "start": 1024.46,
        "end": 1035.46
    },
    {
        "text": " En virtud de lo dipuesto por la ley se seleccionaron organismos y ramas de actividad en el sector público y privado utilizando como criterio de representatividad, el de ocupación en cada uno de ellos.",
        "start": 1035.46,
        "end": 1047.46
    },
    {
        "text": " En cada organismo rama se incluyeron categorías de obreros empleados utilizando el mismo criterio de ocupación.",
        "start": 1047.46,
        "end": 1055.46
    },
    {
        "text": " Entonces, lo que se hacía era, se tomaban las ponderaciones de los diferentes tipos de ocupación y se actualizaban todos los meses los niveles salariales, consultando a esas empresas que dependían distintos ramos de actividad sin ser trabajadores rurales o trabajos afrales.",
        "start": 1056.46,
        "end": 1079.46
    },
    {
        "text": " Eso fue lo que era original, originalmente.",
        "start": 1079.46,
        "end": 1086.46
    },
    {
        "text": " En ese momento el índice excluía lo que son los aportes a la seguridad social a cargo del trabajador, las remuneraciones y las retribuciones en especie.",
        "start": 1089.46,
        "end": 1099.46
    },
    {
        "text": " Pero si se incluyen las remuneraciones nominales por horas diurnas y nocturnas, por licencias y feriados, los pagos de los jornales, los incentivos y feriados, los pagos a los jornaleros, comisiones, viáticos, antiguedad y otras remuneraciones ordinarias restando el total de aportes obreros a la seguridad social por caja de jubilaciones seguro de enfermedad equivalente o impuestos.",
        "start": 1099.46,
        "end": 1126.46
    },
    {
        "text": " Se entiende en realidad ahí lo que se especifica la norma es que cosas incluyen o no ese índice.",
        "start": 1126.46,
        "end": 1136.46
    },
    {
        "text": " Todos los valores los divide además por las horas ordinarias de trabajo.",
        "start": 1140.46,
        "end": 1146.46
    },
    {
        "text": " El resultado es que la obtenida de la suma de la cuota parte de vengada por cada hora de trabajo, por concepto de decir motverse resuelo, hay inhalos al área vacacional cuando en los meses esto corresponde.",
        "start": 1147.46,
        "end": 1163.46
    },
    {
        "text": " Eso es porque se hace esto, porque si no los meses en los cuales tengo los inhalos o los al área vacacionales automáticamente subiría.",
        "start": 1164.46,
        "end": 1174.46
    },
    {
        "text": " Entonces, de alguna forma le agrego la cuota parte al mes para que pueda ser comparado y para que no afecte la evolución mensual.",
        "start": 1175.46,
        "end": 1182.46
    },
    {
        "text": " Bien.",
        "start": 1183.46,
        "end": 1184.46
    },
    {
        "text": " Esta metodología original fue modificada de la ley 13728 por la ley 17649 del año 2003 del 3 de junio en 2006.",
        "start": 1185.46,
        "end": 1212.46
    },
    {
        "text": " Donde hay un cambio en la metodología y es el índice que utilizamos actualmente donde diciembre el 2002 vales 100.",
        "start": 1213.46,
        "end": 1224.46
    },
    {
        "text": " Este índice, ¿cuales son los susos que tiene el índice medio de salarios? ¿Cómo hoy veíamos el IPC?",
        "start": 1224.46,
        "end": 1246.46
    },
    {
        "text": " En primer lugar, la unidad ajustable que me preguntaba, en segundo lugar el ajuste de alquileres.",
        "start": 1247.46,
        "end": 1260.46
    },
    {
        "text": " Esto depende también del contrato, ¿no? ¿Qué se tenga? Hay muchos ajustes alquileres que se hacen por el índice de alquileres, de índice de presos alquileres.",
        "start": 1261.46,
        "end": 1274.46
    },
    {
        "text": " Eso está usando mucho ahora.",
        "start": 1274.46,
        "end": 1277.46
    },
    {
        "text": " Unidad ajustable. La unidad ajustable del banco potedario.",
        "start": 1277.46,
        "end": 1283.46
    },
    {
        "text": " El ajuste de las pasividades se hace por IPC, por índice medio de salarios.",
        "start": 1283.46,
        "end": 1299.46
    },
    {
        "text": " Hay ajustes de contratos que hacen por índice medio de salarios.",
        "start": 1300.46,
        "end": 1308.46
    },
    {
        "text": " Y también sirve para ver el poder de comprar el salario.",
        "start": 1308.46,
        "end": 1315.46
    },
    {
        "text": " En esta misma clase vamos adelante, vamos a ver que el índice de salario real se construye a partir del índice medio de salarios y del IPC.",
        "start": 1315.46,
        "end": 1326.46
    },
    {
        "text": " El índice de salario real es el índice medio de salarios, que es un indicador de una evolución de una variable nominal deflactado por IPC.",
        "start": 1327.46,
        "end": 1336.46
    },
    {
        "text": " Bien. La utilización de estos usos, alguna explicación un poquito más detallada. La unidad ajustable.",
        "start": 1337.46,
        "end": 1360.46
    },
    {
        "text": " El índice medio de salarios fue creado con el propósito de corregir el valor de la UR, de acuerdo a la ley 13.728.",
        "start": 1360.46,
        "end": 1374.46
    },
    {
        "text": " El artículo 38 de la ley 13.728.",
        "start": 1374.46,
        "end": 1387.46
    },
    {
        "text": " Y también se utilizó en durante mucho tiempo para rajuste de créditos del Banco y Potecario del Uruguay.",
        "start": 1388.46,
        "end": 1395.46
    },
    {
        "text": " Hoy en día, la mayoría de los créditos del Banco y Potecario, y creo que todos los nuevos, se realizan a través de la Unidad indexada.",
        "start": 1395.46,
        "end": 1402.46
    },
    {
        "text": " Y la Unidad indexada se ajusta a través del IPC. La Unidad indexada fue mucho más nueva que la Unidad ajustable y lo que permite es ir más acorde con la evolución del poder de comprar.",
        "start": 1402.46,
        "end": 1416.46
    },
    {
        "text": " Y la evolución del poder de comprar de los salarios, que a su vez en casi todos los casos, tienen siempre un componente ajuste por IPC, a nivel de la negociación de los consejos de salarios.",
        "start": 1416.46,
        "end": 1428.46
    },
    {
        "text": " Eso lo que permite es que las cuotas y potecarias evolucionan de acuerdo a el poder aquístivo salarial.",
        "start": 1428.46,
        "end": 1439.46
    },
    {
        "text": " Y no se desajustan, porque la historia también del Banco y Potecario fue que mucho de un nivel de endeudamiento muy alto, porque durante mucho tiempo evolucionó diferente a lo que fuera la evolución de un parte importante salarial.",
        "start": 1439.46,
        "end": 1453.46
    },
    {
        "text": " La Unidad indexada tiene un desajuste de unos meses, si ustedes analizan el crecimiento de la Unidad indexada respecto al IPC, y están de pasados unos tres meses más o menos.",
        "start": 1453.46,
        "end": 1466.46
    },
    {
        "text": " Después se agarra la ajuste. La Unidad ajustable se ajuste a cada vez menos, esa es una realidad, se utiliza cada vez menos, y se ajusta mensualmente con las variaciones operadas en el índice medio del salario con un resago de dos meses, básicamente.",
        "start": 1466.46,
        "end": 1481.46
    },
    {
        "text": " Y la ajuste de alquileres la ley 14.219 del 74 utilizaba que los contratos de alquileres al amparo de la Unidad ajustable, por ese van de la mano.",
        "start": 1481.46,
        "end": 1505.46
    },
    {
        "text": " Hoy posteriormente la ley 15.154 de 1981 modifica parcialmente el criterio y estableciendo que los rajustes pueden ser por IPC, ¿sí?",
        "start": 1505.46,
        "end": 1521.46
    },
    {
        "text": " Entonces, básicamente la explicación es la misma, porque también se crea la Unidad indexada después.",
        "start": 1521.46,
        "end": 1530.46
    },
    {
        "text": " Y eso también hoy queda liberado un poco a los contratos.",
        "start": 1530.46,
        "end": 1539.46
    },
    {
        "text": " Sí. ¿El índice de salarios nominal? Ahora vamos a ver esa diferencia.",
        "start": 1539.46,
        "end": 1550.46
    },
    {
        "text": " El ajuste de las pasividades, la reforma de la Constitución del año 1989, uno de los componentes fuertes importantes que tuvo fue que todas las pasividades pasaban ajustar usted por índice medio de salarios, jubilaciones y pensiones.",
        "start": 1550.46,
        "end": 1567.46
    },
    {
        "text": " Se deben realizar con las variaciones del índice medio de salario en ocasión de aumentos arariales que decreten el poder ejecutivo para el sector público.",
        "start": 1567.46,
        "end": 1575.46
    },
    {
        "text": " El artículo 67 de la ley de la Constitución establece que los ajuste de las asignaciones de jubilaciones y pensiones no podrán ser inferiores a la variación del índice medio de salarios y se efectuarán en las mismas oportunidades que se establezcan ajustes o aumentos en las remuneraciones de las funcionarios de la Administración Central.",
        "start": 1576.46,
        "end": 1595.46
    },
    {
        "text": " Entonces, es una forma de indexar las pasividades. Fue uno de los componentes fuertes y discusión fuerte que hubo cuando fue la reforma del 1989, porque hay varios.",
        "start": 1596.46,
        "end": 1611.46
    },
    {
        "text": " Primero que nada, por el ajuste que tiene ni eso de alguna forma permite una ajuste importante de las pasividades que tienen siempre algunos temas de baja si de estar deprimidas.",
        "start": 1611.46,
        "end": 1624.46
    },
    {
        "text": " Por otro lado, tiene un componente fuerte del peso de la seguridad social, más en la composición que tenemos en el Uruguay respecto a las relaciones de dades y de las relaciones entre población activa y población pasiva.",
        "start": 1625.46,
        "end": 1638.46
    },
    {
        "text": " De hecho, cuando son os daísamos las finanzas públicas, el peso de la seguridad social y de ese gasto que todos los años se tiene que realizar por el componente de la seguridad social es muy importante.",
        "start": 1638.46,
        "end": 1653.46
    },
    {
        "text": " Por eso, de alguna forma, ahora se están haciendo unos intentos de planificación económica muy fuerte donde una de las líneas transversales que se está trabajando son las proyecciones y las perspectivas en términos de la población del Uruguay,",
        "start": 1654.46,
        "end": 1666.46
    },
    {
        "text": " una población que prácticamente no crece donde cada vez más el peso de la población pasiva y de la gente de dad es más en relación a la población activa.",
        "start": 1666.46,
        "end": 1679.46
    },
    {
        "text": " Entonces, los sistemas de seguridad social tienden a verse cada vez más apretados y con eso las finanzas públicas y en términos de perspectivas son bastante complejos.",
        "start": 1679.46,
        "end": 1691.46
    },
    {
        "text": " Ese tipo de ejeuciones también se dieron cuando se hizo la reforma constitucional porque aparte se dejó el ajuste salarial de las pasividades y pensiones en la constitución.",
        "start": 1691.46,
        "end": 1702.46
    },
    {
        "text": " Bueno, el ajuste de los contratos siempre estuvo muy vinculado el tema de la OR.",
        "start": 1703.46,
        "end": 1710.46
    },
    {
        "text": " Yo les decía que después que se crea la unidad indexada, la unidad indexada tiende a tener mucho más peso y ser más representativo que la unidad ajustable por ese ajuste que se da siempre a través del IPC.",
        "start": 1710.46,
        "end": 1723.46
    },
    {
        "text": " Bien.",
        "start": 1724.46,
        "end": 1726.46
    },
    {
        "text": " ¿Y por qué el poder de comprar salario? Porque el índice medio de salario junto con el índice de precios al consumo se utiliza para la construcción de otro indicador que también hace el índice de salario real.",
        "start": 1729.46,
        "end": 1741.46
    },
    {
        "text": " Y básicamente surge en este problema. Si los precios suben, en realidad, aunque yo gane más capaz que no puedo comprar más porque tengo menos poder adquisitivo.",
        "start": 1742.46,
        "end": 1753.46
    },
    {
        "text": " Entonces, lo que hago es lo que se llama la deflactación. deflactar es cuando yo un índice nominal lo divido por un índice de precios. Les saco el efecto de los precios.",
        "start": 1753.46,
        "end": 1765.46
    },
    {
        "text": " Entonces, el índice medio deflactado por IPC, el simple cociente me da el índice de salario real que es un indicador de la evolución del poder adquisitivo de los salarios.",
        "start": 1766.46,
        "end": 1779.46
    },
    {
        "text": " También está en el índice.",
        "start": 1780.46,
        "end": 1782.46
    },
    {
        "text": " Bien. En la construcción del índice.",
        "start": 1782.46,
        "end": 1800.46
    },
    {
        "text": " La Unidad estadística de información del índice medio de salario en el sector privado.",
        "start": 1800.46,
        "end": 1819.46
    },
    {
        "text": " Son las empresas con 10 o más trabajadores.",
        "start": 1820.46,
        "end": 1838.46
    },
    {
        "text": " Y están seleccionadas por la principal actividad.",
        "start": 1838.46,
        "end": 1856.46
    },
    {
        "text": " A nivel del sector público es la Unidad de ejecutora de la Administración Central.",
        "start": 1857.46,
        "end": 1875.46
    },
    {
        "text": " Las empresas públicas y las intensas departamentales.",
        "start": 1876.46,
        "end": 1898.46
    },
    {
        "text": " Si yo hago un organograma del Estado, uruguayo, tengo la presidencia de la República.",
        "start": 1899.46,
        "end": 1915.46
    },
    {
        "text": " La Organismo Sasesores, uno es la oficina de planeamiento y presupuesto y otro que es la oficina nacional de servicios y víctimas.",
        "start": 1916.46,
        "end": 1922.46
    },
    {
        "text": " Después tenemos todos los ministerios.",
        "start": 1922.46,
        "end": 1932.46
    },
    {
        "text": " Ministerio de Industria y Energía, Ministerio de Economía y Finances, Ministerio de Educación Pública, Ministerio de Trabajo y Seguridad Social, Ministerio de Relaciones Estteriores,",
        "start": 1932.46,
        "end": 1944.46
    },
    {
        "text": " Ministerio de Vivienda, Ardenamiento Territorial y Medioambiente, Ministerio de Desarrollo Social, Ministerio de Transportes y Obras Públicas, Ministerio de Interior, Ministerio de Defensa Nacional, Ministerio de Tutilismo y Deportes, Ministerio de Ganadería,",
        "start": 1944.46,
        "end": 1964.46
    },
    {
        "text": " Arigultura y Pesca, no sé cuál me está faltando. Cada uno de estos ministerios tiene, puede tener más de una unidad de ejecutora.",
        "start": 1965.46,
        "end": 1981.46
    },
    {
        "text": " Estas son oficinas asesoras.",
        "start": 1982.46,
        "end": 1986.46
    },
    {
        "text": " En un nivel más de centralización tengo los servicios de centralizados y después tengo los centes autónomos y todavía más de centralizados los gobiernos departamentales.",
        "start": 1986.46,
        "end": 2000.46
    },
    {
        "text": " Generalmente los servicios de centralizados y los entes autónomos se comunican a través de un ministerio.",
        "start": 2001.46,
        "end": 2008.46
    },
    {
        "text": " Por ejemplo, los servicios de centralizados la OCE, que es a través del Ministerio de Vivienda, Ordenamiento Territorial y Medioambiente.",
        "start": 2008.46,
        "end": 2017.46
    },
    {
        "text": " Entre autónomo, la UTI, ANCAP, a través del Ministerio de Industria de Energía, la Universidad de la República, a través del MAC y todas las sentidas de la educación.",
        "start": 2017.46,
        "end": 2035.46
    },
    {
        "text": " Udelar es un ente autón.",
        "start": 2035.46,
        "end": 2039.46
    },
    {
        "text": " Y después acá tengo todos los gobiernos departamentales. Y después tengo los organismos de contra-lor.",
        "start": 2040.46,
        "end": 2046.46
    },
    {
        "text": " Lo que se toma son de las diferentes en nivel de unidad ejecutora. Hay organismos que tienen una sola unidad ejecutora y otros organismos que tienen más de una unidad ejecutora, que la unidad de decisión del gasto básicamente.",
        "start": 2049.46,
        "end": 2062.46
    },
    {
        "text": " Estos an niveles sector público. Al nivel del sector privado, lo que se toman son sectores de actividad y dentro de los actividades empresas representativas y se muestrían empresas.",
        "start": 2063.46,
        "end": 2076.46
    },
    {
        "text": " Según el tamaño, siempre y cuando tengan más de 10 empleados dependientes. Si tiene el menos, no forman parte de la muestra para el cálculo del íntice medio salario.",
        "start": 2076.46,
        "end": 2085.46
    },
    {
        "text": " Y en esa forma se hace una muestra estratificada, público, privada y por sectores de actividad.",
        "start": 2086.46,
        "end": 2092.46
    },
    {
        "text": " ¿Sentiendes? Y después a nivel de empresa y después dentro de la empresa, a nivel de las distintas ocupaciones.",
        "start": 2092.46,
        "end": 2099.46
    },
    {
        "text": " ¿Cuál es la cobertura de este índice?",
        "start": 2109.46,
        "end": 2112.46
    },
    {
        "text": " Vamos a morrar un poco.",
        "start": 2113.46,
        "end": 2115.46
    },
    {
        "text": " La cobertura de este índice, el índice medio de salarios, tiene cobertura a nivel nacional.",
        "start": 2120.46,
        "end": 2126.46
    },
    {
        "text": " Saber la cobertura en un índicador es bien importante para saber que estoy analizando. Porque si lo tengo muy acotado, si fuera solo de monte de vídeo, es poco representativo de lo que es la realidad del país.",
        "start": 2143.46,
        "end": 2156.46
    },
    {
        "text": " Este indicador tiene cobertura nacional y es a nivel de los trabajadores dependientes.",
        "start": 2156.46,
        "end": 2166.46
    },
    {
        "text": " Los unidos personales no están.",
        "start": 2167.46,
        "end": 2173.46
    },
    {
        "text": " No incluye los rurales ni los afrales y es tanto a nivel de los sectores públicos como privar.",
        "start": 2181.46,
        "end": 2186.46
    },
    {
        "text": " Tampoco incluye a aquellas empresas que son de menos de 10 habitantes, de menos de 10 trabajadores.",
        "start": 2187.46,
        "end": 2198.46
    },
    {
        "text": " Las empresas tienen que tener al menos 10 puestos de trabajo dependientes y hay algún tipo de actividades que no se incluyen también.",
        "start": 2201.46,
        "end": 2213.46
    },
    {
        "text": " Cada cuento se releva la información, se releva la información mensual.",
        "start": 2214.46,
        "end": 2222.46
    },
    {
        "text": " Y de esta forma se calcula el índice medio de salario común, promedio, ponderado de los índices de salarios y compensaciones de los sectores públicos y privados.",
        "start": 2223.46,
        "end": 2243.46
    },
    {
        "text": " El índice medio de salarios es igual a una suma ponderada de los índices de salarios y compensaciones por el un ponderador relativo para los diferentes tipos de actividad.",
        "start": 2244.46,
        "end": 2261.46
    },
    {
        "text": " Si quieren a nivel público y privado.",
        "start": 2261.46,
        "end": 2270.46
    },
    {
        "text": " Para un determinado momento del tiempo.",
        "start": 2271.46,
        "end": 2274.46
    },
    {
        "text": " Si.",
        "start": 2274.46,
        "end": 2279.46
    },
    {
        "text": " Escribo esto de nuevo.",
        "start": 2279.46,
        "end": 2284.46
    },
    {
        "text": " El índice medio de salarios es igual a lindices de salarios y compensaciones privados por la ponderación de los privados.",
        "start": 2284.46,
        "end": 2310.46
    },
    {
        "text": " El índice de salarios y compensaciones de los públicos por una ponderación de los públicos.",
        "start": 2311.46,
        "end": 2317.46
    },
    {
        "text": " Para un determinado momento de tiempo.",
        "start": 2317.46,
        "end": 2322.46
    },
    {
        "text": " El índice de salarios y compensaciones para un índice de salarios y compensaciones del periótée con una determinada base.",
        "start": 2323.46,
        "end": 2346.46
    },
    {
        "text": " Y dobleve es la ponderación que da la importancia de salarios y compensaciones del sector, en este caso público y privado, a nivel del total.",
        "start": 2347.46,
        "end": 2364.46
    },
    {
        "text": " Y cada uno de estos es también una suma ponderada de las distintas actividades, de las distintas unidades ejecutores y después de cada una de las empresas.",
        "start": 2364.46,
        "end": 2382.46
    },
    {
        "text": " Para comentar algún análisis, por ejemplo, índice medio de salarios en marzo de 2015.",
        "start": 2383.46,
        "end": 2397.46
    },
    {
        "text": " Con base, julio de 2008.",
        "start": 2398.46,
        "end": 2411.46
    },
    {
        "text": " Aumentó un 22% después vamos a hacer el último informe.",
        "start": 2412.46,
        "end": 2420.46
    },
    {
        "text": " Y se fijó en 221,41. El índice medio de salarios en julio de 2008, valía 100.",
        "start": 2420.46,
        "end": 2435.46
    },
    {
        "text": " La variación anual en todo el periódico fue 24. La variación anual fue de 4,95%.",
        "start": 2436.46,
        "end": 2447.46
    },
    {
        "text": " Y en los últimos 12 meses esta es la acumulada en el año, fue de 11,39.",
        "start": 2447.46,
        "end": 2456.46
    },
    {
        "text": " Por ejemplo, el índice medio de salarios fue en marzo de 2015, 221,212.",
        "start": 2465.46,
        "end": 2494.46
    },
    {
        "text": " En el mes fue un 0,22%. Aumentió un 0,22% en el mes.",
        "start": 2495.46,
        "end": 2507.46
    },
    {
        "text": " En el año, un 4,95. Y en los 12 meses, 11,39.",
        "start": 2507.46,
        "end": 2519.46
    },
    {
        "text": " Y este se compuso de dos tipos de variaciones.",
        "start": 2521.46,
        "end": 2525.46
    },
    {
        "text": " El índice de salarios y compensaciones privadas y el índice de salarios y compensaciones públicas.",
        "start": 2525.46,
        "end": 2531.46
    },
    {
        "text": " El privado fue 228,55. Y el público fue 209,80.",
        "start": 2531.46,
        "end": 2540.46
    },
    {
        "text": " La variación del privado fue de 0,21%.",
        "start": 2540.46,
        "end": 2551.46
    },
    {
        "text": " Y el público fue de 0,24. O sea, por qué esta es un promedio de los dos, no?",
        "start": 2551.46,
        "end": 2557.46
    },
    {
        "text": " Este es el privado y este es el público.",
        "start": 2557.46,
        "end": 2561.46
    },
    {
        "text": " En los últimos meses, fue 3,35. Y el índice de 12,35. Y 7,92.",
        "start": 2561.46,
        "end": 2575.46
    },
    {
        "text": " Y 12,35. Y 9,73.",
        "start": 2575.46,
        "end": 2584.46
    },
    {
        "text": " El ajuste que tuvieron los salarios públicos en este año fue exactamente la inflación del año, 9,73.",
        "start": 2584.46,
        "end": 2592.46
    },
    {
        "text": " Los públicos siempre tienen un aumento en el mes de enero.",
        "start": 2592.46,
        "end": 2597.46
    },
    {
        "text": " Los privados, la mayoría de los rubros y los grupos de la negociación salarial, tienen dos ajustes.",
        "start": 2597.46,
        "end": 2603.46
    },
    {
        "text": " Una, el primero de enero y otra, al primero de julio o al 30 de julio.",
        "start": 2603.46,
        "end": 2608.46
    },
    {
        "text": " Al 31 de diciembre y al 31.",
        "start": 2608.46,
        "end": 2610.46
    },
    {
        "text": " Si ustedes observan en el acumulado en el año la recuperación de los públicos, el aumento nominal de los públicos fue mayor que los privados.",
        "start": 2610.46,
        "end": 2619.46
    },
    {
        "text": " 7,92, con 3,35. Pero si todo el año el aumento de los privados fue mayor que los públicos.",
        "start": 2619.46,
        "end": 2627.46
    },
    {
        "text": " ¿Por qué puede estar cegado esto por el doble aumento que tienen? Porque se divide el aumento en 2.",
        "start": 2628.46,
        "end": 2633.46
    },
    {
        "text": " Uno al 31 de diciembre y otra junio.",
        "start": 2633.46,
        "end": 2637.46
    },
    {
        "text": " Mientras que acá es una sola vez y estaba contemplado el entero.",
        "start": 2637.46,
        "end": 2641.46
    },
    {
        "text": " Pues está ya comparando acá, marzo, 2015 a marzo, 2014.",
        "start": 2641.46,
        "end": 2649.46
    },
    {
        "text": " Me siguieron con el análisis.",
        "start": 2650.46,
        "end": 2652.46
    },
    {
        "text": " Este promedio surge del promedio de los otros dos.",
        "start": 2652.46,
        "end": 2656.46
    },
    {
        "text": " El de las privadas estaba por un poquito para arriba del de los públicos.",
        "start": 2660.46,
        "end": 2663.46
    },
    {
        "text": " No son totalmente comparables porque miren diversas.",
        "start": 2665.46,
        "end": 2668.46
    },
    {
        "text": " Me siguieron hasta acá.",
        "start": 2680.46,
        "end": 2682.46
    },
    {
        "text": " Bien.",
        "start": 2683.46,
        "end": 2685.46
    },
    {
        "text": " ¿Entendieron cómo funciona el índice medio salario?",
        "start": 2704.46,
        "end": 2707.46
    },
    {
        "text": " El otro indicador es el índice de salario real.",
        "start": 2710.46,
        "end": 2715.46
    },
    {
        "text": " El índice de salario real también lo labora.",
        "start": 2724.46,
        "end": 2728.46
    },
    {
        "text": " El Instituto Nacional de Estadística.",
        "start": 2731.46,
        "end": 2735.46
    },
    {
        "text": " Si ustedes van a precios y salarios van a desplegar todos estos índices.",
        "start": 2736.46,
        "end": 2741.46
    },
    {
        "text": " ¿Cuál es el objetivo del índice de salario real?",
        "start": 2743.46,
        "end": 2747.46
    },
    {
        "text": " El objetivo del índice de salario real es medir la evolución del poder de compra de los salarios.",
        "start": 2749.46,
        "end": 2764.46
    },
    {
        "text": " Y se calcula como el cociente entre el índice de salarios y el IPC.",
        "start": 2765.46,
        "end": 2790.46
    },
    {
        "text": " Y el IPC.",
        "start": 2790.46,
        "end": 2793.46
    },
    {
        "text": " Y se multiplica por 100.",
        "start": 2794.46,
        "end": 2797.46
    },
    {
        "text": " Entonces, yo les comentaba.",
        "start": 2803.46,
        "end": 2808.46
    },
    {
        "text": " El índice de salario real para un determinado periodote es el índice medio de salario.",
        "start": 2808.46,
        "end": 2822.46
    },
    {
        "text": " Entonces, sobre el índice de salario real, por cierto.",
        "start": 2822.46,
        "end": 2829.46
    },
    {
        "text": " Entonces, sí.",
        "start": 2841.46,
        "end": 2844.46
    },
    {
        "text": " ¿Deben de vender a la misma base?",
        "start": 2844.46,
        "end": 2851.46
    },
    {
        "text": " Vamos a hacer un ejemplo con eso.",
        "start": 2854.46,
        "end": 2858.46
    },
    {
        "text": " Imagínense que tengo estos datos.",
        "start": 2860.46,
        "end": 2867.46
    },
    {
        "text": " ¿Mil 99,991,992?",
        "start": 2875.46,
        "end": 2883.46
    },
    {
        "text": " ¿Mil 99,93?",
        "start": 2883.46,
        "end": 2886.46
    },
    {
        "text": " Vamos a hacer un poquito espacio.",
        "start": 2888.46,
        "end": 2892.46
    },
    {
        "text": " El índice medio de salarios en base de diciembre 95, acá pareciendo.",
        "start": 2905.46,
        "end": 2927.46
    },
    {
        "text": " ¿Siete con 51, 15 con 91, 27 con 30, 44 con 14, 64 con 12 y 88 con 98.",
        "start": 2928.46,
        "end": 2946.46
    },
    {
        "text": " Diciembre 95, 100.",
        "start": 2949.46,
        "end": 2953.46
    },
    {
        "text": " Inventado esto.",
        "start": 2953.46,
        "end": 2956.46
    },
    {
        "text": " El IPC diciembre 85, 100.",
        "start": 2956.46,
        "end": 2963.46
    },
    {
        "text": " Y acá es 1390 con 30, 2795 con 67, 479 con 46,",
        "start": 2964.46,
        "end": 2981.46
    },
    {
        "text": " 7,257 con 20, 10,54 con 20, 14,941 con 81 y siempre 95, 16,922 con 94.",
        "start": 2982.46,
        "end": 3001.46
    },
    {
        "text": " Sí.",
        "start": 3002.46,
        "end": 3003.46
    },
    {
        "text": " Lo primero que tengo que hacer es un cambio de base.",
        "start": 3003.46,
        "end": 3010.46
    },
    {
        "text": " Tengo que calcular el IPC a diciembre del 95.",
        "start": 3012.46,
        "end": 3017.46
    },
    {
        "text": " En un índice, un índice es un indicador de la evolución en el tiempo de una variable.",
        "start": 3017.46,
        "end": 3026.46
    },
    {
        "text": " O sea, que lo que toma es una referencia.",
        "start": 3026.46,
        "end": 3029.46
    },
    {
        "text": " Para eso selecciona lo que llama el año base, que es el año que toma como referencia.",
        "start": 3029.46,
        "end": 3035.46
    },
    {
        "text": " Por definición el año base, el índice vale 100.",
        "start": 3035.46,
        "end": 3038.46
    },
    {
        "text": " ¿Qué características tiene que tener el año base?",
        "start": 3038.46,
        "end": 3043.46
    },
    {
        "text": " O son desiables, ¿se acuerdan?",
        "start": 3043.46,
        "end": 3046.46
    },
    {
        "text": " En primer lugar, debe ser un año de relativa regularidad.",
        "start": 3046.46,
        "end": 3055.46
    },
    {
        "text": " No puede ser un dato atípico, porque si no, después la variación,",
        "start": 3055.46,
        "end": 3058.46
    },
    {
        "text": " tu exiempre es una comparación respecto de ese año base.",
        "start": 3058.46,
        "end": 3061.46
    },
    {
        "text": " Y la segunda es que no puede estar muy alejado en el tiempo.",
        "start": 3061.46,
        "end": 3069.46
    },
    {
        "text": " Lo que puedo hacer es lo que se llama un cambio de base.",
        "start": 3076.46,
        "end": 3080.46
    },
    {
        "text": " Y cómo realizo ese cambio de base?",
        "start": 3080.46,
        "end": 3087.46
    },
    {
        "text": " Ese cambio de año base?",
        "start": 3087.46,
        "end": 3090.46
    },
    {
        "text": " Lo tengo que hacer.",
        "start": 3090.46,
        "end": 3092.46
    },
    {
        "text": " Como el índice, en este caso, el que tengo que cambiar de base es el IPC.",
        "start": 3092.46,
        "end": 3099.46
    },
    {
        "text": " ¿Sí?",
        "start": 3099.46,
        "end": 3101.46
    },
    {
        "text": " El que tomo como referencia, ¿cuál es?",
        "start": 3101.46,
        "end": 3106.46
    },
    {
        "text": " Dicimbran los mil cinco.",
        "start": 3107.46,
        "end": 3108.46
    },
    {
        "text": " O sea que dicimbran los mil cinco cuantos tiene que pasar a valer.",
        "start": 3108.46,
        "end": 3112.46
    },
    {
        "text": " 100.",
        "start": 3112.46,
        "end": 3114.46
    },
    {
        "text": " Entonces, tengo que tener el índice, en el periodo sobre el índice,",
        "start": 3114.46,
        "end": 3120.46
    },
    {
        "text": " en la nueva base,",
        "start": 3120.46,
        "end": 3125.46
    },
    {
        "text": " en la base, en la nueva base, por 100.",
        "start": 3125.46,
        "end": 3130.46
    },
    {
        "text": " O sea,",
        "start": 3130.46,
        "end": 3133.46
    },
    {
        "text": " son este dividido este por 100.",
        "start": 3134.46,
        "end": 3139.46
    },
    {
        "text": " Ago de los datos.",
        "start": 3139.46,
        "end": 3142.46
    },
    {
        "text": " 54, 27 con 86, 42 con 93, 62 con 14, 88 con 40 y 100.",
        "start": 3145.46,
        "end": 3156.46
    },
    {
        "text": " Y ahora como construyo, el índice de salario real.",
        "start": 3157.46,
        "end": 3163.46
    },
    {
        "text": " El índice de salario real.",
        "start": 3168.46,
        "end": 3171.46
    },
    {
        "text": " ¿Por qué?",
        "start": 3174.46,
        "end": 3175.46
    },
    {
        "text": " Para que sean comparables.",
        "start": 3175.46,
        "end": 3177.46
    },
    {
        "text": " Porque en realidad, vos tenés dos indicadores y lo tenés que hacer referencia un mismo año.",
        "start": 3177.46,
        "end": 3183.46
    },
    {
        "text": " Nuestro índice de salario real acaba de hacer 100.",
        "start": 3184.46,
        "end": 3187.46
    },
    {
        "text": " Ahora, va a ser un índice de salario real del periodo T con base en diciembre del 95.",
        "start": 3187.46,
        "end": 3197.46
    },
    {
        "text": " Que es el índice medio de salario T con base diciembre el 95 sobre el IPC entre con base diciembre el 95.",
        "start": 3197.46,
        "end": 3211.46
    },
    {
        "text": " Por lo tanto, el índice de salario real, en el 90, con base diciembre el 95,",
        "start": 3212.46,
        "end": 3221.46
    },
    {
        "text": " es el índice medio de salarios en el 90, con base diciembre el 95,",
        "start": 3221.46,
        "end": 3226.46
    },
    {
        "text": " estos mesames ahí es un resumen.",
        "start": 3226.46,
        "end": 3229.46
    },
    {
        "text": " Sobre el índice el IPC del 90 con base diciembre el 95.",
        "start": 3229.46,
        "end": 3235.46
    },
    {
        "text": " Por lo tanto, son siete con 51 sobre ocho con 23 por 100.",
        "start": 3235.46,
        "end": 3243.46
    },
    {
        "text": " Y índice de salario real, base diciembre el 95, 91 con 25, 96 con 20, 97 con 98,",
        "start": 3243.46,
        "end": 3262.46
    },
    {
        "text": " 102 con 81, 13 con 67, 166.",
        "start": 3262.46,
        "end": 3270.46
    },
    {
        "text": " ¿Qué pueden decir de las diferentes evoluciones? ¿Entén, menos del salario real? ¿Qué fue pasando?",
        "start": 3271.46,
        "end": 3282.46
    },
    {
        "text": " Fue aumentando.",
        "start": 3284.46,
        "end": 3287.46
    },
    {
        "text": " La evolución del IPC estuvo por debajo de la evolución del índice medio salario.",
        "start": 3287.46,
        "end": 3294.46
    },
    {
        "text": " Podíamos ir comparando las variaciones porcentuales.",
        "start": 3295.46,
        "end": 3299.46
    },
    {
        "text": " Y acá en este periodo bajó hasta acá subió y después empiezo a bajar.",
        "start": 3301.46,
        "end": 3307.46
    },
    {
        "text": " Y de hecho, después sigo bajando hasta 2002, en la realidad. ¿Me siguieron?",
        "start": 3307.46,
        "end": 3313.46
    },
    {
        "text": " La tercera columna se cambió de base.",
        "start": 3338.46,
        "end": 3342.46
    },
    {
        "text": " Este pasó a bajar 100. Y después para construir la cuarta columna,",
        "start": 3342.46,
        "end": 3347.46
    },
    {
        "text": " utilicé este y este. Este. Divide este medio de este.",
        "start": 3347.46,
        "end": 3364.46
    },
    {
        "text": " Porque tengo que comparar dos cosas que sean iguales, que tengan la misma referencia.",
        "start": 3365.46,
        "end": 3371.46
    },
    {
        "text": " Si ustedes centran a la página de línea, lo que van a ver también es que cada tanto",
        "start": 3371.46,
        "end": 3379.46
    },
    {
        "text": " o se empalman índices de distintas serien o ahí cambios de base.",
        "start": 3379.46,
        "end": 3385.46
    },
    {
        "text": " Por ejemplo, el índice medio salarios tienen base 2002, base 2008.",
        "start": 3386.46,
        "end": 3393.46
    },
    {
        "text": " El IPC siempre se cambia la base con la encuesta continua de hogares, con la encuesta de gastos ingresos.",
        "start": 3394.46,
        "end": 3401.46
    },
    {
        "text": " Diciembre 2010. Ahora estamos en el 2017.",
        "start": 3401.46,
        "end": 3408.46
    },
    {
        "text": " No debería pasarse del 2020 para hacer otra encuesta de gastos y poder rearmar la canasta del IPC.",
        "start": 3409.46,
        "end": 3416.46
    },
    {
        "text": " Además, los hábitos de consumo cambian.",
        "start": 3417.46,
        "end": 3422.46
    },
    {
        "text": " El supuesto que tiene los índices de las feiras es que la estructura se mantiene relativamente constante.",
        "start": 3422.46,
        "end": 3430.46
    },
    {
        "text": " El otro tema que tienen es que son muy costosos de armar, lleva mucho dinero, mucho tiempo y mucho esfuerzo.",
        "start": 3431.46,
        "end": 3438.46
    },
    {
        "text": " Entonces sería impensable todos los meses hacer un IPC que varía en las ponderaciones.",
        "start": 3439.46,
        "end": 3445.46
    },
    {
        "text": " Materialmente no sería posible. Por eso también se explica que los índices de las feiras son más baratos,",
        "start": 3445.46,
        "end": 3451.46
    },
    {
        "text": " que los índices de Pash que son los que van actualizando las ponderaciones mesa mesas.",
        "start": 3451.46,
        "end": 3457.46
    },
    {
        "text": " Sentí en la otra ventaja de línse las feiras que mido sobre el efecto de los precios y mantengo constante las ponderaciones.",
        "start": 3458.46,
        "end": 3465.46
    },
    {
        "text": " Me siguieron? Bien.",
        "start": 3466.46,
        "end": 3469.46
    },
    {
        "text": " Para cualquiera de estos indicadores, estos indicadores todos se caracterizan por ser ponderados.",
        "start": 3469.46,
        "end": 3487.46
    },
    {
        "text": " El índice alario real lo construyo a través de esa desflactación de índices de medios salarios por el IPC.",
        "start": 3488.46,
        "end": 3494.46
    },
    {
        "text": " Me interesa el año base que se le referencia con esas características y lo que me interesa siempre realizar son las variaciones.",
        "start": 3495.46,
        "end": 3502.46
    },
    {
        "text": " ¿Qué tipo de variaciones calcularán? Están las variaciones mensuales.",
        "start": 3504.46,
        "end": 3511.46
    },
    {
        "text": " Entonces, en este caso la variación de un índice de cualquier variable, cualquiera de estos X, del periótico en el periótimo 1.",
        "start": 3512.46,
        "end": 3525.46
    },
    {
        "text": " El índice de X entre base 0 sobre el índice de X entre menos 1 con base 0 menos 1 por 100.",
        "start": 3526.46,
        "end": 3539.46
    },
    {
        "text": " Por ejemplo, si yo tengo que hacer la variación del IPC de julio 97, 2017.",
        "start": 3540.46,
        "end": 3555.46
    },
    {
        "text": " Al de junio 2017, presito el IPC en julio 2017 sobre el IPC en junio 2017 menos 1 por 100.",
        "start": 3556.46,
        "end": 3573.46
    },
    {
        "text": " Esa es la mensual, por que a irculándome esa mesa. Si quiero la variación acumulada en el año, del omi.",
        "start": 3576.46,
        "end": 3583.46
    },
    {
        "text": " Tengo que hacer el IPC de julio 2017 sobre el IPC de diciembre 2017 en 2016 menos 1 por 100.",
        "start": 3586.46,
        "end": 3603.46
    },
    {
        "text": " Alguien me preguntaba por qué hacíamos esto menos 1 en la otra clase. ¿Es por qué es este? ¿Menos este sobre este? ¿No? En la misma cuenta.",
        "start": 3604.46,
        "end": 3612.46
    },
    {
        "text": " Todos entendieron lo que dije, sencillo, pero a veces.",
        "start": 3615.46,
        "end": 3618.46
    },
    {
        "text": " Bueno, ¿y si es anual te o que tomar los últimos 12 meses? Es importante, ver los últimos 12 meses porque así es cuando cualquier tipo de esa fralidad que pueda estar.",
        "start": 3619.46,
        "end": 3628.46
    },
    {
        "text": " En general, la inflación de la segunda parte del año es más alta que la de la primera parte del año.",
        "start": 3629.46,
        "end": 3634.46
    },
    {
        "text": " ¿Se entendió?",
        "start": 3640.46,
        "end": 3641.46
    },
    {
        "text": " Las variaciones anuales las puedo hacer como el acumulado de las variaciones mensuales.",
        "start": 3642.46,
        "end": 3649.46
    },
    {
        "text": " Pero el IPC, todos los índices, esto se miden por la ley del interés compuesto y no la del interés simple.",
        "start": 3650.46,
        "end": 3656.46
    },
    {
        "text": " No es la simple suma, sino que es la multiplicación. ¿De acuerdo? ¿Me siguieron hasta acá?",
        "start": 3656.46,
        "end": 3665.46
    },
    {
        "text": " Entonces, dentro de los indicadores más representativos, dentro de lo que son precios y salarios, teníamos el IPC, que fue lo que analizamos, después teníamos el índice medio de salarios.",
        "start": 3666.46,
        "end": 3677.46
    },
    {
        "text": " Que se calcula a nivel público y a nivel privado, en base a un conjunto de unidades que se va stratificando, tiene una cobertura a nivel nacional.",
        "start": 3678.46,
        "end": 3692.46
    },
    {
        "text": " Y a partir de estos 12 construye el índice de salario real como un indicador de la evolución del poder adquisitivo de los salarios también a nivel nacional.",
        "start": 3693.46,
        "end": 3704.46
    },
    {
        "text": " Podría ser algunos cálculos más específicos, si quiero saber de Montevideo del Interior, por ejemplo, porque conozco los IPC, pero eso podría jugar con los propios indicadores. ¿De acuerdo?",
        "start": 3705.46,
        "end": 3719.46
    },
    {
        "text": " ¿Se entendió?",
        "start": 3721.46,
        "end": 3722.46
    },
    {
        "text": " Bien.",
        "start": 3723.46,
        "end": 3724.46
    },
    {
        "text": " Seguimos la próxima donde vamos a empezar a ver balance de paos y vamos avanzando los temalos. Bien. Nos vemos.",
        "start": 3724.46,
        "end": 3734.46
    }
]