[
    {
        "text": " Bueno, habíamos terminado la clase pasada con propiedades de la Junta de una transformación",
        "start": 0.0,
        "end": 25.32
    },
    {
        "text": " lineal. Vamos a ver, por más que ya seguramente las han visto en el práctico, no",
        "start": 25.32,
        "end": 30.16
    },
    {
        "text": " viene mal repasarlas, vamos a ver la demostración de un par de propiedades",
        "start": 30.16,
        "end": 34.64
    },
    {
        "text": " rápido y después vamos a seguir con cómo se representa una cuesta representación",
        "start": 34.64,
        "end": 42.2
    },
    {
        "text": " matricial de una Junta usando bases ortonomales y qué propiedades tienen.",
        "start": 42.2,
        "end": 48.6
    },
    {
        "text": " Y al final de la clase vamos a definir operadores a autóxitos con los cuales vamos a",
        "start": 48.6,
        "end": 52.519999999999996
    },
    {
        "text": " trabajar un par de clases con ellos. Bien, entonces, se acuerdan las propiedades, no las",
        "start": 52.52,
        "end": 59.64
    },
    {
        "text": " voy a volver a escribir. Teníamos, creo que eran siete propiedades.",
        "start": 59.64,
        "end": 69.52000000000001
    },
    {
        "text": " Bien, creo que les había numerado de 1 a 7, voy a hacer la demostración de algunas.",
        "start": 69.52000000000001,
        "end": 75.76
    },
    {
        "text": " Por ejemplo, la propiedad 3 involucra la composición de transformación de la lineada y la",
        "start": 75.76,
        "end": 81.16
    },
    {
        "text": " Junta de una composición, yo tengo una transformación T que va a V a W y una transformación",
        "start": 81.16,
        "end": 89.88
    },
    {
        "text": " S que va a V a un tercer espacio que le llamamos U, son todos los espacios vectoriales",
        "start": 89.88,
        "end": 96.28
    },
    {
        "text": " sobre el mismo cuerpo y cada uno de ellos tiene definido su propio producto interno.",
        "start": 96.28,
        "end": 102.4
    },
    {
        "text": " Bien, entonces lo que no hace es, ya hacemos un dibujito acá, esto es V, vamos a poner",
        "start": 102.4,
        "end": 112.44000000000001
    },
    {
        "text": " el cabajo. Esto es V, esto es W y esto es U. Entonces, la transformación T va a V",
        "start": 112.44000000000001,
        "end": 123.48
    },
    {
        "text": " en W. La transformación S va a V a U. Por lo tanto, la Junta de T, la T estrella va",
        "start": 123.48,
        "end": 135.28
    },
    {
        "text": " de acá para acá y la Junta de S, la S estrella va de acá para acá. Estamos pensando que existen",
        "start": 135.28,
        "end": 144.12
    },
    {
        "text": " las Arjunta, o sea, que trabajamos en dimensión infinita o en infinita, pero que existen",
        "start": 144.12,
        "end": 147.92000000000002
    },
    {
        "text": " las Arjunta. Entonces, obviamente, si yo aplico primero T y después S, lo que sería la composición,",
        "start": 147.92,
        "end": 156.56
    },
    {
        "text": " voy de acá para acá directamente, esto sería S compuesto con T y por lo tanto, la Junta",
        "start": 156.56,
        "end": 165.32
    },
    {
        "text": " de S, ese compuesto con T, a Junta iría de U para V y con eso terminamos todo el dibujito.",
        "start": 165.32,
        "end": 173.16
    },
    {
        "text": " Bien, esto sería S compuesto con T al Junta. Bien, y la propiedad trena decía que relaciona",
        "start": 173.16,
        "end": 183.35999999999999
    },
    {
        "text": " entre S compuesta con T, la Junta de S está la composición y la Junta de las transformaciones",
        "start": 183.35999999999999,
        "end": 189.07999999999998
    },
    {
        "text": " individuales. Me dice la proposición que queremos probar que S compuesto con T al Junta es",
        "start": 189.07999999999998,
        "end": 199.64
    },
    {
        "text": " la composición de las Arjunta de N, o sea, es T al Junta compuesta con S al Junta. Estamos,",
        "start": 199.64,
        "end": 210.6
    },
    {
        "text": " hay que tener cuidado con el orden ahí. Está claro que estoy diciendo que la que es con",
        "start": 210.6,
        "end": 217.2
    },
    {
        "text": " T al Junta, esta acá es la composición de esta con esta. Primero, aplico esta, la S",
        "start": 217.2,
        "end": 222.2
    },
    {
        "text": " al Junta y después aplico esta, la T al Junta. Eso es lo que queremos probar. Y la",
        "start": 222.2,
        "end": 226.64
    },
    {
        "text": " demostración es bien sencilla, pues debe cumplirse para todo, debe cumplirse lo siguiente, y",
        "start": 226.64,
        "end": 241.92
    },
    {
        "text": " ya vamos a escribir, debe cumplirse, que si yo hago, agarró un V acá, agarró un V acá y agarró",
        "start": 241.92,
        "end": 252.44
    },
    {
        "text": " un V acá. Debe cumplirse, que si yo tomo el producto interno, debe con ese composición",
        "start": 252.44,
        "end": 267.88
    },
    {
        "text": " de adjunto, aplicado a U. A ver, a ver, esto es en borroso de escribirlo, pero es bien",
        "start": 267.88,
        "end": 279.48
    },
    {
        "text": " sencilla. La escribo y la V ya en un segundo. La definición de adjunta me dice que si yo agarró,",
        "start": 279.48,
        "end": 294.0
    },
    {
        "text": " ese compuesto con T que es la transformación que estoy considerando, se la aplico a V, se",
        "start": 294.0,
        "end": 299.08
    },
    {
        "text": " lleva acá dentro y toma el producto interno de eso con U, eso me da lo mismo que hacer,",
        "start": 299.08,
        "end": 303.8
    },
    {
        "text": " aplicarle a T al Junta, traerla acá y tomar el producto interno con V. Ese es la definición",
        "start": 303.8,
        "end": 309.68
    },
    {
        "text": " de adjunto, ¿sí? Lo que estamos diciendo es que esta transformación se puede pasar para",
        "start": 309.68,
        "end": 314.36
    },
    {
        "text": " la segunda entrada como testrella. Obviamente que hay los espacios, los productos interno",
        "start": 314.36,
        "end": 319.04
    },
    {
        "text": " dependan en que espacio esté trabajando. Bien, este producto interno, donde es, este producto",
        "start": 319.04,
        "end": 323.12
    },
    {
        "text": " interno es acá, o sea estamos usando el producto interno de fin y on V y este otro producto",
        "start": 323.12,
        "end": 328.6
    },
    {
        "text": " interno es el producto interno de fin y va acá, ese producto interno que tengo definido en U.",
        "start": 328.6,
        "end": 333.04
    },
    {
        "text": " Estamos, esa es la definición de adjunta propiamente dicha y ahora vamos a trabajar un poquito",
        "start": 334.8,
        "end": 340.44
    },
    {
        "text": " esto, fíjense, esto es, esto es, exacto, como es ese aplicado TDB, o sea que podría dejar",
        "start": 340.44,
        "end": 351.16
    },
    {
        "text": " este lado TDB y al E se que está acá, pasarlo por el otro lado como es estrella, o sea",
        "start": 351.16,
        "end": 358.8
    },
    {
        "text": " esto sería TDB y del otro lado sería ese estrella aplicado a U, también por definición de adjunta",
        "start": 358.8,
        "end": 365.0
    },
    {
        "text": " y ese producto interno donde lo estaría tomando, ese producto interno lo estaría tomando TDB,",
        "start": 365.52,
        "end": 372.08
    },
    {
        "text": " V y acá y ese estrella de U y acá, ese producto interno estoy tomando acá en U, V, bien, y después",
        "start": 372.08,
        "end": 380.04
    },
    {
        "text": " lo mismo paso está T para este lado como testrella, o sea que esto me quedaría V, testrella",
        "start": 381.2,
        "end": 389.0
    },
    {
        "text": " aplicado a ese estrella, aplicado a U y este producto interno ahora es, en V, exactamente,",
        "start": 389.72,
        "end": 399.56
    },
    {
        "text": " estamos, y esto se tiene de cumplir para todo V y para todo V, para todo V en el espacio",
        "start": 401.56,
        "end": 409.44
    },
    {
        "text": " del tutorial V y para todo V en el espacio del tutorial U, estamos, entonces ya hemos visto",
        "start": 409.44,
        "end": 414.36
    },
    {
        "text": " una propiedad que si este producto esta de esta igualdad se cumple, este igualdad de acá con",
        "start": 414.44,
        "end": 419.76
    },
    {
        "text": " la última que tengo allá se cumple para todo V, que podemos acá, entonces necesariamente",
        "start": 419.76,
        "end": 426.36
    },
    {
        "text": " esto que está de este lado tiene que ser igual a aquello que está de ese lado, o sea esto",
        "start": 426.36,
        "end": 432.52000000000004
    },
    {
        "text": " implica que como esto es para todo V me implica que ese compuesto con T, así son todas las",
        "start": 432.52000000000004,
        "end": 441.48
    },
    {
        "text": " demostraciones o casi todas, a U que lo del que está del lado derecho allá tiene que ser el",
        "start": 441.48,
        "end": 446.76
    },
    {
        "text": " que está del lado derecho acá, que es la composición de T con E, aplicado a U, eso es",
        "start": 446.76,
        "end": 451.36
    },
    {
        "text": " T estrella compuesta con E estrella y todo esto aplicado a U y esto se tiene de cumplir esta igualdad",
        "start": 451.36,
        "end": 460.56
    },
    {
        "text": " para todo V, por lo tanto esta transformación que tengo acá tiene que ser igual a esta transformación",
        "start": 460.56,
        "end": 469.6
    },
    {
        "text": " que tengo acá, o sea que ese de cumplir entonces hay el horacable que he mandado, espero que",
        "start": 469.6,
        "end": 476.92
    },
    {
        "text": " no volvemos todos al diablo, ese compuesto con T estrella, ese igual a T estrella compuesto",
        "start": 476.92,
        "end": 484.96000000000004
    },
    {
        "text": " con ese estrella, todas las propiedades, bueno como les decía recién la mayoría de las propiedades",
        "start": 484.96000000000004,
        "end": 492.04
    },
    {
        "text": " se prueban usando la definición del producto interno y usando esa condición de que si una igualdad",
        "start": 492.04,
        "end": 498.84000000000003
    },
    {
        "text": " es como esta, con esta, se cumple para todo V, necesariamente lo que tengo acá tiene que ser igual a",
        "start": 498.84,
        "end": 505.0
    },
    {
        "text": " lo que tengo acá, estamos, de ahí salen como coronario por ejemplo que si T es invertible,",
        "start": 505.0,
        "end": 518.3199999999999
    },
    {
        "text": " T estrella es invertible y la inversa de T estrella es la junta de la inversa de T, que lo voy",
        "start": 518.3199999999999,
        "end": 526.64
    },
    {
        "text": " a probar ahora en un ratito, son bien sencillas toda esta propiedad, es más difícil escribirlas que",
        "start": 526.64,
        "end": 534.64
    },
    {
        "text": " entenderlas, digo, una vez el dibujito acá ya está claro, bueno acá voy a tener que borrar algo, puedo",
        "start": 534.64,
        "end": 548.16
    },
    {
        "text": " borrar esta parte acá, entonces como coronario de esto fíjense, sale lo que habíamos llamado la propiedad",
        "start": 548.16,
        "end": 564.56
    },
    {
        "text": " 5, que voy a ser una de las partes, no más, la propiedad 5 me dice que si T es una transformación",
        "start": 564.56,
        "end": 570.9599999999999
    },
    {
        "text": " lineal, entonces T es invertible, si solo si T estrella es invertible y además la inversa de",
        "start": 570.96,
        "end": 590.6800000000001
    },
    {
        "text": " T estrella es la junta de la inversa de T, o sea puedo conmutar acá la estrella con el menos 1,",
        "start": 590.68,
        "end": 600.56
    },
    {
        "text": " T estrella a la menos 1 lo mismo que T, la menos 1 a estrellas. Vamos a hacer, esto es un sí solo,",
        "start": 600.56,
        "end": 610.12
    },
    {
        "text": " si vamos a hacer la parte cita de que esto implica esto, la otra es totalmente analo, ¿no?",
        "start": 610.12,
        "end": 614.68
    },
    {
        "text": " entonces vamos a hacer que si T es invertible, T estrella es invertible y vamos a dejar la otra como",
        "start": 614.68,
        "end": 620.3599999999999
    },
    {
        "text": " ejercicio, esta acá la vamos a dejar, se las hago como ejercicio, hay que trabajar un poquito y con",
        "start": 620.3599999999999,
        "end": 628.8399999999999
    },
    {
        "text": " las estrellas y las inversas y no confundirse, fíjense que T es invertible, significa que existe una",
        "start": 628.8399999999999,
        "end": 640.9599999999999
    },
    {
        "text": " transformación que le llamamos T a la menos 1, estáis que si yo hago, T a la menos 1 compuesto con T,",
        "start": 641.52,
        "end": 649.4000000000001
    },
    {
        "text": " primero aplico T, voy por allá, T a la menos 1 me lo trae para acá, eso es la identidad en el",
        "start": 653.0,
        "end": 659.12
    },
    {
        "text": " espacio ventorial B, esto significa que T es invertible, hay una T a la menos 1,",
        "start": 659.12,
        "end": 667.52
    },
    {
        "text": " no te lo que sea, T compuesto a la menos 1, caigo nuevo en la identidad, entonces por lo que acabamos",
        "start": 667.52,
        "end": 672.8
    },
    {
        "text": " de ver recién, yo puedo tomar la junta de esta, estamos suponiendo que siempre existe, estamos en",
        "start": 672.8,
        "end": 678.8
    },
    {
        "text": " dimensión finita, como hacía recién y esto me dice entonces que T a la menos 1 compuesto con T,",
        "start": 678.8,
        "end": 686.4
    },
    {
        "text": " este estrella es igual a la junta de la identidad, pero es absolutamente tribía al ver que la",
        "start": 686.4,
        "end": 699.28
    },
    {
        "text": " junta de la identidad es la propia identidad, esto es absolutamente tribía, no lo voy a ver pero es",
        "start": 699.28,
        "end": 705.64
    },
    {
        "text": " la demostración tiene la longitud de un dedo, estamos y entonces por lo que vimos recién,",
        "start": 707.16,
        "end": 714.4399999999999
    },
    {
        "text": " esto acá es la estrella de esta compuesto con la estrella de este, o sea este estrella compuesto",
        "start": 715.44,
        "end": 723.84
    },
    {
        "text": " con T a la menos 1 estrella, por lo la propia que vimos recién y esto tiene que ser igual a la",
        "start": 723.84,
        "end": 729.8000000000001
    },
    {
        "text": " identidad, ¿qué me está diciendo esto? Me está diciendo que existe una transformación",
        "start": 729.8000000000001,
        "end": 734.24
    },
    {
        "text": " lineal, esta acá, tal que si yo la compongo con T estrella obtengo la identidad acá, entonces me",
        "start": 734.24,
        "end": 740.72
    },
    {
        "text": " está diciendo que T estrella es invertible y que esta es la inversa de T estrella, estamos,",
        "start": 740.72,
        "end": 747.48
    },
    {
        "text": " ya le hay sacamos, de esto sacamos que T estrella es invertible, la tengo que componer en este",
        "start": 747.48,
        "end": 759.28
    },
    {
        "text": " orden y que la inversa de T estrella es esto, es esta transformación que si la compongo con",
        "start": 759.28,
        "end": 764.84
    },
    {
        "text": " T estrella me da la identidad, estamos y que entonces y la inversa de T estrella es esto",
        "start": 764.84,
        "end": 775.84
    },
    {
        "text": " que está acá, T ahora a menos 1 estrella y la recípro que es absolutamente igual a esto,",
        "start": 775.84,
        "end": 785.2800000000001
    },
    {
        "text": " si T estrella es invertible también es invertible y estas propiedades después la vamos a usar",
        "start": 785.2800000000001,
        "end": 792.2
    },
    {
        "text": " todo el tiempo en lo que resta del curso y la última que esta es linda porque tiene que",
        "start": 792.2,
        "end": 797.0400000000001
    },
    {
        "text": " ver ya con valores propios, hasta ahora estamos trabajando con operadores de transformaciones",
        "start": 797.0400000000001,
        "end": 803.5200000000001
    },
    {
        "text": " y ya que van de 1b a 1b, bueno ¿qué pasa ahora si consideramos transformaciones y ya que van",
        "start": 803.5200000000001,
        "end": 807.6800000000001
    },
    {
        "text": " de b al propio b con producto interno, esos son los que se llaman operadores lineales, entonces",
        "start": 807.6800000000001,
        "end": 813.0400000000001
    },
    {
        "text": " ¿qué podemos decir de los valores propios de uno de los valores linear T y de los valores",
        "start": 813.0400000000001,
        "end": 817.4000000000001
    },
    {
        "text": " propios de T estrella y lo que habíamos visto en la propia Siete, con esta terminada",
        "start": 817.4,
        "end": 825.84
    },
    {
        "text": " vamos a todas las demostraciones que quería dar, la Siete me decía que si T es un operador",
        "start": 825.84,
        "end": 831.36
    },
    {
        "text": " lineal, landa es valor propio de T y ahora se va a empezar a poner lindo el tema, vamos",
        "start": 831.36,
        "end": 848.24
    },
    {
        "text": " a poder, sí, esto porque fíjate, acá tengo, acá tengo una transformación, me está preguntando",
        "start": 848.24,
        "end": 857.84
    },
    {
        "text": " cómo sacamos que la inversa de T era esto, acá tengo que yo compongo T estrella con esto",
        "start": 857.84,
        "end": 865.0400000000001
    },
    {
        "text": " me dé la entidad, entonces quiere decir que esta es la inversa de esta, o sea que quiere",
        "start": 865.0400000000001,
        "end": 872.4
    },
    {
        "text": " decir o que esta es la inversa de esta, o sea que quiere decir que esto que está acá",
        "start": 872.4,
        "end": 879.44
    },
    {
        "text": " es esto a la menos 1, esto que está acá loscribe ahí y esto es igual a la inversa de",
        "start": 879.44,
        "end": 887.8000000000001
    },
    {
        "text": " esto, te estrella la menos 1, la propia Siete me decía entonces que si landa operador",
        "start": 887.8000000000001,
        "end": 893.2
    },
    {
        "text": " lineal y landa, pero si landa es el propio de uno de los valores linear, entonces es un",
        "start": 893.2,
        "end": 898.32
    },
    {
        "text": " sí solo sí, esto vale sí solo sí, el conjugado de landa es valor propio de T estrella y",
        "start": 898.32,
        "end": 907.1600000000001
    },
    {
        "text": " esto lo vamos a usar en las próximas clases, en las próximas clases nos vamos a plantear",
        "start": 907.16,
        "end": 916.76
    },
    {
        "text": " el problema, vamos a volver al tema de la diagonalización de operadores y ya que tenemos valores",
        "start": 916.76,
        "end": 923.04
    },
    {
        "text": " en productos internos, vamos a ver cuando existe una base, valores propios ortomórales,",
        "start": 923.04,
        "end": 928.16
    },
    {
        "text": " entonces ese es el tema que termina de combinar lo que vimos en la primera parte del curso,",
        "start": 928.16,
        "end": 933.88
    },
    {
        "text": " cuando estamos viendo ahora con espacios con productos internos, que es la parte de",
        "start": 933.88,
        "end": 940.2
    },
    {
        "text": " me parece más linda y más interesante del curso, entonces veamos esto, esto es un sí solo",
        "start": 940.2,
        "end": 948.32
    },
    {
        "text": " sí, entonces fíjense lo que pasa, bueno vamos a hacer dos partecitas, es absolutamente",
        "start": 948.32,
        "end": 958.84
    },
    {
        "text": " equivalente, hay algo que no está que está mal escrito en las notas que ya se los digo,",
        "start": 958.84,
        "end": 966.76
    },
    {
        "text": " si yo digo que landa es valor propio de T hay que tener un poquito de cuidado acá, las notas",
        "start": 966.76,
        "end": 974.84
    },
    {
        "text": " es a T en un montón de errores, vamos a tratar de hacer las cosas con cuidado y se van a",
        "start": 974.84,
        "end": 981.0
    },
    {
        "text": " dar cuenta enseguida donde hay errores, yo digo si landa es valor propio de T esto quiere decir,",
        "start": 981.0,
        "end": 986.24
    },
    {
        "text": " que T menos landa por I no es invertible y yo le note así a la identidad, T menos",
        "start": 986.24,
        "end": 996.84
    },
    {
        "text": " landa por I no es invertible, no tiene inversa y además me dice que como he valor propio",
        "start": 996.84,
        "end": 1015.88
    },
    {
        "text": " el landa está en el cuerpo, estamos, o se estoy diciendo si landa es valor propio de T,",
        "start": 1015.88,
        "end": 1023.04
    },
    {
        "text": " entonces landa está en el cuerpo y T menos landa por I no es invertible, ahora si esto no",
        "start": 1023.04,
        "end": 1032.44
    },
    {
        "text": " es invertible por lo que acabamos de ver recién, la Junta de esto tampoco es invertible,",
        "start": 1032.44,
        "end": 1039.0
    },
    {
        "text": " entonces esto me implica también que T menos landa por I estrella no es invertible, y recordemos",
        "start": 1039.0,
        "end": 1054.64
    },
    {
        "text": " de nuevo que llevemos siempre a que han notado que landa está en el cuerpo en el que estamos trabajando.",
        "start": 1054.64,
        "end": 1059.04
    },
    {
        "text": " Y ahora ahí desarrollo esto, esto aquí es por propiedades que no probamos, porque son",
        "start": 1059.04,
        "end": 1069.96
    },
    {
        "text": " la 1 y 2, T menos landa por I estrella es la estrella de esto, T estrella menos la estrella",
        "start": 1069.96,
        "end": 1078.08
    },
    {
        "text": " de esto, y la estrella de esto como landa es una escalar sale para fuera como landa con jugado,",
        "start": 1078.08,
        "end": 1082.36
    },
    {
        "text": " eso es una propiedad que no la probamos pero es fácil de probar, landa con jugado y después",
        "start": 1082.36,
        "end": 1087.2
    },
    {
        "text": " me queda la estrella identidad que es la propiedad, entonces esto acá escrito es lo mismo",
        "start": 1087.2,
        "end": 1094.1200000000001
    },
    {
        "text": " que esto acá, T estrella menos, el estrella de todo esto que es landa con jugado por estrella",
        "start": 1094.1200000000001,
        "end": 1099.64
    },
    {
        "text": " identidad que es la propiedad identidad, entonces lo que estamos diciendo es que esto acá",
        "start": 1099.64,
        "end": 1104.04
    },
    {
        "text": " no es invertible y además landa está en el cuerpo de los escalares, ahora si landa está",
        "start": 1104.04,
        "end": 1110.3600000000001
    },
    {
        "text": " en el cuerpo de los escalares el con jugado también está en el cuerpo de los escalares, si trabajamos",
        "start": 1110.3600000000001,
        "end": 1114.16
    },
    {
        "text": " con los reales, es el mismo landa y si trabajamos en los complejos es el con jugado, que también",
        "start": 1114.2,
        "end": 1118.96
    },
    {
        "text": " está en el cuerpo, que está en el cuerpo los complejos, o sea que esto acá lo podemos escribir",
        "start": 1118.96,
        "end": 1123.52
    },
    {
        "text": " como que landa con jugado está en el cuerpo y esto no es invertible, entonces qué significa",
        "start": 1123.52,
        "end": 1128.64
    },
    {
        "text": " esto, esto significa que el landa con jugado es valor propio de T estrella, estamos, entonces",
        "start": 1128.64,
        "end": 1137.96
    },
    {
        "text": " implica que landa con jugado es valor propio de T estrella, bien la reci provoco crearme",
        "start": 1137.96,
        "end": 1154.3600000000001
    },
    {
        "text": " que es absolutamente, absolutamente equivalente, se las dejo también como ejercicio,",
        "start": 1154.3600000000001,
        "end": 1163.72
    },
    {
        "text": " bien es aplicar el mismo razonamiento, si landa con jugado es valor propio de T estrella,",
        "start": 1167.96,
        "end": 1180.64
    },
    {
        "text": " entonces el con jugado de landa que es el doble con jugado, el propio landa es valor propio",
        "start": 1180.64,
        "end": 1186.16
    },
    {
        "text": " de T estrella estrella que es el propio T, o sea es lo mismo, vamos, como o sea, como?",
        "start": 1186.16,
        "end": 1195.32
    },
    {
        "text": " yo digo, si algo valor propio, si landa es valor propio de T esto no es invertible,",
        "start": 1195.32,
        "end": 1203.84
    },
    {
        "text": " justamente porque la condición que te acuerrate que la raíz característica es el determinante",
        "start": 1203.84,
        "end": 1211.24
    },
    {
        "text": " de esto igual a cero, entonces toda la raíz que están ahí me hacen que esto tenga determinadas",
        "start": 1211.24,
        "end": 1216.8
    },
    {
        "text": " de esto no es invertible, cuando le pongo landa, claro, el determinante de esto es el",
        "start": 1216.8,
        "end": 1228.36
    },
    {
        "text": " ponimiento característico de landa, cuando le pongo los valores propios que me queda",
        "start": 1228.36,
        "end": 1232.0
    },
    {
        "text": " de T estrella cero ahí no es invertible, para eso es landa, está bien, entonces ahí sale",
        "start": 1232.0,
        "end": 1236.6399999999999
    },
    {
        "text": " el nudo, sí, ¿qué? Si, recordemos que vas a trabajar en condiciones que me garantizan",
        "start": 1236.64,
        "end": 1250.4
    },
    {
        "text": " que T estrella existe, esto es, o que bien la dimensión es finita, que su me garantiza",
        "start": 1250.4,
        "end": 1255.2800000000002
    },
    {
        "text": " siempre que T estrella existe, o bien que estamos trabajando dimensión infinita y además",
        "start": 1255.2800000000002,
        "end": 1259.48
    },
    {
        "text": " T estrella existe. Entonces, con esto terminamos de cerrar las propiedades de la clase pasada,",
        "start": 1259.48,
        "end": 1273.28
    },
    {
        "text": " lo que vamos a hacer ahora es ver una manera, se acuerna de yo les había dicho que hay una",
        "start": 1273.28,
        "end": 1283.16
    },
    {
        "text": " manera fácil de calcular la adjunta de una transformación lineal, vía su matriz asociada,",
        "start": 1283.16,
        "end": 1288.32
    },
    {
        "text": " pero no eso lo vamos a ver ahora, si uno trabaja con base hortónormales, el cálculo",
        "start": 1288.32,
        "end": 1293.3999999999999
    },
    {
        "text": " de la adjunta es, si uno conoce la representación matrizial de T, la representación matrizial",
        "start": 1293.3999999999999,
        "end": 1298.6799999999998
    },
    {
        "text": " de la testrella es directa, o sea, es bien sencillo calcular la adjunta. Entonces vamos a hacer",
        "start": 1298.6799999999998,
        "end": 1308.3999999999999
    },
    {
        "text": " un par de observaciones con respecto a la representación matrizial de la adjunta, lo",
        "start": 1308.3999999999999,
        "end": 1314.36
    },
    {
        "text": " que vamos a hacer es trabajar con base hortónormales, como les decía recién, porque",
        "start": 1314.36,
        "end": 1328.04
    },
    {
        "text": " ahí las cálculos se simplifican, entonces vamos a trabajar todo lo que vamos a ver ahora",
        "start": 1328.04,
        "end": 1336.4399999999998
    },
    {
        "text": " en esta representación, estas propiedades van a ser para suponiendo que estamos trabajando",
        "start": 1336.4399999999998,
        "end": 1340.4399999999998
    },
    {
        "text": " con base hortónormales, cosa que sabemos que existen porque agarramos una base cualquiera",
        "start": 1340.44,
        "end": 1345.96
    },
    {
        "text": " y con el proceso Grams-Mit construir una base hortónormal en dimensión finita, ¿no?",
        "start": 1345.96,
        "end": 1351.76
    },
    {
        "text": " Entonces lo que tenemos es, tengo dos espacios vectoriales con producto interno, tengo",
        "start": 1351.76,
        "end": 1368.4
    },
    {
        "text": " dos espacios vectoriales sobre el mismo cuerpo y con producto interno. Bien, al producto",
        "start": 1368.4,
        "end": 1394.2800000000002
    },
    {
        "text": " interno de acá le llamamos así, le montamos así, al de acá lo notamos con un sub índice",
        "start": 1394.28,
        "end": 1402.52
    },
    {
        "text": " y entonces lo que vamos a tener es una transformación lineal que va de aquí, de acá para acá,",
        "start": 1402.52,
        "end": 1429.6399999999999
    },
    {
        "text": " y lo último van a hacer una base hortónormal en B y una base hortónormal en W, le",
        "start": 1429.64,
        "end": 1452.1000000000001
    },
    {
        "text": " vamos a llamar B a la base hortónormal que vamos a trabajar acá, B y larga y a la de acá",
        "start": 1452.1,
        "end": 1464.06
    },
    {
        "text": " le vamos a llamar C, C base hortónormal de W, bien y a sus elementos le vamos a llamar, lo vamos",
        "start": 1464.06,
        "end": 1475.6999999999998
    },
    {
        "text": " a notar así, la base hortónormal tiene elementos que le llamamos B1, B2 hasta Bn y la base",
        "start": 1475.7,
        "end": 1492.82
    },
    {
        "text": " C tiene elementos que le vamos a llamar W1, W2 hasta Wm, uno tiene dimensión en el otro",
        "start": 1492.82,
        "end": 1500.26
    },
    {
        "text": " y dimensión M y esto es una base hortónormal de W, vamos a trabajar en ese contexto obviamente",
        "start": 1500.26,
        "end": 1509.94
    },
    {
        "text": " para construir base hortónormales necesito los productos internos, esta es una base hortónormal",
        "start": 1509.94,
        "end": 1515.26
    },
    {
        "text": " con este producto interno y la otra es una base hortónormal con este otro producto interno.",
        "start": 1515.26,
        "end": 1523.58
    },
    {
        "text": " Y ahora vamos a ver cómo se representa, qué relaciona entre la materia de sociedad",
        "start": 1523.58,
        "end": 1528.7
    },
    {
        "text": " y la materia de sociedad estrella en estas bases, eso lo que vamos a ver.",
        "start": 1528.7,
        "end": 1531.8600000000001
    },
    {
        "text": " Entonces vamos a ver en primer lugar lo siguiente, veamos esto, veamos en primer lugar",
        "start": 1531.86,
        "end": 1561.1799999999998
    },
    {
        "text": " la matriz cambio de base de T, usando como base de partida B y como base de llegada C.",
        "start": 1561.18,
        "end": 1574.0600000000002
    },
    {
        "text": " La matriz le vamos a llamar M para simplificar la notación. Bien ahora repaso, cómo se construye",
        "start": 1574.06,
        "end": 1593.82
    },
    {
        "text": " una matriz asociada para una base, cualquier base, te a cada uno de los elementos de base",
        "start": 1593.82,
        "end": 1600.78
    },
    {
        "text": " acá y lo descompongo como combinación eñal de los elementos acá y cuelgo las coordenadas",
        "start": 1600.78,
        "end": 1605.54
    },
    {
        "text": " como colundas. Siguiente, lo que tengo que hacer acá es aplicarle TAB1 y calcular las coordenadas",
        "start": 1605.54,
        "end": 1614.34
    },
    {
        "text": " de esto en la base C y colgar las acá y lo mismo para todo, así hasta llegar a el T en",
        "start": 1614.34,
        "end": 1623.52
    },
    {
        "text": " vejota, descomponer las coordenadas G6 y colgar eso acá y hasta el último.",
        "start": 1623.52,
        "end": 1632.44
    },
    {
        "text": " TENVEN, lo cuelgo acá. Esto es una matriz de tamaño M, estos están en este espacio que",
        "start": 1632.44,
        "end": 1649.24
    },
    {
        "text": " tiene dimension M y tengo N vectores en la base original, los estos son las noticias M por N,",
        "start": 1649.24,
        "end": 1654.24
    },
    {
        "text": " como ustedes ya saben. Hasta acá no hemos usado que sean base de ortonomales ni nada, lo vamos a usar",
        "start": 1654.24,
        "end": 1661.92
    },
    {
        "text": " ahora, se acuerdan las propiedades de base de ortonomales, yo acá estoy trabajando con un vector",
        "start": 1661.92,
        "end": 1666.4
    },
    {
        "text": " cualquiera que está en WB, si yo tengo una base de ortonomales en WB las coordenadas son muy fáciles",
        "start": 1666.4,
        "end": 1672.16
    },
    {
        "text": " de calcular, eso lo sabemos, entonces por serse una base ortonomal por ejemplo si yo",
        "start": 1672.16,
        "end": 1693.5600000000002
    },
    {
        "text": " si yo calcular esta columna acá, esto acá, le tengo que aplicarte a vejota que esto vive en WB y lo",
        "start": 1693.56,
        "end": 1712.2
    },
    {
        "text": " tengo que descomponer en la base C, se acuerdan como se descomponer eso, se toma el producto interno,",
        "start": 1712.2,
        "end": 1717.44
    },
    {
        "text": " de esto acá, de este vector, cuando yo quiero descomponer cualquier vector esta base ortonomal,",
        "start": 1717.44,
        "end": 1722.8
    },
    {
        "text": " agarro el producto interno de ese vector, con respecto a cada uno de los vectores de la base,",
        "start": 1722.8,
        "end": 1726.6
    },
    {
        "text": " multiplico por el vector de la base y sumo, si yo se le tengo que hacer acá es tomar el producto",
        "start": 1726.6,
        "end": 1731.2
    },
    {
        "text": " interno de TMVJ, con cada uno de los elementos de la base este, de esta WI, multiplicar por",
        "start": 1731.2,
        "end": 1740.84
    },
    {
        "text": " el WI y sumar sobre todos los elementos y desde uno hasta M, esto es por ser una base ortonomal,",
        "start": 1740.84,
        "end": 1749.12
    },
    {
        "text": " en general esto acá vale porque C es una base ortonomal, entonces esto me dice cuáles son",
        "start": 1749.12,
        "end": 1760.12
    },
    {
        "text": " las coordenadas justamente estas cosas que vienen acá, estos de cala, bueno este producto interno",
        "start": 1760.12,
        "end": 1768.6
    },
    {
        "text": " está en WB, es el producto interno de W, estas cosas que vienen acá son justamente las coordenadas",
        "start": 1768.6,
        "end": 1774.4399999999998
    },
    {
        "text": " del vector TMVJ, ¿si? entonces",
        "start": 1779.6,
        "end": 1784.6
    },
    {
        "text": " ¿qué quiere decir eso que las coordenadas acá las puedo calcular, las puedo escribir en términos",
        "start": 1789.52,
        "end": 1793.9199999999998
    },
    {
        "text": " del producto de los productos de calares eso, entonces esto acá para permítanme",
        "start": 1793.92,
        "end": 1798.5600000000002
    },
    {
        "text": " escribir de nuevo acá sin hacer un dibujo nuevo, lo que vendría acá la columna esta de coordenadas",
        "start": 1798.5600000000002,
        "end": 1810.16
    },
    {
        "text": " sería, la primera coordenada sería lo que está multiplicando W1, esto es",
        "start": 1810.16,
        "end": 1816.88
    },
    {
        "text": " tembejota con W1, la segunda coordenada lo que está multiplicando W2 etcétera, la IES y",
        "start": 1816.88,
        "end": 1829.7600000000002
    },
    {
        "text": " me coordenada, si yo considera acá esta es la columna j, si yo considera acá la fila I,",
        "start": 1829.7600000000002,
        "end": 1835.3600000000001
    },
    {
        "text": " la IES y me coordenada que vendría acá que sería lo que está multiplicando acá a WI, o sea",
        "start": 1835.36,
        "end": 1848.6799999999998
    },
    {
        "text": " T en vez j, escalar WI y así hasta que la última sería T en vez j, escalar WM, estamos,",
        "start": 1848.68,
        "end": 1863.6000000000001
    },
    {
        "text": " ahí tengo explícitamente las coordenadas calculadas con los productos interno de esto con respecto",
        "start": 1863.6000000000001,
        "end": 1869.88
    },
    {
        "text": " a cada uno de los elementos de la base, y para un producto interno de esto con cada uno de los",
        "start": 1869.88,
        "end": 1875.02
    },
    {
        "text": " elementos de la base, entonces fíjense, la entrada IJ esta matriz lo que corresponde a la fila I,",
        "start": 1875.02,
        "end": 1881.62
    },
    {
        "text": " columna j es justamente lo que tengo pues total, sí, entonces resumiendo si a las entradas",
        "start": 1881.62,
        "end": 1893.02
    },
    {
        "text": " M le llamamos M-1, la IJ, si la entrada M le llamamos M-1, la entrada lo que corresponde",
        "start": 1893.02,
        "end": 1911.74
    },
    {
        "text": " a la fila I columna j es esto que marcamos ahí, de notando esto se tiene que la entrada M-IJ",
        "start": 1911.74,
        "end": 1921.82
    },
    {
        "text": " es T en vez j con WI, producto interno que tengo que tomar en WD, es decir, para ver la entrada",
        "start": 1921.82,
        "end": 1932.9399999999998
    },
    {
        "text": " IJ de esa matriz cambio de base, a dar un J es y elemento de la base acá, le aplico T y",
        "start": 1932.9399999999998,
        "end": 1940.5
    },
    {
        "text": " tomo el producto interno con el I es y elemento acá y eso me da la entrada M-IJ del cambio de base,",
        "start": 1940.5,
        "end": 1945.74
    },
    {
        "text": " esta creo que es la, si no es la última cuenta que hacemos con su V índice,",
        "start": 1952.74,
        "end": 1957.56
    },
    {
        "text": " es peor en el palo, no no no no no me acuerdo pero espero que sí, esta la entrada de la",
        "start": 1957.56,
        "end": 1964.86
    },
    {
        "text": " matriz cambio de base, sí, la entrada matriz cambio de base de la T y esto obviamente vale para",
        "start": 1964.86,
        "end": 1971.4199999999998
    },
    {
        "text": " todo I desde 1 hasta M y para todo J desde 1 hasta M, bien entonces tenemos, usando que esto",
        "start": 1971.4199999999998,
        "end": 1983.82
    },
    {
        "text": " es una base autónoma de WD, tenemos una representación sencilla de la matriz cambio de base",
        "start": 1983.82,
        "end": 1988.6599999999999
    },
    {
        "text": " de esta transformación niña y ahora veamos la matriz cambio de base de la Junta usando",
        "start": 1988.66,
        "end": 1997.02
    },
    {
        "text": " las mismas, las mismas bases, solo que ahora esta base de la base de partida y esta base",
        "start": 1997.02,
        "end": 2002.6200000000001
    },
    {
        "text": " de la base de la espacio llegada porque la T estrella, la T estrella viene de acá para acá y",
        "start": 2002.6200000000001,
        "end": 2011.38
    },
    {
        "text": " vamos a ver qué relaciona hay entre esa matriz, asociar la T estrella y la asociar la T.",
        "start": 2011.38,
        "end": 2016.26
    },
    {
        "text": " Me sigue acá, esto es medio burrido pero ya lo terminamos, entonces lo que vamos a",
        "start": 2017.22,
        "end": 2025.68
    },
    {
        "text": " ver ahora es,",
        "start": 2025.68,
        "end": 2026.54
    },
    {
        "text": " veamos ahora la matriz N que es la cambio de base de la Junta de la T estrella usando ahora como",
        "start": 2037.3,
        "end": 2044.42
    },
    {
        "text": " base de partida la C y como base de llegada la B y ahora ahí vamos a usar que la B es una base",
        "start": 2044.42,
        "end": 2050.38
    },
    {
        "text": " autónoma para encontrar la relación que queremos encontrar. A las entradas de N le vamos a llamar",
        "start": 2050.38,
        "end": 2057.38
    },
    {
        "text": " N y J y ahora ahí va desde 1 hasta N y J para desde 1 hasta N.",
        "start": 2057.38,
        "end": 2070.7400000000002
    },
    {
        "text": " Cambiamos el papel de H y J pero no importa, son índices genericos de la matriz cambio de base",
        "start": 2073.2200000000003,
        "end": 2078.1
    },
    {
        "text": " acá y lo solo da la matriz cambio de base acá.",
        "start": 2078.1,
        "end": 2080.54
    },
    {
        "text": " Un punto de vista de una Shah mat・・",
        "start": 2087.6600000000003,
        "end": 2093.7400000000002
    },
    {
        "text": " Pero es un segundoito este.",
        "start": 2093.74,
        "end": 2100.74
    },
    {
        "text": " No le llamamos, le llamamos un generico, le llamamos, le podría marcar el, no importa.",
        "start": 2117.1,
        "end": 2122.1
    },
    {
        "text": " ¿Qué tamaño tiene la matriz?",
        "start": 2122.1,
        "end": 2129.1
    },
    {
        "text": " Esta matriz, esta matriz tiene tamaño N por M, entonces este índice va entre 1 y N y este va entre 1 y N.",
        "start": 2129.1,
        "end": 2140.1
    },
    {
        "text": " Están al tal al tal al reved, por ahí por el sol, son el sonido y el generico.",
        "start": 2140.1,
        "end": 2144.1
    },
    {
        "text": " Pero entonces ¿veamos qué relación hay entre estos índices?",
        "start": 2144.1,
        "end": 2147.1
    },
    {
        "text": " Entres estas entradas, perdón.",
        "start": 2147.1,
        "end": 2150.1
    },
    {
        "text": " Veamos qué relación hay entre estas entradas y estas entradas.",
        "start": 2150.1,
        "end": 2154.1
    },
    {
        "text": " La del A T y la del A T estrella. Eso lo vemos ahora.",
        "start": 2154.1,
        "end": 2159.1
    },
    {
        "text": " Veamos unos genericos, se cumple.",
        "start": 2159.1,
        "end": 2163.1
    },
    {
        "text": " Lo siguiente, yo agarro el índice H y J generico, de la de la T estrella.",
        "start": 2163.1,
        "end": 2170.1
    },
    {
        "text": " Y ahí uso lo que vimos recién. ¿Cómo se calcula si yo uso una base ortonormal?",
        "start": 2171.1,
        "end": 2178.1
    },
    {
        "text": " Acá hay una base ortonormal acá. ¿Cómo se calcula el T estrella social sabase?",
        "start": 2178.1,
        "end": 2184.1
    },
    {
        "text": " Es la misma cuenta que hicimos recién.",
        "start": 2184.1,
        "end": 2187.1
    },
    {
        "text": " Te voy a aplicarle T a una entrada a un vector acá y tomar el producto interno con un vector de la base acá.",
        "start": 2187.1,
        "end": 2194.1
    },
    {
        "text": " Entonces ¿qué me decía lo que vimos recién? ¿Qué esto acá? Pero un test estrella, porque es la transformación T.",
        "start": 2195.1,
        "end": 2200.1
    },
    {
        "text": " ¿Qué me decía esto? ¿Qué la H y J le toca aplicar T estrella al vector J e s y m o ahora de la de espacio de partida?",
        "start": 2200.1,
        "end": 2211.1
    },
    {
        "text": " O sea, J e s y m o acá que era el...",
        "start": 2211.1,
        "end": 2215.1
    },
    {
        "text": " El doble vejota.",
        "start": 2216.1,
        "end": 2219.1
    },
    {
        "text": " Y eso tomar el producto con el elemento Y esimo de la base esta, que es el Veí.",
        "start": 2220.1,
        "end": 2228.1
    },
    {
        "text": " Y ese producto interno ahora la estoy tomando en el espacio vectorial Ve.",
        "start": 2228.1,
        "end": 2234.1
    },
    {
        "text": " Se entiende, estoy usando el mismo resultado que antes, en la trioma de Sía.",
        "start": 2234.1,
        "end": 2239.1
    },
    {
        "text": " Si yo tengo una T que va de acá acá y quiero ver el elemento Ij le aplico T a la J e s y m entrada de acá y veo el producto interno con la Y s y mada de acá.",
        "start": 2239.1,
        "end": 2248.1
    },
    {
        "text": " Y ahora tengo el T estrella Ij, que quiere decir, aplíquen el T estrella, el J e s y m o el elemento de acá, o sea, T estrella Wj y tome el producto interno con el I s y m o el elemento de acá, con el Veí.",
        "start": 2249.1,
        "end": 2263.1
    },
    {
        "text": " Y ese producto interno lo toma acá, esa es el resultado que vimos recién.",
        "start": 2263.1,
        "end": 2268.1
    },
    {
        "text": " Estamos. Esto es por lo que acabamos de ver. Por esto.",
        "start": 2268.1,
        "end": 2275.1
    },
    {
        "text": " Me dice como se calcula. Fíjese Ij, aplíquen la transformación del elemento J e s y m o del espacio de partida y tome el producto interno con el elemento I s y m o el espacio de llegada.",
        "start": 2277.1,
        "end": 2287.1
    },
    {
        "text": " Aplico este remismo, el resultado de acá. Aplíquen el T estrella, porque ahora el J e s y m o el elemento del espacio de partida y descomponga el producto interno con el I s y m o el elemento de la base del punto y llegada.",
        "start": 2287.1,
        "end": 2301.1
    },
    {
        "text": " Es lo mismo de acá. Entonces esto vale por lo que vimos recién.",
        "start": 2301.1,
        "end": 2305.1
    },
    {
        "text": " Es que estúpido lo que hago por lo que vimos. Por lo que vimos vale eso. Ahora vamos a hacer un par de manioras, ahí bien sencilla.",
        "start": 2305.1,
        "end": 2318.1
    },
    {
        "text": " La primera es que vamos a cambiar el orden de estas cosas, este producto interno. Si yo cambio el orden te va a tomar el conjugado.",
        "start": 2318.1,
        "end": 2325.1
    },
    {
        "text": " Bien, entonces esto acá lo mismo que poner. Ve y con T estrella, le ve J, complejo con jugado.",
        "start": 2326.1,
        "end": 2337.1
    },
    {
        "text": " Le cambian el orden de los espectores que te pueden ver el producto interno y puse ahí complejo con jugado.",
        "start": 2340.1,
        "end": 2347.1
    },
    {
        "text": " Y ahora usamos la definición de la Junta. La definición de la Junta me dice justamente que este estrella lo pudo pasar por este lado como T.",
        "start": 2348.1,
        "end": 2365.1
    },
    {
        "text": " O sea que esto lo mismo que te ha aplicado en VI con WJ, sólo que ahora el producto interno lo estoy tomando en el espacio de corresponde, que es el espacio W, donde vive en este vector y este.",
        "start": 2366.1,
        "end": 2381.1
    },
    {
        "text": " Y a eso lo tengo que tomar el complejo con jugado.",
        "start": 2381.1,
        "end": 2385.1
    },
    {
        "text": " Si, entonces fíjense que el elemento de J, la materia social de la estestrella, lo escribí con algo que involucra la T, este producto interno y el conjugado.",
        "start": 2386.1,
        "end": 2404.1
    },
    {
        "text": " Pero fíjense esto acá que es justamente la entrada, bueno, ahí está en cambio a los índices, es la entrada J de la materia original.",
        "start": 2404.1,
        "end": 2418.1
    },
    {
        "text": " Es la entrada J de la materia original, asociate con complejo con jugado.",
        "start": 2418.1,
        "end": 2425.1
    },
    {
        "text": " Esto acá es la entrada, asociate a J, están cambiados si yo cambio acá el orden de ahí con J, tengo cambio lo que también.",
        "start": 2425.1,
        "end": 2435.1
    },
    {
        "text": " T envéis, WJ, exactamente, es el mejor J.",
        "start": 2435.1,
        "end": 2441.1
    },
    {
        "text": " Y esto usan un poquito de la notación, acá tengo línice en este orden, IJ y acá los tengo asociado en este orden, J, I.",
        "start": 2442.1,
        "end": 2455.1
    },
    {
        "text": " Si lo quiero escribir con el orden cambio, tengo que trabajar con la materia de Junta. O sea esto sería lo mismo que la entrada M, IJ de la materia, perdón, de la materia y traspuesta, quise decir, de la materia y traspuesta, el conjugado de ese.",
        "start": 2455.1,
        "end": 2470.1
    },
    {
        "text": " Si, para recuperar el mismo orden, IJ que tenía acá.",
        "start": 2471.1,
        "end": 2480.1
    },
    {
        "text": " Entonces lo que estoy diciendo es que si estoy trabajando con base hortónormales, la entrada IJ de la materia social test 3 ya en esas bases, en el orden que corresponde es...",
        "start": 2480.1,
        "end": 2494.1
    },
    {
        "text": " La entrada IJ de la materia original de la cambio base de T traspuesta y conjugada.",
        "start": 2495.1,
        "end": 2503.1
    },
    {
        "text": " Si? Complejo con jugado. Dado una matriz, podemos definir su compleja conjugada como aquella matriz en donde en todas las entradas tomamos el complejo con jugado.",
        "start": 2503.1,
        "end": 2513.1
    },
    {
        "text": " Entonces lo que estamos diciendo acá en otras palabras es que...",
        "start": 2514.1,
        "end": 2519.1
    },
    {
        "text": " Por otro otro que estamos diciendo acá es que la matriz N cuya centrada son estas, las N iJ, la que puede ser...",
        "start": 2527.1,
        "end": 2535.1
    },
    {
        "text": " Es igual a la matriz N la que tenía al principio, traspuesta con jugado.",
        "start": 2536.1,
        "end": 2546.1
    },
    {
        "text": " Traspongo la matriz y con jugosos elementos. Si estoy trabajando en los reales, con jugado no me da nada solamente tengo que transponer.",
        "start": 2546.1,
        "end": 2553.1
    },
    {
        "text": " Y esto es justamente...",
        "start": 2554.1,
        "end": 2560.1
    },
    {
        "text": " Si los creimos en términos de qué significa M y qué significa N, recordemos que M era la matriz sociedad T y N es esto que tengo acá.",
        "start": 2566.1,
        "end": 2575.1
    },
    {
        "text": " Esto implica entonces que la matriz asociada a T estrella en las bases ortonomales.",
        "start": 2576.1,
        "end": 2582.1
    },
    {
        "text": " C i B, esto era N es M que era la matriz sociedad T ahora con las bases cambiadas acá porque espacio de partida B tiene base B y espacio de llegar tiene base C.",
        "start": 2582.1,
        "end": 2598.1
    },
    {
        "text": " A esa matriz la tengo que transponer y conjugar.",
        "start": 2599.1,
        "end": 2603.1
    },
    {
        "text": " Ahora la operación es transponer y conjugar con Mutan porque el hogar es una matriz transpongue y después con jugosos elementos me lo mismo que si conjugos los elementos de la matriz después transpongue.",
        "start": 2603.1,
        "end": 2614.1
    },
    {
        "text": " Eso es obvio eso. O sea que esto lo puede escribir como esta transpuesta conjugada, perdón esta conjugada transpuesta.",
        "start": 2614.1,
        "end": 2622.1
    },
    {
        "text": " Entonces lo que estamos diciendo es que ya confunde el palabra Río Este, lo que estamos diciendo es que la matriz asociada a T estrella en las bases ortonomales es la matriz sociedad T",
        "start": 2623.1,
        "end": 2636.1
    },
    {
        "text": " complejo con jugado de todos los elementos y transpuesta. Así es el sí, yo no tengo que hacer prácticamente ninguna cuenta.",
        "start": 2639.1,
        "end": 2646.1
    },
    {
        "text": " Me dan la matriz sociedad a T, la transpongo y conjuge su elemento y tengo la matriz sociedad a T estrella. Si estoy trabajando en base de ortonomales ojo.",
        "start": 2647.1,
        "end": 2656.1
    },
    {
        "text": " Esto es si las bases son ortonomales.",
        "start": 2660.1,
        "end": 2663.1
    },
    {
        "text": " Si no son ortonomales ahí ya es otro cantar, pero si son ortonomales tengo esta relación bien sencisa.",
        "start": 2663.1,
        "end": 2682.1
    },
    {
        "text": " Estamos.",
        "start": 2683.1,
        "end": 2687.1
    },
    {
        "text": " Los unos visto en ejemplo otro día, en los ejemplos que yo les dije si se acuerdan trabajamos con la base canónica, acepta citamente yplicitamente estamos trabajando con una base ortonomal.",
        "start": 2692.1,
        "end": 2702.1
    },
    {
        "text": " Exactamente en el producto interno usual.",
        "start": 2703.1,
        "end": 2708.1
    },
    {
        "text": " En el producto interno usual y ahí uno puede hacer las cuentas, pero ni siquiera se falta hacer las cuentas.",
        "start": 2708.1,
        "end": 2713.1
    },
    {
        "text": " Vamos a escribir la matriz sociedad, suponemos que está trabajando con el escalar, cuerpo que la es reales.",
        "start": 2713.1,
        "end": 2717.1
    },
    {
        "text": " Vamos a medir la matriz sociedad a T y usa el espacio partida mismo que el espacio llegada. La base canónica, producto interno habitual, a calle a calle y la base canónica.",
        "start": 2717.1,
        "end": 2726.1
    },
    {
        "text": " Bueno, me da la matriz sociedad a T y la base canónica, estás trabajando con reales. Si yo quiero obtener la matriz sociedad a T estrella, transpongo esa matriz listo.",
        "start": 2727.1,
        "end": 2735.1
    },
    {
        "text": " Sí, sí, porque de hecho, pues a ver cómo pasar, cómo escribir esto, cómo pasar esto a otra representación de base que no son ortonomales, lo que pasa es que queden otras cosas.",
        "start": 2739.1,
        "end": 2750.1
    },
    {
        "text": " Estas parecen tecoras, que tenés que hacer las matrices cambió base, se complica un poco.",
        "start": 2751.1,
        "end": 2757.1
    },
    {
        "text": " Bueno, era tedioso hasta parte, pero había que darla.",
        "start": 2760.1,
        "end": 2767.1
    },
    {
        "text": " Lo que vamos a hacer ahora ya para el final de la clase es mucho más, ya casi no hay cuentas.",
        "start": 2769.1,
        "end": 2773.1
    },
    {
        "text": " Nos vamos a concentrar, como les decía recién en operadores liñales, o sea, transformación liada que van de B en el propio B.",
        "start": 2774.1,
        "end": 2783.1
    },
    {
        "text": " Y en particular, como estudiar aquellas que son autoaljuntas, que se llaman autoaljuntas, son aquellas en que la T coincide con la T estrella.",
        "start": 2785.1,
        "end": 2792.1
    },
    {
        "text": " Si este espacio es el mismo espacio de partida que llegada, entonces tiene sentido decir que T es igual a T estrella.",
        "start": 2793.1,
        "end": 2800.1
    },
    {
        "text": " Entonces, nos vamos a concentrar en los operadores liñales y vamos a estudiar lo que llaman los operadores autoaljuntos.",
        "start": 2801.1,
        "end": 2809.1
    },
    {
        "text": " Y después veremos propiedades interesantes de estos operadores que aparecen muchísimo en la práctica.",
        "start": 2810.1,
        "end": 2815.1
    },
    {
        "text": " Entonces, vamos a terminar la clase definiendo lo que son los operadores autoaljuntos.",
        "start": 2818.1,
        "end": 2823.1
    },
    {
        "text": " Sin los cuales no existiría la mecánica cuántica, esto nunca me canso así, pero nadie sabe por qué hago esa afirmación, pero crea que es así.",
        "start": 2831.1,
        "end": 2839.1
    },
    {
        "text": " Operadores autoaljuntos que tienen propiedades sumamente interesantes, que son los siguientes.",
        "start": 2840.1,
        "end": 2850.1
    },
    {
        "text": " Vamos a considerar como siempre, es espacio territorial, sobre cae y con producto interno.",
        "start": 2850.1,
        "end": 2868.1
    },
    {
        "text": " Cada vez me cuesta más escribir la letra acá, cuestiones tienen que ver con la decadente política argentina, pero bueno.",
        "start": 2868.1,
        "end": 2887.1
    },
    {
        "text": " Bien, y tengo una transformación T que va de bember, un operador liñal, es un operador que va de bember.",
        "start": 2887.1,
        "end": 2907.1
    },
    {
        "text": " Entonces, el test3 ya como decía recién va también de bember obviamente, y decimos que T es autoaljuntos si test3 ya coincide con T.",
        "start": 2918.1,
        "end": 2929.1
    },
    {
        "text": " Entonces, definición T es autoaljuntos si solo si T estrellas es igual a T.",
        "start": 2929.1,
        "end": 2957.1
    },
    {
        "text": " Entonces, si lo operador autoaljuntos es lo mismo que lo operador original.",
        "start": 2959.1,
        "end": 2971.1
    },
    {
        "text": " Esto es lo mismo que así lo siguiente, esto es si solo si, vamos a escribir esplicitamente que significa esto.",
        "start": 2971.1,
        "end": 2991.1
    },
    {
        "text": " Sí y solo si T.M.V, producto interno T.M.V con W, acá lo pongo su vín, y para el espacio territorial pues estamos trabajando con el mismo espacio V, de partida llegada.",
        "start": 2991.1,
        "end": 3012.1
    },
    {
        "text": " Recuerden que la Junta se pasa por este lado, esta T le pasa por este lado como test3 ya, o sea esto acá es lo mismo que V y acaba en día test3 aplicado V pero si es igual a T.M.V.",
        "start": 3013.1,
        "end": 3026.1
    },
    {
        "text": " O sea decir que es autoaljuntos, lo mismo que decir que el producto interno T con V con W es lo mismo que el producto interno T con T.M.V.",
        "start": 3027.1,
        "end": 3035.1
    },
    {
        "text": " O sea esta T de acá la puedo pasar por este lado y el producto interno me da lo mismo y esto tiene que valer para todo V y para todo W en el espacio no que estoy trabajando.",
        "start": 3035.1,
        "end": 3045.1
    },
    {
        "text": " Estamos, esta es la propiedad que cumplen las autoaljuntos, la T que está aplicado el primer vector la puedo pasar aplicado el segundo vector y el producto interno me da lo mismo.",
        "start": 3046.1,
        "end": 3059.1
    },
    {
        "text": " Tiene ese que? Sí, sí, sí, sí, sí, obviamente, sí, sí porque la defisión da juntos así, el producto interno de este, pues me podría decir que pasa si yo el espacio partida lo pienso como un producto interno y el espacio se llega como...",
        "start": 3060.1,
        "end": 3083.1
    },
    {
        "text": " Sí, sí, podría pasar pero...",
        "start": 3084.1,
        "end": 3086.1
    },
    {
        "text": " Es un pensamiento un poco retorcido pero sí, podría ser...",
        "start": 3093.1,
        "end": 3097.1
    },
    {
        "text": " No, no, no, no, no, no, acá es el mismo espacio el mismo, porque interno acá y acá es el mismo espacio, el mismo espacio me va a protunter en el protunter.",
        "start": 3097.1,
        "end": 3106.1
    },
    {
        "text": " ¿Se define el mismo espacio interno de la actualidad que se atiface en el producto interno de cinto?",
        "start": 3107.1,
        "end": 3112.1
    },
    {
        "text": " Sí, pero eso no...",
        "start": 3112.1,
        "end": 3114.1
    },
    {
        "text": " Lo puede poner ahí en la definición, digo, lo único que me cambia es que tengo que poner acá un producto interno uno y acá un producto interno dos.",
        "start": 3116.1,
        "end": 3124.1
    },
    {
        "text": " Sí, esto es un único campo.",
        "start": 3125.1,
        "end": 3127.1
    },
    {
        "text": " Bueno, y lo que vamos a ver es lo siguiente, en las próximas clases vamos a ver propiedades interesantes de estos operadores, por lo pronto vamos a comenzar hoy con las basas en silla de todas, que es que tienen que ver con cómo la representación matricial de estos operadores en base fortón normal.",
        "start": 3129.1,
        "end": 3149.1
    },
    {
        "text": " Y ahí un detalle importante como el hecho de conjugar un escalar, si es real no me cambia, si es complejo, un complejo, general, si, la que combine separar los casos reales y complejos y en las próximas clases también vamos a trabajar con el caso real separado el caso complejo y considera los como digo por separados.",
        "start": 3150.1,
        "end": 3175.1
    },
    {
        "text": " Vamos a estudiar por separado el caso K-WALA-R y el caso K-WALA-C.",
        "start": 3175.1,
        "end": 3179.1
    },
    {
        "text": " El caso real y el caso complejo lo separamos. Se acuerdan ustedes que es una matricio y metricar, ¿no?",
        "start": 3206.1,
        "end": 3211.1
    },
    {
        "text": " Una matriz cuadrada, como acá obviamente las matricias o sea un prohabilidad son siempre matricias cuadradas, por el espacio y partida llegadas el mismo, entonces estamos trabajando como matricias cuadradas.",
        "start": 3218.1,
        "end": 3228.1
    },
    {
        "text": " Si yo tengo una matriz A cuadrada N por N, en el cuerpo que sea real o complejo, cuando una matriz es y metrica, cuando la transporta coincide con una.",
        "start": 3228.1,
        "end": 3244.1
    },
    {
        "text": " Entonces, A es una matrici metrica, esto es una definición, si a transporta coincide con una, o sea si es igual a transporta.",
        "start": 3244.1,
        "end": 3254.1
    },
    {
        "text": " Esta es la definición de matrici metrica. Como acá vimos recién que las matricias o sea hay que transponer y tomar el complejo conjugado, comina definir lo que es una matriz cuyo transporto conjugado es igual a las matricias originarias, son las matricias hermíticas.",
        "start": 3255.1,
        "end": 3271.1
    },
    {
        "text": " Entonces, son las matricias hermíticas, tuvimos las matricias hermíticas, A matriz N por N sobre el cuerpo C hacia que sea, es hermítica, enomenada con el matemático hermítica, no hermítica.",
        "start": 3271.1,
        "end": 3294.1
    },
    {
        "text": " Si A es igual, A complejo conjugado transpuesto.",
        "start": 3294.1,
        "end": 3301.1
    },
    {
        "text": " Estamos fíjense que si estamos trabajando, si A es el cuerpo real, la operación de tomar el complejo conjugado no cambia nada, o sea con los reales y metricias y hermíticas la misma cosa.",
        "start": 3301.1,
        "end": 3323.1
    },
    {
        "text": " Con los complejos no, si Métricas que A es igual a transpuesto hermítica que A es igual a la transpuesto conjugado, todas las entradas de A con jugada.",
        "start": 3323.1,
        "end": 3334.1
    },
    {
        "text": " Entonces, cerrando la clase, vamos a escribir un dos resultados sencillos para las autorjuntas separando el caso real del caso complejo.",
        "start": 3334.1,
        "end": 3345.1
    },
    {
        "text": " Vamos a empezar con el cuerpo real.",
        "start": 3353.1,
        "end": 3382.1
    },
    {
        "text": " Entonces, estamos en un espacio vetorial B con productos internos sobre el cuerpo real y tenemos un operador lineal.",
        "start": 3382.1,
        "end": 3399.1
    },
    {
        "text": " Entonces, son equivalentes a las siguientes afirmaciones, que son absolutamente tribianes de probada.",
        "start": 3399.1,
        "end": 3413.1
    },
    {
        "text": " Ya ya la vamos a ver.",
        "start": 3519.1,
        "end": 3542.1
    },
    {
        "text": " Me dice el teorema de este, que en el caso que esté trabajando con el cuerpo real son equivalentes a las siguientes afirmaciones.",
        "start": 3543.1,
        "end": 3552.1
    },
    {
        "text": " T es un operador autoarjunto, es lo mismo que decir que para toda base autorormal del espacio en el que estoy trabajando, la representación, la matria sociedad T en esa base es simétrica.",
        "start": 3552.1,
        "end": 3564.1
    },
    {
        "text": " Y la tercera afirmación me dice que existe una base autorormal para acuar esta matria simétrica. Así se escriben varias de las propósiones que ustedes han visto en cálculo 1, en cálculo 1, alguna vez se recuerda.",
        "start": 3565.1,
        "end": 3579.1
    },
    {
        "text": " Algo que vale para todo, después de un caso particular, algo que vale en este caso particular, que termina de cerrar el ciclo.",
        "start": 3579.1,
        "end": 3587.1
    },
    {
        "text": " Fíjense, esto es absolutamente tribial de probar. Vamos a probar que esta implica ésta, esta implica ésta y esto termina cerrar el ciclo por acá arriba.",
        "start": 3588.1,
        "end": 3599.1
    },
    {
        "text": " Entonces, 1 implicado 2, tengo, estoy suponiendo que esté autoarjunto, esto es considerado una base autorormal cualquiera debe.",
        "start": 3599.1,
        "end": 3610.1
    },
    {
        "text": " Entonces tengo una base autorormal cualquiera, del espacio vectorial y como esté autoarjunto,",
        "start": 3610.1,
        "end": 3618.1
    },
    {
        "text": " entonces tengo que si represento, bueno tengo esto obviamente, como testrella igual a T, solo lo que estoy suponiendo, la representación matrizia de T estrell en la base bb es lo mismo que la representación matrizial de T en la base bb.",
        "start": 3619.1,
        "end": 3639.1
    },
    {
        "text": " Nada nuevo, estoy diciendo que testrella igual a T, entonces se cumple eso.",
        "start": 3640.1,
        "end": 3644.1
    },
    {
        "text": " Y además, usemos el resultado que acabamos probando hace un ratito que me decía que si yo veo testrella usando base autorormales,",
        "start": 3644.1,
        "end": 3657.1
    },
    {
        "text": " entonces eso es lo mismo que la matriz asociada a la transformación original T, transpuesto conjugado.",
        "start": 3658.1,
        "end": 3674.1
    },
    {
        "text": " Ahora como acá estamos trabajando en el cuerpo real, el efecto transponiano tiene ningún efecto o sea que esto lo mismo que...",
        "start": 3675.1,
        "end": 3686.1
    },
    {
        "text": " Perdón, si, yo estoy en mareao. Como estamos trabajando con los complejos con jugar, no tiene ningún efecto.",
        "start": 3688.1,
        "end": 3694.1
    },
    {
        "text": " Entonces esta barrita acá la puedo sacar y me queda el transpuesto. Esto estamos trabajando en el cuerpo real.",
        "start": 3694.1,
        "end": 3703.1
    },
    {
        "text": " Entonces observen, testrella por un lado, si igual a esto esta matriz asociada testrella es igual a esta por otro lado,",
        "start": 3706.1,
        "end": 3713.1
    },
    {
        "text": " en consecuencia esta y esta son la misma matriz. Entonces esto me implica que la matriz asociate en la base b es la misma que la matriz asociada a T en la base b, transpuesta.",
        "start": 3714.1,
        "end": 3729.1
    },
    {
        "text": " Esto tiene siriva para esto.",
        "start": 3730.1,
        "end": 3732.1
    },
    {
        "text": " Entonces, estoy diciendo que yo transpongo esta matriz y me da la misma matriz o estoy diciendo que la matriz es simétrica.",
        "start": 3732.1,
        "end": 3739.1
    },
    {
        "text": " La matriz asociada a T es simétrica.",
        "start": 3739.1,
        "end": 3742.1
    },
    {
        "text": " Estamos.",
        "start": 3749.1,
        "end": 3750.1
    },
    {
        "text": " Entonces para cualquier base autorormal se cumple que esta matriz asociada T en esa base es simétrica.",
        "start": 3753.1,
        "end": 3758.1
    },
    {
        "text": " Eso es una forma fácil de reconocer cuando uno operado es autoadjunto. Adar una base autorormal veo que es simétrica y la reposadación entonces es autoadjunto.",
        "start": 3758.1,
        "end": 3765.1
    },
    {
        "text": " En el cuerpo real ¿no? Ojo.",
        "start": 3766.1,
        "end": 3770.1
    },
    {
        "text": " Esta implica esta es trivial porque esta es un caso particular y para toda vez se cumple esta entonces existe una vez para el cual se cumple esta.",
        "start": 3770.1,
        "end": 3778.1
    },
    {
        "text": " O sea 2 implica 3 es trivial, es obvio.",
        "start": 3778.1,
        "end": 3783.1
    },
    {
        "text": " Y cerramos el ciclo probando que 3 implica 1.",
        "start": 3786.1,
        "end": 3789.1
    },
    {
        "text": " Que es una línea también.",
        "start": 3790.1,
        "end": 3794.1
    },
    {
        "text": " Entonces suponemos que existe una base autorormal para la cual T es simétrica.",
        "start": 3794.1,
        "end": 3799.1
    },
    {
        "text": " O sea estamos suponiendo que existe b 0 para la cual la matriz asociada T en la base b 0 es simétrica, una base autorormal ¿no?",
        "start": 3799.1,
        "end": 3811.1
    },
    {
        "text": " Estamos suponiendo esto.",
        "start": 3814.1,
        "end": 3816.1
    },
    {
        "text": " Esta es simétrica. Que si es simétrica quiere decir que si yo transpongo obviamente me da la misma matriz.",
        "start": 3820.1,
        "end": 3831.1
    },
    {
        "text": " Y además usemos este resultado que usamos racían. Además...",
        "start": 3842.1,
        "end": 3847.1
    },
    {
        "text": " La matriz asociada T3 ya en la base b 0 es la asociada T transpuesto y conjugado.",
        "start": 3850.1,
        "end": 3861.1
    },
    {
        "text": " Ya me corro.",
        "start": 3868.1,
        "end": 3872.1
    },
    {
        "text": " Y como estamos trabajando con el cuerpo real y el conjugado no tiene ningún efecto.",
        "start": 3873.1,
        "end": 3879.1
    },
    {
        "text": " Estamos. Entonces ¿qué concluimos de todo esto? Concluimos que...",
        "start": 3893.1,
        "end": 3899.1
    },
    {
        "text": " Por si me trian así completo, además por la representación que vimos racían.",
        "start": 3900.1,
        "end": 3904.1
    },
    {
        "text": " La T3 ya es la T compleja conjugada con transpuesta, el complejo conjugado me da lo mismo que no pone los puestos con los reales.",
        "start": 3904.1,
        "end": 3911.1
    },
    {
        "text": " Entonces tengo que esto de este lado, quien se igual a esto por un lado y a esto por otro.",
        "start": 3911.1,
        "end": 3915.1
    },
    {
        "text": " O sea que esta parte y esta son las mismas. O sea que tengo que T3 ya...",
        "start": 3915.1,
        "end": 3922.1
    },
    {
        "text": " En la base b 0 es lo mismo que... Perdón, ¿qué es esto acá?",
        "start": 3923.1,
        "end": 3929.1
    },
    {
        "text": " ¿Qué es T3 en la base b 0? Esto es igual a esto por lo tanto esta parte y esta son las mismas.",
        "start": 3929.1,
        "end": 3940.1
    },
    {
        "text": " Entonces tengo una base en la cual la matriz asociada T3 ya y la asociada T son las mismas.",
        "start": 3940.1,
        "end": 3947.1
    },
    {
        "text": " Por lo tanto los operadores tienen que ser los mismos. Entonces T3 ya tiene que ser igual a T.",
        "start": 3948.1,
        "end": 3954.1
    },
    {
        "text": " O sea que T es autoadjunto.",
        "start": 3954.1,
        "end": 3957.1
    },
    {
        "text": " Sí, si yo tengo una base cualquiera y la matriz asociada a un operador me da la misma que la matriz asociada a otro operador en la misma base,",
        "start": 3960.1,
        "end": 3968.1
    },
    {
        "text": " entonces necesariamente este operador y este tiene que ser lo mismo. O sea T3 ya es igual a T por lo tanto T autoadjunto.",
        "start": 3968.1,
        "end": 3974.1
    },
    {
        "text": " O sea que esto termina de cerrar el sitio.",
        "start": 3975.1,
        "end": 3977.1
    },
    {
        "text": " ¿Qué cambia si uno trabaja con el cuerpo complejo?",
        "start": 3980.1,
        "end": 3983.1
    },
    {
        "text": " Yo puedo hacer el mismo resultado, sólo que acá no puedo conjugar ya no es algo inocuo.",
        "start": 3983.1,
        "end": 3992.1
    },
    {
        "text": " Entonces que para ahí entonces acá me va a aparecer el complejo conjugado y acá me va a aparecer también el complejo conjugado.",
        "start": 3992.1,
        "end": 4000.1
    },
    {
        "text": " La conclusión cuál es exactamente.",
        "start": 4001.1,
        "end": 4005.1
    },
    {
        "text": " Entonces si veo un espacio que te voy a comprocutir en términos sobre el cuerpo complejo, vamos a ahorrar marcador.",
        "start": 4005.1,
        "end": 4012.1
    },
    {
        "text": " Son equivalentes. Uno, T autoadjunto, V2 para todo va a ser total normal. Esto es hermítica.",
        "start": 4015.1,
        "end": 4023.1
    },
    {
        "text": " Y existe una base autónoma para que la cual esto es hermítica. Y la demostración es exactamente la misma.",
        "start": 4023.1,
        "end": 4035.1
    },
    {
        "text": " No la vamos a repletir. La misma pero parando acá.",
        "start": 4035.1,
        "end": 4042.1
    },
    {
        "text": " Estamos, se lo dejo que revisé, te dan eso como jarrillo.",
        "start": 4045.1,
        "end": 4048.1
    },
    {
        "text": " Entonces es muy fácil verificar cuando uno para el niño es autoadjunto.",
        "start": 4048.1,
        "end": 4053.1
    },
    {
        "text": " Todo lo que hay que hacer es grabar una base autónoma, ver su representación matricial y ver si es simétrico.",
        "start": 4053.1,
        "end": 4060.1
    },
    {
        "text": " O armitico de opinionos reales o en los complejos.",
        "start": 4060.1,
        "end": 4066.1
    }
]