[
    {
        "text": " Bueno, ahora sí vamos a continuar un poco con lo venemos hablando del sobre los temas",
        "start": 0.0,
        "end": 8.120000000000001
    },
    {
        "text": " del brinco para grafos. Lo que hemos visto la clase pasada fue un ejemplo, un ejercicio,",
        "start": 8.120000000000001,
        "end": 17.0
    },
    {
        "text": " aún no había una de también la realidad y lo que hicimos fue modilarla como un grajo.",
        "start": 17.0,
        "end": 21.76
    },
    {
        "text": " De manera que ese grajo nos ayudara a resolver el problema en cuestión,",
        "start": 21.76,
        "end": 28.040000000000003
    },
    {
        "text": " nuestro modelo, nuestro problema original era encontrar componentes con exas dentro",
        "start": 28.040000000000003,
        "end": 34.760000000000005
    },
    {
        "text": " del cegrajo y bueno, y eso sabíamos cómo resolverlo y habíamos visto, bueno,",
        "start": 34.760000000000005,
        "end": 39.2
    },
    {
        "text": " un poco el diseño del brismo y después análisis de salud mismo, la corrección que en este caso era",
        "start": 39.2,
        "end": 46.08
    },
    {
        "text": " bastante inmediata, escribimos qué es lo que habría de casar como para dejarlo asentado,",
        "start": 46.08,
        "end": 53.879999999999995
    },
    {
        "text": " pero era bastante directo y analizamos el tiempo de ejecuyo, en ese sentido un lindo ejemplo,",
        "start": 53.879999999999995,
        "end": 61.32
    },
    {
        "text": " porque vimos que discriminar el tiempo de ejecuyo nos servimos de grafos en la componente de",
        "start": 61.32,
        "end": 69.06
    },
    {
        "text": " cantidad de artis y cantidad de aristas, bueno, en esta situación era útil porque la cantidad de",
        "start": 69.06,
        "end": 75.28
    },
    {
        "text": " aristas en este caso estaba el hijo de Serderon del Fuera. Lo que están viendo acá es uno de los",
        "start": 75.28,
        "end": 86.72
    },
    {
        "text": " ejercicios resueltos del libro y tiene una encara de similar en el sentido de que hay un modelo",
        "start": 86.72,
        "end": 96.32
    },
    {
        "text": " que en este caso, hay un problema que en este caso deriva en un modelo más complejo que",
        "start": 96.32,
        "end": 102.76
    },
    {
        "text": " debimos recién y hace todo un análisis como resolver ese problema construciendo grafos en el",
        "start": 102.76,
        "end": 113.12
    },
    {
        "text": " medio y ejecutando algoritmos de los que conocemos en el medio para final terminar con una solución",
        "start": 113.12,
        "end": 118.64
    },
    {
        "text": " para un problema que no es nada sencillo a priori y acá de vuelta, yo les marqué acá para",
        "start": 118.64,
        "end": 127.12
    },
    {
        "text": " resaltar de vuelta lo que trataba de transmitir el lucrodía, bueno, está la descripción del algoritmo y la",
        "start": 127.12,
        "end": 135.20000000000002
    },
    {
        "text": " corrección en este caso lo ven, no se deriva del hecho de que las trajectores y en el cepino van a",
        "start": 135.20000000000002,
        "end": 139.48000000000002
    },
    {
        "text": " que tienen que ver con la formulación del problema concreto, corresponde en la programación",
        "start": 139.48000000000002,
        "end": 144.48000000000002
    },
    {
        "text": " de cíperes, en definitiva lo que está diciendo acá es la corrección, tiene que ver con que modelamos",
        "start": 144.48000000000002,
        "end": 149.76
    },
    {
        "text": " bien, en este caso me está como un punto aparte de corrección y la demostración concreto eso",
        "start": 150.48,
        "end": 156.28
    },
    {
        "text": " está como entre mezclado con la descripción del problema por acá pero van a ver que eso es lo que está",
        "start": 156.28,
        "end": 161.76
    },
    {
        "text": " lo que está diciendo, acá podemos observar que las trajectores corresponden a las programaciones",
        "start": 164.64,
        "end": 170.23999999999998
    },
    {
        "text": " etcétera, la explicación de por qué al final está correcto, está mezclado mientras explica cómo",
        "start": 170.23999999999998,
        "end": 176.04
    },
    {
        "text": " está haciendo el algoritmo, justamente puede bueno el objetivo del texto en este caso,",
        "start": 176.6,
        "end": 186.92
    },
    {
        "text": " bueno, es ir contando cómo razonar sobre este problema concreto y no tanto separar bueno,",
        "start": 186.92,
        "end": 192.04
    },
    {
        "text": " la demostración de corrección, esta la sananal y sin corrección, existirse de anal y sin el",
        "start": 192.04,
        "end": 196.56
    },
    {
        "text": " tiempo de refugción, el anal y sin el tiempo de refugción también es bastante más sofisticado de lo",
        "start": 196.56,
        "end": 200.95999999999998
    },
    {
        "text": " que del ejemplo que vimos nosotros, eso es un ejemplo que está es bastante más difícil, más",
        "start": 200.96,
        "end": 207.84
    },
    {
        "text": " complejo está bueno, entrar y mirarlo y entender bien qué lo está haciendo ahí,",
        "start": 207.84,
        "end": 215.52
    },
    {
        "text": " o en eso el margen simplemente para porque en gancho directamente con lo que estuvimos viendo en la",
        "start": 220.4,
        "end": 226.8
    },
    {
        "text": " clase el otro día que tenía que ver justamente con componentes con ex así corregas del BFES etcétera y",
        "start": 226.8,
        "end": 236.04000000000002
    },
    {
        "text": " antes de metarnos un poco en otro tema que es este el de grafos así que los dirigidos,",
        "start": 236.04000000000002,
        "end": 244.16000000000003
    },
    {
        "text": " esto es una sección antes de esto que tiene que ver con grafos dirigidos, grafos dirigidos",
        "start": 244.16000000000003,
        "end": 252.0
    },
    {
        "text": " con parentes fortemente con exas en esos grafos dirigidos, como como como son estas",
        "start": 252.0,
        "end": 265.12
    },
    {
        "text": " estas recorridas BFES y FES etcétera en este caso, eso creo que es bastante directo,",
        "start": 265.12,
        "end": 271.92
    },
    {
        "text": " no no pensaba atacarlo ahora pero que si alguno de ustedes mientras le le sole surgió",
        "start": 274.32,
        "end": 281.56
    },
    {
        "text": " una duda y la quiere traer este, la contesto como gusto pero me parece, o sea los alo-bimos son",
        "start": 281.56,
        "end": 290.32
    },
    {
        "text": " esencialmente los mismos, no cambia mucho el análisis del tiempo de ejecución,",
        "start": 290.32,
        "end": 294.76
    },
    {
        "text": " también, las propiedades de árboles de recorridas eso sí, no tienen por qué, por ejemplo,",
        "start": 294.76,
        "end": 306.32
    },
    {
        "text": " las propiedades que vimos BFES, la relación entre ansétwis y de sentientes, eso en cada caso de grafos",
        "start": 306.32,
        "end": 311.2
    },
    {
        "text": " dirigidos no se tiene por qué cumplir pero desde el punto de vista logrínico es más o menos",
        "start": 311.2,
        "end": 317.4
    },
    {
        "text": " todo igual, una diferencia importante es que las componentes fortemente encontrar en conjunto",
        "start": 317.4,
        "end": 323.64
    },
    {
        "text": " fortemente con exas no se resuelve tan fácilmente como en caso de no tan eficientemente por lo menos",
        "start": 323.64,
        "end": 333.88
    },
    {
        "text": " de forma sencilla como el caso de grafos no dirigidos pero eso no es algo como se estudiar,",
        "start": 333.88,
        "end": 343.4
    },
    {
        "text": " no hay ningún deficiente para hacer eso, así como creo que toda esa sección la pueden",
        "start": 343.4,
        "end": 350.92
    },
    {
        "text": " digerir bastante bien de forma directa pero si hay alguna duda o hay que estuve leciendo y",
        "start": 350.92,
        "end": 360.6
    },
    {
        "text": " le que una dome me puede preguntar ahora, sino la siguiente tema en el libro es el de grafos",
        "start": 360.6,
        "end": 374.56
    },
    {
        "text": " dirigidos así clicos y la relación con los órden topológicos a los dértices de grafos,",
        "start": 374.56,
        "end": 385.76000000000005
    },
    {
        "text": " son dos temas bien relacionados entre sí, los grafos dirigidos así que son un caso particular",
        "start": 385.76,
        "end": 392.08
    },
    {
        "text": " de grafos dirigidos bien interesantes por sí mismos que tiene la particularidad que no tienen cíclas,",
        "start": 392.08,
        "end": 398.32
    },
    {
        "text": " en el caso de grafos no dirigidos con el hecho de no tener cíclas las hace con muy sencillos,",
        "start": 399.84,
        "end": 405.4
    },
    {
        "text": " cada componente van a ser un árbol, en el caso de los grafos dirigidos como algunos escumptus van",
        "start": 405.4,
        "end": 413.2
    },
    {
        "text": " a ver acá la cosa bastante más rica, cada vez grafos que no tienen cíclas y dirigidos que",
        "start": 413.2,
        "end": 421.84
    },
    {
        "text": " no tienen cíclas y que tienen bastante más estructura que lo que podría pasar en grafos",
        "start": 421.84,
        "end": 428.68
    },
    {
        "text": " no dirigidos, este tipo de grafos son interesantes en particular por el modelo naturalmente un montón",
        "start": 428.68,
        "end": 438.59999999999997
    },
    {
        "text": " de situaciones que aparecen de dependencias entre cosas, por ejemplo entre el ejemplo que",
        "start": 438.6,
        "end": 445.64000000000004
    },
    {
        "text": " pueden libros entre tareas, si quiere hacer esta tarea o el proyecto, bueno antes tenemos que",
        "start": 445.64000000000004,
        "end": 450.56
    },
    {
        "text": " barrasos nosotros y eso lo puede relacionar con bueno aristas dirigidos que me dicen quién depende",
        "start": 450.56,
        "end": 455.64000000000004
    },
    {
        "text": " de quién y una pregunta que uno naturalmente se hace en ese tipo de situaciones, si este grafos",
        "start": 455.64000000000004,
        "end": 465.64000000000004
    },
    {
        "text": " representa esos dependencias entre tareas, bueno como puede ordenar las tareas como está puesto acá",
        "start": 465.64,
        "end": 475.56
    },
    {
        "text": " de manera que cuando voy a hacer cada una de ellas las todas las dependencias ya están satisfechos",
        "start": 475.56,
        "end": 486.12
    },
    {
        "text": " tipo de situaciones que aparece por ejemplo en una planilla de cálculo cuando ustedes ponen en",
        "start": 486.12,
        "end": 491.76
    },
    {
        "text": " acelda una cierta fórmula para calcularla, bueno para obtener el valor de esa acelda necesito",
        "start": 491.76,
        "end": 499.44
    },
    {
        "text": " todas las aceldas de las cuales depende su fórmula esas a su vez pueden depender de otras",
        "start": 499.44,
        "end": 510.24
    },
    {
        "text": " aceldas más entonces se va atrejiendo todo un entramado de dependencias y bueno la planilla de",
        "start": 510.24,
        "end": 519.24
    },
    {
        "text": " cálculo para poder mostrar el resultado de todas las aceldas tiene que evaluar todas esas fórmulas",
        "start": 519.24,
        "end": 523.32
    },
    {
        "text": " en algún orden y ese es el tipo de problemas que vamos a estudiar es en orden que efectivamente respetas",
        "start": 523.32,
        "end": 531.92
    },
    {
        "text": " dependencias y vamos a más orden topológico, un ordenamiento simpológico, entonces esa es la",
        "start": 531.92,
        "end": 542.12
    },
    {
        "text": " situación, esa es el problema, entonces formalmente el ordenamiento topológico de un gráfico",
        "start": 542.12,
        "end": 548.68
    },
    {
        "text": " de un gráfico es simplemente ordenar sus nodos, asignarles un índice a cada uno, vos a vésu uno,",
        "start": 548.68,
        "end": 556.44
    },
    {
        "text": " vos a vésu dos, vos a vésu tres hasta vésu n los pongo en un orden en particular y lo que quiero",
        "start": 556.44,
        "end": 563.44
    },
    {
        "text": " que pase es que cada aristarista vésu y vésu jota está como peinada hacia adelante, es decir que va",
        "start": 563.44,
        "end": 569.24
    },
    {
        "text": " desde un índice vésu y más chico a un índice vésu jota más grande, las aristas son dirigidas,",
        "start": 569.24,
        "end": 577.76
    },
    {
        "text": " todas las aristas que han como apuntando hacia adelante, como en el ejemplo este que ha habido",
        "start": 577.76,
        "end": 584.72
    },
    {
        "text": " en costota, entonces esa es la situación, ahí van a ver que la relación entre grazos que tiene",
        "start": 584.72,
        "end": 596.92
    },
    {
        "text": " un ordenamiento topológico para los cuales pocos tuvimos un orden topológico y grazos dirigidos a",
        "start": 596.92,
        "end": 601.12
    },
    {
        "text": " sítricos, bueno de hecho son las mismas cosas, es una algo que uno usaró inmediatamente que",
        "start": 601.12,
        "end": 606.16
    },
    {
        "text": " si tiene un orden topológico, entonces es un bag, es un grafo dirigido, así que lo estoy",
        "start": 606.16,
        "end": 615.92
    },
    {
        "text": " mostrando, como todas las aristas van hacia adelante, nunca puedo volver hacia atrás como para formar un",
        "start": 617.92,
        "end": 622.68
    },
    {
        "text": " sí, sí que eso es bastante bastante claro, acaban a ver la idea intuitiva, ese es el que",
        "start": 622.68,
        "end": 639.8
    },
    {
        "text": " les comentaba recién acaban de encontrar la demostración que estaba asado justamente en ese",
        "start": 639.8,
        "end": 647.68
    },
    {
        "text": " y a ver capaz que conviene formalmente como forma porque la idea intuitiva creo que uno la",
        "start": 648.2399999999999,
        "end": 659.04
    },
    {
        "text": " abre bastante rápido, bueno cuál es la idea para formalizar esto, lo que dice bueno si tengo",
        "start": 659.04,
        "end": 666.0
    },
    {
        "text": " un ordenamiento topológico",
        "start": 666.56,
        "end": 668.52
    },
    {
        "text": " y su uno de sus dos",
        "start": 677.16,
        "end": 678.72
    },
    {
        "text": " más 3 y 4 hasta bien, bueno si supongamos que hubiera un ciclo, bueno entonces ese ciclo",
        "start": 678.72,
        "end": 699.6
    },
    {
        "text": " tiene que pasar por alguno de estos vértices, y bueno cuando vuelve, digamos agaremos de esos",
        "start": 699.6,
        "end": 710.36
    },
    {
        "text": " vértices, dice el de índice más chico, en este ejemplo que puse acá es el v3, ¿está de cuál",
        "start": 710.36,
        "end": 715.08
    },
    {
        "text": " es la gracia agarrabe el más chico y bueno así bueno si esto es un ciclo, los nodos que",
        "start": 715.08,
        "end": 719.2
    },
    {
        "text": " que pienten a su raíz, algunas malas están encadenados entre eso formar de un ciclo, alguno",
        "start": 719.2,
        "end": 723.6
    },
    {
        "text": " tiene que llevarme a v3 en ese ciclo y como v3 es el índice más chico, entonces esa vista va",
        "start": 723.6,
        "end": 730.36
    },
    {
        "text": " para atrás, entonces llega una contradicción con el hecho de que esto era un orden topológico,",
        "start": 730.36,
        "end": 735.0
    },
    {
        "text": " la formalización tampoco es muy muy completa, le dejo bastante directo y se formaliza bastante fácil.",
        "start": 735.0,
        "end": 742.6800000000001
    },
    {
        "text": " Hola, ahora yo quería hacer un comentario que si vos tus abiernos los representar",
        "start": 744.32,
        "end": 753.5600000000001
    },
    {
        "text": " como grafos, los pasos y tu grafos resultantes un DAG, ¿puedes asegurarte que no se te acuéles?",
        "start": 753.56,
        "end": 761.56
    },
    {
        "text": " Si vos refiero a ver el grafo que lo representa a las salistas, ojalá vos tenés pasos en tu algoritmo.",
        "start": 764.92,
        "end": 770.9599999999999
    },
    {
        "text": " Ahí va y ellos pueden evaluar condiciones para ver si pasa tan cosa, voy a tal otro paso,",
        "start": 771.5999999999999,
        "end": 780.4399999999999
    },
    {
        "text": " sino a tal otro y si cada paso eso es suficientemente básico nos te va a cubrir.",
        "start": 780.44,
        "end": 788.84
    },
    {
        "text": " Si lo que te queda es un DAG, si, en cuanto es de engas un loop, eso ya no te va a quedar un DAG.",
        "start": 788.84,
        "end": 796.12
    },
    {
        "text": " Claro, como aplicación, decir eso.",
        "start": 796.12,
        "end": 798.5600000000001
    },
    {
        "text": " Es un ejemplo.",
        "start": 798.56,
        "end": 801.0799999999999
    },
    {
        "text": " Otro ejemplo puede ser el de los, por ejemplo los MAKE Files.",
        "start": 802.5999999999999,
        "end": 807.92
    },
    {
        "text": " Cuando queda un MAKE Files para compilar un proyecto que te hace más más, por ejemplo,",
        "start": 810.3199999999999,
        "end": 819.56
    },
    {
        "text": " lo que dicen ahí es bueno, ¿qué archivos depende de quién?",
        "start": 819.56,
        "end": 825.5999999999999
    },
    {
        "text": " O sea, ¿cuál estén compilar antes de quién para armar el ejecutable de final?",
        "start": 825.5999999999999,
        "end": 831.3199999999999
    },
    {
        "text": " Lo que tiene ahí es un grafo de dependencias y que necesariamente tiene que ser un DAG",
        "start": 831.3199999999999,
        "end": 840.8
    },
    {
        "text": " para que lo pueda resolver.",
        "start": 840.8,
        "end": 844.52
    },
    {
        "text": " Y va, bien, MAKE, claramente a MAKE lo que tiene que hacer es construir un ordenamiento topológico.",
        "start": 845.0799999999999,
        "end": 850.64
    },
    {
        "text": " Es otro ejemplo.",
        "start": 850.64,
        "end": 852.88
    },
    {
        "text": " Y ejemplos van a aparecer cantidad muy naturales.",
        "start": 852.88,
        "end": 855.4399999999999
    },
    {
        "text": " Ahí por eso está bien estudiado también.",
        "start": 856.4399999999999,
        "end": 858.4
    },
    {
        "text": " Y que estaba en el comentario, alguno más, algo más, ¿qué hicimos una pausa?",
        "start": 860.8,
        "end": 865.4
    },
    {
        "text": " Entonces, la pregunta que sí, que no está novia de responder, es si todos los DAG,",
        "start": 874.52,
        "end": 884.12
    },
    {
        "text": " o sea, todos los grafos que no tienen siglos dirigidos, entonces, tienen un ordenamiento topológico.",
        "start": 884.12,
        "end": 893.64
    },
    {
        "text": " De un orden topológico así, puede construir un ordenamiento topológico.",
        "start": 893.64,
        "end": 897.96
    },
    {
        "text": " Y, por supuesto, en este curso no se interesa si existe, sino también encontrarlo.",
        "start": 898.84,
        "end": 907.52
    },
    {
        "text": " Y en realidad vamos a responder lo que sea lo que va a dar que le entienden libres,",
        "start": 907.52,
        "end": 912.6800000000001
    },
    {
        "text": " responder las dos cosas simultáneas, vamos a responder que, de hecho, sí, todos los DAG,",
        "start": 912.6800000000001,
        "end": 919.0
    },
    {
        "text": " tienen un orden topológico, dando un algoritmo que lo que les cuentran.",
        "start": 919.0,
        "end": 923.6
    },
    {
        "text": " Entonces, eso es lo que se van a encontrar acá.",
        "start": 924.24,
        "end": 927.48
    },
    {
        "text": " El punto clave, el punto clave para razonar sobre este problema y encontrar el gorismo,",
        "start": 931.16,
        "end": 939.44
    },
    {
        "text": " es observar que en todo DAG, eso siempre me puede encontrar un punto de partida",
        "start": 939.44,
        "end": 947.36
    },
    {
        "text": " para empezar a desanregar la maraña, para empezar a ejecutar tareas en esta metáfora",
        "start": 947.36,
        "end": 953.88
    },
    {
        "text": " de las dependencias de tareas en el orden apropiado.",
        "start": 953.88,
        "end": 957.96
    },
    {
        "text": " Porque siempre va a haber un nodo V que no tiene alista central, que salen que no depende de nadie.",
        "start": 957.96,
        "end": 964.96
    },
    {
        "text": " Entonces, lo que está diciendo esto es si el grafo no tiene sitio, entonces hay alguien,",
        "start": 964.96,
        "end": 972.2
    },
    {
        "text": " hay un nodo que no depende de la DAG, no tiene alista central.",
        "start": 972.2,
        "end": 977.2
    },
    {
        "text": " Y yo acá marque...",
        "start": 977.2,
        "end": 979.2
    },
    {
        "text": " Esta demostración les marque muy interesante, porque acá se usa una estrategia para demostrar",
        "start": 985.2,
        "end": 992.5600000000001
    },
    {
        "text": " una implicancia que se te mostrán el contraresípro, que a veces no lo tienen del todo presente,",
        "start": 992.5600000000001,
        "end": 997.72
    },
    {
        "text": " y me parece que es algo que está bueno que lo tengan.",
        "start": 997.72,
        "end": 1000.72
    },
    {
        "text": " Como una estrategia, lo que queremos demostrar acá es que si un grafo dirigido no tiene ciclos,",
        "start": 1000.72,
        "end": 1008.72
    },
    {
        "text": " entonces hay un V que no tiene alista central.",
        "start": 1008.72,
        "end": 1011.12
    },
    {
        "text": " Y lo que vamos a hacer es negar la T, y si ver que se implica la negación de las importeces.",
        "start": 1011.12,
        "end": 1017.12
    },
    {
        "text": " Entonces, lo que dice es, se ajé un grafo dirigido en el que todo nodo tiene al menos una distentra.",
        "start": 1017.12,
        "end": 1024.1200000000001
    },
    {
        "text": " Eso es la negación de las tres.",
        "start": 1024.12,
        "end": 1027.12
    },
    {
        "text": " O sea, hay un nodo V sin alistas entrantes.",
        "start": 1027.12,
        "end": 1031.12
    },
    {
        "text": " La negación de eso es que todo nodo V tiene al menos una distentra.",
        "start": 1031.12,
        "end": 1036.12
    },
    {
        "text": " A sus mil de esos botes, vamos a demostrar que se cumple la negación de las hipótesis,",
        "start": 1036.12,
        "end": 1042.12
    },
    {
        "text": " es decir, mostraremos que en G, necesariamente hay un ciclo.",
        "start": 1042.12,
        "end": 1047.12
    },
    {
        "text": " Eso lo traje porque es una de vuelta a una estrategia de demostración útil,",
        "start": 1048.12,
        "end": 1055.12
    },
    {
        "text": " y que no siempre la tenemos como tan en la mira.",
        "start": 1055.12,
        "end": 1059.12
    },
    {
        "text": " En este caso, la demostración es bastante sencilla.",
        "start": 1063.12,
        "end": 1069.12
    },
    {
        "text": " Una vez que asumimos que todo nodo tiene al menos una lista entrante,",
        "start": 1069.12,
        "end": 1073.12
    },
    {
        "text": " si voy a sacar un nodo, y voy, si voy a salir con un sentido revarso,",
        "start": 1074.12,
        "end": 1078.12
    },
    {
        "text": " tiene alguna lista entrante, voy para atrás por esa lista.",
        "start": 1078.12,
        "end": 1081.12
    },
    {
        "text": " Y voy a ir a parar un nodo que también tiene una lista entrante y la puedo salir hacia atrás.",
        "start": 1081.12,
        "end": 1085.12
    },
    {
        "text": " Y voy a ir a parar un nodo que también tiene una lista entrante y puedo ir hacia atrás.",
        "start": 1085.12,
        "end": 1088.12
    },
    {
        "text": " Y así voy, y ese proceso puedo seguirlo por siempre.",
        "start": 1088.12,
        "end": 1093.12
    },
    {
        "text": " Pero la cantidad de, lo puedo seguir por ejemplo, por todos los V, se tiene una lista entrante.",
        "start": 1093.12,
        "end": 1098.12
    },
    {
        "text": " Pero la cantidad de bárbites se finita, así que necesariamente el momento respito algo,",
        "start": 1099.12,
        "end": 1102.12
    },
    {
        "text": " y en ese momento lo quise fue encontrar un ciclo.",
        "start": 1102.12,
        "end": 1105.12
    },
    {
        "text": " Este es el argumento para la demostración.",
        "start": 1105.12,
        "end": 1109.12
    },
    {
        "text": " Prof. Buena consulta.",
        "start": 1109.12,
        "end": 1111.12
    },
    {
        "text": " ¿Qué hay?",
        "start": 1111.12,
        "end": 1113.12
    },
    {
        "text": " Hay que ver que las salistas son salientes.",
        "start": 1113.12,
        "end": 1116.12
    },
    {
        "text": " El mismo razonamiento funcionaría si las salistas son entrantes.",
        "start": 1116.12,
        "end": 1120.12
    },
    {
        "text": " O sea, podría decir que en un nodo hay, o lo menos uno,",
        "start": 1120.12,
        "end": 1125.12
    },
    {
        "text": " que no tiene ninguna lista entrante.",
        "start": 1125.12,
        "end": 1128.12
    },
    {
        "text": " Ninguna lista saliente, ¿sí?",
        "start": 1128.12,
        "end": 1131.12
    },
    {
        "text": " Sí, perdón.",
        "start": 1131.12,
        "end": 1133.12
    },
    {
        "text": " O sea, hay una lista entrante, me confundí.",
        "start": 1133.12,
        "end": 1137.12
    },
    {
        "text": " O sea, el revés de lo que dice acá, sí, eso también es cierto.",
        "start": 1137.12,
        "end": 1141.12
    },
    {
        "text": " Porque en ese grafo de dependencias tiene que haber alguna hoja.",
        "start": 1141.12,
        "end": 1150.12
    },
    {
        "text": " Y el razonamiento podría ser igual, bueno, si todos tienen una lista saliente,",
        "start": 1151.12,
        "end": 1156.12
    },
    {
        "text": " entonces hago este mismo proceso de disfuerzo, voy para adelante, voy para adelante,",
        "start": 1156.12,
        "end": 1161.12
    },
    {
        "text": " voy para adelante, voy para adelante, y en algún momento repito.",
        "start": 1161.12,
        "end": 1164.12
    },
    {
        "text": " Y en ese momento con su ciclo.",
        "start": 1164.12,
        "end": 1167.12
    },
    {
        "text": " O sea, no tiene nada de especial, digamos, que sea una lista entrante para este caso.",
        "start": 1167.12,
        "end": 1172.12
    },
    {
        "text": " Lo ponía, se ha armado el ciclo con una saliente también.",
        "start": 1172.12,
        "end": 1175.12
    },
    {
        "text": " También.",
        "start": 1175.12,
        "end": 1177.12
    },
    {
        "text": " Lo que tiene por el aburro es que es igual, por qué entonces me complicas",
        "start": 1178.12,
        "end": 1186.12
    },
    {
        "text": " con recorrendo la lista al revés, las razones que en realidad esto nos sirve",
        "start": 1186.12,
        "end": 1191.12
    },
    {
        "text": " para ir directamente a un algoritmo, o sea, esta propiedad,",
        "start": 1191.12,
        "end": 1194.12
    },
    {
        "text": " que acabamos de mostrar, nos sirve para como herramienta básica, como paso básico",
        "start": 1194.12,
        "end": 1201.12
    },
    {
        "text": " en algoritmo, que es el algoritmo de Can, que acá no le pone nombre en libro,",
        "start": 1201.12,
        "end": 1205.12
    },
    {
        "text": " pues es la básica, HN, que es el que construye en ordenamiento topolucido",
        "start": 1205.12,
        "end": 1214.12
    },
    {
        "text": " usando esta propiedad.",
        "start": 1214.12,
        "end": 1217.12
    },
    {
        "text": " Pero esa otra que decís es también es cierto.",
        "start": 1217.12,
        "end": 1220.12
    },
    {
        "text": " Una saliente no funciona en realidad, puede llegar un nuevo que no tenga",
        "start": 1220.12,
        "end": 1224.12
    },
    {
        "text": " la lista saliente.",
        "start": 1224.12,
        "end": 1227.12
    },
    {
        "text": " Bueno, por eso, si vos asumís entonces, bueno, yo digo, la T6 en este caso es serian,",
        "start": 1227.12,
        "end": 1234.12
    },
    {
        "text": " en cada da hay un nodo B, sin aristas salientes.",
        "start": 1234.12,
        "end": 1238.12
    },
    {
        "text": " Claro, sí.",
        "start": 1238.12,
        "end": 1240.12
    },
    {
        "text": " Entonces, pues la negación de la T6, que todo no tiene alguna lista saliente.",
        "start": 1240.12,
        "end": 1247.12
    },
    {
        "text": " Y ahí el argumento funciona igual.",
        "start": 1247.12,
        "end": 1254.12
    },
    {
        "text": " Está bien, sí.",
        "start": 1254.12,
        "end": 1259.12
    },
    {
        "text": " Si alguien más tiene dudas, quiere pagar, no se replino.",
        "start": 1259.12,
        "end": 1272.12
    },
    {
        "text": " Bueno, como les decía, ahora, la existencia de este nodo B,",
        "start": 1273.12,
        "end": 1279.12
    },
    {
        "text": " dice esto, lo que necesitamos para producir un ordenamiento topológico de G,",
        "start": 1279.12,
        "end": 1282.12
    },
    {
        "text": " por inducción.",
        "start": 1282.12,
        "end": 1284.12
    },
    {
        "text": " Y de esa manera, también hemos estado en PSG, es un DAG, entonces G tiene un ordenamiento topol,",
        "start": 1289.12,
        "end": 1294.12
    },
    {
        "text": " por qué? ¿Cuál es el relacionamiento inductivo?",
        "start": 1294.12,
        "end": 1297.12
    },
    {
        "text": " Lo que yo le incino es decir, si dado el grajo,",
        "start": 1298.12,
        "end": 1303.12
    },
    {
        "text": " yo puedo encontrar un punto de partida, es decir, alguien que no depende de nada,",
        "start": 1303.12,
        "end": 1308.12
    },
    {
        "text": " y bueno, ese lo puedo poner en primer lugar en el ordenamiento topológico.",
        "start": 1308.12,
        "end": 1312.12
    },
    {
        "text": " Y sé que eso seguro, ese vertice no tiene lista sentada,",
        "start": 1312.12,
        "end": 1322.12
    },
    {
        "text": " así que lo puedo poner ahí y seguro que, si sigo construyéndolo en el ordenamiento topológico,",
        "start": 1323.12,
        "end": 1329.12
    },
    {
        "text": " no va a haber nadie que vuelva hacia atrás a este nodo en particular que puse en primer lugar.",
        "start": 1329.12,
        "end": 1336.12
    },
    {
        "text": " Entonces, bueno, ahí se ya lo ubique, entonces lo borro del grajo.",
        "start": 1336.12,
        "end": 1343.12
    },
    {
        "text": " Y yo tengo un grajo con N-1, vertices, que también es un DAG,",
        "start": 1343.12,
        "end": 1351.12
    },
    {
        "text": " porque si el grajo más grande era un DAG y les saco a aristas,",
        "start": 1351.12,
        "end": 1356.12
    },
    {
        "text": " no van a aparecer de la nada, sí, que los ahí.",
        "start": 1356.12,
        "end": 1360.12
    },
    {
        "text": " Entonces, en ese DAG que ahora tiene N-1, vertices,",
        "start": 1360.12,
        "end": 1365.12
    },
    {
        "text": " también tiene que haber un vertice que no tiene lista sentrantes.",
        "start": 1365.12,
        "end": 1371.12
    },
    {
        "text": " En particular, por ejemplo, porque capaz que alguna de los sus aristas sentrantes venían",
        "start": 1371.12,
        "end": 1376.12
    },
    {
        "text": " del primer nodo que recién lo borré y algo orrá lo borré también, eso es arista.",
        "start": 1376.12,
        "end": 1381.12
    },
    {
        "text": " Pero es un DAG y, como dijimos, recién, si es un DAG, hay algún vertice que no tiene lista sentrantes.",
        "start": 1381.12,
        "end": 1388.12
    },
    {
        "text": " Entonces, ese vertice lo puedo poner más de uno, si es más de uno agarro cualquiera,",
        "start": 1388.12,
        "end": 1392.12
    },
    {
        "text": " lo saco y lo pongo en segundo lugar y lo borro del grajo.",
        "start": 1392.12,
        "end": 1396.12
    },
    {
        "text": " El grajo que me queda ahora tiene N-2, no dos.",
        "start": 1396.12,
        "end": 1401.12
    },
    {
        "text": " Y de vuelta, voy a poder encontrar a alguien que no tiene lista sentrantes,",
        "start": 1401.12,
        "end": 1405.12
    },
    {
        "text": " si eso lo pongo en tercer lugar. Y así, sucesivamente,",
        "start": 1405.12,
        "end": 1410.12
    },
    {
        "text": " en nomas de N-1, repire todos los ver, el grajo y lo fui poniendo en ese arvenamiento toponógic.",
        "start": 1410.12,
        "end": 1419.12
    },
    {
        "text": " Eso es el arrorimo de K.",
        "start": 1419.12,
        "end": 1422.12
    },
    {
        "text": " ¿Entienden? ¿Cuál es la idea?",
        "start": 1422.12,
        "end": 1426.12
    },
    {
        "text": " El segundo código es esto que está acá.",
        "start": 1426.12,
        "end": 1429.12
    },
    {
        "text": " En este caso, está expresado de forma reclusiva, porque...",
        "start": 1429.12,
        "end": 1434.12
    },
    {
        "text": " Esta idea que yo le dije recién, ¿cómo se formaliza?",
        "start": 1434.12,
        "end": 1437.12
    },
    {
        "text": " ¿Se formaliza? ¿Qué lo van a encontrar acá?",
        "start": 1437.12,
        "end": 1440.12
    },
    {
        "text": " Por inducción.",
        "start": 1440.12,
        "end": 1442.12
    },
    {
        "text": " Asumo que para grajos de tamaño N-1,",
        "start": 1442.12,
        "end": 1447.12
    },
    {
        "text": " puedo encontrar un orrentopológico.",
        "start": 1447.12,
        "end": 1451.12
    },
    {
        "text": " Para grajos de tamaño N, hago ese tuquito.",
        "start": 1451.12,
        "end": 1453.12
    },
    {
        "text": " O sea, con el primer variable, y si después por el hipótesis ilusión,",
        "start": 1453.12,
        "end": 1456.12
    },
    {
        "text": " sé que para el resto exista un ordenamiento toponógic.",
        "start": 1456.12,
        "end": 1459.12
    },
    {
        "text": " En el orrento recurso, lo que está acá,",
        "start": 1459.12,
        "end": 1462.12
    },
    {
        "text": " lo que hace es seguir literalmente la demostración de esa por inducción.",
        "start": 1462.12,
        "end": 1472.12
    },
    {
        "text": " Agramos, encuentre un nuevo becina de esta sentasta,",
        "start": 1472.12,
        "end": 1477.12
    },
    {
        "text": " si pongo el primer lugar, eliminar VDG,",
        "start": 1477.12,
        "end": 1480.12
    },
    {
        "text": " y el particular recurseamente un ordenamiento toponó,",
        "start": 1480.12,
        "end": 1483.12
    },
    {
        "text": " para G menos V.",
        "start": 1483.12,
        "end": 1486.12
    },
    {
        "text": " A ese ordenamiento, para el subgrajo,",
        "start": 1486.12,
        "end": 1490.12
    },
    {
        "text": " fue este más chico, lo concatenamos todo después del primer node,",
        "start": 1490.12,
        "end": 1494.12
    },
    {
        "text": " que eso es aquí como de.",
        "start": 1494.12,
        "end": 1496.12
    },
    {
        "text": " Literalmente la demostración se va a dar a un algoritmo.",
        "start": 1496.12,
        "end": 1501.12
    },
    {
        "text": " ¿Se puede hacer...?",
        "start": 1501.12,
        "end": 1504.12
    },
    {
        "text": " Disculpa, que en este caso el algoritmo,",
        "start": 1505.12,
        "end": 1509.12
    },
    {
        "text": " si yo le doy un grafo que en principio no sé si es un dago o no,",
        "start": 1509.12,
        "end": 1513.12
    },
    {
        "text": " quiero correr para encontrar una apológico y saber si es un dago o no.",
        "start": 1513.12,
        "end": 1518.12
    },
    {
        "text": " ¿Funcionaría, digamos, o como sería...?",
        "start": 1518.12,
        "end": 1523.12
    },
    {
        "text": " Ahí, ahí lo que te puede pasar,",
        "start": 1523.12,
        "end": 1527.12
    },
    {
        "text": " es que este paso no lo pueda resolver.",
        "start": 1527.12,
        "end": 1533.12
    },
    {
        "text": " Esto sería como sabiendo que es un dago calcular un orden topológico.",
        "start": 1535.12,
        "end": 1542.12
    },
    {
        "text": " Exactamente, hay un ejercicio del práctico que les pide justamente",
        "start": 1542.12,
        "end": 1549.12
    },
    {
        "text": " manejar esta situación,",
        "start": 1549.12,
        "end": 1554.12
    },
    {
        "text": " donde no asumir que el grafo es un dago,",
        "start": 1554.12,
        "end": 1559.12
    },
    {
        "text": " y bueno, y que tu algoritmo si es un dago,",
        "start": 1560.12,
        "end": 1565.12
    },
    {
        "text": " tiene que encontrar un ciclo y si no,",
        "start": 1565.12,
        "end": 1567.12
    },
    {
        "text": " que tiene que avisar, no va a esto, no es un dago.",
        "start": 1567.12,
        "end": 1572.12
    },
    {
        "text": " ¿Qué lo pueden hacer adaptando este mismo algoritmo?",
        "start": 1572.12,
        "end": 1577.12
    },
    {
        "text": " Sí, en realidad sería ponerle una condición de que cheque,",
        "start": 1577.12,
        "end": 1581.12
    },
    {
        "text": " que todos los nodos que te quedan,",
        "start": 1581.12,
        "end": 1583.12
    },
    {
        "text": " hay al menos si todos tienen una lista entrante,",
        "start": 1583.12,
        "end": 1586.12
    },
    {
        "text": " y si se ha estado al final y nunca te pasó que no pudiste resolver esto,",
        "start": 1586.12,
        "end": 1594.12
    },
    {
        "text": " de encontrar un beque, no tiene listas entrantes,",
        "start": 1594.12,
        "end": 1598.12
    },
    {
        "text": " nada, construíste efectivamente un orden topológico,",
        "start": 1598.12,
        "end": 1601.12
    },
    {
        "text": " y si tiene un orden topológico,",
        "start": 1601.12,
        "end": 1603.12
    },
    {
        "text": " o sea, que es así.",
        "start": 1603.12,
        "end": 1606.12
    },
    {
        "text": " ¿Vale?",
        "start": 1606.12,
        "end": 1607.12
    },
    {
        "text": " Sí, gracias.",
        "start": 1607.12,
        "end": 1608.12
    },
    {
        "text": " En ese ejercicio, no, seguramente, bueno,",
        "start": 1608.12,
        "end": 1610.12
    },
    {
        "text": " van a tener que demostrar la corrección del algoritmo",
        "start": 1610.12,
        "end": 1614.12
    },
    {
        "text": " y no me acuerdo exactamente qué es lo que se pide,",
        "start": 1614.12,
        "end": 1617.12
    },
    {
        "text": " pero que, que, que, que, que son ejercicios que están buenos,",
        "start": 1617.12,
        "end": 1620.12
    },
    {
        "text": " en el sentido de, bueno, tiene la intuición de como tendría que ser,",
        "start": 1620.12,
        "end": 1623.12
    },
    {
        "text": " bueno, vamos a bajar a tierra, esto como, como, si, formaliza.",
        "start": 1623.12,
        "end": 1628.12
    },
    {
        "text": " En algunos casos, eso es, más sencillo,",
        "start": 1628.12,
        "end": 1631.12
    },
    {
        "text": " no es un poco más, más complicado,",
        "start": 1631.12,
        "end": 1633.12
    },
    {
        "text": " y como yo igual les decía la vez pasada,",
        "start": 1633.12,
        "end": 1635.12
    },
    {
        "text": " ojo, que a veces una, a simple vista,",
        "start": 1635.12,
        "end": 1637.12
    },
    {
        "text": " las cosas parecen obvias,",
        "start": 1637.12,
        "end": 1639.12
    },
    {
        "text": " y cuando las vas a ver, a tratar de formalizar,",
        "start": 1639.12,
        "end": 1642.12
    },
    {
        "text": " las sueltas que no son tan otras.",
        "start": 1642.12,
        "end": 1645.12
    },
    {
        "text": " Así que, que me cuida, ¿cuál es eso?",
        "start": 1645.12,
        "end": 1648.12
    },
    {
        "text": " Bueno, así que tenemos un algoritmo para,",
        "start": 1652.12,
        "end": 1656.12
    },
    {
        "text": " si es un dar, tener el costíon ordenamiento topológico.",
        "start": 1656.12,
        "end": 1661.12
    },
    {
        "text": " ¿A qué?",
        "start": 1661.12,
        "end": 1663.12
    },
    {
        "text": " Acá,",
        "start": 1663.12,
        "end": 1665.12
    },
    {
        "text": " esto que hay una entema, después les voy a pasar notas de traducción,",
        "start": 1670.12,
        "end": 1673.12
    },
    {
        "text": " pero acá dice, por lo tanto, hemos demostrado",
        "start": 1673.12,
        "end": 1675.12
    },
    {
        "text": " la afirmación decía de 3.18 en realidad, lo que demostramos,",
        "start": 1675.12,
        "end": 1677.12
    },
    {
        "text": " aquí es el recíproc a 3.18, 3.18 lo decía era justamente,",
        "start": 1677.12,
        "end": 1680.12
    },
    {
        "text": " al revés, ¿no?",
        "start": 1680.12,
        "end": 1682.12
    },
    {
        "text": " Y si g es un orden topológico, entonces es un dar,",
        "start": 1682.12,
        "end": 1685.12
    },
    {
        "text": " y lo que acabamos de ver constructivamente,",
        "start": 1685.12,
        "end": 1688.12
    },
    {
        "text": " dando el algoritmo, es que si g es un dar,",
        "start": 1688.12,
        "end": 1690.12
    },
    {
        "text": " entonces g tiene un orden topológico.",
        "start": 1690.12,
        "end": 1692.12
    },
    {
        "text": " Entonces, las relaciones para los dos lados.",
        "start": 1693.12,
        "end": 1696.12
    },
    {
        "text": " Y...",
        "start": 1696.12,
        "end": 1698.12
    },
    {
        "text": " Como siempre, después de, bueno,",
        "start": 1716.12,
        "end": 1718.12
    },
    {
        "text": " de analizar la corrección, la propiedad del algoritmo",
        "start": 1719.12,
        "end": 1727.12
    },
    {
        "text": " que acabamos de presentar, nos ponemos a estudiar el tiempo",
        "start": 1727.12,
        "end": 1732.12
    },
    {
        "text": " de ejecución, la complejidad temporal del algoritmo.",
        "start": 1732.12,
        "end": 1736.12
    },
    {
        "text": " Acá van a encontrar que hay un análisis medio grueso,",
        "start": 1736.12,
        "end": 1741.12
    },
    {
        "text": " que es un tiempo, una cuenta superior cuadrático en N,",
        "start": 1741.12,
        "end": 1745.12
    },
    {
        "text": " pero de vuelta, y sabimos la vez pasada con el ejemplo",
        "start": 1746.12,
        "end": 1749.12
    },
    {
        "text": " que esto es útil, en realidad podemos hacer algo mejor,",
        "start": 1749.12,
        "end": 1754.12
    },
    {
        "text": " podemos encontrar una cota más justo en algunos casos,",
        "start": 1754.12,
        "end": 1758.12
    },
    {
        "text": " si expresamos el tiempo de ejecución términos",
        "start": 1758.12,
        "end": 1761.12
    },
    {
        "text": " de la cantidad de aristas N y el tiempo N,",
        "start": 1761.12,
        "end": 1765.12
    },
    {
        "text": " usando este mismo algoritmo, ¿no?",
        "start": 1770.12,
        "end": 1773.12
    },
    {
        "text": " ¿Cómo es la demostración de que puedo tener este tiempo",
        "start": 1773.12,
        "end": 1780.12
    },
    {
        "text": " de ejecución?",
        "start": 1780.12,
        "end": 1781.12
    },
    {
        "text": " La demostración es diciendo cómo la haría,",
        "start": 1781.12,
        "end": 1785.12
    },
    {
        "text": " ¿qué estructuras de datos voy a usar, cómo la suyo y ver que eso",
        "start": 1785.12,
        "end": 1790.12
    },
    {
        "text": " me permite que el tiempo de ejecución sea el línea",
        "start": 1790.12,
        "end": 1793.12
    },
    {
        "text": " en el tamaño de la arraza.",
        "start": 1793.12,
        "end": 1794.12
    },
    {
        "text": " Entonces, para eso, vamos a decir que un nuevo es activo",
        "start": 1794.12,
        "end": 1800.12
    },
    {
        "text": " entre comunisas, si el algoritmo no lo ha eliminado,",
        "start": 1800.12,
        "end": 1805.12
    },
    {
        "text": " es decir, si, vamos eliminando algunos",
        "start": 1805.12,
        "end": 1809.12
    },
    {
        "text": " los que todavía están vivos en el grafo.",
        "start": 1809.12,
        "end": 1812.12
    },
    {
        "text": " Entonces, bueno, es prísitamente vamos a mantener ciertas",
        "start": 1812.12,
        "end": 1815.12
    },
    {
        "text": " estructuras datos que nos van a permitir o tener un tiempo",
        "start": 1815.12,
        "end": 1818.12
    },
    {
        "text": " de ejecución lineal en tamaño de grafo.",
        "start": 1818.12,
        "end": 1821.12
    },
    {
        "text": " Para cada nuevo W, vamos a mantener la cantidad de aristas",
        "start": 1821.12,
        "end": 1825.12
    },
    {
        "text": " entrantes que W tiene provenientes de los nuevos activos.",
        "start": 1825.12,
        "end": 1830.12
    },
    {
        "text": " Pásicamente, para cada vez, pisemos un signo",
        "start": 1830.12,
        "end": 1833.12
    },
    {
        "text": " en teniendo el grado de entrada,",
        "start": 1833.12,
        "end": 1836.12
    },
    {
        "text": " son las canciones de aristas que entran, que todavía no eliminé.",
        "start": 1836.12,
        "end": 1839.12
    },
    {
        "text": " Las amigas que voy eliminando, no, van casando.",
        "start": 1839.12,
        "end": 1841.12
    },
    {
        "text": " Algunas de esas aristas, yo voy llevando la cuenta de cuántas quedan.",
        "start": 1841.12,
        "end": 1844.12
    },
    {
        "text": " Y lo otro voy a hacer es voy a mantener en una lista,",
        "start": 1847.12,
        "end": 1851.12
    },
    {
        "text": " por ejemplo, el conjunto S de todos los nuevos activos,",
        "start": 1851.12,
        "end": 1855.12
    },
    {
        "text": " es decir, el tóp, los pito avía no borré,",
        "start": 1855.12,
        "end": 1858.12
    },
    {
        "text": " que no tienen aristas entrantes,",
        "start": 1858.12,
        "end": 1861.12
    },
    {
        "text": " es decir, los que quedaron con grado de entrada 0,",
        "start": 1861.12,
        "end": 1867.12
    },
    {
        "text": " media que yo fui eliminando vértices.",
        "start": 1867.12,
        "end": 1873.12
    },
    {
        "text": " Esto para que me sirve, el conjunto S me sirve para el paso",
        "start": 1873.12,
        "end": 1876.12
    },
    {
        "text": " del Arduino, donde dice, vas a ir en encuentre un nodo",
        "start": 1876.12,
        "end": 1882.12
    },
    {
        "text": " que tiene grado de entrada 0,",
        "start": 1882.12,
        "end": 1884.12
    },
    {
        "text": " eso puede hacerlo en ODE 1,",
        "start": 1884.12,
        "end": 1886.12
    },
    {
        "text": " simplemente sacando un vértice de talisco.",
        "start": 1886.12,
        "end": 1891.12
    },
    {
        "text": " Como siempre, recalco lo que es importante es no sólo",
        "start": 1891.12,
        "end": 1896.12
    },
    {
        "text": " que esta estructura me sirve para el paso,",
        "start": 1896.12,
        "end": 1898.12
    },
    {
        "text": " no de ese paso, fiscintemente,",
        "start": 1898.12,
        "end": 1899.12
    },
    {
        "text": " sino que además el mantenimiento de la estructura",
        "start": 1899.12,
        "end": 1901.12
    },
    {
        "text": " lo pueda resolver también, fiscintemente,",
        "start": 1901.12,
        "end": 1903.12
    },
    {
        "text": " mantener eso actualizado",
        "start": 1903.12,
        "end": 1907.12
    },
    {
        "text": " y inicializarlo también en tiempo eficiente.",
        "start": 1907.12,
        "end": 1911.12
    },
    {
        "text": " Al principio todos los nuevos están activos,",
        "start": 1915.12,
        "end": 1918.12
    },
    {
        "text": " eso quiere decir, bueno, todavía no borré ninguno,",
        "start": 1918.12,
        "end": 1920.12
    },
    {
        "text": " así que en realidad la inicialización de estas estructuras",
        "start": 1920.12,
        "end": 1923.12
    },
    {
        "text": " es sencillo, simplemente así no es una pasada por todo el grado.",
        "start": 1923.12,
        "end": 1926.12
    },
    {
        "text": " Recorro todo el grado,",
        "start": 1926.12,
        "end": 1928.12
    },
    {
        "text": " para cada vértice cuento cuantas aristas entrantes tiene,",
        "start": 1928.12,
        "end": 1932.12
    },
    {
        "text": " y con eso me defino esta,",
        "start": 1932.12,
        "end": 1936.12
    },
    {
        "text": " puede ser un arreglo, por ejemplo,",
        "start": 1936.12,
        "end": 1938.12
    },
    {
        "text": " mantiene la cantidad de aristas entrantes",
        "start": 1938.12,
        "end": 1942.12
    },
    {
        "text": " y los que no tienen aristas entrantes,",
        "start": 1942.12,
        "end": 1944.12
    },
    {
        "text": " salvo incorporando el conjunto S inicial.",
        "start": 1944.12,
        "end": 1948.12
    },
    {
        "text": " Entonces, en tiempo de M más en,",
        "start": 1948.12,
        "end": 1950.12
    },
    {
        "text": " es una recorrida por el grado,",
        "start": 1950.12,
        "end": 1952.12
    },
    {
        "text": " yo construyo estas dos valores iniciales de estas dos estructuras de datos.",
        "start": 1952.12,
        "end": 1958.12
    },
    {
        "text": " Y pues en cada iteración, como les decía,",
        "start": 1959.12,
        "end": 1962.12
    },
    {
        "text": " sacar un nodo que tiene que no tiene aristas entrantes",
        "start": 1962.12,
        "end": 1965.12
    },
    {
        "text": " es simplemente tomar uno de ese,",
        "start": 1965.12,
        "end": 1967.12
    },
    {
        "text": " sacarlo de ahí y eso es lo que hago de uno.",
        "start": 1967.12,
        "end": 1970.12
    },
    {
        "text": " Después de eliminar V, cuando eliminamos un nodo V,",
        "start": 1972.12,
        "end": 1976.12
    },
    {
        "text": " sus aristas salientes,",
        "start": 1976.12,
        "end": 1979.12
    },
    {
        "text": " los aristas entrantes no tenían por lo barra.",
        "start": 1979.12,
        "end": 1982.12
    },
    {
        "text": " Es aristas salientes,",
        "start": 1982.12,
        "end": 1984.12
    },
    {
        "text": " que podrían tener todas esas caes junto con el nodo,",
        "start": 1984.12,
        "end": 1986.12
    },
    {
        "text": " entonces lo acabo recorrer todos sus vecinos,",
        "start": 1986.12,
        "end": 1988.12
    },
    {
        "text": " salientes y si todos los que tienen todos hacia donde van aristas.",
        "start": 1988.12,
        "end": 1993.12
    },
    {
        "text": " Y en esa recorrida actualizamos la estructura de cantidad de aristas incidentes",
        "start": 1997.12,
        "end": 2003.12
    },
    {
        "text": " a cada uno de sus vecinos,",
        "start": 2003.12,
        "end": 2005.12
    },
    {
        "text": " que hay también aristas entrantes.",
        "start": 2005.12,
        "end": 2007.12
    },
    {
        "text": " Si alguno de esos quedó en cero, lo agregó en ese.",
        "start": 2007.12,
        "end": 2010.12
    },
    {
        "text": " Entonces como yo, cada vértice lo tomo para ver lo que es un nodo,",
        "start": 2011.12,
        "end": 2016.12
    },
    {
        "text": " es una vez y la actualización de los contadores de aristas entrantes",
        "start": 2016.12,
        "end": 2023.12
    },
    {
        "text": " implica recorrer sus aristas y se va a hacer una vez con cada vértice.",
        "start": 2023.12,
        "end": 2028.12
    },
    {
        "text": " En total, el tiempo que me lleva es el total de vértices",
        "start": 2028.12,
        "end": 2033.12
    },
    {
        "text": " y el total de aristas,",
        "start": 2033.12,
        "end": 2035.12
    },
    {
        "text": " algo proporcional a ellos,",
        "start": 2035.12,
        "end": 2037.12
    },
    {
        "text": " o definir más.",
        "start": 2037.12,
        "end": 2040.12
    },
    {
        "text": " Voy a hacer mostrarles esto directamente de forma de ser locudio.",
        "start": 2040.12,
        "end": 2047.12
    },
    {
        "text": " Que va a ser más claro que explicarlos en el aire.",
        "start": 2047.12,
        "end": 2050.12
    },
    {
        "text": " Y el algoritmo y ver, y ya de paso les muestro como es una versión iterativa de esto.",
        "start": 2050.12,
        "end": 2055.12
    },
    {
        "text": " Entonces, ¿qué hacemos?",
        "start": 2056.12,
        "end": 2059.12
    },
    {
        "text": " Vamos a construir un ordenamiento topológico,",
        "start": 2060.12,
        "end": 2063.12
    },
    {
        "text": " es una lista O, que aparece ahí, somos en un camino vacío.",
        "start": 2063.12,
        "end": 2068.12
    },
    {
        "text": " Y, ¿qué es eso?",
        "start": 2071.12,
        "end": 2073.12
    },
    {
        "text": " ¿Qué es eso?",
        "start": 2073.12,
        "end": 2076.12
    },
    {
        "text": " ¿Qué es eso?",
        "start": 2076.12,
        "end": 2077.12
    },
    {
        "text": " Esa es la idea.",
        "start": 2077.12,
        "end": 2078.12
    },
    {
        "text": " Esa es la idea, es la idea,",
        "start": 2078.12,
        "end": 2080.12
    },
    {
        "text": " es que es la idea.",
        "start": 2080.12,
        "end": 2082.12
    },
    {
        "text": " Es la idea, es la idea,",
        "start": 2082.12,
        "end": 2084.12
    },
    {
        "text": " es que es una idea,",
        "start": 2084.12,
        "end": 2086.12
    },
    {
        "text": " y vamos a mantener",
        "start": 2087.12,
        "end": 2091.12
    },
    {
        "text": " esta estructura,",
        "start": 2094.12,
        "end": 2096.12
    },
    {
        "text": " grado de entrada, que lo van a decir es cuántas aristas entrantes tienen cada uno.",
        "start": 2096.12,
        "end": 2104.12
    },
    {
        "text": " Inicialmente eso es lo como les decía recién lo construyo",
        "start": 2104.12,
        "end": 2107.12
    },
    {
        "text": " en una recorrida por el grazo.",
        "start": 2107.12,
        "end": 2111.12
    },
    {
        "text": " Y me lleva tiempo de NMACME y lo hubiera actualizado.",
        "start": 2112.12,
        "end": 2116.12
    },
    {
        "text": " En el siguiente paso, la vemos un construyo de este conjunto S,",
        "start": 2117.12,
        "end": 2121.12
    },
    {
        "text": " que son todos los vértices cuyo indel está encerro.",
        "start": 2121.12,
        "end": 2126.12
    },
    {
        "text": " Cualquiera de eso es un potencial punto de partida para construir mi orden.",
        "start": 2127.12,
        "end": 2131.12
    },
    {
        "text": " Por eso, por supuesto, puede dar más de 1.",
        "start": 2131.12,
        "end": 2134.12
    },
    {
        "text": " Entonces, después, mientras tenga vértices allí,",
        "start": 2136.12,
        "end": 2139.12
    },
    {
        "text": " que hagas, bueno, retiró un nodo de U,",
        "start": 2142.12,
        "end": 2144.12
    },
    {
        "text": " retiró un nodo de U de S,",
        "start": 2145.12,
        "end": 2147.12
    },
    {
        "text": " que por cómo estoy manteniendo S,",
        "start": 2150.12,
        "end": 2152.12
    },
    {
        "text": " sé que no tiene aristas entrantes y lo agregó al final del camino.",
        "start": 2152.12,
        "end": 2157.12
    },
    {
        "text": " Tome un nodo que no tiene aristas entrantes y pímelo pongo al final del camino que estoy construciendo,",
        "start": 2158.12,
        "end": 2163.12
    },
    {
        "text": " del orden topolo que estoy construyendo.",
        "start": 2163.12,
        "end": 2165.12
    },
    {
        "text": " Y ahora, lo que te va a hacer para que esto siga funcionando bien es actualizar las estructuras de datos",
        "start": 2166.12,
        "end": 2174.12
    },
    {
        "text": " en las cuales me estoy apoyando para resolver estos pasos,",
        "start": 2174.12,
        "end": 2177.12
    },
    {
        "text": " particular el inde y el conjunto S.",
        "start": 2177.12,
        "end": 2182.12
    },
    {
        "text": " Entonces, lo que va a recorrer, como decía,",
        "start": 2183.12,
        "end": 2185.12
    },
    {
        "text": " todas las aristas que salen de U hacia algún V,",
        "start": 2185.12,
        "end": 2188.12
    },
    {
        "text": " estas acá.",
        "start": 2191.12,
        "end": 2192.12
    },
    {
        "text": " Que, como decía, en algo oral, las generafos, caen esas aristas también.",
        "start": 2195.12,
        "end": 2199.12
    },
    {
        "text": " Entonces, para cada uno de esos V,",
        "start": 2202.12,
        "end": 2204.12
    },
    {
        "text": " redujo en uno su grado de entrada, porque esa arista ya no está más.",
        "start": 2204.12,
        "end": 2209.12
    },
    {
        "text": " Y en cuanto el grado de entrada de algún Vértice se vuelve cero,",
        "start": 2211.12,
        "end": 2215.12
    },
    {
        "text": " entonces lo agrega es.",
        "start": 2216.12,
        "end": 2218.12
    },
    {
        "text": " Y ese va a ser un nuevo candidato para seguir agregando",
        "start": 2220.12,
        "end": 2223.12
    },
    {
        "text": " en una siguiente iteración en mi orden topológico.",
        "start": 2223.12,
        "end": 2229.12
    },
    {
        "text": " Fíjese que...",
        "start": 2230.12,
        "end": 2232.12
    },
    {
        "text": " Sigue conceptualmente el algoritmo y lo pensamos como que, bueno,",
        "start": 2234.12,
        "end": 2238.12
    },
    {
        "text": " yo saco el Vértice del Grafo.",
        "start": 2238.12,
        "end": 2241.12
    },
    {
        "text": " Y voy a tener un Grafo cada vez más chico y yo lo razoné de esa manera.",
        "start": 2242.12,
        "end": 2246.12
    },
    {
        "text": " En la práctica, la implementación, esto no borra nada en el mulado.",
        "start": 2246.12,
        "end": 2249.12
    },
    {
        "text": " No es necesario, explícitamente, actualizando un Grafo y ir borrando cosas.",
        "start": 2250.12,
        "end": 2255.12
    },
    {
        "text": " La estructura de esta...",
        "start": 2258.12,
        "end": 2261.12
    },
    {
        "text": " Me mantiene los...",
        "start": 2264.12,
        "end": 2267.12
    },
    {
        "text": " El grado de entrada en ese Grafo imaginario donde yo vivo borrando cosas.",
        "start": 2267.12,
        "end": 2272.12
    },
    {
        "text": " Y eso es todo lo que necesito.",
        "start": 2272.12,
        "end": 2274.12
    },
    {
        "text": " No necesito tener explícitamente el Grafo.",
        "start": 2274.12,
        "end": 2276.12
    },
    {
        "text": " Entonces, eso es uno pensaría, primero y bueno, tengo que ir y borrar un Vértice y recordar su sabriste y volve la lista de asesencia y recordar la lista de las asesiones y de la vecina para que elizar eso también.",
        "start": 2277.12,
        "end": 2288.12
    },
    {
        "text": " Nada de eso hay realmente por qué asarla.",
        "start": 2288.12,
        "end": 2292.12
    },
    {
        "text": " Consexualmente uno lo piensa el algoritmo de esa manera, principio.",
        "start": 2292.12,
        "end": 2295.12
    },
    {
        "text": " A la hora de buscar una implementación eficiente uno no tiene por qué hacer explícitamente esas cosas, y no bueno,",
        "start": 2296.12,
        "end": 2303.12
    },
    {
        "text": " solo lo estrictamente necesario.",
        "start": 2304.12,
        "end": 2309.12
    },
    {
        "text": " Me confunde un poco eso porque ponen en el algoritmo y donde hacemos todas las pruebas, va a ser recursivo.",
        "start": 2314.12,
        "end": 2323.12
    },
    {
        "text": " No, puede ser este otro que es iterativo.",
        "start": 2324.12,
        "end": 2328.12
    },
    {
        "text": " El que está presentado en el libro es recursivo, pero lo podías haber hecho iterativamente siguiendo el mismo arrasanamiento.",
        "start": 2328.12,
        "end": 2339.12
    },
    {
        "text": " Pero por ejemplo si yo lo quieres escribir, yo lo escribo recursivo como están en el libro.",
        "start": 2340.12,
        "end": 2347.12
    },
    {
        "text": " Y hago todas las demostraciones en base a eso, por mi dubillo y...",
        "start": 2348.12,
        "end": 2353.12
    },
    {
        "text": " Está y después como implementación para probar el orden presento esta, digamos.",
        "start": 2354.12,
        "end": 2361.12
    },
    {
        "text": " Lo que probar alguna equivalencia entre los recursivos y esto...",
        "start": 2363.12,
        "end": 2368.12
    },
    {
        "text": " No, claro, este conmiene de nada así, analizar directamente lo que escribiste.",
        "start": 2369.12,
        "end": 2372.12
    },
    {
        "text": " O sea, si le escribiste recursivo, podés analizar los recursivos.",
        "start": 2372.12,
        "end": 2375.12
    },
    {
        "text": " O si no, bueno, va a hacerlo directamente iterativo y analizar directamente la versión iterativa.",
        "start": 2378.12,
        "end": 2384.12
    },
    {
        "text": " Si no, bueno, si, a veces puedes hacer sencillo de probar algún tipo de equivalencia,",
        "start": 2384.12,
        "end": 2389.12
    },
    {
        "text": " pero no siempre, por ejemplo, el caso de TFS también tuvimos una presentación recursiva y una presentación iterativa usando stack.",
        "start": 2389.12,
        "end": 2401.12
    },
    {
        "text": " Y bueno, había algún argumento de que ambos hacían recorridas de FS, pero no era nada,",
        "start": 2402.12,
        "end": 2411.12
    },
    {
        "text": " podrése incluso un poco confusos, si lo miran en libro, hay una discusión sobre que lo ordenen,",
        "start": 2411.12,
        "end": 2417.12
    },
    {
        "text": " que se acuerdan los vértices, puede quedar al revés disovelados un poco acá también.",
        "start": 2417.12,
        "end": 2420.12
    },
    {
        "text": " Entonces, las equivalencias a veces pueden ser no tan obvias de demostrar,",
        "start": 2420.12,
        "end": 2427.12
    },
    {
        "text": " a pesar de que a veces pueden parecer claras.",
        "start": 2428.12,
        "end": 2431.12
    },
    {
        "text": " En este caso, nada, en el libro se presente el delogismo de forma recursiva,",
        "start": 2431.12,
        "end": 2437.12
    },
    {
        "text": " porque el razonamiento del ruiso inductivo, pero un razonamiento muy parecido,",
        "start": 2437.12,
        "end": 2442.12
    },
    {
        "text": " mostrar la corrección del iterativo también.",
        "start": 2442.12,
        "end": 2446.12
    },
    {
        "text": " Una pregunta, ¿el paso de encontrar unos sinaristas entrantes no te llevan equadrado?",
        "start": 2447.12,
        "end": 2459.12
    },
    {
        "text": " ¿Cuál?",
        "start": 2459.12,
        "end": 2461.12
    },
    {
        "text": " El paso de arras, una lista que no tiene nuevos entrantes, no puede tener malas suerte y que sean equadrado en el peor caso.",
        "start": 2461.12,
        "end": 2473.12
    },
    {
        "text": " Solo eso.",
        "start": 2474.12,
        "end": 2475.12
    },
    {
        "text": " Depende cómo lo implementas haciendo que en cada iteración vas a buscar,",
        "start": 2475.12,
        "end": 2484.12
    },
    {
        "text": " haciendo que cada iteración vas a buscar,",
        "start": 2484.12,
        "end": 2490.12
    },
    {
        "text": " tal no, buscando desafíadamente sí, podría ser,",
        "start": 2490.12,
        "end": 2495.12
    },
    {
        "text": " perusing las estructuras de datos de grabo de entrada que dijimos recién.",
        "start": 2495.12,
        "end": 2500.12
    },
    {
        "text": " Esto, o sea, este algoritmo que está acá, es básicamente el mismo que está acá,",
        "start": 2501.12,
        "end": 2506.12
    },
    {
        "text": " sobre que acá lo nutrico, no otras estructuras de datos.",
        "start": 2506.12,
        "end": 2509.12
    },
    {
        "text": " Entonces, ahora, fíjate que...",
        "start": 2509.12,
        "end": 2512.12
    },
    {
        "text": " Fíjate que el retirar un nodo, el encontrar un nodo que no tiene a vista sentrantes,",
        "start": 2517.12,
        "end": 2524.12
    },
    {
        "text": " es simplemente sacar un nodo U,",
        "start": 2524.12,
        "end": 2526.12
    },
    {
        "text": " ese este paso acá, retirar un nodo U de S,",
        "start": 2531.12,
        "end": 2536.12
    },
    {
        "text": " si es el que tiene como una lista, por ejemplo,",
        "start": 2536.12,
        "end": 2539.12
    },
    {
        "text": " eso lo hace sin O1.",
        "start": 2539.12,
        "end": 2542.12
    },
    {
        "text": " La gracia está en que, ¿vos?",
        "start": 2542.12,
        "end": 2545.12
    },
    {
        "text": " Hace una inicialización de ese conjunto, es el principio.",
        "start": 2545.12,
        "end": 2549.12
    },
    {
        "text": " Y eso te lleva a orden de Mmacn.",
        "start": 2549.12,
        "end": 2553.12
    },
    {
        "text": " Pero después, no es que esa lista, a veces, arrecontúe los de Cero,",
        "start": 2553.12,
        "end": 2558.12
    },
    {
        "text": " sino que lo vas actualizando acá al final.",
        "start": 2558.12,
        "end": 2563.12
    },
    {
        "text": " Y el que oísal no te lleva en Ecuador?",
        "start": 2563.12,
        "end": 2567.12
    },
    {
        "text": " No, porque fíjate.",
        "start": 2567.12,
        "end": 2571.12
    },
    {
        "text": " Por eso, ven en Ecuador, si tengo ven en Ecuador, barista.",
        "start": 2571.12,
        "end": 2576.12
    },
    {
        "text": " Ah, claro, sí, ha gone.",
        "start": 2576.12,
        "end": 2580.12
    },
    {
        "text": " Chant and Nive.",
        "start": 2580.12,
        "end": 2582.12
    },
    {
        "text": " A los humo, vas a el grado del nodo,",
        "start": 2583.12,
        "end": 2587.12
    },
    {
        "text": " vas a recorrer que le ganti a daristas, claro.",
        "start": 2587.12,
        "end": 2590.12
    },
    {
        "text": " Ahí va.",
        "start": 2590.12,
        "end": 2591.12
    },
    {
        "text": " Fíjate que cada...",
        "start": 2591.12,
        "end": 2592.12
    },
    {
        "text": " En este cual, cada vez que se lo barramos una vez y solo una vez.",
        "start": 2592.12,
        "end": 2597.12
    },
    {
        "text": " Es que a veces caigo en el Ncuadrado,",
        "start": 2597.12,
        "end": 2599.12
    },
    {
        "text": " como pensando el peor grafo, que es el completo que ahí siempre en el Mmacn",
        "start": 2599.12,
        "end": 2604.12
    },
    {
        "text": " va a ser Ncuadrado.",
        "start": 2604.12,
        "end": 2606.12
    },
    {
        "text": " Ah, está, está.",
        "start": 2606.12,
        "end": 2608.12
    },
    {
        "text": " Pero bueno, pero hay que tener cuidado con eso, porque...",
        "start": 2608.12,
        "end": 2611.12
    },
    {
        "text": " O que a veces se grueso.",
        "start": 2611.12,
        "end": 2613.12
    },
    {
        "text": " O sea, lo que esté mal,",
        "start": 2613.12,
        "end": 2615.12
    },
    {
        "text": " si vos quieres expresar tu tiempo de distribución en términos sólo de N,",
        "start": 2615.12,
        "end": 2619.12
    },
    {
        "text": " y bueno, sí,",
        "start": 2619.12,
        "end": 2621.12
    },
    {
        "text": " la cantidad de daristas puede ser cuadrático en N.",
        "start": 2621.12,
        "end": 2625.12
    },
    {
        "text": " Ah, y es eso.",
        "start": 2625.12,
        "end": 2626.12
    },
    {
        "text": " En un caso casi que tu tiempo que de Ncuadrado.",
        "start": 2626.12,
        "end": 2630.12
    },
    {
        "text": " Pero sí, expresamos nuestros tiempos en términos de cantidad de vértices",
        "start": 2630.12,
        "end": 2636.12
    },
    {
        "text": " y cantidad de daristas, tanto se puede ser una vez N, M.",
        "start": 2636.12,
        "end": 2639.12
    },
    {
        "text": " En algunos casos, pues, es que eso sea Ncuadrado.",
        "start": 2639.12,
        "end": 2642.12
    },
    {
        "text": " Está viudio orden en Ncuadrado.",
        "start": 2642.12,
        "end": 2645.12
    },
    {
        "text": " Pero no es de seriamente.",
        "start": 2645.12,
        "end": 2647.12
    },
    {
        "text": " Perdón, una pregunta.",
        "start": 2653.12,
        "end": 2654.12
    },
    {
        "text": " Esto sería como tu implementación y lo que es que les mostraste antes,",
        "start": 2654.12,
        "end": 2658.12
    },
    {
        "text": " que era el for con las...",
        "start": 2658.12,
        "end": 2660.12
    },
    {
        "text": " con los tres pasos,",
        "start": 2660.12,
        "end": 2661.12
    },
    {
        "text": " eso sería como el pseudo-códio, digamos, ¿no?",
        "start": 2661.12,
        "end": 2665.12
    },
    {
        "text": " Sí, ambos son pseudo-códios.",
        "start": 2665.12,
        "end": 2667.12
    },
    {
        "text": " Si querés, es un pseudo-códio más donde hace referencias,",
        "start": 2667.12,
        "end": 2671.12
    },
    {
        "text": " prígita a las estructuras.",
        "start": 2671.12,
        "end": 2673.12
    },
    {
        "text": " Volviendo a cómo se presenta en el libro.",
        "start": 2673.12,
        "end": 2676.12
    },
    {
        "text": " No, no, no, no, no.",
        "start": 2690.12,
        "end": 2691.12
    },
    {
        "text": " Teníamos acá, digamos, este es el algoritmo.",
        "start": 2691.12,
        "end": 2694.12
    },
    {
        "text": " Y después la demostración de que esto se puede implementar en tiempo o de M y más N",
        "start": 2694.12,
        "end": 2700.12
    },
    {
        "text": " es una descripción de que estructuras de datos podré usar",
        "start": 2700.12,
        "end": 2710.12
    },
    {
        "text": " para lograr ese tiempo de institución.",
        "start": 2710.12,
        "end": 2713.12
    },
    {
        "text": " Sólo que hice acá,",
        "start": 2715.12,
        "end": 2718.12
    },
    {
        "text": " fue mostrarle cómo se usan,",
        "start": 2719.12,
        "end": 2723.12
    },
    {
        "text": " se ha bajado más a pseudo-códio esas estructuras de datos",
        "start": 2723.12,
        "end": 2727.12
    },
    {
        "text": " en una versión iterativa de este algoritmo.",
        "start": 2727.12,
        "end": 2730.12
    },
    {
        "text": " Es que hay que apague generar un poco de confusión con lo que se enresión.",
        "start": 2730.12,
        "end": 2733.12
    },
    {
        "text": " Yo puedo usar estas mismas,",
        "start": 2733.12,
        "end": 2735.12
    },
    {
        "text": " es lo que está planteando el libro,",
        "start": 2735.12,
        "end": 2736.12
    },
    {
        "text": " usar estas mismas estructuras de Indel y S con la versión repursiva.",
        "start": 2736.12,
        "end": 2742.12
    },
    {
        "text": " Y hay una conexión más directa entre la explicación de cómo alcanzó ese tiempo de distribución,",
        "start": 2743.12,
        "end": 2753.12
    },
    {
        "text": " los estructuras de datos y lo mismo que había presentado indignado.",
        "start": 2753.12,
        "end": 2756.12
    },
    {
        "text": " Yo quise aprovechar la oportunidad para mostrarles además cómo se puede hacer de forma iterativa",
        "start": 2756.12,
        "end": 2763.12
    },
    {
        "text": " y que básicamente por las mismas ideas.",
        "start": 2763.12,
        "end": 2769.12
    },
    {
        "text": " Después, igual, el análisis de conexión de esta versión iterativa me quedó en el aire,",
        "start": 2770.12,
        "end": 2777.12
    },
    {
        "text": " después la paso en limpio se las explicó mejor.",
        "start": 2777.12,
        "end": 2782.12
    },
    {
        "text": " No me quedé muy conforme con la explicación en el aire.",
        "start": 2782.12,
        "end": 2787.12
    },
    {
        "text": " Pero las ideas sus hacer que son básicamente las mismas.",
        "start": 2789.12,
        "end": 2792.12
    },
    {
        "text": " Entonces, haciendo a tu pregunta, ¿el algoritmo es esto?",
        "start": 2793.12,
        "end": 2801.12
    },
    {
        "text": " Después dice, ¿cuánto tiempo de distribución me llega a esta?",
        "start": 2804.12,
        "end": 2807.12
    },
    {
        "text": " Si lo hago así, medio rápido, puedo llegar a N cuadrado,",
        "start": 2807.12,
        "end": 2815.12
    },
    {
        "text": " que es como me preguntaron así.",
        "start": 2815.12,
        "end": 2817.12
    },
    {
        "text": " Pero no, pero como hace una análisis más fino, usando estructuras de datos adecuadas",
        "start": 2818.12,
        "end": 2824.12
    },
    {
        "text": " y mostrar que el tiempo de distribución es o de mamá.",
        "start": 2824.12,
        "end": 2827.12
    },
    {
        "text": " Es decir, que existe una implementación cuyo tiempo de distribución es o de mi mamá.",
        "start": 2827.12,
        "end": 2833.12
    },
    {
        "text": " Y para eso lo que hago es describir, en este caso de forma lenguaje natural,",
        "start": 2833.12,
        "end": 2843.12
    },
    {
        "text": " que es lo que solemos hacer, ¿cuál es estructuras de datos suces y cómo la suces para que el tiempo de distribución sea,",
        "start": 2843.12,
        "end": 2851.12
    },
    {
        "text": " que yo estoy reclamando?",
        "start": 2851.12,
        "end": 2853.12
    },
    {
        "text": " Este otro pseudo puede que les mostre a recién,",
        "start": 2856.12,
        "end": 2860.12
    },
    {
        "text": " si queréis, un pseudo puede ser un poco más cercano a las estructuras de datos,",
        "start": 2860.12,
        "end": 2866.12
    },
    {
        "text": " a una implementación, para que ustedes puedan visualizar más fácilmente",
        "start": 2866.12,
        "end": 2872.12
    },
    {
        "text": " que es lo que está diciendo este parajo de acá.",
        "start": 2872.12,
        "end": 2879.12
    },
    {
        "text": " ¿A cuál son estas?",
        "start": 2879.12,
        "end": 2882.12
    },
    {
        "text": " A ver.",
        "start": 2882.12,
        "end": 2884.12
    },
    {
        "text": " A ver.",
        "start": 2884.12,
        "end": 2885.12
    },
    {
        "text": " Dicente.",
        "start": 2885.12,
        "end": 2887.12
    },
    {
        "text": " Yo lo me quedo muy claro en el paso de los mitte de Asia, ¿as que venga?",
        "start": 2887.12,
        "end": 2895.12
    },
    {
        "text": " De la ecorimo y te la activo.",
        "start": 2895.12,
        "end": 2899.12
    },
    {
        "text": " De la ecorimo y te la activo.",
        "start": 2899.12,
        "end": 2902.12
    },
    {
        "text": " ¿Dejame el que escribí yo a mano?",
        "start": 2902.12,
        "end": 2905.12
    },
    {
        "text": " En este?",
        "start": 2905.12,
        "end": 2908.12
    },
    {
        "text": " Sí.",
        "start": 2908.12,
        "end": 2909.12
    },
    {
        "text": " En este, en el momento de que armárnosos de este raso,",
        "start": 2909.12,
        "end": 2914.12
    },
    {
        "text": " mitte que es indéanese, esta estructura.",
        "start": 2914.12,
        "end": 2919.12
    },
    {
        "text": " El grazo nos viene como parte del entrada,",
        "start": 2919.12,
        "end": 2924.12
    },
    {
        "text": " nuestro problema tiene como dato de entrada un grazo,",
        "start": 2924.12,
        "end": 2929.12
    },
    {
        "text": " un grazo dirigido a sí, pero ya tiene la estructura indéin.",
        "start": 2929.12,
        "end": 2936.12
    },
    {
        "text": " No, el grazo no tiene la estructura indéin.",
        "start": 2936.12,
        "end": 2939.12
    },
    {
        "text": " El grazo está en la estructura indéin.",
        "start": 2939.12,
        "end": 2942.12
    },
    {
        "text": " Y ya tiene la estructura indéin.",
        "start": 2943.12,
        "end": 2946.12
    },
    {
        "text": " No.",
        "start": 2946.12,
        "end": 2947.12
    },
    {
        "text": " El grazo no tiene la estructura indéin.",
        "start": 2947.12,
        "end": 2949.12
    },
    {
        "text": " El grazo está representado con alguna representación que,",
        "start": 2949.12,
        "end": 2954.12
    },
    {
        "text": " en el mismo grazo, la que usamos.",
        "start": 2954.12,
        "end": 2956.12
    },
    {
        "text": " No, no.",
        "start": 2956.12,
        "end": 2957.12
    },
    {
        "text": " No, no, no, no.",
        "start": 2957.12,
        "end": 2958.12
    },
    {
        "text": " No, no, no, no, siempre es la delista de la asociencia.",
        "start": 2958.12,
        "end": 2960.12
    },
    {
        "text": " Ojo que en el caso de grazo dirigidos, eso,",
        "start": 2960.12,
        "end": 2962.12
    },
    {
        "text": " mire lo que he cuidado la representación delista de la asociencia.",
        "start": 2962.12,
        "end": 2964.12
    },
    {
        "text": " Cada vez que tiene dos listas,",
        "start": 2964.12,
        "end": 2966.12
    },
    {
        "text": " el 19 de la vista socialiente es una de la vista central,",
        "start": 2966.12,
        "end": 2969.12
    },
    {
        "text": " eso puede ir hacia un lado o hacia el lado.",
        "start": 2969.12,
        "end": 2971.12
    },
    {
        "text": " Entonces, lo que tenemos que ver es que es el mapeo,",
        "start": 2971.12,
        "end": 2974.12
    },
    {
        "text": " el limpo que nos lleva a la indegición.",
        "start": 2974.12,
        "end": 2979.12
    },
    {
        "text": " Exacto, que es lo que ves acá en el paso 2 como decía vos.",
        "start": 2979.12,
        "end": 2983.12
    },
    {
        "text": " Ahí lo que estoy haciendo es construyendo la estructura indéin.",
        "start": 2983.12,
        "end": 2986.12
    },
    {
        "text": " Indéin, la práctica es un marelo que para cada vez,",
        "start": 2994.12,
        "end": 2997.12
    },
    {
        "text": " la práctica tiene un monumentero que es el grabo entrado.",
        "start": 2997.12,
        "end": 3000.12
    },
    {
        "text": " Apeo, pero el presidente es el basic,",
        "start": 3000.12,
        "end": 3004.12
    },
    {
        "text": " es orenimercine.",
        "start": 3004.12,
        "end": 3007.12
    },
    {
        "text": " Sí.",
        "start": 3007.12,
        "end": 3009.12
    },
    {
        "text": " ¿Por qué como harías esto?",
        "start": 3009.12,
        "end": 3011.12
    },
    {
        "text": " Con el grafo, como te viene, representaba naturalmente.",
        "start": 3011.12,
        "end": 3014.12
    },
    {
        "text": " Recorrez cada uno de los vértices.",
        "start": 3014.12,
        "end": 3016.12
    },
    {
        "text": " Para cada uno de los vértices, recorrez la lista de asociencia",
        "start": 3016.12,
        "end": 3020.12
    },
    {
        "text": " de aristas entrantes,",
        "start": 3020.12,
        "end": 3023.12
    },
    {
        "text": " ingresos, ingresos, ingresos, ingresos.",
        "start": 3023.12,
        "end": 3026.12
    },
    {
        "text": " Y ahí contás.",
        "start": 3026.12,
        "end": 3028.12
    },
    {
        "text": " ¿Y qué es el conceso?",
        "start": 3028.12,
        "end": 3029.12
    },
    {
        "text": " Este tiene siete aristas y pin y lo guardo.",
        "start": 3029.12,
        "end": 3032.12
    },
    {
        "text": " Y bueno, en total lo que hice fue iterar sobre todos los vértices",
        "start": 3032.12,
        "end": 3037.12
    },
    {
        "text": " y para cada vértice, tiene sobre todos sus aristas.",
        "start": 3037.12,
        "end": 3039.12
    },
    {
        "text": " Y sí que en total, pasé por todas las aristas de grafos,",
        "start": 3039.12,
        "end": 3042.12
    },
    {
        "text": " o DM y por todos los vértices que es OD.",
        "start": 3042.12,
        "end": 3044.12
    },
    {
        "text": " Así que la inicialización de indeg, me lleva o de enemacen.",
        "start": 3044.12,
        "end": 3050.12
    },
    {
        "text": " No me saía como me pierde el grafo a la vez lo hice.",
        "start": 3050.12,
        "end": 3056.12
    },
    {
        "text": " Eso es lo contudo.",
        "start": 3056.12,
        "end": 3058.12
    },
    {
        "text": " Y cuando así se la análisis del tiempo de ejecución,",
        "start": 3058.12,
        "end": 3060.12
    },
    {
        "text": " tenés que explicar esto que estoy diciendo.",
        "start": 3060.12,
        "end": 3062.12
    },
    {
        "text": " Bueno, esta indeg.",
        "start": 3062.12,
        "end": 3064.12
    },
    {
        "text": " En la sala de fina así,",
        "start": 3064.12,
        "end": 3067.12
    },
    {
        "text": " de forma sencilla construirla cuánto tiempo llevo.",
        "start": 3067.12,
        "end": 3070.12
    },
    {
        "text": " Bueno, lo que acabo de explicar, me lleva tiempo o de enemacen.",
        "start": 3070.12,
        "end": 3074.12
    },
    {
        "text": " Ahora una vez que tengo indento de construir el conjunto S,",
        "start": 3074.12,
        "end": 3077.12
    },
    {
        "text": " bueno, eso es cuánto tiempo me llevo.",
        "start": 3078.12,
        "end": 3080.12
    },
    {
        "text": " Ahí me lleva ODN, tengo que recorrer la regla un D,",
        "start": 3080.12,
        "end": 3082.12
    },
    {
        "text": " y ver las entras en C, y las agregan una lista.",
        "start": 3082.12,
        "end": 3086.12
    },
    {
        "text": " Así que tengo un paso, el primero que es OD enemacen",
        "start": 3086.12,
        "end": 3089.12
    },
    {
        "text": " y el segundo que es ODN, el segundo que es ODN,",
        "start": 3089.12,
        "end": 3091.12
    },
    {
        "text": " la segunda la inicialización es ODNMAC.",
        "start": 3091.12,
        "end": 3094.12
    },
    {
        "text": " ¿Verdad?",
        "start": 3096.12,
        "end": 3097.12
    },
    {
        "text": " Me voy a entregar, ahí me crea mucho de flas.",
        "start": 3097.12,
        "end": 3100.12
    },
    {
        "text": " Bueno, más ruda sobre esto.",
        "start": 3108.12,
        "end": 3110.12
    },
    {
        "text": " Tengo un poco de flas.",
        "start": 3127.12,
        "end": 3129.12
    },
    {
        "text": " Bueno, con esto terminamos con el tema de gráficos dirigidos asiclicos",
        "start": 3138.12,
        "end": 3142.12
    },
    {
        "text": " y aeronetopológico, lo siguiente que van a contenir este capítulo",
        "start": 3142.12,
        "end": 3146.12
    },
    {
        "text": " son un par de ejercicios resuertos, como les decía,",
        "start": 3146.12,
        "end": 3149.12
    },
    {
        "text": " el primero bastante sencilla, más conceptual.",
        "start": 3149.12,
        "end": 3151.12
    },
    {
        "text": " Este otro segundo tiene mucho algoritme, de modelado,",
        "start": 3151.12,
        "end": 3154.12
    },
    {
        "text": " y está haciendo ejercicio difícil,",
        "start": 3154.12,
        "end": 3156.12
    },
    {
        "text": " pero no es un problema de la idea de que se puede hacer.",
        "start": 3156.12,
        "end": 3158.12
    },
    {
        "text": " Pero, si lo que pasa es que el tema de la idea es que se puede hacer",
        "start": 3158.12,
        "end": 3161.12
    },
    {
        "text": " el tema de la idea de que se puede hacer,",
        "start": 3161.12,
        "end": 3163.12
    },
    {
        "text": " que el tema de algoritme, de modelado,",
        "start": 3163.12,
        "end": 3165.12
    },
    {
        "text": " y está haciendo ejercicio difícil,",
        "start": 3165.12,
        "end": 3167.12
    },
    {
        "text": " pero está interesante.",
        "start": 3167.12,
        "end": 3169.12
    },
    {
        "text": " Lo siguiente que nos quede que teníamos que ir encarando esta semana",
        "start": 3175.12,
        "end": 3178.12
    },
    {
        "text": " es empezar a trabajar con algoritmos habidos que es el capítulo 4 del libro.",
        "start": 3178.12,
        "end": 3186.12
    },
    {
        "text": " Antes de eso, haremos una...",
        "start": 3194.12,
        "end": 3198.12
    },
    {
        "text": " Una saque está, no sé qué venimos bien de tiempo,",
        "start": 3198.12,
        "end": 3201.12
    },
    {
        "text": " hacemos una pausa de 5 minutos y le parece,",
        "start": 3201.12,
        "end": 3205.12
    },
    {
        "text": " son 9 y 10 y 9 y 4 reenanchamos con esto",
        "start": 3205.12,
        "end": 3211.12
    },
    {
        "text": " y la hago una introducción al tema de este,",
        "start": 3211.12,
        "end": 3214.12
    },
    {
        "text": " capaz que algún ejemplo más de grafos antes de liquidar con este tema.",
        "start": 3214.12,
        "end": 3220.12
    },
    {
        "text": " A veces, ¿piense conectados acá no más al...",
        "start": 3221.12,
        "end": 3225.12
    },
    {
        "text": " a esta misma granulación de zoom y encanchamos a 5 minutos?",
        "start": 3225.12,
        "end": 3232.12
    },
    {
        "text": " Bueno, estamos acá de vuelta, después del la pausa.",
        "start": 3251.12,
        "end": 3256.12
    },
    {
        "text": " Así que retomamos.",
        "start": 3257.12,
        "end": 3260.12
    },
    {
        "text": " Y...",
        "start": 3262.12,
        "end": 3263.12
    },
    {
        "text": " Y...",
        "start": 3263.12,
        "end": 3264.12
    },
    {
        "text": " Y...",
        "start": 3264.12,
        "end": 3265.12
    },
    {
        "text": " Y...",
        "start": 3265.12,
        "end": 3266.12
    },
    {
        "text": " Y...",
        "start": 3266.12,
        "end": 3267.12
    },
    {
        "text": " Y...",
        "start": 3267.12,
        "end": 3268.12
    },
    {
        "text": " Y...",
        "start": 3268.12,
        "end": 3269.12
    },
    {
        "text": " Y...",
        "start": 3269.12,
        "end": 3270.12
    },
    {
        "text": " Y...",
        "start": 3270.12,
        "end": 3271.12
    },
    {
        "text": " Y...",
        "start": 3271.12,
        "end": 3272.12
    },
    {
        "text": " Y...",
        "start": 3272.12,
        "end": 3273.12
    },
    {
        "text": " Y...",
        "start": 3273.12,
        "end": 3274.12
    },
    {
        "text": " Y...",
        "start": 3274.12,
        "end": 3275.12
    },
    {
        "text": " Y...",
        "start": 3275.12,
        "end": 3276.12
    },
    {
        "text": " Y...",
        "start": 3276.12,
        "end": 3277.12
    },
    {
        "text": " Y...",
        "start": 3277.12,
        "end": 3278.12
    },
    {
        "text": " Y...",
        "start": 3278.12,
        "end": 3279.12
    },
    {
        "text": " Antes de cambiar, el tema quería reenganchar con el punto de demostración",
        "start": 3280.12,
        "end": 3285.12
    },
    {
        "text": " de corrección del del Olimbo que hemos visto recién,",
        "start": 3285.12,
        "end": 3288.12
    },
    {
        "text": " la versión iterativa,",
        "start": 3288.12,
        "end": 3290.12
    },
    {
        "text": " que no estaba expresada, que yo se les mostré el algoritmo,",
        "start": 3290.12,
        "end": 3293.12
    },
    {
        "text": " pues la corrección es así como bien observaban en el libro",
        "start": 3293.12,
        "end": 3297.12
    },
    {
        "text": " la etapa de algoritmo recurcivo.",
        "start": 3297.12,
        "end": 3301.12
    },
    {
        "text": " Y...",
        "start": 3301.12,
        "end": 3303.12
    },
    {
        "text": " Y...",
        "start": 3303.12,
        "end": 3305.12
    },
    {
        "text": " Les había dicho que bueno, la versión iterativa de algoritmo",
        "start": 3310.12,
        "end": 3315.12
    },
    {
        "text": " podría ser así, es decir, para cada...",
        "start": 3315.12,
        "end": 3318.12
    },
    {
        "text": " creamos un camino vacío, para cada ahí de 1 hasta n,",
        "start": 3318.12,
        "end": 3322.12
    },
    {
        "text": " tomamos...",
        "start": 3322.12,
        "end": 3324.12
    },
    {
        "text": " ese que no tiene aristas entrantes, eliminamos sdg",
        "start": 3324.12,
        "end": 3328.12
    },
    {
        "text": " y lo haríamos a o.",
        "start": 3328.12,
        "end": 3331.12
    },
    {
        "text": " ¿Cómo sería una demostración de corrección en este caso?",
        "start": 3331.12,
        "end": 3335.12
    },
    {
        "text": " ¿Tá?",
        "start": 3335.12,
        "end": 3336.12
    },
    {
        "text": " Porque un movimiento de tiempo, no pueden realizar la versión recurcivo,",
        "start": 3336.12,
        "end": 3338.12
    },
    {
        "text": " la versión recurciva,",
        "start": 3338.12,
        "end": 3341.12
    },
    {
        "text": " y a partir de ahí reclamar que esta versión iterativa también es correcta.",
        "start": 3341.12,
        "end": 3345.12
    },
    {
        "text": " ¿Vale que o mostrar algún tipo de equivalencia entre las pasas que hace cada uno?",
        "start": 3345.12,
        "end": 3349.12
    },
    {
        "text": " O bueno, o analizar directamente este.",
        "start": 3349.12,
        "end": 3352.12
    },
    {
        "text": " La irresina había quedado un poco confuso en el aire y cómo se demostraría esto.",
        "start": 3352.12,
        "end": 3357.12
    },
    {
        "text": " Entonces, déjenme que les reenganchar con ese tema.",
        "start": 3357.12,
        "end": 3364.12
    },
    {
        "text": " Ah, sí, se llama así.",
        "start": 3369.12,
        "end": 3372.12
    },
    {
        "text": " Una...",
        "start": 3372.12,
        "end": 3374.12
    },
    {
        "text": " Una demostración podría ser así.",
        "start": 3377.12,
        "end": 3380.12
    },
    {
        "text": " Es decir, para meter un poco de notación, vamos a esa mala, leje su V.",
        "start": 3380.12,
        "end": 3383.12
    },
    {
        "text": " Ay, profe, disculpa, no estás compartiendo de la pantalla, no sé si sí.",
        "start": 3386.12,
        "end": 3390.12
    },
    {
        "text": " Ah, perdón, perdón, perdón.",
        "start": 3390.12,
        "end": 3392.12
    },
    {
        "text": " Qué bueno, esa versión.",
        "start": 3392.12,
        "end": 3394.12
    },
    {
        "text": " Ahora un poquito.",
        "start": 3394.12,
        "end": 3395.12
    },
    {
        "text": " Ah, ahora sí, ¿no?",
        "start": 3407.12,
        "end": 3409.12
    },
    {
        "text": " Sí, sí, ahora sí.",
        "start": 3409.12,
        "end": 3411.12
    },
    {
        "text": " Gracias por el aviso, sino tampoco iba a quedar muy claro esta vez.",
        "start": 3411.12,
        "end": 3415.12
    },
    {
        "text": " Pero un poquito.",
        "start": 3415.12,
        "end": 3417.12
    },
    {
        "text": " Entonces, salimos dicho...",
        "start": 3418.12,
        "end": 3420.12
    },
    {
        "text": " Este es el algoritmo, ¿no?",
        "start": 3421.12,
        "end": 3425.12
    },
    {
        "text": " Es decir, creamos el conjunto vacío para cada ahí de uno hasta N.",
        "start": 3425.12,
        "end": 3429.12
    },
    {
        "text": " Tomamos un S que no hay que tener pistas entrantes, ¿no?",
        "start": 3429.12,
        "end": 3433.12
    },
    {
        "text": " Y lo agregamos a el oran topológico y no vamos eliminando de G.",
        "start": 3433.12,
        "end": 3438.12
    },
    {
        "text": " Esa sería la versión iterativa del algoritmo.",
        "start": 3438.12,
        "end": 3442.12
    },
    {
        "text": " Así, siempre ocuparnos de estructuras auxiliares para ver cómo...",
        "start": 3442.12,
        "end": 3448.12
    },
    {
        "text": " Para ver cómo implementarlo eficientemente.",
        "start": 3449.12,
        "end": 3451.12
    },
    {
        "text": " ¿No?",
        "start": 3451.12,
        "end": 3453.12
    },
    {
        "text": " ¿Por qué eso es correcto?",
        "start": 3453.12,
        "end": 3454.12
    },
    {
        "text": " Toma, ¿por qué funciona bien?",
        "start": 3457.12,
        "end": 3459.12
    },
    {
        "text": " Como les decía, para poner un poco de notación y facilitar la discusión,",
        "start": 3461.12,
        "end": 3466.12
    },
    {
        "text": " no quedar de vuelta así en el aire,",
        "start": 3466.12,
        "end": 3468.12
    },
    {
        "text": " podemos a mala, leje su V,",
        "start": 3468.12,
        "end": 3471.12
    },
    {
        "text": " al grafo al inicio de literación I.",
        "start": 3471.12,
        "end": 3473.12
    },
    {
        "text": " Vamos a G, el grafo original es el G sub 1,",
        "start": 3474.12,
        "end": 3477.12
    },
    {
        "text": " y a partir de ahí, bueno, cada literación sube borro algún vértice,",
        "start": 3477.12,
        "end": 3481.12
    },
    {
        "text": " que le vamos a samar ese sub y.",
        "start": 3484.12,
        "end": 3486.12
    },
    {
        "text": " O sea, ese sub y es el vértice elegido en esa iteración.",
        "start": 3486.12,
        "end": 3489.12
    },
    {
        "text": " Entonces, el algoritmo es en cada iteración el hijo vértice",
        "start": 3489.12,
        "end": 3492.12
    },
    {
        "text": " que el estudio matando ese sub y lo borro.",
        "start": 3492.12,
        "end": 3496.12
    },
    {
        "text": " Entonces, primero, la salación que hacemos recién,",
        "start": 3498.12,
        "end": 3502.12
    },
    {
        "text": " es un dar, o sea, no tiene ciclos,",
        "start": 3502.12,
        "end": 3507.12
    },
    {
        "text": " porque C es un dar y el unido esté haciendo sacando cosas,",
        "start": 3507.12,
        "end": 3512.12
    },
    {
        "text": " o sea, ciclos ahí no van a aparecer.",
        "start": 3512.12,
        "end": 3515.12
    },
    {
        "text": " Entonces, existe ese sub y.",
        "start": 3515.12,
        "end": 3520.12
    },
    {
        "text": " Siempre voy a ir encontrando uno.",
        "start": 3520.12,
        "end": 3525.12
    },
    {
        "text": " Y uno distinto, además, que el anterior lo fui borrando con cada iteración.",
        "start": 3525.12,
        "end": 3530.12
    },
    {
        "text": " Lo único que pasa es que, efectivamente, en cada iteración",
        "start": 3530.12,
        "end": 3535.12
    },
    {
        "text": " voy a poder encontrar un vértice que no tiene lista central.",
        "start": 3535.12,
        "end": 3539.12
    },
    {
        "text": " Está la duda que habría, si eso lo que estoy construyendo,",
        "start": 3539.12,
        "end": 3542.12
    },
    {
        "text": " es un orden topológico.",
        "start": 3542.12,
        "end": 3545.12
    },
    {
        "text": " Es una cosa que lo voy a hacer,",
        "start": 3545.12,
        "end": 3547.12
    },
    {
        "text": " es que lo voy a hacer,",
        "start": 3547.12,
        "end": 3549.12
    },
    {
        "text": " es que lo voy a hacer,",
        "start": 3549.12,
        "end": 3551.12
    },
    {
        "text": " y lo que pasa es que cuando es un orden topológico,",
        "start": 3551.12,
        "end": 3556.12
    },
    {
        "text": " esa es la duda.",
        "start": 3556.12,
        "end": 3558.12
    },
    {
        "text": " Ahora, miremos las salistas salientes de ese sub y.",
        "start": 3558.12,
        "end": 3563.12
    },
    {
        "text": " Lo que quiero ver es que las salistas salientes de ese sub y",
        "start": 3563.12,
        "end": 3566.12
    },
    {
        "text": " solo pueden ir hacia adelante.",
        "start": 3566.12,
        "end": 3569.12
    },
    {
        "text": " Lo que digo es que no pueden ir hacia un ese subjota,",
        "start": 3569.12,
        "end": 3574.12
    },
    {
        "text": " con un jota menor que ahí,",
        "start": 3574.12,
        "end": 3577.12
    },
    {
        "text": " porque cuando tomé ese subjote en alguna iteración anterior,",
        "start": 3577.12,
        "end": 3580.12
    },
    {
        "text": " elante se enje su jota.",
        "start": 3580.12,
        "end": 3583.12
    },
    {
        "text": " Pero en ese momento, cuando elegí ese subjota",
        "start": 3598.12,
        "end": 3601.12
    },
    {
        "text": " que no tenía lista central,",
        "start": 3601.12,
        "end": 3603.12
    },
    {
        "text": " las salistas salientes de ese sub y estaban todas.",
        "start": 3603.12,
        "end": 3606.12
    },
    {
        "text": " No había borrado ninguna de esas.",
        "start": 3606.12,
        "end": 3608.12
    },
    {
        "text": " En ese subito, había no lo elegí de la origen de la iteración y.",
        "start": 3608.12,
        "end": 3613.12
    },
    {
        "text": " Entonces, ¿quién sigue cuando, en ninguna de esas aristas",
        "start": 3613.12,
        "end": 3616.12
    },
    {
        "text": " que salían de ese sub y,",
        "start": 3616.12,
        "end": 3619.12
    },
    {
        "text": " incidía en ese subjota?",
        "start": 3619.12,
        "end": 3622.12
    },
    {
        "text": " Porque si no, ese subjota tendría aristas entrantes",
        "start": 3622.12,
        "end": 3628.12
    },
    {
        "text": " en la iteración jota cuando fue elegí.",
        "start": 3628.12,
        "end": 3632.12
    },
    {
        "text": " Entonces, todas las aristas de ese subí de hecho van",
        "start": 3632.12,
        "end": 3636.12
    },
    {
        "text": " hacia adelante, no pueden ir hacia atrás.",
        "start": 3636.12,
        "end": 3639.12
    },
    {
        "text": " Así que lo que construyo es un orbe topológico.",
        "start": 3639.12,
        "end": 3642.12
    },
    {
        "text": " Esto sería, por ejemplo, un análisis de la versión iterativa de Rodorite.",
        "start": 3642.12,
        "end": 3647.12
    },
    {
        "text": " Pero ahora se ha quedado más clara por recién que he dado todo confuso.",
        "start": 3647.12,
        "end": 3652.12
    },
    {
        "text": " Y no, no está complicado.",
        "start": 3652.12,
        "end": 3658.12
    },
    {
        "text": " ¿Se entendió?",
        "start": 3658.12,
        "end": 3660.12
    },
    {
        "text": " ¿Se entendió?",
        "start": 3660.12,
        "end": 3662.12
    },
    {
        "text": " ¿Se entendió?",
        "start": 3662.12,
        "end": 3663.12
    },
    {
        "text": " Gracias.",
        "start": 3663.12,
        "end": 3666.12
    },
    {
        "text": " Bueno, este y le presentes el el mismo de Can,",
        "start": 3674.12,
        "end": 3676.12
    },
    {
        "text": " que se está acá en el libro.",
        "start": 3676.12,
        "end": 3677.12
    },
    {
        "text": " Se puso también de FES para construir orbe topológico.",
        "start": 3677.12,
        "end": 3685.12
    },
    {
        "text": " En el caso de DFS,",
        "start": 3685.12,
        "end": 3687.12
    },
    {
        "text": " lo vamos haciendo es construir como el orden topológico en sentido inverso.",
        "start": 3687.12,
        "end": 3693.12
    },
    {
        "text": " Es decir, la sociedad va a preguntar más y más y más un rato.",
        "start": 3693.12,
        "end": 3696.12
    },
    {
        "text": " Bueno, también hay vértices que no tiene aristas aliente.",
        "start": 3696.12,
        "end": 3699.12
    },
    {
        "text": " Bueno, efectivamente eso es así.",
        "start": 3699.12,
        "end": 3701.12
    },
    {
        "text": " Entonces, puedo usar DFS.",
        "start": 3701.12,
        "end": 3705.12
    },
    {
        "text": " No me voy a poner a hacerlo, pero no es muy complicado.",
        "start": 3705.12,
        "end": 3708.12
    },
    {
        "text": " Hacemos una recorea, vamos haciendo una recorea de FES sobre los vértices.",
        "start": 3708.12,
        "end": 3713.12
    },
    {
        "text": " Recordemos todos los vértices y vamos,",
        "start": 3714.12,
        "end": 3716.12
    },
    {
        "text": " samando DFS en los que no están quedando explorados.",
        "start": 3716.12,
        "end": 3719.12
    },
    {
        "text": " Y claro, cuando DFS, cuando llegamos al final,",
        "start": 3719.12,
        "end": 3722.12
    },
    {
        "text": " que no podemos avanzar más, bueno, ese DFS lo dejamos como al final del orden topológico,",
        "start": 3722.12,
        "end": 3728.12
    },
    {
        "text": " pues no tiene aristas aliente para seguir.",
        "start": 3728.12,
        "end": 3731.12
    },
    {
        "text": " Que puedo mover hacia atrás y siendo hacia atrás en la recorea de FES,",
        "start": 3731.12,
        "end": 3738.12
    },
    {
        "text": " cada vez que terminamos de explorar un nodo,",
        "start": 3738.12,
        "end": 3740.12
    },
    {
        "text": " lo vamos como agregando el principio.",
        "start": 3740.12,
        "end": 3742.12
    },
    {
        "text": " O sea, como que el orden topológico lo vamos construyendo desde el final hacia el principio.",
        "start": 3742.12,
        "end": 3747.12
    },
    {
        "text": " Piense lo si quieren, no es demasiado complicado.",
        "start": 3747.12,
        "end": 3751.12
    },
    {
        "text": " Y es otra forma, es una aplicación de DFS, también interesante,",
        "start": 3753.12,
        "end": 3758.12
    },
    {
        "text": " es otra forma de construir un orden topológico.",
        "start": 3758.12,
        "end": 3763.12
    },
    {
        "text": " Eso no está en el libro, pero...",
        "start": 3764.12,
        "end": 3771.12
    },
    {
        "text": " Es muy complicada.",
        "start": 3775.12,
        "end": 3777.12
    },
    {
        "text": " Ya alguna de las generadoras eso,",
        "start": 3777.12,
        "end": 3781.12
    },
    {
        "text": " navísis y lo atacamos expresamente.",
        "start": 3781.12,
        "end": 3788.12
    },
    {
        "text": " Bueno, como les decía, lo que tenemos que empezar a pensar ahora es en cambiar de tema.",
        "start": 3789.12,
        "end": 3800.12
    },
    {
        "text": " Un poco tratando de mantener el ritmo de avance,",
        "start": 3800.12,
        "end": 3804.12
    },
    {
        "text": " de semana, semana de las lecturas y del estudio.",
        "start": 3804.12,
        "end": 3809.12
    },
    {
        "text": " Lo que tenemos previsto ya esta semana,",
        "start": 3809.12,
        "end": 3812.12
    },
    {
        "text": " empezar con algoritmos gridi, algoritmos abrios o jugoráses que ha introducido acá.",
        "start": 3812.12,
        "end": 3819.12
    },
    {
        "text": " Que es una técnica de diseño de algoritmos?",
        "start": 3819.12,
        "end": 3824.12
    },
    {
        "text": " Les había comentado que en el curso, con un lado estudiamos algoritmos,",
        "start": 3824.12,
        "end": 3828.12
    },
    {
        "text": " BFS, BFS, etcétera, que son muy bien clásicos.",
        "start": 3828.12,
        "end": 3831.12
    },
    {
        "text": " Y también esperemos técnicas de diseño de algoritmos y la técnica de diseño de algoritmos gridi o abidos.",
        "start": 3831.12,
        "end": 3838.12
    },
    {
        "text": " Es una de ellas.",
        "start": 3839.12,
        "end": 3841.12
    },
    {
        "text": " Que bueno, como les decía acá y lo resalté, no es sencillo definir que es algoritmo gridi.",
        "start": 3846.12,
        "end": 3852.12
    },
    {
        "text": " Es algo que está ahí un poco en una nube medio difusa.",
        "start": 3852.12,
        "end": 3859.12
    },
    {
        "text": " Pero básicamente son algoritmos que son enfocados en decisiones locales.",
        "start": 3860.12,
        "end": 3869.12
    },
    {
        "text": " Al menos en algunos casos pueden tener un preprocesamiento medio global,",
        "start": 3869.12,
        "end": 3873.12
    },
    {
        "text": " por ejemplo, ordenar los datos de algo de algún cierto criterio que me convenga.",
        "start": 3873.12,
        "end": 3878.12
    },
    {
        "text": " Pero después una vez que me largo a tratar de construir una solución que general van a ver que son problemas de optimización.",
        "start": 3878.12,
        "end": 3888.12
    },
    {
        "text": " Si vamos a estar buscando o minimizar algo o maximizar algo,",
        "start": 3889.12,
        "end": 3892.12
    },
    {
        "text": " o encontrar el conjunto más grande que esa tifase de tal cosa,",
        "start": 3892.12,
        "end": 3898.12
    },
    {
        "text": " o el más chico que esa tifase otra, es una noción de optimización.",
        "start": 3898.12,
        "end": 3903.12
    },
    {
        "text": " Y en los algoritmos estos hábitos o gridi,",
        "start": 3903.12,
        "end": 3907.12
    },
    {
        "text": " lo que termina pasando es que más allá eventualmente un preprocesamiento como las decía recién después es como que",
        "start": 3910.12,
        "end": 3916.12
    },
    {
        "text": " la algoritmo solo ve localmente una partecita del problema y todo una decisión así local,",
        "start": 3916.12,
        "end": 3922.12
    },
    {
        "text": " restringida a un vértice de grafo que estoy mirando en este momento o un elemento concreto de mis datos de entrada.",
        "start": 3922.12,
        "end": 3931.12
    },
    {
        "text": " Y en función de eso, el local que estoy mirando en eso momento,",
        "start": 3931.12,
        "end": 3934.12
    },
    {
        "text": " todo una decisión y así paso por paso, después tomo otra decisión local y otra decisión local.",
        "start": 3934.12,
        "end": 3941.12
    },
    {
        "text": " Y al final termino con una solución óptima,",
        "start": 3942.12,
        "end": 3946.12
    },
    {
        "text": " a pesar de que nunca mire todo el bosque,",
        "start": 3947.12,
        "end": 3953.12
    },
    {
        "text": " es como, bueno, justamente eso, como si yo pudiera, en vez de ver el bosque,",
        "start": 3954.12,
        "end": 3959.12
    },
    {
        "text": " en mí lo largo de la mitad estoy parado y de todos modos logro una solución óptima,",
        "start": 3959.12,
        "end": 3967.12
    },
    {
        "text": " a pesar de que nunca me preocupé de mirar todo el panorama completo.",
        "start": 3968.12,
        "end": 3973.12
    },
    {
        "text": " Eso solo va a funcionar y imagínense en para determinados problemas,",
        "start": 3974.12,
        "end": 3980.12
    },
    {
        "text": " cuya estructura habilita semejante cosa,",
        "start": 3980.12,
        "end": 3983.12
    },
    {
        "text": " en otros tipos de problemas eso no va a ser posible.",
        "start": 3983.12,
        "end": 3988.12
    },
    {
        "text": " Cuando es posible, buenísimo, pues tenemos un algoritmo super sencillo,",
        "start": 3988.12,
        "end": 3991.12
    },
    {
        "text": " en general además, es ficiente,",
        "start": 3991.12,
        "end": 3994.12
    },
    {
        "text": " bueno, muchas veces es ficiente porque analizar lo igualmente algo suele implicar desafíos computacionales",
        "start": 3995.12,
        "end": 4004.12
    },
    {
        "text": " más grandes que mirar localmente algo,",
        "start": 4004.12,
        "end": 4007.12
    },
    {
        "text": " antes de cuando encontramos un algoritmo abido,",
        "start": 4007.12,
        "end": 4010.12
    },
    {
        "text": " está buenísimo porque los algoritmos son eficientes en general,",
        "start": 4011.12,
        "end": 4016.12
    },
    {
        "text": " también son suelen ser sencillos y además,",
        "start": 4016.12,
        "end": 4020.12
    },
    {
        "text": " muchas veces tenemos aprendiendo algo sobre el problema en sí,",
        "start": 4020.12,
        "end": 4023.12
    },
    {
        "text": " porque el hecho de que funciona un algoritmo de esta naturaleza,",
        "start": 4023.12,
        "end": 4029.12
    },
    {
        "text": " en general, está asociado una estructura fuerte de su exacente en el problema.",
        "start": 4029.12,
        "end": 4034.12
    },
    {
        "text": " Bueno, ese es el tipo de cosa que vamos a estar bien.",
        "start": 4037.12,
        "end": 4043.12
    },
    {
        "text": " Que ya abril el chat por la goda que había estudiado tanto algo.",
        "start": 4051.12,
        "end": 4055.12
    },
    {
        "text": " No es una técnica fácil a pesar de lo que parece.",
        "start": 4060.12,
        "end": 4067.12
    },
    {
        "text": " Lo que sí fácil es proponer algoritmos ávidos,",
        "start": 4067.12,
        "end": 4071.12
    },
    {
        "text": " porque por tirar, no es así,",
        "start": 4071.12,
        "end": 4075.12
    },
    {
        "text": " y es el poder ocurrir cosas de,",
        "start": 4075.12,
        "end": 4077.12
    },
    {
        "text": " comparo acá y acá y decidio y va un río,",
        "start": 4078.12,
        "end": 4083.12
    },
    {
        "text": " lo que suele no ser fácil es que esas cosas también funcionan,",
        "start": 4084.12,
        "end": 4090.12
    },
    {
        "text": " para más convencerse de qué funciona,",
        "start": 4090.12,
        "end": 4093.12
    },
    {
        "text": " decir, demostrar que lo mismo es correcto,",
        "start": 4093.12,
        "end": 4097.12
    },
    {
        "text": " así que a pesar de que están mirando localmente cada vez,",
        "start": 4097.12,
        "end": 4101.12
    },
    {
        "text": " termina construcción de una solución que es globalmente óptico.",
        "start": 4101.12,
        "end": 4104.12
    },
    {
        "text": " Eso, muchas veces no es sencillo.",
        "start": 4106.12,
        "end": 4110.12
    },
    {
        "text": " Una pregunta. ¿Vale? ¿Qué tiene una herramienta de cómo nos va a utilizar?",
        "start": 4111.12,
        "end": 4117.12
    },
    {
        "text": " ¿Vale? ¿Qué tipo de unimo va a probar la cosa y tiene más circunstancias de inducción?",
        "start": 4117.12,
        "end": 4124.12
    },
    {
        "text": " No necesariamente, pero suele ser una herramienta útil a las demostaciones por indicción.",
        "start": 4125.12,
        "end": 4132.12
    },
    {
        "text": " Sí. ¿No es la única forma?",
        "start": 4133.12,
        "end": 4136.12
    },
    {
        "text": " No, no, no, no es la única forma.",
        "start": 4137.12,
        "end": 4139.12
    },
    {
        "text": " Nada, maíz. Está abierto a lo que se nos ocurra.",
        "start": 4140.12,
        "end": 4146.12
    },
    {
        "text": " Pero sí, yo le sé,",
        "start": 4146.12,
        "end": 4148.12
    },
    {
        "text": " sobremos caer una y otra vez en hacer de más transiciones por inducción para ese tipo de demostraciones.",
        "start": 4150.12,
        "end": 4156.12
    },
    {
        "text": " ¿Por qué? Bueno, por esto es que",
        "start": 4157.12,
        "end": 4160.12
    },
    {
        "text": " yo estoy tomando decisiones locales y quiero ver que",
        "start": 4161.12,
        "end": 4164.12
    },
    {
        "text": " globalmente me ha hecho una solución ápima.",
        "start": 4165.12,
        "end": 4168.12
    },
    {
        "text": " Y eso, muchas veces, es préstaba una demostración por indicción,",
        "start": 4168.12,
        "end": 4171.12
    },
    {
        "text": " porque yo decía, bueno, asumiendo que la primera,",
        "start": 4171.12,
        "end": 4173.12
    },
    {
        "text": " con mi primera decisión no rompina nada,",
        "start": 4173.12,
        "end": 4176.12
    },
    {
        "text": " así que estoy construciendo algo que puede ser globalmente óptimo,",
        "start": 4176.12,
        "end": 4179.12
    },
    {
        "text": " asumiendo eso por inducción,",
        "start": 4179.12,
        "end": 4181.12
    },
    {
        "text": " puedo demostrar que la siguiente decisión local que tomo",
        "start": 4182.12,
        "end": 4185.12
    },
    {
        "text": " también es bueno, no rompo nada,",
        "start": 4186.12,
        "end": 4188.12
    },
    {
        "text": " disigo, en el camino de construir algo óptimo.",
        "start": 4188.12,
        "end": 4190.12
    },
    {
        "text": " Y entonces, al final por inducción,",
        "start": 4191.12,
        "end": 4193.12
    },
    {
        "text": " lo termina mostrando que",
        "start": 4193.12,
        "end": 4195.12
    },
    {
        "text": " nuestra solución funciona, nuestra solución es nuestro algoritmo,",
        "start": 4197.12,
        "end": 4200.12
    },
    {
        "text": " esa producción de solución.",
        "start": 4200.12,
        "end": 4202.12
    },
    {
        "text": " Entonces, por eso es que sí, muchas veces aparecen de mostraciones por inducción.",
        "start": 4204.12,
        "end": 4207.12
    },
    {
        "text": " Acá es una buena salvación.",
        "start": 4207.12,
        "end": 4209.12
    },
    {
        "text": " Pero que, ¿están no son los algoritmos,",
        "start": 4210.12,
        "end": 4213.12
    },
    {
        "text": " algoritmos, algoritmos?",
        "start": 4213.12,
        "end": 4215.12
    },
    {
        "text": " No, no.",
        "start": 4215.12,
        "end": 4217.12
    },
    {
        "text": " Y eso otra cosa bien.",
        "start": 4217.12,
        "end": 4219.12
    },
    {
        "text": " No, no, no, no.",
        "start": 4219.12,
        "end": 4221.12
    },
    {
        "text": " A ver, sí, no.",
        "start": 4221.12,
        "end": 4223.12
    },
    {
        "text": " Los algoritmos algoritmos,",
        "start": 4223.12,
        "end": 4225.12
    },
    {
        "text": " pueden ser algoritmos gris.",
        "start": 4225.12,
        "end": 4227.12
    },
    {
        "text": " Pero no son solo gris, son algoritmos,",
        "start": 4229.12,
        "end": 4232.12
    },
    {
        "text": " en general, las algoritmas no se dan garantía de...",
        "start": 4232.12,
        "end": 4236.12
    },
    {
        "text": " Claro.",
        "start": 4237.12,
        "end": 4238.12
    },
    {
        "text": " De mejoría.",
        "start": 4239.12,
        "end": 4240.12
    },
    {
        "text": " Es de garantía que vas a ser óptimo.",
        "start": 4240.12,
        "end": 4242.12
    },
    {
        "text": " En este caso, lo vamos a estudiar, no solo son algoritmos,",
        "start": 4245.12,
        "end": 4247.12
    },
    {
        "text": " que son gris, son hábidos.",
        "start": 4247.12,
        "end": 4249.12
    },
    {
        "text": " Y no es una urística que, si tengo suerte,",
        "start": 4252.12,
        "end": 4255.12
    },
    {
        "text": " termina con algo salcán al óptimo.",
        "start": 4255.12,
        "end": 4257.12
    },
    {
        "text": " Son óptimos.",
        "start": 4258.12,
        "end": 4259.12
    },
    {
        "text": " Producen una solución óptima.",
        "start": 4260.12,
        "end": 4262.12
    },
    {
        "text": " Eso no es siempre posible.",
        "start": 4263.12,
        "end": 4265.12
    },
    {
        "text": " Hay problemas de optimización.",
        "start": 4267.12,
        "end": 4269.12
    },
    {
        "text": " Que van a ver sobre el final del curso.",
        "start": 4270.12,
        "end": 4273.12
    },
    {
        "text": " No se siquiera se conoce ni hay esperanza de conocer",
        "start": 4275.12,
        "end": 4278.12
    },
    {
        "text": " en el corto plazo, soluciones de tiempo policial.",
        "start": 4279.12,
        "end": 4282.12
    },
    {
        "text": " Y bueno, parece tipo de problemas.",
        "start": 4282.12,
        "end": 4284.12
    },
    {
        "text": " A veces no queda otra que recurrir algún tipo de urística,",
        "start": 4284.12,
        "end": 4288.12
    },
    {
        "text": " que puede tener un diseño gríbil,",
        "start": 4289.12,
        "end": 4292.12
    },
    {
        "text": " en el sentido de que cada vez tomo una decisión local,",
        "start": 4292.12,
        "end": 4294.12
    },
    {
        "text": " pero que no tienes certeza de que te vas a dar...",
        "start": 4294.12,
        "end": 4297.12
    },
    {
        "text": " Nada, a veces luego, alúen experimentamente.",
        "start": 4298.12,
        "end": 4300.12
    },
    {
        "text": " Bueno, pues, con varios casos reales",
        "start": 4300.12,
        "end": 4303.12
    },
    {
        "text": " y veo que realmente da algo bien,",
        "start": 4303.12,
        "end": 4305.12
    },
    {
        "text": " personable, pero no tienes garantías de nada.",
        "start": 4306.12,
        "end": 4308.12
    },
    {
        "text": " También existe que en el libro se trata,",
        "start": 4309.12,
        "end": 4312.12
    },
    {
        "text": " nosotros llegamos a tocarlo muy tangencialmente,",
        "start": 4312.12,
        "end": 4316.12
    },
    {
        "text": " pero que son algoritmos de aproximaciones.",
        "start": 4316.12,
        "end": 4319.12
    },
    {
        "text": " Y a veces, bueno, tenés esa esperanza de construir una solución",
        "start": 4319.12,
        "end": 4323.12
    },
    {
        "text": " garantidamente óptima en tiempo policial,",
        "start": 4324.12,
        "end": 4327.12
    },
    {
        "text": " pero puedes tener una de borinco",
        "start": 4328.12,
        "end": 4331.12
    },
    {
        "text": " que te da una solución con ciertas garantías.",
        "start": 4331.12,
        "end": 4334.12
    },
    {
        "text": " Por ejemplo, esto no está...",
        "start": 4334.12,
        "end": 4336.12
    },
    {
        "text": " No sé, pues si estás tratando de maximizar algo,",
        "start": 4339.12,
        "end": 4344.12
    },
    {
        "text": " y decir, bueno, esto...",
        "start": 4345.12,
        "end": 4347.12
    },
    {
        "text": " Capas que no se gase al máximo,",
        "start": 4347.12,
        "end": 4349.12
    },
    {
        "text": " pero no puede ser más chico,",
        "start": 4349.12,
        "end": 4352.12
    },
    {
        "text": " que no sé, que cuatro quintos del óptico.",
        "start": 4352.12,
        "end": 4354.12
    },
    {
        "text": " Entonces, si bueno, la solución que veo tener",
        "start": 4354.12,
        "end": 4357.12
    },
    {
        "text": " no te va garantías de que sea la mejor posible,",
        "start": 4357.12,
        "end": 4362.12
    },
    {
        "text": " pero por lo menos tengo ciertas certeza probadas matemáticamente",
        "start": 4363.12,
        "end": 4369.12
    },
    {
        "text": " y que no va a estar demasiado lejos del óptico.",
        "start": 4369.12,
        "end": 4374.12
    },
    {
        "text": " Y eso, incluso a veces, se puede retomar después,",
        "start": 4374.12,
        "end": 4377.12
    },
    {
        "text": " parece que bueno, ahí empieza a sabiendo qué están lejos,",
        "start": 4377.12,
        "end": 4381.12
    },
    {
        "text": " estoy de la solución, que me puedo aplicar a otro tipo de",
        "start": 4381.12,
        "end": 4384.12
    },
    {
        "text": " bristias para tratar de arrimar un poco más y siempre tengo",
        "start": 4384.12,
        "end": 4387.12
    },
    {
        "text": " alguna noción de qué están lejos por lo menos estoy de del óptico.",
        "start": 4387.12,
        "end": 4390.12
    },
    {
        "text": " Después hay muchas servicios que, sencillamente,",
        "start": 4390.12,
        "end": 4393.12
    },
    {
        "text": " no tienen idea de qué están lejos o sea,",
        "start": 4393.12,
        "end": 4396.12
    },
    {
        "text": " qué estás del duque, de lo que podrías aspirar.",
        "start": 4396.12,
        "end": 4402.12
    },
    {
        "text": " Pero lo que vamos a ver nosotros,",
        "start": 4404.12,
        "end": 4406.12
    },
    {
        "text": " ahora en este capítulo, en este curso,",
        "start": 4406.12,
        "end": 4409.12
    },
    {
        "text": " son algoritmos que al mismo tiempo son problemas para los cuales",
        "start": 4409.12,
        "end": 4414.12
    },
    {
        "text": " uno puede encontrar algoritmos ávidos que no son el bristias,",
        "start": 4414.12,
        "end": 4419.12
    },
    {
        "text": " que producen la solución óptima.",
        "start": 4419.12,
        "end": 4422.12
    },
    {
        "text": " Como les decía, de demostrar que efectivamente el algoritmo",
        "start": 4428.12,
        "end": 4432.12
    },
    {
        "text": " que si nos ocurrió es óptiva,",
        "start": 4432.12,
        "end": 4437.12
    },
    {
        "text": " eso suele, muchas veces no es sencillo,",
        "start": 4437.12,
        "end": 4440.12
    },
    {
        "text": " no sé por sorte, igual hay ciertas técnicas,",
        "start": 4440.12,
        "end": 4446.12
    },
    {
        "text": " las cuales uno puede recurrir.",
        "start": 4446.12,
        "end": 4449.12
    },
    {
        "text": " O sea, ciertos patrones de razonamiento para tratar de encarar",
        "start": 4449.12,
        "end": 4458.12
    },
    {
        "text": " este tipo de análisis.",
        "start": 4458.12,
        "end": 4462.12
    },
    {
        "text": " Y están de jítas acá en este libro,",
        "start": 4462.12,
        "end": 4466.12
    },
    {
        "text": " una vez lo que vamos a llamar en inglés,",
        "start": 4466.12,
        "end": 4470.12
    },
    {
        "text": " Staya Hale, es que de esta tarde ver que nuestro algoritmo",
        "start": 4470.12,
        "end": 4473.12
    },
    {
        "text": " se mantiene siempre por delante de una solución óptica.",
        "start": 4473.12,
        "end": 4478.12
    },
    {
        "text": " El sirver, yo voy tomando decisiones locales,",
        "start": 4478.12,
        "end": 4482.12
    },
    {
        "text": " chiquitas una por una y ver que pensar en eso como una especie de carrega",
        "start": 4482.12,
        "end": 4486.12
    },
    {
        "text": " y compararme con una solución óptima,",
        "start": 4486.12,
        "end": 4489.12
    },
    {
        "text": " y ver que cada vez lo que produce mi algoritmo",
        "start": 4489.12,
        "end": 4494.12
    },
    {
        "text": " está siempre en la carrera,",
        "start": 4494.12,
        "end": 4497.12
    },
    {
        "text": " esa nunca se queda atrás.",
        "start": 4497.12,
        "end": 4499.12
    },
    {
        "text": " Entonces al final del camino tiene que ser.",
        "start": 4499.12,
        "end": 4503.12
    },
    {
        "text": " Otra técnica un poco más sofisticada a veces,",
        "start": 4506.12,
        "end": 4511.12
    },
    {
        "text": " es lo que llamamos un argumento de intercambio,",
        "start": 4514.12,
        "end": 4517.12
    },
    {
        "text": " es un exchange argumento,",
        "start": 4517.12,
        "end": 4520.12
    },
    {
        "text": " ver que, en todos los casos,",
        "start": 4521.12,
        "end": 4524.12
    },
    {
        "text": " siempre vamos a decir que queremos probar que nuestra solución es óptima",
        "start": 4524.12,
        "end": 4527.12
    },
    {
        "text": " y que vamos a arrancar con un bueno sea ó una solución óptima.",
        "start": 4527.12,
        "end": 4532.12
    },
    {
        "text": " Para fijar ideas, vamos a ver ahora un problema concreto,",
        "start": 4532.12,
        "end": 4538.12
    },
    {
        "text": " por ejemplo, de planificación de intervallos.",
        "start": 4538.12,
        "end": 4543.12
    },
    {
        "text": " De planificación de intervallos,",
        "start": 4543.12,
        "end": 4545.12
    },
    {
        "text": " creo que estaba de exclico entre los problemas,",
        "start": 4545.12,
        "end": 4547.12
    },
    {
        "text": " aquellos iniciales, como cinco problemas representativos,",
        "start": 4547.12,
        "end": 4551.12
    },
    {
        "text": " si no lo recuerva,",
        "start": 4551.12,
        "end": 4553.12
    },
    {
        "text": " es algo de este estilo, nos da un montón de intervallos",
        "start": 4553.12,
        "end": 4557.12
    },
    {
        "text": " que pueden estar solapados entre sí,",
        "start": 4557.12,
        "end": 4559.12
    },
    {
        "text": " y lo que queremos es elegir, lo que queremos hacer es elegir",
        "start": 4559.12,
        "end": 4562.12
    },
    {
        "text": " la máxima cantidad posible de intervallos que no se solapan entre sí.",
        "start": 4562.12,
        "end": 4566.12
    },
    {
        "text": " Por ejemplo, pueden ser pedidos de usos de la sala zoom,",
        "start": 4566.12,
        "end": 4571.12
    },
    {
        "text": " ahora que no te pueden hacer salones de clase,",
        "start": 4571.12,
        "end": 4574.12
    },
    {
        "text": " ahora van a hacer salas zoom, de tal hora a tal hora,",
        "start": 4574.12,
        "end": 4578.12
    },
    {
        "text": " queremos atender la mayor cantidad de pedidos,",
        "start": 4578.12,
        "end": 4582.12
    },
    {
        "text": " que no se solapan entre sí.",
        "start": 4582.12,
        "end": 4586.12
    },
    {
        "text": " Entonces, bueno, en general, nosotros vamos a decir,",
        "start": 4586.12,
        "end": 4592.12
    },
    {
        "text": " bueno, para razonar sobre esto sobre la optimalidad",
        "start": 4592.12,
        "end": 4596.12
    },
    {
        "text": " de las soluciones que producen nuestro algoritmo,",
        "start": 4596.12,
        "end": 4599.12
    },
    {
        "text": " o sea, o una solución optimista,",
        "start": 4599.12,
        "end": 4601.12
    },
    {
        "text": " en este caso, en este ejemplo,",
        "start": 4601.12,
        "end": 4603.12
    },
    {
        "text": " unos de meagres juntos intervanos,",
        "start": 4603.12,
        "end": 4605.12
    },
    {
        "text": " que no se solapan entre sí.",
        "start": 4605.12,
        "end": 4607.12
    },
    {
        "text": " O sea, o prima, o sea,",
        "start": 4609.12,
        "end": 4612.12
    },
    {
        "text": " lo que producen mi algoritmo.",
        "start": 4612.12,
        "end": 4614.12
    },
    {
        "text": " No tienen por qué ser iguales entre sí.",
        "start": 4617.12,
        "end": 4619.12
    },
    {
        "text": " Eso saquen si lo de la cabeza,",
        "start": 4619.12,
        "end": 4622.12
    },
    {
        "text": " es a desde el primer momento,",
        "start": 4622.12,
        "end": 4624.12
    },
    {
        "text": " en general, va a haber muchas soluciones óptimas,",
        "start": 4624.12,
        "end": 4627.12
    },
    {
        "text": " una tan buena como la otra,",
        "start": 4627.12,
        "end": 4629.12
    },
    {
        "text": " por ejemplo, no sé,",
        "start": 4629.12,
        "end": 4631.12
    },
    {
        "text": " la solución optimista tiene cuatro intervanos",
        "start": 4631.12,
        "end": 4633.12
    },
    {
        "text": " y yo produjo otra solución y tiene otros cuatro intervanos.",
        "start": 4633.12,
        "end": 4637.12
    },
    {
        "text": " Bueno, cualquiera es la dos vale,",
        "start": 4637.12,
        "end": 4639.12
    },
    {
        "text": " tiene la misma cantidad de intervanos al final.",
        "start": 4639.12,
        "end": 4642.12
    },
    {
        "text": " Entonces, el argumento intercambio consiste ver",
        "start": 4642.12,
        "end": 4645.12
    },
    {
        "text": " en que yo puedo transformar una y la otra,",
        "start": 4645.12,
        "end": 4648.12
    },
    {
        "text": " la óptima en la niña, por ejemplo,",
        "start": 4650.12,
        "end": 4652.12
    },
    {
        "text": " me da una serie de pasos, de transformaciones,",
        "start": 4653.12,
        "end": 4656.12
    },
    {
        "text": " y que en ninguna de esas transformaciones,",
        "start": 4657.12,
        "end": 4660.12
    },
    {
        "text": " pierdo la optimalidad.",
        "start": 4662.12,
        "end": 4664.12
    },
    {
        "text": " Entonces, los vemos es que,",
        "start": 4666.12,
        "end": 4668.12
    },
    {
        "text": " está bien, tengo dos soluciones distintas,",
        "start": 4668.12,
        "end": 4670.12
    },
    {
        "text": " una óptima y la niña.",
        "start": 4670.12,
        "end": 4672.12
    },
    {
        "text": " Y yo puedo barrar la óptima y ir la deformando,",
        "start": 4672.12,
        "end": 4676.12
    },
    {
        "text": " por ejemplo, en este caso, no sé,",
        "start": 4676.12,
        "end": 4678.12
    },
    {
        "text": " saco un intervalo y agrego otro,",
        "start": 4678.12,
        "end": 4680.12
    },
    {
        "text": " entonces no pierdo la última idea,",
        "start": 4680.12,
        "end": 4682.12
    },
    {
        "text": " porque la cantidad de intervanos la mantengo constante",
        "start": 4682.12,
        "end": 4685.12
    },
    {
        "text": " y pasito por pasito y transformándola en la niña.",
        "start": 4685.12,
        "end": 4688.12
    },
    {
        "text": " Y en este caso sería viendo que además no rompo",
        "start": 4688.12,
        "end": 4691.12
    },
    {
        "text": " el tema de que sean disjuntos entre sí los intervanos.",
        "start": 4691.12,
        "end": 4695.12
    },
    {
        "text": " Entonces, si logras hacer eso,",
        "start": 4695.12,
        "end": 4697.12
    },
    {
        "text": " si logramos tener que hay una cadenita de transformaciones",
        "start": 4697.12,
        "end": 4700.12
    },
    {
        "text": " donde nunca pongo a intervanos que se solápame entre sí",
        "start": 4700.12,
        "end": 4703.12
    },
    {
        "text": " y siempre mantengo la cantidad o decir algo.",
        "start": 4703.12,
        "end": 4706.12
    },
    {
        "text": " Entonces, muestro que ni solución",
        "start": 4706.12,
        "end": 4709.12
    },
    {
        "text": " es tan óptima como esa otra óptima que postulía.",
        "start": 4709.12,
        "end": 4712.12
    },
    {
        "text": " Entonces, esas son dos técnicas que hay presentadas acá.",
        "start": 4716.12,
        "end": 4728.12
    },
    {
        "text": " Se puede ver una tercera,",
        "start": 4728.12,
        "end": 4730.12
    },
    {
        "text": " incluso que podría ser encontrar analíticamente alguna cota",
        "start": 4730.12,
        "end": 4735.12
    },
    {
        "text": " para decir, bueno,",
        "start": 4735.12,
        "end": 4737.12
    },
    {
        "text": " pues no puede haber más de x cantidad de intervano y juntos",
        "start": 4737.12,
        "end": 4741.12
    },
    {
        "text": " donde equilo tengo expresado un función de algo de data",
        "start": 4741.12,
        "end": 4744.12
    },
    {
        "text": " y la data del problema",
        "start": 4744.12,
        "end": 4746.12
    },
    {
        "text": " y mostrar que mi algoritmo alcanza a ese x.",
        "start": 4746.12,
        "end": 4749.12
    },
    {
        "text": " Entonces, ahí no es que me compáven directamente una solución",
        "start": 4750.12,
        "end": 4753.12
    },
    {
        "text": " sino que me compárao con el mejor resultado que se puede obtener",
        "start": 4753.12,
        "end": 4756.12
    },
    {
        "text": " y el mejor resultado posible de alguna manera lo encontré",
        "start": 4756.12,
        "end": 4759.12
    },
    {
        "text": " analizando el problema.",
        "start": 4759.12,
        "end": 4761.12
    },
    {
        "text": " Ahora eso creo que no está tratado de esplicitamente.",
        "start": 4761.12,
        "end": 4764.12
    },
    {
        "text": " Pero sería otra forma de analizar este tipo de algoritmos.",
        "start": 4764.12,
        "end": 4769.12
    },
    {
        "text": " Dentro de este tema,",
        "start": 4769.12,
        "end": 4772.12
    },
    {
        "text": " de algoritmos gris y no se lo van a encontrar",
        "start": 4773.12,
        "end": 4776.12
    },
    {
        "text": " este tipo de ejemplos y este tipo de técnicas aplicadas",
        "start": 4776.12,
        "end": 4781.12
    },
    {
        "text": " para demostrar que nuestros algoritmos funcionan correctamente",
        "start": 4781.12,
        "end": 4784.12
    },
    {
        "text": " cuando son gris.",
        "start": 4784.12,
        "end": 4786.12
    },
    {
        "text": " Si no que más van a encontrar muchos ejemplos de algoritmos clásicos,",
        "start": 4786.12,
        "end": 4792.12
    },
    {
        "text": " algunas de esos sobregrafos, por ejemplo,",
        "start": 4792.12,
        "end": 4795.12
    },
    {
        "text": " que son ejemplos de aplicas de algoritmos gris",
        "start": 4795.12,
        "end": 4799.12
    },
    {
        "text": " y además, al algoritmo que hicimos,",
        "start": 4799.12,
        "end": 4802.12
    },
    {
        "text": " sabemos que hay que saber que forma un par de direte",
        "start": 4802.12,
        "end": 4805.12
    },
    {
        "text": " de hacer conocimiento importante en sí,",
        "start": 4805.12,
        "end": 4810.12
    },
    {
        "text": " en la computación que todo tendíamos que tener",
        "start": 4810.12,
        "end": 4814.12
    },
    {
        "text": " en la caja de herramientas.",
        "start": 4814.12,
        "end": 4816.12
    },
    {
        "text": " Por ejemplo, encontrar este camino más corto en un grafo,",
        "start": 4818.12,
        "end": 4822.12
    },
    {
        "text": " todo el tema de árboles de cubrimiento mínimo,",
        "start": 4822.12,
        "end": 4826.12
    },
    {
        "text": " que es también un tema súper importante en computación",
        "start": 4827.12,
        "end": 4831.12
    },
    {
        "text": " con montones de aplicaciones,",
        "start": 4831.12,
        "end": 4833.12
    },
    {
        "text": " hay algunos bien lindos para eso y también se pueden sonábidos.",
        "start": 4833.12,
        "end": 4838.12
    },
    {
        "text": " Entonces, estas cosas las van a ver más,",
        "start": 4839.12,
        "end": 4842.12
    },
    {
        "text": " estos ejemplos del gorismo,",
        "start": 4842.12,
        "end": 4844.12
    },
    {
        "text": " las van a ver más en detalle con Fernando o Fernández",
        "start": 4844.12,
        "end": 4847.12
    },
    {
        "text": " y otro profe del curso,",
        "start": 4847.12,
        "end": 4849.12
    },
    {
        "text": " que va a empezar a dar las clases a partir de la semana que viene.",
        "start": 4849.12,
        "end": 4853.12
    },
    {
        "text": " Así que mis clases de teórico,",
        "start": 4853.12,
        "end": 4857.12
    },
    {
        "text": " por lo menos llegan hasta hoy.",
        "start": 4857.12,
        "end": 4859.12
    },
    {
        "text": " Y para Fernando,",
        "start": 4859.12,
        "end": 4861.12
    },
    {
        "text": " les va a dar clases hasta el primer parcial",
        "start": 4861.12,
        "end": 4864.12
    },
    {
        "text": " y después de ahí, adelante, Javier,",
        "start": 4864.12,
        "end": 4866.12
    },
    {
        "text": " Valiocián y Carlos Testúrio van a dar otras partes del curso.",
        "start": 4866.12,
        "end": 4871.12
    },
    {
        "text": " Así que nos vamos a repartir los teóricos en el IV.",
        "start": 4871.12,
        "end": 4874.12
    },
    {
        "text": " En el libro también van a encontrar la construcción",
        "start": 4875.12,
        "end": 4878.12
    },
    {
        "text": " de árboles de Hathman, que es para hacer códigos",
        "start": 4878.12,
        "end": 4880.12
    },
    {
        "text": " para compresión de datos.",
        "start": 4880.12,
        "end": 4882.12
    },
    {
        "text": " Es súper interesante, pero no lo vamos a ver.",
        "start": 4882.12,
        "end": 4885.12
    },
    {
        "text": " Pues ya nos llevaría demasiado tiempo.",
        "start": 4885.12,
        "end": 4888.12
    },
    {
        "text": " Eso en el curso de teore de información que vamos a favoritar",
        "start": 4888.12,
        "end": 4891.12
    },
    {
        "text": " o el curso de compresión de datos,",
        "start": 4891.12,
        "end": 4893.12
    },
    {
        "text": " estas cosas las vemos.",
        "start": 4893.12,
        "end": 4895.12
    },
    {
        "text": " Está, bueno, todo suena más.",
        "start": 4898.12,
        "end": 4900.12
    },
    {
        "text": " ¿Qué crees, Javier?",
        "start": 4900.12,
        "end": 4901.12
    },
    {
        "text": " ¿Dicurba? ¿Qué crees, Javier?",
        "start": 4901.12,
        "end": 4903.12
    },
    {
        "text": " ¿Tú vas a hacer más de compresión de Hathman?",
        "start": 4903.12,
        "end": 4906.12
    },
    {
        "text": " No, no, no.",
        "start": 4906.12,
        "end": 4908.12
    },
    {
        "text": " No, no tengo idea así porque por eso trabajo en los recursos.",
        "start": 4908.12,
        "end": 4911.12
    },
    {
        "text": " Pero el información tiene más mapemático,",
        "start": 4911.12,
        "end": 4915.12
    },
    {
        "text": " tiene como previas probabilidades estadísticas.",
        "start": 4915.12,
        "end": 4919.12
    },
    {
        "text": " Y, bueno, por lo que sea alguna más,",
        "start": 4919.12,
        "end": 4923.12
    },
    {
        "text": " compresión de datos y tiene petrías, por ejemplo, como previas,",
        "start": 4923.12,
        "end": 4926.12
    },
    {
        "text": " porque hay bastante trabajo de pronovación también.",
        "start": 4926.12,
        "end": 4930.12
    },
    {
        "text": " Está, y este otro tema de árboles de perón,",
        "start": 4934.12,
        "end": 4939.12
    },
    {
        "text": " árboles de costo mínimo, que son como las mínimas,",
        "start": 4939.12,
        "end": 4942.12
    },
    {
        "text": " van entre pero para grazos dirigidos también es súper interesante,",
        "start": 4942.12,
        "end": 4947.12
    },
    {
        "text": " pero también se nos va de tiempo y lo que podríamos abarcar,",
        "start": 4947.12,
        "end": 4950.12
    },
    {
        "text": " así que no lo vamos a ver.",
        "start": 4950.12,
        "end": 4951.12
    },
    {
        "text": " Tan el libro si les interesa, este está muy tan bueno.",
        "start": 4951.12,
        "end": 4955.12
    },
    {
        "text": " Entonces quería eso ver con lo que nos queda de clase",
        "start": 4955.12,
        "end": 4959.12
    },
    {
        "text": " y ilustrarles, o sea, por lo menos para irlos entrando en tema,",
        "start": 4959.12,
        "end": 4964.12
    },
    {
        "text": " un problema concreto que es el de planificación de",
        "start": 4964.12,
        "end": 4968.12
    },
    {
        "text": " intervalos, el de encontrar intervalos mis juntos y tratar de buscar la máxima",
        "start": 4969.12,
        "end": 4972.12
    },
    {
        "text": " cantidad de intervalos posibles, lo que queremos es esto conjunto,",
        "start": 4972.12,
        "end": 4976.12
    },
    {
        "text": " los conjuntos compatibles, y el examen cuando no hay colisiones entre ellos,",
        "start": 4976.12,
        "end": 4980.12
    },
    {
        "text": " y son los más grandes posibles.",
        "start": 4980.12,
        "end": 4983.12
    },
    {
        "text": " Entonces, y lo vamos a ver, es un ejemplo de cómo aplicar esta técnica,",
        "start": 4983.12,
        "end": 4989.12
    },
    {
        "text": " la de que el algoritmo se mantiene por delante de una solución óptima.",
        "start": 4989.12,
        "end": 4996.12
    },
    {
        "text": " Entonces lo que se van a encontrar acá es para empezar varios intentos",
        "start": 4997.12,
        "end": 5008.12
    },
    {
        "text": " de diseño de algoritmos gridi, varios de esos que fasa.",
        "start": 5008.12,
        "end": 5013.12
    },
    {
        "text": " En todos los casos, como les decía, la cosa es,",
        "start": 5013.12,
        "end": 5017.12
    },
    {
        "text": " de alguna manera, encontrar quién es la primera tarea,",
        "start": 5017.12,
        "end": 5020.12
    },
    {
        "text": " la primera intervalo que voy a agregar a mi solución,",
        "start": 5020.12,
        "end": 5023.12
    },
    {
        "text": " después la siguiente tarea y os, etcétera, etcétera,",
        "start": 5024.12,
        "end": 5027.12
    },
    {
        "text": " etcétera, eso es un algoritmo gris, no hay cada uno de esas",
        "start": 5027.12,
        "end": 5030.12
    },
    {
        "text": " a ver resolver mirando ahí localmente algo.",
        "start": 5030.12,
        "end": 5034.12
    },
    {
        "text": " Hay varias formas que uno se le podría hacer eso,",
        "start": 5036.12,
        "end": 5039.12
    },
    {
        "text": " la primera que maneja acá podría ser elegir siempre la primera subsistitud disponible,",
        "start": 5039.12,
        "end": 5044.12
    },
    {
        "text": " es decir, tener las zonas nada por tiempo de inicio de los pedidos y irlas a agregadas,",
        "start": 5044.12,
        "end": 5051.12
    },
    {
        "text": " descartar todas las que, conmisa cada una vez que aceptamos una rechazamos todas",
        "start": 5051.12,
        "end": 5058.12
    },
    {
        "text": " las que no son compatibles, podemos descartar todas las que se solapan con esa",
        "start": 5058.12,
        "end": 5062.12
    },
    {
        "text": " y así seguimos a buscar una idosa y así sucesivamente.",
        "start": 5062.12,
        "end": 5065.12
    },
    {
        "text": " Acá lo que haría es agarrar la primera que me parece descarto lo que se solape,",
        "start": 5066.12,
        "end": 5071.12
    },
    {
        "text": " agarro la siguiente disponible, descarto lo que se solape y así,",
        "start": 5071.12,
        "end": 5074.12
    },
    {
        "text": " esa es una posibilidad que no funcionan,",
        "start": 5074.12,
        "end": 5079.12
    },
    {
        "text": " acá tiene este es un ejemplo de no funcionar acá,",
        "start": 5079.12,
        "end": 5086.12
    },
    {
        "text": " la tarea que inicia antes es esta larga acá abajo,",
        "start": 5086.12,
        "end": 5090.12
    },
    {
        "text": " automáticamente descarta todas estas, pero en realidad me convendría",
        "start": 5090.12,
        "end": 5095.12
    },
    {
        "text": " incluir a esta que empieza un poquito después pero que no se choca con tantos",
        "start": 5095.12,
        "end": 5099.12
    },
    {
        "text": " intervalos como la larga de abajo.",
        "start": 5100.12,
        "end": 5104.12
    },
    {
        "text": " Entonces dice con esto por eso, vení que deberíamos comenzar aceptando la silicitú que requiere",
        "start": 5105.12,
        "end": 5109.12
    },
    {
        "text": " el menor intervalo de tiempo, es decir, acá el problema fue que este era demasiado larga",
        "start": 5109.12,
        "end": 5115.12
    },
    {
        "text": " y me chocava con muchas cosas, entonces si bueno no,",
        "start": 5115.12,
        "end": 5119.12
    },
    {
        "text": " entonces arranquemos con las más cortas, incluso usamos primero las más cortas",
        "start": 5119.12,
        "end": 5124.12
    },
    {
        "text": " y después vamos viendo que pasan con las más grandes.",
        "start": 5124.12,
        "end": 5127.12
    },
    {
        "text": " Eso también fasa, lo pueden ver acá, en este caso la más corta que se está acá",
        "start": 5128.12,
        "end": 5134.12
    },
    {
        "text": " abajo, justo choca en las puntas con otras dos, eso es más larga pero que me convení",
        "start": 5134.12,
        "end": 5139.12
    },
    {
        "text": " que hubiera estas otras dos.",
        "start": 5139.12,
        "end": 5142.12
    },
    {
        "text": " Ve como son ejemplos de cosas, y el proceso de pensar un algoritmo brilí de muchas",
        "start": 5142.12,
        "end": 5147.12
    },
    {
        "text": " veces es así, una tantea de ideas que parecen razonables",
        "start": 5147.12,
        "end": 5153.12
    },
    {
        "text": " y juega un poco con algunos ejemplos para tratar de ir avanzando en llegar algo que efectivamente funciona.",
        "start": 5153.12,
        "end": 5161.12
    },
    {
        "text": " Entonces a partir de esta experiencia, así que bueno agarramos una cortita pero que a pesar de corta",
        "start": 5165.12,
        "end": 5171.12
    },
    {
        "text": " tenía muchos conflictos, bueno, pues entonces agarremos las que tienen menos conflictos,",
        "start": 5171.12,
        "end": 5176.12
    },
    {
        "text": " si en otras palabras elegimos el menor, el intervalo que se choca con menos gente y eso también fasa.",
        "start": 5176.12,
        "end": 5184.12
    },
    {
        "text": " En este caso, ustedes fijan todos estos acas, se chocan con un montón de gente,",
        "start": 5190.12,
        "end": 5195.12
    },
    {
        "text": " todos estos acas también, entonces lo que tendría que hacer es elegir esta que se choca",
        "start": 5197.12,
        "end": 5205.12
    },
    {
        "text": " solo con dos, pero eso automáticamente me mata estas dos,",
        "start": 5205.12,
        "end": 5211.12
    },
    {
        "text": " y solo puedo elegir algunas de acá y otra de acá, entonces a final lo podrán más de tres.",
        "start": 5215.12,
        "end": 5221.12
    },
    {
        "text": " Por culpa de haber tomado hábidamente una decisión incorrecta,",
        "start": 5223.12,
        "end": 5226.12
    },
    {
        "text": " si es un ejemplo de un algoritmo hábido que agarró y no miró nada para los costados y el hijo",
        "start": 5226.12,
        "end": 5232.12
    },
    {
        "text": " que tiene menos conflictos, está agrego para ahí.",
        "start": 5232.12,
        "end": 5234.12
    },
    {
        "text": " Disculpame de interrumpa, justamente por estos ejemplos es que me causó confusión con,",
        "start": 5234.12,
        "end": 5241.12
    },
    {
        "text": " o sea no entiendo cuál es la diferencia entre tomar una orística y tomar de repente una algoritmo",
        "start": 5241.12,
        "end": 5247.12
    },
    {
        "text": " o gríde porque acá como está tomando ideas, de bueno me parece que por acá",
        "start": 5247.12,
        "end": 5253.12
    },
    {
        "text": " va a salir más óptimo ¿no?",
        "start": 5253.12,
        "end": 5255.12
    },
    {
        "text": " Eso es lo que hace una orística.",
        "start": 5256.12,
        "end": 5258.12
    },
    {
        "text": " Claro, la orística llega hasta ahí, nosotros vamos a probar que elegiendo correctamente",
        "start": 5260.12,
        "end": 5267.12
    },
    {
        "text": " esta decisión hábida, lo que terminamos es una solución óptima.",
        "start": 5270.12,
        "end": 5275.12
    },
    {
        "text": " Ah, bien, está, hay seis diferencias, es que lo puedes probar.",
        "start": 5276.12,
        "end": 5280.12
    },
    {
        "text": " Y bueno, igual mirá que son como dimensiones de comparación un poco,",
        "start": 5281.12,
        "end": 5286.12
    },
    {
        "text": " que no es tanto totalmente alineado, favoco de tener un efectivamente,",
        "start": 5286.12,
        "end": 5291.12
    },
    {
        "text": " estos pueden ser, estos son algoritmos gríde y podrías calificarlos como leurísticas.",
        "start": 5291.12,
        "end": 5296.12
    },
    {
        "text": " Ah, no son ni juntos, claro, ¿no? ¿No son de ni?",
        "start": 5297.12,
        "end": 5300.12
    },
    {
        "text": " La seguridadica es mucha veces sombrida.",
        "start": 5300.12,
        "end": 5303.12
    },
    {
        "text": " Claro.",
        "start": 5304.12,
        "end": 5305.12
    },
    {
        "text": " Lo que pasa que en general, cuando uno habla de urística estás pensando de algo",
        "start": 5305.12,
        "end": 5308.12
    },
    {
        "text": " para lo cual no tenés garantías de que diga óptimo.",
        "start": 5308.12,
        "end": 5311.12
    },
    {
        "text": " Bien.",
        "start": 5311.12,
        "end": 5312.12
    },
    {
        "text": " Y también se ha uno de le parece que esa decisión local puede caminar,",
        "start": 5314.12,
        "end": 5319.12
    },
    {
        "text": " pero no tenés ninguna garantía.",
        "start": 5319.12,
        "end": 5321.12
    },
    {
        "text": " Yo lo que le he lo que le he tratado de explicar es sin que para algunos problemas,",
        "start": 5321.12,
        "end": 5325.12
    },
    {
        "text": " no, no, la orística no te da garantías de que vas a tener una solución óptima,",
        "start": 5325.12,
        "end": 5332.12
    },
    {
        "text": " pero tampoco tenemos esperanzas de encontrar un algoritmo de tiempo colinomial que sirva.",
        "start": 5332.12,
        "end": 5336.12
    },
    {
        "text": " No, no, no, no, no queda mucho más remedio.",
        "start": 5338.12,
        "end": 5341.12
    },
    {
        "text": " Pero en otros ejemplos como este, a pesar de que uno se pueda frustrar con dos o tres intentos",
        "start": 5341.12,
        "end": 5348.12
    },
    {
        "text": " que después de que no andan,",
        "start": 5348.12,
        "end": 5350.12
    },
    {
        "text": " la realidad hay un algoritmo gríde y sencillo que sí funciona.",
        "start": 5350.12,
        "end": 5354.12
    },
    {
        "text": " Y en este caso es",
        "start": 5356.12,
        "end": 5358.12
    },
    {
        "text": " elegir primero la solicitud que termina primero,",
        "start": 5360.12,
        "end": 5363.12
    },
    {
        "text": " es decir, en vez de ir por quién empieza primero que sabimos que fue nuestro primer intento",
        "start": 5364.12,
        "end": 5368.12
    },
    {
        "text": " y que fracasó rotundamente,",
        "start": 5368.12,
        "end": 5370.12
    },
    {
        "text": " e dijamos en la que termina primero.",
        "start": 5371.12,
        "end": 5373.12
    },
    {
        "text": " ¿Cuál es la intuición de su analogía?",
        "start": 5374.12,
        "end": 5376.12
    },
    {
        "text": " Como si soy el hijo de la que termina?",
        "start": 5376.12,
        "end": 5377.12
    },
    {
        "text": " No, no, no, no, no, no, no, no, ojo que no es la más cortita,",
        "start": 5377.12,
        "end": 5384.12
    },
    {
        "text": " la más cortita fue...",
        "start": 5384.12,
        "end": 5385.12
    },
    {
        "text": " Bueno, pero segundo intento eso tampoco funciona.",
        "start": 5386.12,
        "end": 5388.12
    },
    {
        "text": " Es la que termina antes.",
        "start": 5389.12,
        "end": 5391.12
    },
    {
        "text": " En este caso, por ejemplo, en el ejemplo B,",
        "start": 5391.12,
        "end": 5394.12
    },
    {
        "text": " la que termina, la que tiene fecha de finalización más temprana es esta.",
        "start": 5395.12,
        "end": 5400.12
    },
    {
        "text": " Entonces voy a elegir esta,",
        "start": 5401.12,
        "end": 5403.12
    },
    {
        "text": " a pesar de que no es la más cortita.",
        "start": 5403.12,
        "end": 5405.12
    },
    {
        "text": " Pero no es el diminuí.",
        "start": 5406.12,
        "end": 5408.12
    },
    {
        "text": " ¿Cuál es la intuición de eso?",
        "start": 5408.12,
        "end": 5410.12
    },
    {
        "text": " Uno de los días, bueno, yo tengo, en definitiva,",
        "start": 5411.12,
        "end": 5414.12
    },
    {
        "text": " un espacio de tiempo,",
        "start": 5415.12,
        "end": 5417.12
    },
    {
        "text": " donde ir colocando",
        "start": 5418.12,
        "end": 5420.12
    },
    {
        "text": " intervados, ¿vale?",
        "start": 5422.12,
        "end": 5424.12
    },
    {
        "text": " Dijo un tocentresito.",
        "start": 5424.12,
        "end": 5425.12
    },
    {
        "text": " Si yo he dicho la que termino,",
        "start": 5425.12,
        "end": 5427.12
    },
    {
        "text": " en cuanto soy el hijo una y la coloco,",
        "start": 5427.12,
        "end": 5429.12
    },
    {
        "text": " o sea, me ha chica",
        "start": 5429.12,
        "end": 5431.12
    },
    {
        "text": " la cancha donde ir poniendo cosas, ¿vale?",
        "start": 5432.12,
        "end": 5435.12
    },
    {
        "text": " El lugar de unir poniendo más intervados.",
        "start": 5435.12,
        "end": 5437.12
    },
    {
        "text": " Si yo he dicho, entonces de todo esto que tenía acá,",
        "start": 5437.12,
        "end": 5440.12
    },
    {
        "text": " si yo he dicho la que termino antes,",
        "start": 5441.12,
        "end": 5443.12
    },
    {
        "text": " esto es acá.",
        "start": 5445.12,
        "end": 5447.12
    },
    {
        "text": " Eso me deja",
        "start": 5448.12,
        "end": 5450.12
    },
    {
        "text": " con un ancho, un intervalo de tiempo",
        "start": 5450.12,
        "end": 5454.12
    },
    {
        "text": " para seguir jugando los más grandes posibles,",
        "start": 5454.12,
        "end": 5456.12
    },
    {
        "text": " la cana delante.",
        "start": 5456.12,
        "end": 5457.12
    },
    {
        "text": " Entonces, cada vez que agrego uno,",
        "start": 5459.12,
        "end": 5461.12
    },
    {
        "text": " siempre estoy tratando de dejarme por delante",
        "start": 5461.12,
        "end": 5463.12
    },
    {
        "text": " todo lo que más pueda de tiempo para seguir metiendo tareas.",
        "start": 5463.12,
        "end": 5468.12
    },
    {
        "text": " Esa es la intuición.",
        "start": 5468.12,
        "end": 5470.12
    },
    {
        "text": " En este caso funciona.",
        "start": 5471.12,
        "end": 5473.12
    },
    {
        "text": " Resimimos otro montón de ideas",
        "start": 5473.12,
        "end": 5476.12
    },
    {
        "text": " que también tenía su atativo intuitivo",
        "start": 5477.12,
        "end": 5482.12
    },
    {
        "text": " y que nada, buscando un poco con los ejemplos,",
        "start": 5483.12,
        "end": 5486.12
    },
    {
        "text": " vemos que caían.",
        "start": 5486.12,
        "end": 5488.12
    },
    {
        "text": " En este caso, esta funciona.",
        "start": 5488.12,
        "end": 5491.12
    },
    {
        "text": " Entonces, el algoritmo completo es esto de acá.",
        "start": 5494.12,
        "end": 5499.12
    },
    {
        "text": " O sea, el conjunto de solicitudes.",
        "start": 5500.12,
        "end": 5503.12
    },
    {
        "text": " En total, ya, digamos, un conjunto inicialmente vacío.",
        "start": 5506.12,
        "end": 5509.12
    },
    {
        "text": " Entonces, mientras haya",
        "start": 5510.12,
        "end": 5512.12
    },
    {
        "text": " de arrebir y sacando cosas, mientras haza",
        "start": 5514.12,
        "end": 5516.12
    },
    {
        "text": " de intervados para seguir considerando,",
        "start": 5516.12,
        "end": 5518.12
    },
    {
        "text": " entonces, bueno, sea y",
        "start": 5518.12,
        "end": 5520.12
    },
    {
        "text": " tal que ahí tiene el tiempo de determinación lo más chico posible.",
        "start": 5523.12,
        "end": 5527.12
    },
    {
        "text": " Esa tarea la agrego a",
        "start": 5528.12,
        "end": 5530.12
    },
    {
        "text": " y el imino de R, todas las que se pueden chocar con esa tarea.",
        "start": 5532.12,
        "end": 5536.12
    },
    {
        "text": " Entonces, ya, bueno, cuando esto termina,",
        "start": 5538.12,
        "end": 5541.12
    },
    {
        "text": " que va a terminar por el cada paso,",
        "start": 5541.12,
        "end": 5543.12
    },
    {
        "text": " se eliminan cosas de acá,",
        "start": 5545.12,
        "end": 5547.12
    },
    {
        "text": " particular la tarea ahí, la que saco de ahí,",
        "start": 5548.12,
        "end": 5550.12
    },
    {
        "text": " esa siempre se eliminan.",
        "start": 5551.12,
        "end": 5552.12
    },
    {
        "text": " Así que esto es una cantidad finita de paso a termina.",
        "start": 5552.12,
        "end": 5555.12
    },
    {
        "text": " Y al final de vuelvo este a, que por construcción,",
        "start": 5557.12,
        "end": 5561.12
    },
    {
        "text": " es inmediato que los intervados que están incluidos ahí",
        "start": 5561.12,
        "end": 5564.12
    },
    {
        "text": " son compatibles.",
        "start": 5564.12,
        "end": 5566.12
    },
    {
        "text": " Entre sí, porque cada vez que agregue una cosa,",
        "start": 5566.12,
        "end": 5568.12
    },
    {
        "text": " elimina todo lo que potencialmente",
        "start": 5568.12,
        "end": 5570.12
    },
    {
        "text": " podría ser incompatible y vamos.",
        "start": 5570.12,
        "end": 5572.12
    },
    {
        "text": " ¿Cómo se encarra la última...",
        "start": 5577.12,
        "end": 5580.12
    },
    {
        "text": " la demostración de que está correcta?",
        "start": 5583.12,
        "end": 5585.12
    },
    {
        "text": " No lo voy a morir, funciona así, parece que viene bien.",
        "start": 5586.12,
        "end": 5589.12
    },
    {
        "text": " La demostración de que esto es correcto siempre,",
        "start": 5590.12,
        "end": 5594.12
    },
    {
        "text": " como el ejercicio es siempre arranca con una de estas tiras, ¿no?",
        "start": 5594.12,
        "end": 5597.12
    },
    {
        "text": " Para comparar a los vanales, bueno, sea o un conjunto óptimo de intervados.",
        "start": 5597.12,
        "end": 5602.12
    },
    {
        "text": " Claro, sea lo más grande posible.",
        "start": 5602.12,
        "end": 5604.12
    },
    {
        "text": " Son 10 juntos entre sí y lo más grande posible.",
        "start": 5604.12,
        "end": 5606.12
    },
    {
        "text": " No, no tenemos esperanza de mostrar y generar que ais igual a o.",
        "start": 5608.12,
        "end": 5612.12
    },
    {
        "text": " Lo que tenemos es que mostrar y que para nosotros es suficiente",
        "start": 5613.12,
        "end": 5615.12
    },
    {
        "text": " que la cantidad de elementos en un lado del yro,",
        "start": 5615.12,
        "end": 5617.12
    },
    {
        "text": " es la misma.",
        "start": 5617.12,
        "end": 5618.12
    },
    {
        "text": " Esto, ojo, bueno, eso, de no arranque por este lado,",
        "start": 5619.12,
        "end": 5622.12
    },
    {
        "text": " porque van a... y que van a banar, se van a arrancar.",
        "start": 5622.12,
        "end": 5626.12
    },
    {
        "text": " Lo que tenemos que mostrar es esto.",
        "start": 5626.12,
        "end": 5628.12
    },
    {
        "text": " No aspiren a que la solución sea única.",
        "start": 5629.12,
        "end": 5632.12
    },
    {
        "text": " Para acá van a encontrar un ejemplo de ejecución del agorí.",
        "start": 5632.12,
        "end": 5640.12
    },
    {
        "text": " Como les decía, la estrategia que sí acá es la demostrada que el agorismo,",
        "start": 5643.12,
        "end": 5647.12
    },
    {
        "text": " que nuestro agorismo se mantiene por delante, que está ahí.",
        "start": 5647.12,
        "end": 5651.12
    },
    {
        "text": " Está ahí.",
        "start": 5651.12,
        "end": 5652.12
    },
    {
        "text": " Hay que... cada problema particular que significa eso de estar por delante,",
        "start": 5652.12,
        "end": 5656.12
    },
    {
        "text": " bueno, hay que formalizarlo de una manera.",
        "start": 5656.12,
        "end": 5658.12
    },
    {
        "text": " Hay que... ¿Qué es sentido?",
        "start": 5658.12,
        "end": 5659.12
    },
    {
        "text": " Hicimos que nuestro agorismo está por delante.",
        "start": 5659.12,
        "end": 5661.12
    },
    {
        "text": " Lo que decimos es que cada uno de los intervados al final",
        "start": 5666.12,
        "end": 5669.12
    },
    {
        "text": " Si yo me comparo con los intervados de O,",
        "start": 5673.12,
        "end": 5676.12
    },
    {
        "text": " si yo me tengo mi solución A,",
        "start": 5676.12,
        "end": 5678.12
    },
    {
        "text": " a que puedo jomego el orino, después me doy una solución óptima O",
        "start": 5678.12,
        "end": 5682.12
    },
    {
        "text": " y orodelo los intervados en orden del que ocurra.",
        "start": 5682.12,
        "end": 5687.12
    },
    {
        "text": " Como son disjuntos,",
        "start": 5687.12,
        "end": 5689.12
    },
    {
        "text": " las de una solución, los de la otra, cada uno de esos,",
        "start": 5689.12,
        "end": 5692.12
    },
    {
        "text": " son disjuntos del crecí,",
        "start": 5692.12,
        "end": 5694.12
    },
    {
        "text": " las podrán dar por fecha de inicio, definen lo mismo.",
        "start": 5694.12,
        "end": 5697.12
    },
    {
        "text": " Quedan por orden del toco.",
        "start": 5697.12,
        "end": 5700.12
    },
    {
        "text": " Y los voy a comparar un o uno,",
        "start": 5701.12,
        "end": 5703.12
    },
    {
        "text": " el primero de O con el primero de A, el segundo de A,",
        "start": 5703.12,
        "end": 5706.12
    },
    {
        "text": " el set del set del set del set del set del set del set del set del.",
        "start": 5706.12,
        "end": 5708.12
    },
    {
        "text": " Y lo que voy a ver es que en todos los casos,",
        "start": 5708.12,
        "end": 5711.12
    },
    {
        "text": " para todos los índices,",
        "start": 5711.12,
        "end": 5715.12
    },
    {
        "text": " la fecha de finalización o el momento de finalización,",
        "start": 5715.12,
        "end": 5719.12
    },
    {
        "text": " de misolución, de la tarea que yo incluí,",
        "start": 5719.12,
        "end": 5725.12
    },
    {
        "text": " es menor igual que la de la solución óptima.",
        "start": 5725.12,
        "end": 5728.12
    },
    {
        "text": " Sé que siempre tengo yo comparado con la solución óptima,",
        "start": 5728.12,
        "end": 5731.12
    },
    {
        "text": " el alternativo que estúlé,",
        "start": 5731.12,
        "end": 5733.12
    },
    {
        "text": " yo siempre tengo por adelante más espacio en la cual seguir poniendo cosas.",
        "start": 5733.12,
        "end": 5739.12
    },
    {
        "text": " En ese sentido, vamos a decir que nuestro logónismo está por adelante.",
        "start": 5739.12,
        "end": 5743.12
    },
    {
        "text": " Y como bien decía un compañero recién,",
        "start": 5746.12,
        "end": 5748.12
    },
    {
        "text": " muchas veces esto se pesta naturalmente para que la demostración sea por inducción,",
        "start": 5748.12,
        "end": 5753.12
    },
    {
        "text": " pues su logrosanteaga.",
        "start": 5753.12,
        "end": 5755.12
    },
    {
        "text": " Y eso es lo que parece a Panes.",
        "start": 5755.12,
        "end": 5758.12
    },
    {
        "text": " Me decimos, bueno, con el primero intervalo,",
        "start": 5758.12,
        "end": 5761.12
    },
    {
        "text": " es ver, sonio, porque lo lo mismo funciona así,",
        "start": 5761.12,
        "end": 5764.12
    },
    {
        "text": " agarra la que primero termina.",
        "start": 5764.12,
        "end": 5767.12
    },
    {
        "text": " Y después asumiendo que hasta ahí,",
        "start": 5767.12,
        "end": 5770.12
    },
    {
        "text": " esto se cumple,",
        "start": 5770.12,
        "end": 5773.12
    },
    {
        "text": " muestro que en cada decisión que todo mi algoritmo mantiene esta,",
        "start": 5773.12,
        "end": 5778.12
    },
    {
        "text": " esta ventaja competitiva con respecto a la solución.",
        "start": 5778.12,
        "end": 5782.12
    },
    {
        "text": " La demostración, es por inducción como les decía,",
        "start": 5782.12,
        "end": 5785.12
    },
    {
        "text": " tiene todo un preámbulo, como la vez pasada,",
        "start": 5785.12,
        "end": 5788.12
    },
    {
        "text": " que si lo ya me marcaron celeste también,",
        "start": 5788.12,
        "end": 5790.12
    },
    {
        "text": " que es más como lidáctico, más explicativo,",
        "start": 5790.12,
        "end": 5792.12
    },
    {
        "text": " que no hacen a la demostración concreta,",
        "start": 5792.12,
        "end": 5795.12
    },
    {
        "text": " la demostración en sí, es bastante directa y el párrafo, este fino.",
        "start": 5795.12,
        "end": 5800.12
    },
    {
        "text": " Una vez que probamos eso, me diría, bueno, ¿sabes?",
        "start": 5804.12,
        "end": 5807.12
    },
    {
        "text": " Bueno, no, no, no, no, no, no, no, no, está completamente.",
        "start": 5807.12,
        "end": 5810.12
    },
    {
        "text": " Lo que hay que mostrar es que las suficciones últimas,",
        "start": 5811.12,
        "end": 5814.12
    },
    {
        "text": " y finalmente cuentas y para eso,",
        "start": 5814.12,
        "end": 5816.12
    },
    {
        "text": " lo que tenemos que ver es que si nuestro algoritmo tuviera menos tareas",
        "start": 5817.12,
        "end": 5824.12
    },
    {
        "text": " que el algoritmo, entonces como siempre, competitivamente,",
        "start": 5824.12,
        "end": 5827.12
    },
    {
        "text": " tuve más espacio por delante.",
        "start": 5827.12,
        "end": 5829.12
    },
    {
        "text": " Entonces, alguna de las tareas que tiene la demás,",
        "start": 5829.12,
        "end": 5832.12
    },
    {
        "text": " que tiene la tarea óptima, yo podría saber,",
        "start": 5832.12,
        "end": 5834.12
    },
    {
        "text": " ni el algoritmo también las tendrían que haber incluido,",
        "start": 5834.12,
        "end": 5837.12
    },
    {
        "text": " como sea, a una osurba, a una contradicción.",
        "start": 5837.12,
        "end": 5840.12
    },
    {
        "text": " No es que no va a estar con la demostración, no va a estar con la...",
        "start": 5842.12,
        "end": 5849.12
    },
    {
        "text": " Porque esto, porque esto por sí solo,",
        "start": 5849.12,
        "end": 5853.12
    },
    {
        "text": " el hecho de que la tarea siempre termina antes,",
        "start": 5853.12,
        "end": 5856.12
    },
    {
        "text": " no demuestra explícitamente lo que te vos querés probar,",
        "start": 5856.12,
        "end": 5860.12
    },
    {
        "text": " que es esto de acá.",
        "start": 5860.12,
        "end": 5862.12
    },
    {
        "text": " Claro, claro.",
        "start": 5862.12,
        "end": 5863.12
    },
    {
        "text": " Entonces, para probar esto, que esto no se cumple,",
        "start": 5863.12,
        "end": 5866.12
    },
    {
        "text": " decimos, bueno, supongamos que O tiene más cara delante.",
        "start": 5866.12,
        "end": 5869.12
    },
    {
        "text": " Pero ahora, en este algún minutito pasado,",
        "start": 5875.12,
        "end": 5878.12
    },
    {
        "text": " sin dar un segundo más,",
        "start": 5878.12,
        "end": 5880.12
    },
    {
        "text": " lo que estamos diciendo las demostraciones, supongamos que yo tengo",
        "start": 5883.12,
        "end": 5887.12
    },
    {
        "text": " en O varias tareas,",
        "start": 5888.12,
        "end": 5890.12
    },
    {
        "text": " hasta acá,",
        "start": 5894.12,
        "end": 5896.12
    },
    {
        "text": " y esto es, perdón, esto es en la solución A,",
        "start": 5896.12,
        "end": 5901.12
    },
    {
        "text": " la mía,",
        "start": 5901.12,
        "end": 5902.12
    },
    {
        "text": " y en O, que es la alternativa, bueno, tengo otras.",
        "start": 5902.12,
        "end": 5905.12
    },
    {
        "text": " Y, pues, más.",
        "start": 5910.12,
        "end": 5912.12
    },
    {
        "text": " Pero eso se digo, bueno,",
        "start": 5916.12,
        "end": 5918.12
    },
    {
        "text": " si esta tiene más,",
        "start": 5919.12,
        "end": 5921.12
    },
    {
        "text": " las primeras acá,",
        "start": 5921.12,
        "end": 5923.12
    },
    {
        "text": " que solo las compare una con una,",
        "start": 5924.12,
        "end": 5926.12
    },
    {
        "text": " eso sé que esta, la mía termina no antes que...",
        "start": 5926.12,
        "end": 5929.12
    },
    {
        "text": " que la quedé esta en azul.",
        "start": 5930.12,
        "end": 5932.12
    },
    {
        "text": " Bueno,",
        "start": 5934.12,
        "end": 5935.12
    },
    {
        "text": " pero entonces eso que quiere decir que esta,",
        "start": 5936.12,
        "end": 5939.12
    },
    {
        "text": " la cama 1,",
        "start": 5939.12,
        "end": 5941.12
    },
    {
        "text": " yo la puedo haber incluido,",
        "start": 5941.12,
        "end": 5942.12
    },
    {
        "text": " pues no se choca con ninguna de las mías,",
        "start": 5942.12,
        "end": 5944.12
    },
    {
        "text": " entonces se lo aburrimon a ver y terminaba ahí.",
        "start": 5944.12,
        "end": 5946.12
    },
    {
        "text": " Y ahí sí, mostramos que nuestra solución no puede tener menos que,",
        "start": 5947.12,
        "end": 5951.12
    },
    {
        "text": " que lo tengo ahí.",
        "start": 5952.12,
        "end": 5953.12
    },
    {
        "text": " ¿La acuerdo?",
        "start": 5954.12,
        "end": 5955.12
    },
    {
        "text": " Le comparamos con una última gira y como.",
        "start": 5956.12,
        "end": 5960.12
    },
    {
        "text": " Siempre, siempre compárenme con una última génerica,",
        "start": 5961.12,
        "end": 5964.12
    },
    {
        "text": " y no aspiren a probar que son iguales, aspiren a probar que una esta noctima como la otra.",
        "start": 5964.12,
        "end": 5969.12
    },
    {
        "text": " Muy buenas.",
        "start": 5969.12,
        "end": 5970.12
    },
    {
        "text": " Muy bien.",
        "start": 5970.12,
        "end": 5971.12
    },
    {
        "text": " Bueno, después van a encontrar una discusión sobre el tiempo de ejecución,",
        "start": 5972.12,
        "end": 5979.12
    },
    {
        "text": " que es bastante directa,",
        "start": 5979.12,
        "end": 5982.12
    },
    {
        "text": " la implementación, como les decía en este caso,",
        "start": 5982.12,
        "end": 5984.12
    },
    {
        "text": " es súper sencilla.",
        "start": 5984.12,
        "end": 5986.12
    },
    {
        "text": " Tengo que hacer un etapa de ordenar todo por fecha de definición al principio,",
        "start": 5986.12,
        "end": 5989.12
    },
    {
        "text": " en el siglo XI,",
        "start": 5989.12,
        "end": 5990.12
    },
    {
        "text": " en el siglo XI,",
        "start": 5990.12,
        "end": 5991.12
    },
    {
        "text": " y después...",
        "start": 5991.12,
        "end": 5993.12
    },
    {
        "text": " Yo he dicho, profe,",
        "start": 5993.12,
        "end": 5994.12
    },
    {
        "text": " ahí era nada que tenía,",
        "start": 5994.12,
        "end": 5996.12
    },
    {
        "text": " ¿por qué te queda venir loguéne eso?",
        "start": 5996.12,
        "end": 5998.12
    },
    {
        "text": " Bueno, porque hay algoritmos para ordenar,",
        "start": 5999.12,
        "end": 6002.12
    },
    {
        "text": " pues ustedes en programación,",
        "start": 6002.12,
        "end": 6003.12
    },
    {
        "text": " todos imagino que vieron alguna algoritmos para ordenar,",
        "start": 6003.12,
        "end": 6005.12
    },
    {
        "text": " como March Sort, ¿no sí?",
        "start": 6005.12,
        "end": 6007.12
    },
    {
        "text": " Sí, sí, sí.",
        "start": 6010.12,
        "end": 6011.12
    },
    {
        "text": " La otra vez cierto.",
        "start": 6011.12,
        "end": 6012.12
    },
    {
        "text": " Sí.",
        "start": 6012.12,
        "end": 6013.12
    },
    {
        "text": " ¿Y ordenás con March Sort?",
        "start": 6013.12,
        "end": 6014.12
    },
    {
        "text": " Por ejemplo, te queda de orden,",
        "start": 6014.12,
        "end": 6015.12
    },
    {
        "text": " el tiempo de ejecución te queda de orden en el siglo XI.",
        "start": 6015.12,
        "end": 6018.12
    },
    {
        "text": " Eso, si no lo recuerdan bien, o si no lo vieron bien,",
        "start": 6021.12,
        "end": 6024.12
    },
    {
        "text": " por ahora, crea que,",
        "start": 6025.12,
        "end": 6026.12
    },
    {
        "text": " tú me lo como un hecho actual,",
        "start": 6026.12,
        "end": 6029.12
    },
    {
        "text": " con algo como...",
        "start": 6029.12,
        "end": 6030.12
    },
    {
        "text": " Crea que,",
        "start": 6033.12,
        "end": 6034.12
    },
    {
        "text": " sobre la mitad del curso,",
        "start": 6034.12,
        "end": 6036.12
    },
    {
        "text": " vamos a extuyer en profundidades,",
        "start": 6036.12,
        "end": 6038.12
    },
    {
        "text": " y vamos a ver que no sólo que hay algoritmos de ordenamiento,",
        "start": 6038.12,
        "end": 6043.12
    },
    {
        "text": " que ordenan,",
        "start": 6043.12,
        "end": 6044.12
    },
    {
        "text": " la ordenación que ordenan en el tiempo o en el siglo XI,",
        "start": 6044.12,
        "end": 6048.12
    },
    {
        "text": " sino que además,",
        "start": 6048.12,
        "end": 6049.12
    },
    {
        "text": " cualquier algoritmo que ordene comparando cosas,",
        "start": 6049.12,
        "end": 6051.12
    },
    {
        "text": " va a llevar un tiempo de ejecución que es con un tiempo,",
        "start": 6051.12,
        "end": 6053.12
    },
    {
        "text": " de ejecución que es conmega de 1.000 lobes.",
        "start": 6053.12,
        "end": 6055.12
    },
    {
        "text": " Es decir, lo mejor que puedo hacer para ordenar",
        "start": 6055.12,
        "end": 6057.12
    },
    {
        "text": " una regla comparándolo,",
        "start": 6057.12,
        "end": 6059.12
    },
    {
        "text": " los elementos en presí,",
        "start": 6059.12,
        "end": 6060.12
    },
    {
        "text": " es de tiempo en el siglo XI.",
        "start": 6060.12,
        "end": 6062.12
    },
    {
        "text": " Entonces, en este caso, lo más pesado,",
        "start": 6063.12,
        "end": 6065.12
    },
    {
        "text": " si se le está para ordenar,",
        "start": 6065.12,
        "end": 6066.12
    },
    {
        "text": " después la parte de ir descartando cosas,",
        "start": 6066.12,
        "end": 6069.12
    },
    {
        "text": " es bien, es bien sencillo.",
        "start": 6069.12,
        "end": 6071.12
    },
    {
        "text": " Algo una duda más,",
        "start": 6073.12,
        "end": 6074.12
    },
    {
        "text": " estamos parando a que me esté pasando de cinco minutos,",
        "start": 6074.12,
        "end": 6076.12
    },
    {
        "text": " pero...",
        "start": 6076.12,
        "end": 6077.12
    },
    {
        "text": " pero vería aclarar esas dudas de surgir.",
        "start": 6078.12,
        "end": 6080.12
    },
    {
        "text": " Si te hay alguna más,",
        "start": 6080.12,
        "end": 6082.12
    },
    {
        "text": " no podemos...",
        "start": 6082.12,
        "end": 6083.12
    },
    {
        "text": " Nos vamos a seguir un poquito más.",
        "start": 6088.12,
        "end": 6090.12
    },
    {
        "text": " Bueno, Arran, ¿qué con esto?",
        "start": 6092.12,
        "end": 6094.12
    },
    {
        "text": " A mirarlo, así,",
        "start": 6094.12,
        "end": 6096.12
    },
    {
        "text": " las mantenemos el día con el cronograma,",
        "start": 6096.12,
        "end": 6098.12
    },
    {
        "text": " y como les decía,",
        "start": 6098.12,
        "end": 6099.12
    },
    {
        "text": " la semana que viene,",
        "start": 6099.12,
        "end": 6101.12
    },
    {
        "text": " confanando, van a seguir hablando de las cosas,",
        "start": 6101.12,
        "end": 6104.12
    },
    {
        "text": " y ver más ejemplos,",
        "start": 6104.12,
        "end": 6106.12
    },
    {
        "text": " algoritmos super interesantes,",
        "start": 6106.12,
        "end": 6108.12
    },
    {
        "text": " y otras técnicas de demostración",
        "start": 6108.12,
        "end": 6111.12
    },
    {
        "text": " de recorrección de algorithms.",
        "start": 6111.12,
        "end": 6115.12
    }
]