[
    {
        "text": " No es mi o así. Vamos a estar apretando un poco. Ya hemos apretado los otros días con",
        "start": 0.0,
        "end": 20.580000000000002
    },
    {
        "text": " los distintos mercados. Todos temas vamos a ver. Lo del capítulo 5 del material bibliográfico",
        "start": 20.58,
        "end": 32.64
    },
    {
        "text": " de inflación, que se nos escapa un poco a la herramienta que hemos venido desarrollando",
        "start": 32.64,
        "end": 40.34
    },
    {
        "text": " ese modelo de fertilizando, que vamos ahora en un rato, porque terminemos inflación,",
        "start": 40.34,
        "end": 44.94
    },
    {
        "text": " vamos a retomarlo con más instrumentos de forma de ver todo juntos, lo que hemos desarrollado",
        "start": 44.94,
        "end": 50.54
    },
    {
        "text": " de a poco desde la primera clase hasta la que vamos a ver hoy. Ese es el cierre y es",
        "start": 50.54,
        "end": 56.339999999999996
    },
    {
        "text": " la aspiración de poder, o sea, ahí no hay nada nuevo, sino ordenar y ver cómo vamos",
        "start": 56.339999999999996,
        "end": 61.339999999999996
    },
    {
        "text": " vinculando las distintos elementos que hemos sido analizados. Lo que sí vamos a ver ahora",
        "start": 61.339999999999996,
        "end": 66.18
    },
    {
        "text": " nuevo es inflación y les había comentado, hay varias teorías de la inflación. Con la",
        "start": 66.18,
        "end": 74.24
    },
    {
        "text": " herramienta que nosotros desarrollamos, ese modelo de fertilizando, hay que las curvas",
        "start": 74.24,
        "end": 78.06
    },
    {
        "text": " nos determinen, si tenemos en un eje de los precios, es medio insuficiente de verlo de esa",
        "start": 78.06,
        "end": 83.0
    },
    {
        "text": " manera. Entonces, aparece esta parte como medio descoigada del hilo conductor que teníamos,",
        "start": 83.0,
        "end": 89.67999999999999
    },
    {
        "text": " pero bueno, que nos va a permitir tratando de focalizar acá en lo que son las causas,",
        "start": 89.67999999999999,
        "end": 94.19999999999999
    },
    {
        "text": " el que de la misma manera que lo hicimos con los demás factores, tratando de identificar",
        "start": 94.19999999999999,
        "end": 98.11999999999999
    },
    {
        "text": " cuáles son esas variables que nos inciden en esta, en este caso, la inflación. Vamos a tratar",
        "start": 98.12,
        "end": 103.58
    },
    {
        "text": " de ver este tema a abordarlo de esa manera. Arranquemos con la definición de inflación",
        "start": 103.58,
        "end": 109.46000000000001
    },
    {
        "text": " que usted ya tiene, inflación que era, cómo se definía la inflación. La variación",
        "start": 109.46000000000001,
        "end": 117.0
    },
    {
        "text": " de los precios, o sea que el pie este que vamos a poner por acá, como inflación, es",
        "start": 117.0,
        "end": 122.38000000000001
    },
    {
        "text": " la variación de los precios, de ese IPC, con este IP que aproximamos al IPC. Entonces,",
        "start": 122.38,
        "end": 129.54
    },
    {
        "text": " aparece esa definición, asociado que inflación está vinculado a que los precios van variando",
        "start": 129.54,
        "end": 135.26
    },
    {
        "text": " en el tiempo, van aumentando en realidad, por eso se llama inflación, si los precios bajaran",
        "start": 135.26,
        "end": 140.38
    },
    {
        "text": " cómo se le llamaba eso. Deflación, y si los precios realmente aumentan, pero aumentan",
        "start": 140.38,
        "end": 145.57999999999998
    },
    {
        "text": " menos, de desinflación, o sea, más allá de los nombres, si no va a servir ahora,",
        "start": 145.57999999999998,
        "end": 150.9
    },
    {
        "text": " identificar alguna causa y en particular el final cómo combatimos la inflación, porque",
        "start": 150.9,
        "end": 156.08
    },
    {
        "text": " combatir la inflación no es que los precios bajan, es que suban menos, ¿sí? Entonces,",
        "start": 156.08,
        "end": 162.66
    },
    {
        "text": " en varios momentos ahora vamos a pensar de esa manera. Bueno, definición, entonces,",
        "start": 162.66,
        "end": 167.82
    },
    {
        "text": " vinculado a eso, causa de la inflación, va ya muy directo a esto, ¿por qué los países",
        "start": 167.82,
        "end": 172.42000000000002
    },
    {
        "text": " tienen inflación? ¿Por qué los países tienen procesos donde los precios van aumentando",
        "start": 172.42000000000002,
        "end": 176.4
    },
    {
        "text": " a lo largo del tiempo? Primero factor que vamos a identificar, un factor de demanda.",
        "start": 176.4,
        "end": 182.96
    },
    {
        "text": " Aquí lo vamos a vincular a la herramienta que manejamos, acá sí podemos asociarlo para",
        "start": 182.96,
        "end": 189.12
    },
    {
        "text": " que no nos quede todo descoigado. Entonces, sacaste al PBI, acá está el IPC y entonces",
        "start": 189.12,
        "end": 199.12
    },
    {
        "text": " tenemos una demanda agregada en la economía, uso una de las tantas ofertas y la economía",
        "start": 199.12,
        "end": 205.46
    },
    {
        "text": " está acá. Entonces, ¿qué nos dice la inflación de la demanda? Que si hay algunos factores,",
        "start": 205.46,
        "end": 212.54000000000002
    },
    {
        "text": " ahora vamos a ver cuáles, que nos impulsan la demanda hacia arriba, o sea que llevan a que",
        "start": 212.54000000000002,
        "end": 217.66
    },
    {
        "text": " se demanden más bienes y servicios en una economía el resultado es este. Inflación, su",
        "start": 217.66,
        "end": 225.10000000000002
    },
    {
        "text": " apprecios. Si bien acá los vemos en términos estáticos y las definiciones aumentos sostenidos,",
        "start": 225.10000000000002,
        "end": 230.94
    },
    {
        "text": " de precios. Esta es un poco la explicación de por qué hay inflación. Los países tienen",
        "start": 230.94,
        "end": 238.26
    },
    {
        "text": " precios de demanda, demandan más bienes y servicios, eso lleva si ese aumento de la demanda no va",
        "start": 238.26,
        "end": 245.24
    },
    {
        "text": " acompañado de aumento de más producción, eso lleva aumento de precios. Ahora, ¿qué es lo que",
        "start": 245.24,
        "end": 249.94
    },
    {
        "text": " conduce a que aumenta la demanda agregada? Y acá está vinculado o acá aparece asociado el",
        "start": 249.94,
        "end": 257.38
    },
    {
        "text": " déficit fiscal. Bien, vamos a ver por qué. Recordemos que la demanda agregada, esto es",
        "start": 257.38,
        "end": 268.62
    },
    {
        "text": " acá, eran los cinco componentes de gasto, ¿no? Entonces, por dónde viene esto de que una",
        "start": 268.62,
        "end": 276.94
    },
    {
        "text": " economía tenga más que tenga mayor déficit fiscal, pueda generar presiones de demanda. Si",
        "start": 276.94,
        "end": 284.5
    },
    {
        "text": " el gobierno tiene de especificar, ¿cómo financia esto? ¿Cómo podía financiarlo?",
        "start": 284.5,
        "end": 289.3
    },
    {
        "text": " Gobierno tiene que conseguir la plata para pagar las mayores obras ¿no? ¿Dónde la saca?",
        "start": 293.3,
        "end": 298.22
    },
    {
        "text": " Coloca bonos, sendeuda, ¿sí? Cuando sendeuda para que le compren esa deuda, ¿qué",
        "start": 300.22,
        "end": 307.2
    },
    {
        "text": " podíamos decir que ocurría? Para que el gobierno diga, comprenme este papelito y la gente",
        "start": 307.2,
        "end": 315.28
    },
    {
        "text": " diga, bueno, te lo compro. El interés tiene que ser mayor cuando sube la tasa de interés,",
        "start": 315.28,
        "end": 322.44
    },
    {
        "text": " ¿qué pasa con algunas de estas variables? Baja, los hogares porque van a consumir menos",
        "start": 322.44,
        "end": 330.48
    },
    {
        "text": " si sube la tasa de interés. ¿Es combinar a ahorrar más y se el compañero? Y las empresas",
        "start": 330.48,
        "end": 336.88
    },
    {
        "text": " pensando en la inversión, invertir menos porque que hacen con su fondos, los depositan en un",
        "start": 336.88,
        "end": 344.52000000000004
    },
    {
        "text": " bajo. Entonces, cuando el gobierno tiene déficit y la financiación con deuda no está generando",
        "start": 344.52000000000004,
        "end": 350.76
    },
    {
        "text": " ninguna presión de demanda, o sea que la relación o el financiamiento del déficit con deuda",
        "start": 350.76,
        "end": 357.92
    },
    {
        "text": " no genera inflación. Por lo menos, hoy, cuando en el futuro tenga que pagar esos intereses,",
        "start": 357.92,
        "end": 363.24
    },
    {
        "text": " tenga que volver a la deuda, ahí capaz que sí genera inflación. Pero hoy financiar",
        "start": 363.24,
        "end": 368.04
    },
    {
        "text": " este déficit con deuda no genera inflación. ¿Qué otra forma de financiamiento teníamos",
        "start": 368.04,
        "end": 373.48
    },
    {
        "text": " tres? Subir más impuestos y si suba impuestos, que nos cambia de estos componentes de la demanda.",
        "start": 373.48,
        "end": 381.68
    },
    {
        "text": " Diminuye el consumo, está generando más demanda entonces. No, entonces déficit, ni",
        "start": 381.68,
        "end": 391.08
    },
    {
        "text": " financiado con deuda, ni financiado con impuestos, nos van a generar inflación. El déficit que",
        "start": 391.08,
        "end": 403.8
    },
    {
        "text": " genera inflación es el que se financia con la tarcera fuente de financiamiento. ¿Y cuál",
        "start": 403.8,
        "end": 409.32
    },
    {
        "text": " era esta? En primeros billetes, aumentar la cantidad de dinero. Esto sí es lo que genera",
        "start": 409.32,
        "end": 417.28
    },
    {
        "text": " inflación. O sea, los países, una de los causas que llevan a que tengan inflación son",
        "start": 417.28,
        "end": 425.4
    },
    {
        "text": " déficit fiscales financiados con emisión de dinero. ¿Qué eso presiona a un aumento de",
        "start": 425.4,
        "end": 432.24
    },
    {
        "text": " la demanda agregada? ¿Y cómo relacionamos eso con las herramientas que hemos manejado? ¿Por",
        "start": 432.24,
        "end": 438.2
    },
    {
        "text": " qué el aumento de la cantidad de dinero me genera más demanda? ¿Por qué los sogares",
        "start": 438.2,
        "end": 443.56
    },
    {
        "text": " consumen más? Uno de los factores que teníamos acá dentro de la función del consumo era",
        "start": 443.56,
        "end": 448.36
    },
    {
        "text": " la M. No, una cosa son los ingresos y otra la variable cantidad de dinero. Ahora, ¿qué",
        "start": 448.36,
        "end": 457.15999999999997
    },
    {
        "text": " pasaba cuando aumentaba la cantidad de dinero que otra variable conocíamos aquí o ante la",
        "start": 457.15999999999997,
        "end": 460.88
    },
    {
        "text": " mano? ¿Se aumenta la cantidad de dinero? ¿Qué le pasaba la tasa de interés? Bajado.",
        "start": 460.88,
        "end": 470.15999999999997
    },
    {
        "text": " Y si baja la tasa de interés, ¿qué va a ocurrir? Las empresas van a querer invertir",
        "start": 470.15999999999997,
        "end": 478.0
    },
    {
        "text": " más, los sogares van a querer ahorrar menos y consumir más. Y acá sí vemos el canal",
        "start": 478.0,
        "end": 483.44
    },
    {
        "text": " monetario ligado a lo que hemos desarrollado. Entonces, una de las explicaciones de por qué",
        "start": 483.44,
        "end": 489.8
    },
    {
        "text": " los países tenían. Inflación era que sus gobiernos no controlaban el déficit fiscal,",
        "start": 489.8,
        "end": 497.40000000000003
    },
    {
        "text": " que se déficit, los financiaban con emisión total, tenían la maquinita y esos generaban",
        "start": 497.40000000000003,
        "end": 503.88
    },
    {
        "text": " presiones inflacionales. Bien, una de las causas, la causa que la podemos asociar por el",
        "start": 503.88,
        "end": 509.84000000000003
    },
    {
        "text": " lado de la demanda vinculado entonces a efectos monetarios. Pero bueno, los países se",
        "start": 509.84000000000003,
        "end": 518.32
    },
    {
        "text": " dieron cuenta y empezaron a controlar esto, pero sin embargo también un momento que se les",
        "start": 518.32,
        "end": 523.8000000000001
    },
    {
        "text": " disparó la inflación por el lado del afuerto. Ya no por el lado de la demanda, sino por",
        "start": 523.8000000000001,
        "end": 529.2
    },
    {
        "text": " el lado del afuerto, por el lado de los costos. En particular, al principio vinculados",
        "start": 529.2,
        "end": 539.5600000000001
    },
    {
        "text": " a los costos de los bienes importados. Cuando definimos este IPC, cuando definimos el IPC",
        "start": 539.5600000000001,
        "end": 546.96
    },
    {
        "text": " acá dentro, hay un montón de bienes y servicios, ¿verdad? Hay algunos de ellos que",
        "start": 546.96,
        "end": 553.5
    },
    {
        "text": " están vinculados, que son una función de los bienes importados. Por ejemplo, esta explicación",
        "start": 553.5,
        "end": 560.64
    },
    {
        "text": " de la parte de la afuerta seguimos conocer como las perturbaciones porque vinieron shocks",
        "start": 560.64,
        "end": 566.48
    },
    {
        "text": " de afuera en particular el shock petroelero de la ECA-70 y hizo que aumentaran los precios",
        "start": 566.48,
        "end": 572.6
    },
    {
        "text": " del petróleo. Preció, peasterisco pensado como insumo de la producción de muchas empresas.",
        "start": 572.6,
        "end": 578.48
    },
    {
        "text": " Entonces, los países tenían controlada la demanda, pero bueno, precisaban petróleo,",
        "start": 578.48,
        "end": 582.96
    },
    {
        "text": " y si precisaban petróleo para producir como insumo como costo básico y ese costo había",
        "start": 582.96,
        "end": 587.4
    },
    {
        "text": " aumentado de precio, aumentó de los precios de algunos, pero bueno, en el total, si estos",
        "start": 587.4,
        "end": 595.28
    },
    {
        "text": " aumentan y estos quedan igual en el total acaba de haber un aumento. Vas a armenor, pero",
        "start": 595.28,
        "end": 599.82
    },
    {
        "text": " va a aumentar. Entonces, tenemos, por el lado de la afuerta vinculado a los precios de los",
        "start": 599.82,
        "end": 606.86
    },
    {
        "text": " insumos importados, caso del petróleo y el típico, otra explicación de por qué los países",
        "start": 606.86,
        "end": 612.86
    },
    {
        "text": " tienen inflación. Hay todo un canal que viene por bienes importados que pegan la estructura",
        "start": 612.86,
        "end": 619.7800000000001
    },
    {
        "text": " de bienes del IPC. Pero no solo eso, porque el precio del bienin importado capaz que quede",
        "start": 619.7800000000001,
        "end": 626.1
    },
    {
        "text": " igual, pero este precio, cuando le metemos acá dentro, hay que transformarlo, no? Este",
        "start": 626.1,
        "end": 631.0600000000001
    },
    {
        "text": " viene en dólares, en dólares por barril. Como transformamos este dólar es por barril,",
        "start": 631.0600000000001,
        "end": 638.98
    },
    {
        "text": " por barril de petróleo, como le transformamos a pesos por barril de petróleo. Multiplicando",
        "start": 638.98,
        "end": 647.74
    },
    {
        "text": " por el tipo de cambio, entonces aparece otra variable acá que por al lado de los costos",
        "start": 647.74,
        "end": 653.0600000000001
    },
    {
        "text": " juega, que es el tipo de cambio. Y además, hay una parte de estos bienes que decíamos",
        "start": 653.06,
        "end": 658.5799999999999
    },
    {
        "text": " ser en función de insumos importados y por eso jugaba el precio, pero también hay otra",
        "start": 658.5799999999999,
        "end": 663.5799999999999
    },
    {
        "text": " parte, y capaz que lo podemos plantear así, una parte un poco mayor, que es función del",
        "start": 663.5799999999999,
        "end": 668.7399999999999
    },
    {
        "text": " tipo de cambio. ¿Por qué funciona el tipo de cambio? Primero, pues son los importados y",
        "start": 668.7399999999999,
        "end": 673.9799999999999
    },
    {
        "text": " cuando los pasamos a pesos, se hijo de al tipo de cambio. Pero segundo, ¿por qué hay",
        "start": 673.9799999999999,
        "end": 678.2199999999999
    },
    {
        "text": " algunos que se producen nacionalmente, pero si tienen la chance de deben darse en el",
        "start": 678.22,
        "end": 682.86
    },
    {
        "text": " exterior o de vendarse a nivel local, el tipo de cambio va a estar jugando. Entonces,",
        "start": 682.86,
        "end": 686.98
    },
    {
        "text": " hay otras series de precios que también juega. Entonces, ¿qué ocurre si aumenta el tipo",
        "start": 686.98,
        "end": 693.02
    },
    {
        "text": " de cambio? ¿Qué va a pasar con el precio en pesos del barril de petróleo? Va a subir,",
        "start": 693.02,
        "end": 700.98
    },
    {
        "text": " entonces, ¿no sube algunos costos? Porque subió el tipo de cambio. Así que adentro de los",
        "start": 700.98,
        "end": 706.34
    },
    {
        "text": " costos tenemos precios sin sumos importados y tenemos esta variable de política macroeconómica",
        "start": 706.34,
        "end": 711.5
    },
    {
        "text": " como es el tipo de cambio, que la podía o no controlarse un sistema cambiario de gobierno.",
        "start": 711.5,
        "end": 717.22
    },
    {
        "text": " Y también por acá se pueden identificar otros costos que son los salarios, y acá aparece",
        "start": 717.22,
        "end": 722.62
    },
    {
        "text": " un concepto que es el espiral de precios y salarios. Los salarios también son otros costos,",
        "start": 722.62,
        "end": 732.7
    },
    {
        "text": " están bien por la ola falta. Hay explicaciones de que los países tienen inflación, porque",
        "start": 732.7,
        "end": 738.34
    },
    {
        "text": " sus costos, en este caso hablando solo del salario, van a aumentar. ¿Y qué pasa si aumentan",
        "start": 738.34,
        "end": 743.98
    },
    {
        "text": " los salarios? ¿Qué hace el empresario? Cuando ve que tiene que pagar más salario y eso",
        "start": 743.98,
        "end": 748.22
    },
    {
        "text": " le aumentó sus costos. Va a aumentar los precios. Si aumentan los salarios, los empresarios",
        "start": 748.22,
        "end": 757.0200000000001
    },
    {
        "text": " le aumentan sus costos, entonces que hace, incrementa los precios. Pero cuando aumenten los",
        "start": 757.02,
        "end": 762.98
    },
    {
        "text": " precios, ¿qué va a querer hacer el trabajador? ¿Qué le pasa en qué lo afecta el trabajador",
        "start": 762.98,
        "end": 769.34
    },
    {
        "text": " que aumenta los precios? Pierre poder de compra, entonces qué va a negociar? Aumento de",
        "start": 769.34,
        "end": 775.54
    },
    {
        "text": " salario. Y así seguimos, entonces a esto se le denomina el espiral de precios y salarios.",
        "start": 775.54,
        "end": 782.34
    },
    {
        "text": " Se empieza a nadar una sucesión ahí de aumentos de encadenamiento entre uno y otro, que",
        "start": 782.34,
        "end": 788.6600000000001
    },
    {
        "text": " no importa quién fue el primero, quién fue la primer flechita, donde partimos. Acá",
        "start": 788.6600000000001,
        "end": 792.98
    },
    {
        "text": " partí de un aumento de salario, pero por identificarlo, pero en realidad, capaz que",
        "start": 792.98,
        "end": 796.26
    },
    {
        "text": " este aumento de salario se dio porque antes vino un aumento de precios. Entonces, se generan",
        "start": 796.26,
        "end": 801.34
    },
    {
        "text": " esos mecanismos que se le denomina el espiral de precios y salarios. Y qué es otro de",
        "start": 801.34,
        "end": 806.26
    },
    {
        "text": " los costos, entonces, que tenemos científicados ahí en la parte de la inflación. ¿Sí?",
        "start": 806.26,
        "end": 815.54
    },
    {
        "text": " Bueno, y después tenemos otra versión que son las expectativas y también con un factor",
        "start": 815.54,
        "end": 830.86
    },
    {
        "text": " positivo. Esto es algo así como que si los agentes piensan que va a haber inflación,",
        "start": 830.86,
        "end": 841.42
    },
    {
        "text": " terminan generando inflación. Si yo espero, no, voy andando en la bicicleta y espero",
        "start": 841.42,
        "end": 846.86
    },
    {
        "text": " que me voy a abar de boca contra el piso y bueno, me dí de boca contra el piso, me caí,",
        "start": 846.86,
        "end": 852.0600000000001
    },
    {
        "text": " me jugó el inconsciente, algo así. ¿Cuál es el inconsciente que jugaba acá? Que si yo",
        "start": 852.0600000000001,
        "end": 856.3000000000001
    },
    {
        "text": " soy empresario y espero que los precios van a aumentar, ¿qué voy a hacer? En qué me van",
        "start": 856.3,
        "end": 861.66
    },
    {
        "text": " a afectar a mí como empresario un aumento de precios. Podríamos pensarlo por lado de los",
        "start": 861.66,
        "end": 867.2199999999999
    },
    {
        "text": " costos. Entonces, si yo espero que me van a aumentar los precios, ¿qué podría hacer yo?",
        "start": 867.2199999999999,
        "end": 872.3
    },
    {
        "text": " Aumentar ya los precios, para si no pierdo cuando me aumenten los costos. Entonces, como",
        "start": 872.3,
        "end": 877.9599999999999
    },
    {
        "text": " el empresario tenía expectativas de que van a aumentar los precios, aumenta los precios.",
        "start": 877.9599999999999,
        "end": 883.3399999999999
    },
    {
        "text": " Y ese hecho, que se dio debido a que tenía un expectativo que hace refuerza o lleva la",
        "start": 883.34,
        "end": 889.02
    },
    {
        "text": " expectativa de la realidad, ¿no? Hace que efectivamente haya inflación. Porque hizo algo,",
        "start": 889.02,
        "end": 894.1800000000001
    },
    {
        "text": " porque esperaba que ocurrir hacia ellos. Bien. Entonces, acá se generan determinados",
        "start": 894.1800000000001,
        "end": 900.6600000000001
    },
    {
        "text": " mecanismos que hacen que una economía pueda tener cierta inercia inflacionaria. ¿Sí?",
        "start": 900.6600000000001,
        "end": 909.62
    },
    {
        "text": " De cosas que los agentes económicos hacen de manera de ajustar según las expectativas",
        "start": 909.62,
        "end": 916.1
    },
    {
        "text": " ese aumento de precios. Y una de esas cosas, por ejemplo, es la de los aumentos de salarios,",
        "start": 916.1,
        "end": 923.66
    },
    {
        "text": " detener aumentos de salarios en función de la inflación esperada. ¿Sí? Que en realidad,",
        "start": 923.66,
        "end": 934.26
    },
    {
        "text": " más que en la en función esperada, porque uno podría decir, bueno, pero si la inflación",
        "start": 934.26,
        "end": 937.62
    },
    {
        "text": " va a bajar, yo mi aumento de salario va a ser menor. Pero generalmente, ¿qué es lo que ocurría?",
        "start": 937.62,
        "end": 943.0600000000001
    },
    {
        "text": " Los agentes económicos piden aumento de salario en los trabajadores en función del poder",
        "start": 943.0600000000001,
        "end": 948.94
    },
    {
        "text": " adquisitivo que ya perdieron. Entonces, en realidad esto, más que lo esperado, terminadando",
        "start": 948.94,
        "end": 955.74
    },
    {
        "text": " sé que es vos aumentame en T lo que yo perdí de poder adquisitivo en T-1. ¿Sí? Entonces,",
        "start": 955.74,
        "end": 967.5
    },
    {
        "text": " si yo tuve un aumento de precios, inflación, el año pasado de 6%, bueno, para este año",
        "start": 967.5,
        "end": 973.54
    },
    {
        "text": " aumentame el sueldo 6% de manera de recuperar el poder adquisitivo. Ahora, ¿qué está pasando?",
        "start": 973.54,
        "end": 979.46
    },
    {
        "text": " ¿Está generando un mecanismo acá? Por eso a esto se le llama un mecanismo de indexación.",
        "start": 979.46,
        "end": 983.7
    },
    {
        "text": " Indexación es esto, ¿no? Que tengo algo, un instrumento que me ata a la inflación. Pero si me",
        "start": 986.9000000000001,
        "end": 994.86
    },
    {
        "text": " ata a la inflación, me está atando, que esto me va a generar más inflación. Entonces,",
        "start": 994.86,
        "end": 999.46
    },
    {
        "text": " estoy teniendo aumentos de precios vinculados a que me van a aumentar estos costos ligados a",
        "start": 999.46,
        "end": 1005.1
    },
    {
        "text": " los precios que ya tuvo. Entonces, es algo como perversos. Entonces, estos mecanismos",
        "start": 1005.1,
        "end": 1009.62
    },
    {
        "text": " indexación generan ese proceso de inercia que cuando un país tiene un proceso inflacionario,",
        "start": 1009.62,
        "end": 1015.1800000000001
    },
    {
        "text": " se le puede complicar bajado. Entonces, causas de la inflación, las clasificamos en estos",
        "start": 1015.1800000000001,
        "end": 1025.18
    },
    {
        "text": " tres grupos, más allá de la teoría que está detrás y tenemos la camiseta de uno de",
        "start": 1025.18,
        "end": 1029.18
    },
    {
        "text": " otro, son tres causas distintas que provocan cosas que llevan a que un país tenga inflación,",
        "start": 1029.18,
        "end": 1035.54
    },
    {
        "text": " unas por la demanda, otra por la oferta o costos, otra por las expectativas y aparecen",
        "start": 1035.54,
        "end": 1040.66
    },
    {
        "text": " ahí algunos conceptos. Ahora, ¿por qué los países no quieren tener inflación generalmente?",
        "start": 1040.66,
        "end": 1048.18
    },
    {
        "text": " Eso en realidad también depende del punto de partida, ¿no? ¿O en cuanto tenemos inflación",
        "start": 1048.18,
        "end": 1053.7
    },
    {
        "text": " en Uruguay? Si pensamos en una inflación anual hoy, 2017 o los últimos 12 meses, 2017,",
        "start": 1053.7,
        "end": 1067.8600000000001
    },
    {
        "text": " ¿no? En Uruguay. 8 por 70, 6, depende donde nos paremos andamos por ahí ¿no? ¿Qué quiere",
        "start": 1067.8600000000001,
        "end": 1076.8600000000001
    },
    {
        "text": " decir eso en función de esta definición? Que vamos a la cantina, ¿sí? Pébimos el menú,",
        "start": 1076.86,
        "end": 1083.58
    },
    {
        "text": " el año pasado 100 pesos salía el menú, venimos al año siguiente y cuánto va a salir si tenemos",
        "start": 1083.58,
        "end": 1089.1399999999999
    },
    {
        "text": " una inflación de 8 por ciento, 108 pesos, ¿sí? Uruguay, la máxima inflación que tuvo fue en 1989",
        "start": 1089.1399999999999,
        "end": 1100.6999999999998
    },
    {
        "text": " y fue 129 por ciento. O sea, que el menú terminamos el año, con el menú de 100 pesos,",
        "start": 1100.7,
        "end": 1110.82
    },
    {
        "text": " venimos al año siguiente, trajimos por la duda 140 pesos que hubiera subido y cuánto salía",
        "start": 1110.82,
        "end": 1116.42
    },
    {
        "text": " el menú el otro año. 229, o sea, cambios radicales en el tema de los precios. Entonces,",
        "start": 1116.42,
        "end": 1124.78
    },
    {
        "text": " los precios que generalmente son un indicativo, nos sirven como una referencia para tomar",
        "start": 1124.78,
        "end": 1130.66
    },
    {
        "text": " decisiones, ¿no? Estaba o va que estamos diciendo de cuánta plata llevo para la cantina,",
        "start": 1130.66,
        "end": 1135.14
    },
    {
        "text": " pero otras decisiones de negocios, por ejemplo, de poner plata anulado en otro, de una empresa",
        "start": 1135.14,
        "end": 1140.3000000000002
    },
    {
        "text": " de llevar adelante un emprendimiento u otro, genera que si los cambios de precios son de",
        "start": 1140.3000000000002,
        "end": 1144.66
    },
    {
        "text": " zamagnitude, generan muchos ruidos y qué hace la gente y no toma decisiones. Entonces,",
        "start": 1144.66,
        "end": 1152.46
    },
    {
        "text": " el noto a tomar decisiones es uno de los problemas, estamos empezando a bailar acá de estos",
        "start": 1152.46,
        "end": 1156.7
    },
    {
        "text": " problemas, que genera la inflación. Los agentes económicos, como se desdirtúa esto",
        "start": 1156.7,
        "end": 1162.6200000000001
    },
    {
        "text": " que el precio sea esa referencia para la toma de decisiones, postar gran decisión.",
        "start": 1162.6200000000001,
        "end": 1167.26
    },
    {
        "text": " Pero además, ¿qué pasa con el billete de 100 pesos que yo había guardado si la inflación",
        "start": 1167.26,
        "end": 1172.82
    },
    {
        "text": " es 129 por ciento? Y lo guarden como billete de 100. Paredió mucho valor, entonces ¿qué",
        "start": 1172.82,
        "end": 1181.26
    },
    {
        "text": " es el poca alternativo a poder haber tenido? O guardar ese billete de 100. Comprarme unos",
        "start": 1181.26,
        "end": 1187.34
    },
    {
        "text": " dólares, entonces ¿qué hace la gente? Y si hay países que tienen mucha inflación, no",
        "start": 1187.34,
        "end": 1193.66
    },
    {
        "text": " van a guardar su riqueza bajo la forma de dinero, moneda nacional. ¿Cómo lo guardan?",
        "start": 1193.66,
        "end": 1200.02
    },
    {
        "text": " Moneda extranjera, otras alternativo. ¿Sí? Entonces ¿qué pasa con la cantidad de dinero?",
        "start": 1200.02,
        "end": 1206.66
    },
    {
        "text": " Es un instrumento que un país tiene para justamente hacer política monetaria. No lo va a",
        "start": 1206.66,
        "end": 1211.3400000000001
    },
    {
        "text": " poder usar porque la gente usa menos ese billete. Entonces, no genera problemas de que no",
        "start": 1211.3400000000001,
        "end": 1217.26
    },
    {
        "text": " se toman decisiones, genera problemas porque la gente no lo usa. Bueno, lo del poder adquisitivo",
        "start": 1217.26,
        "end": 1223.22
    },
    {
        "text": " que dijimos ¿no? Bien, se pierde poder adquisitivo, pero además eso genera diferencia. No es lo",
        "start": 1223.22,
        "end": 1229.6200000000001
    },
    {
        "text": " mismo de repente un hogar pobre, que en realidad no tiene para comprar dólar o no tenía",
        "start": 1229.6200000000001,
        "end": 1233.5400000000002
    },
    {
        "text": " para borrar o comprarse casas como algunos hacían el uruguay cuando había mucha inflación.",
        "start": 1233.54,
        "end": 1238.3
    },
    {
        "text": " Entonces ¿qué hace el hogar? Y se comen la inflación porque va a tener que gastar en los",
        "start": 1238.3,
        "end": 1242.86
    },
    {
        "text": " alimentos. ¿Y qué le pasa al otro? Entonces, hay que si les sobraba mucha plata, se protege",
        "start": 1242.86,
        "end": 1248.46
    },
    {
        "text": " de la inflación, comprando otro tipo de activos. Entonces ¿qué pasa con la brecha entre",
        "start": 1248.46,
        "end": 1253.34
    },
    {
        "text": " este que no obtenía y el que tenía? Se amplía y la inflación se amplía de manera",
        "start": 1253.34,
        "end": 1258.46
    },
    {
        "text": " igual, ¿no? Esa brecha la amplía es igualmente. Entonces por eso tampoco la inflación es algo",
        "start": 1258.46,
        "end": 1264.98
    },
    {
        "text": " que se quiera tener. Bien. Y bueno, se generan también otros problemas que los invito a que los",
        "start": 1264.98,
        "end": 1273.1000000000001
    },
    {
        "text": " lean ahí. Entonces, vamos a tomar el casuurbullo, acá, este de acá de 1989, para ver de una manera",
        "start": 1273.1000000000001,
        "end": 1282.82
    },
    {
        "text": " más práctica lo que le llamamos el combate a la inflación. ¿Qué es repasar? A través del",
        "start": 1282.82,
        "end": 1288.7
    },
    {
        "text": " ejemplo de este uruguay, repasar qué se puede hacer, cómo tenemos que manejar determinadas",
        "start": 1288.7,
        "end": 1294.02
    },
    {
        "text": " variables macroeconómicas para bajar la inflación en función de las causas que uno puede",
        "start": 1294.02,
        "end": 1298.9399999999998
    },
    {
        "text": " identificar. Y como el caso de Uruguay se hizo un diagnóstico de que este 199% estaba",
        "start": 1298.9399999999998,
        "end": 1305.8999999999999
    },
    {
        "text": " compuesto por explicaciones de las tres grandes teorías, de las tres grandes tipos de inflación,",
        "start": 1305.8999999999999,
        "end": 1311.22
    },
    {
        "text": " no sirve más todo. Entonces, 1989 en Uruguay se había tomado, vamos a poner los tres. Teníamos",
        "start": 1311.22,
        "end": 1321.38
    },
    {
        "text": " los tres grandes problemas macroeconómicos que eran el crecimiento económico, el desempleo,",
        "start": 1321.38,
        "end": 1327.6200000000001
    },
    {
        "text": " y la inflación. Si, en 1989 habíamos salido de la editadura, ¿no? Uruguay venía creciendo,",
        "start": 1327.62,
        "end": 1343.6599999999999
    },
    {
        "text": " del 85 hasta el 89, Uruguay venía creciendo. Entonces, esto no era un problema, este no era",
        "start": 1343.6599999999999,
        "end": 1349.3799999999999
    },
    {
        "text": " de los principales problemas. Dentro de lo macro, estoy hablando, no estoy hablando de otro",
        "start": 1349.3799999999999,
        "end": 1353.7399999999998
    },
    {
        "text": " problema político institucional, no, sólo de lo macrocono. Entonces, crecimiento económico",
        "start": 1353.74,
        "end": 1359.22
    },
    {
        "text": " no era un problema. Desempleo y un poco de la mano, tampoco había muchos problemas. Entonces,",
        "start": 1359.22,
        "end": 1364.66
    },
    {
        "text": " cuál era el problema? Uruguay había llegado su máximo registro de inflación, más de 100 años",
        "start": 1364.66,
        "end": 1374.14
    },
    {
        "text": " y la inflación nunca había atrepado hasta ese 129%. Entonces, ¿qué es quiso hacer en gobierno?",
        "start": 1374.14,
        "end": 1380.14
    },
    {
        "text": " Bueno, entonces, implementó lo que se denomina el plan de estabilización. Este plan de",
        "start": 1380.14,
        "end": 1391.98
    },
    {
        "text": " estabilización implementado en 1990 por el gobierno que asumió en las calles en entonces, pero",
        "start": 1391.98,
        "end": 1399.5400000000002
    },
    {
        "text": " después en el 95 se continuó hasta política, entonces lo que vamos a estar hablando ahora",
        "start": 1399.5400000000002,
        "end": 1404.0200000000002
    },
    {
        "text": " no es sólo de cinco años que quisieron combatir este número, sino que es cinco años más después",
        "start": 1404.0200000000002,
        "end": 1410.0600000000002
    },
    {
        "text": " y después cuando asumió Washington en el 2000 también se siguió. O sea, esta política",
        "start": 1410.06,
        "end": 1415.54
    },
    {
        "text": " llegó hasta el 2002, que ahí con la crisis en 2002, esta política se cayó. Objetivo de",
        "start": 1415.54,
        "end": 1425.1399999999999
    },
    {
        "text": " esta gran esquema de política macroconómica, bajar la inflación, cómo tres herramientas",
        "start": 1425.1399999999999,
        "end": 1433.74
    },
    {
        "text": " y vamos a ver que cada una de ellas está asuciada a una de las causas de la inflación.",
        "start": 1433.74,
        "end": 1440.42
    },
    {
        "text": " Primera herramienta, habían visto que parte de la inflación estaba vinculada el déficit fiscal,",
        "start": 1440.42,
        "end": 1447.3
    },
    {
        "text": " entonces, ¿qué se quiso bajar el déficit fiscal? ¿Qué hizo entonces ese gobierno de la calle",
        "start": 1447.3,
        "end": 1457.6200000000001
    },
    {
        "text": " en el 90 para bajar el déficit? Déficit que cuenta era que hacíamos. Ingresso menos gasto,",
        "start": 1457.62,
        "end": 1465.62
    },
    {
        "text": " gasto menos ingreso, ¿vale? ¿Cómo hacemos para bajar? ¿Lastamos menos? Entonces, se",
        "start": 1465.62,
        "end": 1471.9399999999998
    },
    {
        "text": " recortaron gastos, huelga de estudiantes, por el presupuesto de la educación, de otros",
        "start": 1471.9399999999998,
        "end": 1477.58
    },
    {
        "text": " lados se bajan gastos. Pero además aumentamos ingresos y cómo es el aumento de ingreso.",
        "start": 1477.58,
        "end": 1486.9399999999998
    },
    {
        "text": " Más impuesto, se suba la tasa de algún impuesto, se inventa alguno, el IRP, ahora IRP se",
        "start": 1486.9399999999998,
        "end": 1495.6999999999998
    },
    {
        "text": " apareció por ahí, se subieron tasas de otros. Pero eso no fue solo de la calle, después",
        "start": 1495.6999999999998,
        "end": 1501.6599999999999
    },
    {
        "text": " cuando sumieron el 95, se hicieron también impuestos, no me apareció el cofis por ahí,",
        "start": 1501.66,
        "end": 1507.14
    },
    {
        "text": " entonces también esta estrategia de bajar el déficit lo mismo. ¿Y por qué se quería bajar",
        "start": 1507.14,
        "end": 1512.5800000000002
    },
    {
        "text": " el déficit? ¿Por qué es bajando el déficit y vamos a bajar la inflación? ¿Por qué esto",
        "start": 1512.5800000000002,
        "end": 1520.8600000000001
    },
    {
        "text": " nos iba a llevar a bajar el financiamiento del déficit con más emisión de dinero? ¿Sí?",
        "start": 1520.8600000000001,
        "end": 1530.66
    },
    {
        "text": " Entonces, de esta manera nosotros estamos diciendo vamos a bajar el déficit y voy por",
        "start": 1530.66,
        "end": 1536.38
    },
    {
        "text": " aquello del aumento de precios, en realidad, inflacionar y aumento de precios, pero menos",
        "start": 1536.38,
        "end": 1541.1000000000001
    },
    {
        "text": " y la bajamos, ¿no? Entonces, la idea cual era bajemos el déficit, bajar déficit, bajamos,",
        "start": 1541.1000000000001,
        "end": 1549.7
    },
    {
        "text": " bajamos el aumento de la cantidad de dinero, entonces que se va a lograr bajar el aumento",
        "start": 1549.7,
        "end": 1556.8200000000002
    },
    {
        "text": " de los precios, ¿sí? No estamos hablando de bajar precios, estamos hablando de bajar",
        "start": 1556.82,
        "end": 1563.1
    },
    {
        "text": " el aumento de precios, no estamos hablando de emitir menos, estamos hablando de sacar",
        "start": 1563.1,
        "end": 1568.58
    },
    {
        "text": " dinero o no, sino de emitir menos, de que el aumento de la cantidad de dinero sea menos.",
        "start": 1568.58,
        "end": 1573.06
    },
    {
        "text": " Es bajar el aumento de la cantidad de dinero, porque déficit y tenés, y si tenés déficit",
        "start": 1577.86,
        "end": 1583.1799999999998
    },
    {
        "text": " tenés que financiar una parte, pero financiás un poco menos con dinero, seguir financiando,",
        "start": 1583.18,
        "end": 1588.98
    },
    {
        "text": " pero me… También uno podría decir, bueno, financio con impuestos, ya venía acá.",
        "start": 1588.98,
        "end": 1597.6200000000001
    },
    {
        "text": " Con deuda, por ejemplo, pero ahí viene toda la cuestión intergeneracional, de que yo hago",
        "start": 1597.6200000000001,
        "end": 1604.1000000000001
    },
    {
        "text": " esto, está bien, también se financiaba con deuda, ¿sí? Pero la deuda recordemos,",
        "start": 1604.1000000000001,
        "end": 1609.22
    },
    {
        "text": " no genera inflación, ¿no es? Pero dentro de unos años, cuando se padezí, entonces también",
        "start": 1609.22,
        "end": 1613.78
    },
    {
        "text": " hay que pensarlo como en el horizonte es grande. Entonces, por ahí, una batería instrumentos.",
        "start": 1613.78,
        "end": 1621.34
    },
    {
        "text": " Después, segundo instrumento, se implementó la banda de flotación que vimos los otros días,",
        "start": 1621.34,
        "end": 1628.3
    },
    {
        "text": " aquello de la banda de flotación para que el tipo de cambio evolucionara dentro de",
        "start": 1630.3,
        "end": 1635.8600000000001
    },
    {
        "text": " una banda, que habíamos planteado que el tipo de cambio fuera por ahí adentro. Bien,",
        "start": 1635.86,
        "end": 1645.74
    },
    {
        "text": " y fíjense lo que estoy poniendo ahí, esa banda de flotación que nos planteaba, que bajara",
        "start": 1645.74,
        "end": 1655.26
    },
    {
        "text": " el tipo de cambio, que se mantuviera constante, lo que estaba planteando era que bajara el",
        "start": 1655.26,
        "end": 1667.02
    },
    {
        "text": " aumento del tipo de cambio, porque si baja el aumento del tipo de cambio, que era lo que",
        "start": 1667.02,
        "end": 1672.46
    },
    {
        "text": " decíamos, va a bajar que cosa, los costos, si bajo el aumento del tipo de cambio, que le",
        "start": 1672.46,
        "end": 1682.96
    },
    {
        "text": " pasa a los costos. Voy a vuelta, a ver si me siguen con el juego palabras, bajo el aumento del",
        "start": 1682.96,
        "end": 1692.02
    },
    {
        "text": " tipo de cambio, baja el aumento de los costos, que va a bajar entonces, el aumento de los precios,",
        "start": 1692.02,
        "end": 1702.52
    },
    {
        "text": " o sea, baja la inflación, ¿no? No estamos, obviamente, como Argentina, Argentina también tenía,",
        "start": 1702.52,
        "end": 1711.2
    },
    {
        "text": " guarimos hasta mucho más alto que nosotros de inflación y qué hizo en el plan de estabilización.",
        "start": 1711.2,
        "end": 1716.24
    },
    {
        "text": " Puso una banda de flotación para que a lo largo de diez años el tipo de cambio fuera evolucionando",
        "start": 1716.24,
        "end": 1721.52
    },
    {
        "text": " de a poquito, ¿no? Argentina, ¿qué fue lo que hizo? Le valió, pero más allá qué hizo, puso",
        "start": 1721.52,
        "end": 1728.94
    },
    {
        "text": " así de a poco creciendo, ¿no? Puso uno a uno, el famoso uno a uno de caballo, dijo el tipo",
        "start": 1728.94,
        "end": 1737.4
    },
    {
        "text": " de cambio, ahora es este, y lo dejó fijo, obvio, si esto queda fijo, que va a pasar con los costos,",
        "start": 1737.4,
        "end": 1742.88
    },
    {
        "text": " quedan fijo y si además como en Argentina se dijo bueno, pero además, estos precios acá,",
        "start": 1742.88,
        "end": 1748.5600000000002
    },
    {
        "text": " que han congelado, no se pueden cambiarnos, el estado lo fija y la carne, la leche,",
        "start": 1748.5600000000002,
        "end": 1754.88
    },
    {
        "text": " papá, que han fijo y claro, no va a subir la inflación, si estamos fijando alguno y otros",
        "start": 1754.88,
        "end": 1761.3200000000002
    },
    {
        "text": " sabemos que dependen del tipo de cambio y lo dejamos quieto, pero Uruguay somos más graduales,",
        "start": 1761.3200000000002,
        "end": 1766.16
    },
    {
        "text": " ¿no? Entonces la política era una banda de flotación para que esto aumentara menos,",
        "start": 1766.16,
        "end": 1771.3200000000002
    },
    {
        "text": " de esa manera esto aumenta menos, de esa manera los precios aumenta menos y eso es bajar la",
        "start": 1771.3200000000002,
        "end": 1776.1200000000001
    },
    {
        "text": " inflación. Y para acompañar esto, se tomó una tercera medida que fue los consejos de salarios",
        "start": 1776.1200000000001,
        "end": 1788.64
    },
    {
        "text": " que nosotros en el 90, que era algo que con la recuperación de la democracia se habían",
        "start": 1788.64,
        "end": 1795.64
    },
    {
        "text": " instaurado, se habían reinitavurado, los consejos de salarios que eran, ¿sacuérdan? ¿Qué",
        "start": 1795.64,
        "end": 1802.64
    },
    {
        "text": " hoy hay? ¿Dónde negocian los suelos quienes, empresarios sentados a un lado, trabajadores",
        "start": 1802.64,
        "end": 1813.0
    },
    {
        "text": " sentados a otro lado y el estado participando? Bueno, en el 85 se habían retomado en el 90,",
        "start": 1813.0,
        "end": 1819.72
    },
    {
        "text": " el gobierno dijo, el estado se retira a esa negociación y si se retira a esa negociación,",
        "start": 1819.72,
        "end": 1826.64
    },
    {
        "text": " ¿qué podemos esperar que ocurra? Estamos acá con la parte de las expectativas, es lo mismo",
        "start": 1826.64,
        "end": 1833.4
    },
    {
        "text": " negociar salarios en función de la inflación pasada con un estado que está también discutiendo",
        "start": 1833.4,
        "end": 1838.72
    },
    {
        "text": " a que sea mano a mano trabajadores con empresario. ¿Quién podemos pensar que pierdan esa",
        "start": 1838.72,
        "end": 1845.56
    },
    {
        "text": " negociación? Trabajador, entonces ¿cómo podemos esperar que sea el aumento de salario?",
        "start": 1845.56,
        "end": 1851.48
    },
    {
        "text": " Menor. Y si aumentan menos en los salarios, aumentan menos en los precios. Entonces, esa",
        "start": 1851.48,
        "end": 1857.8
    },
    {
        "text": " fue la estrategia, ¿sí? Cortar con los mecanismos de indexación, cortar con esos mecanismos",
        "start": 1857.8,
        "end": 1866.72
    },
    {
        "text": " de indexación de que los salarios se ajustaban en función de inflación pasada de manera",
        "start": 1866.72,
        "end": 1872.04
    },
    {
        "text": " de no tener una inercia, no tener por ese lado de las expectativas un peso que hiciera",
        "start": 1872.04,
        "end": 1878.96
    },
    {
        "text": " que esta inflación siguiera a la ciudad. Con el conjunto de estas tres medidas Uruguay",
        "start": 1878.96,
        "end": 1888.44
    },
    {
        "text": " de 189% que tuvo en el 89 pasó a 1998 a 9,9% 98, 99 ahora mientras la duda.",
        "start": 1888.44,
        "end": 1907.72
    },
    {
        "text": " Sí, no lo tengo ahora. Pero ahí, si no era el 98 fue el 99. Bien, o sea, 10 años",
        "start": 1918.44,
        "end": 1933.92
    },
    {
        "text": " para bajar la inflación a menos de 10%. Que eso fue un logro importante con una política",
        "start": 1933.92,
        "end": 1940.0
    },
    {
        "text": " obviamente gradual, como dijimos, y no de shock como el caso argentino, pero se logró",
        "start": 1940.0,
        "end": 1946.96
    },
    {
        "text": " ser objetivo. Cero sal principio, pero igual eso es un efecto más como simplificador",
        "start": 1946.96,
        "end": 1958.04
    },
    {
        "text": " de visualización, ¿no? No es el choque de que te corta la inflación porque les saca",
        "start": 1958.04,
        "end": 1966.32
    },
    {
        "text": " cero, porque en realidad después en el IPC vos ajustas todo, o tenés un salto de una",
        "start": 1966.32,
        "end": 1970.52
    },
    {
        "text": " besolla, ¿no? No te genera efectos de bajar la inflación. Esta inflación bajó porque",
        "start": 1970.52,
        "end": 1978.02
    },
    {
        "text": " se atacaron cuestiones de indexación, porque se atacaron cuestiones de demanda y porque",
        "start": 1978.02,
        "end": 1983.24
    },
    {
        "text": " se atacaron cosas de oferta, o sea, se fue a las causas y por eso la inflación bajó. ¿Qué",
        "start": 1983.24,
        "end": 1991.68
    },
    {
        "text": " pasa hoy? ¿Cómo se está atacando la inflación hoy? Tenemos un sistema de banda de flotación,",
        "start": 1991.68,
        "end": 2000.0
    },
    {
        "text": " ¿no? O sea, que por el lado de los costos, el tipo de cambio no es una variable que",
        "start": 2000.0,
        "end": 2004.12
    },
    {
        "text": " el gobierno está manejando para controlar la inflación hoy, está que hablábamos acá en Uruguay,",
        "start": 2004.12,
        "end": 2008.64
    },
    {
        "text": " ¿no? O sea, hoy en Uruguay el tipo de cambio no se usa, entonces no lo estamos, el gobierno",
        "start": 2008.64,
        "end": 2015.48
    },
    {
        "text": " no lo está usando para bajar la inflación por el lado de los costos. La parte fiscal, el",
        "start": 2015.48,
        "end": 2024.36
    },
    {
        "text": " fiscal siempre está en discusión, ¿no? Entonces la parte del fiscal, si, se quiere tratar de",
        "start": 2024.36,
        "end": 2029.8
    },
    {
        "text": " controlar, vamos a ponerle no bajar, vamos a ponerle controlar, pero se controla el",
        "start": 2029.8,
        "end": 2035.6799999999998
    },
    {
        "text": " déficit fiscal y en particular, este se trata de financiar con deuda y no tanto con emisión",
        "start": 2035.6799999999998,
        "end": 2044.32
    },
    {
        "text": " de dinero, si bien las fuentes de financiamiento siempre se hace una combinación de todas, pero",
        "start": 2044.32,
        "end": 2049.8399999999997
    },
    {
        "text": " bueno, se trata de financiar con deuda, entonces su inflación, ese déficit no genera, futuro",
        "start": 2049.84,
        "end": 2055.28
    },
    {
        "text": " sí. ¿Y consejo de salarios, espectativos?",
        "start": 2055.28,
        "end": 2059.0
    },
    {
        "text": " Sarran instalaron, o sea, que por la parte de las expectativas, tenemos consejos de salario,",
        "start": 2059.0,
        "end": 2068.6000000000004
    },
    {
        "text": " pero en realidad lo que se ha tratado de hacer en esta última vuelta de los consejos de",
        "start": 2068.6000000000004,
        "end": 2073.1600000000003
    },
    {
        "text": " salarios, que tenga que ver con la productividad, que la justa de salarios, la implemento de",
        "start": 2073.16,
        "end": 2081.12
    },
    {
        "text": " sueldos, ¿no? Que el incremento de sueldos no sea tanto por la inflación, sino que sea en",
        "start": 2081.12,
        "end": 2087.5
    },
    {
        "text": " función de la productividad de los sectores, que eso es un cambio. Y además se metieron",
        "start": 2087.5,
        "end": 2095.7599999999998
    },
    {
        "text": " algunas cuestiones como los ajustes de tarifas o el control de las tarifas públicas, que",
        "start": 2095.7599999999998,
        "end": 2102.12
    },
    {
        "text": " se han utilizado como mecanismo también de controlar la inflación. Lo que hoy decían",
        "start": 2102.12,
        "end": 2107.6
    },
    {
        "text": " Argentina cuando se hizo de Yoki se congelaron determinados bien, y que tenían un peso importante",
        "start": 2107.6,
        "end": 2113.3599999999997
    },
    {
        "text": " en la canasta de consumo. Bueno, hoy Uruguay que hizo los últimos años, agregándole",
        "start": 2113.3599999999997,
        "end": 2119.08
    },
    {
        "text": " al control del déficit fiscal, a la parte de la demanda, bueno, se fija directamente",
        "start": 2119.08,
        "end": 2123.9
    },
    {
        "text": " a algunos precios que son importantes en la canasta y que puede controlar, y bueno, se han",
        "start": 2123.9,
        "end": 2128.3199999999997
    },
    {
        "text": " controlado, la tarifa de Utesa, hay una discusión si se usan o no para controlar la inflación,",
        "start": 2128.32,
        "end": 2132.6200000000003
    },
    {
        "text": " no, no, no, no, no, no, no, si se acuerdan algunos precios acuerdos con supermarcado, que",
        "start": 2132.6200000000003,
        "end": 2136.92
    },
    {
        "text": " habían precios que quedaban congelados por bastante tiempo, bueno, se identifican algunos",
        "start": 2136.92,
        "end": 2141.5800000000004
    },
    {
        "text": " precios y se tratan, sí, también podemos ponerse acá, ¿no? Ajuste de tarifas públicas,",
        "start": 2141.5800000000004,
        "end": 2147.1600000000003
    },
    {
        "text": " su acuerdo de precios con supermarcado, ¿eh? Pero bueno, ¿para qué vimos esto entonces",
        "start": 2147.16,
        "end": 2158.14
    },
    {
        "text": " del Caso Uruguay yo, para mostrar o repasar lo que son causas de la inflación, así en",
        "start": 2158.14,
        "end": 2163.8399999999997
    },
    {
        "text": " esta manera más abierta de juntar distintas teorías y ir a una realidad concreta como",
        "start": 2163.8399999999997,
        "end": 2168.8199999999997
    },
    {
        "text": " la que tuvo Uruguay en ese periodo, ¿viene? Bueno, acá terminaron, perdón, inflación,",
        "start": 2168.82,
        "end": 2180.56
    },
    {
        "text": " capítulo de la ficha, el punto 5-2 que dice la curva de Philips, eso no lo vemos más,",
        "start": 2180.56,
        "end": 2187.6000000000004
    },
    {
        "text": " por eso incluso si ustedes ven en la ficha acá nos dice demanda, acá dice una mu, que",
        "start": 2187.6000000000004,
        "end": 2194.52
    },
    {
        "text": " era taza de desempleo, eso estaba vinculado porque al principio ya por 2000 y poco veíamos",
        "start": 2194.52,
        "end": 2202.12
    },
    {
        "text": " la parte de una relación que hay en triunflación y desempleo, pero está, preferimos no hacerlo",
        "start": 2202.12,
        "end": 2207.68
    },
    {
        "text": " más, ¿sí? Entonces esa parte nueva y llegamos entonces al final del curso que no incorpora",
        "start": 2207.68,
        "end": 2216.32
    },
    {
        "text": " contenidos nuevos como les decía hace un rato, sino que lo que vamos a ver ahora es una manera",
        "start": 2216.32,
        "end": 2221.56
    },
    {
        "text": " de ver junto todo lo que hemos visto hasta ahora y si quieren para darlo en algo más",
        "start": 2221.56,
        "end": 2227.36
    },
    {
        "text": " práctico son las últimas preguntas de los parciales, las últimas tres preguntas de los",
        "start": 2227.36,
        "end": 2232.12
    },
    {
        "text": " parciales, las últimas dos preguntas de los exámenes. Este viernes porque que vamos medio",
        "start": 2232.12,
        "end": 2242.88
    },
    {
        "text": " apretados van a haber dos preguntas no más de esto, ¿viene? Entonces ¿qué es este cierre",
        "start": 2242.88,
        "end": 2250.36
    },
    {
        "text": " prometido de la primera clase que ahora llegamos? ¿Ven esta herramienta que usamos? oferta",
        "start": 2250.36,
        "end": 2257.44
    },
    {
        "text": " agregada, que depende, demanda agregada, que depende, ver las dos cosas juntas y ver cómo",
        "start": 2257.44,
        "end": 2263.56
    },
    {
        "text": " los mercados financieros, cambiarios, monetarios nos están jugando ahí como los interrelacionamos.",
        "start": 2263.56,
        "end": 2271.52
    },
    {
        "text": " ¿Qué podemos usar para ver esas relaciones? Dos grandes cosas, políticas macroconómicas",
        "start": 2271.52,
        "end": 2277.6800000000003
    },
    {
        "text": " o yoxestar por esa visión de que aplicamos esto en la economía pequeña o uruguay.",
        "start": 2277.68,
        "end": 2283.96
    },
    {
        "text": " Políticas macroconómicas podemos tener política sobre la demanda y política sobre la oferta.",
        "start": 2283.96,
        "end": 2290.56
    },
    {
        "text": " Sobre la demanda, si hablamos de políticas son variables que maneja el gobierno y tenemos",
        "start": 2290.56,
        "end": 2296.96
    },
    {
        "text": " las fiscales que las asociamos al gasto, a los impuestos, las monetarias financieras,",
        "start": 2296.96,
        "end": 2304.2799999999997
    },
    {
        "text": " las antidadinero, las ainteres y van de la mano, una suba y el trabajo y el tipo de",
        "start": 2304.28,
        "end": 2310.28
    },
    {
        "text": " camas. Entonces tenemos tres tipos de política de mano. Las políticas de demanda son las",
        "start": 2310.28,
        "end": 2315.52
    },
    {
        "text": " que podemos sacarle más jugo en esto de interrelacionar. Las políticas de oferta en ese sentido",
        "start": 2315.52,
        "end": 2321.48
    },
    {
        "text": " tienen menor riqueza para vincular que pasan el mercado financiero, que pasan el levién",
        "start": 2321.48,
        "end": 2326.0400000000004
    },
    {
        "text": " es como concluirme a cada guaya. Entonces para la política oferta en particular van a ver",
        "start": 2326.0400000000004,
        "end": 2330.6800000000003
    },
    {
        "text": " que si podemos analizar políticas de oferta para cada uno de los cuatro faltores productivos",
        "start": 2330.68,
        "end": 2336.3999999999996
    },
    {
        "text": " no vamos a ver ninguna en la clase. Después tenemos los yox externos y los yox también",
        "start": 2336.3999999999996,
        "end": 2343.08
    },
    {
        "text": " pueden venir por la demanda o por la oferta. Por la oferta casi que son eventos climáticos,",
        "start": 2343.08,
        "end": 2350.68
    },
    {
        "text": " que afecten por ejemplo producciones, innación, huracán, terremoto, lo que queramos. Y también",
        "start": 2350.68,
        "end": 2358.12
    },
    {
        "text": " tienen menor riqueza para vincular los distintos marcados. Mientras que los yox de demanda tienen",
        "start": 2358.12,
        "end": 2363.08
    },
    {
        "text": " mayor riqueza y por donde pueden venir, porque cambian la tasa de interés internacional,",
        "start": 2363.08,
        "end": 2367.52
    },
    {
        "text": " todas las variables que vimos que dependen del resto del mundo. Tasa de interés, precios,",
        "start": 2367.52,
        "end": 2372.0
    },
    {
        "text": " tipo de cambio, siempre hablando de otros países e ingresos. Entonces tenemos dos tipos",
        "start": 2372.0,
        "end": 2380.2
    },
    {
        "text": " de políticas y adentro de ellas varias, dos tipos de yox y adentro de ellos también",
        "start": 2380.2,
        "end": 2385.4
    },
    {
        "text": " vale. Ahora cuando analizamos cada uno de ellos, cada fila vendría a ser de esto que estamos",
        "start": 2385.4,
        "end": 2391.2000000000003
    },
    {
        "text": " a cabo que trato de explicarles acá en este pizarro, se pueden analizar en distintos",
        "start": 2391.2000000000003,
        "end": 2396.7200000000003
    },
    {
        "text": " contextos, como analizarlo para la economía uruguaya, pero podría ser para una economía",
        "start": 2396.7200000000003,
        "end": 2402.76
    },
    {
        "text": " gran. Vamos a fijarla con la economía uruguaya, una pequeña. Pero a su vez, cómo es la economía",
        "start": 2402.76,
        "end": 2408.36
    },
    {
        "text": " uruguaya? Es una economía que tiene reglas de juego que deja los capitales que se muevan",
        "start": 2408.36,
        "end": 2413.4
    },
    {
        "text": " entre los países libremente, sin trabas, sin impuestos, o tenemos controles a esa movilidad",
        "start": 2413.4,
        "end": 2419.52
    },
    {
        "text": " internacional de capitales. Esos controles que dicen no, son capitales especulativos,",
        "start": 2419.52,
        "end": 2424.36
    },
    {
        "text": " no pueden entrar. Entonces cada una de estas filas la podíamos analizar bajo estas reglas",
        "start": 2424.36,
        "end": 2430.48
    },
    {
        "text": " o bajo estas, pero a su vez la macroeconomía no solo están las reglas de la movilidad internacional",
        "start": 2430.48,
        "end": 2437.44
    },
    {
        "text": " de capitales, sino que está el sistema cambiado. Entonces adentro de cada uno de estos también",
        "start": 2437.44,
        "end": 2442.36
    },
    {
        "text": " tendríamos que dar si el gobierno interviene para mantener el tipo de cambio, lo que llamábamos",
        "start": 2442.36,
        "end": 2448.08
    },
    {
        "text": " tipo de cambio fijo, o si no interviene y es tipo de cambio flexivo. Entonces ahí con esas",
        "start": 2448.08,
        "end": 2453.1200000000003
    },
    {
        "text": " combinaciones de todas las que podemos analizar bajo los distintos contextos de la economía",
        "start": 2453.1200000000003,
        "end": 2459.6
    },
    {
        "text": " que queramos analizar aparecen todos esos puntitos ahí que están. La baricella ésta que",
        "start": 2459.6,
        "end": 2466.7200000000003
    },
    {
        "text": " la vamos a atacar solo acá. Vamos a analizar ahora una política fiscal bajo libre movilidad",
        "start": 2466.72,
        "end": 2476.52
    },
    {
        "text": " de capitales y bajo los dos sistemas cambiarios, vamos a los dos. Después vamos a ver una política",
        "start": 2476.52,
        "end": 2482.2799999999997
    },
    {
        "text": " monetaria, solo con libre movilidad de capitales y tipo de cambio fijo y los otros los",
        "start": 2482.2799999999997,
        "end": 2487.12
    },
    {
        "text": " eljamos. No nos va a dar el tiempo para ver una política cambiaria, acá una aclaración,",
        "start": 2487.12,
        "end": 2494.24
    },
    {
        "text": " esto en realidad no existe. Política cambia es cuando el gobierno maneja el tipo de cambio",
        "start": 2494.24,
        "end": 2500.9599999999996
    },
    {
        "text": " y si es flexible no lo maneja, o sea que ahí en realidad no va a iría al puntito. Si",
        "start": 2500.9599999999996,
        "end": 2506.16
    },
    {
        "text": " eso es algo que no corresponde, no tiene sentido decir que el gobierno usa el tipo de cambio",
        "start": 2506.16,
        "end": 2511.8399999999997
    },
    {
        "text": " si las reglas jugos son que no lo influye, no tiene que intervina. Y lo otro que vamos a",
        "start": 2511.8399999999997,
        "end": 2519.08
    },
    {
        "text": " ver para ver un yoco al menos es este. Sí, ahora todos los demás que no vamos a ver,",
        "start": 2519.08,
        "end": 2527.88
    },
    {
        "text": " capaz que se van a dar cuenta en un rato, realias lo mismo, porque lo que cambia es",
        "start": 2527.88,
        "end": 2534.3199999999997
    },
    {
        "text": " el arranque de nuestro razonamiento. Vamos a utilizar un par de pizarrones para ir vinculando",
        "start": 2534.3199999999997,
        "end": 2539.52
    },
    {
        "text": " si pasa una variada, lesis sube si baja, cómo lo vincula a un otro y todos los casos que",
        "start": 2539.52,
        "end": 2544.44
    },
    {
        "text": " hagamos van a ver que son similares, tenemos que ver que pasan un mercado, cómo lo relaciona",
        "start": 2544.44,
        "end": 2549.8
    },
    {
        "text": " a un otro, cómo vamos sacando conclusiones de manera ordenada. Entonces no hay que hacer",
        "start": 2549.8,
        "end": 2554.8
    },
    {
        "text": " todos, y de hecho cuando dedicábamos dos clases enteras, ¿todas años pasado o al otro?",
        "start": 2554.8,
        "end": 2559.8
    },
    {
        "text": " Creo, ya el año pasado no, pero cuando dedicábamos dos clases enteras a ver muchos de estos",
        "start": 2559.8,
        "end": 2565.12
    },
    {
        "text": " ejemplos, y en el práctico 3 de hecho toca algunos de estos, y se terminaba haciendo",
        "start": 2565.12,
        "end": 2572.56
    },
    {
        "text": " medio aburrido, pues ya le agarraba en la mano. Todos estos casos los tienen en el material",
        "start": 2572.56,
        "end": 2579.52
    },
    {
        "text": " biográfico, si hay alguien repasando algún parcial viejo quiere verificar si está bien",
        "start": 2579.52,
        "end": 2585.88
    },
    {
        "text": " o está mal el razonamiento que está haciendo. Pero antes de seguir hablando, vamos a meternos",
        "start": 2585.88,
        "end": 2590.04
    },
    {
        "text": " con uno y a ver qué es eso que es la aspiración que mantengo desde hace unos años de que este",
        "start": 2590.04,
        "end": 2599.94
    },
    {
        "text": " bloque macro termine con esto, de poder ustedes integrar distintos razonamientos, distintos",
        "start": 2599.94,
        "end": 2605.26
    },
    {
        "text": " conceptos y cómo los vinculan uno con otro. Así que vamos a ir a eso, ya.",
        "start": 2605.26,
        "end": 2610.68
    },
    {
        "text": " Vamos a analizar entonces una política fiscal expansiva que quiere decir esto, el objetivo",
        "start": 2610.68,
        "end": 2640.24
    },
    {
        "text": " de la política acá recuerden, lo asociamos al PBI y PC, tenemos la demanda agregada y la idea",
        "start": 2640.24,
        "end": 2652.7999999999997
    },
    {
        "text": " es que si esta es nuestro nivel de producción que la economía crezca. Vamos a siempre analizar",
        "start": 2652.7999999999997,
        "end": 2661.04
    },
    {
        "text": " las políticas macro buscando el crecimiento económico, o sea que tienen que ser algo",
        "start": 2661.04,
        "end": 2666.9599999999996
    },
    {
        "text": " que nos mueva hacia la derecha en el eje de la producción y eso está asociado a que",
        "start": 2666.96,
        "end": 2673.0
    },
    {
        "text": " podamos hacer algo que nos mueva la demanda hacia la derecha. Este es el objetivo de la política.",
        "start": 2673.0,
        "end": 2679.7200000000003
    },
    {
        "text": " De cualquiera de las políticas macro sería que el PBI se vaya a la derecha. Como esta",
        "start": 2679.7200000000003,
        "end": 2686.56
    },
    {
        "text": " es una política de demanda que va a tratar de tocar el gasto, va a tratar de aumentarla",
        "start": 2686.56,
        "end": 2691.28
    },
    {
        "text": " además. Le podemos tener que ponerlo afarta, pero eso déjenme un ratito y introduciendo",
        "start": 2691.28,
        "end": 2697.1600000000003
    },
    {
        "text": " a poco las cosas. Entonces, el objetivo de la política es que la demanda agregada compuesta",
        "start": 2697.1600000000003,
        "end": 2704.92
    },
    {
        "text": " por los cinco componentes que ya conocemos, aumente, esto es lo que quiere la política, ese",
        "start": 2704.92,
        "end": 2712.6400000000003
    },
    {
        "text": " es el objetivo, objetivo que aumenta la demanda agregada. ¿Cómo hace una política fiscal para",
        "start": 2712.6400000000003,
        "end": 2720.48
    },
    {
        "text": " aumentar la demanda agregada? Bien directo. Esto es lo que hace. Aumente agosto. ¿Sí? Podríamos",
        "start": 2720.48,
        "end": 2731.48
    },
    {
        "text": " analizar una política fiscal que bajara los impuestos. Es parecida a la conclusión. En algún caso,",
        "start": 2731.48,
        "end": 2737.8
    },
    {
        "text": " se puede complejizar por eso lo mejor es analizar una política fiscal que aumenta el gasto y",
        "start": 2737.8,
        "end": 2743.28
    },
    {
        "text": " no que bajé los impuestos. ¿Y acá esto como lo hacía? Pagaba más jubilaciones, decidía",
        "start": 2743.28,
        "end": 2751.2400000000002
    },
    {
        "text": " aumentar las jubilaciones? No. Porque esto era demanda agregada, no era todo gasto público,",
        "start": 2751.2400000000002,
        "end": 2759.0400000000004
    },
    {
        "text": " era demanda agregada. Entonces, ¿qué es lo que hace cuando decimos aumente agosto? Más",
        "start": 2759.0400000000004,
        "end": 2766.0800000000004
    },
    {
        "text": " inversiones en infraestructura, por ejemplo, seguimos prestación de servicios públic. Bien?",
        "start": 2766.0800000000004,
        "end": 2772.28
    },
    {
        "text": " Ahora, para hacer esas obras, ¿cómo las hace? Precisa fondo. ¿De dónde saca los fondos para",
        "start": 2772.4,
        "end": 2781.32
    },
    {
        "text": " financiar esto? O sea, esto nos aumenta la demanda. Bien directo y es lo que pusimos ahí. ¿Sí?",
        "start": 2781.32,
        "end": 2791.6800000000003
    },
    {
        "text": " Esto es la política. Ahora esto lo tiene que financiar y cómo lo va financiar. Una manera es",
        "start": 2791.68,
        "end": 2803.2799999999997
    },
    {
        "text": " cobrar más impuestos, ¿Sí? Pero si cobran más impuestos, esta demanda que la corrimos para",
        "start": 2803.2799999999997,
        "end": 2810.16
    },
    {
        "text": " la derecha viene para atrás. Entonces, no nos complique por impuestos en los financieros. La",
        "start": 2810.16,
        "end": 2816.04
    },
    {
        "text": " otra manera era emitir dinero, pero esa es la política monetaria, la segunda que tenemos",
        "start": 2816.04,
        "end": 2821.04
    },
    {
        "text": " allá. Entonces, para no mezclar, vayamos a lo que se llama una política fiscal pura que",
        "start": 2821.04,
        "end": 2826.4
    },
    {
        "text": " es financiar con deuda, con bonos, ¿no? Así que el gobierno decide gastar más porque tiene",
        "start": 2826.4,
        "end": 2837.88
    },
    {
        "text": " ese objetivo de que la economía crezca a través de un aumento de la demanda y lleva adelante",
        "start": 2837.88,
        "end": 2843.7599999999998
    },
    {
        "text": " más inversiones. Precisa fondos para pagar esas inversiones, ¿sendeuda? Pero para que le",
        "start": 2843.76,
        "end": 2849.36
    },
    {
        "text": " compren la deuda, ¿qué podríamos decir? ¿Qué va a aumentar la tasa de interés de la economía?",
        "start": 2849.36,
        "end": 2855.76
    },
    {
        "text": " En el promedio de la economía, ahora, para que le compren los bonos, hay unas bonos que pagan más.",
        "start": 2857.26,
        "end": 2862.76
    },
    {
        "text": " Entonces, en ese promedio, la tasa subió. ¿Y si suba la tasa de interés?",
        "start": 2862.76,
        "end": 2868.4
    },
    {
        "text": " Podemos decir, por un lado, que van a bajar las inversiones y que va a bajar aquí.",
        "start": 2874.26,
        "end": 2880.0400000000004
    },
    {
        "text": " Porque va a aumentar el agorro, va a bajar el consumo, ¿no? Entonces, tenemos acá estos dos efectos.",
        "start": 2885.44,
        "end": 2892.0
    },
    {
        "text": " ¿Sí? Que los traigo para acá, que es nuestro panel, ¿sí? De cómo van cambiando los distintos",
        "start": 2894.6800000000003,
        "end": 2903.44
    },
    {
        "text": " componentes de la demanda de la idea. Pero si suben la tasa de interés, ¿cómo han",
        "start": 2903.44,
        "end": 2910.44
    },
    {
        "text": " sacado cosas? ¿Qué pasa con el mercado financiero? Que el mercado financiero, este, que en Miraba,",
        "start": 2910.44,
        "end": 2920.44
    },
    {
        "text": " Uruguay, con el resto del mundo, ¿qué van a querer hacer los capitales financieros? Eso,",
        "start": 2920.44,
        "end": 2926.84
    },
    {
        "text": " esos agentes, los que decíamos que tenían un monitor, que veían cómo estaban rindiéndolo",
        "start": 2926.84,
        "end": 2931.0
    },
    {
        "text": " bueno de un país de otro, ¿qué les va a saltar acá en ese monitor? Le va a saltar",
        "start": 2931.0,
        "end": 2936.16
    },
    {
        "text": " la banderita Uruguay, con unos buenos que están pagando más, ¿no? ¿Por qué? Porque vamos",
        "start": 2936.16,
        "end": 2943.16
    },
    {
        "text": " a sumir que partimos de que estos eran iguales. ¿Sí? Datos de partida, las tasas de interés",
        "start": 2943.16,
        "end": 2950.32
    },
    {
        "text": " estaban igualadas. Digimos que estamos analizando, en el caso, de libre movilidad de capitales,",
        "start": 2950.32,
        "end": 2958.76
    },
    {
        "text": " estamos analizando, vamos a poner por acá los supuestos, la economía que estamos analizando",
        "start": 2958.76,
        "end": 2967.5600000000004
    },
    {
        "text": " es una economía pequeña con libre movilidad internacional de capitales financieros y que",
        "start": 2967.5600000000004,
        "end": 2980.6800000000003
    },
    {
        "text": " tiene como punto de partida que las tasas están igualadas. Entonces, si las tasas están",
        "start": 2980.68,
        "end": 2989.12
    },
    {
        "text": " igualadas, si la de Uruguay sube, porque el gobierno coloco más deuda, Uruguay está",
        "start": 2989.12,
        "end": 2995.64
    },
    {
        "text": " pagando más que otros países y si Uruguay está pagando más que otros países, ¿qué",
        "start": 2995.64,
        "end": 3001.8599999999997
    },
    {
        "text": " podemos esperar que ocurra? ¿Qué vengan a comprar el Bonu Uruguay? O sea que acá en cuanto",
        "start": 3001.86,
        "end": 3011.94
    },
    {
        "text": " a movilidad de capitales hacia dónde van los capitales, los financieros esto, hacia Uruguay",
        "start": 3011.94,
        "end": 3019.06
    },
    {
        "text": " o se van de Uruguay. Bienen hacia Uruguay, podemos hablar de un proceso de ingreso, de capitales",
        "start": 3019.06,
        "end": 3028.7400000000002
    },
    {
        "text": " financieros internacionales. Son especulativos, no? No vienen a poner una fábria, vienen a comprar",
        "start": 3028.74,
        "end": 3036.9799999999996
    },
    {
        "text": " el Bonu que está pagando más, vendieron el Bonu del Perú que pagaba a otras tasas interés",
        "start": 3036.9799999999996,
        "end": 3044.06
    },
    {
        "text": " y trajeron la plata para Uruguay. Y cómo viene esa plata a Uruguay? ¿Cómo vienen estos",
        "start": 3044.06,
        "end": 3048.8999999999996
    },
    {
        "text": " capitales? En qué moneda los traen? En dólar, o sea que esto que estamos hablando acá,",
        "start": 3048.8999999999996,
        "end": 3055.14
    },
    {
        "text": " del mercado financiero nos genera un impacto en el mercado de divisas. En qué parte del mercado",
        "start": 3055.14,
        "end": 3061.54
    },
    {
        "text": " de divisas? O farta, demanda, en la oferta porque vienen más dólares y es que esto ingreso",
        "start": 3061.54,
        "end": 3072.62
    },
    {
        "text": " de capitales. Unaumento, una disminución de la oferta. Unaumento de la oferta de divisas.",
        "start": 3072.62,
        "end": 3081.7799999999997
    },
    {
        "text": " Entonces estamos vinculando que el gobierno quiso hacer más obras pero para eso se endeudó",
        "start": 3082.78,
        "end": 3089.1400000000003
    },
    {
        "text": " y al endeudarse generó este flujo de capitales financieros que vinieron Uruguay y que en el",
        "start": 3089.1400000000003,
        "end": 3094.5400000000004
    },
    {
        "text": " mercado cambiario si también partimos como un supuesto de que la oferta de divisas era igual",
        "start": 3094.5400000000004,
        "end": 3102.7000000000003
    },
    {
        "text": " a la demanda, o sea que las teníamos igualadas, que partimos unas situaciones equilibradas,",
        "start": 3102.7000000000003,
        "end": 3108.46
    },
    {
        "text": " lo que vamos a tener entonces es que la oferta de divisas ahora va a ser mayor a la demanda",
        "start": 3108.46,
        "end": 3117.78
    },
    {
        "text": " de divisas. Y en el mercado cambiario que pasa si hay muchos dólares y poca gente que",
        "start": 3117.78,
        "end": 3126.5
    },
    {
        "text": " los quiere comprar. La cotización, el tipo de cambio, vamos a poner, se generan presiones,",
        "start": 3126.5,
        "end": 3135.78
    },
    {
        "text": " a que baje el tipo de cambio. Ahora lo que ocurra va a depender del sistema cambiario.",
        "start": 3138.46,
        "end": 3149.78
    },
    {
        "text": " Entonces acá vamos a abrir el razonamiento. Por eso hoy les decía, vamos a analizar estos",
        "start": 3149.78,
        "end": 3163.46
    },
    {
        "text": " dos casos juntos. Hasta acá no importa qué sistema cambiario, el sistema cambiario recién",
        "start": 3163.46,
        "end": 3172.46
    },
    {
        "text": " ahora nos permite. Una pregunta antes, si las reglas de juego no hubieran sido libre",
        "start": 3172.46,
        "end": 3180.7400000000002
    },
    {
        "text": " movilidad de capitales, hubiéramos llegado hasta allá hasta que ya flechita, ¿qué pasaba?",
        "start": 3180.7400000000002,
        "end": 3189.46
    },
    {
        "text": " Que generaba este diferencial y cuando querían venir a estos capitales en el exterior",
        "start": 3189.46,
        "end": 3193.42
    },
    {
        "text": " y comprar el buen especulativo en Uruguay le decía no te dejamos entrar. O sea que esta flecha",
        "start": 3193.42,
        "end": 3201.34
    },
    {
        "text": " para allá se nos corta todo el razonamiento si hubiéramos estado en este caso de acá,",
        "start": 3201.34,
        "end": 3206.5
    },
    {
        "text": " en algunos de estos dos casos de acá. Algunos de estos dos casos de acá en realidad ahí",
        "start": 3206.5,
        "end": 3211.68
    },
    {
        "text": " se corta el razonamiento, ya no nos servimos. Bueno pero estamos entonces en una economía",
        "start": 3211.68,
        "end": 3218.18
    },
    {
        "text": " que generó presiones a que el tipo de cambio bajé y donde las reglas jugos son que el",
        "start": 3218.18,
        "end": 3223.22
    },
    {
        "text": " Banco Central dijo, tipo de cambio fijo, ¿qué eran esas reglas? ¿Qué indicaban? Que",
        "start": 3223.22,
        "end": 3230.94
    },
    {
        "text": " el Banco Central salía a comprar o vender para mantener la cotización. En este caso",
        "start": 3230.94,
        "end": 3236.5
    },
    {
        "text": " que tiende a bajar, ¿por qué es que tiende a bajar? ¿Por qué hay muchos dólares o por",
        "start": 3236.5,
        "end": 3242.2599999999998
    },
    {
        "text": " que hay mucha demanda? Porque hay muchos dólares, mucho oferta, ¿qué es lo que está",
        "start": 3242.26,
        "end": 3247.86
    },
    {
        "text": " faltando entonces? Comprador, ¿cómo tiene que intervenir el Banco Central entonces? ¿Cómo",
        "start": 3247.86,
        "end": 3254.86
    },
    {
        "text": " comprador? Entonces acá el Banco Central va a aparecer en este cadena de razonamiento",
        "start": 3254.86,
        "end": 3261.5400000000004
    },
    {
        "text": " comprando vivizas. Bien, para mantener, se compra divizas, o ponemos así, para que quede",
        "start": 3261.54,
        "end": 3274.18
    },
    {
        "text": " igual el tipo de cambio. Esas eran las reglas de juego. Hay exceso de oferta, bajo tipo",
        "start": 3274.18,
        "end": 3283.1
    },
    {
        "text": " del cambio fijo, el Banco Central tiene que salir a comprar. ¿Y cuando compra? ¿Qué",
        "start": 3283.1,
        "end": 3294.2999999999997
    },
    {
        "text": " pasa con la cantidad de dólares que tiene el Banco Central y si compro más van a aumentar",
        "start": 3294.2999999999997,
        "end": 3300.2599999999998
    },
    {
        "text": " y de la mano y va a esto otro, ¿no? Porque en la compra del Banco Central de dólares se",
        "start": 3300.2599999999998,
        "end": 3304.02
    },
    {
        "text": " acuerdan, entrega comprad dólares o es si de dólares y a cambio queda, con que los pago,",
        "start": 3304.02,
        "end": 3311.02
    },
    {
        "text": " con pesos. Entonces, ¿qué pasa con la cantidad de pesos? Le monea nacional. Aumén. Bien.",
        "start": 3311.02,
        "end": 3321.9
    },
    {
        "text": " ¿Y si aumenta la cantidad de dinero? ¿Qué pasaba con la variable? Con la variable tasa",
        "start": 3321.9,
        "end": 3328.42
    },
    {
        "text": " de interés. ¿Cómo era la relación entre los dos? Era inversa. Recuerdan por qué, de",
        "start": 3328.42,
        "end": 3336.86
    },
    {
        "text": " donde sacábamos, ¿qué era lo que nos llevaba ese sustento? Banco Central quería colocar",
        "start": 3336.86,
        "end": 3342.42
    },
    {
        "text": " letras, ¿sí? Para colocar una letra, para que se la compraran, pareció lo del bueno",
        "start": 3342.42,
        "end": 3348.7000000000003
    },
    {
        "text": " que dijimos acá, pero en este caso era Banco Central. Para que se la compraran, ¿qué",
        "start": 3348.7000000000003,
        "end": 3353.6600000000003
    },
    {
        "text": " pasaba? Tenía que subir la tasa de interés. Y cuando colocaba esa letra, que nos llevaba",
        "start": 3353.6600000000003,
        "end": 3360.78
    },
    {
        "text": " la tasa de interés arriba, a cambio que recibía lo Banco Central. Pesos, las letras",
        "start": 3360.78,
        "end": 3367.38
    },
    {
        "text": " están las puñan pesos. Entonces, ¿qué pasaba con la cantidad de dinero? Baja, suba la",
        "start": 3367.38,
        "end": 3372.5400000000004
    },
    {
        "text": " tasa, porque colocó letras, baja la cantidad de dinero, porque retiró dinero a cambio de",
        "start": 3372.5400000000004,
        "end": 3378.02
    },
    {
        "text": " esa letra. Entonces, la relación inversa la fundábamos por este lado. Y acá está pasando",
        "start": 3378.02,
        "end": 3384.0600000000004
    },
    {
        "text": " el proceso inverso en alguna manera. Y le voy a agregar algo a esto. Baja la tasa y",
        "start": 3384.0600000000004,
        "end": 3389.9
    },
    {
        "text": " voy a poner esto, hasta que vuelva al valor internacional. ¿Sí? Y ¿por qué se me ocurrió",
        "start": 3389.9,
        "end": 3402.14
    },
    {
        "text": " poner eso? ¿Qué pasa si las tasas no bajaba tanto? Y vamos a ir teniendo esto. Y seguimos",
        "start": 3402.14,
        "end": 3413.1800000000003
    },
    {
        "text": " con esto más presiones hasta que bajé al valor que tiene que bajar. Y si se pasaba",
        "start": 3413.18,
        "end": 3421.16
    },
    {
        "text": " arrozca en la bajada, acá se nos daba al revés. Eso tiende a igualarse. Bien. Bien,",
        "start": 3421.16,
        "end": 3434.5
    },
    {
        "text": " ¿as ahí? Pregunta. Gobierno, colegó estos bonos, aumentó la tasa. Esta flechita acá.",
        "start": 3434.5,
        "end": 3444.96
    },
    {
        "text": " Aumentó la tasa de interés, los agentes económicos, esos que miran monitores y",
        "start": 3444.96,
        "end": 3449.46
    },
    {
        "text": " detoman decisiones de inversiones financieras, ven esto y mandan los fondos para Uruguay.",
        "start": 3449.46,
        "end": 3454.58
    },
    {
        "text": " ¿Cuánto demora esto? Entre que les aparece en el monitor Uruguay en Mithiomas y",
        "start": 3454.58,
        "end": 3463.84
    },
    {
        "text": " tomaron la decisión y vinieron los capitales Uruguay. Una película con algunos de la",
        "start": 3463.84,
        "end": 3471.76
    },
    {
        "text": " bolsa de Valor, ¿vieron alguna vez? Todo estresado y pañente y todo muy rápido, ¿no?",
        "start": 3471.76,
        "end": 3477.36
    },
    {
        "text": " O sea, esto es un ratito. Nazora, si quieren, como mucho. Llegaron los dos de las resoruguay,",
        "start": 3477.36,
        "end": 3485.1200000000003
    },
    {
        "text": " el banco central B que hay exceso oferta y las reglas son que tiene que intervenir. ¿Cuánto",
        "start": 3485.1200000000003,
        "end": 3490.6800000000003
    },
    {
        "text": " demora esta intervención de lo anco central? En el día también. ¿Cuánto demora entonces",
        "start": 3490.68,
        "end": 3499.9199999999996
    },
    {
        "text": " en bajar la tasa hasta su valor original? Desde que subió acá hasta que volvió a su valor",
        "start": 3499.9199999999996,
        "end": 3509.04
    },
    {
        "text": " original al final del razonamiento. ¿Estamos hablando del día? ¿No? Vamos a pensar esto",
        "start": 3509.04,
        "end": 3516.0
    },
    {
        "text": " acá. Subió la tasa y el empresario decide invertir menos. Invertir menos puede estar",
        "start": 3516.0,
        "end": 3523.52
    },
    {
        "text": " implicando que tenía un negocio y lo cierra. Y capaz que tiene que echar gente y capaz que",
        "start": 3523.52,
        "end": 3531.4
    },
    {
        "text": " tiene que cortar insumos contra el mercadería. ¿Cuánto demora eso? Días, semanas, meses,",
        "start": 3531.4,
        "end": 3542.12
    },
    {
        "text": " capaz, ¿no? Depende el hijo de puta que sea para ver si hecha el mismo día o no. Pero",
        "start": 3542.12,
        "end": 3546.7999999999997
    },
    {
        "text": " seguro demora más que estas horas de acá, ¿no? Y el consumidor entre decidir tomar la decisión",
        "start": 3546.7999999999997,
        "end": 3553.88
    },
    {
        "text": " para que hago consumo hoy o consumo aguardo para un viaje en el futuro o hoy consumo",
        "start": 3553.88,
        "end": 3559.7799999999997
    },
    {
        "text": " menos y me hago un viaje el año. También llevo un tiempo, ¿no? Por lo tanto, esto de acá,",
        "start": 3559.7799999999997,
        "end": 3565.68
    },
    {
        "text": " esta flecha acá tiene una velocidad de ajuste. Sí? Una velocidad justa y mayor. Los mercados,",
        "start": 3565.68,
        "end": 3581.52
    },
    {
        "text": " financieros y cambiarios y monetarios tienen una velocidad justa y mucho mayor que lo que",
        "start": 3581.52,
        "end": 3590.52
    },
    {
        "text": " tenemos acá que son los marcados de bienes. Velocidad de ajuste menor. Entonces, ante la",
        "start": 3590.52,
        "end": 3606.22
    },
    {
        "text": " pregunta de si esto efectivamente se da que los hogares consumieron menos que las empresas",
        "start": 3606.22,
        "end": 3613.68
    },
    {
        "text": " hay buenas cerraron. En realidad esto no ocurre. Esto no se termina. Está bien nuestro",
        "start": 3613.68,
        "end": 3622.3199999999997
    },
    {
        "text": " razonamiento de pensar lo que si subía R nos llevaba a eso. Pero si le incorporamos esto",
        "start": 3622.3199999999997,
        "end": 3627.8799999999997
    },
    {
        "text": " que en realidad todo lo que verivó este ajuste acá arriba o estas variaciones acá arriba,",
        "start": 3627.8799999999997,
        "end": 3633.3599999999997
    },
    {
        "text": " en realidad se pierden porque la juste se da de manera más instantánea en la parte financiera.",
        "start": 3633.3599999999997,
        "end": 3639.16
    },
    {
        "text": " Hace en que lo darrío en realidad no ocurre. No llega ocurrido. Al empresario que su",
        "start": 3639.16,
        "end": 3644.1
    },
    {
        "text": " acceso lo dijo, che, mira que subió la tasa de interés. Capablemente conmime cerrar el",
        "start": 3644.1,
        "end": 3648.0
    },
    {
        "text": " negocio y poner la plata, comprar el bueno de este gobierno. Al rato le llamó de vuelta",
        "start": 3648.0,
        "end": 3652.68
    },
    {
        "text": " y le dijo, no, mirado olvidate, la tasa ya volvió a su valor. Sí? Por esto es la movilidad",
        "start": 3652.68,
        "end": 3659.3199999999997
    },
    {
        "text": " de capitales de este dato que acá habíamos dicho que esta flechita efectivamente se daba",
        "start": 3659.3199999999997,
        "end": 3666.04
    },
    {
        "text": " porque estamos en libre movilidad de capitales, quien es al libre movilidad de capitales",
        "start": 3666.04,
        "end": 3669.92
    },
    {
        "text": " hace que esos capitales nos corrigen eso de ahí. Bien, entonces en definitiva ¿qué le",
        "start": 3669.92,
        "end": 3677.32
    },
    {
        "text": " pasó a la demanda agregada de la economía? Aumentó por el gasto y después nosotros podríamos",
        "start": 3677.32,
        "end": 3684.2799999999997
    },
    {
        "text": " repasar qué pasa con las variables que dependen del consumo, impuestos, precios, ingresos,",
        "start": 3684.2799999999997,
        "end": 3694.08
    },
    {
        "text": " también estaba asociada a esta. Taza de interés, quedaron todas iguales. Entonces en realidad",
        "start": 3694.08,
        "end": 3702.24
    },
    {
        "text": " acá quedó igual. La inversión de qué dependía. ¿Qué quedó igual? Las exportaciones tipo",
        "start": 3702.24,
        "end": 3713.48
    },
    {
        "text": " de cambio, precios, precios internacionales no están en este relacionamiento, no están",
        "start": 3713.48,
        "end": 3718.72
    },
    {
        "text": " pasando nada. Con lo cual la política de demanda del gobierno termina dando el resultado",
        "start": 3718.72,
        "end": 3727.7999999999997
    },
    {
        "text": " que quería, que era aumentar la demanda agregada. Genera esas otras cosas, generó que entraron",
        "start": 3727.7999999999997,
        "end": 3735.16
    },
    {
        "text": " capitales, generó que lo han concentrado el tubo que intervenir, pero termina teniendo",
        "start": 3735.16,
        "end": 3744.2799999999997
    },
    {
        "text": " ese resultado de que la demanda agregada aumenta. ¿Qué pasa si hubiera sido tipo de",
        "start": 3744.28,
        "end": 3755.36
    },
    {
        "text": " cambio flexibles? Volvemos al resonamiento acá, ¿no? A que teníamos una economía donde",
        "start": 3755.36,
        "end": 3762.46
    },
    {
        "text": " se habían generado presiones para que el tipo de cambio bajara. Si las reenlajó",
        "start": 3762.46,
        "end": 3771.52
    },
    {
        "text": " eran tipo de cambio flexibles que hace el gobierno, nada y entonces ¿qué pasa? Baja el tipo",
        "start": 3771.52,
        "end": 3780.24
    },
    {
        "text": " de cambio. ¿Y si baja el tipo de cambio? ¿Qué podemos pensar que ocurra? Aquí en el",
        "start": 3780.24,
        "end": 3789.52
    },
    {
        "text": " favor decía por el tema de competitividad perdíamos competitividad ¿no? Y la pérdida de competitividad",
        "start": 3789.52,
        "end": 3801.96
    },
    {
        "text": " que no se iba a llevar. Lo podíamos mirar de esta manera ¿no? Estaba el indicador aquel",
        "start": 3801.96,
        "end": 3806.64
    },
    {
        "text": " que nos comparaba esto ¿no? ¿Sí? Entonces ¿qué pasa si esto queda igual, si esto baja",
        "start": 3806.64,
        "end": 3816.96
    },
    {
        "text": " y esto queda igual? Los precios de los productos urballos en pesos quedan iguales, pero los",
        "start": 3816.96,
        "end": 3823.2400000000002
    },
    {
        "text": " precios de los productos internacionales en la misma moneda que les pasa. Baja los precios",
        "start": 3823.2400000000002,
        "end": 3829.78
    },
    {
        "text": " nuestros competidores se abaratan en comparación con Uruguay y entonces ¿qué vamos a decir?",
        "start": 3829.78,
        "end": 3836.2
    },
    {
        "text": " ¿Por el asexpo y las importaciones? Van a bajar las expor y van a aumentar las importaciones.",
        "start": 3836.2,
        "end": 3844.48
    },
    {
        "text": " Entonces con tipo de cambio flexible vamos encontrando.",
        "start": 3846.9399999999996,
        "end": 3851.3199999999997
    },
    {
        "text": " Que lo que el gobierno quiso, que era que esto aumentara para que aumentara la demanda,",
        "start": 3859.0,
        "end": 3863.8399999999997
    },
    {
        "text": " tiene como efecto esto otro que nos lleva aquí bajo y la demanda ¿sí?",
        "start": 3863.84,
        "end": 3870.32
    },
    {
        "text": " Acá lo podríamos enriquecer y decir bueno pero esto no genera entonces un deterioro de la",
        "start": 3872.32,
        "end": 3877.32
    },
    {
        "text": " balanza comercial. Bien y le voy a agregar un dato más, vamos ponernos por acá y es que esta",
        "start": 3877.32,
        "end": 3895.04
    },
    {
        "text": " caída del tipo de cambio no lleva a que caiga la tasa de interés hasta que iguala",
        "start": 3895.04,
        "end": 3906.2000000000003
    },
    {
        "text": " a la internacional. Recuerden que estamos con libre movilidad de capital, la libre movilidad",
        "start": 3906.2,
        "end": 3915.08
    },
    {
        "text": " de capital es ese proceso que nos lleva a que pasa en cosas para que se ajuste la tasa de",
        "start": 3915.08,
        "end": 3920.8399999999997
    },
    {
        "text": " interés de vuelta a lo que es por ser una economía pequeña la que estamos en el santo a la",
        "start": 3920.8399999999997,
        "end": 3924.96
    },
    {
        "text": " internacional. Ahora con las herramientas que nosotros manejamos ¿cómo puedo relacionar que si",
        "start": 3924.96,
        "end": 3930.66
    },
    {
        "text": " cae el tipo de cambio va a quedar la tasa de interés de Uruguay. Ahí nos vamos a quella",
        "start": 3930.66,
        "end": 3936.98
    },
    {
        "text": " yeda que habíamos manejado que la tasa de Uruguay se conformaba a partir del estado",
        "start": 3936.98,
        "end": 3942.7799999999997
    },
    {
        "text": " unidos más que deciramos. Esta era el bueno de Uruguay en pesos para emitir un",
        "start": 3942.7799999999997,
        "end": 3951.22
    },
    {
        "text": " bueno en pesos, a una tasa en pesos tiene que mirar lo que pagan dólares Estados Unidos más",
        "start": 3951.22,
        "end": 3956.7799999999997
    },
    {
        "text": " que el riesgo país porque era Uruguay el que emitía esto y no Estados Unidos más la",
        "start": 3956.78,
        "end": 3965.34
    },
    {
        "text": " variación del tipo de cambio y entonces si el tipo de cambio está cayendo si esto está",
        "start": 3965.34,
        "end": 3973.1400000000003
    },
    {
        "text": " cayendo el impacto va a ser que la tasa de interés va a quedar por ahí es el canal de",
        "start": 3973.1400000000003,
        "end": 3980.0600000000004
    },
    {
        "text": " razonamiento que podemos utilizar con lo que hemos desarrollado y le voy a agregar otro",
        "start": 3980.06,
        "end": 3986.82
    },
    {
        "text": " dato más y ahora comento por qué cae el saldo de balanza comercial y vamos a ponerlo",
        "start": 3986.82,
        "end": 3994.2599999999998
    },
    {
        "text": " compensando",
        "start": 3999.5,
        "end": 4000.9
    },
    {
        "text": " el incremento de gasto o sea lo que estoy diciendo en ese final con esto negro es que estos dos son",
        "start": 4000.9,
        "end": 4012.3
    },
    {
        "text": " iguales que lo que aumentó por acá la demanda se nos fue con la caída de esta acá y en definitiva",
        "start": 4012.3,
        "end": 4020.14
    },
    {
        "text": " el resultado de este es iguales. ¿Cómo podemos razonar eso con la cerramenta de desarrollamos?",
        "start": 4020.14,
        "end": 4028.7400000000002
    },
    {
        "text": " hace unos años muchos más de diez habíamos desarrollado un anexo que está en el capítulo 7,",
        "start": 4031.78,
        "end": 4038.38
    },
    {
        "text": " el anexo vinculado a otro modelo, no el modelo o fartillemanda sino el denominado manda el",
        "start": 4038.38,
        "end": 4043.8
    },
    {
        "text": " Fleming que no servía por unas curvas ahí para justamente darnos cuenta que esto era igual que",
        "start": 4043.8,
        "end": 4050.42
    },
    {
        "text": " lo que caía acá compensaba el otro desde hace varios años preferir y no tirarles otro modelo arriba",
        "start": 4050.42,
        "end": 4056.7400000000002
    },
    {
        "text": " a la mesa y en algunos casos como este decirles bueno tengamos en cuenta este dato no está en",
        "start": 4056.74,
        "end": 4063.2999999999997
    },
    {
        "text": " grave si estamos vinculando todo lo demás y solo eso nos falta ahí un razonamiento auxiliar bueno",
        "start": 4063.2999999999997,
        "end": 4070.4199999999996
    },
    {
        "text": " que demonos con esa cara o sea que ya aprovecho para decir entonces que el anexo del capítulo 7",
        "start": 4070.4199999999996,
        "end": 4078.66
    },
    {
        "text": " insisto esta idea el capítulo 7 son todos estos casos que aparecen acá no hay que leerlos todo",
        "start": 4079.62,
        "end": 4086.58
    },
    {
        "text": " ahora para entender todos esos casos el capítulo 7 cuando fue armado tenía ese anexo y tenía",
        "start": 4089.22,
        "end": 4094.7799999999997
    },
    {
        "text": " unas notas a piecas y analución a eso eso no es necesario",
        "start": 4094.7799999999997,
        "end": 4098.7
    },
    {
        "text": " vamos a ver este el razonamiento que hicimos acá vamos a verlo con una pregunta un parcial",
        "start": 4109.54,
        "end": 4124.34
    },
    {
        "text": " porque si bien me aspiraciones que a partir de que ustedes a que a ustedes le digan que en una",
        "start": 4124.34,
        "end": 4130.78
    },
    {
        "text": " economía pequeña con esta movilidad de capitales con tipo de cambio el sistema que sea una política",
        "start": 4130.78,
        "end": 4137.099999999999
    },
    {
        "text": " fiscal genera tal es cosa si ustedes las puedan analizar las preguntas del parcial tiene una ayuda y",
        "start": 4137.1,
        "end": 4143.22
    },
    {
        "text": " es que les van dando los distintos pasos de la cadena entonces para el que lo vio repasemos y para",
        "start": 4143.22,
        "end": 4149.58
    },
    {
        "text": " el que no vio todavía preguntas de este tipo se encuentra por dónde viene la mano tengo la",
        "start": 4149.58,
        "end": 4155.92
    },
    {
        "text": " pregunta del examen de diciembre del 2014 dice cuando en una economía pequeña abierta con libre",
        "start": 4155.92,
        "end": 4165.54
    },
    {
        "text": " movilidad internacional de capitales y desempleo acá nos manejamos el dato de desempleo como podría",
        "start": 4165.54,
        "end": 4171.74
    },
    {
        "text": " incorporar el dato del desempleo",
        "start": 4171.74,
        "end": 4173.34
    },
    {
        "text": " que la economía tiene desempleo",
        "start": 4183.1,
        "end": 4185.14
    },
    {
        "text": " donde podría poner ese dato",
        "start": 4189.14,
        "end": 4190.86
    },
    {
        "text": " menos ingreso o sea que este no es el de pleno empleo el punto de partida no es el de pleno empleo",
        "start": 4190.86,
        "end": 4200.139999999999
    },
    {
        "text": " que el de pleno empleo esté por allá y además si voy a poner una curva de oferta acá",
        "start": 4200.139999999999,
        "end": 4204.46
    },
    {
        "text": " cuál pondría",
        "start": 4207.0599999999995,
        "end": 4208.0599999999995
    },
    {
        "text": " clásica que inesiana",
        "start": 4210.66,
        "end": 4212.179999999999
    },
    {
        "text": " si estoy con desempleo",
        "start": 4214.9,
        "end": 4216.42
    },
    {
        "text": " clásica que inesiana no entonces debería hacer una curva de oferta por el estito",
        "start": 4217.42,
        "end": 4227.22
    },
    {
        "text": " entonces dice la letra bajo esa economía el gobierno aplica una política fiscal expansiva",
        "start": 4229.22,
        "end": 4235.02
    },
    {
        "text": " expansiva quiere decir que aumenta la demanda se generan los siguientes efectos según el",
        "start": 4235.02,
        "end": 4240.74
    },
    {
        "text": " sistema de tipo de cambio sea y opciona dice flexible cuáles son los efectos que están en",
        "start": 4240.74,
        "end": 4246.7
    },
    {
        "text": " esta opciona vamos a poner por acá opciona opción b opción c opciona dice sube la tasa de",
        "start": 4246.7,
        "end": 4254.3
    },
    {
        "text": " interés para financiar el mayor gasto está diciendo esto correcto",
        "start": 4254.3,
        "end": 4259.3
    },
    {
        "text": " aumenta la oferta de divisas o sea el razonamiento sigue pero no sigue encadenado o sea estos",
        "start": 4263.78,
        "end": 4270.42
    },
    {
        "text": " otros pasos van a aparecer en las otras opciones pero acá el segundo paso de la opciona me dice",
        "start": 4270.42,
        "end": 4276.34
    },
    {
        "text": " aumenta la oferta de divisas o sea que estoy siguiendo acá correcto lo que dice después",
        "start": 4276.34,
        "end": 4287.58
    },
    {
        "text": " dice intervención compradora del banco central dije que la opciona era de tipo de cambio flexible",
        "start": 4287.58,
        "end": 4293.74
    },
    {
        "text": " y está diciendo esto banco central intervención compradora es compradora pero bajo tipo",
        "start": 4294.74,
        "end": 4305.62
    },
    {
        "text": " acá me ofijo esta es la opción flexible o sea que acá en realidad tendremos que hacer una cruz",
        "start": 4305.62,
        "end": 4310.219999999999
    },
    {
        "text": " muy grande o es flexible ahí no debería y aumenta la demanda agregada y termina diciendo bueno",
        "start": 4310.219999999999,
        "end": 4322.219999999999
    },
    {
        "text": " en el final de acá no sabía que ha quedado acá no ahí nos quedó medio desorganizado",
        "start": 4322.22,
        "end": 4326.34
    },
    {
        "text": " que aumentaba la demanda podríamos decir bueno ahí estaba bien porque ese razonamiento",
        "start": 4327.740000000001,
        "end": 4333.5
    },
    {
        "text": " no perdón era flexible no perdón perdón",
        "start": 4333.5,
        "end": 4337.46
    },
    {
        "text": " acá y lo está diciendo mal porque dice que aumenta o sea que en realidad acá es otra cruz más",
        "start": 4342.06,
        "end": 4348.740000000001
    },
    {
        "text": " opción b tipo de cambio fijo es la opción b y habla diferencial de tasas favorables a los",
        "start": 4352.9400000000005,
        "end": 4360.14
    },
    {
        "text": " buenos nacionales no dice esto otro correcto no este fijo",
        "start": 4360.14,
        "end": 4368.66
    },
    {
        "text": " perdida competitividad llene por acá y habla de perdida competitividad con tipo de cambio",
        "start": 4372.46,
        "end": 4381.740000000001
    },
    {
        "text": " fijo no no deterioro de la balanza comercial que compensa el aumento del gasto",
        "start": 4381.74,
        "end": 4391.78
    },
    {
        "text": " balanza comercial que compensa el aumento del gasto pero estamos hablando de tipo",
        "start": 4394.94,
        "end": 4400.36
    },
    {
        "text": " cambio fijo está como cruzado esto no va afectando el pbí estábamos diciendo fijo o sea acá",
        "start": 4400.36,
        "end": 4414.28
    },
    {
        "text": " en realidad acá nos faltaban un paso más esto era la demanda si yo quiero ir al pbí debería",
        "start": 4418.2,
        "end": 4426.2
    },
    {
        "text": " decir bueno la economía termina estando acá la economía partió de esta situación de",
        "start": 4426.2,
        "end": 4433.5599999999995
    },
    {
        "text": " y viene a deprimo o sea que en términos de pbí que también lo podemos descomponer en los",
        "start": 4437.04,
        "end": 4446.08
    },
    {
        "text": " componentes del pbí tenemos que el gobierno aumentó esto pero al final que es lo que ocurre",
        "start": 4446.08,
        "end": 4451.679999999999
    },
    {
        "text": " encuentra el resultado si teníamos una economía con desempleo nuestro nuevo punto de equilibrio",
        "start": 4451.68,
        "end": 4457.72
    },
    {
        "text": " es este nos muestra un aumento de cu sí o sea esto sí es el pb esto acá era la demanda solo nos",
        "start": 4457.72,
        "end": 4468.16
    },
    {
        "text": " confirmó que esto se corre la derecha ahora para ver el aumento del pbí me citamos también",
        "start": 4468.16,
        "end": 4473.04
    },
    {
        "text": " la oferta y eso lo vemos con el punto de corte entonces saca cedá el aumento del pb o sea que",
        "start": 4473.04,
        "end": 4481.04
    },
    {
        "text": " esta última parte es correcto no va afectando el pbí y en este caso sí lo afecta y la",
        "start": 4481.04,
        "end": 4490.56
    },
    {
        "text": " opción sé que esperemos que esté bien tipo de cambio fijo dice ingresan capitales del exterior",
        "start": 4490.56,
        "end": 4501.72
    },
    {
        "text": " correcto",
        "start": 4503.8,
        "end": 4504.84
    },
    {
        "text": " exceso de oferta de divisas correcto aumentan las reservas correcto y la cantidad de dinero",
        "start": 4504.84,
        "end": 4525.92
    },
    {
        "text": " valía de esto grasita y cae el desempleo con tipo de cambio fijo dijimos que acá teníamos",
        "start": 4525.92,
        "end": 4536.16
    },
    {
        "text": " resultado y si suba el pbí que le pasa el desempleo para producir más necesitamos más empleo",
        "start": 4536.16,
        "end": 4544.16
    },
    {
        "text": " menos desempleo sí esta es la metodología de estas preguntas integradoras nos interran todos los",
        "start": 4544.72,
        "end": 4557.16
    },
    {
        "text": " conocimientos son más difíciles seguro valer más punto también por eso el viernes van a",
        "start": 4557.16,
        "end": 4565.36
    },
    {
        "text": " haber dos preguntas y cada una de ellas va a valer tres puntos es cierto que hay cosas que son",
        "start": 4565.36,
        "end": 4572.12
    },
    {
        "text": " bastante",
        "start": 4572.12,
        "end": 4572.639999999999
    },
    {
        "text": " 12 por ciento de los que hicieron este examen contestaron esto obviamente restaron los puntos o que si",
        "start": 4578.44,
        "end": 4588.5199999999995
    },
    {
        "text": " dicen que con tipo de cambio flexible el banco central interviene comprando es un arrorduro",
        "start": 4588.52,
        "end": 4595.080000000001
    },
    {
        "text": " entonces las que restan en este tipo de preguntas son errores que no deberían pasarle a ustedes que",
        "start": 4595.080000000001,
        "end": 4600.84
    },
    {
        "text": " estuvieron siguiendo el curso si bueno vamos a ver otro ejemplo hay una duda otra cosa cuando",
        "start": 4600.84,
        "end": 4613.4400000000005
    },
    {
        "text": " leíamos las opciones las opciones vieron que hay cuatro cuatro partes de la cadena de razonamiento",
        "start": 4613.44,
        "end": 4620.5599999999995
    },
    {
        "text": " de esta cadena causal en cada opción están en orden o sea no quiere decir que esta la primera",
        "start": 4620.5599999999995,
        "end": 4627.679999999999
    },
    {
        "text": " hasta la segunda hasta la tercera y así se arma la cadena pero sí que esto viene después de esto",
        "start": 4627.679999999999,
        "end": 4632.2
    },
    {
        "text": " y que esto de acá es el final de esto el orden ahí juega ahí vale el orden",
        "start": 4632.2,
        "end": 4639.5599999999995
    },
    {
        "text": " y vamos a ver ahora la política monetaria",
        "start": 4673.44,
        "end": 4689.28
    },
    {
        "text": " y dijimos que la estamos analizando como una política monetaria expansiva una política monetaria",
        "start": 4689.28,
        "end": 4703.5599999999995
    },
    {
        "text": " expansiva",
        "start": 4703.5599999999995,
        "end": 4705.12
    },
    {
        "text": " expansiva no porque aumenta m o aumenta r sino expansiva porque no lleva al aumento de la demanda agregada",
        "start": 4708.599999999999,
        "end": 4716.4
    },
    {
        "text": " cómo nos lleva ese aumento de la demanda agregada usando m o usando r por donde se da la relación",
        "start": 4717.4,
        "end": 4725.799999999999
    },
    {
        "text": " de las variables monetarias que maneja el banco central con la demanda agregada quiere que esto",
        "start": 4725.799999999999,
        "end": 4732.36
    },
    {
        "text": " aumenta donde juega m o r en esos cinco componentes de la demanda",
        "start": 4732.36,
        "end": 4739.0
    },
    {
        "text": " porque en cuales esos cinco componentes juega r con sumo inversión o sea que lo que va a",
        "start": 4743.96,
        "end": 4751.12
    },
    {
        "text": " querer hacer es esto y para eso como ustedes bien dijeron que tiene que ocurrir bajar",
        "start": 4751.12,
        "end": 4758.62
    },
    {
        "text": " y si baja r que pasa con m suben la política monetaria que vamos a analizar es cualquiera de estas",
        "start": 4758.62,
        "end": 4769.26
    },
    {
        "text": " dos el banco central no puede manejar las dos al mismo tiempo no puede decir quiero que m sea",
        "start": 4769.26,
        "end": 4775.74
    },
    {
        "text": " 45 mil y r sea 2 por ciento no si fija una la otra sale en consecuencia de la",
        "start": 4775.74,
        "end": 4783.7
    },
    {
        "text": " y cómo hace esta política para que haya más dinero que hace coloco a letras saca a letras",
        "start": 4784.7,
        "end": 4791.46
    },
    {
        "text": " esta política es una política que lo que hace es retirar letras de regulación monetaria y al",
        "start": 4792.66,
        "end": 4801.46
    },
    {
        "text": " retirar las letras saca a letras que había puesto en el mercado y que les da cambio",
        "start": 4801.46,
        "end": 4807.42
    },
    {
        "text": " pesos saca a letras que había puesto atractivos que pasa con el promedio de tasas",
        "start": 4808.42,
        "end": 4814.9400000000005
    },
    {
        "text": " baja ese es el resultado de lo que tenemos acá entonces el gobierno quiso hacer esto",
        "start": 4814.9400000000005,
        "end": 4824.02
    },
    {
        "text": " porque quiere hacer esto por lo que dijimos acá esto no lleva a que aumenta la inversión y",
        "start": 4825.3,
        "end": 4834.54
    },
    {
        "text": " no lleva a que caiga la borro y por lo tanto aumenta el consubro estas dos cosas que",
        "start": 4834.54,
        "end": 4841.66
    },
    {
        "text": " mentimos ahí son resultados de que la tasa interescais pero ya agarrando el amano decimos bueno",
        "start": 4841.66,
        "end": 4849.3
    },
    {
        "text": " pero si la tasa interescais que pasa con esto",
        "start": 4849.3,
        "end": 4852.58
    },
    {
        "text": " como es el diferencial ese de tasas",
        "start": 4852.58,
        "end": 4862.54
    },
    {
        "text": " positivo para los buenos de otros países y entonces",
        "start": 4864.9,
        "end": 4872.66
    },
    {
        "text": " los primeros que vamos a pensar es si los buenos de rua y pagan menos quienes tienen estos",
        "start": 4883.58,
        "end": 4890.0599999999995
    },
    {
        "text": " buenos como dice compañeros se van a querer vender esto y llevarlos a otro país entonces tenemos",
        "start": 4890.0599999999995,
        "end": 4895.74
    },
    {
        "text": " salida de capitales financieros internacional van a querer irse a comprar buenos en otro país",
        "start": 4896.74,
        "end": 4905.9
    },
    {
        "text": " ahora para llevarse para llevarse esos capitales e ir a comprar los buenos en Colombia en el",
        "start": 4906.9,
        "end": 4914.379999999999
    },
    {
        "text": " país que sea que pasan uruguay que ustedes se recién antes ya se habían adelantado a",
        "start": 4914.379999999999,
        "end": 4920.54
    },
    {
        "text": " Siráigo tienen que comprar los dólares entonces cómo actúan en el mercado de divisa un proceso de",
        "start": 4920.54,
        "end": 4928.5
    },
    {
        "text": " salida de capitales cómo nos juegan el mercado de divisas de uruguay aumenta la demand",
        "start": 4928.5,
        "end": 4934.46
    },
    {
        "text": " ¿quién se irá a algunos ustedes?",
        "start": 4935.9,
        "end": 4940.0599999999995
    },
    {
        "text": " ¿no? así unos años hasta el año pasado incentivaba un par de preguntidades el día me",
        "start": 4940.0599999999995,
        "end": 4951.379999999999
    },
    {
        "text": " paso y si tienen alguna dificultad ahí se anima",
        "start": 4951.379999999999,
        "end": 4955.0599999999995
    },
    {
        "text": " ¿no?",
        "start": 4955.06,
        "end": 4957.06
    },
    {
        "text": " ¿pasos en serio? pueden preguntar a la gente, o sea parte no le agraven, ¿quién le hayan?",
        "start": 4959.06,
        "end": 4965.660000000001
    },
    {
        "text": " lo vamos a ir ayudando como no estamos haciendo entre todos",
        "start": 4965.660000000001,
        "end": 4969.780000000001
    },
    {
        "text": " bueno, sigo y después vemos nos queda la última igual",
        "start": 4969.780000000001,
        "end": 4976.14
    },
    {
        "text": " aumenta la demanda de divisas para llevarse esos capitales a otros países y ¿qué podemos",
        "start": 4976.14,
        "end": 4981.780000000001
    },
    {
        "text": " decir entonces? antes para que nos quede más desarrollado vamos a tener una oferta de",
        "start": 4981.78,
        "end": 4992.54
    },
    {
        "text": " divisas que va a ser menor a la demanda de divisas y esto que va a generar",
        "start": 4992.54,
        "end": 5001.259999999999
    },
    {
        "text": " en realidad todavía no sabemos si es su abaja antes de mirar el sistema cambiario, ¿no?",
        "start": 5001.9,
        "end": 5008.7
    },
    {
        "text": " pero hay una presión a que suba el tipo de cambio ¿cuáles son las reglas de",
        "start": 5008.7,
        "end": 5014.0599999999995
    },
    {
        "text": " juego que habíamos dicho que íbamos a analizar hoy? tipo de cambio fijo entonces si",
        "start": 5014.0599999999995,
        "end": 5021.62
    },
    {
        "text": " estamos con tipo de cambio fijo que es lo que va a ser el banco central",
        "start": 5021.62,
        "end": 5029.46
    },
    {
        "text": " va a salir a vender divisas bien y cuando vende divisas",
        "start": 5039.22,
        "end": 5048.0199999999995
    },
    {
        "text": " baja la cantidad de dinero porque vendió divisas le dio dólares a cambio que recibió",
        "start": 5054.34,
        "end": 5061.46
    },
    {
        "text": " pesos y recuerden los pesos son los que circulan en la economía no los que tienen el banco central",
        "start": 5061.46,
        "end": 5068.0599999999995
    },
    {
        "text": " y otra cosa pasa lo quiere mantener ¿no? está haciendo esto para mantener pero como",
        "start": 5068.7,
        "end": 5077.78
    },
    {
        "text": " disque hizo para mantenerlo vendió divisas para Dios reservos y nos habíamos",
        "start": 5077.78,
        "end": 5084.98
    },
    {
        "text": " olvidado lo que el compañero que dijo si aumenta la cantidad de dinero suba la tasa y si",
        "start": 5084.98,
        "end": 5092.22
    },
    {
        "text": " además estamos trabajando con libre movilidad de capital vamos a decir hasta igualar en",
        "start": 5092.22,
        "end": 5097.7
    },
    {
        "text": " vídeo y si vamos a estas flechitas a la velocidad ajuste de la flecha arriba a la velocidad del",
        "start": 5097.7,
        "end": 5114.26
    },
    {
        "text": " abajo la de arriba se corrije la de abajo nos llega a ocurrir entonces por lo tanto esto que",
        "start": 5114.26,
        "end": 5124.22
    },
    {
        "text": " quería el banco central que ocurriera no va a ocurrir",
        "start": 5124.22,
        "end": 5127.7
    },
    {
        "text": " esta política bajo esta economía que estamos analizando que era una economía pequeña con",
        "start": 5133.54,
        "end": 5141.860000000001
    },
    {
        "text": " libre movilidad de capital ese tipo de cambio fijo no tiene resultado",
        "start": 5141.860000000001,
        "end": 5146.3
    },
    {
        "text": " quería tenía el incentivo ese es la idea de aumentar las inversiones a aumentar el consumo",
        "start": 5147.820000000001,
        "end": 5153.900000000001
    },
    {
        "text": " pero se enfrenta con que tiene que poner en juego la cantidad de dinero las divisas para",
        "start": 5154.22,
        "end": 5160.740000000001
    },
    {
        "text": " mantener el tipo de cambio y en ese poner en juego la cantidad de dinero la quiso aumentar pero",
        "start": 5160.740000000001,
        "end": 5166.7
    },
    {
        "text": " después la tuvo que usar para salir a intervenir acá en el medio de esto de que no",
        "start": 5166.7,
        "end": 5173.26
    },
    {
        "text": " de resultado aparece una relación entre tres variables que son tres variables de política",
        "start": 5173.26,
        "end": 5180.34
    },
    {
        "text": " económica que el banco central las puede manejar pero solo una puede manejar",
        "start": 5180.34,
        "end": 5186.1
    },
    {
        "text": " esta ya habíamos dicho que era una función de r",
        "start": 5187.3,
        "end": 5190.14
    },
    {
        "text": " o esta m pero cuando tenemos tipo de cambio fijo",
        "start": 5192.34,
        "end": 5197.14
    },
    {
        "text": " esta también es función del tipo de cambio",
        "start": 5200.66,
        "end": 5203.26
    },
    {
        "text": " si o sea cual eligió el banco central si está con tipo de cambio fijo y eligió esta",
        "start": 5204.26,
        "end": 5214.7
    },
    {
        "text": " manejar porque la relajosa voy a intervenir para mantener la cotización ahora cuando",
        "start": 5214.7,
        "end": 5221.1
    },
    {
        "text": " interviene pierde el control de la cantidad de dinero porque la pone en juego comprando y vendiendo",
        "start": 5221.1,
        "end": 5225.7
    },
    {
        "text": " y si pierde el control de M pierde el control de M por lo tanto si está la que ha decidido manejar",
        "start": 5225.7,
        "end": 5232.62
    },
    {
        "text": " no puede hacer política monetaria no puede decir quiero que esto sea 2900 y esto sea 3%",
        "start": 5232.62,
        "end": 5241.38
    },
    {
        "text": " no esto va a ser función del otro",
        "start": 5241.38,
        "end": 5243.22
    },
    {
        "text": " acá también hay parciales que tienen esta pregunta pero por las dudas que no nos del tiempo",
        "start": 5249.86,
        "end": 5254.62
    },
    {
        "text": " la salteo vamos a la última a la última que tenía previsto para ver hoy",
        "start": 5256.099999999999,
        "end": 5260.9
    },
    {
        "text": " lo pueden analizar ustedes pero qué es lo que cómo sería el razonamiento llegamos a acá",
        "start": 5262.62,
        "end": 5287.94
    },
    {
        "text": " hay presiones para que aumenta el tipo de cambio y qué va a ocurrir va a aumentar y se aumenta el",
        "start": 5288.86,
        "end": 5294.719999999999
    },
    {
        "text": " tipo de cambio mejora la competitividad que va a pasar es portamos más importamos menos o sea que",
        "start": 5294.719999999999,
        "end": 5304.94
    },
    {
        "text": " termina pasando y la demanda si va a aumentar por este lado si la tasa interés va a aumentar",
        "start": 5304.94,
        "end": 5313.82
    },
    {
        "text": " porque aumentó el tipo de cambio y se vuelve a igualar o sea que en realidad la política monetaria",
        "start": 5313.82,
        "end": 5320.139999999999
    },
    {
        "text": " y sirve da resultado pero por acá no por la inversión sino porque promueve ese aumento del",
        "start": 5320.139999999999,
        "end": 5326.7
    },
    {
        "text": " tipo de cambio pero como les dije hoy son razonamientos que le vuelta a las variables y los vínculos",
        "start": 5326.7,
        "end": 5333.34
    },
    {
        "text": " que hacemos dírenme un mercado al otro del de bien es al financiero del financiero al cambiario",
        "start": 5333.34,
        "end": 5338.82
    },
    {
        "text": " esto como que parece ser siempre el camino miramos qué pasa con el mercado financiero la movilidad",
        "start": 5338.82,
        "end": 5345.58
    },
    {
        "text": " de capitanes no lleva ese mercado financiero con el mercado cambiario ahí las reglas de juego esta y",
        "start": 5345.58,
        "end": 5351.099999999999
    },
    {
        "text": " saltamos el mercado bien es de vuelta en el caso flexible que decíamos recién",
        "start": 5351.099999999999,
        "end": 5354.98
    },
    {
        "text": " bueno vamos a analizar un choque externo que esté vinculado a los precios internacionales",
        "start": 5368.82,
        "end": 5390.139999999999
    },
    {
        "text": " o al tipo de cambio ahora que es lo mismo cuando yo hablo de easterisco tipo de cambio del resto",
        "start": 5390.14,
        "end": 5406.42
    },
    {
        "text": " del mundo simplifiquemos para ahora para lo que vamos a analizar ahora que es brasil que es",
        "start": 5406.42,
        "end": 5411.860000000001
    },
    {
        "text": " este tipo de cambio de brasil cuánto vale tres reales por dola si easterisco es eso bien y yo",
        "start": 5411.86,
        "end": 5431.339999999999
    },
    {
        "text": " después también para ejemplificar y ver esto voy a decir que p asterisco era el precio de el resto",
        "start": 5431.339999999999,
        "end": 5441.679999999999
    },
    {
        "text": " del mundo o sea que es un precio que yo lo expreso vamos a ponerlo siguiente",
        "start": 5441.68,
        "end": 5448.56
    },
    {
        "text": " p asterisco en reales y vamos a ponerle que sea 6 reales por caipirín para ejemplificar",
        "start": 5448.56,
        "end": 5471.52
    },
    {
        "text": " fresquito día como hoy vendría el pelo tengo el precio de brasil en reales tengo el tipo de",
        "start": 5471.52,
        "end": 5482.4400000000005
    },
    {
        "text": " cambio de brasil como llegó esto a un pe asterisco en dólares que era como nosotros teníamos en la",
        "start": 5482.4400000000005,
        "end": 5490.96
    },
    {
        "text": " cabeza y veníamos pensando hasta ahora el pe asterisco que cuentasíamos",
        "start": 5490.96,
        "end": 5495.6
    },
    {
        "text": " un típico divido agarró el pre asterisco que está en reales y divido entre el tipo de cambio",
        "start": 5495.6,
        "end": 5513.04
    },
    {
        "text": " esto que está en reales y lo divido entre el tipo de cambio que está en reales por dola esto",
        "start": 5515.04,
        "end": 5522.92
    },
    {
        "text": " reales por callaya presió así que es 6 y 3 2 dólares a caipirí o sea que nuestras dos variables",
        "start": 5522.92,
        "end": 5537.4400000000005
    },
    {
        "text": " las que tenemos allá son esta y esta como ya habíamos manejado pe asterisco presado en doya",
        "start": 5537.4400000000005,
        "end": 5547.08
    },
    {
        "text": " cuando el tipo de cambio en otros países aumenta cuando aumenta el tipo de cambio por ejemplo en",
        "start": 5552.92,
        "end": 5560.6
    },
    {
        "text": " vez de 3 se va a 6 que era eso que impacto tiene que aumentar el tipo de cambio en un país",
        "start": 5560.6,
        "end": 5574.16
    },
    {
        "text": " cuantos va a valer a casi vendiendo las hay reales la caipirinha pero en dólares cuantos cuentas",
        "start": 5574.16,
        "end": 5584.4
    },
    {
        "text": " uno porque subió el tipo de cambio y si esto queda igual va a bajar el precio en dólar",
        "start": 5586.0,
        "end": 5594.639999999999
    },
    {
        "text": " recuerden un aumento del tipo de cambio ya lo dijimos en una de las cadenas anteriores aquí",
        "start": 5596.24,
        "end": 5601.44
    },
    {
        "text": " es un beneficio esportador y por qué lo beneficio porque lo abarata en dólar",
        "start": 5601.44,
        "end": 5607.28
    },
    {
        "text": " entonces analizar un choque externo que sea que nuestros países competidores aumentan su",
        "start": 5608.639999999999,
        "end": 5616.44
    },
    {
        "text": " tipo de cambio de valú, de precian el nombre que quieran o analizar un choque externo que implica",
        "start": 5616.44,
        "end": 5625.16
    },
    {
        "text": " que nuestros países competidores se abarataron el mismo este abaratamiento esta caída el",
        "start": 5625.16,
        "end": 5631.5599999999995
    },
    {
        "text": " pe asterisco puede darse por esto o podrá darse por tema de costos de producción no importa en",
        "start": 5631.5599999999995,
        "end": 5637.92
    },
    {
        "text": " definitiva para Uruguay cualquiera de estos dos shocks es lo mismo o sea una caída de pe asterisco",
        "start": 5637.92,
        "end": 5646.0
    },
    {
        "text": " o un aumento del tipo de cambio para Uruguay va a ser el mismo choque externo ahí lo podemos",
        "start": 5646.0,
        "end": 5653.08
    },
    {
        "text": " analizar junto y como afecta Uruguay esto ahora sí volvemos Uruguay aquel pizarro",
        "start": 5653.08,
        "end": 5664.24
    },
    {
        "text": " en el a de Brasil para ver eso de Brasil pero volvemos Uruguay porque queremos ver el impacto de esto",
        "start": 5664.24,
        "end": 5669.2
    },
    {
        "text": " sobre el economía Uruguay como afecta el economía Uruguay esto viene por el lado de la competidad",
        "start": 5669.2,
        "end": 5676.96
    },
    {
        "text": " porque es la variable pe asterisco el el asterisco en realidad nosotros no lo teníamos en nuestras",
        "start": 5676.96,
        "end": 5681.24
    },
    {
        "text": " variables pero sí teníamos al pe asterisco nosotros teníamos e por pe asterisco y teníamos",
        "start": 5681.24,
        "end": 5688.8
    },
    {
        "text": " al pe esto era pesos esto era dólares y esto era pesos por dólar en el numerador que es lo",
        "start": 5688.8,
        "end": 5696.0
    },
    {
        "text": " que tenemos en este indicador de competitividad si quieren más fácil en el denominador que tenemos",
        "start": 5696.0,
        "end": 5703.24
    },
    {
        "text": " los precios en peso de los productos uruguayos y arriba que tenemos",
        "start": 5704.5599999999995,
        "end": 5708.44
    },
    {
        "text": " los precios en peso de los productos internacionales ¿qué es lo que me dice este shock que esto está",
        "start": 5708.44,
        "end": 5716.919999999999
    },
    {
        "text": " bajando y entonces que está pasando se están abaratando los precios de los productos internacionales",
        "start": 5716.919999999999,
        "end": 5723.44
    },
    {
        "text": " en comparación con los uruguayos estamos perdiendo competitividad el shock este viene por el",
        "start": 5723.44,
        "end": 5733.48
    },
    {
        "text": " lado entra la economía Uruguay por la competitividad y por la competitividad donde se impacta",
        "start": 5733.48,
        "end": 5740.16
    },
    {
        "text": " donde se vislumbra este impacto ¿qué va a pasar con las exportaciones Uruguayos? van a bajar",
        "start": 5740.16,
        "end": 5749.879999999999
    },
    {
        "text": " ¿qué van a pasar con las importaciones de los uruguayos? van a aumentar",
        "start": 5751.48,
        "end": 5756.879999999999
    },
    {
        "text": " los que se fueron a Brasil y vieron esa caipirinha 1 hora 1 dólar en el medidor",
        "start": 5757.88,
        "end": 5764.36
    },
    {
        "text": " estarán chupar más ¿no? tienen lo mismo sin gresos salen más barato bueno que dar más divertido",
        "start": 5764.36,
        "end": 5771.6
    },
    {
        "text": " ¿qué le pasa a la a la balanza comercial entonces Uruguay?",
        "start": 5773.4400000000005,
        "end": 5778.04
    },
    {
        "text": " se deteriora baja el shock externo entonces entra el economía Uruguayos por el lado comercial",
        "start": 5778.04,
        "end": 5790.56
    },
    {
        "text": " por el lado de los bienes y servicios que tenemos en la balanza comercial pero no queda acá",
        "start": 5790.56,
        "end": 5797.04
    },
    {
        "text": " porque esto baja y esto aumenta o sea tenemos el deterioro de la balanza comercial",
        "start": 5798.04,
        "end": 5802.84
    },
    {
        "text": " pero esta caída de importaciones que no genera en el mercado de divisas y esta caída de",
        "start": 5803.72,
        "end": 5810.92
    },
    {
        "text": " export que no genera en el mercado de divisas vamos a las divisas ¿qué pasan el mercado de divisas?",
        "start": 5810.92,
        "end": 5819.28
    },
    {
        "text": " la caída de exportaciones van a ver menos dólares que se quiera amendar porque Uruguay",
        "start": 5819.28,
        "end": 5829.64
    },
    {
        "text": " le va a vender menos arroz a Brasil ahora ¿sí? porque Brasil ve en otros marcados más competitivo",
        "start": 5829.64,
        "end": 5836.96
    },
    {
        "text": " el arroz que Uruguay o porque Brasil produce más barato ahora ¿qué pasa con las importaciones",
        "start": 5836.96,
        "end": 5843.6
    },
    {
        "text": " donde me afectan a mí? y vamos a crear más dólar a espalidad tomar esa caipirinha entonces",
        "start": 5843.6,
        "end": 5849.12
    },
    {
        "text": " demandamos más ¿y qué pasa en el mercado de divisas entonces? el shock externo que nos generó el",
        "start": 5849.12,
        "end": 5859.4400000000005
    },
    {
        "text": " deterioro de la balanza comercial y que lo pusimos acá también genera un desequilibro en el",
        "start": 5859.44,
        "end": 5868.36
    },
    {
        "text": " mercado de divisas ¿de qué tipo? Menor oferta y esto que va a generar presiones aquí",
        "start": 5868.36,
        "end": 5883.32
    },
    {
        "text": " aquí aumenta el tipo de cambio porque hay más demanda de divisas y acá ahora nos metemos",
        "start": 5883.32,
        "end": 5896.12
    },
    {
        "text": " ya desagregar según cómo sea el sistema cambiario de la economía Uruguay tipo de cambio",
        "start": 5896.12,
        "end": 5906.5199999999995
    },
    {
        "text": " fijo tipo de cambio flexible vamos a ver",
        "start": 5906.52,
        "end": 5917.64
    },
    {
        "text": " para cada uno ya tenemos que esto bajo",
        "start": 5922.320000000001,
        "end": 5925.72
    },
    {
        "text": " vamos a ver cómo sigue la cosa tipo de cambio fijo ¿qué pasa?",
        "start": 5925.72,
        "end": 5939.0
    },
    {
        "text": " pero el agujo tiene que aparecer el banco central ¿cómo aparece? si hay un exceso de demanda si hay",
        "start": 5942.16,
        "end": 5951.92
    },
    {
        "text": " más demanda que oferta sale a vender no intervención vendedora a vender divisas como hay más",
        "start": 5951.92,
        "end": 5964.2
    },
    {
        "text": " demanda tiene que cubrir esa mayor demanda y al vender divisas se queda con menos reservas y",
        "start": 5964.2,
        "end": 5976.72
    },
    {
        "text": " baja la cantidad de dinero vende divisas a cambio que recibe pesos no tenemos pesos ahora",
        "start": 5976.72,
        "end": 5990.52
    },
    {
        "text": " tenemos pesos el banco central pero que eran la cantidad de dinero no la que tenía el banco central",
        "start": 5997.0,
        "end": 6001.96
    },
    {
        "text": " sino la de la economía ya se habían asustado de quien un papa entendí tomar y si baja la cantidad de",
        "start": 6001.96,
        "end": 6009.12
    },
    {
        "text": " dinero sube la tasa de interés y como estamos hablando de la economía con libre movilidad de",
        "start": 6009.12,
        "end": 6017.2
    },
    {
        "text": " capitales esto es de vuelta hasta que se iguala en algún lado antes entonces que tendría que dar",
        "start": 6017.2,
        "end": 6027.52
    },
    {
        "text": " pasado en algún lado por acá debería de haber bajado la tasa de interés",
        "start": 6027.52,
        "end": 6039.68
    },
    {
        "text": " y esto acá dejémoslo ahí con signo de interrovasión",
        "start": 6042.52,
        "end": 6047.8
    },
    {
        "text": " no tenemos las herramientas para verlo y sería más un cuentito y no me gusta plantearlos",
        "start": 6051.400000000001,
        "end": 6056.56
    },
    {
        "text": " entonces",
        "start": 6058.52,
        "end": 6059.52
    },
    {
        "text": " tipo camiofijo tenemos en choque externo",
        "start": 6063.120000000001,
        "end": 6066.76
    },
    {
        "text": " y la economía entonces termina reduciendo su demanda agregada bien",
        "start": 6070.040000000001,
        "end": 6078.56
    },
    {
        "text": " así que el choque externo lo que generó es que la demanda agregada se nos vino para el",
        "start": 6087.52,
        "end": 6093.92
    },
    {
        "text": " supongamos que estábamos hablando que queremos ver a largo plazo que efecto va a tener esto",
        "start": 6101.400000000001,
        "end": 6105.72
    },
    {
        "text": " le agrega un dato más a esto",
        "start": 6105.72,
        "end": 6107.88
    },
    {
        "text": " si",
        "start": 6107.88,
        "end": 6108.88
    },
    {
        "text": " puse acá la de pleno empleo la oferta clásica recuerden que era una visión de largo plazo ya",
        "start": 6115.4400000000005,
        "end": 6121.64
    },
    {
        "text": " estamos en pleno empleo se genera este shock y la economía se va a venir acá",
        "start": 6121.64,
        "end": 6127.4400000000005
    },
    {
        "text": " a largo plazo que pasa con el pbí de la economía",
        "start": 6131.96,
        "end": 6135.96
    },
    {
        "text": " tenemos que al principio lo que ocurrió fue que esto bajó ¿no?",
        "start": 6138.88,
        "end": 6143.28
    },
    {
        "text": " ahora a largo plazo ¿qué me dice?",
        "start": 6146.4400000000005,
        "end": 6148.52
    },
    {
        "text": " el pbí se mantiene o sea que esta resultado acá lo tengo que esto está igual",
        "start": 6152.24,
        "end": 6157.64
    },
    {
        "text": " entonces si perdí competitividad y perdí balance comercial hay algo que me lo está",
        "start": 6157.64,
        "end": 6164.76
    },
    {
        "text": " compensando que es lo que me compensa al arque a largo plazo la economía se ajusta",
        "start": 6164.76,
        "end": 6170.0
    },
    {
        "text": " alguna manera por donde viene la justa de largo plazo porque la economía uruguaya va a encontrar",
        "start": 6170.0,
        "end": 6176.16
    },
    {
        "text": " una caída de precios y si caen los precios que va a pasar con el consumo va a aumentar esto es",
        "start": 6176.16,
        "end": 6184.68
    },
    {
        "text": " porque cayeron los precios la inversión de que dependía",
        "start": 6184.68,
        "end": 6188.320000000001
    },
    {
        "text": " de la tasa de interés libre movilidad capitales que hay igual política fiscal no",
        "start": 6188.32,
        "end": 6196.679999999999
    },
    {
        "text": " hicimos las exportaciones si bajan los precios aumentan porque bajaron los precios y las",
        "start": 6196.679999999999,
        "end": 6207.24
    },
    {
        "text": " impor bajan porque bajaron los precios entonces esto aumenta porque bajaron los precios",
        "start": 6207.24,
        "end": 6215.5599999999995
    },
    {
        "text": " entonces en 3 2 3",
        "start": 6216.080000000001,
        "end": 6217.64
    },
    {
        "text": " según lo que me dice la visión a largo plazo que es vertical que se mantiene el primero",
        "start": 6220.320000000001,
        "end": 6225.400000000001
    },
    {
        "text": " empleo yo tengo que este aumento de acá más este aumento de acá compensa esto de acá",
        "start": 6225.400000000001,
        "end": 6231.04
    },
    {
        "text": " son iguales esos 3 dar un mismo una misma magnitude",
        "start": 6232.04,
        "end": 6235.68
    },
    {
        "text": " así que a corto plazo este shock con tipo de cambio fijo y libre movilidad capitales me",
        "start": 6235.68,
        "end": 6249.16
    },
    {
        "text": " genera una menor demanda que capaz que si hubiéramos puesto una curva oferta de corto plazo que",
        "start": 6249.16,
        "end": 6255.84
    },
    {
        "text": " inician nos mostraba que esta de menor demanda generaba menos pbí generaba más de empleo pero en",
        "start": 6255.84,
        "end": 6262.4400000000005
    },
    {
        "text": " una visión a largo plazo un shock de manda lo único me va a hacer es que me lleve los precios",
        "start": 6262.44,
        "end": 6267.599999999999
    },
    {
        "text": " para abajo los precios me van a ajustar esa pérdida de competitividad que tuve acá y que pasa",
        "start": 6267.599999999999,
        "end": 6276.679999999999
    },
    {
        "text": " así es flexible había hemos llegado a que la entrada de shock esterno negativo por el lado del",
        "start": 6276.679999999999,
        "end": 6282.599999999999
    },
    {
        "text": " balance comercial se transfería el mercado de divisas y generaba presiones para que el tipo",
        "start": 6282.599999999999,
        "end": 6287.679999999999
    },
    {
        "text": " de cambio subiera si es flexible que va a pasar va a subir y si sube que va a pasar",
        "start": 6287.68,
        "end": 6295.08
    },
    {
        "text": " que pasa con esto con la competitividad que lo que había ocurrido era que el shock me había",
        "start": 6296.8,
        "end": 6303.6
    },
    {
        "text": " bajado esto y por eso habíamos perdido competitividad que es lo que ocurre ahora el tipo de cambio",
        "start": 6303.6,
        "end": 6310.52
    },
    {
        "text": " aumenta o sea la pérdida de competitividad que se dio por precios internacionales más baratos",
        "start": 6310.52,
        "end": 6318.400000000001
    },
    {
        "text": " si tenemos un sistema de tipo cambio flexible lo que hace es actuar de manera compensatoria",
        "start": 6318.400000000001,
        "end": 6325.080000000001
    },
    {
        "text": " entonces recupera esta competitividad",
        "start": 6326.280000000001,
        "end": 6330.080000000001
    },
    {
        "text": " y al recuperar la competitividad aumentan las es por bajan las 100 por mejora el salo de la",
        "start": 6330.08,
        "end": 6344.12
    },
    {
        "text": " balanza comercial bueno y este aumento de R recuerden que también nos aumenta R hasta",
        "start": 6344.12,
        "end": 6356.64
    },
    {
        "text": " igualar a la internacional entonces lo que tenemos acá es que esto después aumenta y nos deja",
        "start": 6357.6,
        "end": 6365.96
    },
    {
        "text": " igual la de más una economía con tipo de cambio flexible corrige los shocks esternos a través",
        "start": 6365.96,
        "end": 6374.76
    },
    {
        "text": " del tipo de cambio entonces esto que había pasado que nos mostraba que íbamos a exportar menos",
        "start": 6374.76,
        "end": 6384.160000000001
    },
    {
        "text": " que íbamos a importar menos que íbamos a importar más esto se da vamos a tener unos meses que",
        "start": 6384.16,
        "end": 6390.48
    },
    {
        "text": " esto nos pega ahora después eso cuando pasa al mercado de bisa si vemos que uruguay es por",
        "start": 6390.48,
        "end": 6395.8
    },
    {
        "text": " menos por lo tanto de menos dólares una vez que llega a esto que apajes unos meses 3 4 meses",
        "start": 6395.8,
        "end": 6402.72
    },
    {
        "text": " que vamos a tener que el tipo de cambio va a corregir eso y a partir de que el tipo de cambio",
        "start": 6402.72,
        "end": 6408.08
    },
    {
        "text": " corrige bueno uruguay va a empezar a colocar de vuelta en otros mercados ganan competitividad",
        "start": 6408.08,
        "end": 6413.44
    },
    {
        "text": " entonces 3 meses después volvemos a compensar en términos de bienes de demanda queda",
        "start": 6413.44,
        "end": 6422.04
    },
    {
        "text": " todo igual ahora ¿qué pasa con el que se habían de duda un dólar?",
        "start": 6422.04,
        "end": 6425.28
    },
    {
        "text": " ¿Ahora compraré la utita un dólar?",
        "start": 6429.5599999999995,
        "end": 6431.44
    },
    {
        "text": " y la que le digamos que se compensa todo y que se recupera ¿no? ese se clavó a tener que pagar",
        "start": 6434.48,
        "end": 6440.4
    },
    {
        "text": " dólar y luego va a tener que comprar más caro entonces nos corrigen el mercado de bienes",
        "start": 6440.4,
        "end": 6445.2
    },
    {
        "text": " ahora cuidado porque esa variable como ya habíamos visto podía afectar de manera diferencial",
        "start": 6445.2,
        "end": 6451.759999999999
    },
    {
        "text": " a uno su favor rapidito pregunta de un parcial que tuvo esto y le quedamos con eso",
        "start": 6451.76,
        "end": 6463.320000000001
    },
    {
        "text": " acá primero el parcial de los migadores",
        "start": 6463.32,
        "end": 6481.5599999999995
    },
    {
        "text": " cuando una economía como la uruguaya pequeña abierta y con libre movilidad capitales enfrenta",
        "start": 6494.32,
        "end": 6499.88
    },
    {
        "text": " como yo que externo una caída de los precios del resto del mundo o sea ya nos dicen esto",
        "start": 6499.88,
        "end": 6505.32
    },
    {
        "text": " se observarán los siguientes efectos opciona con tipo de cambio fijo deterioro de la competitividad",
        "start": 6506.5199999999995,
        "end": 6512.92
    },
    {
        "text": " ahí ¿no? o sea vamos bien",
        "start": 6514.679999999999,
        "end": 6518.639999999999
    },
    {
        "text": " cae la oferta de divisas agarré otra parte de la cadena de razonamiento y lo metí en la opciona",
        "start": 6518.64,
        "end": 6530.56
    },
    {
        "text": " y va bien también ¿no? Intervención vendedora del banco central me ven como más adelante",
        "start": 6530.56,
        "end": 6539.12
    },
    {
        "text": " en la cadena y tomo esa parte que sigue también correcto cae la demanda agregada",
        "start": 6539.12,
        "end": 6546.16
    },
    {
        "text": " la 36% de los que dieron este parcial eligieron la",
        "start": 6551.36,
        "end": 6560.28
    },
    {
        "text": " ve con tipo cambio flexible deterioro de la balanza comercial correcto verdad exceso de",
        "start": 6560.28,
        "end": 6574.0
    },
    {
        "text": " demanda de divisas si es correcto perdida de reservas con tipo de cambio flexible perdida de reservas",
        "start": 6574.0,
        "end": 6591.6
    },
    {
        "text": " cruz grande como una casa cae el pbí con tipo de cambio flexible",
        "start": 6592.56,
        "end": 6600.400000000001
    },
    {
        "text": " 14% eligió esto que era gravísimo restó puntos ¿no?",
        "start": 6607.360000000001,
        "end": 6615.56
    },
    {
        "text": " sí con tipo de cambio flexible cae en las exportaciones correcto suel tipo de cambio correcto",
        "start": 6615.56,
        "end": 6632.200000000001
    },
    {
        "text": " baja la cantidad de dinero con tipo de cambio flexible no no y compensa la caída de la demanda",
        "start": 6632.2,
        "end": 6651.16
    },
    {
        "text": " agregada esto de acá no 21% eligió eso y 30% no quiso saber nada con esta pronta ¿si?",
        "start": 6651.16,
        "end": 6673.4
    },
    {
        "text": " que ustedes salgan este razonamiento ayuda realidad dos preguntas que ustedes se tienen",
        "start": 6673.4,
        "end": 6688.92
    },
    {
        "text": " hacer este razonamiento es descabellado después de haber tenido pocas clases pero a haber tenido estas",
        "start": 6688.92,
        "end": 6695.16
    },
    {
        "text": " clases si o no que empiecen a vincular marcado algo se puede ¿no? no estoy tan delirante",
        "start": 6695.16,
        "end": 6706.5199999999995
    },
    {
        "text": " hay efectos más segunda pregunta de un parcial donde yo les doy las opciones y hay que",
        "start": 6706.5199999999995,
        "end": 6712.16
    },
    {
        "text": " como juntar piezas está descabellado son difíciles por eso valen más pero se puede ¿no?",
        "start": 6712.16,
        "end": 6721.28
    },
    {
        "text": " dudas preguntas si hubiéramos tenido una sétima clase que bueno saben no tuvimos tuvimos que",
        "start": 6724.96,
        "end": 6731.639999999999
    },
    {
        "text": " acelerar un poquito la idea era agarrar las más ejemplos de esto y vieron que llamas o menos la",
        "start": 6731.639999999999,
        "end": 6738.12
    },
    {
        "text": " vuelta ya le agarramos no dudas preguntas comentarios estamos terminando acá dudas de material",
        "start": 6738.12,
        "end": 6751.36
    },
    {
        "text": " biográfico bueno el que pueda venir el jueves nos vemos si no no vemos el día del parcial ¿vien?",
        "start": 6751.36,
        "end": 6763.0
    }
]