[
    {
        "text": " Bueno, ¿cuánto se es? Acabo de plantear el problema de este emparejamiento estable,",
        "start": 0.0,
        "end": 15.0
    },
    {
        "text": " no? Resumiendo, tenemos esos dos conjuntos del V y M, ¿sab? Y lo que queremos buscar es",
        "start": 15.0,
        "end": 23.0
    },
    {
        "text": " en emparejamiento, son la asignación de uno a uno, tales que no hay ni estabilidad de",
        "start": 23.0,
        "end": 28.84
    },
    {
        "text": " este tipo, decir dos personas que se prefieren mutuamente antes que sus respectivos parejas,",
        "start": 28.84,
        "end": 34.08
    },
    {
        "text": " si no se irían juntos y dejarían colgados a las parejas que no es así. Ni siquiera",
        "start": 34.08,
        "end": 43.400000000000006
    },
    {
        "text": " es claro que hace una solución para ese problema. Pero en realidad sí la hay y esto que les",
        "start": 43.4,
        "end": 53.48
    },
    {
        "text": " muestro acá de Trada y Sinan Estesia es lo que sabe el aburrimo de Game y SApple, que como",
        "start": 53.48,
        "end": 62.8
    },
    {
        "text": " es decir, es decir, lo que les decía son ratoes, es decir, lo que les siento y que resuelve este",
        "start": 62.8,
        "end": 65.96
    },
    {
        "text": " bueno, así muestra que sí, que siempre se puede encontrar un emparejamiento estable y lo hace",
        "start": 65.96,
        "end": 76.88
    },
    {
        "text": " de forma constructiva, es decir, da un alborismo que resuelve el problema. Y este es el",
        "start": 76.88,
        "end": 83.44
    },
    {
        "text": " aburrimo. Primero ahora nos marcamos todos como libres, después decimos, mientras exista algún",
        "start": 83.44,
        "end": 92.8
    },
    {
        "text": " M libre que no sea propuesto a toda W, a toda persona W, entonces vamos a repetir estos",
        "start": 92.8,
        "end": 105.16
    },
    {
        "text": " pasos acá. Creo que hacemos, bueno, ahora sea W, la persona de mayor preferencia para M,",
        "start": 105.16,
        "end": 112.6
    },
    {
        "text": " o sea, agarro este M libre que no existe, sino que no viene entrado a Piano Juel y para",
        "start": 112.6,
        "end": 118.52
    },
    {
        "text": " verme, fijo quienes la W, a la cual aún todavía no se le propuso de mayor preferencia para",
        "start": 118.52,
        "end": 124.36
    },
    {
        "text": " entonces si W está libre, entonces vamos a emparejar con M, así formamos tentativamente una pareja,",
        "start": 126.91999999999999,
        "end": 135.4
    },
    {
        "text": " sino pues va a ser que lo le ve, este empareja con alguien más, pues esa fue en algún",
        "start": 136.0,
        "end": 143.56
    },
    {
        "text": " interacción anterior de este cual, esa la pusimos empareja con alguien. Entonces si lo le",
        "start": 143.56,
        "end": 148.44
    },
    {
        "text": " prefiere a M que se está proponiendo ahora, antes que su actual pareja M prima, entonces dejamos a",
        "start": 148.44,
        "end": 156.68
    },
    {
        "text": " M prima libre y emparejamos a M con doble, si rompemos la pareja que tentativamente tenemos hasta",
        "start": 156.68,
        "end": 165.12
    },
    {
        "text": " ahora entre W y M prima y ponemos en un nuevo pareja entre M y doble, si no, si en realidad W",
        "start": 165.12,
        "end": 175.16
    },
    {
        "text": " prefiera su pareja actual, entonces rechaza a M y M sigue libre y esto sigue iterando hasta que",
        "start": 176.32,
        "end": 187.36
    },
    {
        "text": " en algún momento digamos también, si se lo haréis, si lo piensan, si damos por aceptar todas estas",
        "start": 187.36,
        "end": 201.12
    },
    {
        "text": " reglas, machitas, patracales, tradicionalistas, etcétera, bueno esto es como una especie de simulación",
        "start": 201.12,
        "end": 207.68
    },
    {
        "text": " de la vida misma, los M proponen y se forman parejas y después si algunos que sean parejas mejor se va",
        "start": 207.68,
        "end": 219.92000000000002
    },
    {
        "text": " a conocer a otro, y se trece, empieza como a simular los movimientos que podrían darse entre las",
        "start": 219.92000000000002,
        "end": 226.0
    },
    {
        "text": " parejas, tentativamente se forma una, pues se desposa a Rampu y se va para el otro, etcétera, etcétera,",
        "start": 226.0,
        "end": 230.4
    },
    {
        "text": " eso va evolucionado, ese es el alborito, y siendo una pregunta que me sea, se me",
        "start": 230.72,
        "end": 237.04000000000002
    },
    {
        "text": " fijen la forma en que estamos escribiendo los agregos fíjense que esto está muy lejos de ser",
        "start": 237.04000000000002,
        "end": 245.92000000000002
    },
    {
        "text": " realmente un código en un lenguaje de programación, y este es el estilo de en que vamos a escribir",
        "start": 247.44,
        "end": 257.44
    },
    {
        "text": " los algoritmos, si no vamos a escribir en los prácticos, el que se van a encontrar en el libro y el",
        "start": 257.44,
        "end": 262.71999999999997
    },
    {
        "text": " que muchas veces van a encontrar en un artículo de informática, si lo le impor hay, es suficientemente",
        "start": 262.71999999999997,
        "end": 272.4
    },
    {
        "text": " preciso como para que uno lo entiende y de hecho pueda implementar esto, pero la forma en que lo",
        "start": 274.08,
        "end": 280.96
    },
    {
        "text": " presamos es de mucho más alto nivel, a alguien pregunta si cambias el orden de los elementos de",
        "start": 281.52,
        "end": 299.35999999999996
    },
    {
        "text": " que se te cambia, no? No le pregunto por el chat, creo que sí, dependidas de esta preferencia,",
        "start": 300.32,
        "end": 307.84000000000003
    },
    {
        "text": " bueno, a todas las preguntas, es genial que si les ocurren esa pregunta porque son preguntas muy",
        "start": 308.48,
        "end": 313.28000000000003
    },
    {
        "text": " naturales, uno de estos, y por eso les tire el algoritmo seco sin más sor preparación,",
        "start": 313.28000000000003,
        "end": 321.44
    },
    {
        "text": " puesto, uno lo va a ir generando un montón de durmas, esto va a empezar, termina,",
        "start": 321.44,
        "end": 325.84
    },
    {
        "text": " ahí los hombres empiezan a quedar libres y después pareja poder quedar libre y esto podría pasar",
        "start": 328.32,
        "end": 334.96
    },
    {
        "text": " que si era corriendo si no termina más, si termina incluso uno podrá irme a un produjo y un",
        "start": 334.96,
        "end": 344.56
    },
    {
        "text": " emparejamiento, y más ese emparejamiento es perfecto, es estable, definitiva esto da los que uno",
        "start": 344.56,
        "end": 352.88
    },
    {
        "text": " esperaría que de lo que estamos queriendo que de, y como preguntamos recién el chat, esto es",
        "start": 352.88,
        "end": 359.56
    },
    {
        "text": " independiente del orden en que se coja, me fijan si que al gorismo está subespecifica,",
        "start": 359.56,
        "end": 368.32
    },
    {
        "text": " esto es algo como encontrar muchas veces por ahí, puede haber más de un m libre que aún no se",
        "start": 368.32,
        "end": 377.44
    },
    {
        "text": " propuso todo el mundo, y el algoritmo tal como está expresado casi simplemente me dice agarra uno,",
        "start": 377.44,
        "end": 382.4
    },
    {
        "text": " uno cuando programas estamos actuando, agarra uno específico hay una forma de elegir uno,",
        "start": 385.52,
        "end": 392.71999999999997
    },
    {
        "text": " uno arbitrario, no hay más problema en la medida que sea cual sea el m que dijamos el",
        "start": 392.72,
        "end": 403.52000000000004
    },
    {
        "text": " resultado final siempre sea un emparejamiento estable, pero igual cada la pregunta es decir,",
        "start": 403.52000000000004,
        "end": 413.84000000000003
    },
    {
        "text": " si puede pasar que si tomo un m otro m depende cual sea m que el hijo",
        "start": 415.44000000000005,
        "end": 420.48
    },
    {
        "text": " capaz que el resultado final son emparejamientos estable distintos y si no existe una solución,",
        "start": 423.72,
        "end": 430.64000000000004
    },
    {
        "text": " ¿qué pasa que hace el algoritmo? Me da algo, yo podría analizar lo mismo y convence a",
        "start": 430.64000000000004,
        "end": 436.88000000000005
    },
    {
        "text": " que termina y que si existe una solución le encuentra pero bueno y uno le podría plantear",
        "start": 436.88000000000005,
        "end": 442.40000000000003
    },
    {
        "text": " que si no hay solución, cuando termina que es lo que me da, como me doy cuenta tendría que salir",
        "start": 442.40000000000003,
        "end": 448.92
    },
    {
        "text": " a chequearse si lo que me dió está bien o no, vale un montón de dudas que pueden surgir acá.",
        "start": 448.92,
        "end": 458.6
    },
    {
        "text": " Y esto lo traigo como a cuento para motivar un poco cuáles son los objetivos de excusa.",
        "start": 466.32,
        "end": 471.64
    },
    {
        "text": " El abril de Miguel Zappling y el problema que es emparejamiento estable en sí no es sencillo,",
        "start": 471.64,
        "end": 483.64
    },
    {
        "text": " de hecho no es de los servicios más fáciles que vamos a estudiar, incluso me acuerdo de una vez",
        "start": 483.64,
        "end": 489.56
    },
    {
        "text": " de una discusión entre nosotros, si bueno si era apropiado a arrancar con el abril con no es",
        "start": 489.56,
        "end": 497.03999999999996
    },
    {
        "text": " de los más sencillos. Lo ha hecho una virtud que motiva muy bien el resto de excusa y el libro,",
        "start": 497.04,
        "end": 505.04
    },
    {
        "text": " además de que hay una motivación para nosotros de mantener el hino conductor del libro,",
        "start": 505.04,
        "end": 509.40000000000003
    },
    {
        "text": " yo me imagino que en el libro también lo eligieron esto con punto de partida porque motiva muy",
        "start": 511.0,
        "end": 516.88
    },
    {
        "text": " bien, ¿qué es lo que queremos? ¿Qué necesitamos cuando analizamos un hino?",
        "start": 516.88,
        "end": 526.4
    },
    {
        "text": " Motivo muy bien la necesidad de estudiar las cosas que vamos a estudiar, ¿cuáles son los objetivos",
        "start": 526.4,
        "end": 533.4399999999999
    },
    {
        "text": " del curso? Uno de los objetivos es conocer algoritmos y clásicos, una batería de algoritmos",
        "start": 533.4399999999999,
        "end": 541.96
    },
    {
        "text": " para varios problemas bien estudiados en computación, la síncia de la computación, y que uno como",
        "start": 542.6800000000001,
        "end": 551.96
    },
    {
        "text": " profesional de la computación tendría que manejar, que conocer, no solo conocer, sino además",
        "start": 551.96,
        "end": 557.8000000000001
    },
    {
        "text": " ser capaz de aplicarlo para la resolución de otro. Y este es un ejemplo de esos algoritmos.",
        "start": 557.8000000000001,
        "end": 564.2800000000001
    },
    {
        "text": " Es un algoritmo que suficiona un problema, que acá está ilustrado con una metáfora de hombres,",
        "start": 564.76,
        "end": 572.92
    },
    {
        "text": " mujeres, personas que se hacen propuestas una a otra pero que en definitiva, si uno se abstrae",
        "start": 572.92,
        "end": 578.28
    },
    {
        "text": " de la metáfora concreta, es una extracción para un montón de problemas de parejar una cosa",
        "start": 578.28,
        "end": 585.64
    },
    {
        "text": " que aparece en varias situaciones. Quizás no exactamente el problema si tal cual, pero la",
        "start": 585.64,
        "end": 594.3199999999999
    },
    {
        "text": " una variación de este problema y no se puede inspirar en este algoritmo para suficionar el problema",
        "start": 594.3199999999999,
        "end": 598.1999999999999
    },
    {
        "text": " que tiene que entre manos. De hecho, después vamos a ver algunas extensiones o adaptaciones",
        "start": 598.1999999999999,
        "end": 605.56
    },
    {
        "text": " del algoritmo de guerrilla para situaciones un poco más generales. Por ejemplo, la relación",
        "start": 605.56,
        "end": 612.8
    },
    {
        "text": " no es uno a uno, sino que bueno hay varios pasantes que pueden trabajar una misma empresa,",
        "start": 612.8,
        "end": 621.24
    },
    {
        "text": " cosa de sentido. De hecho, en el práctico tenemos algunos ejercicios de sitio. Otro de los objetivos",
        "start": 621.24,
        "end": 629.28
    },
    {
        "text": " es dominar técnicas generales de diseño del algoritmo y aplicarlas. La verdad que lo largo de",
        "start": 629.28,
        "end": 637.8
    },
    {
        "text": " todo el libro es que están presentadas como bueno, esta este problema, lo analizamos un poco y",
        "start": 637.8,
        "end": 643.7199999999999
    },
    {
        "text": " diseñamos un algoritmo para resolver ese problema. Ahora, llegamos a una solución. Ahora esa",
        "start": 643.7199999999999,
        "end": 649.16
    },
    {
        "text": " etapa de diseño del algoritmo, que ahora después vamos a ver un poco cómo es en el en este caso",
        "start": 649.16,
        "end": 655.04
    },
    {
        "text": " el algoritmo de el sable. No tiene por qué ser completamente artesanal. Si bien, siempre hay una",
        "start": 655.04,
        "end": 661.92
    },
    {
        "text": " cuota de ingenio, nuestra de inventiva general. Ahí como patrones generales de diseño que nos",
        "start": 661.92,
        "end": 673.8399999999999
    },
    {
        "text": " sirven como diga y que los vamos a estudiar. Técnicas de diseño como divide, encerra como",
        "start": 673.8399999999999,
        "end": 680.68
    },
    {
        "text": " ánobindos, ánobindos, ánobindos como programación dinámica, varios de ellos que vamos a",
        "start": 680.68,
        "end": 688.8
    },
    {
        "text": " estudiar. Entonces, vamos a mismo tiempo que vamos a estudiando algunos algoritmos clásicos,",
        "start": 688.8,
        "end": 693.28
    },
    {
        "text": " también vamos a estudiar técnicas de diseño del algoritmo porque en general los algoritmos",
        "start": 693.28,
        "end": 698.68
    },
    {
        "text": " en sí mismos son ejemplos de estas técnicas de diseño. Estos dos objetivos se van",
        "start": 698.68,
        "end": 705.0
    },
    {
        "text": " ayudando entre las aos sumo con otro. Otro de los objetivos que tiene mucho que ver con este",
        "start": 705.0,
        "end": 713.76
    },
    {
        "text": " que están muy bien ilustrado por ejemplo este del problema de paréxame testables, aprender o practicar,",
        "start": 713.76,
        "end": 721.28
    },
    {
        "text": " razonar con rigurosidad sobre algunas cualidades de los algoritmos que diseñamos como en particular",
        "start": 721.28,
        "end": 729.48
    },
    {
        "text": " la corrección, decir si hacen lo que su mono que tiene que hacer y la complejidad de los",
        "start": 729.48,
        "end": 738.08
    },
    {
        "text": " algoritmos, que sea algo que en las próximas semanas vamos a tener un poco más de esta, se",
        "start": 738.08,
        "end": 743.88
    },
    {
        "text": " pretende que algo en la con la eficiencia o con el entender cuán eficiente no es un algoritmo.",
        "start": 743.88,
        "end": 750.96
    },
    {
        "text": " Es bueno porque es importante esto. Bueno, muchas veces en trabajo profesional capaz que los",
        "start": 751.96,
        "end": 763.2800000000001
    },
    {
        "text": " algoritmos que terminamos siempre en esta capaz que no son tremendamente sofisticados,",
        "start": 763.2800000000001,
        "end": 770.36
    },
    {
        "text": " por retyparlo capaz de que con un par de fuera ni dado muchas veces salimos andando,",
        "start": 770.36,
        "end": 776.6
    },
    {
        "text": " pero en otras por suerte hay en otras estaciones son más implicas una elaboración mucho más",
        "start": 776.6,
        "end": 784.36
    },
    {
        "text": " compleja, problemas mucho más menos obvios como en la resolución y ahí realmente va la pena",
        "start": 784.36,
        "end": 795.9200000000001
    },
    {
        "text": " razonar rigurosamente sobre cosas como estas, esto me da un emparejamiento, termina no termina,",
        "start": 795.92,
        "end": 809.56
    },
    {
        "text": " siempre es estable, siempre de una solución, incluso cosas más que tienen que ver con el problema",
        "start": 811.4,
        "end": 821.36
    },
    {
        "text": " sí, sino perdón, es cosa que tiene que ver con el problema sí como por ejemplo si siempre existe una",
        "start": 821.36,
        "end": 826.4
    },
    {
        "text": " solución o no, pero además cosas como bueno, la algoritmo también me da una solución,",
        "start": 826.4,
        "end": 830.2
    },
    {
        "text": " pues hay muchas soluciones, ¿qué tipo de soluciones? Esa también son cosas que muchas veces no van a",
        "start": 830.2,
        "end": 836.76
    },
    {
        "text": " preocupar, que van a ser interesantes de estudiar y que tenemos que saber cómo encarar ese tipo de",
        "start": 836.76,
        "end": 843.2
    },
    {
        "text": " soluciones, ¿no? Me ha pasado creo que a todos, como lo sé que nos ha pasado de bueno en ese",
        "start": 843.2,
        "end": 852.88
    },
    {
        "text": " espacio, no sé después de la clase, que alguien se arrima con una solución y dicen, ya, yo tengo",
        "start": 852.88,
        "end": 860.72
    },
    {
        "text": " esta solución, esta solución, este es el horismo para el problema tal, el práctico estoy seguro",
        "start": 862.4000000000001,
        "end": 868.6400000000001
    },
    {
        "text": " que funciona, pero no me di cuenta cómo mostrar qué es correcto, porque definitivamente iba a esto",
        "start": 868.64,
        "end": 876.4
    },
    {
        "text": " de razonar con rigurosidad sobre la corrección de una nueva sinciga de mostrar matemáticamente",
        "start": 876.4,
        "end": 881.88
    },
    {
        "text": " que el horismo funciona, que le dobimos correcto, y muchas veces pasa eso, estoy seguro que anda,",
        "start": 882.88,
        "end": 889.6
    },
    {
        "text": " eso obvio, que anda, pero no me doy cuenta cómo demostrar y en realidad lo que está pasando es que está",
        "start": 889.6,
        "end": 894.0
    },
    {
        "text": " bien, que no lo pueda demostrar, porque no es correcto, entonces muchas veces nos pasa y que ser",
        "start": 894.0,
        "end": 901.92
    },
    {
        "text": " cuidadoso con eso, que algunos se puede ir a una mage de buena esta solución anda, y no,",
        "start": 901.92,
        "end": 909.44
    },
    {
        "text": " realmente no hay que saber cómo, sobre todo, cuando son, por ejemplo, ese sistema crítico que",
        "start": 911.2,
        "end": 918.68
    },
    {
        "text": " que no pueden pasar, que tienen implicancias, este graves, bueno, más bien, más vale",
        "start": 919.16,
        "end": 925.0799999999999
    },
    {
        "text": " estar seguro sobre qué es lo que hace el horismo, ¿qué es independiente de las fases de implementación?",
        "start": 927.0,
        "end": 933.3199999999999
    },
    {
        "text": " Porque puede haber errores de programación, que pueden hacer el el típico bug,",
        "start": 933.3199999999999,
        "end": 938.12
    },
    {
        "text": " que ustedes están acostumbrados a buscar, tiene que ver no con un error algodrísmico, muchas veces,",
        "start": 938.12,
        "end": 944.3599999999999
    },
    {
        "text": " a veces sí, pero muchas veces no tiene que dar alguna error, sino alguna error de programación,",
        "start": 944.36,
        "end": 948.36
    },
    {
        "text": " la idea algodrísmica que paquesta bien, pero la programación está maldita, eso no es lo que nos va a",
        "start": 948.36,
        "end": 956.12
    },
    {
        "text": " ocupar lo más o par que el tiempo, sobre todo vamos a estudiar la corrección de los algodrísmos,",
        "start": 956.12,
        "end": 965.64
    },
    {
        "text": " de algodrísmos expresados en términos como este, no programas, después de haber todo",
        "start": 965.64,
        "end": 975.0
    },
    {
        "text": " otra parte del curso, o bueno, un poco mezclado, por la mitad también vamos a estudiar el horismo de",
        "start": 975.0,
        "end": 982.4399999999999
    },
    {
        "text": " ordenamiento que pueden carnetar a categoría, a ver si lo vamos a analizar también rigurosamente,",
        "start": 982.4399999999999,
        "end": 989.72
    },
    {
        "text": " no son los algodrísmos en sinifo sino problemas al horismo, es decir, un determinado problema,",
        "start": 990.44,
        "end": 998.36
    },
    {
        "text": " por ejemplo el problema del emparejamiento estable, bueno eso se puede solucionar",
        "start": 998.36,
        "end": 1006.12
    },
    {
        "text": " eficientemente, qué es lo mejor que se puede hacer, se puede resolver en tiempo",
        "start": 1006.12,
        "end": 1012.52
    },
    {
        "text": " genial, imagínense eso, quiero ordenar el programa, el programa es el quiero ordenar una",
        "start": 1012.52,
        "end": 1021.12
    },
    {
        "text": " recta de enelementas, bueno yo puedo caer con un algodrismo que ordena una regla de",
        "start": 1021.12,
        "end": 1028.36
    },
    {
        "text": " la regla, si pueden analizarla de algodrismo, lo estoy planteando a que eso es un",
        "start": 1028.36,
        "end": 1032.44
    },
    {
        "text": " distinto, quiero analizar el problema, el problema de ordenar, ¿qué es la mejor que se cuaza?",
        "start": 1032.44,
        "end": 1039.8
    },
    {
        "text": " se puede ordenar en tiempo proporcional a ene, o esos imposibles, qué es lo mejor que se",
        "start": 1039.8,
        "end": 1047.52
    },
    {
        "text": " puede hacer en el interior, incluso vamos a ver después todo una que es un tema bien interesante,",
        "start": 1047.52,
        "end": 1055.28
    },
    {
        "text": " es un vecinal del curso, toda una categorización de problemas, hay problemas que de hecho al día de",
        "start": 1055.28,
        "end": 1062.52
    },
    {
        "text": " hoy no se sabe, se existen soluciones eficientes o no, a empezar hablar vamos a tener que poder definir",
        "start": 1062.52,
        "end": 1070.28
    },
    {
        "text": " qué es lo que significa con algodrismo se da eficiente, que no puede tener una idea vague en la",
        "start": 1070.28,
        "end": 1075.8799999999999
    },
    {
        "text": " cabeza pero formalizar eso no es tan sencillo y eso también nos vamos a ocupar,",
        "start": 1075.8799999999999,
        "end": 1080.8
    },
    {
        "text": " bueno el algodrismo de Gale Sappley como les decía es un excelente ejemplo que ilustra",
        "start": 1080.8,
        "end": 1094.04
    },
    {
        "text": " porque todas estas cosas son importantes si van a la pena estudiarlas y salvarlas.",
        "start": 1095.8,
        "end": 1100.56
    },
    {
        "text": " Para tener un poco esta presentación de qué va el curso y antes de metamos, estoy un poco más,",
        "start": 1100.56,
        "end": 1112.24
    },
    {
        "text": " el algodrismo, quería pasarles un par de recomendaciones con respecto a esto de razonar con",
        "start": 1112.24,
        "end": 1123.04
    },
    {
        "text": " rigurosidad sobre los algodrinos y sobre los problemas algodrínicos, que eso no creo que sea",
        "start": 1123.04,
        "end": 1130.56
    },
    {
        "text": " lo que ustedes están acostumbrados, es más esta es el curso de pronomación, te creo que es de las",
        "start": 1130.56,
        "end": 1138.92
    },
    {
        "text": " pocas oportunidades en la carrera, me lo van a trabajar intensamente, entonces y es algo súper",
        "start": 1140.92,
        "end": 1149.2
    },
    {
        "text": " importante así que tratemos de aprovecharlo y aprenderlo bien, puede ser un tiempo desafiante para",
        "start": 1149.2,
        "end": 1155.8
    },
    {
        "text": " los tiempos justamente por no estar acostumbrados, en definitivo lo estamos hablando de hacer",
        "start": 1155.8,
        "end": 1162.88
    },
    {
        "text": " demostraciones matemáticas, ahora cuando nuestro objeto de estudio son los algodrinos por ejemplo,",
        "start": 1162.88,
        "end": 1172.4
    },
    {
        "text": " eso introduce un aspecto de desarrollo, el que emporan, el aspecto de máquina de estado,",
        "start": 1172.4,
        "end": 1178.1200000000001
    },
    {
        "text": " lo que va cambiando de estado con el tipo de van, se van a ejecutando pasos una tras de otro y eso es",
        "start": 1178.1200000000001,
        "end": 1183.2800000000002
    },
    {
        "text": " un poco diferente a veces cuesta con respecto a las demostraciones que hacen el cálculo o algebra",
        "start": 1183.2800000000002,
        "end": 1189.52
    },
    {
        "text": " que son como más, lo suelen ser sobre algo más estático, no tienen solamente esta noción de",
        "start": 1189.52,
        "end": 1196.6000000000001
    },
    {
        "text": " algo no va evolucionante, bueno entonces un par de recomendaciones las demostraciones hay que escribirlas,",
        "start": 1196.6,
        "end": 1205.1599999999999
    },
    {
        "text": " luego por además justamente por falta de costumbre, escribirlas es algo que escribirlas de forma",
        "start": 1205.1599999999999,
        "end": 1215.56
    },
    {
        "text": " clara y que se entienda por lo que cuesta, entonces es algo que se entrena y la única forma de entrenar",
        "start": 1215.56,
        "end": 1220.8
    },
    {
        "text": " es bueno hacerlo, entonces a veces uno mira, si es un algodrino que me he demostrado por respecto a decir",
        "start": 1220.8,
        "end": 1229.72
    },
    {
        "text": " ah, o sea, me imagino por donde sale y con eso al cansa, bueno en realidad no al cansa,",
        "start": 1229.72,
        "end": 1235.2
    },
    {
        "text": " una vez que estás practicando de escribirlas bien, que sea un trabajo y sea un entrenamiento",
        "start": 1235.2,
        "end": 1240.56
    },
    {
        "text": " y otra que a mí me ha pasado cantidad de veces, imagino también el pasado, que en el aire de uno",
        "start": 1241.56,
        "end": 1249.6799999999998
    },
    {
        "text": " pisa esto sale así, cuando lo vas a escribir en realidad no es tan sencillo, hay huecos en el",
        "start": 1249.6799999999998,
        "end": 1257.96
    },
    {
        "text": " en el razonamiento que no se hacen visibles hasta que no tratamos de realmente describirlas,",
        "start": 1257.96,
        "end": 1265.3999999999999
    },
    {
        "text": " es fundamental que alguien lea lo que escriba, por usted es capaz que resulta no más clara",
        "start": 1266.4,
        "end": 1273.64
    },
    {
        "text": " del único, cuando veis la ley, no hay puntos y cosas que están vagas y que no se entienden,",
        "start": 1273.64,
        "end": 1279.24
    },
    {
        "text": " por ejemplo entre los compañeros de Duto de Monitorio, sería ideal que se pasaran su ilusión y se las revisan",
        "start": 1279.24,
        "end": 1285.8400000000001
    },
    {
        "text": " unas con otras, por supuesto también pueden consultarla con los decentes como le decía hace un",
        "start": 1285.8400000000001,
        "end": 1291.4
    },
    {
        "text": " rato, ya no creo que basamos a poder resolver todas las soluciones de todos los ejercicios, de",
        "start": 1291.4,
        "end": 1297.68
    },
    {
        "text": " todos los estudiantes, sí, por ejemplo si hacen una solución consensuada de alguno de los ejercicios",
        "start": 1297.68,
        "end": 1305.88
    },
    {
        "text": " en el grupo y no en la mandan, como le decía a mí más temprano, nosotros se las revisamos y ya hacemos",
        "start": 1307.5600000000002,
        "end": 1314.2800000000002
    },
    {
        "text": " un rato, sí. Cuando escriban, hay que tener en cuenta quién es el destinatario de esto que",
        "start": 1314.28,
        "end": 1324.76
    },
    {
        "text": " están escribiendo, no? No es lo mismo, la forma de escribir del libro, tiene fines didácticos,",
        "start": 1324.76,
        "end": 1336.0
    },
    {
        "text": " está escrita, es que hay mucho de forma muy una barro rágica y conidas y vueltas y podríamos hacer",
        "start": 1336.0,
        "end": 1343.96
    },
    {
        "text": " así, pero eso tendría este problema, entonces mejor lo hacemos a Zá. Entonces,",
        "start": 1343.96,
        "end": 1350.24
    },
    {
        "text": " ustedes, cuando leen el libro van a haber un tipo de demostración que tiene fines didácticos,",
        "start": 1351.6000000000001,
        "end": 1360.72
    },
    {
        "text": " no es necesario, por supuesto, que ustedes no se las sumen de ejercicio, es un parcial,",
        "start": 1360.72,
        "end": 1364.16
    },
    {
        "text": " cuando saben escriban de esa manera, ustedes no están buscando enseñar las demostraciones que",
        "start": 1364.16,
        "end": 1371.64
    },
    {
        "text": " ustedes tienen que ser, deben de ser concisas y directas al grajo, pero tienen que ser claras,",
        "start": 1371.64,
        "end": 1377.68
    },
    {
        "text": " tampoco es lo mismo, un boceto de una solución que la hace un docente clase, donde de repente,",
        "start": 1378.8400000000001,
        "end": 1386.88
    },
    {
        "text": " con temas de tiempo y de espacio y todo, bueno, hay como ciertos lineamientos, pero no es algo",
        "start": 1386.88,
        "end": 1394.4
    },
    {
        "text": " escrito, viene punta a punta. Yo le digo porque definitiva, cuando uno toma como ejemplo,",
        "start": 1394.4,
        "end": 1401.72
    },
    {
        "text": " las cosas que lee para ver qué es lo que tiene que hacer, bueno, es diferente, el contexto que",
        "start": 1401.72,
        "end": 1408.2
    },
    {
        "text": " es en que estamos escribiendo cada una de estas situaciones. Si se sienten que necesitan un poco",
        "start": 1408.2,
        "end": 1414.5600000000002
    },
    {
        "text": " de apoyo sobre este tema, sin tener cómo hacer, cómo pensar y que hay una demostración,",
        "start": 1414.56,
        "end": 1423.48
    },
    {
        "text": " la mucha luceza, salvando el letaz es de la evolución del tiempo de los alobrismos como",
        "start": 1425.6799999999998,
        "end": 1431.76
    },
    {
        "text": " le decía recién, pero a ustedes se ha tenido este costumbre de los cursos de matemática, de trabajar,",
        "start": 1431.76,
        "end": 1437.76
    },
    {
        "text": " haciendo demostraciones, pero todos los mios, si sienten que quieren unos repasar o tomar ideas,",
        "start": 1437.76,
        "end": 1445.92
    },
    {
        "text": " hay un par de libros, unos es el de fundamentos de la orinia, de Brasad y Bradley, que como les",
        "start": 1445.92,
        "end": 1453.68
    },
    {
        "text": " les dié parte del programa del curso, esto es un libro que está en Castellano y dedica a unas",
        "start": 1453.68,
        "end": 1459.12
    },
    {
        "text": " secciones del primer capítulo a este tema. Está este otro libro que es muy bueno que es",
        "start": 1459.12,
        "end": 1467.8
    },
    {
        "text": " Matemátix por Computer Science que está disponible online y tiene también una sección de un capítulo,",
        "start": 1467.8,
        "end": 1474.4799999999998
    },
    {
        "text": " como correo que se llama, cómo hacer demostraciones y como escribirlas. Y mismo en las clases grabadas de Open",
        "start": 1474.48,
        "end": 1489.68
    },
    {
        "text": " Fin, yo creo que dedique un rato a hablar sobre este tema y pasar a algunos piques y que",
        "start": 1489.68,
        "end": 1498.4
    },
    {
        "text": " le puede saber. Eso de vuelta, depende un poco de qué tan seguro se sienta cada uno con este tema.",
        "start": 1498.4,
        "end": 1505.48
    },
    {
        "text": " Soy Cienfasis acá en la parte de describir",
        "start": 1507.16,
        "end": 1510.2800000000002
    },
    {
        "text": " demostraciones, de matemática, porque parece que es lo que",
        "start": 1512.2800000000002,
        "end": 1515.6000000000001
    },
    {
        "text": " desde las cosas es más les puede costarlo, están menos acostumbrados, pero en realidad consideraciones",
        "start": 1519.1200000000001,
        "end": 1525.2800000000002
    },
    {
        "text": " similares aplican también a la escritura de algoritmos, esto de que escribirlos y que alguien se",
        "start": 1525.28,
        "end": 1533.76
    },
    {
        "text": " nos mire, etcétera. Alguien quería hacer una pregunta.",
        "start": 1533.76,
        "end": 1538.36
    },
    {
        "text": " Soy Calin recién levantada a la mano.",
        "start": 1541.04,
        "end": 1542.8799999999999
    },
    {
        "text": " Hay una pregunta de Nenchat que pueda aprender ahí que estaba ahí.",
        "start": 1542.88,
        "end": 1550.48
    },
    {
        "text": " Esta última.",
        "start": 1550.48,
        "end": 1553.3200000000002
    },
    {
        "text": " Ay, yo la muy buena pregunta. La demostración es que ser en lenguaje matemático, digamos,",
        "start": 1557.0400000000002,
        "end": 1563.0400000000002
    },
    {
        "text": " o podemos mezclar lenguaje natural con matemático, más o menos como fue escrito el algoritmo.",
        "start": 1563.0400000000002,
        "end": 1568.4
    },
    {
        "text": " Esta es una buena pregunta. Las demostraciones tienen que ser, o básicamente,",
        "start": 1568.88,
        "end": 1574.24
    },
    {
        "text": " una explicación rigurosa con rigor matemático, ser una cosa que estamos queriendo probar.",
        "start": 1574.24,
        "end": 1580.8000000000002
    },
    {
        "text": " Eso no implica necesariamente y más aún no es aconsejable que esté todo siendo de",
        "start": 1581.6000000000001,
        "end": 1590.48
    },
    {
        "text": " chiringbol los matemáticos. Perfectamente puede explicar rigorosamente en castellano,",
        "start": 1590.48,
        "end": 1599.28
    },
    {
        "text": " auxiliándose cuando clarifica la notación matemática, pero eso no es menos formal",
        "start": 1600.48,
        "end": 1609.68
    },
    {
        "text": " que escribir una seguidilla de para todo, existe, sino de aclamación,",
        "start": 1611.68,
        "end": 1617.88
    },
    {
        "text": " llave, está definitiva. A veces uno puede tratar de usar notación matemática,",
        "start": 1617.88,
        "end": 1626.44
    },
    {
        "text": " uno termina con las placiones mucho más difíciles de leer y de entender que una frase y no",
        "start": 1626.44,
        "end": 1635.0
    },
    {
        "text": " necesariamente eso es más rigurosa. Para eso van a ver las demostraciones del libro.",
        "start": 1635.0,
        "end": 1645.5600000000002
    },
    {
        "text": " Si bien tiene esto que les decía de que son confines y dacticos, a veces un poco que",
        "start": 1646.52,
        "end": 1653.32
    },
    {
        "text": " diverge por caminos alternativos, están no son súper concisas, porque tienen justamente",
        "start": 1653.32,
        "end": 1661.6399999999999
    },
    {
        "text": " quien explicar cómo es que se llega ahí, pero el definitivo termina construcción una demostración",
        "start": 1661.6399999999999,
        "end": 1666.04
    },
    {
        "text": " rigurosa. Y van a ver que no necesariamente está cargado de notación matemática,",
        "start": 1666.04,
        "end": 1672.44
    },
    {
        "text": " que eso muchas veces es menos claro y no necesariamente más riguros.",
        "start": 1672.44,
        "end": 1675.8
    },
    {
        "text": " No sé si alguna pregunta más. Yo tenía una duda como para capaz que ya tengo el ejemplo como para",
        "start": 1678.28,
        "end": 1689.96
    },
    {
        "text": " dejarlo ilustrado con lo que estábamos dando el emparejamiento. En el caso de que yo,",
        "start": 1689.96,
        "end": 1697.16
    },
    {
        "text": " por ejemplo, quiero demostrar que termina y por un lado de muestro que en cada iteración,",
        "start": 1697.16,
        "end": 1703.72
    },
    {
        "text": " si tengo hombres libres en la siguiente puedo tener n o menos.",
        "start": 1704.6000000000001,
        "end": 1711.16
    },
    {
        "text": " Eso por un lado y por otro lado que si tengo hombres libres que no siempre voy a tener",
        "start": 1713.16,
        "end": 1720.52
    },
    {
        "text": " hombres libres como que en algún momento va a digrecer eso. Me explico. Sí, eso ya alcanza o",
        "start": 1720.52,
        "end": 1729.6399999999999
    },
    {
        "text": " también tengo que mostrar por qué si tengo esas dos cosas ya de forma lógica. Bueno, el",
        "start": 1729.6399999999999,
        "end": 1737.08
    },
    {
        "text": " suelto al segundo punto mencionaste la desexiciencia y pensar, ¿verdad? Creo que eso pasa",
        "start": 1737.08,
        "end": 1741.16
    },
    {
        "text": " porque en el caso de que hay que explicar por qué eso pasa. Por ejemplo, el primer punto de",
        "start": 1741.16,
        "end": 1745.24
    },
    {
        "text": " vos dijiste es la cantidad de hombres libres o disminucia se mantiene. Claro, pero lo que era ahí,",
        "start": 1745.24,
        "end": 1756.68
    },
    {
        "text": " eso por el tema, pues si se mantiene, ¿qué pasa si se mantiene y se mantiene?",
        "start": 1756.68,
        "end": 1761.0
    },
    {
        "text": " Claro, yo lo que estaba pensando en realidad es si se mantiene, se mantiene, se mantiene,",
        "start": 1761.72,
        "end": 1765.88
    },
    {
        "text": " lo único que está haciendo es aumentar las preferencias de las mujeres hasta que en algún momento",
        "start": 1765.88,
        "end": 1770.92
    },
    {
        "text": " no tenés, tienes un tope de preferencias de mujeres. No se pueden mantener y mantener y mantener",
        "start": 1771.4,
        "end": 1777.4
    },
    {
        "text": " porque o sea el inconformismo tiene un tope.",
        "start": 1777.4,
        "end": 1781.0
    },
    {
        "text": " Bueno, eso podría, esa podría. Una estrategia de demostración. Lo que, esto que vamos a",
        "start": 1783.16,
        "end": 1790.3600000000001
    },
    {
        "text": " acabar de hacer es como el primer paso en la corona de demostración, que es uno hacerse la idea",
        "start": 1790.3600000000001,
        "end": 1797.3200000000002
    },
    {
        "text": " de por qué lo que estamos dando a probar es cierto. Después tienes que tratar de hacer, es bajar",
        "start": 1797.8,
        "end": 1805.6399999999999
    },
    {
        "text": " de su al tierra y escribirlo.",
        "start": 1805.6399999999999,
        "end": 1806.9199999999998
    },
    {
        "text": " Regurosamente, muchas veces, incluso lo que también pasa es que uno escribe un boceto que",
        "start": 1812.12,
        "end": 1817.6399999999999
    },
    {
        "text": " parece medio entreberado en una especie de curva a medio larga y termine en lo que quiere y después",
        "start": 1819.1599999999999,
        "end": 1825.6399999999999
    },
    {
        "text": " que lo tiene, y se aprende a poner más directo por este lado y la he escribido en una forma mucho",
        "start": 1825.64,
        "end": 1830.1200000000001
    },
    {
        "text": " más concisa y compártelo. Entonces, esto que vos hiciste es como ese primer paso. Debo a mí,",
        "start": 1830.1200000000001,
        "end": 1837.64
    },
    {
        "text": " esto tiene que ser cierto porque por estas ideas que vos tirarte ahí. Después hay que",
        "start": 1839.24,
        "end": 1847.4
    },
    {
        "text": " dar como plasmar eso en algún momento rigurosos. Esto en partido está haciendo,",
        "start": 1847.4,
        "end": 1853.0
    },
    {
        "text": " no se va a tratar de encontrarlo, se llama una medida de avance, que es una de las técnicas de",
        "start": 1853.0,
        "end": 1859.8
    },
    {
        "text": " demostración que vamos a aplicar. Entonces, algo que vamos a tratar de hacer es, bueno, esto,",
        "start": 1859.8,
        "end": 1867.48
    },
    {
        "text": " esto como estos patrones de razonamiento, que uno a veces te repite y acá ya se ha tratar de",
        "start": 1867.48,
        "end": 1872.28
    },
    {
        "text": " volvido a identificarlos y plantearlos como una técnica. Ahora, después, cuando estudiemos,",
        "start": 1872.28,
        "end": 1884.12
    },
    {
        "text": " es más de estas preguntas que quedan abiertas sobre el grimo de Guel, se apribamos a ver cómo",
        "start": 1884.12,
        "end": 1889.32
    },
    {
        "text": " podría ser, encontrar una buena medida de avance y que lo que trataste de hacer vos es decir, bueno,",
        "start": 1889.32,
        "end": 1893.96
    },
    {
        "text": " esto hay algo que está evolucionando que en algún momento esto va a parar. Ahora, ahora después,",
        "start": 1893.96,
        "end": 1901.8
    },
    {
        "text": " lo vamos a explicar bien. ¿Alguna otra pregunta?",
        "start": 1901.8,
        "end": 1908.3600000000001
    },
    {
        "text": " Bueno, si yo te una pregunta en el libro cuando habla de emparaciones estableces,",
        "start": 1910.16,
        "end": 1916.0
    },
    {
        "text": " dice que hay soluciones válidas, o sea, emparaciones estableces, que no son alcanzables por",
        "start": 1916.0,
        "end": 1922.0
    },
    {
        "text": " algoritmos naturales. No es de la que es una algoritmo natural y una nora natural, esa era la pregunta.",
        "start": 1922.0,
        "end": 1927.12
    },
    {
        "text": " Estas creo de verdad.",
        "start": 1928.88,
        "end": 1930.0
    },
    {
        "text": " Estoy de acuerdo. Eso es un poco",
        "start": 1930.0,
        "end": 1932.88
    },
    {
        "text": " bajo. Eso fue que naturales significa algoritmos con uno del estilo de Guel sábric, uno se le puede",
        "start": 1934.88,
        "end": 1941.12
    },
    {
        "text": " ocurrir. Ahora, después vamos a ver un poco también eso. Es cierto, hay muchos, en principio,",
        "start": 1941.12,
        "end": 1948.96
    },
    {
        "text": " muchos emparéjamientos que está el posible. Una pregunta bien razonable es, bueno,",
        "start": 1948.96,
        "end": 1953.04
    },
    {
        "text": " ¿cuáles son de todo el universo de soluciones posibles? ¿Cuáles pueden encontrar mi algoritmo?",
        "start": 1953.04,
        "end": 1960.0
    },
    {
        "text": " No, aprece la concretamente con tu pregunta.",
        "start": 1962.96,
        "end": 1966.4
    },
    {
        "text": " No, es un poco bajo, no sé, que significa concretamente una algoritmo natural.",
        "start": 1970.88,
        "end": 1975.6000000000001
    }
]