[
    {
        "text": " Bueno, ahora que hemos jugado una cosita un poquito más burocrática.",
        "start": 0.0,
        "end": 22.16
    },
    {
        "text": " Este es básicamente contenido del curso.",
        "start": 22.16,
        "end": 25.04
    },
    {
        "text": " Vamos a enfocar, como ven, mucho a lo que es esto de orientación a objetos.",
        "start": 25.04,
        "end": 32.04
    },
    {
        "text": " Lo que a veces se llama también, programación en edad objetos.",
        "start": 32.04,
        "end": 37.04
    },
    {
        "text": " P-O-O-P en inglés.",
        "start": 37.04,
        "end": 40.04
    },
    {
        "text": " Hablando de inglés, alguien tiene algún problema, resque, mor,",
        "start": 40.04,
        "end": 44.04
    },
    {
        "text": " inconformidad con que yo tire palabras en inglés.",
        "start": 44.04,
        "end": 51.04
    },
    {
        "text": " Dejón.",
        "start": 52.04,
        "end": 53.04
    },
    {
        "text": " Y de última, me preguntan, no, pero de verdad.",
        "start": 53.04,
        "end": 56.04
    },
    {
        "text": " O sea, muchas veces hay términos que son difíciles traducir.",
        "start": 56.04,
        "end": 61.04
    },
    {
        "text": " O capaces son fáciles, pero en el laburo se dicen en inglés.",
        "start": 61.04,
        "end": 65.03999999999999
    },
    {
        "text": " En el 99,99 por ciento de casos.",
        "start": 65.03999999999999,
        "end": 67.03999999999999
    },
    {
        "text": " Entonces, para mí no estaría siendo un buen trabajo.",
        "start": 67.03999999999999,
        "end": 71.03999999999999
    },
    {
        "text": " Si les digo, no sé qué, y cuando vos decís, sí, porque me enseñaron, no sé qué.",
        "start": 71.03999999999999,
        "end": 75.03999999999999
    },
    {
        "text": " Ah, pero esto se llama tal cosa.",
        "start": 75.03999999999999,
        "end": 77.03999999999999
    },
    {
        "text": " Porque no decían algo como son.",
        "start": 78.04,
        "end": 79.04
    },
    {
        "text": " Y bueno, muchas veces son anglicismos o términos en inglés.",
        "start": 79.04,
        "end": 82.04
    },
    {
        "text": " O siglas.",
        "start": 82.04,
        "end": 83.04
    },
    {
        "text": " Y también, yo tengo algunas oritas de, o sea, tengo una baja edicación en el Inco.",
        "start": 83.04,
        "end": 89.04
    },
    {
        "text": " Entonces, lo que más hago es elaborar en el industria privada.",
        "start": 89.04,
        "end": 93.04
    },
    {
        "text": " Y son términos que lo usas todo el tiempo en otras cuentas.",
        "start": 93.04,
        "end": 96.04
    },
    {
        "text": " Entonces, ustedes están aprendiendo, estamos acá para enseñar aoles.",
        "start": 96.04,
        "end": 99.04
    },
    {
        "text": " Y no tienen que saber esos términos o esas siglas, lo que sea.",
        "start": 99.04,
        "end": 102.04
    },
    {
        "text": " Así que hay de vuelta, tipo.",
        "start": 102.04,
        "end": 104.04
    },
    {
        "text": " Y aparte, si un 10% de ustedes no entiendo una cifra,",
        "start": 105.04,
        "end": 108.04
    },
    {
        "text": " capaz de que se pierde la frase.",
        "start": 108.04,
        "end": 110.04
    },
    {
        "text": " O el chiste que peor.",
        "start": 111.04,
        "end": 112.04
    },
    {
        "text": " Entonces, vamos a ver mucho de lo que es orientación de objetos.",
        "start": 115.04,
        "end": 118.04
    },
    {
        "text": " Y van a ver que es un paradigma nuevo.",
        "start": 118.04,
        "end": 121.04
    },
    {
        "text": " O sea, ¿por qué lo de paradigma?",
        "start": 121.04,
        "end": 123.04
    },
    {
        "text": " ¿Por qué es una forma de pensar nueva?",
        "start": 123.04,
        "end": 126.04
    },
    {
        "text": " Ustedes básicamente, cuando programan, lo que tienen que hacer es traducir",
        "start": 128.04000000000002,
        "end": 132.04000000000002
    },
    {
        "text": " una problemática, un cabezes bien edada por un cliente que habla,",
        "start": 133.04,
        "end": 138.04
    },
    {
        "text": " u a veces bien edada por un ticket que tengo que desarrollar,",
        "start": 138.04,
        "end": 142.04
    },
    {
        "text": " un feature que tengo que desarrollar,",
        "start": 142.04,
        "end": 145.04
    },
    {
        "text": " una característica o funcionalidad del sistema,",
        "start": 147.04,
        "end": 149.04
    },
    {
        "text": " u a veces bien edada por la letra del práctico, del parcial,",
        "start": 150.04,
        "end": 154.04
    },
    {
        "text": " o del examen que tengo que hacer.",
        "start": 154.04,
        "end": 156.04
    },
    {
        "text": " Ustedes tienen que leer eso, interpretarlo y en su cabezita",
        "start": 156.04,
        "end": 161.04
    },
    {
        "text": " traducir eso a una solución usando los conceptos de el paradigma de objeto con el cual lo van a resolver.",
        "start": 162.04,
        "end": 170.04
    },
    {
        "text": " O sea, hasta ahora ustedes vieron el paradigma de promoción que se suele llamar,",
        "start": 171.04,
        "end": 176.04
    },
    {
        "text": " estulturado.",
        "start": 178.04,
        "end": 179.04
    },
    {
        "text": " Ustedes, si me han recuerdo, bien, bien, Pascal, Modula y C.",
        "start": 181.04,
        "end": 187.04
    },
    {
        "text": " Nos no estoy diciendo irónico, soy muy irónico y ya se van a dar cuenta,",
        "start": 188.04,
        "end": 192.04
    },
    {
        "text": " pero de verdad, a veces con las otras materias y los plan de estudio,",
        "start": 193.04,
        "end": 196.04
    },
    {
        "text": " yo obviamente hice el plan de estudio viejo, la última generación de plan de estudio viejo.",
        "start": 197.04,
        "end": 200.04
    },
    {
        "text": " Entonces, en esos tres, lo que hicieron básicamente es usar un paradigma de programación estructurada.",
        "start": 202.04,
        "end": 207.04
    },
    {
        "text": " ¿Qué después lo vamos a ver en esencia tiene por un lado estructuras de control,",
        "start": 208.04,
        "end": 212.04
    },
    {
        "text": " de control de flujo y por el lado estructuras de datos.",
        "start": 213.04,
        "end": 217.04
    },
    {
        "text": " Y por lo general están bastante separadas, con la excepción de Aguntad,",
        "start": 219.04,
        "end": 224.04
    },
    {
        "text": " un tipo de datos que intenta juntar esas dos cosas.",
        "start": 224.04,
        "end": 227.04
    },
    {
        "text": " Bueno, esto es un nuevo paradigma y es su nivel de atracción más arriba,",
        "start": 228.04,
        "end": 232.04
    },
    {
        "text": " la sensación más alta, o sea, levantamos la vara de lo que es a fracciones",
        "start": 232.04,
        "end": 237.04
    },
    {
        "text": " y vamos a agarrar la funcionalidades y los datos y ponerlo en algo que es indivisible y se llama objeto.",
        "start": 237.04,
        "end": 244.04
    },
    {
        "text": " Ya saben lo que es un objeto. ¿Preguntas? ¿No?",
        "start": 245.04,
        "end": 248.04
    },
    {
        "text": " Bueno, pero para explicar esa teoría de objetos van a ver que van a tener, no sé,",
        "start": 250.04,
        "end": 256.03999999999996
    },
    {
        "text": " en clases, en donde viene más y la tres.",
        "start": 257.03999999999996,
        "end": 259.03999999999996
    },
    {
        "text": " La orientación de objetos es algo que les permite programar, como acabo de decir, obvio.",
        "start": 260.04,
        "end": 267.04
    },
    {
        "text": " Pero no solo te permite programar, te permite entender el problema en términos de objetos y sus relaciones.",
        "start": 268.04,
        "end": 275.04
    },
    {
        "text": " Y eso no es programar. Si yo agarro la letra, escucho el cliente hablar y me dice,",
        "start": 276.04,
        "end": 281.04
    },
    {
        "text": " no, porque yo quiero un sistema de agar, antes de picar ninguna tecla del código,",
        "start": 281.04,
        "end": 286.04
    },
    {
        "text": " yo puedo empezar a generar una serie de modelos que son modelos del problema.",
        "start": 287.04,
        "end": 294.04
    },
    {
        "text": " O sea, es como para representar de mejor forma el problema y ahí no estoy picando teclo en el absoluto.",
        "start": 295.04,
        "end": 301.04
    },
    {
        "text": " Bueno, eso es muy breve lo que llamamos análisis orientado objetos.",
        "start": 301.04,
        "end": 307.04
    },
    {
        "text": " O sea, tratar de entender el problema, pero pensando en términos de objetos.",
        "start": 307.04,
        "end": 313.04
    },
    {
        "text": " Después podemos generar otra serie de modelos y vamos a ver que son estas cosas de modelos.",
        "start": 314.04,
        "end": 320.04
    },
    {
        "text": " De hecho, para eso modelo vamos a dar UML, que es una notación gráfica. O sea que vamos a ser dibujitos.",
        "start": 320.04,
        "end": 327.04
    },
    {
        "text": " Vamos a ser dibujitos. Escuchamos el tipo bla bla bla, leemos la letra y generamos modelos para analizar el problema,",
        "start": 328.04,
        "end": 337.04
    },
    {
        "text": " para ver qué hacer, después generamos otros modelos para diseñar el problema, para pensar cómo lo voy a resolver.",
        "start": 338.04,
        "end": 344.04
    },
    {
        "text": " Y por último, voy pico código. Y cuando pico código, uso programación en todos objetos.",
        "start": 344.04,
        "end": 351.04
    },
    {
        "text": " Pero cuando lo diseñé, use orientación objetos, como en la promoción no digo programación de objetos.",
        "start": 351.04,
        "end": 358.04
    },
    {
        "text": " Uso los conceptos de reventación objetos. Y cuando lo analicé, use conceptos de orientación objetos para analizar el problema.",
        "start": 358.04,
        "end": 365.04
    },
    {
        "text": " Se entiende eso. Entonces, uso la teoría de objetos para entender el problema, para entender cómo lo voy a solucionarlo y después para picar código, para efectivamente solucionarlo.",
        "start": 366.04,
        "end": 376.04
    },
    {
        "text": " Porque está todo muy lindo los dibujitos, los modelos, pero hasta que no te remangas y picas código, compila y anda y anda bien.",
        "start": 376.04,
        "end": 384.04
    },
    {
        "text": " No te digo, cómo? Si compila y anda. No, no, no. Que anda bien, hasta que no hagas todo eso, no tienes una solución a el problema que te decía en bla bla bla,",
        "start": 384.04,
        "end": 394.04
    },
    {
        "text": " que te parecía en una letra. Entonces, lo poderoso de este paradigma de orientación objetos no es solamente programar orientado objetos, sino también que tenés la misma forma de arrazonar, o el mismo paradigma.",
        "start": 394.04,
        "end": 409.04
    },
    {
        "text": " Los mismos modelos mentales que tenés para resolver el problema en un código, también lo usas para entender el problema y para diseñar una solución a ese problema.",
        "start": 409.04,
        "end": 418.04
    },
    {
        "text": " Eso es lo que busca en esencia es reducir la distancia, reducir la distancia entre problemas y solución.",
        "start": 419.04,
        "end": 429.04
    },
    {
        "text": " Cuando ustedes, hasta ahora, cuando ustedes se enfrentan un problema grande y complejo, que seguramente por lo menos se enfaculta, todavía no se han enfrentado un problema lo suficientemente grande y complejo, como para que el paradigma que conocen no los soluciones, sino bueno, están problemas.",
        "start": 429.04,
        "end": 445.04
    },
    {
        "text": " O sea, si en P3 les pedí en algo que le van a tener en P4, no tiene sentido. Entonces, hasta ahora vieron problemas con un tamaño complejidad que suena barcable con Pascal Modula IC.",
        "start": 445.04,
        "end": 455.04
    },
    {
        "text": " Bueno, pero ahora vamos a ver otro tipo de problema, de mayor tamaño y mayor complejidad, en lo cual, si siguieramos usándola el mismo paradigma promoción que venían usando antes, van a ver que el salto entre el problema y la solución es muy grande.",
        "start": 455.04,
        "end": 470.04
    },
    {
        "text": " Por supuesto que lo puede resolver en Pascal, cualquier cosa que amo en P4 lo puede resolver en Pascal.",
        "start": 471.04,
        "end": 476.04
    },
    {
        "text": " La cuestión es si eso es deseable o incluso razonable o humanamente razonable, lo que pasaría con el tipo de problema que le damos nosotros acá en P4 y en tercera llamación, que es como la continuación de P4, con ese tipo de problema por su tamaño y complejidad, si de repente digo me ha, este es el problema y te digo,",
        "start": 476.04,
        "end": 498.04
    },
    {
        "text": " ¿Usa Pascal que te da un tenedor de plástico?",
        "start": 498.04,
        "end": 502.04
    },
    {
        "text": " ¿Se puede? Si, vos podés cocinar, comer todo con un tenedor y el cuchillo de plástico, poder se puede.",
        "start": 502.04,
        "end": 510.04
    },
    {
        "text": " Pero la dificultad que te va a dar, entender el problema en términos del negocio, en términos del lo que el tipo le duele de que no puede facturar o que quiera facturar a tener más rápido de los clientes para aumentar su facturación,",
        "start": 510.04,
        "end": 525.04
    },
    {
        "text": " o quiere tener una tasa de satisfacción de los clientes más grande, o sea eso es en términos de los problemas que te hable cliente.",
        "start": 525.04,
        "end": 533.04
    },
    {
        "text": " MAPIAR eso a un presídio es muy fuerte, se entienden, la distancia entre problemas y solución con Pascal para seguirnos volando el pobre Pascal, es enorme.",
        "start": 533.04,
        "end": 545.04
    },
    {
        "text": " Por eso se usa para aprender y para empezar a cuadricular la cabecita y geniero.",
        "start": 545.04,
        "end": 551.04
    },
    {
        "text": " Entonces lo que busca en este tipo de paradigmas, el leopé es entender el problema en términos de objetos, diseñarlo en términos de objetos y para malo en términos de objetos.",
        "start": 551.04,
        "end": 563.04
    },
    {
        "text": " Y bueno, ver que es muy smooth, suave, es una mala traducción, ¿vén? ¿Por qué uso palabras de inglés?",
        "start": 563.04,
        "end": 574.04
    },
    {
        "text": " O sea que sea más sencillo y menos doloroso pasar del problema a la solución a través de análisis diseño y codificación usando el mismo paradigma.",
        "start": 574.04,
        "end": 586.04
    },
    {
        "text": " Esto que le digo ahora es casi como filosófico porque vamos a estar todo el semestre bajando esto que le acabo de decir a tierra.",
        "start": 587.04,
        "end": 596.04
    },
    {
        "text": " O sea que tampoco espero que lo haya entendido a la cabalidad, pero por lo menos pretendo que le has de quedar una idea muy básica de por qué nos vamos a gastar, nos vamos a remangar tanto con esto de la teoría de objetos.",
        "start": 596.04,
        "end": 610.04
    },
    {
        "text": " ¿Preguntas?",
        "start": 611.04,
        "end": 612.04
    },
    {
        "text": " Otra cosa que quiero que vean acá es que dentro de la tapa de análisis frente a objetos, no vamos a centrar en dos, en modelar la estructura y en modelar el comportamiento.",
        "start": 616.04,
        "end": 626.04
    },
    {
        "text": " O sea, ¿qué estructura tiene el problema?",
        "start": 627.04,
        "end": 630.04
    },
    {
        "text": " Si yo veo, tanto de imaginarme el problema, si yo visito la fábrica de mi cliente, ¿qué es lo que veo?",
        "start": 631.04,
        "end": 639.04
    },
    {
        "text": " Yo veo una mesa de trabajo, veo una orden de trabajo, veo un obrero, veo un pedido, veo una factura, bueno, ¿y qué relaciones tienen que atributos tienen?",
        "start": 639.04,
        "end": 652.04
    },
    {
        "text": " Nos empiezo a ver la estructura del problema en términos de objetos y eso es un modelo dominio. Domino es una realidad.",
        "start": 652.04,
        "end": 660.04
    },
    {
        "text": " Después veo que le vamos a pedir a sistema que haga, que factura esto, que controla el destoc, que calcula el IVA, que agrega empleado, blablabla.",
        "start": 662.04,
        "end": 673.04
    },
    {
        "text": " O sea, tanto entender el problema en términos de lo que se le va a pedir. Esto es estático, esto es dinámico.",
        "start": 673.04,
        "end": 678.04
    },
    {
        "text": " Y después trato de ver, bueno, ¿cómo voy a hacer para resolver esto?",
        "start": 679.04,
        "end": 686.04
    },
    {
        "text": " Entonces, trato, acá, esa en realidad se le fue que esa revés. Primero hago un diseño de la solución con respecto al comportamiento dinámico.",
        "start": 687.04,
        "end": 696.04
    },
    {
        "text": " Y después me fijo que estructura de clases, tengo que tener para darle soporte a esos comportamientos.",
        "start": 696.04,
        "end": 703.04
    },
    {
        "text": " Pues acá también esto es dinámico y esto es estático. Y después, porque hasta acá seguramente tenga mucho escrito en Word y hecho con alguna herramienta de VML,",
        "start": 703.04,
        "end": 713.04
    },
    {
        "text": " pero hasta acá no tengo ni una línea de código picada. Bueno, ahora es acelo.",
        "start": 713.04,
        "end": 721.04
    },
    {
        "text": " O sea, le entrego los diseños a un premador y le digo, programalo. Eso suena genial hasta que les digo que ustedes son el diseñador y el premador.",
        "start": 721.04,
        "end": 733.04
    },
    {
        "text": " Ustedes o compañero o compañero, aquí está el lado.",
        "start": 734.04,
        "end": 738.04
    },
    {
        "text": " Entonces, básicamente todo el curso de T4 apunta a que entiendan de verdad estas cosas, de fondo.",
        "start": 739.04,
        "end": 748.04
    },
    {
        "text": " Y como siempre digo lo mismo, o sea, el paradigma de esos objetos seguramente Miguel y yo lo hablemos, digamos un objeto, es bla bla bla y la herencia, el polimorfismo y toda esa chachara.",
        "start": 749.04,
        "end": 762.04
    },
    {
        "text": " Y ustedes lo escuchen y lo lean y así enten con la cabeza diciendo, sí, entiendo, tienes su lógica, perfecto.",
        "start": 763.04,
        "end": 771.04
    },
    {
        "text": " Pero no están entendiendo nada hasta que se pongan a hacer ejercicios.",
        "start": 771.04,
        "end": 776.04
    },
    {
        "text": " En esta materia, el práctico es fundamental. No tanto como el teórico.",
        "start": 777.04,
        "end": 783.04
    },
    {
        "text": " Pero de verdad, el práctico es fundamental, porque si vos te quedas así, cada tanto he dicho el teórico y bueno, después practico algún examen.",
        "start": 784.04,
        "end": 793.04
    },
    {
        "text": " No está bueno y capaz que hay que verá, habrá alguno que se hagas la materia así, pero de verdad no está bueno porque no te metes abajo del apiel lo que es el paradigma de la interesa de los objetos.",
        "start": 794.04,
        "end": 806.04
    },
    {
        "text": " Lo que tenés que realmente entender y para eso entendemos que no hay otra que remangarte y ponerte a hacer los ejercicios.",
        "start": 807.04,
        "end": 813.04
    },
    {
        "text": " Porque más que entienda lo que llevamos a dar el teórico y algún ejercicio, es lo mismo que cuando ustedes empezaron a programar, seguramente empezaban con el leaf y la variabilidad, perfecto.",
        "start": 814.04,
        "end": 823.04
    },
    {
        "text": " No, no, no, si entendí bien. Bueno perfecto, ahora ejercicio.",
        "start": 824.04,
        "end": 827.04
    },
    {
        "text": " Aseme que no se que recorra y que el culen menor y entonces agarrar la hoja en blanco y el cursor titila.",
        "start": 827.04,
        "end": 835.04
    },
    {
        "text": " Si pa, ahora me de cuenta que capaz que me quedo claro pero tengo que construir arriba de eso realmente.",
        "start": 836.04,
        "end": 842.04
    },
    {
        "text": " Y como yo digo y me pueden robar esa idea, meterse lo abajo del apiel. Entendelo de fondo y eso es lo que queremos.",
        "start": 843.04,
        "end": 849.04
    },
    {
        "text": " Bueno, toda la carrera se va a... Hay muchas materias que después van a tener y en particular, taller de promoción es absolutamente la continuación de P4.",
        "start": 849.04,
        "end": 868.04
    },
    {
        "text": " En donde van a usar absolutamente todo lo que venen P4 y aplicándolo en problemas más grandes y más complejos y en otro lenguaje como Java.",
        "start": 869.04,
        "end": 883.04
    },
    {
        "text": " UML quiere decir Unified Model English, o sea, lenguaje de modelado unificado.",
        "start": 887.04,
        "end": 894.04
    },
    {
        "text": " Y acá está la bibliografía que no se ve en las teraráneas pero las tiene. Bueno, si, acá se ve en las teraráneas.",
        "start": 895.04,
        "end": 906.04
    },
    {
        "text": " Y eso también les muestra que de fondo la cosa no cambió hace años. Este paradigma vino y por ahora se quedó.",
        "start": 908.04,
        "end": 920.04
    },
    {
        "text": " Entonces, bueno, cuando lo tiren y aparezcan otros, desde ese punto, 15 años después actualizaremos...",
        "start": 921.04,
        "end": 929.04
    },
    {
        "text": " ...se ha contenido. Hay que autogenerse la hurra.",
        "start": 930.04,
        "end": 934.04
    },
    {
        "text": " Ahora, algunas notas acá. El libro este del Arman que está en español y se llama UML y Patrones. Es un libro que está bastante alineado con un montón de temas que lo quedamos en el curso.",
        "start": 935.04,
        "end": 954.04
    },
    {
        "text": " Lo que tiene el libro es que la primera tiene, creo que 13 ediciones, pero me voy quedando, creo que hace 5 años de diagrammismo,",
        "start": 955.04,
        "end": 961.04
    },
    {
        "text": " así que capaz que el tipo ya sacó un escritor prolífico y ya está creiendo novelas. Si he sido verdad, le va bien.",
        "start": 961.04,
        "end": 967.04
    },
    {
        "text": " Tienen por lo menos 13 ediciones. La primera es bastante agnóstica a cualquier modelo de proceso que ahora vamos a ver, tipo cascada o iterativo,",
        "start": 968.04,
        "end": 976.04
    },
    {
        "text": " o extreme programming, o rupe, o Asia, o Escrame, o como quieren llamarle.",
        "start": 977.04,
        "end": 984.04
    },
    {
        "text": " Entonces, la primera edición del libro, de hecho ya les puede dejar mucho para este curso.",
        "start": 984.04,
        "end": 989.04
    },
    {
        "text": " El tema es que la... Creo que las primeras dos usan una versión un poquito vieja de UML y hay pequeñas diferencias con la versión 2 o 2.x de UML.",
        "start": 989.04,
        "end": 999.04
    },
    {
        "text": " La segunda versión de la segunda seraboración del libro se casan un poquito más con alguna metodología de desarrollo en particular, en particular ROOP y en la última xp o algo parecido a Scram,",
        "start": 1000.04,
        "end": 1010.04
    },
    {
        "text": " pero igual en esencia los contenidos están bastante alineados, pero tampoco que le siguen con eso sea suficiente.",
        "start": 1010.04,
        "end": 1016.04
    },
    {
        "text": " Estoy vendiendo el resto del curso.",
        "start": 1019.04,
        "end": 1022.04
    },
    {
        "text": " Bueno, y este libro les va a hablar, como hais ahí, les va a hablar de patrones en general y les va a hablar de UML.",
        "start": 1023.04,
        "end": 1035.04
    },
    {
        "text": " No, no les va a hablar tanto de orientación de objetos. Habla un poquito, pero no tanto.",
        "start": 1035.04,
        "end": 1040.04
    },
    {
        "text": " Este libro de Follower, que para mí es muy recomendable y realmente está destilado, y por qué he destilado? Porque los tres padres,",
        "start": 1041.04,
        "end": 1055.04
    },
    {
        "text": " los tres padres de UML, que son Buch, Jacobson y Rumbot, no?",
        "start": 1055.04,
        "end": 1064.04
    },
    {
        "text": " Hacemos así.",
        "start": 1064.04,
        "end": 1067.04
    },
    {
        "text": " Escribieron, y por eso a cada uno antes era como los tres popes, los tres gurúes de estos temas.",
        "start": 1067.04,
        "end": 1073.04
    },
    {
        "text": " Y antes cada uno tenía como su notación y no se, tendría su chacrita, se pelearía, etcétera.",
        "start": 1073.04,
        "end": 1079.04
    },
    {
        "text": " Y bueno, de repente se llegaron de Mormar, se juntaron y hicieron el Unified por eso lo de Unified, ¿no? Unified more than that.",
        "start": 1079.04,
        "end": 1087.04
    },
    {
        "text": " Y lo que escribieron fue la especificación del UML, que si ustedes buscan, en la página que lo que es omg.org, Object Management Group.org,",
        "start": 1088.04,
        "end": 1098.04
    },
    {
        "text": " si usted busca la especificación del UML, tienen que tener, tienen que estar muy desvelado para decir, bueno,",
        "start": 1098.04,
        "end": 1105.04
    },
    {
        "text": " o estará haciendo una ticia maestría, doctorador relacionada a estos temas.",
        "start": 1105.04,
        "end": 1110.04
    },
    {
        "text": " Realmente se ha de como, como esta especificación, seguramente si uno ve, que si la especificación de Pascal,",
        "start": 1110.04,
        "end": 1115.04
    },
    {
        "text": " o de syntax y semántica, etcétera, se ha de como realmente bastante inentrable.",
        "start": 1115.04,
        "end": 1120.04
    },
    {
        "text": " Entonces, este tipo Martin Fowler es un muy buen comunicador.",
        "start": 1120.04,
        "end": 1123.04
    },
    {
        "text": " Entonces lo que hizo fue agarrar esa especificación del UML y destilarla para nosotros los humanos.",
        "start": 1123.04,
        "end": 1129.04
    },
    {
        "text": " No para los gurúes como Buch, Jakobson y Rumboth.",
        "start": 1130.04,
        "end": 1134.04
    },
    {
        "text": " Y en español se llama UML, Gota, Gota, como si no existiera un término para destilar.",
        "start": 1135.04,
        "end": 1141.04
    },
    {
        "text": " Pero ya vieron lo que pasa en las películas, pasa acá también, ¿no?",
        "start": 1142.04,
        "end": 1146.04
    },
    {
        "text": " Pero es un lindo librito, son 150 páginas, es chiquito.",
        "start": 1147.04,
        "end": 1151.04
    },
    {
        "text": " Y ojo que es un libro de referencia de UML, o sea no es un libro para decir, bueno, me empieza por la página 1,",
        "start": 1151.04,
        "end": 1156.04
    },
    {
        "text": " o sea porque empieza, no sé, el drama de clase, el drama de escuento, el drama de sequencia,",
        "start": 1157.04,
        "end": 1160.04
    },
    {
        "text": " el drama de comunicación, el drama de diplóvia, el drama de componente, tata tata, o sea,",
        "start": 1160.04,
        "end": 1163.04
    },
    {
        "text": " puede decir y leer solamente el tipo de diagrama que vos querés.",
        "start": 1163.04,
        "end": 1167.04
    },
    {
        "text": " O sea, es más de referencia, no es de lectura, de principios fin.",
        "start": 1167.04,
        "end": 1170.04
    },
    {
        "text": " El de UML y patrones, sí, o sea, pues empezamos por la página 1, también la página 500.",
        "start": 1170.04,
        "end": 1176.04
    },
    {
        "text": " Igual es un libro bien americano, ¿no?",
        "start": 1177.04,
        "end": 1180.04
    },
    {
        "text": " Que puro título es su título, dibujito, es paci en blanco, la maño del etagrande, en fin.",
        "start": 1180.04,
        "end": 1188.04
    },
    {
        "text": " Después, acá tenemos un libro que va a hablar solamente de patrones de diseño,",
        "start": 1190.04,
        "end": 1194.04
    },
    {
        "text": " que es una parte importante del curso, pero es eso, es una parte.",
        "start": 1194.04,
        "end": 1198.04
    },
    {
        "text": " Y obviamente es en la etapa de diseño, ¿no?",
        "start": 1199.04,
        "end": 1202.04
    },
    {
        "text": " Regerimientos, hablamos un poquito, requerimientos, análisis, diseño, implementación, testeo, mantenimiento,",
        "start": 1202.04,
        "end": 1208.04
    },
    {
        "text": " soporte, etcétera. Bueno, en diseño, vamos a ver patrones de diseño y esto es la",
        "start": 1208.04,
        "end": 1215.04
    },
    {
        "text": " viúlia, realmente la viúlia, en lo que es, o no sé, el equivalente a viúlia,",
        "start": 1215.04,
        "end": 1222.04
    },
    {
        "text": " en otras religiones, de lo que es los patrones de diseño.",
        "start": 1222.04,
        "end": 1227.04
    },
    {
        "text": " Y no es la especificación de UML, pero este sí, se lo recomendamos,",
        "start": 1228.04,
        "end": 1233.04
    },
    {
        "text": " recomiendo que lo tomen como referencia para el tema de patrones,",
        "start": 1233.04,
        "end": 1236.04
    },
    {
        "text": " pero van a ver que es un libro que le puede costar un poco de entender,",
        "start": 1237.04,
        "end": 1240.04
    },
    {
        "text": " lo va a que le da un par de vez, se va a hacer un dibujito, o sea, no se preocupen,",
        "start": 1240.04,
        "end": 1244.04
    },
    {
        "text": " van por el buen camino, si le pasa eso.",
        "start": 1244.04,
        "end": 1247.04
    },
    {
        "text": " Y bueno, estos tipos se llaman de Gang or Four, la pandilla de los cuatro,",
        "start": 1249.04,
        "end": 1253.04
    },
    {
        "text": " porque también son otros cuatro popes, gurúes, del tema patrones de diseño.",
        "start": 1253.04,
        "end": 1258.04
    },
    {
        "text": " Y bueno, pues es un libro, se llama más, de otros más de los hermanos de Iten,",
        "start": 1260.04,
        "end": 1263.04
    },
    {
        "text": " con varios lenguajes de promoción, pero bueno, es una referencia de ese más más.",
        "start": 1263.04,
        "end": 1268.04
    },
    {
        "text": " Y después tenemos por ahí, que algún día, una vez nos habíamos,",
        "start": 1268.04,
        "end": 1272.04
    },
    {
        "text": " porque obviamente nos preguntaba, bueno, pero ¿qué tenemos que leer?",
        "start": 1272.04,
        "end": 1276.04
    },
    {
        "text": " Es tipo, bueno, ¿de qué página, qué página minimiza mi esfuerzo de lectura",
        "start": 1276.04,
        "end": 1281.04
    },
    {
        "text": " para probar el curso, ¿no?",
        "start": 1281.04,
        "end": 1285.04
    },
    {
        "text": " A y K and, ley de mismo esfuerzo, ¿no?",
        "start": 1286.04,
        "end": 1289.04
    },
    {
        "text": " Entonces, no pusimos página página, pero pusimos temas contra capítulos.",
        "start": 1289.04,
        "end": 1293.04
    },
    {
        "text": " Y bueno, estos son libros, no sé si se acuerdan, eso pesado,",
        "start": 1294.04,
        "end": 1298.04
    },
    {
        "text": " que uno lo pone en el en un lado, o se lo baja y lo lee, pero de última, son libros.",
        "start": 1298.04,
        "end": 1304.04
    },
    {
        "text": " Yo no le voy a decir que tienen que leer todo esto,",
        "start": 1306.04,
        "end": 1308.04
    },
    {
        "text": " pero le voy a decir que si nunca haber en ninguno de estos,",
        "start": 1308.04,
        "end": 1311.04
    },
    {
        "text": " no sería normal, si nunca tocan ninguno de estos,",
        "start": 1314.04,
        "end": 1318.04
    },
    {
        "text": " no sería normal.",
        "start": 1318.04,
        "end": 1320.04
    },
    {
        "text": " La situación, ¿no? Ustedes son siempre perfectamente normales.",
        "start": 1320.04,
        "end": 1323.04
    },
    {
        "text": " Creo que tenemos un abogado en la facultad.",
        "start": 1325.04,
        "end": 1327.04
    },
    {
        "text": " Y bueno, ¿cuánto más lean, cuantos más se metan, realmente van a ir entendiendo?",
        "start": 1330.04,
        "end": 1334.04
    },
    {
        "text": " Aparte, a ver, yo no se les ocurra que le pudo explicar de mejor forma",
        "start": 1334.04,
        "end": 1340.04
    },
    {
        "text": " lo que es un patrón de diseño que esta gente.",
        "start": 1340.04,
        "end": 1342.04
    },
    {
        "text": " Muy difícil, muy difícil que yo le explique mejor que esta gente.",
        "start": 1344.04,
        "end": 1347.04
    },
    {
        "text": " Espero poder dar una motivación, un links con el curso,",
        "start": 1348.04,
        "end": 1353.04
    },
    {
        "text": " mostrar que a partir de una primera versión muy sencilla con los...",
        "start": 1354.04,
        "end": 1358.04
    },
    {
        "text": " como es, papets.",
        "start": 1360.04,
        "end": 1361.04
    },
    {
        "text": " Títeres, con los títeres y después iteramos y hacemos una aplicación más compleja,",
        "start": 1363.04,
        "end": 1368.04
    },
    {
        "text": " o sea, por el bien de la pedagogía, simplemente y nada menos.",
        "start": 1369.04,
        "end": 1372.04
    },
    {
        "text": " Pero realmente esta gente, por algo son de Gang of War, realmente sabía,",
        "start": 1373.04,
        "end": 1379.04
    },
    {
        "text": " o no sé si hay uno de Canza en Paz o no, pero...",
        "start": 1379.04,
        "end": 1382.04
    },
    {
        "text": " pero realmente son libros super buenos y que les recomendamos mucho que los tengan como de referencia.",
        "start": 1383.04,
        "end": 1390.04
    },
    {
        "text": " Aunque sea referencia puntual en algunos temas.",
        "start": 1391.04,
        "end": 1393.04
    },
    {
        "text": " ¿Pregunta esto?",
        "start": 1395.04,
        "end": 1396.04
    },
    {
        "text": " Bueno, por ahí que hay uno preguntaba...",
        "start": 1397.04,
        "end": 1400.04
    },
    {
        "text": " ¿Qué es de qué estoy hablando? ¿No? ¿Qué es?",
        "start": 1402.04,
        "end": 1405.04
    },
    {
        "text": " Rube, XP, Scram.",
        "start": 1405.04,
        "end": 1407.04
    },
    {
        "text": " Bueno, son modelos o tipos de proceso de desarrollo software.",
        "start": 1409.04,
        "end": 1415.04
    },
    {
        "text": " Entonces, un prohidero describe una enfoque para construir,",
        "start": 1417.04,
        "end": 1420.04
    },
    {
        "text": " instalar y mantener sistemas de software.",
        "start": 1420.04,
        "end": 1422.04
    },
    {
        "text": " Es una recetita.",
        "start": 1423.04,
        "end": 1424.04
    },
    {
        "text": " ¿Y por qué precisamos uno?",
        "start": 1425.04,
        "end": 1426.04
    },
    {
        "text": " Bueno, porque dan temano, o sea, queremos saber qué paso tenemos que dar",
        "start": 1427.04,
        "end": 1431.04
    },
    {
        "text": " para construir un software de la mejor forma posible.",
        "start": 1431.04,
        "end": 1434.04
    },
    {
        "text": " Las ingenierías tradicionales tienen muy bien aceitado lo de tener procedimientos",
        "start": 1435.04,
        "end": 1440.04
    },
    {
        "text": " para construir lo que sea que construyan.",
        "start": 1440.04,
        "end": 1442.04
    },
    {
        "text": " Lo nuestro también es un ingeniería.",
        "start": 1443.04,
        "end": 1445.04
    },
    {
        "text": " Si bien algunos insisten en que es un arte,",
        "start": 1446.04,
        "end": 1448.04
    },
    {
        "text": " igual no tendrá un poquitito de arte, pero tiene cada vez más ingeniería.",
        "start": 1449.04,
        "end": 1452.04
    },
    {
        "text": " Entonces también tenemos recetitas y notan itas.",
        "start": 1454.04,
        "end": 1459.04
    },
    {
        "text": " Otro disclaimer, estas PPTs,",
        "start": 1461.04,
        "end": 1464.04
    },
    {
        "text": " muchas veces están como demasiado,",
        "start": 1465.04,
        "end": 1467.04
    },
    {
        "text": " demasiado explicadas.",
        "start": 1468.04,
        "end": 1470.04
    },
    {
        "text": " O tiene capas que a veces van como,",
        "start": 1471.04,
        "end": 1473.04
    },
    {
        "text": " da mucha vuelta sobre el mismo tema.",
        "start": 1474.04,
        "end": 1476.04
    },
    {
        "text": " No es que yo me la hace para memoria, aunque ya hace unos cuantos años que le estamos usando.",
        "start": 1477.04,
        "end": 1480.04
    },
    {
        "text": " Pero no se preocupen si yo sos PPTs o si hablo un rato y de pedigo,",
        "start": 1481.04,
        "end": 1486.04
    },
    {
        "text": " ya lo vimos, ya lo vimos.",
        "start": 1487.04,
        "end": 1488.04
    },
    {
        "text": " Yo lo que asumo si es que ustedes les lén.",
        "start": 1488.04,
        "end": 1491.04
    },
    {
        "text": " Yo lo que asumo si es que ustedes les lén.",
        "start": 1494.04,
        "end": 1496.04
    },
    {
        "text": " Y si hay algo que me comí,",
        "start": 1500.04,
        "end": 1502.04
    },
    {
        "text": " capaz que fue sin querer y me dicen, profe no dio,",
        "start": 1503.04,
        "end": 1506.04
    },
    {
        "text": " salté muy rápido o les digo,",
        "start": 1507.04,
        "end": 1509.04
    },
    {
        "text": " le dan este cachito para el próximo clase.",
        "start": 1510.04,
        "end": 1512.04
    },
    {
        "text": " Bueno, hay buenas actividades de esa receta,",
        "start": 1513.04,
        "end": 1518.04
    },
    {
        "text": " que es el proceso de desarrollo de software o modelo de proceso.",
        "start": 1519.04,
        "end": 1522.04
    },
    {
        "text": " Primero tenemos que entrar en contexto con la realidad con el dominio,",
        "start": 1523.04,
        "end": 1526.04
    },
    {
        "text": " sobre el cual le vamos a utilizar en un software.",
        "start": 1527.04,
        "end": 1529.04
    },
    {
        "text": " Si viene el cliente, el futuro cliente dice,",
        "start": 1530.04,
        "end": 1532.04
    },
    {
        "text": " mira, yo preciso puede ser mitigo el serrajero.",
        "start": 1533.04,
        "end": 1536.04
    },
    {
        "text": " Y tradamente tengo un tío serrajero, pero no me pide software.",
        "start": 1537.04,
        "end": 1541.04
    },
    {
        "text": " Bueno, primero tendré que meterme y decir,",
        "start": 1543.04,
        "end": 1545.04
    },
    {
        "text": " bueno, a ver, trato entender cuál es el problema,",
        "start": 1546.04,
        "end": 1550.04
    },
    {
        "text": " cuál es el día a día de esa persona, cuál es el dominio de su problema.",
        "start": 1551.04,
        "end": 1554.04
    },
    {
        "text": " Lo que muchas veces llamamos cuál es el negocio,",
        "start": 1555.04,
        "end": 1557.04
    },
    {
        "text": " pero no negocio en términos comercial o incluso de dinero,",
        "start": 1558.04,
        "end": 1560.04
    },
    {
        "text": " o sea, puedo tratar de entender cuál es el negocio o cuál es la lógica,",
        "start": 1561.04,
        "end": 1564.04
    },
    {
        "text": " si quieren, de una empresa, de una microempedesa, de una ONG,",
        "start": 1565.04,
        "end": 1568.04
    },
    {
        "text": " de una repartición del Estado, de un profesional independiente,",
        "start": 1569.04,
        "end": 1572.04
    },
    {
        "text": " de cuál le estoy haciendo sus software, o sea, entender de qué se trata.",
        "start": 1573.04,
        "end": 1576.04
    },
    {
        "text": " Y eso es súper importante,",
        "start": 1578.04,
        "end": 1579.04
    },
    {
        "text": " porque además implica uno de los skills que tenemos más desarrollados los ingenieros.",
        "start": 1580.04,
        "end": 1584.04
    },
    {
        "text": " Hablar con gente,",
        "start": 1585.04,
        "end": 1586.04
    },
    {
        "text": " se receptivo, empatía,",
        "start": 1588.04,
        "end": 1591.04
    },
    {
        "text": " suba acá.",
        "start": 1592.04,
        "end": 1594.04
    },
    {
        "text": " Y ahí tipo, justamente por eso elegí sistema,",
        "start": 1596.04,
        "end": 1598.04
    },
    {
        "text": " dice alguna, ¿no?",
        "start": 1599.04,
        "end": 1600.04
    },
    {
        "text": " Después, tratar de entender, bueno, ¿qué es lo que se espera?",
        "start": 1601.04,
        "end": 1606.04
    },
    {
        "text": " O sea, ¿cuáles son los requerimientos de el software que hay que construir?",
        "start": 1607.04,
        "end": 1613.04
    },
    {
        "text": " Después, y lar bien, en analizar esos requerimientos y depurarlos",
        "start": 1615.04,
        "end": 1619.04
    },
    {
        "text": " y modelarlos de otra forma,",
        "start": 1619.04,
        "end": 1621.04
    },
    {
        "text": " cosa que cada pasito que doy me va acercando a la solución,",
        "start": 1622.04,
        "end": 1626.04
    },
    {
        "text": " no como un problema complejísimo y prosídil de pascalo, o sea, no se machía,",
        "start": 1627.04,
        "end": 1632.04
    },
    {
        "text": " es un hormiga y una espacial, o sea, ni siquiera va a entender lo que está arriba y viceversa.",
        "start": 1633.04,
        "end": 1639.04
    },
    {
        "text": " Toda esta receta, usando la tridobjeto en cada uno de los pasos,",
        "start": 1640.04,
        "end": 1644.04
    },
    {
        "text": " o por menos en estos tres pasos, acá, en estos tres pasos,",
        "start": 1644.04,
        "end": 1649.04
    },
    {
        "text": " usando la tridobjetos, van a ver que es smooth y ya aprende la palabra,",
        "start": 1649.04,
        "end": 1655.04
    },
    {
        "text": " ir de un paso al otro, aumentando la complejidad de a poco.",
        "start": 1656.04,
        "end": 1660.04
    },
    {
        "text": " Entonces, vemos los requerimientos, analizamos que lo que hay que hacer,",
        "start": 1661.04,
        "end": 1664.04
    },
    {
        "text": " diseñamos, ¿cómo lo vamos a hacer?",
        "start": 1665.04,
        "end": 1666.04
    },
    {
        "text": " Lo programamos en un lenguaje, lo que desficamos, el lenguaje en el todo objeto,",
        "start": 1667.04,
        "end": 1670.04
    },
    {
        "text": " porque también no lo voy a pensar, no voy a pensar entre el problema en términos de objetos,",
        "start": 1670.04,
        "end": 1675.04
    },
    {
        "text": " diseñar una solución en términos de objetos y usar pascalo.",
        "start": 1676.04,
        "end": 1678.04
    },
    {
        "text": " Sería un poco inconsistente, aunque creo que existe object pascalo,",
        "start": 1679.04,
        "end": 1683.04
    },
    {
        "text": " que también me verizaría, hasta re usar object pascalo, pero bueno,",
        "start": 1684.04,
        "end": 1687.04
    },
    {
        "text": " por lo menos estaría más cerca de usar el mismo paradigma en las diferentes etapas.",
        "start": 1688.04,
        "end": 1691.04
    },
    {
        "text": " Y bueno, después hay que testiar, que ya habrán visto que él,",
        "start": 1692.04,
        "end": 1694.04
    },
    {
        "text": " la carrera de testing y el rol de tester, es o de Qa, ¿sabes lo que es Qa?",
        "start": 1695.04,
        "end": 1699.04
    },
    {
        "text": " ¿Cuálity y ayúrenes? ¿Cuálity y ayúrenes?",
        "start": 1700.04,
        "end": 1703.04
    },
    {
        "text": " O el rol de Qa es cada vez más importante, así como el rol de arquitecto de software,",
        "start": 1704.04,
        "end": 1708.04
    },
    {
        "text": " que nadie sabe lo que es, pero suena genial.",
        "start": 1709.04,
        "end": 1710.04
    },
    {
        "text": " Todo lo que queremos era arquitecto de software, porque pa, eso dice en la tarjetita si usaran,",
        "start": 1711.04,
        "end": 1716.04
    },
    {
        "text": " en la firma del mail.",
        "start": 1717.04,
        "end": 1719.04
    },
    {
        "text": " Entonces, probamos que esté bien hecho y entregamos el producto,",
        "start": 1720.04,
        "end": 1723.04
    },
    {
        "text": " se hace la puesta en producción, de ese producto,",
        "start": 1724.04,
        "end": 1726.04
    },
    {
        "text": " hace el retoque de varios y bueno,",
        "start": 1726.04,
        "end": 1730.04
    },
    {
        "text": " Fichur, Bag, a veces es muy parecido.",
        "start": 1731.04,
        "end": 1736.04
    },
    {
        "text": " Y después mantenerlo, entonces, obviamente que esto creo que no les debería suena demasiado esta terrestre o jala,",
        "start": 1737.04,
        "end": 1744.04
    },
    {
        "text": " que no, acá nos vamos a centrar sobre todo en los pasos 3, 4 y 5, 3, 4 y 5, ¿sabes?",
        "start": 1745.04,
        "end": 1752.04
    },
    {
        "text": " De requerimientos, vamos a ver un poco por lo general, nosotros le vamos a dar casos de uso,",
        "start": 1753.04,
        "end": 1759.04
    },
    {
        "text": " que es la forma que tenemos de capturar requerimientos,",
        "start": 1760.04,
        "end": 1762.04
    },
    {
        "text": " en ingenieras del software y en el PIS, projecto de ingenieras software,",
        "start": 1763.04,
        "end": 1767.04
    },
    {
        "text": " van a ver más del tema de requerimiento, del tema de casos de uso,",
        "start": 1768.04,
        "end": 1771.04
    },
    {
        "text": " entonces le vamos a ver un poquito, lo introducimos, pero es algo que usted va a retomar después,",
        "start": 1772.04,
        "end": 1775.04
    },
    {
        "text": " por ejemplo hay gente que se dedica a entender al cliente y traducirlo al equipo de desarrollo,",
        "start": 1775.04,
        "end": 1783.04
    },
    {
        "text": " pueden ser en ahí, funcionales, a veces algún jefe de proyecto, pero el rol de ahí está funcional,",
        "start": 1784.04,
        "end": 1789.04
    },
    {
        "text": " tiene eso rol, que es una persona con un background técnico y con soft skills,",
        "start": 1790.04,
        "end": 1794.04
    },
    {
        "text": " habilidades blandas, habilidades blandas, eso es hablar, que se entienda,",
        "start": 1795.04,
        "end": 1800.04
    },
    {
        "text": " que va vestido correctamente, afetado, pero eso lo vemos un poquito y queda para otros cursos,",
        "start": 1800.04,
        "end": 1810.04
    },
    {
        "text": " y lo mismo el resto de testing de librer y etc., queda para algún otro curso,",
        "start": 1811.04,
        "end": 1815.04
    },
    {
        "text": " o sea que acá nos seguimos entrando en desarrollar software,",
        "start": 1816.04,
        "end": 1819.04
    },
    {
        "text": " o sea por eso llamar programación 4, los dichos de paso,",
        "start": 1820.04,
        "end": 1823.04
    },
    {
        "text": " o sea de hecho esta primera se tapa si la última no es programación,",
        "start": 1824.04,
        "end": 1827.04
    },
    {
        "text": " o sea que estaría más llamado por lo menos, sigue siendo programar,",
        "start": 1827.04,
        "end": 1831.04
    },
    {
        "text": " pero antes de picar el código vamos a darle mucho énfasis en análisis,",
        "start": 1832.04,
        "end": 1837.04
    },
    {
        "text": " sobretodogjetos y diseño, o retodogjetos, y literalmente les aseguro casi que va a ser",
        "start": 1838.04,
        "end": 1848.04
    },
    {
        "text": " más difícil analizar y diseñar que programar, o sea la mayor dificultad o por lo menos",
        "start": 1849.04,
        "end": 1854.04
    },
    {
        "text": " el asumiendo que vuelan programando, seguro van a borrar más que yo programando,",
        "start": 1854.04,
        "end": 1861.04
    },
    {
        "text": " pero bueno, no soy una buena referencia para programar, pero una vez que tenga le problema definiendo",
        "start": 1862.04,
        "end": 1869.04
    },
    {
        "text": " alguna forma hacer un buen análisis y un buen diseño les deja casi servido lo que es la programación,",
        "start": 1870.04,
        "end": 1876.04
    },
    {
        "text": " o sea y de hecho si ustedes toman un diseño detallado,",
        "start": 1877.04,
        "end": 1881.04
    },
    {
        "text": " hay herramientas que ya les dan un esqueleto de código automáticamente,",
        "start": 1881.04,
        "end": 1885.04
    },
    {
        "text": " o sea play, y aparte de un montón de heramas WML ya te da muchísimo porcentaje del código hecho,",
        "start": 1886.04,
        "end": 1891.04
    },
    {
        "text": " capaz que más es la mitad, dependiendo de cuán específico sea con los diseños de WML,",
        "start": 1892.04,
        "end": 1896.04
    },
    {
        "text": " o sea que cada vez más la dificultad no está en sentate y programar,",
        "start": 1897.04,
        "end": 1900.04
    },
    {
        "text": " es sentate y entender analizar y diseñar, y después un adon, un algún id,",
        "start": 1901.04,
        "end": 1909.04
    },
    {
        "text": " un id, en torno de desarrollo integrado,",
        "start": 1909.04,
        "end": 1913.04
    },
    {
        "text": " seguramente hasta te ayuden a partir de un diseño detallado a generar el código y viceversa,",
        "start": 1914.04,
        "end": 1918.04
    },
    {
        "text": " y generen inversa a partir de un código que te muestre el diseño de ese código.",
        "start": 1919.04,
        "end": 1923.04
    },
    {
        "text": " Preguntas?",
        "start": 1924.04,
        "end": 1925.04
    },
    {
        "text": " Bueno, hay más cosas que esto si les interesa,",
        "start": 1928.04,
        "end": 1932.04
    },
    {
        "text": " de hecho a mí lo que más me gusta estas cosas,",
        "start": 1932.04,
        "end": 1936.04
    },
    {
        "text": " hoy en mi vida privada,",
        "start": 1937.04,
        "end": 1940.04
    },
    {
        "text": " es profesional, privada.",
        "start": 1941.04,
        "end": 1943.04
    },
    {
        "text": " ¿Quién decide cuánto sale el software?",
        "start": 1944.04,
        "end": 1947.04
    },
    {
        "text": " Bien es su tío, lo dontólogo,",
        "start": 1949.04,
        "end": 1952.04
    },
    {
        "text": " que sea solo por eso ya,",
        "start": 1953.04,
        "end": 1955.04
    },
    {
        "text": " oi la como estás, oi, que casi.",
        "start": 1956.04,
        "end": 1958.04
    },
    {
        "text": " Bueno, hacemos sistema para registrar mis pacientes, lo que les hago y bla bla bla,",
        "start": 1959.04,
        "end": 1964.04
    },
    {
        "text": " bueno, ¿cuánto me sale?",
        "start": 1965.04,
        "end": 1966.04
    },
    {
        "text": " Yo les aseguro que esa es una pregunta que es muy difícil de responder,",
        "start": 1967.04,
        "end": 1971.04
    },
    {
        "text": " y les parece importante responder esa pregunta cuantos sale,",
        "start": 1973.04,
        "end": 1976.04
    },
    {
        "text": " y yo digo que sí, ¿no?",
        "start": 1977.04,
        "end": 1978.04
    },
    {
        "text": " Yo digo que sí, entonces la estimación es algo realmente muy complejo y que muchas veces",
        "start": 1979.04,
        "end": 1985.04
    },
    {
        "text": " los ingenieros que solo se centran o analistas o programadores,",
        "start": 1985.04,
        "end": 1989.04
    },
    {
        "text": " que si a que solo se centran el desarrollo,",
        "start": 1990.04,
        "end": 1991.04
    },
    {
        "text": " les cuesta acercarse a este otro tipo de problemas,",
        "start": 1992.04,
        "end": 1995.04
    },
    {
        "text": " estimaciones, planificaciones,",
        "start": 1996.04,
        "end": 1998.04
    },
    {
        "text": " lo que hace un PM, un proyecto humana,",
        "start": 2000.04,
        "end": 2002.04
    },
    {
        "text": " ya lo sea, planificar ese proceso de desarrollo, ver quién hace qué cosa en qué momento,",
        "start": 2003.04,
        "end": 2006.04
    },
    {
        "text": " cómo se orquesta eso,",
        "start": 2007.04,
        "end": 2008.04
    },
    {
        "text": " porque para el programita de la calculadora del video club,",
        "start": 2009.04,
        "end": 2013.04
    },
    {
        "text": " que empiece a descansen, y algunos más,",
        "start": 2014.04,
        "end": 2017.04
    },
    {
        "text": " capaz de una no se imagina, ¿cómo? ¿por qué tengo que planificar?",
        "start": 2018.04,
        "end": 2020.04
    },
    {
        "text": " Bueno, pero cuando tenés un sistema que sea",
        "start": 2021.04,
        "end": 2024.04
    },
    {
        "text": " reacervación aérea, de la ciudad donde te tiques aéreos, ¿no?",
        "start": 2025.04,
        "end": 2028.04
    },
    {
        "text": " Amadeus, por ejemplo, o sea, ¿pasa tener miles de personas trabajando en un proyecto?",
        "start": 2029.04,
        "end": 2033.04
    },
    {
        "text": " Bueno, y en algo más cercano a la realidad de nuestro país,",
        "start": 2034.04,
        "end": 2037.04
    },
    {
        "text": " puedes tener fácilmente un equipo de cinco desarrolladores,",
        "start": 2038.04,
        "end": 2041.04
    },
    {
        "text": " más, claro, bueno, apunta ya, pero un poquito más humilde,",
        "start": 2041.04,
        "end": 2047.04
    },
    {
        "text": " pero solo hacer que cinco desarrolladores, más analista, o test,",
        "start": 2048.04,
        "end": 2051.04
    },
    {
        "text": " 3PM, hacer que esas personas lauren como una orquesta, como un equipo,",
        "start": 2052.04,
        "end": 2056.04
    },
    {
        "text": " no como un grupo, como un equipo, realmente no es sencillo,",
        "start": 2057.04,
        "end": 2060.04
    },
    {
        "text": " y sí hay que tener soft skills, ¿no?",
        "start": 2061.04,
        "end": 2064.04
    },
    {
        "text": " Y bueno, blah, blah, blah, entonces, de todo esto,",
        "start": 2066.04,
        "end": 2069.04
    },
    {
        "text": " no vamos a hablar más nada que estas pocas palabras que les digo,",
        "start": 2069.04,
        "end": 2073.04
    },
    {
        "text": " o alguna otra negotad que los puede llegar a ocurrir un poco.",
        "start": 2074.04,
        "end": 2077.04
    },
    {
        "text": " Y bueno, hay otros cursos también, más adelante,",
        "start": 2079.04,
        "end": 2081.04
    },
    {
        "text": " hay no tanto todavía, y se están generando algunas propuestas más,",
        "start": 2082.04,
        "end": 2085.04
    },
    {
        "text": " en estas épocas, y después también, obviamente,",
        "start": 2086.04,
        "end": 2088.04
    },
    {
        "text": " pogrados para ver temas más puntuals.",
        "start": 2089.04,
        "end": 2091.04
    },
    {
        "text": " Bueno, hay un modelo de proceso de desarrollo de software que se llama cascada,",
        "start": 2093.04,
        "end": 2098.04
    },
    {
        "text": " que en los libros aparecen como Waterfall, cascada en inglés.",
        "start": 2099.04,
        "end": 2104.04
    },
    {
        "text": " Entonces, dice, bueno, todos esos pasos, ¿sabes cómo se hacen?",
        "start": 2105.04,
        "end": 2108.04
    },
    {
        "text": " ¿Te a uno?",
        "start": 2109.04,
        "end": 2110.04
    },
    {
        "text": " Ok, y aunque no crean esto, a cuanto a dos décadas, esta teoría se usa durante décadas.",
        "start": 2112.04,
        "end": 2121.04
    },
    {
        "text": " Entonces, esta teoría o este modelo de proceso dice, bueno,",
        "start": 2122.04,
        "end": 2124.04
    },
    {
        "text": " agarrar el primero, releva a qué lo que tienes que hacer,",
        "start": 2125.04,
        "end": 2127.04
    },
    {
        "text": " hablar con el cliente, escribir los requerimientos,",
        "start": 2127.04,
        "end": 2129.04
    },
    {
        "text": " los casos de luz en nuestro caso,",
        "start": 2130.04,
        "end": 2131.04
    },
    {
        "text": " o las funcionalidades que tienen que tener.",
        "start": 2132.04,
        "end": 2134.04
    },
    {
        "text": " Después, analizar, ¿qué es en detalle hace un modelo de análisis de qué vas a hacer?",
        "start": 2135.04,
        "end": 2141.04
    },
    {
        "text": " Y van a ver qué es distinto, esto aunque ahora parecían cosas confundes.",
        "start": 2142.04,
        "end": 2145.04
    },
    {
        "text": " Después, fijate cómo lo vas a hacer, todo.",
        "start": 2146.04,
        "end": 2148.04
    },
    {
        "text": " Después, implementalo todo, después testiado todo, después,",
        "start": 2149.04,
        "end": 2152.04
    },
    {
        "text": " liberación es la instalación, la apuesta en producción,",
        "start": 2153.04,
        "end": 2156.04
    },
    {
        "text": " y después, mantenerlo.",
        "start": 2157.04,
        "end": 2158.04
    },
    {
        "text": " O sea, los pasos interiores de la receta, en secuencia.",
        "start": 2159.04,
        "end": 2162.04
    },
    {
        "text": " Los que no hayan visto de este tema y no sean tramposos.",
        "start": 2164.04,
        "end": 2167.04
    },
    {
        "text": " Para los nuevos de ustedes, ¿qué es lo que le ven a esta forma de trabajar,",
        "start": 2169.04,
        "end": 2175.04
    },
    {
        "text": " a esta forma de construir software?",
        "start": 2176.04,
        "end": 2177.04
    },
    {
        "text": " Le ven a alguna crítica, ¿por qué es muy sencilla en teotiva, sin duda?",
        "start": 2178.04,
        "end": 2182.04
    },
    {
        "text": " Pero le ven alguna crítica o posible problema que pueda tener.",
        "start": 2182.04,
        "end": 2185.04
    },
    {
        "text": " ¿Qué ves en inECIDA de volver para atrás?",
        "start": 2186.04,
        "end": 2188.04
    },
    {
        "text": " Muy bien, el compañero dice que a veces hay necesidad de volver para atrás.",
        "start": 2189.04,
        "end": 2191.04
    },
    {
        "text": " Y bueno, ya ves, a partir de esto se ha anido mutando un poco el waterfall",
        "start": 2193.04,
        "end": 2198.04
    },
    {
        "text": " con algunas flechitas un poco para atrás, entonces, bueno,",
        "start": 2199.04,
        "end": 2201.04
    },
    {
        "text": " si tiene que cambiar algo, cambiar, y después modificar,",
        "start": 2202.04,
        "end": 2205.04
    },
    {
        "text": " ¿y qué más se le ocurre que tiene que ver con eso de volver para atrás?",
        "start": 2206.04,
        "end": 2208.04
    },
    {
        "text": " Bien, que si te demoras mucho, ¿eh?",
        "start": 2213.04,
        "end": 2215.04
    },
    {
        "text": " Tú repito de las preguntas, porque a partir ya me dijeron que no se escuchaba en las duches.",
        "start": 2216.04,
        "end": 2219.04
    },
    {
        "text": " Si te trancas en algo, trancas el resto, bien, y sobre todo,",
        "start": 2220.04,
        "end": 2225.04
    },
    {
        "text": " escapa que si sogo mismo tu propio equipo, capaz que no jode mucho,",
        "start": 2226.04,
        "end": 2229.04
    },
    {
        "text": " pero si hay otra gente esperando, ¿no? Bien, cronometrado,",
        "start": 2230.04,
        "end": 2233.04
    },
    {
        "text": " por así decirlo, está jodando otra gente que está parada.",
        "start": 2234.04,
        "end": 2236.04
    },
    {
        "text": " Bien.",
        "start": 2237.04,
        "end": 2238.04
    },
    {
        "text": " ¿No me pareces un más de atrás de las que te haces?",
        "start": 2239.04,
        "end": 2241.04
    },
    {
        "text": " Bien, no lo pones en más de atrás de las que te ha completado totalmente terminado.",
        "start": 2241.04,
        "end": 2244.04
    },
    {
        "text": " ¿Y qué espera?",
        "start": 2245.04,
        "end": 2246.04
    },
    {
        "text": " ¿No? Yo les digo, bueno, el ingeniero soy yo, el cliente que espera.",
        "start": 2248.04,
        "end": 2253.04
    },
    {
        "text": " O sea, esto en un sistema grande, todo está cascada, pueden ser seis meses.",
        "start": 2254.04,
        "end": 2259.04
    },
    {
        "text": " Tranquilamente, en un sistema de necesidad de complejidad, esto puede ser meses.",
        "start": 2260.04,
        "end": 2264.04
    },
    {
        "text": " Entonces, acá vos lo viste al tipo, a la típica, hablaste teléfono,",
        "start": 2265.04,
        "end": 2270.04
    },
    {
        "text": " y todo el tipo de pupo, genial.",
        "start": 2271.04,
        "end": 2273.04
    },
    {
        "text": " Acá, ya van al sotano y solo pasa a faina por abajo de la puerta,",
        "start": 2274.04,
        "end": 2280.04
    },
    {
        "text": " terminan, y a los seis meses salen y a dos opciones.",
        "start": 2282.04,
        "end": 2286.04
    },
    {
        "text": " Una es que hagan eso y cuando salgan sea de OS y sean bilgay tipo laelen,",
        "start": 2287.04,
        "end": 2291.04
    },
    {
        "text": " y no me atrevo, así que le fue mal.",
        "start": 2293.04,
        "end": 2295.04
    },
    {
        "text": " Pero otra es que el cliente le diga, ¿qué es esto?",
        "start": 2296.04,
        "end": 2300.04
    },
    {
        "text": " Pero acá, a veces, ¿qué podés?",
        "start": 2302.04,
        "end": 2304.04
    },
    {
        "text": " Calcular la facturación, pero no fue lo que usted pedía.",
        "start": 2305.04,
        "end": 2308.04
    },
    {
        "text": " Pero como no, acá yo, ingeniero, soft skills, entendí clarito lo que me dijiste y no repregunte nada.",
        "start": 2309.04,
        "end": 2316.04
    },
    {
        "text": " Porque me dio cosas, no sé qué, pero yo escribí, y después entendí,",
        "start": 2317.04,
        "end": 2321.04
    },
    {
        "text": " que mi cabezita cuadrada de ingenieril entiende.",
        "start": 2322.04,
        "end": 2324.04
    },
    {
        "text": " Si yo no fuese ingeniero, no podrías de te chiste, por supuesto, ¿no?",
        "start": 2325.04,
        "end": 2328.04
    },
    {
        "text": " Entonces, ¿qué pasa con esto?",
        "start": 2329.04,
        "end": 2332.04
    },
    {
        "text": " No tenemos ninguna visibilidad, nos le estamos dando al cliente y recuerden,",
        "start": 2333.04,
        "end": 2338.04
    },
    {
        "text": " cuando digo, el cliente es el que nos encomenda hacer algo, no tiene por qué haber dinero en el medio,",
        "start": 2339.04,
        "end": 2342.04
    },
    {
        "text": " no tiene que una cosa con otra. Y de hecho, cliente y usuario hasta capaz que son cosas distintas.",
        "start": 2343.04,
        "end": 2346.04
    },
    {
        "text": " Ahí sí, por los usuarios, el que lo va a usar y cliente, que lo va a pagar,",
        "start": 2347.04,
        "end": 2350.04
    },
    {
        "text": " a contratar, o a controlar de alguna forma.",
        "start": 2351.04,
        "end": 2352.04
    },
    {
        "text": " Entonces, este modelo no tiene una forma de probar feedback.",
        "start": 2353.04,
        "end": 2357.04
    },
    {
        "text": " Feedback, sí, no tengo que traducir feedback, por Dios.",
        "start": 2359.04,
        "end": 2362.04
    },
    {
        "text": " Entonces, literalmente pasaba eso de que salías de eso, ¿no?",
        "start": 2363.04,
        "end": 2367.04
    },
    {
        "text": " Y realmente no era el cliente quería, entonces si bueno estaba perfecto, como recién decíamos, bueno,",
        "start": 2368.04,
        "end": 2373.04
    },
    {
        "text": " acá empezamos a poner flechas, te les tí lo bueno.",
        "start": 2374.04,
        "end": 2376.04
    },
    {
        "text": " Sí, no es lo que el tipo quería, bueno, pero ¿por qué me lo dijo así? ¿por qué no me lo dijo de otra forma?",
        "start": 2376.04,
        "end": 2381.04
    },
    {
        "text": " No, por supuesto, la culpa nunca va a ser mía, la culpa siempre va a ser del otro.",
        "start": 2382.04,
        "end": 2386.04
    },
    {
        "text": " Lo curioso es que el cliente es él y yo estoy dando un servicio.",
        "start": 2387.04,
        "end": 2393.04
    },
    {
        "text": " Y el que sabe de esto soy yo, no él.",
        "start": 2394.04,
        "end": 2397.04
    },
    {
        "text": " Entonces, cuando me dice algo, es mi responsabilidad entenderlo de la forma correcta.",
        "start": 2398.04,
        "end": 2402.04
    },
    {
        "text": " No es responsabilidad de cliente decirlo de la forma correcta.",
        "start": 2403.04,
        "end": 2406.04
    },
    {
        "text": " Entonces, ¿te están poniendo flechas para atrás?",
        "start": 2409.04,
        "end": 2411.04
    },
    {
        "text": " Igualdad, de repente no es lo que quería, vengo y vuelvo a análisis.",
        "start": 2412.04,
        "end": 2417.04
    },
    {
        "text": " Y cambio eso que estaba mal, no importa culpa de quién.",
        "start": 2418.04,
        "end": 2421.04
    },
    {
        "text": " Lo cambio y sigo. ¿Qué problema tiene eso?",
        "start": 2422.04,
        "end": 2425.04
    },
    {
        "text": " Que tienen que hacer todo ese cacho, hacerlo todo de vuelta.",
        "start": 2427.04,
        "end": 2430.04
    },
    {
        "text": " Entonces, por ejemplo, hubo gente que estuvo tres días testiando una funcionalidad",
        "start": 2431.04,
        "end": 2436.04
    },
    {
        "text": " que si alguien la hubiera visto de antemano, hubiese dicho, no, no, no.",
        "start": 2437.04,
        "end": 2441.04
    },
    {
        "text": " No te esté ese esto porque directamente no es así, no es lo que yo quiero.",
        "start": 2442.04,
        "end": 2445.04
    },
    {
        "text": " Entonces, por ese tipo de problema y algún otro, en esencia, lo que empezó a pasar es que este modelo empezó a hacer agua.",
        "start": 2447.04,
        "end": 2455.04
    },
    {
        "text": " En la medida que los problemas que se atacaban eran más grandes y más complejos.",
        "start": 2461.04,
        "end": 2465.04
    },
    {
        "text": " Ojo que esto se sigue usando y no es que esto esté mal.",
        "start": 2466.04,
        "end": 2469.04
    },
    {
        "text": " Otro problema que tiene esto, ya que estamos, es que estamos asumiendo que una vez que terminamos la tapa,",
        "start": 2471.04,
        "end": 2477.04
    },
    {
        "text": " ya está todo perfecto y podemos seguir adelante.",
        "start": 2478.04,
        "end": 2480.04
    },
    {
        "text": " Y que el cliente no va a cambiar la opinión.",
        "start": 2481.04,
        "end": 2483.04
    },
    {
        "text": " Y claro, no va a cambiar la opinión, porque si no me ve y no ve nada, no va a cambiar la opinión.",
        "start": 2485.04,
        "end": 2489.04
    },
    {
        "text": " Pero por lo general, le cuya espera, es cierto, y cada vez más, en este mundo moderno,",
        "start": 2491.04,
        "end": 2496.04
    },
    {
        "text": " es que haya flexibilidad del parte de parte del proveedor del software.",
        "start": 2497.04,
        "end": 2502.04
    },
    {
        "text": " Entonces, cuando yo le muestro una primera versión, no a las seis meses.",
        "start": 2503.04,
        "end": 2505.04
    },
    {
        "text": " Cuando le muestro al mes, una primera versión, que esta fea y incompleta no importa,",
        "start": 2506.04,
        "end": 2510.04
    },
    {
        "text": " pero tiene la esencia de esa parte que elegí para mostrarle una versión beta inicial,",
        "start": 2511.04,
        "end": 2517.04
    },
    {
        "text": " se lo muestro, el tipo de ese, a no, acá no entendiste bien esto, entonces me lo cambia",
        "start": 2518.04,
        "end": 2522.04
    },
    {
        "text": " y de última, si vuelo para atrás, no es tan costoso, o sea, no pasé tanto tiempo ni tantas etapas,",
        "start": 2523.04,
        "end": 2528.04
    },
    {
        "text": " entonces lo corrigo enseguida y vuelvo, o sea, no hay que buscar, llegará a cero el retrabajo,",
        "start": 2529.04,
        "end": 2534.04
    },
    {
        "text": " es imposible llevar a cero el retrabajo, pero cuanto antes lo detectes,",
        "start": 2535.04,
        "end": 2538.04
    },
    {
        "text": " menos impacto va a tener en el resto de las etapas y de las funcionalidades, ¿no?",
        "start": 2539.04,
        "end": 2544.04
    },
    {
        "text": " que es natural, sino que además, mostrarse lo rápido, le va a permitir la cliente decir,",
        "start": 2544.04,
        "end": 2550.04
    },
    {
        "text": " pero para, porque ahora que lo veo así, porque no sé, el tipo capaz que está usando",
        "start": 2551.04,
        "end": 2554.04
    },
    {
        "text": " de las tarjetitas, esas de papel, que las mueve de a uno y está en una especie de rueda,",
        "start": 2555.04,
        "end": 2559.04
    },
    {
        "text": " está pasando de eso a un sistema distribuido en Java,",
        "start": 2560.04,
        "end": 2564.04
    },
    {
        "text": " entonces, hay cosas que el tipo no se imagina que la pueda ser mejor",
        "start": 2565.04,
        "end": 2569.04
    },
    {
        "text": " y es trabajo de ustedes mostrarles que la pueden hacer mejor, o sea,",
        "start": 2570.04,
        "end": 2574.04
    },
    {
        "text": " seguramente los procedimientos que tiene para registrar clientes con las tarjetitas de cartón",
        "start": 2575.04,
        "end": 2579.04
    },
    {
        "text": " no pueden ser simplemente traducidos a un sistema informático,",
        "start": 2580.04,
        "end": 2582.04
    },
    {
        "text": " porque te da tanta masa herramienta, tanto más poder que estaría seguramente subutilizando",
        "start": 2583.04,
        "end": 2589.04
    },
    {
        "text": " si usas los mismos pasos y los mismos, si usas la misma cabeza para diseñarles sistema,",
        "start": 2590.04,
        "end": 2595.04
    },
    {
        "text": " un modo de urbano y complejo, se tiende. Entonces, cuando lo ve te dice,",
        "start": 2595.04,
        "end": 2599.04
    },
    {
        "text": " pero cambiamos acá, ¿qué es el analo o cuando lo el arquitecto le dicen?",
        "start": 2600.04,
        "end": 2603.04
    },
    {
        "text": " Ah bueno, pero yo te entras a tu casa que estaba en construcción y ya,",
        "start": 2605.04,
        "end": 2608.04
    },
    {
        "text": " pero esa pared del fondo que es otro momento oscuro, vamos a poner un par de ventanas, ya que estamos.",
        "start": 2610.04,
        "end": 2613.04
    },
    {
        "text": " Eso en realidad al arquitecto no le debería de joder, seguramente le jodas igual.",
        "start": 2615.04,
        "end": 2619.04
    },
    {
        "text": " pero te mostré el render 3D con el auto, no sé qué, autocad, bueno pero no es lo mismo que yo",
        "start": 2619.04,
        "end": 2626.32
    },
    {
        "text": " lo ve acá adentro, forma que hay vigas y está todo sin terminar yo veo que no entra luz en esa",
        "start": 2626.32,
        "end": 2633.04
    },
    {
        "text": " pared, o sea esto es lo mismo, y el arquitecto o el ingeniero no tienen que nojarse porque el cliente",
        "start": 2633.04,
        "end": 2641.04
    },
    {
        "text": " vea algo a lo cual no está habituado de una forma nueva, diga, pero entonces podría meter 3 ventanas",
        "start": 2641.04,
        "end": 2647.68
    },
    {
        "text": " ahí me queda super iluminado, lo que sí tienen que explicar ustedes es que si va a cambiar algo",
        "start": 2647.68,
        "end": 2654.08
    },
    {
        "text": " eso tiene un impacto también, por ejemplo en la estimación inicial, que seguro es lo que está",
        "start": 2654.08,
        "end": 2658.8799999999997
    },
    {
        "text": " haciendo el arquitecto, te dice cómo no, yo te mando picar eso y poner una ventana y son 3 lucas más",
        "start": 2658.8799999999997,
        "end": 2664.56
    },
    {
        "text": " pero es lógico o no es lógico, o sea siempre y cuando no sea un cambio inicial de los requerimientos",
        "start": 2664.56,
        "end": 2672.24
    },
    {
        "text": " no porque si el tipo dijo no, yo no quiero expresamente ninguna ventana en la pared de fondo, perfecto",
        "start": 2672.3999999999996,
        "end": 2678.7999999999997
    },
    {
        "text": " no queda muy oscuro, me está jodiendo, me dijiste no quería inventar, tener razón, te dije no quería",
        "start": 2678.7999999999997,
        "end": 2685.6
    },
    {
        "text": " pero ahora lo veo y quiero ventana, entonces cuantos salen las ventanas, o sea, esa sí es lo normal y es",
        "start": 2685.6,
        "end": 2692.56
    },
    {
        "text": " natural y está bien que eso pase y todo ese tipo de interacciones este modelo no lo permite",
        "start": 2692.56,
        "end": 2698.0
    },
    {
        "text": " blablablabla",
        "start": 2702.3199999999997,
        "end": 2704.3199999999997
    },
    {
        "text": " entonces hay otro modelo de proceso de desarrollo de software que se llama iterativo incremental",
        "start": 2706.64,
        "end": 2713.3599999999997
    },
    {
        "text": " que agarras las etapas de análisis diseño y implementación y las pone en una gran etapa de",
        "start": 2714.8799999999997,
        "end": 2724.3999999999996
    },
    {
        "text": " construcción, acá dentro está análisis diseño y implementación y testing, adic, análisis diseño y implementación y",
        "start": 2724.4,
        "end": 2733.76
    },
    {
        "text": " testing y lo que se va a hacer es dar vuelta varias veces sobre esas cuatro etapas, salud para",
        "start": 2733.76,
        "end": 2742.56
    },
    {
        "text": " diferentes conjuntos de funcionalidades, entonces el relegamiento por lo general si se hace una sola vez",
        "start": 2742.56,
        "end": 2749.6800000000003
    },
    {
        "text": " después se podrán cambiar cosas de análisis y se pueda hacer acá dentro y después una vez que esté",
        "start": 2750.64,
        "end": 2755.68
    },
    {
        "text": " terminado igualidad y ya se lo mostré varias veces al cliente porque interés dentro de estas etapas",
        "start": 2755.68,
        "end": 2762.7999999999997
    },
    {
        "text": " y cada vez que intero agarran nuevos conjuntos funcionalidades y las analizo, las diseños, las",
        "start": 2762.7999999999997,
        "end": 2769.12
    },
    {
        "text": " herramientas y las testeos y cuando se lo muestro cada versión de sistema es cada vez más grande,",
        "start": 2769.12,
        "end": 2775.2
    },
    {
        "text": " entonces cada vuelta que voy iterando por esas pequeñas cascadas, lo que acá dentro sí es una",
        "start": 2775.68,
        "end": 2782.72
    },
    {
        "text": " minica cascada de análisis diseño, implementación y testeo y son minicas cascadas ya programadas,",
        "start": 2782.72,
        "end": 2789.68
    },
    {
        "text": " después de eso típicamente liberación y mantenimiento no van a estar volviendo para atrás,",
        "start": 2790.8799999999997,
        "end": 2795.3599999999997
    },
    {
        "text": " entonces esto es el modelo que vamos a estar siguiendo en el curso, acá tienen otra forma de",
        "start": 2796.3599999999997,
        "end": 2803.12
    },
    {
        "text": " darlo más ingenieril o más geek si quieren, es como decir para cada su problema,",
        "start": 2803.12,
        "end": 2812.72
    },
    {
        "text": " si no entienden esto, a mí me cuesta cada vez el tema de entenderlo, cada vez me es un",
        "start": 2813.7599999999998,
        "end": 2820.24
    },
    {
        "text": " también intuitivo, para cada su problema, o sea para cada funcionalidad imagínense o para cada",
        "start": 2820.24,
        "end": 2824.88
    },
    {
        "text": " conjunto de funcionalidades, o sea, todas las funcionalidades de sistema, todo el regimiento de",
        "start": 2824.88,
        "end": 2830.56
    },
    {
        "text": " todo esto, entonces agarrro y digo el primer ciclo de desarrollo es la iteración 1 y va a incluir",
        "start": 2830.56,
        "end": 2836.7999999999997
    },
    {
        "text": " alta empleado, alta de factura y alta de producto, nada más, todo el resto irá en la",
        "start": 2836.7999999999997,
        "end": 2842.96
    },
    {
        "text": " iteración 2 y después en la 3, entonces cada vez que agarrro ese su problema, lo analizo,",
        "start": 2842.96,
        "end": 2850.72
    },
    {
        "text": " lo diseño, el implemento, lo prevo, enseguida, se lo muestro al cliente, ahora como está, entonces",
        "start": 2850.72,
        "end": 2857.2
    },
    {
        "text": " cada vez le voy mostrando cosas, cada vez más acabadas, más completas, más grande, por eso",
        "start": 2857.2,
        "end": 2862.52
    },
    {
        "text": " lo iterativo, porque es una iteración literalmente, e incrementar porque cada vez en cada",
        "start": 2862.52,
        "end": 2867.72
    },
    {
        "text": " hito que le muestro algo, le vemos andando a con cada vez más grande, se entiende esto?",
        "start": 2867.72,
        "end": 2872.0
    },
    {
        "text": " preguntas",
        "start": 2873.68,
        "end": 2874.4399999999996
    },
    {
        "text": " un comentario de alguna pregunta que hemos hecho en parcial o examen, así captó su atención,",
        "start": 2874.44,
        "end": 2894.12
    },
    {
        "text": " en este enfoque y te ativa un cremental, el criterio de partición del problema son las",
        "start": 2894.12,
        "end": 2906.4
    },
    {
        "text": " funcionalidades, los su problemas, o sea agarrro todo lo que hay que hacer y agarrro este",
        "start": 2906.4,
        "end": 2913.44
    },
    {
        "text": " cacho de funcionalidades y doy una iteración, pues agarrro otro cacho y doy una iteración y así",
        "start": 2913.44,
        "end": 2918.7999999999997
    },
    {
        "text": " para cada uno, el criterio de partición del problema son las funcionalidades o los su problemas,",
        "start": 2918.8,
        "end": 2925.36
    },
    {
        "text": " el modelo encascada, el criterio de partición del problema, o sea que eso de última es sigue",
        "start": 2925.36,
        "end": 2934.6000000000004
    },
    {
        "text": " siendo un por suerte, un acción más inamovible, o sea agarrro algo y luego hay una forma partiendo y",
        "start": 2934.6000000000004,
        "end": 2941.0
    },
    {
        "text": " después reconstruciendo y ahí está la solución, el criterio de partición del problema en el modelo",
        "start": 2941.0,
        "end": 2948.44
    },
    {
        "text": " de cascada es la etapa, hago todo una etapa y después pasa la otra, hago todo esa etapa y después",
        "start": 2948.44,
        "end": 2956.24
    },
    {
        "text": " pasa la otra, se entiende eso? una pregunta si les aparece ya respondida, bueno nuestro proceso que",
        "start": 2956.24,
        "end": 2968.04
    },
    {
        "text": " no pretende ser un alago alego ni mucho menos, nosotros nos pretendemos que darnos con una",
        "start": 2968.04,
        "end": 2979.56
    },
    {
        "text": " versión sencilla, una primera versión manejable de ese proceso iterativo incremental y en particular",
        "start": 2979.56,
        "end": 2987.48
    },
    {
        "text": " como dije no vamos a centrar en análisis, diseño y implementación, ¿ok?",
        "start": 2987.48,
        "end": 2993.12
    },
    {
        "text": " en esencia estas tres etapas y en este orden, como haciendo como minigas cada, ejecutando,",
        "start": 2998.76,
        "end": 3007.52
    },
    {
        "text": " minigas cada varias veces, en esencia eso es lo que malo bien todas las metodologías de desarrollo",
        "start": 3007.52,
        "end": 3015.48
    },
    {
        "text": " de software modernas están sugiriendo, puede ser extreme programming, puede ser rupe que es mucho más",
        "start": 3015.48,
        "end": 3024.96
    },
    {
        "text": " pesado o UP, regional y unifa de proces o unifa de proces, puede ser más gobernado por Scram, o sea",
        "start": 3024.96,
        "end": 3034.12
    },
    {
        "text": " más ágil o más pesado, pero en general hoy en día se tiende a alejarse de la cascada y",
        "start": 3034.12,
        "end": 3042.2
    },
    {
        "text": " acercarse a algo iterativo y que vaya aumentando y que tenga feedback hacia el cliente, sabiendo que eso",
        "start": 3042.2,
        "end": 3051.52
    },
    {
        "text": " puede llevar re trabajos, pero es natural como dije hoy y seguramente es desciable, tenia otra",
        "start": 3051.52,
        "end": 3063.52
    },
    {
        "text": " palabra que se me fue, o sea es natural que esos modificaciones que piden que viento ocurran,",
        "start": 3063.52,
        "end": 3068.3199999999997
    },
    {
        "text": " bueno eso, preguntas, bueno y predice que una podría analizar pensando en el",
        "start": 3073.2,
        "end": 3088.04
    },
    {
        "text": " estructurado y empezar así, bueno a ver yo me imagino toda esta funcionalidad de todas estas",
        "start": 3088.04,
        "end": 3092.96
    },
    {
        "text": " estructuras de datos, me huela elamente pero podría hacerse y lo mismo diseñar después",
        "start": 3092.96,
        "end": 3100.4399999999996
    },
    {
        "text": " picar todo ese código en Pascal o uno directamente podría analizar el problema en también",
        "start": 3100.44,
        "end": 3104.76
    },
    {
        "text": " un objeto diseñar el objeto y implementar el objeto que eso obviamente lo vamos a nosotros.",
        "start": 3104.76,
        "end": 3107.8
    },
    {
        "text": " Bueno como he sea hoy los requerimientos, nosotros en el curso lo dejamos un poquito de lado pero lo",
        "start": 3109.8,
        "end": 3114.52
    },
    {
        "text": " tocamos un poco y nosotros los requerimientos, los, sobre todo de los argumentos funcionales,",
        "start": 3114.52,
        "end": 3121.44
    },
    {
        "text": " los capturamos en la forma de casos de uso, un caso de uso es como dice el término y en inglés",
        "start": 3121.44,
        "end": 3131.08
    },
    {
        "text": " también use case es una forma posible de usar el sistema, capaz que si cuando usaban,",
        "start": 3131.08,
        "end": 3140.28
    },
    {
        "text": " oi me la agarré con Pascal, cuando usaban Pascal la forma de listar los requerimientos capaz",
        "start": 3140.28,
        "end": 3146.64
    },
    {
        "text": " que era tipo procedimiento que hagan, no sé qué funcionalidad, que hagan, no sé qué y eso",
        "start": 3146.64,
        "end": 3151.56
    },
    {
        "text": " es natural porque el paradigma de Pascal está orientado a eso, obviamente cuando pasamos",
        "start": 3151.56,
        "end": 3156.7999999999997
    },
    {
        "text": " un proyecto de seis meses, cinco personas empezar a listar funcionalidad es literalmente imposible,",
        "start": 3156.7999999999997,
        "end": 3164.16
    },
    {
        "text": " ahí ya me animaría decir que no es posible directamente hacerlo, entonces hay que buscar otra forma",
        "start": 3164.16,
        "end": 3168.96
    },
    {
        "text": " y como buscamos otra forma que sea un poco más atlata pero a que subesas ser que al problema,",
        "start": 3168.96,
        "end": 3174.8399999999997
    },
    {
        "text": " porque el que me va a dar el input fundamental para los requerimientos es informático,",
        "start": 3175.4,
        "end": 3181.6000000000004
    },
    {
        "text": " el que me da el input de los requerimientos es mi cliente o mi usuario y no es informático",
        "start": 3184.6000000000004,
        "end": 3189.7200000000003
    },
    {
        "text": " en la mayoría de los casos, entonces empecemos desde el principio de este proceso de",
        "start": 3189.7200000000003,
        "end": 3196.08
    },
    {
        "text": " la resofor de esta receta, empecemos desde el principio ayudándolo a esa persona a que escribamos",
        "start": 3196.08,
        "end": 3203.32
    },
    {
        "text": " la forma de usar el sistema, los requerimientos que los escribamos de una forma que para él le",
        "start": 3203.8,
        "end": 3208.36
    },
    {
        "text": " parezcan intuitivo para su negocio y que para mí a partir de ahí empieza a hacer un input que yo",
        "start": 3208.36,
        "end": 3214.8
    },
    {
        "text": " lo chalo vaya transformando hasta picar código que es lo que de verdad quiero hacer,",
        "start": 3214.8,
        "end": 3218.92
    },
    {
        "text": " bueno quiero un necesito en el momento en algún punto hacerlo, entonces imagínense a un",
        "start": 3220.44,
        "end": 3226.7200000000003
    },
    {
        "text": " cliente, a un usuario final, qué será más intuitivo decir bueno los requerimientos de mi",
        "start": 3226.7200000000003,
        "end": 3231.6800000000003
    },
    {
        "text": " sistema son tres procedimientos que tratará cuatro funciones que una estructura de datos que",
        "start": 3231.68,
        "end": 3237.9199999999996
    },
    {
        "text": " tenga no es más ojalá que el cliente no ha hablen esos términos, el cliente o el usuario",
        "start": 3237.9199999999996,
        "end": 3245.2
    },
    {
        "text": " habla de términos de mirada, yo preciso facturar, liquidar los impuestos, agregar clientes nuevos,",
        "start": 3245.2,
        "end": 3251.16
    },
    {
        "text": " agregar una factura, un remito, una entrega, una devolución, una queja, el cliente va a hablar",
        "start": 3251.16,
        "end": 3260.2
    },
    {
        "text": " en términos de su negocio o dominio o problema o lo que fuese y nosotros usando la técnica de casos",
        "start": 3260.2,
        "end": 3267.2799999999997
    },
    {
        "text": " de uso que es una técnica para capturar requerimientos funcionales, lo que hacemos es escribir en un",
        "start": 3267.2799999999997,
        "end": 3272.68
    },
    {
        "text": " versito, los requerimientos pero ya le damos un enfoque al problema de mi cliente, entiende?",
        "start": 3272.68,
        "end": 3279.3199999999997
    },
    {
        "text": " o sea no lo obligamos a repasar una lista de funcionalidades porque Pascal piensa en funcionalidades",
        "start": 3279.3199999999997,
        "end": 3284.72
    },
    {
        "text": " de estructuras, empezamos escribiendo el requerimiento como formas como historias, como historietas",
        "start": 3284.72,
        "end": 3291.72
    },
    {
        "text": " y quieren de cómo el futuro usuario va a querer usar ese sistema, entonces los casos de uso",
        "start": 3291.72,
        "end": 3299.2
    },
    {
        "text": " debieran ser herramientas que podemos discutir entre el equipo de desarrollo y el cliente o por",
        "start": 3299.2,
        "end": 3305.8799999999997
    },
    {
        "text": " lo menos para no ser tan ambicioso entre la lista funcional y el cliente y pues en la lista",
        "start": 3305.8799999999997,
        "end": 3311.52
    },
    {
        "text": " que es la interfaz va y pasa esos casos de uso al equipo de desarrollo, pero los casos de uso",
        "start": 3311.52,
        "end": 3319.68
    },
    {
        "text": " los tienen que poder ser leídos por los clientes o por los usuarios y tienen que entenderlos y",
        "start": 3319.68,
        "end": 3324.48
    },
    {
        "text": " tienen que poder validarlos, tienen que poder corregirlo y decir no, esto está mal, cosa que si le",
        "start": 3324.48,
        "end": 3329.12
    },
    {
        "text": " pidemos de una lista de funcionalidades, viene bajo nivel, un cliente no informático no sería",
        "start": 3329.12,
        "end": 3333.56
    },
    {
        "text": " capaz de ser eso, se entiende eso? preguntas?",
        "start": 3333.56,
        "end": 3340.56
    },
    {
        "text": " Sí, buena pregunta y a más no lo dije, un actor es por lo general cualquier cosa que",
        "start": 3340.56,
        "end": 3350.08
    },
    {
        "text": " este fue la del sistema, el sistema que voy a construir, típicamente los usuarios son los grandes",
        "start": 3350.08,
        "end": 3356.52
    },
    {
        "text": " actores, porque el usuario no es parte del cacho de software que voy a construir, sin embargo",
        "start": 3356.52,
        "end": 3365.24
    },
    {
        "text": " es un input, yo diría bastante fundamental del software que voy a construir, y en otro",
        "start": 3365.24,
        "end": 3370.7599999999998
    },
    {
        "text": " caso podría ser otro software externo que va a usar el mío, por ejemplo, los sistema de",
        "start": 3370.7599999999998,
        "end": 3376.88
    },
    {
        "text": " facturación por los general son disparados por sistemas de control de esto, o sistemas de",
        "start": 3376.88,
        "end": 3381.58
    },
    {
        "text": " venta, sistemas de gestión, y en ese caso si yo estoy parado en el sistema de facturación,",
        "start": 3381.58,
        "end": 3387.18
    },
    {
        "text": " mi actor puede ser el usuario que carga el stock de algo, o mi actor puede ser a través",
        "start": 3387.18,
        "end": 3395.02
    },
    {
        "text": " de un web service, otro sistema que me avisa que se vendió a una unidad de un producto,",
        "start": 3395.02,
        "end": 3400.14
    },
    {
        "text": " entonces para este sistema de facturación aquí el otro sistema de gestión de venta es un actor,",
        "start": 3400.14,
        "end": 3406.34
    },
    {
        "text": " los actores son lo que están afuera del sistema y que interactúan con el sistema que voy a",
        "start": 3407.34,
        "end": 3413.1800000000003
    },
    {
        "text": " construir, sí, ojo que a veces no alteran el estado del sistema, porque por ejemplo un listado",
        "start": 3413.1800000000003,
        "end": 3424.38
    },
    {
        "text": " no altera el estado del sistema, yo al sistema lo dejo tal cual el sitio, pero me devolvió todo",
        "start": 3424.38,
        "end": 3431.3
    },
    {
        "text": " un PDF con las cuentas a cobrar, pero sí estás muy bien demasiado, bien rumbiado,",
        "start": 3431.3,
        "end": 3436.78
    },
    {
        "text": " de hecho vamos a hablar después de cómo es que una funcionalidad cambia el estado de un sistema,",
        "start": 3436.78,
        "end": 3443.6200000000003
    },
    {
        "text": " alguna pregunta más, bueno acá hay un ejemplito que después lo van a leer y le muestra esto simplemente",
        "start": 3443.6200000000003,
        "end": 3455.5
    },
    {
        "text": " para que vean como luz en el caso de uso, o sea hoy estamos viendo de vuelta, estamos viendo cosas que",
        "start": 3455.5,
        "end": 3460.1800000000003
    },
    {
        "text": " después nos va a llevar todo el curso, desarrollar en profundidad, o sea que hoy es un pinceléo,",
        "start": 3460.18,
        "end": 3466.2999999999997
    },
    {
        "text": " entonces el caso de uso se llama agregar canción, porque el sistema que ha que hacer es un tipo",
        "start": 3467.8999999999996,
        "end": 3474.3399999999997
    },
    {
        "text": " si serán mi japetés que dice tipo Winam, creo que ahora podría Spotify o es un poquito más",
        "start": 3474.3399999999997,
        "end": 3481.3799999999997
    },
    {
        "text": " actualizado, el actor es el usuario que va a ser uso de ese sistema y esto es una sin óptih breve,",
        "start": 3481.38,
        "end": 3490.38
    },
    {
        "text": " una breve narrativa que muestra el objetivo principal de ese caso de uso, o sea recuerda en el caso de uso",
        "start": 3490.38,
        "end": 3495.9
    },
    {
        "text": " es una forma de usar el sistema, van a ver muchas formas de usar el sistema, esta es una, o sea agregar",
        "start": 3495.9,
        "end": 3502.38
    },
    {
        "text": " canción que significa, cuando el usuario me dice, yo quiero poder agregar canciones en este",
        "start": 3502.38,
        "end": 3508.5
    },
    {
        "text": " fingspotifile, entonces bueno pero para mí quiere decir que esto comienza cuando el usuario necesita",
        "start": 3509.5,
        "end": 3517.7
    },
    {
        "text": " agregar una canción nueva sistema, entonces le dice el título el año que se compuso, después el",
        "start": 3517.7,
        "end": 3524.18
    },
    {
        "text": " sistema te devuelve una lista de los géneros y de los artistas el usuario se lesiona de qué género,",
        "start": 3524.18,
        "end": 3529.74
    },
    {
        "text": " a qué género pertenece, los artistas y si está todo bien, da de alta la canción del sistema y punto.",
        "start": 3529.74,
        "end": 3534.9
    },
    {
        "text": " ¿Es que no tiene un mapeo? El compañero pregunta así caso de uso, pasado a Pascal sería un",
        "start": 3538.5,
        "end": 3546.98
    },
    {
        "text": " procedimiento, en realidad esto, o sea no tiene un mapeo, esto tiene que verlo como algo mucho más",
        "start": 3546.98,
        "end": 3551.7
    },
    {
        "text": " abstracto que una simple funcionalidad, esto va a dar lugar capaz que a decenas de procedimientos y",
        "start": 3551.7,
        "end": 3556.38
    },
    {
        "text": " funciones y estructuras datos, y como es mucho más abstracto es algo que el cliente va a tender a",
        "start": 3556.38,
        "end": 3563.14
    },
    {
        "text": " entender mucho mejor, nosotros no, entonces acá no estamos cercando al cliente pero van a",
        "start": 3563.14,
        "end": 3569.2999999999997
    },
    {
        "text": " ver que la metodología si Dios ya la quieren, la metodología a partir de este tipo de input",
        "start": 3569.2999999999997,
        "end": 3575.9
    },
    {
        "text": " smoothly nos va a ir diciendo bueno agarré esto, fijate esto y así esto y papá, codifica esto,",
        "start": 3575.9,
        "end": 3584.54
    },
    {
        "text": " o sea te va a llevar de la mano del problema a la solución, más preguntas",
        "start": 3584.54,
        "end": 3590.2999999999997
    },
    {
        "text": " bueno entonces siendo un poquito a qué es la orientación a objetos, obviamente es un enfoque",
        "start": 3593.14,
        "end": 3602.46
    },
    {
        "text": " es un enfoque diferente al tradicional, tradicional entendido acá como promesión estructurada,",
        "start": 3602.46,
        "end": 3607.7
    },
    {
        "text": " o que no es el único paradigma, no hay paradigmas lógicos, paradigmas funcionales que se están",
        "start": 3608.98,
        "end": 3614.62
    },
    {
        "text": " usando en algunos otros lenguajes de plataformas de promasión, pero este sin duda y de hace un buen tiempo",
        "start": 3614.62,
        "end": 3620.62
    },
    {
        "text": " es el que más se usa y es el que tienen que saber si o si y saberlo muy bien, capaz que",
        "start": 3620.62,
        "end": 3627.46
    },
    {
        "text": " después terminas programando todo, o sea todo del lado de cliente o todo scripting sin usar",
        "start": 3627.46,
        "end": 3633.94
    },
    {
        "text": " ningún objeto ni nada, perfecto, se puede ser tu destino por un tiempo como programador,",
        "start": 3633.94,
        "end": 3637.62
    },
    {
        "text": " lo que es frontend, pero esto hay que saberlo porque realmente es fundamento y bueno y si no me",
        "start": 3637.62,
        "end": 3645.18
    },
    {
        "text": " creen a mí que sería bueno que no me crean, pregunten en los compañeros que tengan trabajando,",
        "start": 3645.18,
        "end": 3650.98
    },
    {
        "text": " o algo en ustedes, a ver si OP sirve para algo, no, caramba, como si me hubieran pinchado",
        "start": 3650.98,
        "end": 3659.02
    },
    {
        "text": " para qué sirve esto, bueno entonces ¿qué es la orientación a objetos? pues en la andida como una",
        "start": 3659.02,
        "end": 3665.06
    },
    {
        "text": " forma de pensar basaba en las tracciones de conceptos que existen en el mundo real, vamos a",
        "start": 3665.06,
        "end": 3670.94
    },
    {
        "text": " ver que canción, canción es algo que existe en el mundo real, género, artista, banda,",
        "start": 3670.94,
        "end": 3679.3
    },
    {
        "text": " cliente, factura, remito, recibo, son cosas que existen en el mundo real, entonces todos esos",
        "start": 3681.02,
        "end": 3688.66
    },
    {
        "text": " son candidatos a ser objetos de software en mi futuro sistema y a final nos va a quedar que el",
        "start": 3688.66,
        "end": 3695.1
    },
    {
        "text": " software van a hacer un montón de objetos colaborando entre sí, o sea hablando entre sí,",
        "start": 3695.1,
        "end": 3700.3399999999997
    },
    {
        "text": " cómo se habla entre sí a través de mensajes, esos mensajes no son más invocaciones, operaciones,",
        "start": 3700.3399999999997,
        "end": 3707.1
    },
    {
        "text": " pero chavra tiempo para bajar esto más a tierra lo más difícil de la intención de objetos es",
        "start": 3707.1,
        "end": 3713.58
    },
    {
        "text": " entender la teoría, cosas que después lo puedo usar para programar, pero también para diseñar y",
        "start": 3713.58,
        "end": 3718.54
    },
    {
        "text": " también para entender el problema, bueno como dijo el época tradicional es los tipos por un lado",
        "start": 3718.54,
        "end": 3726.66
    },
    {
        "text": " y las funcionalidades por otro y el enfocretado objetos es un conjunto de objetos o uno,",
        "start": 3729.2599999999998,
        "end": 3736.94
    },
    {
        "text": " dos o tres o cuatro o cinco que se habla entre sí a través de mensajes y acá dentro, acá dentro",
        "start": 3736.94,
        "end": 3743.38
    },
    {
        "text": " van a ver tres cosas, pero ahora les voy a hablar de dos, van a ver estructuras, o sea van a",
        "start": 3743.9,
        "end": 3753.7400000000002
    },
    {
        "text": " ver variables y estructuras de datos acá dentro y siempre bajaba el otro dedo pero vamos,",
        "start": 3753.7400000000002,
        "end": 3758.94
    },
    {
        "text": " están filmando y también van a ver funcionalidades, van a ver procedimientos y funciones ahí adentro",
        "start": 3758.94,
        "end": 3766.3
    },
    {
        "text": " y queda una cosa que es la identidad de cada objeto que lo hace distinto al otro anco,",
        "start": 3766.3,
        "end": 3772.86
    },
    {
        "text": " el hukane igual que ya lo vamos a ver, entonces este objeto sabe cosas, conoce a otros,",
        "start": 3772.86,
        "end": 3779.46
    },
    {
        "text": " este por ejemplo, sabe cosas, tiene datos adentro, conoce a otros, conoce a otros, conoce a",
        "start": 3779.46,
        "end": 3784.6800000000003
    },
    {
        "text": " tres, conoce a o cinco y les pide cosas y esto se traduce como despachar un método asociado a",
        "start": 3784.6800000000003,
        "end": 3792.84
    },
    {
        "text": " una operación, entonces tipo de cosas de vuelta lo vamos a ir viendo, no pretendo que le",
        "start": 3792.84,
        "end": 3799.06
    },
    {
        "text": " saca sentido esto que es casi un mapa mental de lo que es que ha tenido objetos, bueno y acá",
        "start": 3799.06,
        "end": 3805.2799999999997
    },
    {
        "text": " como dijimos que queremos que el análisis se ha orientado objetos, que el diseño se ha",
        "start": 3805.2799999999997,
        "end": 3808.24
    },
    {
        "text": " orientado objetos, que el aprementación se ha orientado objetos, ya lo dije, entonces esto va",
        "start": 3808.24,
        "end": 3817.54
    },
    {
        "text": " cambiando de tema y por suerte tiene alguien que le ponga audio, en la medida que abarcamos",
        "start": 3817.54,
        "end": 3826.7599999999998
    },
    {
        "text": " temas que abarcamos problemas, más grandes y más complejos, es inviable que uno le entra",
        "start": 3826.76,
        "end": 3834.0
    },
    {
        "text": " en la cabeza todo el problema junto de un saque o toda la solución junta de un saque con un",
        "start": 3834.0,
        "end": 3840.6400000000003
    },
    {
        "text": " nivel de detalle adecuado, que eso nos entre todo en una cabeza, no importa cuánt grande o compleja",
        "start": 3840.6400000000003,
        "end": 3847.5200000000004
    },
    {
        "text": " sea esa cabeza, o sea es inviable, cuando era la calculadora, el video club, capaz que vos",
        "start": 3847.5200000000004,
        "end": 3854.48
    },
    {
        "text": " saca, acá está todo, bueno cuando es el sistema, 6 meses, 5 personas es imposible, o sea tener",
        "start": 3854.48,
        "end": 3864.72
    },
    {
        "text": " todo el detalle es imposible, sin embargo a cierto nivel cada uno de nosotros precise tener",
        "start": 3864.72,
        "end": 3871.32
    },
    {
        "text": " algún tipo de vision o enfoque, aunque sea para sea el pretener, hay comienamente completo,",
        "start": 3871.32,
        "end": 3878.32
    },
    {
        "text": " aunque sea para después hacerle doble clic y meternos en otro su parte y viendo la complejidad",
        "start": 3878.32,
        "end": 3885.6400000000003
    },
    {
        "text": " de esa su parte, entonces a partir de esos dos premisas, o sea que no puedo tener un sistema",
        "start": 3885.6400000000003,
        "end": 3892.6400000000003
    },
    {
        "text": " complejo todo entero en la cabeza ni el problema ni la solución ni nada, pero sin embargo",
        "start": 3892.6400000000003,
        "end": 3897.56
    },
    {
        "text": " difícilmente uno puede trabajar cuando le digan bueno mira, te hegas de todo esto pero ahora",
        "start": 3897.56,
        "end": 3903.84
    },
    {
        "text": " digo sobre esto, si no no, pero decirme por lo menos como se llama y más o menos que hace el",
        "start": 3903.84,
        "end": 3907.44
    },
    {
        "text": " risto, en que yo después agarre, me senten esto le hago doble clic y me fijo ver qué hace, o sea",
        "start": 3907.44,
        "end": 3913.52
    },
    {
        "text": " tenemos que tener un panorama mental de por lo menos del cacho de algo que nos toca hacer,",
        "start": 3913.52,
        "end": 3918.56
    },
    {
        "text": " entonces precisamos, algún tipo de herramienta, y cuando decimos herramienta no tiene porque ser un",
        "start": 3920.2400000000002,
        "end": 3926.32
    },
    {
        "text": " hide, un adon, un plaguin, puede ser como lo va a hacer en este caso con una herramienta conceptual,",
        "start": 3926.32,
        "end": 3932.0
    },
    {
        "text": " dibujitos, pensamos en una herramienta que me permita ayudarme a desarrollar, o sea que me ayuda",
        "start": 3932.0,
        "end": 3939.88
    },
    {
        "text": " a desarrollar software, que me deje ir viendo lo que voy haciendo o lo que vamos discutiendo o lo que",
        "start": 3939.88,
        "end": 3946.04
    },
    {
        "text": " se viene haciendo, que eso a su vez sirva para documentar y que me permita comunicar sobre",
        "start": 3946.04,
        "end": 3953.28
    },
    {
        "text": " toda mis colegas, al usuario algún tipo de diarama así, otro tipo de diarama son más técnicos,",
        "start": 3953.28,
        "end": 3960.6000000000004
    },
    {
        "text": " informáticos para los desarrolladores, pero que me deje comunicar y discutir en un pizarrón",
        "start": 3960.6000000000004,
        "end": 3965.96
    },
    {
        "text": " y de forma gráfica, porque obviamente y no soy quien para justificar eso, pero creo que es",
        "start": 3965.96,
        "end": 3972.2200000000003
    },
    {
        "text": " intuitivo, obviamente lo que vemos lo entendemos y lo analizamos mucho mejor que lo que vemos escrito,",
        "start": 3972.2200000000003,
        "end": 3979.76
    },
    {
        "text": " lo visual nos juega un rol mucho más importante para entender y para conceptualizar algo, entonces",
        "start": 3980.32,
        "end": 3989.0800000000004
    },
    {
        "text": " tenemos un problema súper grande y complejo, no nos haga la cabeza para literalmente para",
        "start": 3992.0800000000004,
        "end": 3996.8
    },
    {
        "text": " entenderlo, para modelarlo en su totalidad, sin embargo tenemos que modelar, ir modelando",
        "start": 3996.8,
        "end": 4002.2000000000003
    },
    {
        "text": " diferentes aspectos de eso y en lo posible que sea algo que yo hago un modelo, hago un dibujito y que",
        "start": 4002.3199999999997,
        "end": 4011.2
    },
    {
        "text": " después no lo tira, ¿no? ¿qué ese dibujito ya me ayuda después a programar y qué ese dibujito lo",
        "start": 4011.2,
        "end": 4016.08
    },
    {
        "text": " adjunto al código y ya me lo documenta al código, ¿a quién le gusta documentar?",
        "start": 4016.08,
        "end": 4021.4399999999996
    },
    {
        "text": " Imaginaba, muy pocos, a muy poca gente le gusta documentar, entonces, cuando tengamos una herramienta",
        "start": 4023.04,
        "end": 4030.3999999999996
    },
    {
        "text": " gráfica que nos deje discutir, colaborar, pensar, avanzar en el desarrollo y además ayuda",
        "start": 4030.4,
        "end": 4037.2000000000003
    },
    {
        "text": " a documentar compro, UML, odio estar teniendo que venir a la computadora, entonces UML es un",
        "start": 4037.2000000000003,
        "end": 4050.2000000000003
    },
    {
        "text": " estándar para modelar software, UML no están programando, UML no es programación, UML no es una",
        "start": 4050.2,
        "end": 4061.3599999999997
    },
    {
        "text": " metodología tampoco, eso lo he visto por ahí y es incorrecto, la metodología de desarrollo software es",
        "start": 4061.3599999999997,
        "end": 4066.56
    },
    {
        "text": " cacada y te ative incremental, extreme programming, Scram, RUP, lo que ustedes quieran, que le dice",
        "start": 4066.56,
        "end": 4074.12
    },
    {
        "text": " todos los pasos que tienen que hacer, UML no les va a decir los pasos que tienen que hacer, UML son",
        "start": 4074.12,
        "end": 4079.2799999999997
    },
    {
        "text": " diagramas que les permiten en diferentes pasos de una metodología que ustedes ya adoptaron, en nuestro",
        "start": 4079.2799999999997,
        "end": 4084.48
    },
    {
        "text": " caso adoptamos la metodología de la tira, tiene que aumentar, entonces UML dice bueno, para esta",
        "start": 4084.48,
        "end": 4088.68
    },
    {
        "text": " parte puedes usar un diarama de clases, para esta otra un diarama de secuencia, para esta otra un",
        "start": 4088.68,
        "end": 4093.8399999999997
    },
    {
        "text": " diarama de comunicación, etcétera, es una notación gráfica, pero ojo que es un lenguaje,",
        "start": 4093.8399999999997,
        "end": 4100.599999999999
    },
    {
        "text": " cuando uno ve un plano de arquitecto, uno puede decir, pero para esta línea está muy finita,",
        "start": 4101.160000000001,
        "end": 4108.280000000001
    },
    {
        "text": " vamos a repasarlo un poco más, o vamos a poner una línea doble, creo que no, es que os pague sí,",
        "start": 4108.280000000001,
        "end": 4115.56
    },
    {
        "text": " por el bien del ejemplo seguramente el tipo de ganó para, esto es una línea fina porque es",
        "start": 4115.56,
        "end": 4120.8
    },
    {
        "text": " yo que es una estructura interior de Libiana, de lleso, hasta parece que sea algo esto,",
        "start": 4120.8,
        "end": 4127.96
    },
    {
        "text": " pero si le encajas un marcador arriba, así es no, pero así es grueso, es porque está vique,",
        "start": 4128.44,
        "end": 4134.36
    },
    {
        "text": " es de blablablablablabla, bueno esto es lo mismo, entonces cuando ustedes están viendo un dibujo,",
        "start": 4134.36,
        "end": 4140.96
    },
    {
        "text": " un diarama UML y cuando subrallen algo, no están diciendo pago esto es importante,",
        "start": 4140.96,
        "end": 4147.16
    },
    {
        "text": " le están cambiando la semántica, o sea está cambiando significado de lo que quiere decir eso que",
        "start": 4147.16,
        "end": 4152.32
    },
    {
        "text": " cuando lo ponen en cursiva, le están cambiando significado también, no están diciendo esto es una",
        "start": 4153.04,
        "end": 4158.96
    },
    {
        "text": " cita de alguien, o esto es importante, no, están cambiando significado, entonces es un lenguaje",
        "start": 4158.96,
        "end": 4165.12
    },
    {
        "text": " gráfico, o sea que tiene su propia sintaxis gráfica y su propia semántica gráfica, o sea que",
        "start": 4165.12,
        "end": 4171.88
    },
    {
        "text": " los rectángulitos quieren decir, no sé qué, no sé qué, no sé cuánto, si lo su rayo quiere decir",
        "start": 4171.88,
        "end": 4176.96
    },
    {
        "text": " otra cosa, ahora los cuadraditos no se pueden usar junto con los redondeles, porque porque el",
        "start": 4176.96,
        "end": 4183.2
    },
    {
        "text": " cuadrado se usan para modelar, no sé qué aspecto del problema y los redondeles se usan para modelar",
        "start": 4183.2,
        "end": 4188.0
    },
    {
        "text": " otra cosa de la solución, por ejemplo, entonces hay no solamente reglas sintácticas que les",
        "start": 4188.0,
        "end": 4193.04
    },
    {
        "text": " dejan escribir dibujarlos de aramas, sino también reglas semánticas que de dicen cómo se combinan",
        "start": 4193.04,
        "end": 4199.8
    },
    {
        "text": " unos con otros, lo mismo con el lenguaje, un lenguaje tiene reglas sintácticas y reglas semánticas",
        "start": 4199.8,
        "end": 4204.88
    },
    {
        "text": " y reglas semánticas, bueno acá yo creí que venía UML, así que pintó saltar un par de slides de",
        "start": 4206.96,
        "end": 4221.68
    },
    {
        "text": " polo partas, acá tenemos por ejemplo un modelo dominio dibujado en UML, esto que está acá,",
        "start": 4221.68,
        "end": 4230.84
    },
    {
        "text": " esto que está acá es un modelo del problema, el modelo dominio es un artefacto que se usa en la",
        "start": 4231.400000000001,
        "end": 4240.88
    },
    {
        "text": " etapa de análisis, no? Recrimiento a análisis y dicen en protección y testigo, esto se usa en",
        "start": 4240.88,
        "end": 4246.360000000001
    },
    {
        "text": " análisis y es para entender el problema, entonces ¿qué es esto? Yo lo miro y digo bueno mi realidad",
        "start": 4246.360000000001,
        "end": 4254.6
    },
    {
        "text": " es que acá gente mi realidad tiene artistas que pueden ser solistas o banda, la banda está",
        "start": 4255.320000000001,
        "end": 4267.4800000000005
    },
    {
        "text": " compuesta de dos o más solistas, todos artistas tienen nombre pero solo las bandas tienen fecha de",
        "start": 4267.4800000000005,
        "end": 4275.360000000001
    },
    {
        "text": " fundación y solo los solistas tienen fecha nacimiento, el artista puede tocar varios géneros pero por",
        "start": 4275.360000000001,
        "end": 4282.08
    },
    {
        "text": " lo menos uno, el género puede tener de cero artistas asociados porque puede dar un género",
        "start": 4282.08,
        "end": 4290.16
    },
    {
        "text": " creciendo a Greguey, todavía no le pusieron un artista, una canción que tiene un título ináneo es",
        "start": 4290.16,
        "end": 4294.76
    },
    {
        "text": " interpretada por uno varios artistas y así socialmente, entonces esto es como si fuera un modelo de una",
        "start": 4294.76,
        "end": 4304.2
    },
    {
        "text": " foto con mucha imaginación perversa, imaginación en todos objetos, cuando uno ve el problema, cuando uno",
        "start": 4304.2,
        "end": 4314.599999999999
    },
    {
        "text": " habla con los clientes, cuando uno discute, cuando uno la por teléfono intercambia emails, hace",
        "start": 4314.599999999999,
        "end": 4319.48
    },
    {
        "text": " talleres para entender requerimiento, para que hay requerimiento, uno ya se va imaginando esta foto",
        "start": 4319.48,
        "end": 4325.16
    },
    {
        "text": " y acá ven que aparecen conceptos que pueden ser tangibles o no, género no es algo tangible,",
        "start": 4325.88,
        "end": 4338.48
    },
    {
        "text": " artista sí, o sea que los conceptos que después podrán ser objetos pero también lo vamos a pensar",
        "start": 4339.84,
        "end": 4347.88
    },
    {
        "text": " y vamos a darle frente al concepto y objeto, si quieren simplificar estos pueden ser objetos,",
        "start": 4347.88,
        "end": 4353.04
    },
    {
        "text": " o sea pueden tener objetos de un tipo que puedan ser materiales y otros imateriales, o sea eso",
        "start": 4353.04,
        "end": 4359.16
    },
    {
        "text": " no tiene nada de caber, pero lo que sí acá se muestra una estructura del problema, acá el tiempo",
        "start": 4359.16,
        "end": 4367.56
    },
    {
        "text": " no pasa, por eso también digo lo de foto, porque acá el tiempo no pasa, por eso es un modelo de",
        "start": 4367.56,
        "end": 4376.64
    },
    {
        "text": " la estructura del problema, después los casos de uso y otros tipos de iramas que veremos en",
        "start": 4376.64,
        "end": 4382.64
    },
    {
        "text": " análisis me ayudaran a ver qué se le va a pedir la sistema que haga, por ejemplo agregar artista,",
        "start": 4382.64,
        "end": 4388.280000000001
    },
    {
        "text": " eliminar género, recorrer canciones de tal estilo, o sea son funcionalidades que yo voy a combinar con",
        "start": 4388.280000000001,
        "end": 4396.360000000001
    },
    {
        "text": " esta visión estántica, las funcionalidades son por definición una visión dinámica de la realidad,",
        "start": 4396.360000000001,
        "end": 4401.04
    },
    {
        "text": " ahí sí pasa el tiempo y habrán otro conjunto de diaramas WML para eso, entonces esto es un ejemplo",
        "start": 4401.04,
        "end": 4409.76
    },
    {
        "text": " de un diarama WML en la etapa de análisis, y acá si yo por ejemplo, si yo subrayo nombre quiere",
        "start": 4409.76,
        "end": 4419.36
    },
    {
        "text": " decir que es otra cosa, después veremos que pero es surallado y si yo lo pongo en cursiva de la",
        "start": 4419.36,
        "end": 4424.5199999999995
    },
    {
        "text": " pala artista quiere decir otra cosa, poner o no un uno al principio quiere decir otra cosa,",
        "start": 4424.52,
        "end": 4431.76
    },
    {
        "text": " entonces cada elemento del dibujo este menos o más que podría por ahí quiere decir otra cosa,",
        "start": 4431.76,
        "end": 4438.400000000001
    },
    {
        "text": " entonces cada elemento tiene sus sintaxis y su semántica, entonces siguen siendo dibujitos que son",
        "start": 4438.400000000001,
        "end": 4445.4400000000005
    },
    {
        "text": " fáciles de transmitir, de garabatiar en un pizarrón, de discutir con otro colega, de discutir",
        "start": 4445.4400000000005,
        "end": 4450.280000000001
    },
    {
        "text": " uno mismo de usarlo en el proceso de razonamiento, de una solución o de entender un problema, o sea",
        "start": 4450.28,
        "end": 4455.5199999999995
    },
    {
        "text": " siguen siendo, siguen teniendo la ventaja de lografico, pero al tener cierta, no digo rígides, pero",
        "start": 4455.5199999999995,
        "end": 4463.0
    },
    {
        "text": " al tener cierta, a cumplir cierta reglas no va a permitir irlo de vuelta transformando y",
        "start": 4463.0,
        "end": 4468.32
    },
    {
        "text": " transformando, y transformando hasta que llegamos a implementar la clase artista con el atributo",
        "start": 4468.32,
        "end": 4475.4
    },
    {
        "text": " nombre de tipo string, no sé qué atributos más surjan después y las operaciones que acá no",
        "start": 4475.4,
        "end": 4480.679999999999
    },
    {
        "text": " están, las operaciones de agregar artista, eliminar artista, devolver el aspecte de nacimiento",
        "start": 4480.679999999999,
        "end": 4487.24
    },
    {
        "text": " de una artista, partir de su nombre y blah, blah, blah, blah, blah.",
        "start": 4487.24,
        "end": 4489.639999999999
    },
    {
        "text": " Bueno, ahora que vimos ese ejemplo, que era de análisis orientado objetos, usando",
        "start": 4489.64,
        "end": 4505.240000000001
    },
    {
        "text": " UML, en particular el modelo dominio usa diaramas de clases de UML, lo que viene recién es",
        "start": 4505.240000000001,
        "end": 4512.88
    },
    {
        "text": " un ejemplo un diama de clase de UML, el objetivo de la etapa de análisis orientado objetos",
        "start": 4512.88,
        "end": 4520.96
    },
    {
        "text": " es como dice acá, conciera el dominio de la aplicación y su solución en términos de conceptos",
        "start": 4520.96,
        "end": 4527.0
    },
    {
        "text": " y acá ojo porque la palabra solución no quiero que lo confundas, es más, si quieren borrarla",
        "start": 4527.0,
        "end": 4530.56
    },
    {
        "text": " borrenla y me van a ser feliz también, porque lo más importante es modelar el problema,",
        "start": 4530.56,
        "end": 4538.36
    },
    {
        "text": " que pasa que ese modelo de problema después van a ver que va a tener bastante similitud",
        "start": 4538.36,
        "end": 4544.0
    },
    {
        "text": " con una primera solución del problema, y ahí vamos a pasar de que las cajitas representan",
        "start": 4544.0,
        "end": 4549.32
    },
    {
        "text": " conceptos del problema, en el diseño pasamos a que esa cajita creen conceptos del problema,",
        "start": 4549.32,
        "end": 4554.639999999999
    },
    {
        "text": " ah, podrían ser clases de software dentro de un rato en cebamas más, entonces ahí voy",
        "start": 4554.639999999999,
        "end": 4560.339999999999
    },
    {
        "text": " haciendo, voy a chicando ese gap entre problema y solución, como sea lo más importante",
        "start": 4560.339999999999,
        "end": 4565.799999999999
    },
    {
        "text": " del análisis orientado objetos, por ejemplo de modelar ese modelo de dominio, es a extraer,",
        "start": 4565.8,
        "end": 4572.56
    },
    {
        "text": " seguramente en el ejemplo S de El Winamp o del Fing Spotify, había un montón de cosas",
        "start": 4572.56,
        "end": 4580.72
    },
    {
        "text": " que estaban en la vuelta que al diseñador de software, el promo de software no interesaban,",
        "start": 4580.72,
        "end": 4588.320000000001
    },
    {
        "text": " por ejemplo, y acá tenemos algún tipo, esto llama complicado y somorfismo y en forma",
        "start": 4588.32,
        "end": 4601.5199999999995
    },
    {
        "text": " sencilla atracción, realmente, tenemos una realidad, o sea yo voy a un cliente, lo visito",
        "start": 4601.5199999999995,
        "end": 4608.16
    },
    {
        "text": " y, bueno, hay un colega y eso está es lindo dibujito, pero es un caso concreto, ahora yo voy",
        "start": 4608.16,
        "end": 4618.32
    },
    {
        "text": " a hacer un sistema que no permita solamente modelar esta casa o guardar esa casa, va a permitir",
        "start": 4618.32,
        "end": 4625.88
    },
    {
        "text": " guardar muchas casas, todas con cierta estructura similar, entonces acá ya tengo un modelo",
        "start": 4625.88,
        "end": 4633.44
    },
    {
        "text": " de la realidad, pero que este modelo ya está austrayendo un montón de casos particulares,",
        "start": 4633.44,
        "end": 4637.92
    },
    {
        "text": " austray en algo más alto, literalmente hablando, y además podría haber por acá yo que",
        "start": 4637.92,
        "end": 4645.4400000000005
    },
    {
        "text": " sé, el clima, sí, o sea en la realidad tengo clima y hace calor y tengo un perrito",
        "start": 4645.4400000000005,
        "end": 4652.12
    },
    {
        "text": " French Pudel, delicioso, quedó feo, lindo, ahora si yo voy a hacer un sistema que representa",
        "start": 4652.12,
        "end": 4663.6
    },
    {
        "text": " temas inmobiliarios o de venta de vehículos, imagínense que acá estamos modelando para",
        "start": 4663.6,
        "end": 4669.4800000000005
    },
    {
        "text": " un escribano o escribana, que tiene compra venta de vehículos, compra venta de inmuebles,",
        "start": 4669.4800000000005,
        "end": 4676.160000000001
    },
    {
        "text": " la blitbona, obviamente tiene clientes, a la escribana en la solución de software de la",
        "start": 4676.160000000001,
        "end": 4681.320000000001
    },
    {
        "text": " escribana no le va a interesar el perrito, el clima, un montón de otras cosas más",
        "start": 4681.320000000001,
        "end": 4686.400000000001
    },
    {
        "text": " grises, porque ahora lo hago blanco y negro porque estamos arrancando el curso, pero",
        "start": 4686.400000000001,
        "end": 4691.08
    },
    {
        "text": " pueden haber un montón de cosas más grises que es de hipopapero, esto que voy a ver en la",
        "start": 4691.08,
        "end": 4694.44
    },
    {
        "text": " realidad, le va a importar al sistema que voy a construir, y bueno, una primera criterio",
        "start": 4694.44,
        "end": 4700.08
    },
    {
        "text": " es preguntar, sí, preguntar, o sea, vostas conversaciones con el cliente y, repente, ves",
        "start": 4700.08,
        "end": 4709.28
    },
    {
        "text": " una maquinaria y ves que esa maquinaria es central al proceso de producción que hace, que sea",
        "start": 4709.28,
        "end": 4715.48
    },
    {
        "text": " lo que sea que hace mi cliente, entonces pues sí, papro, capaz que tengo que tener en cuenta",
        "start": 4715.48,
        "end": 4720.0
    },
    {
        "text": " algo de esa maquinaria es mi sistema, tengo que poder, no sé, programar el mantenimiento",
        "start": 4720.0,
        "end": 4725.08
    },
    {
        "text": " o el input o lo que gasta, ¿qué hago con esa maquinar? la incorporo a mi análisis o no,",
        "start": 4725.08,
        "end": 4731.88
    },
    {
        "text": " si no la incorporo no existe, mi software nunca va a decir nada de esa máquina, si la",
        "start": 4731.88,
        "end": 4737.28
    },
    {
        "text": " incorporo, mi software va a poder trabajar, va a poder decir algo de esa máquina, puede",
        "start": 4737.28,
        "end": 4741.52
    },
    {
        "text": " ser desde el nombre y el número sería hasta una programación día por día y cuando hay",
        "start": 4741.52,
        "end": 4747.36
    },
    {
        "text": " que apagarla y mantenerla, o sea, no sé, habrá que ver la importancia de esa máquina",
        "start": 4747.36,
        "end": 4753.08
    },
    {
        "text": " en el problema de este cliente, entonces pregunto y abriguo, ¿vale? entonces, cuando hacemos",
        "start": 4753.08,
        "end": 4760.04
    },
    {
        "text": " un modelo de niño, en particular, cuando analizamos en todos objetos, básicamente lo que",
        "start": 4760.04,
        "end": 4764.28
    },
    {
        "text": " va a hacer es mirar la realidad, que es infinitamente compleja y hay que atraer, atraer,",
        "start": 4764.28,
        "end": 4771.759999999999
    },
    {
        "text": " recortar, recortar, recortar, recortar hasta llegar a algunos de estos modelos como habíamos",
        "start": 4771.76,
        "end": 4778.16
    },
    {
        "text": " visto acá, obviamente que cuanto más práctica tenemos en modelar, más rápido vamos a llegar",
        "start": 4778.16,
        "end": 4788.280000000001
    },
    {
        "text": " a un modelo de la análisis que sea bien conciso y que no sobrenada ni falte nada, que",
        "start": 4788.280000000001,
        "end": 4794.9800000000005
    },
    {
        "text": " esa es la gran dificultad de hacer un dibujito de estos, ¿no? ¿Por qué no pusieron? ¿Qué",
        "start": 4794.98,
        "end": 4802.839999999999
    },
    {
        "text": " podría haber estado acá? O sea, esta dura no, no pueden ni tener ejemplos, dígame,",
        "start": 4802.839999999999,
        "end": 4806.54
    },
    {
        "text": " ¿qué podría haber estado acá? ¿Qué podríamos haber modelado en un sistema de esos",
        "start": 4806.54,
        "end": 4810.82
    },
    {
        "text": " que no está? ¿Por el compositor? ¿Por qué puede ser que la artista se que le tocó el",
        "start": 4810.82,
        "end": 4814.9
    },
    {
        "text": " compositor de seguir con la canción? Ahí va, bien, tener dos cadeles, el que compone y",
        "start": 4814.9,
        "end": 4819.54
    },
    {
        "text": " que interpreta la canción, podemos creerse para eso, bueno acá no se hizo, entonces en",
        "start": 4819.54,
        "end": 4824.7
    },
    {
        "text": " el sistema acá vamos a hacer para que pasión de audio, no vamos a tener forma de diferenciar",
        "start": 4824.7,
        "end": 4828.42
    },
    {
        "text": " uno de otros, ¿está bien eso? ¿Y claro no sé, depende, o sea ahí le preguntaste tipo,",
        "start": 4828.42,
        "end": 4836.92
    },
    {
        "text": " ¿ye, está bien no puede diferenciar? Ah sí, no, ni importa, está perfecto, entonces",
        "start": 4836.92,
        "end": 4840.96
    },
    {
        "text": " eso lo optra giste, bueno no pedemos poco de acelerador, acá hay un ejemplo donde",
        "start": 4840.96,
        "end": 4850.74
    },
    {
        "text": " la más secuencia, pues como dije hoy análisis en la parte de esa modelo de dominio es como",
        "start": 4850.74,
        "end": 4856.86
    },
    {
        "text": " si fuera una foto ya con una mente entrenada, pero es que es ver, es a hoy, una mente entrenada",
        "start": 4856.86,
        "end": 4863.62
    },
    {
        "text": " empieza a ver esas atracciones a preguntar, a leer entre líneas y empieza a poner los conceptos",
        "start": 4863.62,
        "end": 4870.66
    },
    {
        "text": " relaciones y atributos más adecuados, o sea a austraer, bueno pero eso es una estructura,",
        "start": 4870.66,
        "end": 4876.98
    },
    {
        "text": " como si fuera una foto del problema, ahora qué ocurre en la realidad o en el problema,",
        "start": 4876.98,
        "end": 4882.219999999999
    },
    {
        "text": " cómo van a usar mi sistema, bueno primero se ingresa la canción, después se obtienen",
        "start": 4882.219999999999,
        "end": 4887.7
    },
    {
        "text": " los géneros y los artistas y después agrego tantos artistas como quiero y después agrego",
        "start": 4887.7,
        "end": 4893.639999999999
    },
    {
        "text": " tantos géneros como quiero y al final termino la creación de una nueva canción, esto de",
        "start": 4893.639999999999,
        "end": 4901.339999999999
    },
    {
        "text": " donde creen que sale, del caso de uso, esto surge del caso de uso, pero tampoco surge así",
        "start": 4901.34,
        "end": 4911.32
    },
    {
        "text": " no más de esa descripción cortita que vimos, hace que hay más paso para agarrar el caso",
        "start": 4911.32,
        "end": 4915.34
    },
    {
        "text": " de uso, expandirlo en la interacción entre la persona y el sistema, expandirlo en numeral",
        "start": 4915.34,
        "end": 4921.5
    },
    {
        "text": " o en ver alternativas y a partir de ahí obtener un diarama secuencia, este diarama es un",
        "start": 4921.5,
        "end": 4926.78
    },
    {
        "text": " diarama de URL que se usa en la etapa de análisis también, pero se usa para analizarle",
        "start": 4926.78,
        "end": 4932.42
    },
    {
        "text": " comportamiento contra el sistema, el modelo dominio se usa para analizar la estructura",
        "start": 4932.42,
        "end": 4937.139999999999
    },
    {
        "text": " que tiene el problema, bueno y hay alguna cosa más que ya vamos tener tiempo para ver,",
        "start": 4937.139999999999,
        "end": 4946.0599999999995
    },
    {
        "text": " entonces pasando de la análisis ahora el diseño, el con, el, estoy en la dos, ahí, el",
        "start": 4946.06,
        "end": 4956.700000000001
    },
    {
        "text": " objetivo del diseño, o sea el análisis ya agarró los requerimientos y dijo bueno la foto",
        "start": 4956.700000000001,
        "end": 4962.860000000001
    },
    {
        "text": " de esto es así y los comportamientos son todos estos, se usa UML para moder dominio,",
        "start": 4962.860000000001,
        "end": 4969.46
    },
    {
        "text": " se usa UML para el sistema secuencia, ahora pasamos al diseño y es bueno, cómo lo vamos",
        "start": 4969.46,
        "end": 4975.02
    },
    {
        "text": " a hacer esto, cómo se va a hacer esto que estamos analizando, entonces acá el objetivo",
        "start": 4975.02,
        "end": 4981.42
    },
    {
        "text": " es definir objetos que, objetos y su comunicación para que después se pueda realmente programar",
        "start": 4981.42,
        "end": 4989.660000000001
    },
    {
        "text": " esto, o sea el diseño es el paso intermedio en el análisis y programación, en base a esos",
        "start": 4989.660000000001,
        "end": 4996.700000000001
    },
    {
        "text": " conceptos que yo identificé cuando yo modelé el problema dije ah tengo artista canción,",
        "start": 4996.700000000001,
        "end": 5002.02
    },
    {
        "text": " bueno ahora eso que es parte del problema, también base parte de la solución, esa mi solución,",
        "start": 5002.02,
        "end": 5007.700000000001
    },
    {
        "text": " en algún lado voy a programar, artista voy a programar canción, bueno el diseño se",
        "start": 5007.700000000001,
        "end": 5013.900000000001
    },
    {
        "text": " momento para identificar qué cosas del problema las voy a traducir en la próxima etapa acódigo y",
        "start": 5013.900000000001,
        "end": 5021.18
    },
    {
        "text": " cómo lo voy a hacer, entonces van a ver qué concepto acá es asignar responsabilidades,",
        "start": 5021.18,
        "end": 5031.26
    },
    {
        "text": " va a ser decir bueno este concepto canción que yo he identificado en la etapa de análisis, yo ahora",
        "start": 5031.58,
        "end": 5037.58
    },
    {
        "text": " lo considero que va a ser parte de mi solución y vean que el pequeñito detalle lo que hace diseño,",
        "start": 5037.58,
        "end": 5043.7
    },
    {
        "text": " convierte algo que modelaba el problema en algo que va a ser parte de la solución y de vuelta",
        "start": 5043.7,
        "end": 5049.22
    },
    {
        "text": " van a ver que es smooth esa transición entre el problema y la solución, no digo fácil, digo smooth",
        "start": 5049.22,
        "end": 5056.74
    },
    {
        "text": " y la remuncelía es así bueno ese concepto va a tener que saber tal data, total data,",
        "start": 5057.74,
        "end": 5063.58
    },
    {
        "text": " va a tener tal funcionalidad, tal procedimiento, va a tener conocer a tal otro concepto, o sea vamos",
        "start": 5063.58,
        "end": 5069.34
    },
    {
        "text": " a tener casi nada de responsabilidades a esos conceptos y como dijimos también bueno en el diseño",
        "start": 5069.34,
        "end": 5079.62
    },
    {
        "text": " vamos a tener también las dos partes, ver la estructura del diseño y la interacción del diseño,",
        "start": 5079.62,
        "end": 5084.42
    },
    {
        "text": " acá tenemos un ejemplo de diarama interacción que es un diarama de comunicación,",
        "start": 5084.9,
        "end": 5090.7
    },
    {
        "text": " te acuerdan las pelotitas hoy que la hablaba una a través de o uno o dos em1, em2, em3, bueno esto es",
        "start": 5090.7,
        "end": 5097.14
    },
    {
        "text": " algo muy similar pero siguiendo la notación uml, o sea esto lo lee cualquiera que ya se haya",
        "start": 5097.14,
        "end": 5104.9
    },
    {
        "text": " adentrado en las artes oscuras de uml, cualquiera que le ha esto que se pago uml lo interpreta de la",
        "start": 5104.9,
        "end": 5110.06
    },
    {
        "text": " misma forma y tenemos otra cosa bien de la cabeza cuadrada no, no ambivuidad por favor, esa",
        "start": 5110.06,
        "end": 5116.5
    },
    {
        "text": " realidad que tiene cosas que no precisa para nada y tiene el clima que no importa y es ambiva",
        "start": 5116.5,
        "end": 5121.820000000001
    },
    {
        "text": " incluso el caso de uso puede ser escrito ambivo porque es escritura, el escritura es ambiva y odio",
        "start": 5121.820000000001,
        "end": 5127.38
    },
    {
        "text": " los soft skills pero lo preciso bueno acá acá ya no empiezan a ver ambivuidades, cada vez menos",
        "start": 5127.38,
        "end": 5134.02
    },
    {
        "text": " ambivuidad y obviamente cuando pasas al código es el colmo de no tener ambivuidades y ahí es como",
        "start": 5134.02,
        "end": 5138.780000000001
    },
    {
        "text": " un objeto le habla otro y le pide esta operación pasando el atributo y como cada uno responde,",
        "start": 5138.78,
        "end": 5144.099999999999
    },
    {
        "text": " ahí tenemos como los objetos hablan entre sí para resolver un problema más grande y después",
        "start": 5144.099999999999,
        "end": 5152.139999999999
    },
    {
        "text": " para que esos objetos se hablan entre sí tienen que tener por ejemplo estas operaciones acá",
        "start": 5153.0199999999995,
        "end": 5159.86
    },
    {
        "text": " pareció incluso una clase nueva que antes no estaba entonces esto que está acá es un diarama",
        "start": 5159.86,
        "end": 5165.46
    },
    {
        "text": " de clases que lo usamos en la etapa de diseño o sea se nos ocurre esto en el diseño y si lo ven es",
        "start": 5165.46,
        "end": 5171.58
    },
    {
        "text": " muy parecido eso también porque es un ejemplo de la mundo entre paréntesis no o sea de hola quiero",
        "start": 5171.58,
        "end": 5178.3
    },
    {
        "text": " saber lo que su m l pero guarda mucha semejanza con el modelo de problema y esto sin embargo es un",
        "start": 5178.3,
        "end": 5184.84
    },
    {
        "text": " modelo de la solución, esto es un modelo de la solución igual está simplificado porque faltan",
        "start": 5184.84,
        "end": 5190.94
    },
    {
        "text": " más operaciones y ahí es de vuelta lo que vamos a hacer con la teoría de objetos es ayudarlos a",
        "start": 5190.94,
        "end": 5197.7
    },
    {
        "text": " pasar de cómo modelar el problema a implementarlo en un lenguaje orientado objetos entonces",
        "start": 5197.7,
        "end": 5205.82
    },
    {
        "text": " el resumen es así preguntas, justo aparte al final tirar la homba de humo y desaparecer",
        "start": 5207.099999999999,
        "end": 5215.179999999999
    },
    {
        "text": " de vuelta esto es un obervio y nos va a llevar todo el curso pero lo que si les digo es traten de",
        "start": 5215.18,
        "end": 5223.18
    },
    {
        "text": " no perderse en qué etapa están porque a veces a ver a ver un segundo y un segundo a veces",
        "start": 5223.18,
        "end": 5228.38
    },
    {
        "text": " esas preguntas de análisis cuando estamos en diseño, como siendo bueno pero esto no no",
        "start": 5228.38,
        "end": 5234.02
    },
    {
        "text": " olvidate, estáse en otra etapa, entonces a veces no vamos a meter tanto doble clic en una subetapa",
        "start": 5234.02,
        "end": 5241.14
    },
    {
        "text": " subetapa un patrón de diseño que es final te olvidas, pero en donde estoy ahora estoy diseñando",
        "start": 5241.700000000001,
        "end": 5247.820000000001
    },
    {
        "text": " o sea que a veces te olvidas de este paraguas general, entonces a partir los casos de uso que es la",
        "start": 5249.160000000001,
        "end": 5256.3
    },
    {
        "text": " realidad y a partir de escenarios de casos de uso que es especificado en mayor nivel de detalle",
        "start": 5256.3,
        "end": 5262.34
    },
    {
        "text": " expandirlos y a partir de modelar el problema a partir de ahí vamos a sacar comportamientos para",
        "start": 5262.34,
        "end": 5270.860000000001
    },
    {
        "text": " cada uno de los escenarios del caso de uso vamos a sacar contratos para los contratos vamos a",
        "start": 5270.860000000001,
        "end": 5275.7
    },
    {
        "text": " ver cómo lo resolvemos de acaliquiar las análisis y de las derechas diseño, acá vemos cómo resolver",
        "start": 5275.7,
        "end": 5281.900000000001
    },
    {
        "text": " cada uno, después vemos qué clases precisamos para resolverlo y después lo programamos en cebamos",
        "start": 5281.900000000001,
        "end": 5291.38
    },
    {
        "text": " más a esta parte o sea agarramos todos estos y lo vamos a pramador y decimos suerte y te da",
        "start": 5291.38,
        "end": 5297.34
    },
    {
        "text": " vuelta lo agarras y lo escribices, tenemos más en p4 o sea más en tal vez con un chava",
        "start": 5297.34,
        "end": 5304.9400000000005
    },
    {
        "text": " bueno si hay que usted en alguna pregunta se arriman y si no hasta el miércoles",
        "start": 5307.9400000000005,
        "end": 5311.38
    }
]