[
    {
        "text": " Bueno, esta vez. Bueno, vamos a continuar hoy con el tema Reilos, que fue lo que",
        "start": 0.0,
        "end": 23.44
    },
    {
        "text": " hemos empezado el lunes y esta va a ser la última semana en la cual digamos vemos temas nuevos previo",
        "start": 23.44,
        "end": 31.44
    },
    {
        "text": " al parcial. Las dos clases de la semana que viene, las vamos a usar para trabajar en parciales viejos,",
        "start": 31.44,
        "end": 37.96
    },
    {
        "text": " si, cosa que se vayan haciendo una idea de qué esperar del parcial, ya tienen en el Eva publicados",
        "start": 37.96,
        "end": 44.760000000000005
    },
    {
        "text": " unos cuantos parciales de años anteriores con las respuestas también, entonces le dejas aprovechar",
        "start": 44.760000000000005,
        "end": 50.74
    },
    {
        "text": " las clases para trabajar en eso, para dudas a trasadas de práctico, consultas de teorico o lo que",
        "start": 50.74,
        "end": 55.86
    },
    {
        "text": " sería. ¿De acuerdo? Vamos a elegir algunos ejercicios, seguida algún parcial de algún año anterior,",
        "start": 55.86,
        "end": 61.900000000000006
    },
    {
        "text": " para trabajar, digamos, y discutir entre todos y el resto de las clases van a ser para consultas.",
        "start": 61.900000000000006,
        "end": 66.5
    },
    {
        "text": " Bueno, nos toca terminar de trabajar a Reilos, subrango San Realidad ya lo habíamos visto en la clase",
        "start": 68.26,
        "end": 75.02000000000001
    },
    {
        "text": " pasada y habíamos llegado hasta la parte de recorridas sobre a Reilos.",
        "start": 75.02,
        "end": 82.02
    },
    {
        "text": " Bueno, y habíamos visto que para resolver cualquier operación que requiere una recorrida completa",
        "start": 88.82,
        "end": 98.53999999999999
    },
    {
        "text": " en el arreglo, la estructura ideal era el foro, porque sabemos dónde empezamos, sabemos dónde terminamos,",
        "start": 98.54,
        "end": 106.86000000000001
    },
    {
        "text": " y es necesaria una recorrida, celda, acelda para resolver algún tipo de tarea. La tarea puede",
        "start": 106.86000000000001,
        "end": 115.22
    },
    {
        "text": " ser de lo más variada, sí pueden haber montones de problemas diferentes que requieran recorrer una",
        "start": 115.22,
        "end": 121.86000000000001
    },
    {
        "text": " regla en su totalidad, pero todos ellos necesitan ir desde la primera posición hasta la última",
        "start": 121.86,
        "end": 128.66
    },
    {
        "text": " posición, y eso la estructura correcta es el foro. Por ejemplo, puedo querer recorrer el arreglo",
        "start": 128.66,
        "end": 135.74
    },
    {
        "text": " para inicializar todas sus celdas, ya sea conceros, ya sea con el resultado de alguna expresión,",
        "start": 135.74,
        "end": 143.26
    },
    {
        "text": " o ya sea, por ejemplo, con valores obtenidos desde la entrada estándar. No importa qué valores",
        "start": 143.26,
        "end": 150.62
    },
    {
        "text": " elija yo para inicializar el arreglo, lo importante es que quede inicializado. A",
        "start": 150.62,
        "end": 157.74
    },
    {
        "text": " el arreglo le pasa lo mismo que cualquier variable, si yo no lo inicializo queda con que,",
        "start": 157.74,
        "end": 163.54
    },
    {
        "text": " con basura, con un valor indefinido. En este caso sería un valor indefinido en cada una de",
        "start": 164.74,
        "end": 170.26
    },
    {
        "text": " sus posiciones, o sea que al igual que cualquier variable debe tener un valor inicial válido en",
        "start": 170.26,
        "end": 176.18
    },
    {
        "text": " cada posición antes de poder empezar a trabajar con él. Bien, la inicialización es una de las",
        "start": 176.18,
        "end": 184.78
    },
    {
        "text": " tareas que yo puedo querer resolver, hay montones, por ejemplo puedo calcular la suma de todos los",
        "start": 184.78,
        "end": 191.06
    },
    {
        "text": " elementos que están almacenados en las celdas, o encontrar el valor máximo que está almacenado",
        "start": 191.06,
        "end": 197.14000000000001
    },
    {
        "text": " en el arreglo, o desplegarlo por pantalla. Lo que sea, pero estamos hablando de operaciones que si o",
        "start": 197.14000000000001,
        "end": 203.86
    },
    {
        "text": " si requieren una recorrida en su totalidad de la celda de la regla. Hasta acá,",
        "start": 203.86,
        "end": 209.54000000000002
    },
    {
        "text": " tomas y menos es, donde vemos que habla despasada. Bien, hoy vamos a ver operaciones que a diferencia de",
        "start": 209.54000000000002,
        "end": 217.42000000000002
    },
    {
        "text": " estas no requieren una recorrida completa. Y estamos hablando de las búsquedas. Cuando hablamos",
        "start": 217.42000000000002,
        "end": 226.94000000000003
    },
    {
        "text": " de búsqueda, estamos diciendo que queremos encontrar algún valor almacenado en el arreglo que cumple",
        "start": 226.94,
        "end": 234.94
    },
    {
        "text": " una determinada condición. Y la idea es, una vez que lo encontramos queremos detenerlos.",
        "start": 234.94,
        "end": 242.66
    },
    {
        "text": " Tenemos acá un ejemplo de lo que no tenemos que hacer cuando vamos a hacer una búsqueda. No es",
        "start": 245.46,
        "end": 252.26
    },
    {
        "text": " correcto y observo en que está marcado en negrita, utilizar fort para hacer una búsqueda por más que",
        "start": 252.38,
        "end": 258.82
    },
    {
        "text": " entre comillas andas. Es decir, este código resuelve el problema. Sí, lo resuelve, pero cuál es el",
        "start": 258.82,
        "end": 266.65999999999997
    },
    {
        "text": " precio que se está pagando. Aún después de encontrarlo, seguimos recorriendo hasta el final de",
        "start": 266.65999999999997,
        "end": 274.34
    },
    {
        "text": " manera totalmente innecesaria. Esta estructura es ineficiente porque continúa buscando aún después de",
        "start": 274.41999999999996,
        "end": 284.65999999999997
    },
    {
        "text": " haber encontrado un valor que cumpla con la condición deseada. Compila, corre, resuelve el problema,",
        "start": 284.65999999999997,
        "end": 291.34
    },
    {
        "text": " pero no es la mejor solución. De hecho, es una muy mala solución. Miremos un poquito este código.",
        "start": 291.34,
        "end": 298.38
    },
    {
        "text": " En este ejemplo usamos una variable bulian para indicar si encontramos o no el valor que estábamos",
        "start": 299.26,
        "end": 304.3
    },
    {
        "text": " buscando. Sí. Y después, este forma desde la primera celda hasta la última, es decir, recorre el",
        "start": 304.3,
        "end": 310.82
    },
    {
        "text": " arreglo en su totalidad. Si dentro encuentra algún valor que cumpla con la condición deseada,",
        "start": 310.82,
        "end": 318.9
    },
    {
        "text": " que crea decir a de I. En el arreglo ha accedo al contenido de la posición I. Si lo que está",
        "start": 318.9,
        "end": 328.78
    },
    {
        "text": " almacenado allí cumple con la condición deseada que pasa. Encontré pasaba la arturo, significa,",
        "start": 328.78,
        "end": 334.14
    },
    {
        "text": " se encontró lo que se estaba buscando. Ahora, aún después de haberlo encontrado que ocurre,",
        "start": 334.14,
        "end": 339.53999999999996
    },
    {
        "text": " sigue, sí o sí, moviéndose hasta llegar al final. Esto es algo que ninguno de nosotros",
        "start": 339.53999999999996,
        "end": 347.97999999999996
    },
    {
        "text": " haría en la vida real, pero muchas veces se lo pedimos a un programa. Vamos a tomar un ejemplo",
        "start": 347.98,
        "end": 355.66
    },
    {
        "text": " de una clase pasada que vimos. Imagínense que tenemos M vale 100, tenemos 100 puertas, 100 casitas",
        "start": 355.66,
        "end": 362.94
    },
    {
        "text": " pegadas en una calle. Estamos buscando a Juan. Entonces, hacemos. Vamos a la puerta número 1 y",
        "start": 362.94,
        "end": 370.26
    },
    {
        "text": " preguntamos si allí está Juan. Sí, me da que no está Juan que hacemos. Pasamos a la puerta número",
        "start": 370.26,
        "end": 377.54
    },
    {
        "text": " 3. Preguntamos allí está Juan y resulta allí está Juan. Entonces, ¿qué pasa? Encontramos a Juan.",
        "start": 377.66,
        "end": 391.3
    },
    {
        "text": " Este forcería como decir la Juan. Espera que voy a fijarme en las 97 puertas restantes a ver si",
        "start": 391.3,
        "end": 399.86
    },
    {
        "text": " te encuentro y después de que me fijes si estas en ellas, vengo a donde estás. Díganme si",
        "start": 399.86,
        "end": 407.34000000000003
    },
    {
        "text": " alguno ustedes haría eso. No. Bueno, entonces, no le pedamos al programa que haga eso.",
        "start": 407.34000000000003,
        "end": 413.74
    },
    {
        "text": " Está bien. El concepto es, en el momento en que encontraste a Juan o a quien sea que",
        "start": 413.74,
        "end": 420.06
    },
    {
        "text": " es buscando detener la búsqueda. Así que nada de fort para realizar operaciones de búsqueda.",
        "start": 420.06,
        "end": 427.34
    },
    {
        "text": " Esto es un error importante en la vida y también en los parciales de programación 1. Muy grave",
        "start": 427.34,
        "end": 434.86
    },
    {
        "text": " de hecho. Queda claro. Lo correcto es utilizar una estructura de repetición condicional.",
        "start": 434.86,
        "end": 444.54
    },
    {
        "text": " Concretamente vamos a usar el y debe detenerse la búsqueda cuando se encontró algún valor",
        "start": 444.54,
        "end": 451.90000000000003
    },
    {
        "text": " del arreglo que cumpla con la condición deseada. Acá vamos a llegar al final en el peor caso.",
        "start": 451.90000000000003,
        "end": 459.42
    },
    {
        "text": " Y el peor caso que es. Que lo que estoy buscando está en la puerta 100 que Juan está en la",
        "start": 459.42,
        "end": 466.70000000000005
    },
    {
        "text": " puerta 100 o que no haya nada y llamado Juan. Cualquiera de esos dos casos. Entonces acá",
        "start": 466.7,
        "end": 474.62
    },
    {
        "text": " tenemos un esquema genérico de una búsqueda. Esto es algo así como un molde aplicable a cualquier",
        "start": 474.62,
        "end": 481.34
    },
    {
        "text": " tipo de búsqueda. Y luego uno lo tiene que aciornar y adaptar el problema concreto que tenga,",
        "start": 481.34,
        "end": 486.02
    },
    {
        "text": " pero este esqueleto es bastante representativo de lo que es una operación de búsqueda en un arreglo.",
        "start": 486.02,
        "end": 491.02
    },
    {
        "text": " Que se parece mucho algún ejemplo que vimos en su momento cuando estudiamos la estructura",
        "start": 491.74,
        "end": 497.09999999999997
    },
    {
        "text": " guay, una doble condición con un ande en el medio. La idea es vamos a manejar algún contador y",
        "start": 497.09999999999997,
        "end": 506.85999999999996
    },
    {
        "text": " vamos a posicionarnos en lo que sea la primera posición a partir de la cual queremos buscar.",
        "start": 506.85999999999996,
        "end": 511.5
    },
    {
        "text": " Por ejemplo si las posiciones de la arreglo empiezan en uno, bueno, y valdrá uno como valor inicial.",
        "start": 511.5,
        "end": 517.78
    },
    {
        "text": " O el valor que sea que corresponda para iniciar la búsqueda. Y después empiezan el guay mientras que",
        "start": 518.78,
        "end": 528.18
    },
    {
        "text": " i sea menor igual a último donde último representa el índice final en el cual queremos buscar.",
        "start": 528.18,
        "end": 536.18
    },
    {
        "text": " Dicho un criollo esto vendría a decir mientras no llegue sal final y además el elemento que",
        "start": 537.86,
        "end": 546.8199999999999
    },
    {
        "text": " está en la posición y de la arreglo no cumcla la condición deseada que tenemos que hacer avanzar.",
        "start": 546.82,
        "end": 554.74
    },
    {
        "text": " O sea que si yo estoy parado en una posición digo bueno estoy en la última no lo que está",
        "start": 557.22,
        "end": 562.46
    },
    {
        "text": " a cumple lo que estoy buscando no perfecto, debo pasar a la que viene. En este esqueleto",
        "start": 562.46,
        "end": 570.7800000000001
    },
    {
        "text": " genérico pusimos que ahí le asignamos el valor siguiente. Bueno el valor siguiente dependerá",
        "start": 570.78,
        "end": 577.5799999999999
    },
    {
        "text": " también del contexto concreto, recuerden que esto es un esquema genérico. Probablemente el",
        "start": 577.5799999999999,
        "end": 582.8199999999999
    },
    {
        "text": " siguiente será imasuno, pero capaz que estamos ante un problema en el cual me dicen buscar un",
        "start": 582.8199999999999,
        "end": 589.4599999999999
    },
    {
        "text": " elemento que cumpla determinada posición de determinada condición, perdón únicamente en las",
        "start": 589.4599999999999,
        "end": 594.5
    },
    {
        "text": " posiciones paris. Entonces ahí en vez de avanzar de a uno voy a avanzar de a cuánto, de a dos,",
        "start": 594.5,
        "end": 600.18
    },
    {
        "text": " o sea que el siguiente sería el índice que está a dos lugares después. O sea avanza lo que corresponda",
        "start": 600.18,
        "end": 606.34
    },
    {
        "text": " a avanzar. Está bien? Entonces vamos a suponer. Sí.",
        "start": 606.34,
        "end": 615.4200000000001
    },
    {
        "text": " Aquí tenemos un arreglo, los índices empiezan, vamos a suponer en uno y que tenemos determinados",
        "start": 615.42,
        "end": 643.42
    },
    {
        "text": " valores almacenados aquí, un 72, un 28, un 43 y un 15. Vamos a ilustrar el caso en el cual estamos",
        "start": 643.42,
        "end": 654.62
    },
    {
        "text": " buscando el 43. Entonces cuál sería el primero para este caso concreto? El índice 1, o sea que",
        "start": 654.62,
        "end": 666.9799999999999
    },
    {
        "text": " acá colocamos el índice 1. Vamos a suponer que el arreglo tiene no se veinte posiciones, o sea que",
        "start": 666.98,
        "end": 676.54
    },
    {
        "text": " M valdría 20, el último valdría 20. Uno es menor igual que 20? Sí. Lo que estamos queriendo",
        "start": 676.54,
        "end": 687.38
    },
    {
        "text": " buscar cumple la condición, acá cuál es la condición, que sea el 43. Es decir, estamos parados en",
        "start": 687.38,
        "end": 695.3000000000001
    },
    {
        "text": " el 43? No, porque lo que tenemos acá es un 72, o sea que esto cumple la condición? No. La primera",
        "start": 695.3,
        "end": 708.2199999999999
    },
    {
        "text": " condición del an dio verdadera, la segunda condición del an dio verdadera. Entonces que hacemos?",
        "start": 708.2199999999999,
        "end": 714.54
    },
    {
        "text": " Avanzamos. Pasamos al a dos y volvemos al y dos es menor igual que 20? Sí, la primera condición",
        "start": 714.54,
        "end": 728.54
    },
    {
        "text": " dio verdadera. Lo que está acá el 28 cumple con la condición de ser el 43? No la cumple, o sea que la",
        "start": 728.54,
        "end": 738.5
    },
    {
        "text": " segunda condición lo que está luego del an sigue siendo verdadera. Entonces, hacemos.",
        "start": 738.5,
        "end": 744.5
    },
    {
        "text": " Avanzamos. Pasamos al siguiente. Volvemos al y tres es menor igual que 20? Sí. Ahora vamos a",
        "start": 744.5,
        "end": 755.86
    },
    {
        "text": " mirar la segunda, la primera de otro. Lo que está acá cumple con la condición de ser el 43? Sí,",
        "start": 755.86,
        "end": 764.14
    },
    {
        "text": " la cumple, pero acá que me están preguntando, que no la cumple, o sea que todo ese note que pasa,",
        "start": 764.14,
        "end": 770.18
    },
    {
        "text": " da falso. Entonces, al resultado de la evaluación de la condición es verdadero y falso,",
        "start": 771.14,
        "end": 777.8199999999999
    },
    {
        "text": " que pasa con eso? Falso. ¿Qué ocurre con el y? Corta y quedó detenido en la posición donde está",
        "start": 777.8199999999999,
        "end": 786.34
    },
    {
        "text": " el elemento que cumplía la condición deseada. No hemos continuado la búsqueda luego de",
        "start": 786.34,
        "end": 792.58
    },
    {
        "text": " haber encontrado el valor buscado. ¿Ve bien? ¿Hasta acá? ¿Qué pasaría si no hubiera",
        "start": 792.58,
        "end": 801.3000000000001
    },
    {
        "text": " habido ningún 43? Habríamos seguido hasta el final la condición a la derecha del",
        "start": 801.3000000000001,
        "end": 808.4200000000001
    },
    {
        "text": " and nunca se habría hecho verdadera, pero en algún momento cuando hallamos pasado la última",
        "start": 808.4200000000001,
        "end": 815.1
    },
    {
        "text": " posición que habría pasado con la primera. La primera sería falsa y vamos a recordar a nuestro",
        "start": 815.1,
        "end": 823.86
    },
    {
        "text": " abijo amigo el circuito corto. Sí, este esquema de búsqueda funciona correctamente gracias a que",
        "start": 823.86,
        "end": 831.3000000000001
    },
    {
        "text": " estamos en un lenguaje con circuito corto, concretamente en un compilador con circuito corto.",
        "start": 831.3000000000001,
        "end": 836.38
    },
    {
        "text": " Recordamos que pasa con el circuito corto cuando la condición al izquierda del anda falso,",
        "start": 836.38,
        "end": 842.58
    },
    {
        "text": " que sucede corta. ¿Ve bien? Vamos a imaginarnos que hubiera sido hasta el final, vamos a imaginarnos",
        "start": 842.58,
        "end": 851.46
    },
    {
        "text": " que la última es esta, la 4. Entramos por última vez, vamos a hacer de cuenta que la regla",
        "start": 851.46,
        "end": 859.7
    },
    {
        "text": " termina acá, estamos parados acá buscando un 37 por el, ¿sí? Estamos avanzando desde el",
        "start": 859.7,
        "end": 866.9000000000001
    },
    {
        "text": " principio y nunca encontramos el 37 hasta que llegamos a la última. 4 es menor igual que 4,",
        "start": 866.9,
        "end": 873.26
    },
    {
        "text": " sí, da verdadero. Lo que está acá es un 37, no, o sea que la condición a la derecha del anda se",
        "start": 874.4599999999999,
        "end": 883.4599999999999
    },
    {
        "text": " está cumpliendo, ¿qué hacemos? Avanzamos uno y ahora toma el valor 5 y acá se prenda una",
        "start": 883.4599999999999,
        "end": 892.46
    },
    {
        "text": " señal de alerta roja, ¿por qué? 5 es una posición que no existe en el arreglo. Si yo quisiera entrar",
        "start": 892.46,
        "end": 902.82
    },
    {
        "text": " a la posición 5, estaría queriendo entrar a una zona de memoria que está indefinida, una posición",
        "start": 902.82,
        "end": 911.5400000000001
    },
    {
        "text": " que no existe en el arreglo. Entonces, es lo que pasa acá, cuando venimos al igual decimos 5, es menor",
        "start": 911.5400000000001,
        "end": 920.5
    },
    {
        "text": " igual que 4, no. Y gracias al circuito corto que pasa, se corta acá la evaluación y se va del",
        "start": 920.5,
        "end": 930.54
    },
    {
        "text": " guay. No llega a preguntar por la segunda. Si llegar a preguntar por la segunda estaríamos en",
        "start": 930.54,
        "end": 939.1
    },
    {
        "text": " problema, porque estaría queriendo acceder a que posición. Al a 5, pero la posición 5 no",
        "start": 939.1,
        "end": 945.34
    },
    {
        "text": " existe. Gracias al circuito corto, no tenemos el problema de irnos de rango. Ahí el programa se torna",
        "start": 945.34,
        "end": 956.34
    },
    {
        "text": " impredecible y decimos que se rompe en tiempo de ejecución. En el momento en que uno accede a una",
        "start": 956.34,
        "end": 964.02
    },
    {
        "text": " posición de una arreglo que no está definida, no se sabe lo que puede pasar. Dependera de la máquina",
        "start": 964.02,
        "end": 971.82
    },
    {
        "text": " donde lo estoy corriendo. Lo más probable es que venga el sistema operativo y te corte la ejecución",
        "start": 971.82,
        "end": 976.3000000000001
    },
    {
        "text": " de golpe por estar accediendo en moriambalia. Puede pasar que el programa se vuelva a loco, te muestre",
        "start": 976.3000000000001,
        "end": 985.62
    },
    {
        "text": " basura, la ejecución se torna impredecible. Por eso la importancia de jamás nunca salirnos",
        "start": 985.62,
        "end": 993.0600000000001
    },
    {
        "text": " de rango. Lo podemos hacer gracias a que tenemos la evaluación por circuito corto. Sí. Y es",
        "start": 993.06,
        "end": 1004.3399999999999
    },
    {
        "text": " razonable suponer que la tenemos primero porque la tenemos en fripascal y segundo porque la mayoría",
        "start": 1004.3399999999999,
        "end": 1008.66
    },
    {
        "text": " de los lenguajes de programación tienen evaluación por circuito corto. Ok. Quedó claro el esquema de",
        "start": 1008.66,
        "end": 1017.6999999999999
    },
    {
        "text": " búsqueda. Bueno, vamos a mirar algunos ejemplos concretos de búsqueda. Como dije antes, esto es un",
        "start": 1017.7,
        "end": 1024.82
    },
    {
        "text": " esquema genérico. Un olvivo lo tiene que adaptar y asionar al caso concreto en el cual esté. Bueno,",
        "start": 1024.82,
        "end": 1032.8600000000001
    },
    {
        "text": " vamos a repasar cómo funcionaba la evaluación por circuito corto en el caso del an. Sí. Se",
        "start": 1032.8600000000001,
        "end": 1038.94
    },
    {
        "text": " evalua primero la parte izquierda del an. Si la parte izquierda da false, lo que dijimos directamente",
        "start": 1038.94,
        "end": 1048.42
    },
    {
        "text": " corta acá no evalua a dos ni siquiera entra a mirar a dos y el resultado total ya es false.",
        "start": 1048.42,
        "end": 1055.74
    },
    {
        "text": " En caso de que la primera sea verdadera, bueno, ahí no tiene más remedio que evaluarla",
        "start": 1058.94,
        "end": 1064.1000000000001
    },
    {
        "text": " segunda entonces ahí sí entra de evaluarla. Y lo que dijimos, la mayoría de los lenguajes de",
        "start": 1064.1,
        "end": 1070.58
    },
    {
        "text": " programación evaluan por circuito corto sea que el esquema de búsqueda que acabamos de ver vale",
        "start": 1070.58,
        "end": 1075.74
    },
    {
        "text": " en prácticamente cualquiera de ellos. Bien. Bueno, y acá tenemos algunos ejemplos concretos de",
        "start": 1075.74,
        "end": 1086.9399999999998
    },
    {
        "text": " búsqueda. Este de hecho es el que acabamos de ejecutar acá. ¿Dónde valor? Suponemos que es",
        "start": 1086.94,
        "end": 1093.74
    },
    {
        "text": " una variable que contiene un valor que es el que estamos buscando. Entonces la condición que",
        "start": 1093.74,
        "end": 1100.06
    },
    {
        "text": " estamos viendo es si el valor que está en la celda es igual o no al que yo estoy buscando.",
        "start": 1100.06,
        "end": 1105.9
    },
    {
        "text": " Sí. Eso es lo que estamos chequeando acá en la segunda condición. En la primera,",
        "start": 1105.9,
        "end": 1113.3
    },
    {
        "text": " igual que antes estamos preguntando si llegamos ya al final o no. Y en la segunda condición estamos",
        "start": 1113.3,
        "end": 1120.1399999999999
    },
    {
        "text": " preguntando si el elemento en el que estoy parado cumple o no con la condición deseada.",
        "start": 1120.1399999999999,
        "end": 1125.58
    },
    {
        "text": " Sí. Y estamos avanzando de águ Uno. Este igual no tiene viginen porque tiene una sola",
        "start": 1125.58,
        "end": 1137.06
    },
    {
        "text": " instrucción que está siendo afectada por el huaylo. O sea que todo este IF que está",
        "start": 1137.06,
        "end": 1141.34
    },
    {
        "text": " acá queda fuera del huay. Se hace después de terminar. Y lo que estamos haciendo acá es ver",
        "start": 1141.34,
        "end": 1147.3799999999999
    },
    {
        "text": " cuál fue la razón por la cual salimos. Si yo salí de la iteración y la I quedó por debajo",
        "start": 1147.3799999999999,
        "end": 1154.74
    },
    {
        "text": " de M o a los sumos son iguales que significa. Significa que me detuve en la posición en la cual",
        "start": 1154.74,
        "end": 1162.4199999999998
    },
    {
        "text": " encontré lo que estaba buscando. Ahí decimos que la búsqueda tuvo éxito. Se encontró el valor.",
        "start": 1162.4199999999998,
        "end": 1167.34
    },
    {
        "text": " Ahora si me pase de M lo que por suerte no dio problemas de memoria gracias a que al ser",
        "start": 1168.06,
        "end": 1175.4599999999998
    },
    {
        "text": " huito corto si me pase de M entonces no se va a cumplir esta condición. Pues venir a él significa",
        "start": 1175.4599999999998,
        "end": 1181.1399999999999
    },
    {
        "text": " que el valor no se encontró. Cuando I toma el valor M más I no se accede la posición de nuevo",
        "start": 1181.1399999999999,
        "end": 1190.4199999999998
    },
    {
        "text": " debido a la evaluación por circuito corto. ¿A bien? Pregunta? ¿No? Queda claro esto?",
        "start": 1190.42,
        "end": 1200.5800000000002
    },
    {
        "text": " Bueno, era algún otro. Bueno, acá tenemos una variante en la cual aún sin circuito corto esto",
        "start": 1202.0800000000002,
        "end": 1214.38
    },
    {
        "text": " funciona bien. Y la idea es tratar de ver por qué. Tengo el borrador por acá.",
        "start": 1214.38,
        "end": 1222.18
    },
    {
        "text": " Vamos a imaginarnos que estamos buscando el 37. De nuevo, M vale 4 y estamos buscando el 37.",
        "start": 1227.5400000000002,
        "end": 1238.5400000000002
    },
    {
        "text": " Vamos a imaginarnos que no estamos en un lenguaje con circuito corto. Y vamos a ver que sucede",
        "start": 1239.06,
        "end": 1245.3
    },
    {
        "text": " buscando el 37. Empezamos nuevamente en uno. Uno es menor a cuatro. Fíjense que la condición",
        "start": 1245.3,
        "end": 1259.22
    },
    {
        "text": " cambió ligeramente. Acá estamos preguntando qué. Menor estricto en vez de menor igual.",
        "start": 1259.22,
        "end": 1264.5
    },
    {
        "text": " Uno es menor a cuatro. Sí. Lo que está acá es distinto de 37. Sí, se cumple en las dos condiciones",
        "start": 1265.78,
        "end": 1273.94
    },
    {
        "text": " que hago. Abanso. En la dos lo mismo es menor a cuatro en la posición. Sí, esto es un 37. No",
        "start": 1273.94,
        "end": 1284.6200000000001
    },
    {
        "text": " se sigue cumpliendo avanzo. Cuando vengo en la posición tres vuelve a pasar exactamente lo mismo.",
        "start": 1284.62,
        "end": 1291.4599999999998
    },
    {
        "text": " Tres es menor a cuatro y lo que está acá no es el 37 que estoy buscando. ¿Qué hacemos?",
        "start": 1291.4599999999998,
        "end": 1297.1399999999999
    },
    {
        "text": " Pasamos acá. Recordemos. Estamos suponiendo que no hay circuito corto.",
        "start": 1297.9399999999998,
        "end": 1303.86
    },
    {
        "text": " ¿A? 4 es menor que 4. No, es igual a 4. O sea que esto ya me dio false. Si fuera un lenguaje",
        "start": 1304.4199999999998,
        "end": 1317.1
    },
    {
        "text": " con circuito corto directamente corta. Y si no es con circuito corto que va a pasar. Bueno, va a evaluar",
        "start": 1317.1,
        "end": 1325.34
    },
    {
        "text": " la segunda que va a preguntar por lo que está en que posición. En la 4 y acá no me fui de rango",
        "start": 1325.34,
        "end": 1332.1399999999999
    },
    {
        "text": " porque, porque paree uno antes debido al menor. O sea que aún en el caso en que se evaluara la",
        "start": 1332.14,
        "end": 1339.26
    },
    {
        "text": " segunda condición con este esquema la búsqueda entre comillas no se rompe. Entonces cuando salimos,",
        "start": 1339.26,
        "end": 1348.38
    },
    {
        "text": " bueno, preguntamos si lo que está en la posición donde nos detuvimos es el valor o no. O sea que si no se",
        "start": 1348.38,
        "end": 1356.8200000000002
    },
    {
        "text": " ponele que estás en un lenguaje en el cual no estás del todo convencido que funcione por circuito",
        "start": 1356.82,
        "end": 1361.3
    },
    {
        "text": " corto. Bueno, podéis adaptar la búsqueda para tratar de evitar ese problema. Si. En el caso de",
        "start": 1361.3,
        "end": 1367.82
    },
    {
        "text": " el esquema 4 no entraría no, igual porque me dio false. En el caso medio false esto de acá va",
        "start": 1367.82,
        "end": 1377.3
    },
    {
        "text": " evaluarla de la derecha no importa que la de la derecha de truva false el resultado del an cual va a ser.",
        "start": 1377.3,
        "end": 1382.3
    },
    {
        "text": " Poles se va a ir. O sea la evaluación por circuito corto lo que te dice es que si la de",
        "start": 1382.3,
        "end": 1390.5
    },
    {
        "text": " la izquierda le dio false no va a preguntar por la de la derecha. Pero aún si la pregunta el",
        "start": 1390.5,
        "end": 1396.94
    },
    {
        "text": " resultado final va a ser false. Justamente la gracia del circuito corto es como yo ya sé que el",
        "start": 1396.94,
        "end": 1401.4199999999998
    },
    {
        "text": " total de la evaluación me da false o no tiene sentido preguntar por lo de la derecha. Sí.",
        "start": 1401.4199999999998,
        "end": 1405.58
    },
    {
        "text": " ¿Qué ocurre después de la derecha? Se puede armar con un repeat, dependería bien de que está",
        "start": 1406.1,
        "end": 1412.8999999999999
    },
    {
        "text": " buscando, tenés que tener certeza de que por lo menos vas a tener que entrar una vez. Pero por",
        "start": 1412.8999999999999,
        "end": 1418.86
    },
    {
        "text": " ril la general este es el mejor esquema de búsqueda. ¿A bien? Sí. ¿Qué hay adentro? Exacto.",
        "start": 1418.86,
        "end": 1428.8999999999999
    },
    {
        "text": " Exactamente. Pero vuelvo a repetir el esquema anterior el que decía menor igual acá. Sí. Es",
        "start": 1429.6200000000001,
        "end": 1436.7800000000002
    },
    {
        "text": " válido en la medida que trabajemos con un lenguaje con circuito corto lo cual nos va a pasar durante",
        "start": 1436.7800000000002,
        "end": 1441.22
    },
    {
        "text": " todo el curso. Sí. Bueno esa es otra variante. ¿Vos podés jugar cambiando algo acá y algo acá de",
        "start": 1441.22,
        "end": 1452.3000000000002
    },
    {
        "text": " modo tal de tener cuidado de no irte de rango? Es más creo que hasta tenemos un ejemplo parecido.",
        "start": 1452.3000000000002,
        "end": 1456.22
    },
    {
        "text": " Este de acá. Fijate que acá tenés menor y acá tenés y más uno. Que van poco en la línea de lo que",
        "start": 1458.9,
        "end": 1469.8600000000001
    },
    {
        "text": " tú consultaste. Es más vamos a aprovechar este ejemplo que tenemos acá justamente. Uno puede",
        "start": 1469.8600000000001,
        "end": 1479.46
    },
    {
        "text": " querer buscar diferentes cosas. No sólo es el ejemplo que vimos antes fue quiero encontrar",
        "start": 1479.46,
        "end": 1485.66
    },
    {
        "text": " a ver si un valor determinado está o no. Bueno acá queremos encontrar un elemento tal que el",
        "start": 1485.66,
        "end": 1492.22
    },
    {
        "text": " inmediato siguiente sea un valor determinado. Es decir, en vez de buscar un valor determinado,",
        "start": 1492.22,
        "end": 1498.46
    },
    {
        "text": " queremos buscar el anterior a un valor determinado. Bueno este yamos este código que está acá,",
        "start": 1498.46,
        "end": 1508.14
    },
    {
        "text": " consigue ese propósito y de nuevo es una variante al esquema genérico que estábamos viendo antes.",
        "start": 1508.14,
        "end": 1514.22
    },
    {
        "text": " Vamos por lo de vuelta. Queremos ver si hay algún valor tal que el siguiente sea el 43.",
        "start": 1514.22,
        "end": 1525.98
    },
    {
        "text": " Y bueno, empezamos otra vez en la posición 1.",
        "start": 1528.46,
        "end": 1531.14
    },
    {
        "text": " O sea, queremos buscar el anterior al 43. Entramos en la 1. Uno es menor a 4. Sí.",
        "start": 1534.34,
        "end": 1542.46
    },
    {
        "text": " Lo que está en la siguiente es el 43. No, o sea que se cumple en las dos que hago.",
        "start": 1543.42,
        "end": 1550.78
    },
    {
        "text": " Abanso. Ahora ahí vale dos. Dos es menor a cuatro. Sí. Lo que está en la siguiente es el 43. Sí.",
        "start": 1550.78,
        "end": 1562.6200000000001
    },
    {
        "text": " O sea que la segunda se deja de cumplir. ¿Qué hacemos? Cortamos. Como parí antes de llegar a",
        "start": 1563.34,
        "end": 1572.86
    },
    {
        "text": " M significa que la búsqueda tuvo éxito. Ahora, si en vez de 43 hubiéramos buscado alguno tal que el",
        "start": 1572.86,
        "end": 1581.6999999999998
    },
    {
        "text": " siguiente fuera el 37 que habría pasado. Seguimos. Preguntamos acá. El bueno, 13 es menor a 4.",
        "start": 1581.6999999999998,
        "end": 1591.9399999999998
    },
    {
        "text": " Sí. El siguiente es el 37. No. Entonces, que hacemos. Abansamos. ¿Tá?",
        "start": 1592.62,
        "end": 1600.86
    },
    {
        "text": " 4 es menor a 4. No. Cílquito corto. ¿Qué pasa? Cortamos y menos mal que cortamos porque si no que habría",
        "start": 1602.4599999999998,
        "end": 1611.1
    },
    {
        "text": " ocurrido. Habríamos evaluado la de la derecha queriendo acceder a la posición 5 que no existe.",
        "start": 1611.1,
        "end": 1617.6599999999999
    },
    {
        "text": " ¿Cómo perdón? Claro, esta necesita circuito corto. Esta solución necesita circuito corto.",
        "start": 1617.66,
        "end": 1627.98
    },
    {
        "text": " Bueno, ahí habría que entrar a buscar combinaciones entre estas dos tales que...",
        "start": 1631.78,
        "end": 1637.42
    },
    {
        "text": " Sí.",
        "start": 1637.42,
        "end": 1639.42
    },
    {
        "text": " De nuevo. O sea, si vuelves menor igual que M más 1 va a querer... O sea, le va a dar tu y va a querer entrar.",
        "start": 1647.42,
        "end": 1653.18
    },
    {
        "text": " No. No. Y ponerme menor que M más 1. No es lo mismo que ponerme menor igual que M.",
        "start": 1653.18,
        "end": 1658.8200000000002
    },
    {
        "text": " No. La moralista chiquilines es, uno puede jugar con lo que pasa en ambas, siempre teniendo cuidado",
        "start": 1658.82,
        "end": 1670.4199999999998
    },
    {
        "text": " de no salirse de rango. Sí. Es razonable suponer la mayoría de las veces que contamos con evaluación",
        "start": 1670.4199999999998,
        "end": 1678.5
    },
    {
        "text": " por circuito corto. Con lo cual, tener claro que si la primera te da falsa, la segunda no le va a",
        "start": 1678.5,
        "end": 1684.8999999999999
    },
    {
        "text": " evaluar y usar eso a nuestro favor a la hora de escribir programas. Insisto, lo que vimos es un",
        "start": 1684.9,
        "end": 1693.14
    },
    {
        "text": " esquema genérico que uno lo puede adaptar a cada caso concreto, siempre teniendo cuidado de no",
        "start": 1693.14,
        "end": 1699.46
    },
    {
        "text": " acceder a una posición que no existe. ¿Ve bien? Sí.",
        "start": 1699.46,
        "end": 1708.1000000000001
    },
    {
        "text": " Ahí va. Bueno. Muchas veces hay problemas que a primera vista no parece embús quedas, pero que lo son.",
        "start": 1708.1,
        "end": 1725.9399999999998
    },
    {
        "text": " Ustedes cuando se enfrenten a un problema a resolver sobre un arreglo, comencen unos minutitos",
        "start": 1729.34,
        "end": 1734.9399999999998
    },
    {
        "text": " para reflexionar si el problema que tienen que resolver es conde o no algún tipo de búsqueda o si",
        "start": 1734.94,
        "end": 1743.5800000000002
    },
    {
        "text": " es un problema que necesariamente requiere una recorrida completa. A veces la búsqueda está camuflada.",
        "start": 1743.5800000000002,
        "end": 1749.9
    },
    {
        "text": " Por ejemplo, me piden verificar si todos los elementos son pares. El primer impulso puede ser,",
        "start": 1751.18,
        "end": 1760.6200000000001
    },
    {
        "text": " dice la palabra todos, entonces uno como que pone instinto que hace, todos recorre todo. No, si uno",
        "start": 1761.1,
        "end": 1770.9399999999998
    },
    {
        "text": " rasca un poquito esa búsqueda, en realidad este problema es equivalente a buscar un elemento que no",
        "start": 1770.9399999999998,
        "end": 1777.4199999999998
    },
    {
        "text": " sea par, o sea, buscar algún impar. Este problema también es una búsqueda. Para saber si son todos",
        "start": 1777.4199999999998,
        "end": 1787.02
    },
    {
        "text": " pares, yo busco algún impar y si encuentro alguno para no tiene sentido que siga recorriendo porque ya no",
        "start": 1787.02,
        "end": 1795.58
    },
    {
        "text": " es cierto que todos son pares. Entonces siempre ver si el problema que uno está tratando de resolver es",
        "start": 1795.58,
        "end": 1802.74
    },
    {
        "text": " conde algún tipo de búsqueda. Lo que varía es la condición concreta que preguntamos a la derecha del",
        "start": 1802.74,
        "end": 1812.9
    },
    {
        "text": " an. La de la izquierda sigue siendo igual, estamos suponiendo evaluación por circuito corto, llegamos",
        "start": 1812.9,
        "end": 1819.3000000000002
    },
    {
        "text": " hasta la última posición, avanzamos de a uno y bueno vamos a seguir avanzando en la medida que",
        "start": 1819.3000000000002,
        "end": 1825.94
    },
    {
        "text": " pase esto, vamos a analizar esto, que operación era esta. El resto de la división, muy bien, de la",
        "start": 1825.94,
        "end": 1832.7800000000002
    },
    {
        "text": " división entera. Me fijo en lo que está en la posición y del arreglo. Si al resto de dividirlo",
        "start": 1832.7800000000002,
        "end": 1840.7
    },
    {
        "text": " entre dos, me da cero que significa que lo que está almacenado en esa posición es par, entonces corresponde",
        "start": 1840.7,
        "end": 1847.3
    },
    {
        "text": " seguir. Ahora sí, lo que está almacenado allí no me da resto cero quiere decir que no es par",
        "start": 1847.3,
        "end": 1854.38
    },
    {
        "text": " paramos. Y bueno pasa lo mismo que antes, si me pase del límite, si la I se pasó del límite porque",
        "start": 1854.38,
        "end": 1866.18
    },
    {
        "text": " gracias al circuito corto no accedimos o una celda inexistente, bueno significa que avanzamos,",
        "start": 1866.18,
        "end": 1871.74
    },
    {
        "text": " pasamos por todo el arreglo y no encontramos ningún impar. O sea que todos los elementos efectivamente",
        "start": 1871.74,
        "end": 1876.98
    },
    {
        "text": " eran pares. Si pare antes significa que no todos son pares. O sea que la moralija es al momento de",
        "start": 1876.98,
        "end": 1887.26
    },
    {
        "text": " enfrentarse a un problema sobre un arreglo primero reflexionar. Bueno, este problema sí o sin",
        "start": 1887.26,
        "end": 1892.18
    },
    {
        "text": " necesito una recorrida completa o se puede resolver con una búsqueda. Dependiendo de la respuesta,",
        "start": 1892.18,
        "end": 1899.5800000000002
    },
    {
        "text": " uno irá por la estructura for, o irá por la estructura wild utilizando el esquema de búsqueda y",
        "start": 1899.5800000000002,
        "end": 1905.22
    },
    {
        "text": " de nuevo por circuito corto. En la gran mayoría de los ejercicios del curso vamos a suponer que",
        "start": 1905.22,
        "end": 1913.22
    },
    {
        "text": " tenemos evaluación por circuito corto y si llegamos a estar en alguno en el que no, bueno, el propio",
        "start": 1913.22,
        "end": 1919.18
    },
    {
        "text": " ejercicio de la idea suponga que no hay evaluación por circuito corto, pero si no se aclara nada,",
        "start": 1919.18,
        "end": 1924.8200000000002
    },
    {
        "text": " asuman evaluación por circuito corto. Ok? Más preguntas del tema búsquedas, vamos a ser un poco",
        "start": 1924.8200000000002,
        "end": 1936.22
    },
    {
        "text": " de práctico. Vamos a hacer la parte 3 del ejercicio 3. Son las mismas declaraciones que para el",
        "start": 1936.22,
        "end": 1946.0600000000002
    },
    {
        "text": " que hicimos la clase pasada. Tenemos una constante que define el tamaño del arreglo porque esto",
        "start": 1946.06,
        "end": 1951.54
    },
    {
        "text": " era una buena práctica. Si quiero cambiar el valor mañana, cambio solamente donde. Acá, en todo el",
        "start": 1951.54,
        "end": 1961.58
    },
    {
        "text": " programa, debo hacer referencia siempre a la constante N y no poner el valor concreto del tamaño.",
        "start": 1961.58,
        "end": 1967.46
    },
    {
        "text": " ¿Ah? La palabra reservada a Type para que servía. Nuevas variables no.",
        "start": 1967.98,
        "end": 1975.74
    },
    {
        "text": " Solamente arreglos y subrangos es más genérica la palabra Type. Nuevos tipos de datos. La palabra",
        "start": 1975.74,
        "end": 1985.3
    },
    {
        "text": " Type sirve para definir una sección en la cual yo voy a crear nuevos tipos de datos que habíamos",
        "start": 1985.3,
        "end": 1990.9
    },
    {
        "text": " visto en la clase pasada hay varias categorías de tipos de datos posibles hasta el momento de",
        "start": 1990.9,
        "end": 1995.82
    },
    {
        "text": " que habíamos visto solamente dos. Los subrangos y los arreglos. Pero demás, están los registros,",
        "start": 1995.82,
        "end": 2000.86
    },
    {
        "text": " sí, están los enumerados, están los conjuntos. ¿Ah? Cualquier tipo de datos definido por nosotros",
        "start": 2000.86,
        "end": 2008.82
    },
    {
        "text": " que no sea uno de los tipos predefinidos se colocan la sección Type. La sección de constante,",
        "start": 2008.82,
        "end": 2015.78
    },
    {
        "text": " la sección de tipos que sección viene después. La de variables y luego de eso viene el bloque del",
        "start": 2015.78,
        "end": 2023.26
    },
    {
        "text": " programa principal codigo en Big In-N. Bueno, Rango N es un subrango que va desde 1 hasta N, son los",
        "start": 2023.26,
        "end": 2032.02
    },
    {
        "text": " índices de la reglo. Y bueno, en este ejercicio le llamábamos Tabla. Tabla es un tipo de datos.",
        "start": 2032.02,
        "end": 2040.46
    },
    {
        "text": " Sí, luego yo me debo declarar que cosa. Una variable de tipo tabla y el arreglo propiamente",
        "start": 2040.46,
        "end": 2048.94
    },
    {
        "text": " he dicho que va a ser la variable. Es un arreglo cuya celda van en el rango de 1 a N, sí,",
        "start": 2048.94,
        "end": 2058.38
    },
    {
        "text": " y almacenamos un valor de tipo índice y en cada posición. Recuerdan estas declaraciones.",
        "start": 2058.38,
        "end": 2066.2200000000003
    },
    {
        "text": " Bueno, ejercicio 3. Escribir un programa llamado ordenado que determine si los elementos",
        "start": 2068.2200000000003,
        "end": 2077.34
    },
    {
        "text": " de la reglo se encuentran ordenados en orden ascendente. Es más, vamos a hacerlo en orden",
        "start": 2077.34,
        "end": 2085.54
    },
    {
        "text": " estrictamente ascendente. O sea, estrictamente como de menor a mayor. Si hay dos iguales que pasa,",
        "start": 2085.54,
        "end": 2095.42
    },
    {
        "text": " no es estrictamente ascendente. Sí. E imprima una salida con un mensaje indicando el resultado.",
        "start": 2095.42,
        "end": 2104.54
    },
    {
        "text": " Este problema es de búsqueda o es de recorrida completa. Es un problema de búsqueda.",
        "start": 2107.58,
        "end": 2114.1800000000003
    },
    {
        "text": " ¿Qué es lo que tenemos que buscar? Si lo que está en la posición y...",
        "start": 2114.1800000000003,
        "end": 2120.58
    },
    {
        "text": " O sea, si lo que está en la posición y es menor a lo que está en imas 1, que pasa.",
        "start": 2122.98,
        "end": 2127.6200000000003
    },
    {
        "text": " Hay que seguir. O sea, se viene cumpliendo.",
        "start": 2130.5,
        "end": 2133.86
    },
    {
        "text": " Ahora, si lo que está en imas 1, que pasa, paramos y la respuesta cual es que no.",
        "start": 2134.6600000000003,
        "end": 2143.54
    },
    {
        "text": " No, porque pedí que sea estricto.",
        "start": 2146.38,
        "end": 2148.1
    },
    {
        "text": " Pues, perdón, si, mayor igual, si es mayor igual, hay que pararte en la razón.",
        "start": 2148.98,
        "end": 2152.26
    },
    {
        "text": " Bueno, entonces, dice acá lo mismo que hicimos en el de la clase pasada. Primero,",
        "start": 2154.26,
        "end": 2160.38
    },
    {
        "text": " hay que hacer una inicialización de la reglo tomando valores de la entrada estándar.",
        "start": 2161.38,
        "end": 2165.86
    },
    {
        "text": " Esa inicialización sí la van a ser conforme.",
        "start": 2166.82,
        "end": 2169.26
    },
    {
        "text": " Una vez que se inicializó el arreglo con valores obtenidos de la entrada estándar,",
        "start": 2172.38,
        "end": 2177.62
    },
    {
        "text": " ahí es que se plantea el problema como un problema de búsqueda.",
        "start": 2177.82,
        "end": 2181.58
    },
    {
        "text": " O sea, que en este ejercicio nos va a quedar un for para la inicialización y un wile con el esquema de búsqueda.",
        "start": 2182.82,
        "end": 2188.82
    },
    {
        "text": " ¿Y, ¿acuerdo?",
        "start": 2189.82,
        "end": 2190.82
    },
    {
        "text": " Bueno, no vamos a hacer el programa entero, o la parte de la carga por teclado,",
        "start": 2192.42,
        "end": 2199.42
    },
    {
        "text": " y o más o menos por lo que estuve viendo, y lo le hicieron bien, y aparte, igual al que hicimos la despasada,",
        "start": 2199.6200000000003,
        "end": 2205.42
    },
    {
        "text": " vamos a concentrarnos en la parte de búsqueda.",
        "start": 2206.02,
        "end": 2208.82
    },
    {
        "text": " O sea, de la búsqueda concretamente.",
        "start": 2209.02,
        "end": 2211.2200000000003
    },
    {
        "text": " Y lo que pasó está bueno porque encontré diferentes soluciones todas ellas correctas.",
        "start": 2212.02,
        "end": 2217.82
    },
    {
        "text": " Entonces, vamos a escribir lo que serían fragmentos de código únicamente para la parte de la búsqueda.",
        "start": 2219.82,
        "end": 2224.82
    },
    {
        "text": " Varios de ustedes empezaron la búsqueda en la posición 1.",
        "start": 2226.82,
        "end": 2230.82
    },
    {
        "text": " Entonces, ¿cómo fue que armaron el wile?",
        "start": 2234.82,
        "end": 2236.82
    },
    {
        "text": " Pusieron, wile, y la primera condición cuál fue, mientras que i sea menor la constante como se llamaba,",
        "start": 2237.82,
        "end": 2247.82
    },
    {
        "text": " n, pusieron menor, sí, and, y compararon el actual con el próximo.",
        "start": 2248.82,
        "end": 2260.82
    },
    {
        "text": " ¿Está bien?",
        "start": 2261.82,
        "end": 2262.82
    },
    {
        "text": " Entonces, ¿qué nombre le ponemos a la reglo?",
        "start": 2262.82,
        "end": 2265.82
    },
    {
        "text": " Obrarle a.",
        "start": 2265.82,
        "end": 2266.82
    },
    {
        "text": " Acá preguntamos si a de i es menor estricto que a de i más 1.",
        "start": 2267.82,
        "end": 2276.82
    },
    {
        "text": " O sea, la condición para seguir avanzando es que el actual sea menor estricto que este, que el siguiente.",
        "start": 2277.82,
        "end": 2285.82
    },
    {
        "text": " Si no se cumple el menor estricto, puede ser por qué razón.",
        "start": 2287.82,
        "end": 2289.82
    },
    {
        "text": " Porque sea igual eso, porque sea mayor, en que yo caso ya no está ordenado de forma estrictamente ascendente.",
        "start": 2290.82,
        "end": 2295.82
    },
    {
        "text": " Y si pasan las dos, avanzamos y bueno, ya avanzamos de a 1.",
        "start": 2296.82,
        "end": 2302.82
    },
    {
        "text": " Suponiendo evaluación por circuito corto, que es lo que tenemos. Se sale de rango esto.",
        "start": 2307.82,
        "end": 2312.82
    },
    {
        "text": " ¿Por qué no?",
        "start": 2313.82,
        "end": 2315.82
    },
    {
        "text": " Porque estamos parando uno antes de la última posición.",
        "start": 2317.82,
        "end": 2321.82
    },
    {
        "text": " El error acá sería poner qué cosa.",
        "start": 2322.82,
        "end": 2326.82
    },
    {
        "text": " En vez de esto, ponerle menor igual.",
        "start": 2326.82,
        "end": 2329.82
    },
    {
        "text": " Eso es lo que no hace funcionar al programa, porque si le pongo menor igual, voy a llegar hasta la posición n, que es la última.",
        "start": 2329.82,
        "end": 2338.82
    },
    {
        "text": " Y estando en la última voy a comparar lo de la última con lo de la siguiente a la última.",
        "start": 2339.82,
        "end": 2347.82
    },
    {
        "text": " En el momento en que yo accedo a una celda que no existe, la ejecución se torna impredecible, el programa se rombe.",
        "start": 2349.82,
        "end": 2357.82
    },
    {
        "text": " Pero con menor, el esquema de búsqueda funciona bien.",
        "start": 2359.82,
        "end": 2362.82
    },
    {
        "text": " Otro que vi, lo vi menos, pero también lo vi, y que me gustó es empezar en la segunda.",
        "start": 2363.82,
        "end": 2372.82
    },
    {
        "text": " Entonces hicieron el wild y acá sí le pusieron menor igual.",
        "start": 2377.82,
        "end": 2384.82
    },
    {
        "text": " Pero la comparación fue entre quienes, entre el anterior y el actual, o sea entre ad y menos uno con ad y.",
        "start": 2385.82,
        "end": 2400.82
    },
    {
        "text": " Y bueno, avanzamos también de uno.",
        "start": 2405.82,
        "end": 2408.82
    },
    {
        "text": " Acá no hay peligro en llegar hasta la última posición inclusive, porque no esté preguntando por la próxima sino por la anterior.",
        "start": 2409.82,
        "end": 2418.82
    },
    {
        "text": " El problema lo tendría saliendo medarrango si manteniendo esto hubiera empezado en qué.",
        "start": 2420.82,
        "end": 2426.82
    },
    {
        "text": " En uno, porque si empiezo en uno, estaría queriendo acceder a cuál.",
        "start": 2426.82,
        "end": 2431.82
    },
    {
        "text": " Al acero que no existe, o sea que acá corresponde empezar en dos.",
        "start": 2431.82,
        "end": 2435.82
    },
    {
        "text": " Entonces acá tenemos los dos ejemplos más representativos de las soluciones que se le fueron ocurriendo.",
        "start": 2436.82,
        "end": 2443.82
    },
    {
        "text": " Un poco el jueguito siempre es el mismo, es balancear lo que pasa en la primera condición con lo que pasa en la segunda para en todos los casos tratar de evitar que cosa.",
        "start": 2444.82,
        "end": 2454.82
    },
    {
        "text": " Salirse de adarango.",
        "start": 2454.82,
        "end": 2456.82
    },
    {
        "text": " Ok? Bueno, se entendió, es más o menos lo que estoy viendo igual uno que en vez de preguntar por menor, preguntó por mayor o por mayor igual y diobelta pero son todas las soluciones equivalentes.",
        "start": 2457.82,
        "end": 2469.82
    },
    {
        "text": " Bueno, siempre que tengan que hacer cualquier tipo de buz queda, asegúrense que sea con el esquema de buz queda con guay.",
        "start": 2471.82,
        "end": 2480.82
    },
    {
        "text": " ¿De acuerdo?",
        "start": 2481.82,
        "end": 2482.82
    },
    {
        "text": " ¿Más preguntas esto?",
        "start": 2483.82,
        "end": 2485.82
    },
    {
        "text": " Vamos a ver un poco más de teorico ahora.",
        "start": 2486.82,
        "end": 2489.82
    },
    {
        "text": " Una reglo multidimensional es una reglo que tiene dos o más dimensiones.",
        "start": 2491.82,
        "end": 2497.82
    },
    {
        "text": " Puede tener dos, tres, cuatro, cinco las que sean.",
        "start": 2498.82,
        "end": 2501.82
    },
    {
        "text": " En la práctica y en el curso de programación uno raro a ver trabajaremos con alguna reglo que tenga más de tres dimensiones.",
        "start": 2501.82,
        "end": 2508.82
    },
    {
        "text": " Puede considerarse como arreglos de arreglos o bien como arreglos con un índice múltiples.",
        "start": 2510.82,
        "end": 2517.82
    },
    {
        "text": " Son dos maneras distintas de ver la misma cosa.",
        "start": 2517.82,
        "end": 2520.82
    },
    {
        "text": " Ustedes vean lo de la manera que les quede más cómodo.",
        "start": 2520.82,
        "end": 2523.82
    },
    {
        "text": " A los arreglos bidimensionales, a los que tienen dos dimensiones, también se le llama matrices.",
        "start": 2525.82,
        "end": 2532.82
    },
    {
        "text": " Y lo de las dos dimensiones, si quieren lo pueden empezar hasta en un sentido gemétrico, tenemos filas y tenemos columnas.",
        "start": 2533.82,
        "end": 2540.82
    },
    {
        "text": " La matrices una cuadrícula.",
        "start": 2541.82,
        "end": 2543.82
    },
    {
        "text": " Por ejemplo, tenemos tres tipos de datos que corresponden a arreglos multidimensionales.",
        "start": 2545.82,
        "end": 2553.82
    },
    {
        "text": " El primero de ellos se llama nombre y es un arreglo y miren cómo se definen los rangos.",
        "start": 2554.82,
        "end": 2560.82
    },
    {
        "text": " Rango para las filas, coma, rango para las columnas.",
        "start": 2561.82,
        "end": 2565.82
    },
    {
        "text": " Y después ponemos al igual que en los arreglos de una dimensión la palabra OF y el tipo de lo que vamos a guardar en las celdas.",
        "start": 2567.82,
        "end": 2574.82
    },
    {
        "text": " Para los índices valen las mismas consideraciones que valen para los arreglos de una sola dimensión.",
        "start": 2578.82,
        "end": 2585.82
    },
    {
        "text": " Puede ser de cualquier tipo como.",
        "start": 2586.82,
        "end": 2588.82
    },
    {
        "text": " Ordinal.",
        "start": 2590.82,
        "end": 2591.82
    },
    {
        "text": " ¿Cuáles eran los tipos ordinales?",
        "start": 2593.82,
        "end": 2595.82
    },
    {
        "text": " Intaller, char, bulian, más adelante, ¿cuál es vamos a ver?",
        "start": 2596.82,
        "end": 2600.82
    },
    {
        "text": " Los enumerados, los subrango necesitan un tipo base ordinal para poderse definir.",
        "start": 2602.82,
        "end": 2608.82
    },
    {
        "text": " Entonces esto me lleva a, por ejemplo, algo que también hemos la clase pasada. Yo podría usar caracteres como índices.",
        "start": 2610.82,
        "end": 2616.82
    },
    {
        "text": " O puedo usar enteros como índices.",
        "start": 2617.82,
        "end": 2621.82
    },
    {
        "text": " Cualquier valor ordinal como índices. Entonces en el tipo datos las filas son de tipo char y las columnas son de tipo intaller.",
        "start": 2622.82,
        "end": 2633.82
    },
    {
        "text": " O sea, los índices de las filas son de tipo char, los índices de las columnas de tipo intaller y en las celdas estamos guardando valores de tipo intaller.",
        "start": 2635.82,
        "end": 2643.82
    },
    {
        "text": " Un tercer tipo llamado tabla.",
        "start": 2646.82,
        "end": 2650.82
    },
    {
        "text": " Nuevamente es un arreglo de dos dimensiones, una matriz, donde los índices de las filas van entre menos 10 y 10 y los índices de las columnas van entre 1 y 15.",
        "start": 2651.82,
        "end": 2662.82
    },
    {
        "text": " O sea, lo único que varía es que en vez de tener una dimensión, tenés dos o tenés tres o las que sean.",
        "start": 2666.82,
        "end": 2672.82
    },
    {
        "text": " Si son dos dimensiones, le llamamos filas y le llamamos columnas.",
        "start": 2673.82,
        "end": 2677.82
    },
    {
        "text": " Como si fueran coordenadas en un sistema de escartesianos. Si fueran tres dimensiones, te lo puedes imaginar como un cubo en tres dimensiones.",
        "start": 2679.82,
        "end": 2687.82
    },
    {
        "text": " Tenés filas, tenés columnas y tenés altura.",
        "start": 2688.82,
        "end": 2690.82
    },
    {
        "text": " Es más, las matrices son ideales para programar juegos de otallas noval. Y no sé si alguna vez no le hemos puesto como tarea.",
        "start": 2692.82,
        "end": 2699.82
    },
    {
        "text": " Y si no, quédale idea pronta para alguna vez.",
        "start": 2700.82,
        "end": 2703.82
    },
    {
        "text": " Más allá de tres dimensiones, repito, es raro que lo sucemos y imaginarte los anivel geométricos si queréis no podés, pero se pueden hacer.",
        "start": 2704.82,
        "end": 2712.82
    },
    {
        "text": " Para el acceso a las celdas, si, bueno, en vez de tener un índice solo, si es una matriz, vas a tener dos índices, índice de fila o índice de columna.",
        "start": 2716.82,
        "end": 2726.82
    },
    {
        "text": " Si es una regla de tres dimensiones, vas a tener tres índices, fila, columna y altura, o sea, tantos índices como dimensiones tengan el matriz.",
        "start": 2727.82,
        "end": 2734.82
    },
    {
        "text": " Entonces, por ejemplo, si a es una matriz, bueno, yo puedo acceder a la fila y columna j de esta manera o más comúnmente poniendo solamente una pareja de corchetes y separando con comas los índices.",
        "start": 2736.82,
        "end": 2751.82
    },
    {
        "text": " Está bien? ¿Se entendió esto? Vamos a ver un exemplito de carga de alguna matriz.",
        "start": 2752.82,
        "end": 2760.82
    },
    {
        "text": " Bueno, vamos a suponer que tenemos los siguientes tipos.",
        "start": 2761.82,
        "end": 2764.82
    },
    {
        "text": " Está...",
        "start": 2765.82,
        "end": 2766.82
    },
    {
        "text": " Vamos a ver el siguiente tipo.",
        "start": 2769.82,
        "end": 2771.82
    },
    {
        "text": " Matriz es un arreglo de filas numeradas de 1 a m, columnas numeradas de 1 a n.",
        "start": 2778.82,
        "end": 2792.82
    },
    {
        "text": " Y es una matriz de elementos de tipo índice.",
        "start": 2795.82,
        "end": 2799.82
    },
    {
        "text": " Tenemos una variable, ya vemos la m de tipo matriz.",
        "start": 2806.82,
        "end": 2813.82
    },
    {
        "text": " Bueno, y lo que queremos hacer ahora dentro de lo que sería el bloque principal del programa es realizar la carga por teclado de la matriz.",
        "start": 2814.82,
        "end": 2831.82
    },
    {
        "text": " Ir cargando posiciona posición.",
        "start": 2832.82,
        "end": 2835.82
    },
    {
        "text": " Entonces, la misma pregunta que nos teníamos que hacer para el caso de una dimensión, también nos la tenemos que hacer para el caso de dos dimensiones.",
        "start": 2838.82,
        "end": 2846.82
    },
    {
        "text": " Pero es como la pregunta multiplicada por 2.",
        "start": 2846.82,
        "end": 2850.82
    },
    {
        "text": " A ver, la carga de la matriz por teclado implica una recorrida completa.",
        "start": 2852.82,
        "end": 2857.82
    },
    {
        "text": " Sí, debo necesariamente recorrer todas las celdas para inicializarlas.",
        "start": 2858.82,
        "end": 2863.82
    },
    {
        "text": " Bueno, sí, la estructura para recorrer todo, cual dijimos que era.",
        "start": 2865.82,
        "end": 2869.82
    },
    {
        "text": " For, acá cuántos forbamos a necesitar.",
        "start": 2869.82,
        "end": 2872.82
    },
    {
        "text": " 2, 1 para filas y otro para columnas.",
        "start": 2873.82,
        "end": 2877.82
    },
    {
        "text": " Si fuera una búsqueda lo que estamos haciendo que necesitaríamos.",
        "start": 2878.82,
        "end": 2883.82
    },
    {
        "text": " 2, 1 para filas y otro para columnas.",
        "start": 2884.82,
        "end": 2889.82
    },
    {
        "text": " O sea, que el mismo tipo de pregunta de recorrida completa o de búsqueda se sigue aplicando.",
        "start": 2890.82,
        "end": 2897.82
    },
    {
        "text": " Aumentan las combinaciones posibles.",
        "start": 2898.82,
        "end": 2901.82
    },
    {
        "text": " Porque puede haber, por ejemplo, algún problema en el cual tengas que hacer for para las filas, porque las filas las tenés que recorrer todas,",
        "start": 2902.82,
        "end": 2910.82
    },
    {
        "text": " pero en las columnas querés hacer una búsqueda.",
        "start": 2911.82,
        "end": 2913.82
    },
    {
        "text": " O sea, que te quedaría un for combinado con un y.",
        "start": 2914.82,
        "end": 2916.82
    },
    {
        "text": " Uno tiene que empezar a analizar toda esa casúística de posibilidades.",
        "start": 2917.82,
        "end": 2921.82
    },
    {
        "text": " Pero el concepto es el mismo, razonar ante cada problema concreto, es, es una recorrida completa,",
        "start": 2923.82,
        "end": 2928.82
    },
    {
        "text": " no es una recorrida completa, es una búsqueda, es una recorrida completa en filas y es una búsqueda por columnas.",
        "start": 2928.82,
        "end": 2935.82
    },
    {
        "text": " Siempre reflexionar sobre eso porque por qué eso es lo que te va a permitir elegir las estructuras adecuadas.",
        "start": 2936.82,
        "end": 2941.82
    },
    {
        "text": " Bueno, vamos a usar dos índices.",
        "start": 2945.82,
        "end": 2948.82
    },
    {
        "text": " Sí.",
        "start": 2948.82,
        "end": 2950.82
    },
    {
        "text": " Hijo ta va desde uno hasta n.",
        "start": 2957.82,
        "end": 2960.82
    },
    {
        "text": " Está todo dentro de bar. Le pase que lo puse todo en el mismo ronglón. Son variables.",
        "start": 2965.82,
        "end": 2969.82
    },
    {
        "text": " ¿Cómo perdón?",
        "start": 2974.82,
        "end": 2975.82
    },
    {
        "text": " Claro, lo que hice fue definir el rango de manera anónica, no lo declaré mediante la palabra Tipe.",
        "start": 2976.82,
        "end": 2981.82
    },
    {
        "text": " Si querés dar algún nombre le pones la palabra Tipe arriba, los rango si te las declaras así.",
        "start": 2982.82,
        "end": 2986.82
    },
    {
        "text": " La idea más allá de la declaración podríamos usar índice si quieren, es que este sea para filas y este sea para columnas.",
        "start": 2988.82,
        "end": 2996.82
    },
    {
        "text": " Bueno, vamos a iniciar la doble recorrida para cargar las celdas con valores.",
        "start": 2998.82,
        "end": 3002.82
    },
    {
        "text": " ¿Cómo hacemos eso?",
        "start": 3003.82,
        "end": 3005.82
    },
    {
        "text": " For para las filas.",
        "start": 3008.82,
        "end": 3009.82
    },
    {
        "text": " Entonces, for y variando desde uno hasta cuando hasta m.",
        "start": 3012.82,
        "end": 3022.82
    },
    {
        "text": " Para í desde uno hasta m du y dentro de este for,",
        "start": 3024.82,
        "end": 3030.82
    },
    {
        "text": " vamos a colocar otro for.",
        "start": 3031.82,
        "end": 3033.82
    },
    {
        "text": " Ese otro for va a tener como variable de control la j, que j va a ir desde uno hasta n, que es la otra constante.",
        "start": 3035.82,
        "end": 3049.82
    },
    {
        "text": " Y dentro del segundo for que hacemos la lectura.",
        "start": 3052.82,
        "end": 3057.82
    },
    {
        "text": " Ridd orridd line, dependiendo si quieren poner uno por línea o no, no me quita el sueño.",
        "start": 3058.82,
        "end": 3064.82
    },
    {
        "text": " Y acá tenemos que acceder a qué.",
        "start": 3065.82,
        "end": 3068.82
    },
    {
        "text": " La matriz m en donde, en la fila y en la columna j.",
        "start": 3071.82,
        "end": 3077.82
    },
    {
        "text": " Vamos a imaginarnos que m vale 3 y que n vale 4.",
        "start": 3078.82,
        "end": 3088.82
    },
    {
        "text": " Entonces, si queremos dibujarla la matriz, tendríamos algo así.",
        "start": 3091.82,
        "end": 3095.82
    },
    {
        "text": " Fila 1, fila 2, fila 3 y 4 columnas.",
        "start": 3096.82,
        "end": 3101.82
    },
    {
        "text": " La 1, la 2, la 3 y la 4.",
        "start": 3102.82,
        "end": 3106.82
    },
    {
        "text": " Úndices para las filas, índices para las columnas.",
        "start": 3110.82,
        "end": 3114.82
    },
    {
        "text": " Estamos imaginando que el valor de m es 3 y el valor de n es 4.",
        "start": 3116.82,
        "end": 3120.82
    },
    {
        "text": " Bueno, entonces, ¿cómo es el jueguito de este del doble for?",
        "start": 3121.82,
        "end": 3126.82
    },
    {
        "text": " Arrancamos con la í, empezando en uno.",
        "start": 3129.82,
        "end": 3131.82
    },
    {
        "text": " O sea, me paro acá, en la fila 1.",
        "start": 3132.82,
        "end": 3136.82
    },
    {
        "text": " Y estándola í, valiendo 1, se va a ejecutar todo el for interior.",
        "start": 3137.82,
        "end": 3143.82
    },
    {
        "text": " O sea, con la í, es como que quedó momentáneamente congelada en uno.",
        "start": 3145.82,
        "end": 3148.82
    },
    {
        "text": " Empieza a ejecutarse el for de adentro.",
        "start": 3149.82,
        "end": 3151.82
    },
    {
        "text": " J tothomalvallor 1 y ponemos un valor por teclado.",
        "start": 3152.82,
        "end": 3155.82
    },
    {
        "text": " J tothomalvallor 2 y ponemos otro valor.",
        "start": 3155.82,
        "end": 3157.82
    },
    {
        "text": " J tothomalvallor 3 y ponemos otro valor.",
        "start": 3158.82,
        "end": 3160.82
    },
    {
        "text": " J tothomalvallor 4 y ponemos otro valor.",
        "start": 3161.82,
        "end": 3163.82
    },
    {
        "text": " Acaba de finalizar el for interior.",
        "start": 3165.82,
        "end": 3169.82
    },
    {
        "text": " Recíen en ese momento que ocurre.",
        "start": 3170.82,
        "end": 3172.82
    },
    {
        "text": " La ejecución se traslada nuevamente al siguiente valor en el for interior.",
        "start": 3173.82,
        "end": 3178.82
    },
    {
        "text": " O sea, hice todo esto y vuelvo al for de arriba con iba aliendo 2.",
        "start": 3179.82,
        "end": 3184.82
    },
    {
        "text": " Con iba aliendo 2 se reinicia al for interior.",
        "start": 3186.82,
        "end": 3189.82
    },
    {
        "text": " J empieza de nuevo en uno.",
        "start": 3190.82,
        "end": 3192.82
    },
    {
        "text": " Y así, voy a cargar un valor en todas las celdas de la segunda fila.",
        "start": 3193.82,
        "end": 3196.82
    },
    {
        "text": " Y cuando termine, la í va a pasar a la fila 3 y otro valor.",
        "start": 3197.82,
        "end": 3201.82
    },
    {
        "text": " Y otra vez se va a ejecutar todo el for interior.",
        "start": 3202.82,
        "end": 3205.82
    },
    {
        "text": " O sea, la complejidad en el manejo de reglos de 2 o más dimensiones",
        "start": 3208.82,
        "end": 3211.82
    },
    {
        "text": " no es mucho mayor que la complejidad del manejo de reglos de una sola dimensión",
        "start": 3212.82,
        "end": 3216.82
    },
    {
        "text": " es como razonarlo mismo pero en 2 dimensiones.",
        "start": 3217.82,
        "end": 3220.82
    },
    {
        "text": " ¿Se entendió este ejemplo?",
        "start": 3223.82,
        "end": 3225.82
    },
    {
        "text": " Sí. Abar.",
        "start": 3226.82,
        "end": 3227.82
    },
    {
        "text": " Podría jota ahí.",
        "start": 3233.82,
        "end": 3235.82
    },
    {
        "text": " O sea, si quisieras ir locargando verticalmente, en vez de horizontalmente,",
        "start": 3236.82,
        "end": 3239.82
    },
    {
        "text": " va a aguerta a los índices. No hay problema.",
        "start": 3240.82,
        "end": 3242.82
    },
    {
        "text": " Eso también es parte de ambos cuando te enfrentas un problema de matrices",
        "start": 3243.82,
        "end": 3245.82
    },
    {
        "text": " vez de que manera te conviene hacer la recorrida, no tiene por que ser siempre primero por filas",
        "start": 3246.82,
        "end": 3249.82
    },
    {
        "text": " y después por volumna, puede ser las revés.",
        "start": 3250.82,
        "end": 3252.82
    },
    {
        "text": " Volve a buscar la vuelta que sea. Podría ser empezar por ejemplo por la última e ir bajando.",
        "start": 3256.82,
        "end": 3260.82
    },
    {
        "text": " O sea, las combinaciones son múltiples.",
        "start": 3262.82,
        "end": 3264.82
    },
    {
        "text": " El importante es primero definir la estructura a usar.",
        "start": 3265.82,
        "end": 3268.82
    },
    {
        "text": " Sondo 4, Sondo y Wild es un forgo lung Wild, primero fijar eso.",
        "start": 3269.82,
        "end": 3272.82
    },
    {
        "text": " Después ves cómo manejas los índices y si quiere decir así o si quiere decir así.",
        "start": 3273.82,
        "end": 3277.82
    },
    {
        "text": " ¿Más preguntas de esto?",
        "start": 3282.82,
        "end": 3283.82
    },
    {
        "text": " Bueno, vamos a hacer otro poco de práctico ahora.",
        "start": 3285.82,
        "end": 3287.82
    },
    {
        "text": " Bueno, vamos a trabajar ahora en el ejercicio 8, lindo ejercicio.",
        "start": 3289.82,
        "end": 3295.82
    },
    {
        "text": " Dice así, la respuesta de una reglo bidimensional cuadrado,",
        "start": 3297.82,
        "end": 3301.82
    },
    {
        "text": " o sea, la respuesta de una matriz cuadrada,",
        "start": 3302.82,
        "end": 3304.82
    },
    {
        "text": " es otra matriz, otro reglo bidimensional, cuyos componentes satifacen la relación",
        "start": 3305.82,
        "end": 3312.82
    },
    {
        "text": " que es lo que están las posiciones y jdb,",
        "start": 3312.82,
        "end": 3315.82
    },
    {
        "text": " es igual a lo que están las posiciones jidea.",
        "start": 3316.82,
        "end": 3318.82
    },
    {
        "text": " O sea, se intercambian filas por columnas.",
        "start": 3320.82,
        "end": 3322.82
    },
    {
        "text": " Si no recuerdo mal es la misma definición de transpuesta que ven en álgebra, ¿no?",
        "start": 3323.82,
        "end": 3326.82
    },
    {
        "text": " Bueno, entonces el ejercicio les pide escribir un programa que carri una matriz A por teclado",
        "start": 3328.82,
        "end": 3333.82
    },
    {
        "text": " y una vez que cargó la matriz A, generé la matriz transpuesta B",
        "start": 3334.82,
        "end": 3338.82
    },
    {
        "text": " y que después emita B por pantalla.",
        "start": 3339.82,
        "end": 3341.82
    },
    {
        "text": " Se entendió la consina.",
        "start": 3344.82,
        "end": 3346.82
    },
    {
        "text": " Una vez que lo hayan hecho,",
        "start": 3347.82,
        "end": 3348.82
    },
    {
        "text": " acá en Negrita se les propone una variante pero que la tienen que hacer después.",
        "start": 3350.82,
        "end": 3354.82
    },
    {
        "text": " Es, en vez de generar otra matriz B con la transpuesta,",
        "start": 3355.82,
        "end": 3358.82
    },
    {
        "text": " hagan la transpuesta sobre la propia, o sea, transformena en su propia transpuesta.",
        "start": 3359.82,
        "end": 3363.82
    },
    {
        "text": " No, no, no, no, la idea es primero la guardas como bien y después la transpones.",
        "start": 3364.82,
        "end": 3370.82
    },
    {
        "text": " Es una matriz cuadrada de tamaño N por N.",
        "start": 3371.82,
        "end": 3373.82
    },
    {
        "text": " Bueno, lo mismo.",
        "start": 3375.82,
        "end": 3376.82
    },
    {
        "text": " Razonar las estructuras necesarias debo recorrer todo, no debo recorrer todo.",
        "start": 3377.82,
        "end": 3381.82
    },
    {
        "text": " Está bien.",
        "start": 3382.82,
        "end": 3383.82
    },
    {
        "text": " Trabajan en este ejercicio y me van consultando.",
        "start": 3384.82,
        "end": 3386.82
    },
    {
        "text": " No vamos a hacer puesta punto de este, el resto de la clase es para que ustedes trabajen,",
        "start": 3388.82,
        "end": 3391.82
    },
    {
        "text": " me muestren y vuelodudas de cualquier otro ejercicio que tengo.",
        "start": 3391.82,
        "end": 3394.82
    },
    {
        "text": " Ya se puede ser todo el práctico.",
        "start": 3395.82,
        "end": 3397.82
    },
    {
        "text": " ¿Ok?",
        "start": 3398.82,
        "end": 3399.82
    },
    {
        "text": " Bueno, seguimos.",
        "start": 3400.82,
        "end": 3401.82
    }
]