[
    {
        "text": " Ahora sí, arrancamos a grabar.",
        "start": 0.0,
        "end": 5.0
    },
    {
        "text": " Les quiero mostrar un poquito esto, esto va a enlobar a tener colgado ya desde",
        "start": 23.0,
        "end": 26.96
    },
    {
        "text": " fines de semana. Son los diferentes puntos que fuimos viendo en las clases,",
        "start": 26.96,
        "end": 32.96
    },
    {
        "text": " introducción a la administración, que fueron las primeras clases, también de cultura,",
        "start": 32.96,
        "end": 37.96
    },
    {
        "text": " a administración en de global y van a tener todos los tomos de robins para que",
        "start": 37.96,
        "end": 45.68
    },
    {
        "text": " lo puedan repasar. Otro comentario que les quiero hacer, porque bueno me volvieron a",
        "start": 45.68,
        "end": 53.120000000000005
    },
    {
        "text": " hacer consultas sobre ese tema. Lo que tienen allí las diapositivas, les sirve para,",
        "start": 53.12,
        "end": 59.12
    },
    {
        "text": " obviamente, un repaso como guía de las clases, pero estudiando solo eso no se nos",
        "start": 59.12,
        "end": 66.32
    },
    {
        "text": " aprueba. Tienen que leer el documento del tom. Eso es algo fundamental con respecto a eso.",
        "start": 66.32,
        "end": 76.12
    },
    {
        "text": " Algunas duras, recuerden que es virtual y con cámara. Cámara aprendida durante toda la duración",
        "start": 76.12,
        "end": 86.12
    },
    {
        "text": " de la prueba.",
        "start": 86.12,
        "end": 96.12
    },
    {
        "text": " Chequeamos, es el que está disponible en la página web, pero me puedo fijar y confirmarles.",
        "start": 97.12,
        "end": 104.12
    },
    {
        "text": " Algunos otra consulta.",
        "start": 109.12,
        "end": 111.12
    },
    {
        "text": " Bueno, vamos a ver algunos, si no hay más consulta, vamos a ver algunos temas, vamos a seguir con",
        "start": 117.12,
        "end": 123.12
    },
    {
        "text": " estrategia.",
        "start": 123.12,
        "end": 125.12
    },
    {
        "text": " Bueno, algunos puntos que es importante",
        "start": 125.12,
        "end": 154.12
    },
    {
        "text": " que se importan de repasar de lo que vimos la clase pasada. Por un lado, recuerden que realizamos",
        "start": 154.12,
        "end": 161.12
    },
    {
        "text": " el análisis externo basados en las fuerzas competitivas planteadas por Porter. Vimos que habían",
        "start": 161.12,
        "end": 167.12
    },
    {
        "text": " cinco fuerzas competitivas, la existencia de competencia potencial, que es la amenaza de",
        "start": 167.12,
        "end": 173.12
    },
    {
        "text": " nuevos signos de sus sectores, todo el tema de los compradores, verdad y el poder de negociación",
        "start": 173.12,
        "end": 179.12
    },
    {
        "text": " que esos compradores tienen, los sustitutos, la posibilidad de que se compre productos similares al mío,",
        "start": 179.12,
        "end": 187.12
    },
    {
        "text": " cofrezcan la misma función, el tema de los proveores como Mabastesco y por otro lado,",
        "start": 187.12,
        "end": 196.12
    },
    {
        "text": " todo lo que es la rivalidad actual dentro de la realización. Esto es importante que hagan el",
        "start": 196.12,
        "end": 203.12
    },
    {
        "text": " análisis dentro de las empresas que ustedes están o el día mañana cuando trabajen o cuando tengan su",
        "start": 203.12,
        "end": 209.12
    },
    {
        "text": " propio emprendimiento y que identifiquen correctamente cada una de esas partes y en base a la situación",
        "start": 209.12,
        "end": 216.12
    },
    {
        "text": " para qué hacemos esto, o sea para qué buscamos todos estos elementos y analizamos el poder de negociación.",
        "start": 216.12,
        "end": 223.12
    },
    {
        "text": " Para ver si tenemos que alterar algo afecto justamente, fortalecer mi empresa antes a situaciones",
        "start": 223.12,
        "end": 232.12
    },
    {
        "text": " del nivel de a nivel externo que pueden llegar a perjudicar. Por ejemplo, con respecto a los proveedores,",
        "start": 232.12,
        "end": 239.12
    },
    {
        "text": " si yo veo que tengo demasiado concentrado mis proveedores, está bueno realizar, por ejemplo,",
        "start": 239.12,
        "end": 245.12
    },
    {
        "text": " los rondas de negocios para poder conseguir otros proveedores en caso de los proveedores que tengo no cumplan.",
        "start": 245.12,
        "end": 254.12
    },
    {
        "text": " Tener como decimos a veces esos planes B, esas situaciones de contingencia. Con respecto a los compraores,",
        "start": 254.12,
        "end": 262.12
    },
    {
        "text": " el poder analizar quienes son mis compraores, por ejemplo, si luego del análisis,",
        "start": 262.12,
        "end": 268.12
    },
    {
        "text": " si vamos a la conclusión de que tenemos un comprador que nos compra 60% de nuestras ventas,",
        "start": 268.12,
        "end": 275.12
    },
    {
        "text": " bueno, eso nos va a permitir poder analizar mejor, ¿verdad?",
        "start": 275.12,
        "end": 284.12
    },
    {
        "text": " Y tratar de atender muy bien ese cliente o buscar nuevos clientes para que el porcentaje de concentración no sea tan alto.",
        "start": 284.12,
        "end": 294.12
    },
    {
        "text": " Muchas empresas le sucede que tienen clientes con una alta participación de lo que es la vacunación",
        "start": 294.12,
        "end": 302.12
    },
    {
        "text": " y no significa que sea malo, sino que bueno, tengo que prestar atención de que si uno de esos clientes se llega a retirar,",
        "start": 302.12,
        "end": 309.12
    },
    {
        "text": " seguramente complique todo lo que es mi estructura de costos, entonces no sé cómo lo voy a manejar,",
        "start": 309.12,
        "end": 316.12
    },
    {
        "text": " qué costos tengo fijo, qué costos tengo variables, en el que son aspectos también muy significativos para poder procesar.",
        "start": 316.12,
        "end": 327.12
    },
    {
        "text": " Luego tenemos, bueno, todo el tema de la riberidad existente, o sea, cuantos competidores son,",
        "start": 327.12,
        "end": 333.12
    },
    {
        "text": " esto también nos sirve para analizar cuando vamos a ingresar a un negocio.",
        "start": 333.12,
        "end": 337.12
    },
    {
        "text": " Cuando decimos, bueno, vamos a poner un restaurante en esta cuadra, bueno, cuantos restaurantes hay ya instalados,",
        "start": 337.12,
        "end": 345.12
    },
    {
        "text": " qué tan alta es la competitividad, ¿por qué eso va a influir mucho en los precios?",
        "start": 345.12,
        "end": 353.12
    },
    {
        "text": " También hay otros que dicen, bueno, en realidad está bueno que haya otros, porque eso le da movimiento al sector y en realidad,",
        "start": 353.12,
        "end": 364.12
    },
    {
        "text": " si lo que se va a buscar es algo diferente, algo que distinge, que no haya competitivo con el resto,",
        "start": 364.12,
        "end": 370.12
    },
    {
        "text": " la rivalidad no va a ser tan trascendente. Así que bueno, un poco estas son las fuerzas competitivas, y un tema que,",
        "start": 370.12,
        "end": 378.12
    },
    {
        "text": " que si bien lo mencionamos, la clase pasada está bueno hacer énfasis, es en el tema del papel de la ventaja competitiva.",
        "start": 378.12,
        "end": 388.12
    },
    {
        "text": " Nosotros hablamos de la importancia de la ventaja competitiva, pero está bueno que lo recuerden que es aquello que distinge a una organización respecto a todas las demás,",
        "start": 388.12,
        "end": 399.12
    },
    {
        "text": " lo que termina siendo el sello distintivo, podemos decir que es aquello que hace bien la empresa, aquello que la destaca,",
        "start": 399.12,
        "end": 407.12
    },
    {
        "text": " entonces el ejemplo que a veces damos en las clases, es tratar de pensar rápidamente los productos que uno compra habitualmente o los servicios que uno quiere habitualmente,",
        "start": 408.12,
        "end": 423.12
    },
    {
        "text": " y pensar bueno, ¿qué es lo que nosotros valoramos de ese producto o ese servicio?",
        "start": 423.12,
        "end": 430.12
    },
    {
        "text": " Y cuando nosotros empezamos a analizar, allí nos damos cuenta que es lo que distinge, o sea, ¿por qué nosotros compramos una chaqueta en un lugar y no lo otro?",
        "start": 430.12,
        "end": 439.12
    },
    {
        "text": " Bueno, ¿cuál es la ventaja competitiva? ¿Qué hace bien esa empresa para que número de personas compren allí?",
        "start": 439.12,
        "end": 448.12
    },
    {
        "text": " Entonces es fundamental que las empresas logren tener una ventaja competitiva.",
        "start": 448.12,
        "end": 454.12
    },
    {
        "text": " Todo esto está en marzo dentro de lo que vimos la clase pasada que era el proceso de Administraciones Trategas,",
        "start": 455.12,
        "end": 462.12
    },
    {
        "text": " donde nosotros identificábamos la misión, los objetivos, recuerdan que incluso buscaron en las páginas web diferentes definiciones de misión, las vimos juntos,",
        "start": 462.12,
        "end": 477.12
    },
    {
        "text": " luego las otras clases también hicimos el tema de la matriz Foda, recuerdan con qué es caso práctico vimos la matriz.",
        "start": 478.12,
        "end": 486.12
    },
    {
        "text": " ¿Sacuardan de qué se trataba?",
        "start": 492.12,
        "end": 494.12
    },
    {
        "text": " ¿No? ¿No hay allí por el chat?",
        "start": 495.12,
        "end": 508.12
    },
    {
        "text": " Exacto, una empresa se dedicaba al reciclaje y, bueno, fimos viendo todos los aspectos sintamos de la empresa,",
        "start": 508.12,
        "end": 517.12
    },
    {
        "text": " la empresa se había en sus características innovadoras y su capacidad para lo que era la producción",
        "start": 518.12,
        "end": 525.12
    },
    {
        "text": " y también vimos las debilidades, los temas logísticos que tenían y vimos aspectos del exterior,",
        "start": 525.12,
        "end": 532.12
    },
    {
        "text": " el deseo que había de hacer justamente esa reciclaje, la oportunidad que tenía de hacer acuerdos con otras indendencias,",
        "start": 532.12,
        "end": 542.12
    },
    {
        "text": " así que bueno, eso un poquito lo vimos con ese ejemplo.",
        "start": 542.12,
        "end": 546.12
    },
    {
        "text": " Luego viene la formulación de las estrategias que la clase pasábimos a un autor que se acuerdan que era portar,",
        "start": 547.12,
        "end": 554.12
    },
    {
        "text": " dijimos que dividía en diferenciación y costos, dijimos que diferenciación, lo que buscaban justamente era distinguirse,",
        "start": 554.12,
        "end": 564.12
    },
    {
        "text": " buscaba tener una diferencia con respecto al resto,",
        "start": 564.12,
        "end": 570.12
    },
    {
        "text": " es recordar que algo que lo científica muy innovadores con esas diferencias y luego dijimos que estaban los otros que era más basado en costos,",
        "start": 570.12,
        "end": 579.12
    },
    {
        "text": " que lo que buscaba justamente era como para dar lo dice un mejor manejo de los costos.",
        "start": 579.12,
        "end": 586.12
    },
    {
        "text": " Ahora vamos a ver algunas estrategias más recientes para que analicemos, un poquito hablamos también del comercio electrónico y al rol",
        "start": 586.12,
        "end": 596.12
    },
    {
        "text": " que tienen que va cumplir en las empresas últimamente.",
        "start": 596.12,
        "end": 600.12
    },
    {
        "text": " Luego viene la parte de implementación de la estrategia que es justamente la puesta en práctica de esa estrategia",
        "start": 600.12,
        "end": 611.12
    },
    {
        "text": " y luego tenemos la evaluación de los resultados.",
        "start": 611.12,
        "end": 616.12
    },
    {
        "text": " Algunas dudas acá?",
        "start": 617.12,
        "end": 620.12
    },
    {
        "text": " Un ejemplo interesante que les da el libro, no sé si ustedes recuerdan la evolución que hemos tenido con los celulares,",
        "start": 624.12,
        "end": 635.12
    },
    {
        "text": " o sea cuando en mi caso cuando era más chica, las marcas más conocidas no eran las de hoy,",
        "start": 635.12,
        "end": 643.12
    },
    {
        "text": " o sea hay forma estaba tan posicionada en el marcado, estaba no queía muy impuesto, motorola con un modelo que se doblaba",
        "start": 643.12,
        "end": 654.12
    },
    {
        "text": " y esos eran los modelos.",
        "start": 654.12,
        "end": 657.12
    },
    {
        "text": " La simpoco bueno en el libro justamente en la disión 2014, que es la 12,",
        "start": 657.12,
        "end": 663.12
    },
    {
        "text": " allí les da el ejemplo de la empresa finlandesa que se había posicionado como el fabricante líder,",
        "start": 663.12,
        "end": 672.12
    },
    {
        "text": " había dejado incluso atrás a motorola y como iPhone de Apple logra desplazarlo.",
        "start": 672.12,
        "end": 680.12
    },
    {
        "text": " Y bueno evidentemente la estrategia que llevó adelante a iPhone logró posicionarlo correctamente",
        "start": 680.12,
        "end": 687.12
    },
    {
        "text": " y les parece que fue un caso de diferenciación o costos.",
        "start": 687.12,
        "end": 692.12
    },
    {
        "text": " ¿Qué les parece?",
        "start": 693.12,
        "end": 700.12
    },
    {
        "text": " Bueno para allí se han diferenciación.",
        "start": 706.12,
        "end": 709.12
    },
    {
        "text": " Yo coincido con ustedes que fue una estrategia basada en diferenciación,",
        "start": 710.12,
        "end": 718.12
    },
    {
        "text": " más con un buen equipo de técnicos creativos y no adores, y hicieron algo que se distingue del resto",
        "start": 718.12,
        "end": 729.12
    },
    {
        "text": " y obviamente que tiene un precio generalmente más elevado que otros celulares y sin embargo las personas",
        "start": 729.12,
        "end": 736.12
    },
    {
        "text": " tienden a consumirlo de todas.",
        "start": 736.12,
        "end": 742.12
    },
    {
        "text": " Alguna duda hasta acá.",
        "start": 743.12,
        "end": 750.12
    },
    {
        "text": " Por allí en el libro Panantan una parte que habla de las estrategias organizacionales importantes en el entorno actual.",
        "start": 754.12,
        "end": 761.12
    },
    {
        "text": " Cuando hablamos del entorno actual hablamos un entorno con características de que cada vez estamos más laborizados,",
        "start": 762.12,
        "end": 766.12
    },
    {
        "text": " que cada vez estamos en entornos más competitivos, cambiantes, dinámicos, todas las características",
        "start": 766.12,
        "end": 773.12
    },
    {
        "text": " que tenemos hoy en día, tecnológicos también.",
        "start": 773.12,
        "end": 776.12
    },
    {
        "text": " Bueno teniendo en cuenta todas esas características es que estas estrategias se empiezan a tener gran importancia.",
        "start": 776.12,
        "end": 785.12
    },
    {
        "text": " Una es la estrategia de comercio electrónico que vimos la clase pasada.",
        "start": 786.12,
        "end": 790.12
    },
    {
        "text": " Recuerdan que la clase pasada hablamos de la importancia de las empresas de tener una estrategia comocio electrónico,",
        "start": 790.12,
        "end": 796.12
    },
    {
        "text": " de tener software amigable para esos fines, una página web que sea clara, que sea entendible, que sea amigable,",
        "start": 796.12,
        "end": 803.12
    },
    {
        "text": " que tenga buenas medidas de seguridad.",
        "start": 803.12,
        "end": 807.12
    },
    {
        "text": " Vimos también la importancia de que el esto se actualice al mismo tiempo.",
        "start": 807.12,
        "end": 814.12
    },
    {
        "text": " Hablamos también de la evolución que han tenido las empresas uruallas, contamos que en un principio estaba muy en modo",
        "start": 814.12,
        "end": 821.12
    },
    {
        "text": " a lo que eran los catálogos digitales y que luego se empezó con el sistema en el que uno podía hacer la transacción dentro de la página web.",
        "start": 821.12,
        "end": 833.12
    },
    {
        "text": " Ahora cuando uno va a comprar hay mucha información disponible.",
        "start": 833.12,
        "end": 839.12
    },
    {
        "text": " Y esto está muy inculado también a lo que es la toma de decisiones. Cuando van a comprar y lo hacen por ejemplo lo van a hacer por comercio electrónico.",
        "start": 839.12,
        "end": 850.12
    },
    {
        "text": " ¿Entran a varios sitios para comparar precios?",
        "start": 850.12,
        "end": 854.12
    },
    {
        "text": " Sí, yo primero sí.",
        "start": 854.12,
        "end": 857.12
    },
    {
        "text": " ¿Y te ha pasado de notar grandes diferencias o sentís que le hecho de que esté publicado o hace que se tiendan a ajustar?",
        "start": 857.12,
        "end": 866.12
    },
    {
        "text": " Ahí es todo, ¿no?",
        "start": 867.12,
        "end": 869.12
    },
    {
        "text": " Ahí es todo. Pero yo, por ejemplo, utilicé como referencia en mercado libre.",
        "start": 869.12,
        "end": 876.12
    },
    {
        "text": " A partir de ahí, si tengo que entrar otro lado, voy comparando con cosas en mercado libre para... ¿por qué está? Es como mi referencia.",
        "start": 876.12,
        "end": 886.12
    },
    {
        "text": " Exacto. Bueno, creo que la mayoría hacemos eso de entrar a sitios digitales para compararlos los precios",
        "start": 886.12,
        "end": 895.12
    },
    {
        "text": " y bueno, recientemente me sucedió, hay una diferencia muy grande de precio entre un sitio digital y un comercio físico",
        "start": 895.12,
        "end": 902.12
    },
    {
        "text": " y un poco lo que me decía en era que era muy físico en Betil contra una empresa que no tenía una estructura tan grande como lo que tenían ellos,",
        "start": 902.12,
        "end": 911.12
    },
    {
        "text": " de su curso al funcionario, un local de la vista, atención al público, los productos en exposición.",
        "start": 911.12,
        "end": 920.12
    },
    {
        "text": " Muchas veces el comercio electrónico logra, mayor flexibilidad, mejores precios, mejor manejo también de resto,",
        "start": 920.12,
        "end": 930.12
    },
    {
        "text": " que el hecho que esté todo en línea tiene sus ventajas. ¿Alguna dudas?",
        "start": 930.12,
        "end": 937.12
    },
    {
        "text": " Ahora arrancamos con lo que sigue dentro de Robin's plantea estrategias de servicio al cliente.",
        "start": 937.12,
        "end": 951.12
    },
    {
        "text": " ¿Y ahí qué les parece con respecto a las estrategias de servicio al cliente? ¿Qué opinan?",
        "start": 951.12,
        "end": 956.12
    },
    {
        "text": " Les parece que las empresas urbuellas tienen un foco en el cliente. ¿Qué les parece?",
        "start": 956.12,
        "end": 973.12
    },
    {
        "text": " Una pregunta más abierta ¿Qué es tener foco en los clientes? ¿Qué les parece?",
        "start": 974.12,
        "end": 990.12
    },
    {
        "text": " Y algo como lo de cliente siempre tiene razón, pero capaz que...",
        "start": 991.12,
        "end": 999.12
    },
    {
        "text": " No, yo que se pensando, porque reyano leí lo de Robin, pero si capaz que viene por ahí lo...",
        "start": 999.12,
        "end": 1007.12
    },
    {
        "text": " No sé, hay empresa como que se enfoca, digo, cuidar al cliente en una buena, ¿no? Porque saben que ello depende.",
        "start": 1007.12,
        "end": 1015.12
    },
    {
        "text": " Entonces, como que está, tienen también como hacia el cliente como una serie de tensiones",
        "start": 1015.12,
        "end": 1022.12
    },
    {
        "text": " que... que yo que se capaz que...",
        "start": 1022.12,
        "end": 1027.12
    },
    {
        "text": " Aseguna se veía o capaz que pequeñas empresas, por ejemplo, pequeñas empresas en el interior,",
        "start": 1027.12,
        "end": 1037.12
    },
    {
        "text": " y además que sí que se focaban también por considerar ni edad o cosas así,",
        "start": 1037.12,
        "end": 1042.12
    },
    {
        "text": " en los clientes que conocían también, también depende mucho de eso,",
        "start": 1042.12,
        "end": 1046.12
    },
    {
        "text": " si los clientes son como conocidos o algo por el estilo.",
        "start": 1046.12,
        "end": 1050.12
    },
    {
        "text": " Pero pasa cuando pime, ¿no?",
        "start": 1050.12,
        "end": 1052.12
    },
    {
        "text": " Las pimes justamente en vez de gratisán por eso por tener una tensión más personalizada con sus clientes.",
        "start": 1052.12,
        "end": 1059.12
    },
    {
        "text": " A veces cuando uno va a comprar en grandes superficies, no tiene asesoramiento y en esos locales más pequeños,",
        "start": 1059.12,
        "end": 1071.12
    },
    {
        "text": " se da justamente esa tensión, ese servicio.",
        "start": 1071.12,
        "end": 1075.12
    },
    {
        "text": " ¿Qué es lo que deberíamos de tener en cuenta si tenemos una empresa en la que queremos poner foco en el cliente?",
        "start": 1075.12,
        "end": 1081.12
    },
    {
        "text": " Bueno, teníamos que saber cuáles son sus necesidades, ¿cómo podemos saber cuáles son las necesidades de un cliente?",
        "start": 1081.12,
        "end": 1087.12
    },
    {
        "text": " ¿Qué les parece?",
        "start": 1087.12,
        "end": 1095.12
    },
    {
        "text": " ¿Y el cuesta?",
        "start": 1095.12,
        "end": 1099.12
    },
    {
        "text": " Por ejemplo, si dentro de los locales, incluso hay también aspectos vinculados a la satisfacción del cliente.",
        "start": 1099.12,
        "end": 1110.12
    },
    {
        "text": " Si ustedes han ido, por ejemplo, en algunos hábitats que tienen que marcar al final como ha sido su experiencia,",
        "start": 1110.12,
        "end": 1117.12
    },
    {
        "text": " en algunos locales de ropa, también cuando uno sale tiene que marcar y decir como ha sido su experiencia, ¿les ha pasado?",
        "start": 1117.12,
        "end": 1127.12
    },
    {
        "text": " No, o sea, ¿qué pasa?",
        "start": 1128.12,
        "end": 1137.12
    },
    {
        "text": " No, porque hay algunos locales.",
        "start": 1137.12,
        "end": 1139.12
    },
    {
        "text": " ¿Qué pasa?",
        "start": 1139.12,
        "end": 1140.12
    },
    {
        "text": " Por ejemplo, me ha tocado marcar la opinión después en renter, creo que también a la salida hay unos botoncitos para marcar.",
        "start": 1140.12,
        "end": 1155.12
    },
    {
        "text": " ¿A veces cuando son llamadas a atención telefónica no les pasa que al final les dice que indiquen como fue la atención?",
        "start": 1155.12,
        "end": 1165.12
    },
    {
        "text": " Bueno, eso sí, eso sí, un par de veces.",
        "start": 1165.12,
        "end": 1170.12
    },
    {
        "text": " Ah, bueno, ahí es una forma también de conocer qué es lo que piensa el cliente. ¿Qué otro ejemplo se les ocurre?",
        "start": 1170.12,
        "end": 1181.12
    },
    {
        "text": " Bueno, sí, también ahí cuando yo que se empáginas web, que, bueno, yo que se, esta información le ha servido como que al final te aparece como una cosa así para que va a luz,",
        "start": 1181.12,
        "end": 1193.12
    },
    {
        "text": " sino que tú hiciste entrar hasta ser ahí como si estuvo bien, si te aparecen unas estrellas ahí para que por tú también...",
        "start": 1193.12,
        "end": 1203.12
    },
    {
        "text": " Es exacto, exacto.",
        "start": 1203.12,
        "end": 1206.12
    },
    {
        "text": " Sí, incluso también no sé si les ha pasado, a veces cuando les muestra en cierta publicidad en los canales de video, streaming, porque no sé YouTube,",
        "start": 1206.12,
        "end": 1216.12
    },
    {
        "text": " y les preguntan si ese anuncio era de cuadro para ustedes o no, bueno, entonces cierta media van captando información.",
        "start": 1216.12,
        "end": 1223.12
    },
    {
        "text": " Sí, eso sí.",
        "start": 1223.12,
        "end": 1226.12
    },
    {
        "text": " Pero bueno, es una de las estrategias, ¿no? Enfocarse en el cliente las necesidades del cliente, conocer al cliente, tratar de tomar medidas que sean pro el beneficio de cliente, analizar, cuáles, cuáles, cuáles la sensación del cliente con respecto a mi empresa, si está conforme, si está no está conforme, ¿no?",
        "start": 1227.12,
        "end": 1251.12
    },
    {
        "text": " Y bueno, de esa forma justamente manteniendo una clientela contenta, lograr lo que todas las empresas tienen que lograr, que se acuerdan que cuando vimos el video de porter,",
        "start": 1251.12,
        "end": 1263.12
    },
    {
        "text": " el decía que en definitiva todo lo que queríamos era rentabilidad.",
        "start": 1263.12,
        "end": 1267.12
    },
    {
        "text": " Y bueno, si nosotros logramos que los clientes estén contentos, vamos a mantener una buena facturación y de esa forma vamos a poder llegar a la rentabilidad.",
        "start": 1267.12,
        "end": 1278.12
    },
    {
        "text": " Y este tema de la rentabilidad es muy importante porque yo, o a un cliente lo puedo dejar muy contento si le doy un regalo cada vez que viene a mi local, el tema que quizás al final mi rentabilidad se vea muy disminuida, entonces todo tiene que ser un sano y...",
        "start": 1278.12,
        "end": 1296.12
    },
    {
        "text": " Es un sano y finito.",
        "start": 1296.12,
        "end": 1298.12
    },
    {
        "text": " Exacto, por eso a veces nos dan un caramelito, en las triuquerías que tienen unos caramelitos, entonces siempre tiene que ser en función del gasto, en función de lograr al final ese objetivo básico que tiene la empresa que es la rentabilidad.",
        "start": 1298.12,
        "end": 1319.12
    },
    {
        "text": " Recuerden que las empresas buscan maximizar sus garantías, después vimos el tema de responsabilidad social empresarial que en cierta medida tocaba ese punto de desadición clásico y bueno, lo que dicen los autores que están a favor de la responsabilidad social empresarial y que, al final,",
        "start": 1319.12,
        "end": 1342.12
    },
    {
        "text": " verdad, va a dar su retorno positivo por todo lo que implica con la imagen y el buen mínculo con la empresa con la sociedad.",
        "start": 1342.12,
        "end": 1352.12
    },
    {
        "text": " ¿Algún otro comentario?",
        "start": 1352.12,
        "end": 1356.12
    },
    {
        "text": " Bueno, y el otro punto era las estrategias de innovación, ¿no? ¿Qué empresas les parece que han sido muy innovadoras? A nivel de Uruguay.",
        "start": 1356.12,
        "end": 1369.12
    },
    {
        "text": " Si es que conocen alguna que les parezca que se ha destacado.",
        "start": 1370.12,
        "end": 1376.12
    },
    {
        "text": " A mí, por personalmente he pedido, ya me parece una empresa muy innovadora. ¿Qué opinan?",
        "start": 1389.12,
        "end": 1396.12
    },
    {
        "text": " ¿Pensí de no?",
        "start": 1400.12,
        "end": 1403.12
    },
    {
        "text": " No sé, pero que ahí cuando hace esas preguntas me deja como reficionando muchísimo.",
        "start": 1406.12,
        "end": 1413.12
    },
    {
        "text": " A ver, si pedido ya es bueno, ¿no? Es como que de alguna forma sí, en no bueno, en sentido de, claro, cambió la jugada, cambió la cancha mismo, en muchos aspectos ¿no?",
        "start": 1414.12,
        "end": 1430.12
    },
    {
        "text": " Eso de...",
        "start": 1430.12,
        "end": 1431.12
    },
    {
        "text": " Sí, antes nosotros no compravamos de esa forma.",
        "start": 1431.12,
        "end": 1434.12
    },
    {
        "text": " No, absolutamente, claro.",
        "start": 1434.12,
        "end": 1437.12
    },
    {
        "text": " Detectaron una necesidad que quizás ni siquiera sabíamos que la teníamos, porque bueno, estamos acostumbrados a ir al restaurante y comprar y generaron algo que fue completamente nuevo para lo que era Uruguay y que terminó funcionando.",
        "start": 1438.12,
        "end": 1459.12
    },
    {
        "text": " También es ese modelo de negocios, ¿no? ¿Cómo iba a ganar pedido ya, cómo iba a lograr financiarse?",
        "start": 1460.12,
        "end": 1467.12
    },
    {
        "text": " Bueno, que en definitiva terminó siendo con un porcentaje de la facturación.",
        "start": 1467.12,
        "end": 1473.12
    },
    {
        "text": " Pero bueno, es un caso bastante interesante.",
        "start": 1473.12,
        "end": 1477.12
    },
    {
        "text": " Otro caso que entiendo que es muy innovador interesante es el de marcado libre.",
        "start": 1477.12,
        "end": 1482.12
    },
    {
        "text": " Hoy en día tiene un uso bastante extensivo y a su vez, ha hecho productos adicionales, vinculados, muy innovadores como marcado pago.",
        "start": 1482.12,
        "end": 1494.12
    },
    {
        "text": " Yo no sé si ustedes lo usan, habitualmente.",
        "start": 1494.12,
        "end": 1497.12
    },
    {
        "text": " No, lo usan ¿no?",
        "start": 1500.12,
        "end": 1501.12
    },
    {
        "text": " Sí, sí, sí, sí, también.",
        "start": 1501.12,
        "end": 1505.12
    },
    {
        "text": " Y otro ejemplo se le ocurre.",
        "start": 1508.12,
        "end": 1510.12
    },
    {
        "text": " Yo que soy tipo como yo que soy esto, un uver o como es.",
        "start": 1512.12,
        "end": 1521.12
    },
    {
        "text": " También.",
        "start": 1521.12,
        "end": 1523.12
    },
    {
        "text": " Digiste Uruguay.",
        "start": 1523.12,
        "end": 1524.12
    },
    {
        "text": " O esto, ¿cómo ves?",
        "start": 1524.12,
        "end": 1525.12
    },
    {
        "text": " Esto de alquiléve.",
        "start": 1525.12,
        "end": 1527.12
    },
    {
        "text": " Es exacto, también sí.",
        "start": 1527.12,
        "end": 1531.12
    },
    {
        "text": " Es un sistema de alquiléres que no estábamos acostumbrados antes íbamos alquilar y era otra vez un conocido o un inmobiliaria.",
        "start": 1531.12,
        "end": 1538.12
    },
    {
        "text": " Y bueno, se tiene como un aplicación para eso ¿no?",
        "start": 1538.12,
        "end": 1544.12
    },
    {
        "text": " Exacto, es.",
        "start": 1544.12,
        "end": 1546.12
    },
    {
        "text": " Todo un cambio. ¿Qué otro ejemplo le parece que ha sido innovador?",
        "start": 1548.12,
        "end": 1552.12
    },
    {
        "text": " No.",
        "start": 1552.12,
        "end": 1553.12
    },
    {
        "text": " Uno, tres ejemplo.",
        "start": 1566.12,
        "end": 1568.12
    },
    {
        "text": " No.",
        "start": 1568.12,
        "end": 1571.12
    },
    {
        "text": " Y lo de su alquilación.",
        "start": 1571.12,
        "end": 1578.12
    },
    {
        "text": " Perfecto.",
        "start": 1579.12,
        "end": 1581.12
    },
    {
        "text": " Perfecto.",
        "start": 1581.12,
        "end": 1582.12
    },
    {
        "text": " Ahí se han logrado muy bien.",
        "start": 1582.12,
        "end": 1585.12
    },
    {
        "text": " Sobo extremadamente innovadores muy bien planteados que solucionan un montón de aspecto para las empresas.",
        "start": 1585.12,
        "end": 1593.12
    },
    {
        "text": " Algunos incluso que a partir de allí nace la contabilidad y tuvieron el soporte de una reglamentación estatal,",
        "start": 1593.12,
        "end": 1602.12
    },
    {
        "text": " porque el hecho de que se exigiera, que se comenzara a utilizar la facturación electrónica,",
        "start": 1602.12,
        "end": 1608.12
    },
    {
        "text": " también hizo que muchos conocedores del tema y muchas empresas que ya trabajaban con programas de facturación,",
        "start": 1608.12,
        "end": 1619.12
    },
    {
        "text": " los adaptaran y los aciornaran, verdad, y les diera en otras funcionalidades.",
        "start": 1619.12,
        "end": 1625.12
    },
    {
        "text": " Pero creo que en todo lo que eso es, bueno, se logran aspectos bastante innovadores.",
        "start": 1625.12,
        "end": 1630.12
    },
    {
        "text": " Bueno, a mí me parece que Waze es una empresa también bastante innovadora.",
        "start": 1630.12,
        "end": 1634.12
    },
    {
        "text": " Si bien teníamos Google Maps, bueno, tiene muchas funciones,",
        "start": 1634.12,
        "end": 1640.12
    },
    {
        "text": " continuamente generando cambios a la aplicación y todo el tema de las alertas.",
        "start": 1640.12,
        "end": 1646.12
    },
    {
        "text": " Me parece sumamente interesante, no?",
        "start": 1646.12,
        "end": 1648.12
    },
    {
        "text": " Poder conocer si hay un accidente, sino no solo cómo funciona el tráfico, si está o no detenido,",
        "start": 1648.12,
        "end": 1655.12
    },
    {
        "text": " sino también datos de tiempo real, que creo que le aporta mucho.",
        "start": 1655.12,
        "end": 1662.12
    },
    {
        "text": " Yo otro ejemplo.",
        "start": 1662.12,
        "end": 1664.12
    },
    {
        "text": " No, no.",
        "start": 1665.12,
        "end": 1667.12
    },
    {
        "text": " ¡Nan silenciosos!",
        "start": 1681.12,
        "end": 1683.12
    },
    {
        "text": " Bienvene de noche, prof.",
        "start": 1686.12,
        "end": 1688.12
    },
    {
        "text": " Bueno, la idea ahora,",
        "start": 1689.12,
        "end": 1695.12
    },
    {
        "text": " miren que siempre hacemos un poquito de teórico y un poquito en grupo,",
        "start": 1695.12,
        "end": 1701.12
    },
    {
        "text": " y ya incluso en esta ratita les voy a verificar la fecha del parcial que hay en el solicitado.",
        "start": 1701.12,
        "end": 1707.12
    },
    {
        "text": " Leí en esta ratita es que piensen empresas que hayan hecho estrategias de crecimiento horizontal.",
        "start": 1707.12,
        "end": 1717.12
    },
    {
        "text": " Esto lo vimos en la clase pasada. Ahora que vimos el crecimiento horizontal, el crecimiento vertical,",
        "start": 1717.12,
        "end": 1723.12
    },
    {
        "text": " bueno, que piensen ejemplos de crecimiento horizontal y vertical y lo vemos en forma conjunta,",
        "start": 1723.12,
        "end": 1731.12
    },
    {
        "text": " luego de una pausa. Vamos a dar 10 minutitos, ¿sabes? Porque la idea es que cada uno va a aportar",
        "start": 1731.12,
        "end": 1737.12
    },
    {
        "text": " uno, dos casos y poderlarlos en forma conjunta.",
        "start": 1737.12,
        "end": 1741.12
    },
    {
        "text": " Por las dudas, un recuento antes de mandarlos al grupo, se acuerdan que vimos que cuando teníamos unidades de negocios,",
        "start": 1742.12,
        "end": 1749.12
    },
    {
        "text": " teníamos que decidir si con esas, estos realmente se preguntan las en los parciales.",
        "start": 1749.12,
        "end": 1755.12
    },
    {
        "text": " Cuando tenemos unidades de negocios, tenemos que identificar si están en una situación de crecimiento,",
        "start": 1755.12,
        "end": 1762.12
    },
    {
        "text": " entonces seguramente yo inviertas sobre esas empresas, si estén en una situación donde va a estar más estable,",
        "start": 1762.12,
        "end": 1770.12
    },
    {
        "text": " la empresa, o si necesita una renovación. Entonces cuando hablamos de renovaciones,",
        "start": 1770.12,
        "end": 1776.12
    },
    {
        "text": " una empresa que, por ejemplo, tiene algún problema con sus costos, que está en una situación un poco compleja,",
        "start": 1776.12,
        "end": 1782.12
    },
    {
        "text": " entonces la tengo que renovar para poder encaminarla. Cuando estábamos en estabilidad,",
        "start": 1782.12,
        "end": 1788.12
    },
    {
        "text": " dijimos que no necesariamente será conyativo, sino que quizás la empresa había crecido muchísimo,",
        "start": 1788.12,
        "end": 1794.12
    },
    {
        "text": " entonces lo que hacemos es en estabilidad, empezamos a formalizar, a mejorar los procedimientos,",
        "start": 1794.12,
        "end": 1800.12
    },
    {
        "text": " a realizar inversiones con lo que ganamos, pero de una forma llamas más tranquila sin tantos cambios.",
        "start": 1800.12,
        "end": 1809.12
    },
    {
        "text": " Pero pues dijimos que había una parte donde las empresas crecían.",
        "start": 1809.12,
        "end": 1813.12
    },
    {
        "text": " Hay dimos ejemplos de empresas que se unían a otras empresas, dimos ejemplos de empresas que empezaban a realizar sus propios insumos,",
        "start": 1813.12,
        "end": 1823.12
    },
    {
        "text": " vimos ejemplos de empresas que empezaban a hacer su propia distribución, o sea que iban hacia adelante,",
        "start": 1823.12,
        "end": 1830.12
    },
    {
        "text": " así que bueno un poquito pueden ver el material incluso, la idea es que todos mencionen un ejemplo y todo,",
        "start": 1830.12,
        "end": 1838.12
    },
    {
        "text": " así que les dejo un ratito para eso.",
        "start": 1838.12,
        "end": 1841.12
    },
    {
        "text": " Los voy a mandar a grupos.",
        "start": 1843.12,
        "end": 1845.12
    },
    {
        "text": " Bueno, estamos retornando de los grupos, espero que hayan aprovechado el tiempo y que ahora vengan con muchos ejemplos de las diferentes estrategias.",
        "start": 1853.12,
        "end": 1867.12
    },
    {
        "text": " Vamos a aprovechar, les voy a compartir, que tengo por aquí.",
        "start": 1867.12,
        "end": 1876.12
    },
    {
        "text": " Bueno coincido con ustedes que la fecha tentativa, porque recuerdan que después ponen las definitivas,",
        "start": 1877.12,
        "end": 1888.12
    },
    {
        "text": " la fecha tentativa para la prueba es el sabado 11 de mayo a las 9 de la mañana.",
        "start": 1888.12,
        "end": 1897.12
    },
    {
        "text": " Ahí tienen administración general para ingenieros a 11 de mayo 9 de la mañana.",
        "start": 1897.12,
        "end": 1903.12
    },
    {
        "text": " Pero tenemos que estar atentos por las dudas, vuelvo a repetir para los que se están volviendo de los grupos,",
        "start": 1904.12,
        "end": 1912.12
    },
    {
        "text": " confirmado que la fecha tentativa, después hay que esperar la definitiva es sabado 11 de mayo 9 de la mañana.",
        "start": 1912.12,
        "end": 1920.12
    },
    {
        "text": " Así que falta poquito, espero que estén estudiando ya.",
        "start": 1920.12,
        "end": 1927.12
    },
    {
        "text": " Así no tiene que leer todo. Vamos a hacer un resumen un poco de la unidad con los puntos más significativos.",
        "start": 1928.12,
        "end": 1937.12
    },
    {
        "text": " Bueno, ¿qué es lo que vimos? En definitiva vimos que la Administración estratégica es lo que hacen los querentes para desarrollar las estrategias de sus organizaciones.",
        "start": 1937.12,
        "end": 1946.12
    },
    {
        "text": " Digimos que las estrategias son aquellos planes que terminan cómo va a lograr la organización y ese propósito comercial que se fijó.",
        "start": 1946.12,
        "end": 1954.12
    },
    {
        "text": " ¿Cómo va a competir con éxito y cómo va a hacer para poder atraer y satisfacer a los clientes?",
        "start": 1955.12,
        "end": 1961.12
    },
    {
        "text": " Recuerdan que si nosotros tenemos a los clientes satisfechos, al empresa le seguramente le va a ir bien y de esa forma vamos a poder cumplir con los objetivos.",
        "start": 1961.12,
        "end": 1971.12
    },
    {
        "text": " Luego vimos también en esta unidad del concepto de modelo de negocios.",
        "start": 1971.12,
        "end": 1978.12
    },
    {
        "text": " Analizamos ese punto también.",
        "start": 1979.12,
        "end": 1984.12
    },
    {
        "text": " Lo vimos al modelo de negocios como al conjunto acciones que se ponen en práctica para generar ingresos económicos.",
        "start": 1984.12,
        "end": 1993.12
    },
    {
        "text": " Recuerdan que dijimos que muchas empresas no llegaban a prosperar justamente porque no podían definir correctamente un modelo de negocios.",
        "start": 1993.12,
        "end": 2001.12
    },
    {
        "text": " Es importante saber que forma va a ganar la empresa que yo estoy planeando, no ya sé un proyecto de negocios o un negocio real.",
        "start": 2001.12,
        "end": 2011.12
    },
    {
        "text": " En la clase creo que incluso hasta vimos algunos ejemplos, decía cómo ganan Uber con un percentage, cómo ganan pedido ya con un percentage de las ventas.",
        "start": 2011.12,
        "end": 2021.12
    },
    {
        "text": " Hay otros que ganan via publicidad, hay otros que ganan con el tema de los datos que van captando con los ingresos, pero siempre es bueno saber cuál es el modelo de negocios.",
        "start": 2022.12,
        "end": 2033.12
    },
    {
        "text": " La amización estratégica es muy importante y vimos tres razones para por esa importancia.",
        "start": 2033.12,
        "end": 2041.12
    },
    {
        "text": " Puede hacer una diferencia en lo que es el desempeño de una organización, una empresa que tiene una buena estrategia tiene un mejor desempeño o por lo menos debería detenerlo.",
        "start": 2042.12,
        "end": 2054.12
    },
    {
        "text": " Va a ayudar a los genentes a afrontar correctamente lo que es el cambio y bastante las circunstancias y vimos los ejemplos de la pandemia y todo lo que hizo influyó.",
        "start": 2054.12,
        "end": 2064.12
    },
    {
        "text": " Y por último, la administración estratégica es importante porque va a ayudar a coordinar y enfocar los esfuerzos de los empleados.",
        "start": 2065.12,
        "end": 2073.12
    },
    {
        "text": " Esto de coordinar y enfocar los esfuerzos de los empleados siempre se va a dar cuando le comunicemos a los empleados cuál es la estrategia de la organización, que no todas las empresas lo hacen correctamente.",
        "start": 2073.12,
        "end": 2085.12
    },
    {
        "text": " Entonces eso es un punto de en cuenta. Luego vimos para dar el proceso de administraciones estratégicas, recuerden que eran seis pasos.",
        "start": 2086.12,
        "end": 2094.12
    },
    {
        "text": " El primer paso era la identificación de la misión, que ahí como ejercicio, ustedes buscaron algunas definiciones de misión.",
        "start": 2094.12,
        "end": 2103.12
    },
    {
        "text": " Si trabajan en una empresa que no tiene misiones estaría buena que la puedan hacer, para hacerla pueden usar la guía que tienen en Robin, donde dicen que hay que diginen los clientes, los proveedores, cuáles van a hacer nuestros valores, nuestros conceptos.",
        "start": 2103.12,
        "end": 2117.12
    },
    {
        "text": " Y también muchos ejemplos en la web. Recuerden que es importante que la misión tenga la impronta de la empresa que la que ustedes trabajan o la que van a tener en un futuro y tratar de que cuando alguien la lea sepa que están hablando de su empresa y no que sea un modelo genético de empresas.",
        "start": 2117.12,
        "end": 2132.12
    },
    {
        "text": " Así que bueno, el primer punto era la identificación de la misión, el segundo punto va a hacer la realización de la análisis externo, que solo van a ser con la matrizfoda, al igual que en la análisis interno.",
        "start": 2133.12,
        "end": 2146.12
    },
    {
        "text": " Luego tenemos la formulación de las estrategias que ahí hablamos de las clásicas, de porter, de diferenciación y costos que salgo que se consunta bastante en los partiales y luego también vimos de estrategias más recientes.",
        "start": 2146.12,
        "end": 2161.12
    },
    {
        "text": " Que como el electrónico, bueno, y otras que después vamos a repasar.",
        "start": 2162.12,
        "end": 2167.12
    },
    {
        "text": " Hablamos de la implementación de la estrategia, que es justamente la puesta en práctica, de aquella estrategia que seleccionamos y luego la evaluación de los resultados.",
        "start": 2168.12,
        "end": 2180.12
    },
    {
        "text": " Algunas uas tardar, un poco estamos recorrando.",
        "start": 2181.12,
        "end": 2189.12
    },
    {
        "text": " No tiene claro usted, pero esto es el no se de cinco del parcial.",
        "start": 2189.12,
        "end": 2198.12
    },
    {
        "text": " Es tipo como así, multipli opción y todo eso o cómo son los parciales.",
        "start": 2198.12,
        "end": 2206.12
    },
    {
        "text": " Va a ser multipli opción.",
        "start": 2207.12,
        "end": 2209.12
    },
    {
        "text": " Así que ustedes van a tener la pregunta y que va a tener ciertas opciones y van a tener que elegir entre esas opciones la correcta.",
        "start": 2210.12,
        "end": 2222.12
    },
    {
        "text": " No resta lo cual es muy positivo para ustedes.",
        "start": 2222.12,
        "end": 2226.12
    },
    {
        "text": " Vas a reelibrar en la habilidad, o sea que van a poder recorriéndola la prueba en caso de que algunas no sepan pueden seguir con la siguiente si después volver.",
        "start": 2226.12,
        "end": 2235.12
    },
    {
        "text": " Bueno, ya les comete que no no resta puntos y después es una sola la respuesta correcta.",
        "start": 2235.12,
        "end": 2241.12
    },
    {
        "text": " O sea, ustedes no tienen que marcar más de una opción por cada una de las preguntas.",
        "start": 2241.12,
        "end": 2246.12
    },
    {
        "text": " Acá pregunta tiene una opción correcta.",
        "start": 2246.12,
        "end": 2249.12
    },
    {
        "text": " Duración, cuánto es?",
        "start": 2249.12,
        "end": 2251.12
    },
    {
        "text": " Si mal lo recuerdo en la última oportunidad hicimos de una hora, pero bueno, siempre se calcula en cierta cantidad de minutos por pregunta.",
        "start": 2252.12,
        "end": 2262.12
    },
    {
        "text": " Vien.",
        "start": 2262.12,
        "end": 2264.12
    },
    {
        "text": " Bien.",
        "start": 2264.12,
        "end": 2266.12
    },
    {
        "text": " Bien.",
        "start": 2266.12,
        "end": 2268.12
    },
    {
        "text": " Una otra duda.",
        "start": 2270.12,
        "end": 2273.12
    },
    {
        "text": " No, perfecto.",
        "start": 2273.12,
        "end": 2274.12
    },
    {
        "text": " No.",
        "start": 2274.12,
        "end": 2275.12
    },
    {
        "text": " No.",
        "start": 2275.12,
        "end": 2276.12
    },
    {
        "text": " Venga, después otra tema que vimos es los tres tipos de estrategias corporativas.",
        "start": 2276.12,
        "end": 2286.12
    },
    {
        "text": " Vimos la estrategia de crecimiento, para que es cuando queremos aumentar el número de marcados a lo que las empresas están tendiendo y también los diferentes productos que ofrece.",
        "start": 2286.12,
        "end": 2297.12
    },
    {
        "text": " Ya sea mediante las líneas de negocios actuales, oponiendo en marcha tras nuevas.",
        "start": 2297.12,
        "end": 2302.12
    },
    {
        "text": " Qué es lo que vimos recién con los ejemplos?",
        "start": 2302.12,
        "end": 2306.12
    },
    {
        "text": " Los tres tipos de estrategia de crecimiento son la concentración, que es lo que vimos hoy.",
        "start": 2306.12,
        "end": 2312.12
    },
    {
        "text": " La integración vertical hacia atrás, cuando vamos para el lado de las materias primas y hacia adelante, cuando vamos hacia el lado de la distribución.",
        "start": 2312.12,
        "end": 2322.12
    },
    {
        "text": " Y luego tenemos la integración horizontal, que también es el malgirmoso, es un rato y la diversificación relacionada cuando es algo que está estritamente vinculado a mi negocio y la norma relacionada cuando no está vinculado.",
        "start": 2322.12,
        "end": 2334.12
    },
    {
        "text": " La estrategia de estabilidad, ya sabrán que les comente que es cuando seguimos con lo que estábamos haciendo, seguimos con la actividad actual.",
        "start": 2334.12,
        "end": 2343.12
    },
    {
        "text": " Y muchas veces lo hacemos porque la empresa quizás tuvo un alto crecimiento y decimos mantenernos como estamos.",
        "start": 2343.12,
        "end": 2349.12
    },
    {
        "text": " O a veces también ante situaciones del entorno que son muy turbulentes, si no es necesario realizar cambios urgentes,",
        "start": 2349.12,
        "end": 2356.12
    },
    {
        "text": " bueno, tratamos de no realizar actividades de crecimiento, o sea, no.",
        "start": 2356.12,
        "end": 2360.12
    },
    {
        "text": " Por ejemplo, en plena pandemia, salvo que fue necesario para su sitio,",
        "start": 2360.12,
        "end": 2366.12
    },
    {
        "text": " si tiene raro que una empresa ya ha lanzado un nuevo producto,",
        "start": 2366.12,
        "end": 2370.12
    },
    {
        "text": " entonces, generalmente, como se mantuvieron, estables esperando a ver qué era lo que iba a suceder.",
        "start": 2370.12,
        "end": 2378.12
    },
    {
        "text": " Entonces, una estrategia válida que las empresas pueden utilizar en algunos momentos.",
        "start": 2378.12,
        "end": 2383.12
    },
    {
        "text": " Si la empresa siempre se mantiene estable, bueno, no va a crecer y su rentabilidad no va a tener grandes incrementos.",
        "start": 2383.12,
        "end": 2390.12
    },
    {
        "text": " Y luego tenemos la renovación, para que cuando nosotros tenemos una situación, por ejemplo,",
        "start": 2391.12,
        "end": 2397.12
    },
    {
        "text": " donde visualizamos que la empresa se está deteriorando, que quizás no están en una buena situación,",
        "start": 2397.12,
        "end": 2402.12
    },
    {
        "text": " que los costos se están siendo desmedidos, entonces, bueno, en cierta medida, tratamos de hacer cambios,",
        "start": 2402.12,
        "end": 2409.12
    },
    {
        "text": " cambios que pueden ser, o reducir costos, buscar mejoras de algún tipo, pero bueno,",
        "start": 2409.12,
        "end": 2415.12
    },
    {
        "text": " hacemos justamente modificaciones para renovar y, de esa forma, mantener esa organización.",
        "start": 2415.12,
        "end": 2423.12
    },
    {
        "text": " Otro tema que hablamos fue de la ventaja competitiva, que dijimos que la ventaja competitiva era que yo que nos distinguía,",
        "start": 2424.12,
        "end": 2431.12
    },
    {
        "text": " aquello que nos hacía nuestra organización especial, que hacía nuestra organización única.",
        "start": 2431.12,
        "end": 2437.12
    },
    {
        "text": " Y bueno, es un aspecto bastante significativo, sino tenemos algo que nos destaque,",
        "start": 2437.12,
        "end": 2443.12
    },
    {
        "text": " algo que nos hagas únicos, que en el video que vimos de porter justamente, que planteaba eso,",
        "start": 2443.12,
        "end": 2449.12
    },
    {
        "text": " ser únicos, tener algo que los demás no tienen, bueno, va a ser difícil poder mantener el negocio,",
        "start": 2449.12,
        "end": 2457.12
    },
    {
        "text": " en funcionamiento de cuadamen, entonces, es algo importante.",
        "start": 2457.12,
        "end": 2461.12
    },
    {
        "text": " Otro tema que vimos eran las tres estrategias competitivas que estaban propuestas por porter,",
        "start": 2462.12,
        "end": 2468.12
    },
    {
        "text": " hablamos de que las empresas podían ser únicas en basarse en lo que era liderazgo en los costos,",
        "start": 2468.12,
        "end": 2474.12
    },
    {
        "text": " que era competir en base a tener los costos más bajos de la industria.",
        "start": 2474.12,
        "end": 2479.12
    },
    {
        "text": " Y uno puede ver esos negocios que tienen coblas de gente esperando, porque son muy baratos,",
        "start": 2479.12,
        "end": 2484.12
    },
    {
        "text": " porque son muy económicos y para ser baratos económicos, han tenido que hacer un montón de cambios,",
        "start": 2484.12,
        "end": 2490.12
    },
    {
        "text": " para poder llegar a eso.",
        "start": 2490.12,
        "end": 2492.12
    },
    {
        "text": " Y luego tenemos esas otras empresas donde las personas no tienen problemas de pagar un poquito más,",
        "start": 2492.12,
        "end": 2499.12
    },
    {
        "text": " de lo que se paga en otros. Comarcios porque entienden,",
        "start": 2499.12,
        "end": 2504.12
    },
    {
        "text": " son productos únicos y muy baratos por los clientes.",
        "start": 2504.12,
        "end": 2508.12
    },
    {
        "text": " Que ahí podemos ver, a que hay fonsea, puede llegar a ser un ejemplo de eso,",
        "start": 2508.12,
        "end": 2513.12
    },
    {
        "text": " como algo único, incluso a nivel computadora también,",
        "start": 2513.12,
        "end": 2518.12
    },
    {
        "text": " tienen un costo bastante más elevado quizás que otras marcas, sin embargo,",
        "start": 2518.12,
        "end": 2523.12
    },
    {
        "text": " hay personas que le eligen porque entienden que tienen ciertas características particulares.",
        "start": 2524.12,
        "end": 2529.12
    },
    {
        "text": " Y luego otro tema que hablamos en la clase pasada era la importancia de saber seleccionar marcados.",
        "start": 2530.12,
        "end": 2536.12
    },
    {
        "text": " Y dijimos que las pequeñas y las medianas empresas tenían que salir un poco a la fuerza,",
        "start": 2536.12,
        "end": 2541.12
    },
    {
        "text": " porque es muy difícil que puedan abastecer todo el mercado,",
        "start": 2541.12,
        "end": 2546.12
    },
    {
        "text": " entonces la forma de poder competir es lograr usar sus armas estratégicas",
        "start": 2546.12,
        "end": 2552.12
    },
    {
        "text": " y para usarlas correctamente deberían deseleccionar,",
        "start": 2552.12,
        "end": 2556.12
    },
    {
        "text": " verdad, y enfocarse en un segmento del mercado.",
        "start": 2556.12,
        "end": 2560.12
    },
    {
        "text": " Algunas problemáticas actuales que están relacionadas con la Administración estratégica,",
        "start": 2567.12,
        "end": 2572.12
    },
    {
        "text": " bueno, acá hay algunos elementos que ha destacado,",
        "start": 2572.12,
        "end": 2575.12
    },
    {
        "text": " uno que creamos hablado que era la flexibilidad,",
        "start": 2575.12,
        "end": 2578.12
    },
    {
        "text": " a veces acordamos que dijimos que estamos sentimos competitivos,",
        "start": 2578.12,
        "end": 2582.12
    },
    {
        "text": " cambiantes en torno dinámicos, entonces los gerentes actuales tienen que saber ser flexibles",
        "start": 2582.12,
        "end": 2588.12
    },
    {
        "text": " y esa flexibilidad se tiene que trasladar también en una flexibilidad estratégica",
        "start": 2588.12,
        "end": 2594.12
    },
    {
        "text": " y para tener la flexibilidad estratégica yo tengo que reconocer los cambios relevantes",
        "start": 2594.12,
        "end": 2600.12
    },
    {
        "text": " que hay extremos, tengo que poder mover los recursos que tengo necesarios",
        "start": 2600.12,
        "end": 2606.12
    },
    {
        "text": " para las situaciones que se me mandan, lo imaginen en durante la pandemia,",
        "start": 2606.12,
        "end": 2611.12
    },
    {
        "text": " las empresas que tuvieron que restructurarse, que tuvieron que hacer cosas distintas,",
        "start": 2611.12,
        "end": 2615.12
    },
    {
        "text": " bueno, tuvieron que rápidamente cambiar los recursos, quizás que lamentablemente",
        "start": 2615.12,
        "end": 2621.12
    },
    {
        "text": " tuvieron que mandar ciertas personas al seguro de paro, quizás que tuvieron que contratar a otras",
        "start": 2621.12,
        "end": 2627.12
    },
    {
        "text": " que tenían una espartiz mayor en lo que era comercio electrónico para poder salir a flote,",
        "start": 2627.12,
        "end": 2633.12
    },
    {
        "text": " adaptarse a la nueva realidad, pero bueno, todo eso forma parte de lo que es verdad,",
        "start": 2633.12,
        "end": 2639.12
    },
    {
        "text": " esa estrategia que uno tiene que tener más flexible de lo que era antes",
        "start": 2639.12,
        "end": 2644.12
    },
    {
        "text": " porque bueno, el tiempo va cambiando y nos lleva a esa necesidad.",
        "start": 2644.12,
        "end": 2649.12
    },
    {
        "text": " Dimos el tema de comercio electrónico y algo que no llegué a mencionarles",
        "start": 2649.12,
        "end": 2655.12
    },
    {
        "text": " es la estrategia conocida como clicks and bricks, ¿qué les parece que es clicks and bricks?",
        "start": 2655.12,
        "end": 2663.12
    },
    {
        "text": " clicks and bricks, ¿qué es una estrategia de clicks and bricks? ¿qué es click?",
        "start": 2665.12,
        "end": 2677.12
    },
    {
        "text": " click del ratón dice esto, no, no, no, no. hace, hacer un click sobre algo.",
        "start": 2678.12,
        "end": 2683.12
    },
    {
        "text": " Claro, es cuando hacemos click, o sea, cuando hacemos click es que estamos haciendo compras virtuales, ¿no?",
        "start": 2683.12,
        "end": 2689.12
    },
    {
        "text": " y bricks que es...",
        "start": 2689.12,
        "end": 2693.12
    },
    {
        "text": " un brick significa ladrillo o algo de estilo.",
        "start": 2694.12,
        "end": 2697.12
    },
    {
        "text": " Es exacto, es exacto. Entonces, cuando dice click and bricks,",
        "start": 2697.12,
        "end": 2700.12
    },
    {
        "text": " hay que tener su parte virtual, o sea, permiten que sus clientes conbre",
        "start": 2700.12,
        "end": 2706.12
    },
    {
        "text": " minutoalmente, pero también mantienen las estructuras físicas pensando en ese público",
        "start": 2706.12,
        "end": 2712.12
    },
    {
        "text": " al que le gusta ver y poder visualizar los productos.",
        "start": 2712.12,
        "end": 2717.12
    },
    {
        "text": " Así que bueno, esa es una frase ahí que usa Robin, que está interesante.",
        "start": 2717.12,
        "end": 2723.12
    },
    {
        "text": " interesante, que hoy en día en el lugar de muchas empresas todavía mantienen ambos",
        "start": 2723.12,
        "end": 2728.88
    },
    {
        "text": " ambas modarias desventas, están a nivel virtual, pero también tienen sus lugares físicos.",
        "start": 2728.88,
        "end": 2734.44
    },
    {
        "text": " Y sin embargo hay otras que solamente tienen su venta en el campo virtual. No sé si a ustedes",
        "start": 2734.44,
        "end": 2741.88
    },
    {
        "text": " le pasó de comprar, porque no como, la hemos mencionado hoy ha marcado libre y visualizar",
        "start": 2741.88,
        "end": 2747.92
    },
    {
        "text": " que solo pueden comprar online y que no hay un lugar donde va los productos. ¿Has pasado?",
        "start": 2747.92,
        "end": 2752.48
    },
    {
        "text": " Sí, en derecho hay muchas empresas que claro solamente tienen su local ahí en la",
        "start": 2754.2400000000002,
        "end": 2760.88
    },
    {
        "text": " cauda libre, o sea, y envían para todos lados, pero no hay como no hay forma de llegar a ellos",
        "start": 2760.88,
        "end": 2766.52
    },
    {
        "text": " físicamente. Exacto. Y bueno, ahí es incluso virtual y también la atención virtual,",
        "start": 2766.52,
        "end": 2774.96
    },
    {
        "text": " o según uno tiene posibilidades de realizar una queje en persona, todo lo que sabéis yo",
        "start": 2774.96,
        "end": 2781.56
    },
    {
        "text": " atención a clientes también, es todo digital. Y bueno, a veces nos cuesta cuando tenemos algún",
        "start": 2781.56,
        "end": 2787.7200000000003
    },
    {
        "text": " inconveniente como que estamos acostumbrados a ir al lugar y plantear lo que nos pasó. Y bueno,",
        "start": 2787.7200000000003,
        "end": 2793.2400000000002
    },
    {
        "text": " entrar por el indísque 1, 2, se torna más complejo por ese de personas que siguen prefiriendo la",
        "start": 2793.2400000000002,
        "end": 2802.28
    },
    {
        "text": " compra en lugar de físicos que muchas veces justamente por todos los costos que implica la la",
        "start": 2802.28,
        "end": 2807.1600000000003
    },
    {
        "text": " locística de la venda en un lugar físico, personal, las instalaciones, en el caso de estar en un",
        "start": 2807.1600000000003,
        "end": 2813.5600000000004
    },
    {
        "text": " shopping, los costos que implica verdad estar en ese lugar, el percentage de facturación que se pierde,",
        "start": 2813.5600000000004,
        "end": 2821.7200000000003
    },
    {
        "text": " los gastos común, bueno, todo eso hace que a veces se tenga un costo mayor que en una venda online,",
        "start": 2821.7200000000003,
        "end": 2830.0400000000004
    },
    {
        "text": " donde obviamente hay una parte inicial donde se gasta que todo el desarrollo, verdad de la de la",
        "start": 2830.04,
        "end": 2836.8
    },
    {
        "text": " plataforma, pero bueno, después que eso está empieza a hacer más económico, al inicio sí,",
        "start": 2836.8,
        "end": 2843.36
    },
    {
        "text": " obviamente tenemos que hacer un montón de costos que después van a redundar en ese en ese beneficio.",
        "start": 2843.36,
        "end": 2851.7599999999998
    },
    {
        "text": " Incluso ahí pila de ofertas también así, eso es que para comprar productos te dice que",
        "start": 2851.7599999999998,
        "end": 2859.6
    },
    {
        "text": " te demoran aquí en sedia porque te lo trénde, los Unidos o de China, ni siquiera tiene productos",
        "start": 2859.6,
        "end": 2864.12
    },
    {
        "text": " físicamente en el lugar sino que ha pedido banitaros. Exacto, exacto, eso también por",
        "start": 2864.12,
        "end": 2873.8399999999997
    },
    {
        "text": " buenas personas que todavía no tienen usuarios, porque en realidad hay muchas empresas que te",
        "start": 2873.8399999999997,
        "end": 2879.3199999999997
    },
    {
        "text": " permiten los usuarios para salas compras, pero bueno muchas personas que no tienen usuarios que",
        "start": 2879.3199999999997,
        "end": 2884.2799999999997
    },
    {
        "text": " dispono sin como es la como el exterior es como despachante aduana pero más pequeña.",
        "start": 2884.28,
        "end": 2890.4
    },
    {
        "text": " Hace todo el trabajo es tal cual.",
        "start": 2893.6000000000004,
        "end": 2897.1600000000003
    },
    {
        "text": " Algunas dudas acá?",
        "start": 2901.76,
        "end": 2903.1600000000003
    }
]