[
    {
        "text": " Bueno, hoy vamos a empezar con el siguiente tema que es con teo.",
        "start": 0.0,
        "end": 21.44
    },
    {
        "text": " Se va a contar y estén bastante atentos porque es algo que a mí me resulta difícil",
        "start": 30.0,
        "end": 43.24
    },
    {
        "text": " a veces me equivoco, entonces estén atentos.",
        "start": 43.24,
        "end": 49.0
    },
    {
        "text": " Entonces vamos a empezar con un ejemplo sencillo. Digamos que en la biblioteca hay 17 libros de matemática discreta",
        "start": 50.0,
        "end": 74.0
    },
    {
        "text": " en español. Y que hay 8 libros de matemática discreta que están en inglés y que en español se lean inglés y no se lean en otro idioma,",
        "start": 74.0,
        "end": 99.0
    },
    {
        "text": " pero en ruso no me sirve. Entonces, cuántos libros de matemática discreta puedo tomar prestados de la biblioteca. Si yo voy a la biblioteca a elegir un libro de matemática discreta de cuántas maneras puedo elegirlo.",
        "start": 99.0,
        "end": 114.0
    },
    {
        "text": " Bueno, puedo elegir un libro que esté en español y para hacer esto tengo... Gracias, te lo vi. Para hacer esto tengo 17 posibilidades y puedo elegir un libro que esté en inglés y para esto tengo 8 posibilidades.",
        "start": 115.0,
        "end": 143.0
    },
    {
        "text": " Entonces, tengo 17 más 8 maneras de elegir un libro de matemática discreta en la biblioteca.",
        "start": 143.0,
        "end": 152.0
    },
    {
        "text": " Lo que quiero decir es que tengo esta cantidad de opciones. O sea, no dije que haya 17 ejemplares de un libro.",
        "start": 153.0,
        "end": 169.0
    },
    {
        "text": " Quiero decir, hay 17 libros diferentes, o sea, está el de grima alde y hay otro y otro más, etcétera. Entonces, cuando voy a elegir un libro, libros en español tengo 17 y libros en inglés tengo 8.",
        "start": 169.0,
        "end": 185.0
    },
    {
        "text": " Entonces, si quiero elegir un libro, tengo 17 más 8 libros que son distintos, así que puedo elegir.",
        "start": 185.0,
        "end": 193.0
    },
    {
        "text": " Entonces, esto es de sentido común y todos lo saben, pero es simplifica una regla de conteo que es muy sencilla que se llama la regla de la zuma.",
        "start": 199.0,
        "end": 219.0
    },
    {
        "text": " ¿Qué dice lo siguiente? Si hay, en maneras de realizar una cierta tarea.",
        "start": 219.0,
        "end": 239.0
    },
    {
        "text": " Y no es posible realizar ambas simultaneamente.",
        "start": 249.0,
        "end": 271.0
    },
    {
        "text": " Entonces, para si yo voy a realizar una u otra tarea,",
        "start": 271.0,
        "end": 299.0
    },
    {
        "text": " tenemos una cualquiera de las dos, tengo M más C en maneras de serlo. Hay M maneras de realizar algunas de las dos maneras.",
        "start": 299.0,
        "end": 311.0
    },
    {
        "text": " Esto es un palabra brillo, pero ¿qué quiere decir esto en el ejemplo? Hay en maneras de elegir un libro de matemática discreta que esté escrito en español.",
        "start": 329.0,
        "end": 349.0
    },
    {
        "text": " Hay 18 maneras de elegir un libro de matemática discreta que esté escrito en español. Eso sería la primera tarea.",
        "start": 349.0,
        "end": 359.0
    },
    {
        "text": " Hay M maneras que en el ejemplo son 8 de elegir un libro de matemática discreta que esté en inglés.",
        "start": 359.0,
        "end": 369.0
    },
    {
        "text": " Si quiero ir a la tercera condición, que no es posible realizar ambas tarea simultaneamente.",
        "start": 369.0,
        "end": 377.0
    },
    {
        "text": " Hay que elegir un libro de la vez en español y en inglés. O sea, estos 17 son distintos de estos 8.",
        "start": 377.0,
        "end": 389.0
    },
    {
        "text": " Entonces, hay M más C en maneras de hacer algunas de las dos cosas. En el ejemplo de elegir algún libro de matemática discreta que esté escrito en cualquiera de los dos idiomas.",
        "start": 389.0,
        "end": 405.0
    },
    {
        "text": " Esto es bastante intuitivo, me parece. Entonces, otro ejemplo sería. Quiero ir a la facultad arquitectura, me voy a tomar unos nibus.",
        "start": 405.0,
        "end": 419.0
    },
    {
        "text": " La facultad arquitectura, como todos saben, queda en volevar tiga y en volevar España.",
        "start": 419.0,
        "end": 429.0
    },
    {
        "text": " Entonces, yo me voy a tomar unos nibus que me llevan la facultad arquitectura y que pare en esa esquina.",
        "start": 429.0,
        "end": 451.0
    },
    {
        "text": " Entonces, tengo cuatro nibus que llegan por volevar España, cuatro líneas de nibus.",
        "start": 451.0,
        "end": 471.0
    },
    {
        "text": " O sea, tengo cuatro maneras de llegar a la facultad arquitectura, tomando un nibus por volevar España y seis por volevar tidas.",
        "start": 471.0,
        "end": 491.0
    },
    {
        "text": " Entonces, de cuántas maneras puedo elegir un nibus que me deje en la facultad arquitectura, de cuatro más seis maneras. O sea, 10 líneas de nibus que me dejan el facultad.",
        "start": 491.0,
        "end": 503.0
    },
    {
        "text": " Entonces, este principio, obviamente, se generaliza a más tareas. O sea, si a mí me sirve, tomarme unos nibus que vaya por volevar tidas o por volevar España o que me deje en 21 de septiembre o lo que sea, la cantidad de omnios que puedo elegir es la suma de todos los omnios que me dejan en todos esos lugares diferentes.",
        "start": 503.0,
        "end": 531.0
    },
    {
        "text": " Entonces, siempre y cuando no se puedan realizar, digamos, no haya una manera de realizar dos de las tareas. O sea, acá yo no puedo tomar unos nibus que vaya por volevar tidas y que a la vez vaya por volevar España.",
        "start": 531.0,
        "end": 547.0
    },
    {
        "text": " Las cuatro líneas que van por volevar España son distintas de las seis líneas que van por volevar tidas.",
        "start": 547.0,
        "end": 554.0
    },
    {
        "text": " A lo mejor, digamos, si yo quiero comprar un regalo para mi madre, tengo 10 maneras de hacerlo. Si quiero ir a una chocolateería, tengo 4, pero puedo ir a una chocolateería comprarle un regalo a mi madre.",
        "start": 556.0,
        "end": 571.0
    },
    {
        "text": " Entonces, las 10 maneras de comprarle un regalo a mi madre y las 4 maneras de una chocolateería no son distintas.",
        "start": 572.0,
        "end": 579.0
    },
    {
        "text": " Entonces, obviamente este principio se generaliza a cualquier cantidad de tareas y es el primer principio de contigo.",
        "start": 582.0,
        "end": 592.0
    },
    {
        "text": " Ahora vamos a ver otro ejemplo de algo que podríamos querer contar. Comito un delito.",
        "start": 592.0,
        "end": 607.0
    },
    {
        "text": " Hay muchas maneras de cometer un delito. Eso no es él.",
        "start": 614.0,
        "end": 617.0
    },
    {
        "text": " Entonces, cuando yo cometo un delito me van a procesar y el estado me adjudica a un defensor de oficio y ahí también un fiscal.",
        "start": 618.0,
        "end": 632.0
    },
    {
        "text": " El poder judicial le dice un defensor y un fiscal. Entonces, digamos que hay 12 defensores de oficio.",
        "start": 633.0,
        "end": 641.0
    },
    {
        "text": " Y que hay 20 fiscales.",
        "start": 647.0,
        "end": 654.0
    },
    {
        "text": " De cuántas maneras me pueden ser asignado un defensor y un fiscal.",
        "start": 655.0,
        "end": 665.0
    },
    {
        "text": " 20 por cosas exactamente.",
        "start": 665.0,
        "end": 672.0
    },
    {
        "text": " Exactamente.",
        "start": 672.0,
        "end": 679.0
    },
    {
        "text": " Entonces, la respuesta acá como muchos dijeron es 12 por 20.",
        "start": 679.0,
        "end": 708.0
    },
    {
        "text": " Porque si el primer defensor es el doctor Pérez, si me asignan como defensor el doctor Pérez, pueden asignarme como fiscal a cada uno de los 20 fiscales.",
        "start": 709.0,
        "end": 728.0
    },
    {
        "text": " Entonces, ahí hay 20 posibilidades en las cuales Pérez es mi defensor. Pero si me van a asignar a la doctora Rodríguez como defensor, también me las pueden asignar.",
        "start": 728.0,
        "end": 741.0
    },
    {
        "text": " Hay 20 maneras de hacer lo que es asignarme como defensor a la doctora Rodríguez y cada uno de los 20 fiscales.",
        "start": 741.0,
        "end": 748.0
    },
    {
        "text": " Entonces, por cada defensor hay 20 fiscales posibles y son 12 defensores. Entonces, ahí hay 20 maneras en que me pueden ser asignada una pareja de defensorificada.",
        "start": 749.0,
        "end": 763.0
    },
    {
        "text": " Entonces, acá lo que usamos es lo que se llama la regla del producto.",
        "start": 764.0,
        "end": 770.0
    },
    {
        "text": " Y la regla del producto dice así.",
        "start": 770.0,
        "end": 777.0
    },
    {
        "text": " Si un procedimiento tiene una primera y una segunda etapa.",
        "start": 777.0,
        "end": 784.0
    },
    {
        "text": " Si un procedimiento tiene una primera y una segunda etapa.",
        "start": 784.0,
        "end": 791.0
    },
    {
        "text": " Hay, en las maneras de realizar la primera.",
        "start": 791.0,
        "end": 798.0
    },
    {
        "text": " Y, en maneras de realizar la segunda.",
        "start": 821.0,
        "end": 828.0
    },
    {
        "text": " Entonces, hay N por M maneras de llevar a cabo el procedimiento.",
        "start": 828.0,
        "end": 843.0
    },
    {
        "text": " Entonces, en el ejemplo anterior el procedimiento es la asignación de donde es fensor y fiscal, la primera etapa y se elegir un defensor y la segunda etapa es elegir un fiscal.",
        "start": 851.0,
        "end": 870.0
    },
    {
        "text": " Hay que hacer las dos cosas. Hay 12 maneras de elegir un defensor, 20 maneras de elegir un fiscal, hay 12 por 20 maneras de realizar el procedimiento consistente en asignarme un defensor y fiscal.",
        "start": 871.0,
        "end": 892.0
    },
    {
        "text": " Entonces, esta regla también es bastante intuitiva, se entiende?",
        "start": 893.0,
        "end": 902.0
    },
    {
        "text": " Muy bien.",
        "start": 903.0,
        "end": 909.0
    },
    {
        "text": " Entonces, un ejemplo similar sería, en el curso de matemática discreta hay tres docentes de teóricos y hay cinco docentes de práctico.",
        "start": 909.0,
        "end": 931.0
    },
    {
        "text": " El responsable del curso es un docente de teórico y el coordinador del curso es un docente de práctico.",
        "start": 933.0,
        "end": 944.0
    },
    {
        "text": " Entonces, ¿cuántas maneras es posible elegir un responsable y un coordinador?",
        "start": 944.0,
        "end": 954.0
    },
    {
        "text": " Tenemos tres maneras de elegir un responsable del curso. Es elegir uno de los tres docentes de teórico y cinco maneras de elegir un coordinador del curso entre los dos centes de práctico.",
        "start": 955.0,
        "end": 974.0
    },
    {
        "text": " Entonces, tenemos tres por cinco maneras de elegir un par responsable y coordinador.",
        "start": 974.0,
        "end": 982.0
    },
    {
        "text": " Entonces, esa es la regla del producto.",
        "start": 983.0,
        "end": 1005.0
    },
    {
        "text": " Otro ejemplo es el siguiente. ¿Cómo podemos contar la cantidad de matrículas posibles de autos?",
        "start": 1006.0,
        "end": 1014.0
    },
    {
        "text": " Entonces, una matrícula que tiene tres letras y cuatro dígitos. ¿No?",
        "start": 1015.0,
        "end": 1036.0
    },
    {
        "text": " Entonces, ¿cuántas matrículas posibles hay? 26 letras.",
        "start": 1037.0,
        "end": 1043.0
    },
    {
        "text": " Entonces, hay que elegir la primera letra, la segunda, la tercera, el primer dígito, el segundo, el tercero cuarto.",
        "start": 1043.0,
        "end": 1050.0
    },
    {
        "text": " Entonces, ¿cuántas maneras podemos elegir la primera letra de 26 maneras?",
        "start": 1050.0,
        "end": 1058.0
    },
    {
        "text": " Lo mismo con la segunda y lo mismo con la tercera.",
        "start": 1059.0,
        "end": 1063.0
    },
    {
        "text": " Por la regla del producto hay 26 por 26, por 26 maneras de elegir las tres letras en el orden en que van a ir puestas en la matrícula.",
        "start": 1063.0,
        "end": 1076.0
    },
    {
        "text": " Y después hay diez maneras de elegir el primer dígito, diez maneras de elegir el segundo dígito, el tercero y el cuarto.",
        "start": 1077.0,
        "end": 1088.0
    },
    {
        "text": " Entonces, hay esa cantidad de matrículas posibles con tres letras y cuatro dígitos.",
        "start": 1088.0,
        "end": 1097.0
    },
    {
        "text": " Esto sería una aplicación de la regla del producto con más de dos etapas.",
        "start": 1107.0,
        "end": 1113.0
    },
    {
        "text": " Si, en este caso, siete etapas, la elección de la primera letra, la segunda, la tercera, primer dígito, etc.",
        "start": 1113.0,
        "end": 1120.0
    },
    {
        "text": " Y hay ejemplos, hay casos en los cuales para contar aplicamos la regla del producto de la suma.",
        "start": 1121.0,
        "end": 1130.0
    },
    {
        "text": " Un caso sería este.",
        "start": 1130.0,
        "end": 1132.0
    },
    {
        "text": " En el lenguaje de programación basic, en el cual probablemente nunca hayan programado porque es muy digito.",
        "start": 1133.0,
        "end": 1150.0
    },
    {
        "text": " En algunas de las versionas de las más primitivas, las variables se escriben con letras.",
        "start": 1151.0,
        "end": 1161.0
    },
    {
        "text": " O sea, por ejemplo, la letra A puede ser una variable, o una letra seguida de un número.",
        "start": 1168.0,
        "end": 1177.0
    },
    {
        "text": " Entonces, por ejemplo, una variable puede ser la letra A o una variable puede ser seguida de un dígito, perdón, o no de un número.",
        "start": 1181.0,
        "end": 1196.0
    },
    {
        "text": " Una variable puede ser E2.",
        "start": 1196.0,
        "end": 1202.0
    },
    {
        "text": " Y en este lenguaje, además, no hay distinción entre mayúsculas y minúsculas.",
        "start": 1203.0,
        "end": 1209.0
    },
    {
        "text": " O sea, no existe la variable A mayúscula y la variable A minúscula.",
        "start": 1209.0,
        "end": 1213.0
    },
    {
        "text": " Entonces, ¿cuántas variables hay? ¿Cuántas variables hay? ¿Cuántas variables hay? ¿Cuántas variables hay?",
        "start": 1213.0,
        "end": 1224.0
    },
    {
        "text": " ¿Cuántas variables hay que sean letras? 26. ¿Y cuántas variables hay que sean una letra seguida de un dígito? 26 por 10.",
        "start": 1224.0,
        "end": 1239.0
    },
    {
        "text": " Sí, acá estamos aplicando la regla del producto. Y una variable es cualquiera de estas dos cosas. Una letra o una letra seguida de un dígito.",
        "start": 1240.0,
        "end": 1250.0
    },
    {
        "text": " Entonces, 26 más, 26 por 10 variables. Y acá estamos aplicando la regla de la suma.",
        "start": 1250.0,
        "end": 1259.0
    },
    {
        "text": " Nos interesa una variable este tipo o bien una variable este tipo.",
        "start": 1259.0,
        "end": 1266.0
    },
    {
        "text": " Vamos a ver lo que son las permutaciones. Entonces, devuelta un ejemplo.",
        "start": 1269.0,
        "end": 1276.0
    },
    {
        "text": " El tipo de problema que vamos a resolver es el siguiente. En una oficina pública hay 10 funcionarios.",
        "start": 1276.0,
        "end": 1287.0
    },
    {
        "text": " Y la corte electoral quiere elegir de ahí tres funcionarios para integrar una mesa de votación para las elecciones intratas.",
        "start": 1287.0,
        "end": 1304.0
    },
    {
        "text": " Entonces, es una mesa de votación. ¿Cómo se compone?",
        "start": 1305.0,
        "end": 1314.0
    },
    {
        "text": " Muchos de ustedes no han votado, van a votar por primera vez el año que viene. Es una mesa tiene un presidente, un secretario.",
        "start": 1317.0,
        "end": 1330.0
    },
    {
        "text": " Y un vocal. Entonces, de cuántas maneras puede la corte electoral elegir integrar una mesa de votación con los 10 funcionarios de esta oficina.",
        "start": 1335.0,
        "end": 1352.0
    },
    {
        "text": " ¿Cómo piensan esto? ¿Cuántas maneras hay elegir un presidente?",
        "start": 1352.0,
        "end": 1366.0
    },
    {
        "text": " 10 ¿sí? Hay 10 opciones posibles para el presidente. Ahora, una vez que elegimos el presidente,",
        "start": 1367.0,
        "end": 1387.0
    },
    {
        "text": " quedan 9 funcionarios, entre ellos se lige, un secretario. Y por la regla del producto, hay 10 por 9 elecciones posibles.",
        "start": 1387.0,
        "end": 1411.0
    },
    {
        "text": " Y ahora, una vez que tenemos el presidente y secretario hay 8 maneras de elegir el vocal.",
        "start": 1412.0,
        "end": 1420.0
    },
    {
        "text": " Entonces, hay 10 por 9 por 8 maneras de integrar una mesa de votación con funcionarios de esta oficina.",
        "start": 1421.0,
        "end": 1438.0
    },
    {
        "text": " ¿Cómo se compone?",
        "start": 1439.0,
        "end": 1446.0
    },
    {
        "text": " Acá observan que contamos como sientes diferentes, la mesa, digamos, en que el presidente es Martínez.",
        "start": 1446.0,
        "end": 1459.0
    },
    {
        "text": " Y el vocal, esperes, este es una mesa distinta de la mesa en que el presidente es Peres, el secretario es Martínez y el vocal es García.",
        "start": 1459.0,
        "end": 1485.0
    },
    {
        "text": " ¿Cómo está? ¿Quién cumple cada función? No es solamente que elegimos 3 funcionarios de la oficina, sino que además, a cada uno le asignamos un rol.",
        "start": 1486.0,
        "end": 1499.0
    },
    {
        "text": " Y, dicho de otro modo, que los elegimos en un cierto orden. Si cambiamos el orden, es distinto.",
        "start": 1499.0,
        "end": 1508.0
    },
    {
        "text": " Entonces, acá tenemos 10 maneras de elegir un primer funcionario, una vez que elegimos el primero, tenemos 9 maneras de elegir al segundo.",
        "start": 1508.0,
        "end": 1517.0
    },
    {
        "text": " Y una vez que elegimos a los primeros dos, tenemos 8 maneras de elegir al tercero.",
        "start": 1517.0,
        "end": 1526.0
    },
    {
        "text": " Este problema es distinto de, por ejemplo, las posibles jugadas del 5 de oro. ¿Sí? Porque fíjense que en el 5 de oro tenemos que elegir 5 números entre 40 y algo, 44.",
        "start": 1526.0,
        "end": 1551.0
    },
    {
        "text": " Pero si yo elijo en los números 1, 2, 3, 4, 5, eso es lo mismo que elegir 5, 4, 3, 2, 1.",
        "start": 1551.0,
        "end": 1560.0
    },
    {
        "text": " Porque al final lo que importa para ganar es que yo haya elegido el 5 bolilla ganadoras, no importa el orden en que salen estas bolillas.",
        "start": 1560.0,
        "end": 1569.0
    },
    {
        "text": " En cambio, acá para elegir la mesa de votación, elegir a los mismos 3 funcionarios en un orden diferente, dan mesa de votación diferente.",
        "start": 1569.0,
        "end": 1581.0
    },
    {
        "text": " Entonces, ¿qué quería definir? Vamos a dar un poco de votación.",
        "start": 1581.0,
        "end": 1598.0
    },
    {
        "text": " Si n es un número natural, mayor igual que 1, probablemente ya conozcan el número n factorial, que es multiplicar n por n menos 1, por n menos 2, por 2, por 1.",
        "start": 1598.0,
        "end": 1618.0
    },
    {
        "text": " Esto es n factorial. Esto para todos los números naturales, mayores iguales que 1.",
        "start": 1618.0,
        "end": 1630.0
    },
    {
        "text": " Y por una cuestión de practicidad se establece la siguiente notación, que es que 0 factorial se define como cien de igual a 1.",
        "start": 1630.0,
        "end": 1641.0
    },
    {
        "text": " Entonces, en el ejemplo, la manera las distintas maneras de elegir una mesa de votación son 10 por 9 por 8, que es, o escribir esto, si, 10 por 9 por 8 por 7, etc., hasta por 2 por 1.",
        "start": 1642.0,
        "end": 1669.0
    },
    {
        "text": " Y después dividir entre todo lo que agreguen, que es 7 por 6, etc., hasta por 1. O sea, esto lo puedo escribir también como 10 factorial, dividido 7 factorial.",
        "start": 1669.0,
        "end": 1686.0
    },
    {
        "text": " Bueno, entonces, vamos a generalizar un poco el ejemplo.",
        "start": 1687.0,
        "end": 1710.0
    },
    {
        "text": " Si tenemos un conjunto de N objetos, dar 1 orden de esos objetos, o sea, decir cuál es el primero, cuál es el segundo, etc., etc.,",
        "start": 1710.0,
        "end": 1739.0
    },
    {
        "text": " un do etcétera, se llama dar una permutación de estos objetos, o sea, simplemente eso,",
        "start": 1739.0,
        "end": 1761.72
    },
    {
        "text": " decir, de estos en objetos, este es el objeto 1, el 2, el 3, el 4 como ponerlos en ilera",
        "start": 1761.72,
        "end": 1766.88
    },
    {
        "text": " es dar una permutación y si ahora lo que hago es tomar un número entre 1 y n, lo que voy",
        "start": 1766.88,
        "end": 1780.0
    },
    {
        "text": " a hacer es elegir R de los objetos y eso se reordenarlos, eso es lo que hacemos acá",
        "start": 1780.0,
        "end": 1787.96
    },
    {
        "text": " en el ejemplo, acá de 10 funcionarios elegimos 3 y los ordenamos, presidente secretario",
        "start": 1787.96,
        "end": 1793.88
    },
    {
        "text": " local, entonces, entonces a ver cómo llame el libro a esto se llama una permutación de",
        "start": 1793.88,
        "end": 1806.96
    },
    {
        "text": " tamaño R, es la elección de R objetos entre los n, en forma ordenada, o sea, agarrar",
        "start": 1806.96,
        "end": 1836.64
    },
    {
        "text": " R y decir de esos Arras, cuál es el primero, el segundo, el tercero y en R, esimo, entonces",
        "start": 1836.64,
        "end": 1855.64
    },
    {
        "text": " vamos a llamar PN a la cantidad de permutaciones de n objetos",
        "start": 1855.64,
        "end": 1880.3200000000002
    },
    {
        "text": " de tamaño R, entonces vamos a contar cuáles son estos números, o serven que P subn es simplemente",
        "start": 1880.32,
        "end": 1903.4399999999998
    },
    {
        "text": " lo que podremos llamar PN, o sea, dar un orden de elegirlos los n y dar un orden de los n,",
        "start": 1903.44,
        "end": 1914.92
    },
    {
        "text": " entonces cuantas maneras hay de ordenar n objetos, no elegir R y ordenarlos sino ordenarlos",
        "start": 1914.92,
        "end": 1936.96
    },
    {
        "text": " n, entonces yo tengo n cosas, digamos, yo tengo cuando yo era maestra escuela tenía la clase",
        "start": 1936.96,
        "end": 1948.1200000000001
    },
    {
        "text": " de n niños y los ponía en fila, cuantas maneras tenía dar mar la fila, bueno tenía n opciones",
        "start": 1948.1200000000001,
        "end": 1955.16
    },
    {
        "text": " para el primero de la fila, una vez que había elegido el primero de la fila tenía n menos 1 opciones",
        "start": 1955.16,
        "end": 1962.88
    },
    {
        "text": " para el segundo, entonces como muchos han dicho acá la manera de hay n factorial maneras de ordenar",
        "start": 1962.88,
        "end": 1973.64
    },
    {
        "text": " a los n objetos o a los n niños en una fila y bueno y el problema de la mesa corresponde a cómo ordenar",
        "start": 1973.64,
        "end": 1984.3600000000001
    },
    {
        "text": " R objetos que elegimos, entonces esto es tengo n maneras de elegir el primero, n menos 1 maneras de",
        "start": 1984.36,
        "end": 1999.7199999999998
    },
    {
        "text": " elegir el segundo hasta, sí, bueno, pero claro, pero lo divido entre querias, o sea la misma pregunta,",
        "start": 1999.72,
        "end": 2021.28
    },
    {
        "text": " la pregunta de dónde termina esto es la misma que le ponte en el que diría, n menos serven más 1,",
        "start": 2021.28,
        "end": 2024.88
    },
    {
        "text": " dijo ahí, porque fíjense que voy a tener acá R factores, entonces este es n menos 0,",
        "start": 2024.88,
        "end": 2035.68
    },
    {
        "text": " n menos 1, n menos 2 hasta R menos, n menos R menos 1, n menos R más 1, ¿se ve? Son R factores acá,",
        "start": 2035.68,
        "end": 2050.76
    },
    {
        "text": " entonces porque voy a elegir R cosas, ¿se? Entonces la primera cosa tengo n posibilidades que lo voy a",
        "start": 2051.32,
        "end": 2058.88
    },
    {
        "text": " elegir, el voy a escribir el n maniosamente, sí, la segunda manera tengo, estoy elegiendo entre,",
        "start": 2058.88,
        "end": 2067.6800000000003
    },
    {
        "text": " ya no entre n sino entre n menos 1, el tercero lo estoy elegiendo entre n menos 2, n menos 3, n menos 4,",
        "start": 2067.6800000000003,
        "end": 2079.84
    },
    {
        "text": " entonces el primero lo elegí entre n menos 0, el R es 1, lo elijo entre n menos R menos 1,",
        "start": 2080.76,
        "end": 2090.92
    },
    {
        "text": " entre n menos R menos 1, ¿sí?",
        "start": 2090.92,
        "end": 2097.2400000000002
    },
    {
        "text": " este es el R esimo porque el primero es esto, y esto es n menos R más 1, ¿qué? Como decía el",
        "start": 2097.24,
        "end": 2112.72
    },
    {
        "text": " compañero ahí también lo puedo escribir como n factorial dividido n menos R factorial, ¿sí?",
        "start": 2112.72,
        "end": 2137.8799999999997
    },
    {
        "text": " porque fíjense que lo que tengo ahí arriba es voy a escribir lo que tengo ahí arriba n por n menos 1",
        "start": 2138.88,
        "end": 2145.36
    },
    {
        "text": " hasta n menos R más 1 para completar n factorial tengo que agregar n menos R, ¿sí? y es el que le",
        "start": 2145.36,
        "end": 2156.1600000000003
    },
    {
        "text": " sigue hasta 1, entonces como multiplique por esto tengo que dividir n menos R, n menos R menos 1,",
        "start": 2156.1600000000003,
        "end": 2165.7200000000003
    },
    {
        "text": " etcétera, entonces esto que está acá es n menos R factorial y ahora sí esto que está acá me",
        "start": 2165.72,
        "end": 2177.7999999999997
    },
    {
        "text": " quedó en el factorial, bueno, entonces",
        "start": 2177.8,
        "end": 2193.04
    },
    {
        "text": " un ejemplo sencillo digamos y se siguiente yo tengo las letras ABC es un conjunto de tres elementos",
        "start": 2193.04,
        "end": 2214.72
    },
    {
        "text": " cuantas maneras tengo de ordenarlas tengo permutaciones de tres maneras de ordenarlas,",
        "start": 2214.72,
        "end": 2224.0
    },
    {
        "text": " ¿sí? que dijimos que es 3 factorial que es 3 por 2 por 1 permutaciones de estas 3 letras,",
        "start": 2224.0,
        "end": 2235.3599999999997
    },
    {
        "text": " o sea maneras de ordenar estas 3 letras y bueno y eso está bien porque de qué manera puedo",
        "start": 2235.36,
        "end": 2245.76
    },
    {
        "text": " ordenar estas 3 letras o sea ser palabras que tengan las 3 si empiezo con la tengo ABC y",
        "start": 2245.76,
        "end": 2255.2000000000003
    },
    {
        "text": " a c ve las que empiezan con B son B a c y B a y las que empiezan con C son C a B y C ve a y",
        "start": 2255.2,
        "end": 2269.52
    },
    {
        "text": " efectivamente eso son los 6 órdenes posible para estas 3 letras, ahora si quiero con estas 3",
        "start": 2269.52,
        "end": 2280.12
    },
    {
        "text": " letras es escribir palabras de 2 letras, o sea si quiero permutaciones de tamaño 2,",
        "start": 2280.12,
        "end": 2286.3599999999997
    },
    {
        "text": " según nuestra fórmula la cantidad de materia de maneras de hacer eso sería 3 factorial sobre 3",
        "start": 2290.7599999999998,
        "end": 2298.2799999999997
    },
    {
        "text": " menos 2 factorial o sea 3 factorial dividido 1 factorial que también es 6, entonces con esas 3",
        "start": 2298.28,
        "end": 2310.96
    },
    {
        "text": " letras puedo formar 6 palabras de tamaño 2 y eso veamos y cierto, a ver vamos a ver cuánta",
        "start": 2310.96,
        "end": 2323.44
    },
    {
        "text": " palabras, por ejemplo, dejan afuera la C, la palabra A y la palabra B son las que no tienen C,",
        "start": 2323.44,
        "end": 2331.92
    },
    {
        "text": " ahora las que no tienen B son a C y C a y las que no tienen C, los que no tienen A, perdón son B",
        "start": 2331.92,
        "end": 2342.36
    },
    {
        "text": " C y C ve, entonces efectivamente hay 6 palabras de tamaño 2 o sea 6 maneras de elegir 2 letras en un orden",
        "start": 2342.36,
        "end": 2358.48
    },
    {
        "text": " y esto son las permutaciones de 3 de tamaño 2 muy bien",
        "start": 2358.48,
        "end": 2375.48
    },
    {
        "text": " ahora vamos a mirar un poquito esta fórmula que está acá, acá como yo hasta acá yo venía",
        "start": 2375.48,
        "end": 2399.62
    },
    {
        "text": " bárbaro porque siempre cuando no divida entre 0 multiplico todo lo que quiero al pasar de acá acá",
        "start": 2399.62,
        "end": 2407.66
    },
    {
        "text": " en principio la permutación de n elementos de tamaño n podría ser la permutación de perdón la n",
        "start": 2409.8199999999997,
        "end": 2418.5
    },
    {
        "text": " elementos de tamaño r podría ser de tamaño n o sea elegir todos los elementos y ordenarlos",
        "start": 2418.5,
        "end": 2426.38
    },
    {
        "text": " entonces acá cuando n y cr me queda n menos n que 0, entonces 0 factorial que es 1 y por eso definimos 0",
        "start": 2427.26,
        "end": 2443.62
    },
    {
        "text": " factorial que es igual a 1, esta acá me queda n factorial lo cual efectivamente coincide con",
        "start": 2443.62,
        "end": 2449.2200000000003
    },
    {
        "text": " las permutaciones de los n elementos entonces en realidad esta fórmula sirve para incluso",
        "start": 2449.22,
        "end": 2461.8999999999996
    },
    {
        "text": " digamos cuando de rs n caso en el cual las permutaciones de n y tamaño n y no son simplemente las",
        "start": 2461.8999999999996,
        "end": 2469.8999999999996
    },
    {
        "text": " permutaciones de n eso esa fórmula está bien incluso en ese caso entonces ahora van a trabajar un",
        "start": 2469.9,
        "end": 2478.1800000000003
    },
    {
        "text": " poco ustedes vamos a hacer un ejemplo yo voy a tomar la palabra aldo alguien acasi malo",
        "start": 2478.1800000000003,
        "end": 2495.02
    },
    {
        "text": " no hay altos ya cuántas palabras puedo escribir con las mismas letras no no necesariamente que tenga sentido",
        "start": 2495.02,
        "end": 2505.38
    },
    {
        "text": " con las mismas letras de la palabra aldo que tengan tu ah ah y va bueno que tengan todas las letras",
        "start": 2525.02,
        "end": 2542.98
    },
    {
        "text": " cuántas palabras de cuatro letras y se pregunta en campo que hay que ser 4 factorial exactamente si",
        "start": 2542.98,
        "end": 2556.5
    },
    {
        "text": " simplemente todas las permutaciones de las cuatro letras o sea las cuatro letras de la palabra aldo",
        "start": 2556.5,
        "end": 2570.54
    },
    {
        "text": " las reordeno de cualquier manera y eso me da cuatro factorial ahora cuantas palabras",
        "start": 2570.54,
        "end": 2578.3
    },
    {
        "text": " de al menos una letra",
        "start": 2585.22,
        "end": 2586.9
    },
    {
        "text": " puedo elegir con las letras de la palabra aldo 4 factorial más 3 factorial más 2 factorial más 1",
        "start": 2586.9,
        "end": 2606.02
    },
    {
        "text": " factorial",
        "start": 2606.02,
        "end": 2606.46
    },
    {
        "text": " vean lo que dice el compañero lo que dice el compañero es esto no se puedan repetir las letras o",
        "start": 2606.46,
        "end": 2616.02
    },
    {
        "text": " sea imagínese que estas letras son fichitas del scrabel que tengo una a una a una a una a una a y una a",
        "start": 2616.02,
        "end": 2622.2200000000003
    },
    {
        "text": " no tengo 28 a tengo una cuantas palabras puedo formar con esas cuatro letras que tengan sentido no",
        "start": 2622.2200000000003,
        "end": 2631.38
    },
    {
        "text": " entonces lo que dice el compañero es tengo todas las palabras de cuatro letras más todas las de tres más",
        "start": 2631.38,
        "end": 2637.94
    },
    {
        "text": " todas las de dos más todas las de una entonces por la regla de la suma el resultado va a ser la suma",
        "start": 2637.94,
        "end": 2649.42
    },
    {
        "text": " de todas las palabras de cuatro más todas las palabras de tres más todas las de dos y todas las de",
        "start": 2650.06,
        "end": 2655.7400000000002
    },
    {
        "text": " uno entonces el resultado va a ser de esta forma palabras de cuatro letras",
        "start": 2655.7400000000002,
        "end": 2665.48
    },
    {
        "text": " más la cantidad de palabras de tres letras más la cantidad de palabras de dos letras más la",
        "start": 2668.3,
        "end": 2674.62
    },
    {
        "text": " cantidad de palabras de una letra. Entonces, ahora las de cuatro letras son simplemente",
        "start": 2674.62,
        "end": 2687.42
    },
    {
        "text": " hay que reordenar estas cuatro letras, o sea, son permutaciones de cuatro que es cuatro",
        "start": 2687.42,
        "end": 2691.7
    },
    {
        "text": " factoriales. ¿Cuántas palabras puedo formar de tres letras con las letras de la palabra",
        "start": 2691.7,
        "end": 2701.94
    },
    {
        "text": " de cuatro? Claro, pero en términos de permutaciones? Claro, no. Cuatro factoriales sobre cuatro",
        "start": 2701.94,
        "end": 2717.16
    },
    {
        "text": " menos uno factorial. ¿Por qué? O sea, ¿qué tengo que hacer? Tengo que elegir tres letras",
        "start": 2717.16,
        "end": 2722.86
    },
    {
        "text": " y ordenarlas. Eso son las permutaciones de cuatro de tamaño tres. O sea, elegir",
        "start": 2722.86,
        "end": 2730.14
    },
    {
        "text": " tres letras en un orden. Eligir la primera, les son las dos. Las palabras de dos letras van",
        "start": 2730.14,
        "end": 2745.3399999999997
    },
    {
        "text": " a ser, tengo que tomar permutaciones de cuatro de tamaño dos, porque tengo que elegir",
        "start": 2745.3399999999997,
        "end": 2755.16
    },
    {
        "text": " dos letras de las cuatro en un orden. O sea, la primera, les son las cuatro. Y después",
        "start": 2755.16,
        "end": 2761.72
    },
    {
        "text": " tengo permutaciones de cuatro de tamaño uno, que es una manera muy concheta, es decir,",
        "start": 2761.72,
        "end": 2768.2
    },
    {
        "text": " elegir una letra de esas cuatro, para lo cual va a ser claro que tengo cuatro opciones.",
        "start": 2768.2,
        "end": 2774.16
    },
    {
        "text": " Así que esto más vale que son cuatro. Entonces, saber cuánto existo. Esto va a ser las",
        "start": 2774.16,
        "end": 2792.6
    },
    {
        "text": " permutaciones de cuatro, son cuatro factoriales. Las permutaciones de cuatro de tamaño tres van",
        "start": 2792.6,
        "end": 2800.2799999999997
    },
    {
        "text": " a ser cuatro factoriales sobre cuatro menos tres factoriales. Acá voy a tener cuatro",
        "start": 2800.2799999999997,
        "end": 2810.38
    },
    {
        "text": " factorial sobre cuatro menos dos factoriales. Acá voy a tener cuatro, perdón, cuatro factoriales",
        "start": 2810.38,
        "end": 2822.46
    },
    {
        "text": " sobre cuatro menos uno factoriales. Esto es cuatro factoriales más cuatro factoriales sobre",
        "start": 2822.46,
        "end": 2836.34
    },
    {
        "text": " uno factorial, que de vuelta cuatro factoriales más cuatro factoriales sobre dos factoriales",
        "start": 2836.34,
        "end": 2843.34
    },
    {
        "text": " más cuatro factoriales sobre tres factoriales. Esto última efectivamente es el número cuatro,",
        "start": 2843.34,
        "end": 2853.2200000000003
    },
    {
        "text": " menos mal. Eso que estáis un número y esa es la cantidad. ¿Cuánto es cuatro factoriales?",
        "start": 2853.2200000000003,
        "end": 2865.34
    },
    {
        "text": " ¿Y cinco factoriales?",
        "start": 2866.34,
        "end": 2868.34
    },
    {
        "text": " Cinco era 24 por 5. Ahí va. ¿Y seis factoriales?",
        "start": 2872.34,
        "end": 2879.34
    },
    {
        "text": " 120 por 6, que es?",
        "start": 2882.34,
        "end": 2884.34
    },
    {
        "text": " 720. ¿Y eso es seis factoriales? ¿Y siete factoriales?",
        "start": 2885.34,
        "end": 2890.34
    },
    {
        "text": " Los factoriales crecen súper rápidos, ¿eh? Por eso los factoriales son fios de calcular,",
        "start": 2891.34,
        "end": 2898.34
    },
    {
        "text": " por eso yo siempre vivo acá con cuatro factoriales y mezal de día. Quiero pensar, pero bueno.",
        "start": 2898.34,
        "end": 2903.34
    },
    {
        "text": " Los factoriales crecen rápidísimo. Sí, ya cuando tienen algo del orden de diez factorial,",
        "start": 2903.34,
        "end": 2908.34
    },
    {
        "text": " lo que tienen es tipo sí. Muy bien. Entonces, barbaro, eso es todo lo que podemos hacer con la palabra",
        "start": 2908.34,
        "end": 2918.34
    },
    {
        "text": " alto. Ahora, este es el ejemplo uno. Ahora en mi escravel tengo la palabra lara, tengo un",
        "start": 2918.34,
        "end": 2937.34
    },
    {
        "text": " l, una, una r y otra. Entonces, ¿cuántas palabras de cuatro letras?",
        "start": 2937.34,
        "end": 2946.34
    },
    {
        "text": " ¿Puedo escribir?",
        "start": 2946.34,
        "end": 2958.34
    },
    {
        "text": " Con las letras de la palabra lara.",
        "start": 2958.34,
        "end": 2972.34
    },
    {
        "text": " No, las azonás vos alguno desviste un juego escravel, pues tienes una nada, tienes la otra, las miras son igualitas.",
        "start": 2988.34,
        "end": 3002.34
    },
    {
        "text": " Le de allá es la forma normal y la divise. ¿Qué es la forma normal? A ver.",
        "start": 3002.34,
        "end": 3012.34
    },
    {
        "text": " La que ya tenía ahí. ¿Por qué divís entre dos? Aiva. Entiende lo que dice el compañero?",
        "start": 3013.34,
        "end": 3023.34
    },
    {
        "text": " Yo creí que la forma normal era algo como la forma canónica de Jordan, la, la, ¿qué es eso?",
        "start": 3023.34,
        "end": 3031.34
    },
    {
        "text": " Creí que era una palabra matemática, la forma normal, no la forma usual. A ver.",
        "start": 3031.34,
        "end": 3036.34
    },
    {
        "text": " Lo que dice el compañero es lo siguiente, a ver si lo que dice es que ¿qué pasa si yo pienso que la primera a es una cosa y la segunda a es otra?",
        "start": 3037.34,
        "end": 3050.34
    },
    {
        "text": " Lo voy a escribir así. Las az las pienso como distintas. La primera la llamó a su uno y la otra la llamó a su dos.",
        "start": 3050.34,
        "end": 3060.34
    },
    {
        "text": " Entonces, si pienso que las dosas son distintas, acá tengo cuatro factorial posibilidades.",
        "start": 3061.34,
        "end": 3069.34
    },
    {
        "text": " Ahora, en realidad las az no son distintas. Entonces, cuando yo pienso que las az son distintas, la primera y la segunda a,",
        "start": 3076.34,
        "end": 3089.34
    },
    {
        "text": " tengo cuatro factorial posibilidades, pero cuando quiero dejar de pensar que son distintas, cada palabra apareció dos veces. ¿Sí?",
        "start": 3090.34,
        "end": 3103.34
    },
    {
        "text": " O sea, en realidad, digamos la palabra L, primera R, segunda a, y la palabra L, segunda a,",
        "start": 3103.34,
        "end": 3118.34
    },
    {
        "text": " segunda a, R, primera son iguales.",
        "start": 3118.34,
        "end": 3125.34
    },
    {
        "text": " Lo mismo con la palabra primera, segunda a, L, R, y segunda a, primera a, L, R.",
        "start": 3131.34,
        "end": 3146.34
    },
    {
        "text": " Entonces, cada palabra cuando yo cuento así como si fueran diferentes, aparece dos veces.",
        "start": 3149.34,
        "end": 3157.34
    },
    {
        "text": " Entonces, la cantidad de palabras pedidas es cuatro factorial divididos. ¿Sí? Porque al contarlas acá, cada palabra está contada.",
        "start": 3157.34,
        "end": 3177.34
    },
    {
        "text": " Entonces, cuatro factorial son las posibilidades y pienso que las az son distintas.",
        "start": 3178.34,
        "end": 3189.34
    },
    {
        "text": " ¿Sí? ¿Y en de esto no? ¿Alguien se llama rolofo? ¿Qué pasa con rolofo? ¿Cuántas palabras de uno, dos, tres, cuatro, cinco, seis, siete letras se pueden escribir usando la palabra R, ¿Sí?",
        "start": 3190.34,
        "end": 3218.34
    },
    {
        "text": " ¿Unsando las letras de la palabra R, rolofo? ¿Sobre tres, sobre tres factorial? ¿Alguien se llama?",
        "start": 3218.34,
        "end": 3231.34
    },
    {
        "text": " Entonces, mismo razonamiento, ¿Sí? Pienso que las azos son distintas. Tengo primera a o, segunda a o, tercera a o.",
        "start": 3231.34,
        "end": 3246.34
    },
    {
        "text": " Entonces, si las azos son diferentes.",
        "start": 3246.34,
        "end": 3252.34
    },
    {
        "text": " Hay tantas posibilidades como maneras de ordenar las siete letras que son siete factoriales. ¿Sí?",
        "start": 3252.34,
        "end": 3274.34
    },
    {
        "text": " Si todas las letras son distintas, estoy mirando simplemente cuántas maneras hay de ordenar esas siete letras. ¿Sí?",
        "start": 3274.34,
        "end": 3285.34
    },
    {
        "text": " Entonces, ahora, cuando quiero pensar que las azos son iguales, lo que tengo que hacer es ver cuántas veces se repite una palabra.",
        "start": 3285.34,
        "end": 3299.34
    },
    {
        "text": " O sea, acá digamos esto va a ser lo mismo que esto, lo mismo que, etc.",
        "start": 3299.34,
        "end": 3319.34
    },
    {
        "text": " Entonces, quiero ver esa palabra, la palabra R, rolofo en realidad cuántas veces apareció cuando yo hice esta cuenta.",
        "start": 3320.34,
        "end": 3332.34
    },
    {
        "text": " Tre factorial, dice alguien, ¿Por qué? ¿Sí? ¿Se ve eso? ¿Prarísimo? O sea, tantas maneras como maneras de esta ordenada las azos.",
        "start": 3333.34,
        "end": 3352.34
    },
    {
        "text": " Entonces, en realidad hay siete factorial dividido, tres factorial palabras de siete letras con las letras de la palabra R, rolofo.",
        "start": 3353.34,
        "end": 3371.34
    },
    {
        "text": " Estos son permutaciones de tres que son el orden en que van las azos.",
        "start": 3372.34,
        "end": 3382.34
    },
    {
        "text": " O sea, dicho de otra manera, cuando yo hice esta cuenta, cuantas veces con té la palabra R, rolofo.",
        "start": 3383.34,
        "end": 3400.34
    },
    {
        "text": " Bueno, con té la que tiene o uno primero o dos después o tres terceras, la que tiene primero o dos después o uno después o tres, la que tiene sí.",
        "start": 3401.34,
        "end": 3411.34
    },
    {
        "text": " Para cada orden posible de la azos o uno o dos o tres, la palabra R, rolofo pareció una vez en esta cuenta.",
        "start": 3411.34,
        "end": 3426.34
    },
    {
        "text": " ¿Tamos párbaro? ¿Cuántas palabras hay? Ahora en el Crabel me tocaron estas letras. ¿Cuántas palabras hay que se puedan formar con estas siete letras? ¿Qué empiecen y terminan con una consonante?",
        "start": 3426.34,
        "end": 3452.34
    },
    {
        "text": " Pero hay que remater a todos los temas, ale커zones, 편ajos, mundos y clearing más que tangledo.",
        "start": 3456.34,
        "end": 3475.34
    },
    {
        "text": " Entonces, esta palabra tiene cinco vocales y dos consorantes, entonces hay que elegir lo",
        "start": 3475.34,
        "end": 3492.2200000000003
    },
    {
        "text": " que dicen acá es, hay que elegir un orden para las cinco vocales que van a ir en el medio.",
        "start": 3492.2200000000003,
        "end": 3500.06
    },
    {
        "text": " Entonces, ya sabemos que las vocales van a ir en el medio que vamos a tener, y vamos a",
        "start": 3500.06,
        "end": 3506.82
    },
    {
        "text": " acá vamos a tener que tener consonante, acá vamos a tener que tener las cinco vocales",
        "start": 3506.82,
        "end": 3516.18
    },
    {
        "text": " y acá vamos a tener que tener consonante.",
        "start": 3516.18,
        "end": 3520.2999999999997
    },
    {
        "text": " Entonces, lo que tenemos que hacer es elegir las cinco vocales y las dos consorantes, un orden",
        "start": 3520.3,
        "end": 3534.5800000000004
    },
    {
        "text": " para las cinco vocales y las dos consorantes, entonces por la regla del producto tenemos",
        "start": 3534.5800000000004,
        "end": 3544.1000000000004
    },
    {
        "text": " dos etapas, elegir las vocales y elegir las consorantes, por la regla del producto la cantidad",
        "start": 3544.1,
        "end": 3551.18
    },
    {
        "text": " de palabras van a ser, la manera de elegir las consorantes por la manera de elegir las",
        "start": 3551.18,
        "end": 3557.58
    },
    {
        "text": " vocales, ¿tanto? ¿De acuerdo? La manera de elegir las vocales va a ser simplemente darle",
        "start": 3557.58,
        "end": 3565.3399999999997
    },
    {
        "text": " un orden a las cinco vocales que es cinco factorial, esta es la manera de elegir las vocales,",
        "start": 3565.34,
        "end": 3575.58
    },
    {
        "text": " es la manera de ordenar las vocales, elegir el orden de las vocales y después las consorantes",
        "start": 3579.82,
        "end": 3589.1800000000003
    },
    {
        "text": " están acá, son la r y la il. Y tenemos dos opciones, poner la r al principio y la il",
        "start": 3589.18,
        "end": 3598.2599999999998
    },
    {
        "text": " al final o al revés.",
        "start": 3598.2599999999998,
        "end": 3600.18
    },
    {
        "text": " Este dos, en realidad, son los dos órdenes posibles en que pueden las letras se reillé,",
        "start": 3608.18,
        "end": 3614.02
    },
    {
        "text": " se son las permutaciones de dos, este dos es dos factorial que dos, entonces este es la manera",
        "start": 3614.74,
        "end": 3624.58
    },
    {
        "text": " de ordenar las consorantes.",
        "start": 3626.74,
        "end": 3629.06
    },
    {
        "text": " Entonces,",
        "start": 3636.22,
        "end": 3637.06
    },
    {
        "text": " estas son las palabras que se forman usando las siete letras.",
        "start": 3645.02,
        "end": 3649.82
    },
    {
        "text": " ¿Cuántas palabras se pueden formar?",
        "start": 3658.22,
        "end": 3661.1
    },
    {
        "text": " De largo par,",
        "start": 3675.02,
        "end": 3676.9
    },
    {
        "text": " que comiencen y terminen con una consonante,",
        "start": 3685.74,
        "end": 3691.86
    },
    {
        "text": " se pueden formar con las letras de orelia.",
        "start": 3705.02,
        "end": 3711.86
    },
    {
        "text": " Sí.",
        "start": 3711.86,
        "end": 3712.86
    },
    {
        "text": " Entonces, si son de largo par, que largo pueden tener.",
        "start": 3728.86,
        "end": 3733.34
    },
    {
        "text": " Seis, cuatro o dos.",
        "start": 3735.86,
        "end": 3737.86
    },
    {
        "text": " Entonces, por la rica de la suma,",
        "start": 3742.86,
        "end": 3744.86
    },
    {
        "text": " esto va a ser la cantidad de palabras de largo seis,",
        "start": 3747.86,
        "end": 3750.86
    },
    {
        "text": " más la cantidad de palabras de largo cuatro,",
        "start": 3752.86,
        "end": 3755.86
    },
    {
        "text": " más la cantidad de palabras de largo dos.",
        "start": 3756.86,
        "end": 3759.86
    },
    {
        "text": " Porque",
        "start": 3771.86,
        "end": 3773.86
    },
    {
        "text": " para hacer consorantes,",
        "start": 3802.86,
        "end": 3804.86
    },
    {
        "text": " son permutaciones de cuatro,",
        "start": 3813.86,
        "end": 3816.86
    },
    {
        "text": " pero cuantas cocas les tengo?",
        "start": 3817.86,
        "end": 3819.86
    },
    {
        "text": " Hay las permutaciones de cinco y tamaño cuatro.",
        "start": 3832.86,
        "end": 3835.86
    },
    {
        "text": " Entonces,",
        "start": 3836.86,
        "end": 3837.86
    },
    {
        "text": " entonces,",
        "start": 3846.86,
        "end": 3848.86
    },
    {
        "text": " repasemos,",
        "start": 3848.86,
        "end": 3849.86
    },
    {
        "text": " para formar una palabra en largo seis,",
        "start": 3849.86,
        "end": 3851.86
    },
    {
        "text": " que dijo el compañero.",
        "start": 3854.86,
        "end": 3855.86
    },
    {
        "text": " Primero, como la primera y la última letra son consorantes,",
        "start": 3856.86,
        "end": 3859.86
    },
    {
        "text": " las dos consonantes que de acá, que son r y l,",
        "start": 3860.86,
        "end": 3863.86
    },
    {
        "text": " las voy a tener que usar.",
        "start": 3863.86,
        "end": 3864.86
    },
    {
        "text": " Entonces, ahí hay dos opciones,",
        "start": 3866.86,
        "end": 3868.86
    },
    {
        "text": " opongo la l al principio y la r al final,",
        "start": 3869.86,
        "end": 3872.86
    },
    {
        "text": " o al revés.",
        "start": 3872.86,
        "end": 3873.86
    },
    {
        "text": " Entonces, hay dos maneras de elegir las consonantes.",
        "start": 3876.86,
        "end": 3880.86
    },
    {
        "text": " Ahora estamos hablando de una palabra de largo seis,",
        "start": 3880.86,
        "end": 3882.86
    },
    {
        "text": " o sea que acaban a ir cuatro o gales.",
        "start": 3883.86,
        "end": 3885.86
    },
    {
        "text": " Pero las consonantes tengo dos maneras de ponerla r,",
        "start": 3886.86,
        "end": 3889.86
    },
    {
        "text": " l o l, r.",
        "start": 3889.86,
        "end": 3890.86
    },
    {
        "text": " Entonces, esto es este dos.",
        "start": 3891.86,
        "end": 3892.86
    },
    {
        "text": " Aquí este elegido como va las consonantes.",
        "start": 3894.86,
        "end": 3896.86
    },
    {
        "text": " Cuantas maneras tengo de elegir las vocales que van acá en el medio.",
        "start": 3900.86,
        "end": 3905.86
    },
    {
        "text": " Como la palabra tiene largo seis,",
        "start": 3907.86,
        "end": 3909.86
    },
    {
        "text": " acaban a ir cuatro vocales.",
        "start": 3909.86,
        "end": 3912.86
    },
    {
        "text": " Y tengo las cinco vocales.",
        "start": 3916.86,
        "end": 3919.86
    },
    {
        "text": " Entonces, lo que tengo que elegir,",
        "start": 3920.86,
        "end": 3922.86
    },
    {
        "text": " claro, tengo que elegir cuatro vocales de las cinco,",
        "start": 3922.86,
        "end": 3926.86
    },
    {
        "text": " en un orden.",
        "start": 3928.86,
        "end": 3929.86
    },
    {
        "text": " Yo tengo.",
        "start": 3931.86,
        "end": 3932.86
    },
    {
        "text": " Cuantas maneras tengo de elegir la primera vocal,",
        "start": 3932.86,
        "end": 3935.86
    },
    {
        "text": " cinco maneras de elegir la primera vocal.",
        "start": 3936.86,
        "end": 3938.86
    },
    {
        "text": " Una vez que elegir la primera, me quedan cuatro maneras de elegir la segunda.",
        "start": 3939.86,
        "end": 3943.86
    },
    {
        "text": " Una vez que elegir la segunda, me quedan tres maneras de elegir la tercera",
        "start": 3944.86,
        "end": 3948.86
    },
    {
        "text": " y dos maneras de elegir la cuarto.",
        "start": 3949.86,
        "end": 3951.86
    },
    {
        "text": " Claro, en realidad lo que pasa acá es que voy a dividir entre cinco menos cuatro que suena.",
        "start": 3954.86,
        "end": 3958.86
    },
    {
        "text": " Entonces, permutaciones de cinco, de tamaño cuatro,",
        "start": 3959.86,
        "end": 3963.86
    },
    {
        "text": " y es el mismo número que permutaciones de cinco.",
        "start": 3964.86,
        "end": 3967.86
    },
    {
        "text": " Pero, en realidad lo que va acá es permutaciones de cinco y tamaño cuatro,",
        "start": 3968.86,
        "end": 3973.86
    },
    {
        "text": " conceptualmente.",
        "start": 3974.86,
        "end": 3975.86
    },
    {
        "text": " Ese elegí cuatro, de cinco con un orden.",
        "start": 3975.86,
        "end": 3977.86
    },
    {
        "text": " Entonces, esto es la manera de escribir las maneras posibles de elegir cuatro",
        "start": 3984.86,
        "end": 3992.86
    },
    {
        "text": " y cinco vocales con un orden.",
        "start": 3992.86,
        "end": 3994.86
    },
    {
        "text": " Y después, por la regla del producto,",
        "start": 3994.86,
        "end": 3997.86
    },
    {
        "text": " construir una palabra de largo seis,",
        "start": 3998.86,
        "end": 4001.86
    },
    {
        "text": " es algo que tiene dos etapas.",
        "start": 4002.86,
        "end": 4004.86
    },
    {
        "text": " Elegir las vocales que van en el medio y elegir las consonantes que van en los extremos.",
        "start": 4004.86,
        "end": 4009.86
    },
    {
        "text": " Entonces, por la regla del producto, la manera de construir palabras de tamaño seis",
        "start": 4010.86,
        "end": 4015.86
    },
    {
        "text": " son las maneras de construir,",
        "start": 4016.86,
        "end": 4018.86
    },
    {
        "text": " de elegir las vocales por la manera de elegir las consonantes.",
        "start": 4019.86,
        "end": 4022.86
    },
    {
        "text": " Entonces, estas son las maneras de elegir las palabras de tamaño seis.",
        "start": 4023.86,
        "end": 4027.86
    },
    {
        "text": " ¿Qué pasa con la manera de elegir las palabras de largo cuatro?",
        "start": 4028.86,
        "end": 4032.86
    },
    {
        "text": " Voy a tener que elegir dos vocales, entonces voy a tener permutaciones de cinco de tamaño dos",
        "start": 4037.86,
        "end": 4046.86
    },
    {
        "text": " para elegir las vocales por dos maneras de colocar las consonantes.",
        "start": 4047.86,
        "end": 4053.86
    },
    {
        "text": " Este dos es permutaciones de dos, es el orden de las dos consonantes,",
        "start": 4054.86,
        "end": 4059.86
    },
    {
        "text": " es el orden primera última.",
        "start": 4059.86,
        "end": 4060.86
    },
    {
        "text": " Pero esto ya es lo que vos pensáis que he dividido algo.",
        "start": 4066.86,
        "end": 4069.86
    },
    {
        "text": " Permutaciones de cinco de tamaño dos es cinco factorial y dividido algo.",
        "start": 4070.86,
        "end": 4074.86
    },
    {
        "text": " Ay, va, sí, también sería.",
        "start": 4077.86,
        "end": 4081.86
    },
    {
        "text": " Esto en realidad, este dos es permutaciones de dos.",
        "start": 4083.86,
        "end": 4088.86
    },
    {
        "text": " Ahora, si nos da tiempo, hacemos otro ejemplo.",
        "start": 4090.86,
        "end": 4092.86
    },
    {
        "text": " O sea, el ejemplo siempre puede convertir en un ejemplo más malvado.",
        "start": 4093.86,
        "end": 4096.860000000001
    },
    {
        "text": " Entonces acá el llen me pregunta, ¿qué pasa si voy a tres consonantes?",
        "start": 4097.860000000001,
        "end": 4099.860000000001
    },
    {
        "text": " Bueno, lo que pasa es que ahora va a venir un ejemplo más malvado.",
        "start": 4100.860000000001,
        "end": 4102.860000000001
    },
    {
        "text": " Siempre hay una.",
        "start": 4103.86,
        "end": 4104.86
    },
    {
        "text": " Y este dos que es permutaciones de dos,",
        "start": 4106.86,
        "end": 4111.86
    },
    {
        "text": " las palabras de largo dos que se pueden formar con estas letras",
        "start": 4112.86,
        "end": 4116.86
    },
    {
        "text": " y que empiezan y terminan con la consonante,",
        "start": 4117.86,
        "end": 4120.86
    },
    {
        "text": " son simplemente R, L, L, R,",
        "start": 4121.86,
        "end": 4124.86
    },
    {
        "text": " que son las maneras de ordenar esas dos consonantes que hay.",
        "start": 4125.86,
        "end": 4128.86
    },
    {
        "text": " Y por la regla de la suma,",
        "start": 4129.86,
        "end": 4133.86
    },
    {
        "text": " todas las palabras posibles de largo par que comienzan y terminan con la consonante,",
        "start": 4134.86,
        "end": 4139.86
    },
    {
        "text": " formadas con esas letras, son las de largo seis,",
        "start": 4140.86,
        "end": 4144.86
    },
    {
        "text": " las de largo cuatro y las de largo dos.",
        "start": 4145.86,
        "end": 4147.86
    },
    {
        "text": " Las sumas de todas estas son todas las palabras de largo par.",
        "start": 4148.86,
        "end": 4151.86
    },
    {
        "text": " Entonces la regla de la suma es algo muy sencillo,",
        "start": 4152.86,
        "end": 4154.86
    },
    {
        "text": " entonces por eso una le aplica de forma muy intuitiva,",
        "start": 4155.86,
        "end": 4157.86
    },
    {
        "text": " pero es lo que estamos usando acá.",
        "start": 4158.86,
        "end": 4159.86
    },
    {
        "text": " Entonces,",
        "start": 4161.86,
        "end": 4162.86
    },
    {
        "text": " permutaciones de cinco, etan año cuatro, es cinco factorial,",
        "start": 4163.86,
        "end": 4167.86
    },
    {
        "text": " sobre cinco menos cuatro factorial,",
        "start": 4168.86,
        "end": 4171.86
    },
    {
        "text": " por dos más,",
        "start": 4174.86,
        "end": 4175.86
    },
    {
        "text": " cinco factorial, sobre cinco menos dos,",
        "start": 4177.86,
        "end": 4180.86
    },
    {
        "text": " factorial por dos más dos.",
        "start": 4181.86,
        "end": 4184.86
    },
    {
        "text": " Esas son las palabras de largo par que comienzan y terminan con una consonante.",
        "start": 4189.86,
        "end": 4194.86
    },
    {
        "text": " El último ejemplo es esta, ¿cuántas palabras",
        "start": 4197.86,
        "end": 4201.86
    },
    {
        "text": " que comiencen o",
        "start": 4205.86,
        "end": 4208.86
    },
    {
        "text": " que comienzan?",
        "start": 4211.86,
        "end": 4213.86
    },
    {
        "text": " Terminen con una consonante que sea en detamaño par,",
        "start": 4216.86,
        "end": 4219.86
    },
    {
        "text": " se pueden formar con las letras de la palabra Aure.",
        "start": 4220.86,
        "end": 4222.86
    },
    {
        "text": " Entonces, a ver, como muchos me va a decir que se han dado cuenta",
        "start": 4227.86,
        "end": 4230.86
    },
    {
        "text": " el programa principal, acá es que la regla de la suma,",
        "start": 4231.86,
        "end": 4233.86
    },
    {
        "text": " que es lo que dice la compañía ya no se aplica,",
        "start": 4234.86,
        "end": 4235.86
    },
    {
        "text": " no se aplica así groseramente, ¿sí?",
        "start": 4236.86,
        "end": 4238.86
    },
    {
        "text": " Porque ya no podemos decir son las que empiezan con consonante",
        "start": 4239.86,
        "end": 4244.86
    },
    {
        "text": " más las que terminan con consonante.",
        "start": 4245.86,
        "end": 4247.86
    },
    {
        "text": " Porque si hacemos eso,",
        "start": 4249.86,
        "end": 4250.86
    },
    {
        "text": " las que empiezan y terminan con consonante,",
        "start": 4251.86,
        "end": 4254.86
    },
    {
        "text": " las estamos contando dos veces.",
        "start": 4255.86,
        "end": 4256.86
    },
    {
        "text": " Y se acuerdan que las reglas de la suma tenía esta condición",
        "start": 4260.86,
        "end": 4263.86
    },
    {
        "text": " de que",
        "start": 4264.86,
        "end": 4265.86
    },
    {
        "text": " teníamos que realizar una tarea u otra tarea,",
        "start": 4266.86,
        "end": 4269.86
    },
    {
        "text": " pero no había manera de realizarlas las dos simultaneamente.",
        "start": 4270.86,
        "end": 4272.86
    },
    {
        "text": " Entonces, la primera tarea es elegir una palabra que comience con consonante,",
        "start": 4274.86,
        "end": 4277.86
    },
    {
        "text": " la segunda es una palabra que termine con consonante,",
        "start": 4279.86,
        "end": 4282.86
    },
    {
        "text": " pero hay una manera de realizarlas las dos simultaneamente,",
        "start": 4283.86,
        "end": 4285.86
    },
    {
        "text": " que es elegir una palabra que comience y termine con consonante.",
        "start": 4286.86,
        "end": 4289.86
    },
    {
        "text": " Entonces, hay varias soluciones posibles,",
        "start": 4292.86,
        "end": 4293.86
    },
    {
        "text": " esta acá alguien dice,",
        "start": 4294.86,
        "end": 4295.86
    },
    {
        "text": " las restamos, o sea, contamos todas las que empiezan con consonante,",
        "start": 4296.86,
        "end": 4302.86
    },
    {
        "text": " contamos todas las que terminen con consonante,",
        "start": 4303.86,
        "end": 4305.86
    },
    {
        "text": " las sumamos y las que empiezan y terminen con consonante,",
        "start": 4306.86,
        "end": 4310.86
    },
    {
        "text": " las hemos contado dos veces.",
        "start": 4311.86,
        "end": 4312.86
    },
    {
        "text": " Entonces, ahora restamos las que empiezan y termine con consonante.",
        "start": 4313.86,
        "end": 4315.86
    },
    {
        "text": " Muy bien, esa es una opción.",
        "start": 4316.86,
        "end": 4317.86
    },
    {
        "text": " Otra opción es simplemente agarrar la regla de la suma",
        "start": 4319.86,
        "end": 4321.86
    },
    {
        "text": " y separar las palabras estas en tres casos que realmente sean distintos,",
        "start": 4322.86,
        "end": 4325.86
    },
    {
        "text": " que es las que empiezan con consonante y terminen con vocal,",
        "start": 4326.86,
        "end": 4332.86
    },
    {
        "text": " las que empiezan con vocal y terminen con consonante y las que empiezan y terminen con consonante.",
        "start": 4334.86,
        "end": 4339.86
    },
    {
        "text": " Y sumar esas tres cosas.",
        "start": 4340.86,
        "end": 4341.86
    },
    {
        "text": " Y todo eso, teniendo en cuenta que buscamos todas las palabras del largo",
        "start": 4342.86,
        "end": 4349.86
    },
    {
        "text": " par, y afortunadamente para mí se terminó la clase.",
        "start": 4349.86,
        "end": 4356.86
    },
    {
        "text": " Entonces, ustedes resolven este problema para la clase que viene.",
        "start": 4357.86,
        "end": 4361.86
    }
]