[
    {
        "text": " Bueno, entonces vamos a retomar el ejemplo que estábamos",
        "start": 0.0,
        "end": 20.32
    },
    {
        "text": " mediendo la clase pasada. Entonces teníamos las letras, este es el ejemplo de la clase pasada,",
        "start": 20.32,
        "end": 38.64
    },
    {
        "text": " teníamos las letras de la palabra Aurilio, que son todas distintas, son las cinco vocales y son dos",
        "start": 38.64,
        "end": 46.56
    },
    {
        "text": " consonantes, Aurilio. Entonces la pregunta era cuántas palabras de largo par,",
        "start": 46.56,
        "end": 63.040000000000006
    },
    {
        "text": " que comiencen y o terminan, o sea son las que comienzan con consonantes, las que terminan con",
        "start": 63.04,
        "end": 87.32
    },
    {
        "text": " consonantes, se pueden formar con las letras de la palabra Aurilio.",
        "start": 87.32,
        "end": 107.96
    },
    {
        "text": " Entonces veo que hay gente que lo hizo, lo cual era el objetivo, sí o sea la idea era que lo hicieran y que ya todo el mundo trajeran resultados, ¿cuánto les dio?",
        "start": 117.32,
        "end": 134.2
    },
    {
        "text": " ¿Qué número más lindo? Sí, a mí me dio lo mismo. Bueno, entonces vamos a ver cómo se siente. Entonces tenemos cinco vocales y dos consonantes y una manera sencilla de hacer lo",
        "start": 134.2,
        "end": 156.32
    },
    {
        "text": " que se separan entre escasos, las que comienzan con consonante pero no terminan con consonante, las que terminan con consonante y no comienzan con consonante y las que comienzan y terminan con consonante.",
        "start": 156.32,
        "end": 172.32
    },
    {
        "text": " Entonces no teníamos otra restricción, no decíamos que las consonantes sólo estuvieran los extremos. Entonces tenemos palabras de tres tipos, las que comienzan y terminan con consonante.",
        "start": 172.32,
        "end": 201.32
    },
    {
        "text": " Estas son las más fáciles. Vamos a contarlas. Entonces la estructura de esta palabra es tenemos una consonante acá, otra consonante acá y en el medio tenemos sólo vocales.",
        "start": 202.32,
        "end": 230.32
    },
    {
        "text": " Entonces las consonantes de cuántas maneras las podemos elegir de dos, ¿sí? Ponemos acá la R y acá la L o al revés. Entonces hay dos selecciones posibles para las consonantes y cuántas elecciones posibles ahí para las vocales depende del largo de la palabra.",
        "start": 232.32,
        "end": 256.32
    },
    {
        "text": " Entonces acá tenemos dos maneras de legirlas.",
        "start": 256.32,
        "end": 263.32
    },
    {
        "text": " Entonces si la palabra sabemos que estamos buscando palabras de largo par, entonces las palabras de largo seis tienen cuatro vocales acá dentro.",
        "start": 263.32,
        "end": 290.32
    },
    {
        "text": " Entonces vamos a tener, vamos a tener las dos consonantes, vamos a tener las vocales acá en el medio y acá va a haber cuatro vocales. Entonces cuantas maneras hay de elegir estas cuatro vocales en el orden que van a ir.",
        "start": 290.32,
        "end": 317.32
    },
    {
        "text": " Permutaciones de cinco de tamaño cuatro. O sea de las cinco vocales hay que elegir cuatro en un orden.",
        "start": 318.32,
        "end": 329.32
    },
    {
        "text": " Y por la regla del producto elegir esto y elegir el orden de las dos consonantes de fuera es dos que es la manera de elegir las consonantes por permutaciones de cinco de tamaño cuatro.",
        "start": 330.32,
        "end": 350.32
    },
    {
        "text": " Palabras de tamaño seis que comienzan y terminan con consonante que se pueden formar con las letras de la palabra urea.",
        "start": 350.32,
        "end": 359.32
    },
    {
        "text": " Entonces esto es dos por permutaciones de cinco de tamaño cuatro y cinco factorial sobre cinco menos cuatro.",
        "start": 360.32,
        "end": 368.32
    },
    {
        "text": " Factorial esto es dos por cinco factorial que 120 que es 240.",
        "start": 368.32,
        "end": 377.32
    },
    {
        "text": " Estas son las que comienzan y terminan con consonante. Ahora hay un segundo tipo que son las que comienzan con consonante y terminan con vocal.",
        "start": 380.32,
        "end": 393.32
    },
    {
        "text": " Entonces a ver cuántas son estas.",
        "start": 398.32,
        "end": 415.32
    },
    {
        "text": " Entonces para estas sabemos lo siguiente. Tenemos una consonante acá.",
        "start": 415.32,
        "end": 432.32
    },
    {
        "text": " En este primer lugar.",
        "start": 432.32,
        "end": 441.32
    },
    {
        "text": " Perdón estas sean las de largo seis me faltaban las de largo cuatro las de largo dos del tipo uno perdón ya estoy.",
        "start": 442.32,
        "end": 450.32
    },
    {
        "text": " Estas perdón perdón.",
        "start": 451.32,
        "end": 456.32
    },
    {
        "text": " De el mismo modo cuántas son las palabras de largo cuatro con esta estructura. Tenemos las dos maneras de elegir las consonantes y acá vamos a tener que elegir para que la palabra tenga largo cuatro tenemos que elegir dos vocales.",
        "start": 456.32,
        "end": 480.32
    },
    {
        "text": " Entonces de cuántas maneras podemos elegir dos vocales.",
        "start": 480.32,
        "end": 487.32
    },
    {
        "text": " Permutaciones de cinco y tamaño dos. Entonces la cantidad de palabras de largo cuatro son dos que corresponde a la elección de las consonantes o sea el orden en que van las consonantes por permutaciones de cinco de tamaño dos.",
        "start": 488.32,
        "end": 509.32
    },
    {
        "text": " Que es dos por cinco factorial sobre cinco menos dos factorial o sea dos por 120 dividido seis.",
        "start": 510.32,
        "end": 525.3199999999999
    },
    {
        "text": " Y 120 dividido seis es 20 dos por eso 40 creo que se numbra 40.",
        "start": 525.32,
        "end": 537.32
    },
    {
        "text": " Está claro cómo llegamos este número.",
        "start": 537.32,
        "end": 548.32
    },
    {
        "text": " Y ahora las palabras de largo dos esto es simplemente decir que empiezan con una consonante y terminan con otra consonante o sea tenemos que elegir el orden en que van las consonantes y bueno hay dos maneras de elegir ese orden primero la era después la elevo al revés.",
        "start": 548.32,
        "end": 569.32
    },
    {
        "text": " Incidentalmente este dos es en realidad dos factorial que son permutaciones de dos son el orden posible en que van las dos consonantes y este dos también es eso y este dos también es eso.",
        "start": 569.32,
        "end": 585.32
    },
    {
        "text": " Entonces palabras de tipo uno en total hay por la regla de la suma 240 más 40 más dos que son 282 palabras de tipo uno.",
        "start": 585.32,
        "end": 605.32
    },
    {
        "text": " Ahora vamos a ver qué pasa cuantas palabras de largo para formar con estas letras hay que comiencen con consonante pero terminen con vocal.",
        "start": 605.32,
        "end": 628.32
    },
    {
        "text": " Entonces cómo hacemos esto?",
        "start": 628.32,
        "end": 654.32
    },
    {
        "text": " ¿Qué estructura tiene una de estas palabras?",
        "start": 659.32,
        "end": 669.32
    },
    {
        "text": " ¿Qué pasa con las palabras R, L, A o U, E? ¿Esa cumple con el criterio o no cumple con el criterio?",
        "start": 669.32,
        "end": 692.32
    },
    {
        "text": " Sí es para, tiene seis letras.",
        "start": 693.32,
        "end": 703.32
    },
    {
        "text": " Claro no dice nada sobre qué haya consonantes en el medio, el criterio es que empiece con consonante o termine con consonante y esta palabra empiece con consonante y tiene largo par.",
        "start": 703.32,
        "end": 730.32
    },
    {
        "text": " Exactamente, ¿sí? Entonces esta palabra cumple con el criterio entonces digamos una cosa que podríamos pensar que está mal es que poden elegir la consonante después su montón de vocales y no, en realidad tenemos que elegir la consonante después su montón de cosas con el criterio que la última sea vocal.",
        "start": 730.32,
        "end": 751.32
    },
    {
        "text": " Entonces lo que dice el compañero es lo siguiente, elegimos una consonante.",
        "start": 751.32,
        "end": 760.32
    },
    {
        "text": " Esto es la primera etapa, sabemos que lo último tiene que ser una vocal y después en el medio hay algo y ese algo está tomado entre las letras festantes, puede ser consonante, vocales no importa.",
        "start": 760.32,
        "end": 788.32
    },
    {
        "text": " Entonces, ¿qué pasa con las palabras de seis letras?",
        "start": 788.32,
        "end": 798.32
    },
    {
        "text": " Vamos a pensar en lo que hice la regla del producto, construir una de estas palabras es un procedimiento con tres etapas.",
        "start": 798.32,
        "end": 805.32
    },
    {
        "text": " La primera es elegir una consonante al principio y eso lo podemos hacer de dos maneras, ¿sí? Esta es la elección de la primera consonante.",
        "start": 805.32,
        "end": 823.32
    },
    {
        "text": " La segunda etapa es la elección de la vocal que va al final y eso lo podemos hacer de cinco maneras.",
        "start": 823.32,
        "end": 833.32
    },
    {
        "text": " Entonces, esta es la elección de la vocal final y después en el medio elegimos lo que sea, claro, ahí va.",
        "start": 833.32,
        "end": 850.32
    },
    {
        "text": " Entonces, ¿no quedan? Se alejimos dos letras, ¿no quedan seis letras?",
        "start": 850.32,
        "end": 857.32
    },
    {
        "text": " Nos quedan cinco letras, ¿sí? Aurelio tiene siete letras, ¿no quedan cinco letras? Porque ya usamos una consonante a una vocal y las cinco letras restantes de esas letras tenemos que elegir cuatro en cierto orden para poner acá.",
        "start": 857.32,
        "end": 873.32
    },
    {
        "text": " Entonces, lo que ven en el medio lo podemos elegir de permutaciones de cinco tomadas de cuatro maneras.",
        "start": 874.32,
        "end": 882.32
    },
    {
        "text": " Entonces, esto me queda dos por cinco por cinco factorial sobre cinco menos cuatro factorial, o sea dos por cinco por ciento veinte, o sea mil doscientas maneras.",
        "start": 882.32,
        "end": 910.32
    },
    {
        "text": " mil doscientas maneras de elegir una palabra de largo seis que comience con consonante y termine con vocal usando estas letras.",
        "start": 910.32,
        "end": 922.32
    },
    {
        "text": " Sí o no? Porque estoy buscando una palabra que yo largo total sea seis, entonces pongo acá con consonante, una consonante con vocal y acá pongo cuatro entre las letras que me subran cuatro en algún orden.",
        "start": 922.32,
        "end": 949.32
    },
    {
        "text": " Usted se estén atento porque en esta parte de conteo yo hay algún momento en que siempre me equivoco, o sea, entonces tienen que estar con los ojos muy abiertos.",
        "start": 950.32,
        "end": 967.32
    },
    {
        "text": " Ahora, ¿qué pasa con las palabras de este tipo y de largo cuatro? Estas son las de largo seis. Entonces, ¿qué pasa con las de cuatro letras?",
        "start": 968.32,
        "end": 981.32
    },
    {
        "text": " Tengo, ¿eh? Claro. Igual, sólo que exactamente, solamente que en vez de tomar las permutaciones de cinco de tamaño cuatro, elijo la primera consonante, elijo la última vocal y después lo que ven en el medio lo puedo elegir de permutaciones de cinco de tamaño dos maneras.",
        "start": 982.32,
        "end": 1004.32
    },
    {
        "text": " Entonces, porque de las cinco letras que tengo, simplemente elijo un par dos letras en un orden. Entonces, esto me queda dos por cinco por cinco, factorial dividido cinco menos dos.",
        "start": 1005.32,
        "end": 1022.32
    },
    {
        "text": " Factorial, esto es tres factorial que seis, 120 dividido seis, es 20. Entonces, estas son 200 maneras y elegir una palabra de tamaño cuatro con estas características.",
        "start": 1022.32,
        "end": 1040.3200000000002
    },
    {
        "text": " Y con dos letras, simplemente elijo, la consonante del comienzo, la vocal del final y ya está.",
        "start": 1041.32,
        "end": 1059.32
    },
    {
        "text": " Entonces, ahí, ahora por la regla de la suma, una palabra de largo para que comiense con consonante y termine con vocal, es la suma de la cantidad de palabras de tamaño seis, la cantidad de palabras de tamaño cuatro y la cantidad de palabras de tamaño dos.",
        "start": 1059.32,
        "end": 1086.32
    },
    {
        "text": " Entonces, ahí, cuantos eran 1200 más 210, o sea, 1410 palabras de tipo dos.",
        "start": 1086.32,
        "end": 1106.32
    },
    {
        "text": " Exactamente. Y acá lo que hice compañero es el tipo tres y el tipo dos es lo mismo, sí o sea, la condición de que empiece con consonante y termine con vocal, bueno, va a ser lo mismo que termine con consonante y empiece con vocal.",
        "start": 1107.32,
        "end": 1129.32
    },
    {
        "text": " Si va a ver la misma cantidad, ¿sí? Tan de acuerdo con eso, ¿no? Entonces, si el tipo tres, si el tipo, vamos a ver, tres, es termina con consonante y comienzan con vocal,",
        "start": 1129.32,
        "end": 1157.32
    },
    {
        "text": " la cantidad de vuelta va a ser este número 1410. Entonces, la solución de todo el problema, que es cuantas palabras de largo para, hay que comiencen y o terminen con consonante, que se puedan formar con las litras de la palabra urelio,",
        "start": 1160.32,
        "end": 1181.32
    },
    {
        "text": " es por la regla de la suma, la suma de estos tres números, ¿sí? Porque observen que los tipos uno, dos y tres son tres tipos que son distintos.",
        "start": 1181.32,
        "end": 1196.32
    },
    {
        "text": " Entonces, la solución a la pregunta inicial son las palabras de tipo uno, más las de tipo dos, más las de tipo tres que son, las de tipo uno,",
        "start": 1196.32,
        "end": 1214.32
    },
    {
        "text": " era 282, las de tipo dos eran 1410 y las de tipo tres eran 1410, 3.100, ¿tros? Así, va, muy bien.",
        "start": 1214.32,
        "end": 1241.32
    },
    {
        "text": " Bueno, muy bien. Vamos, está claro este ejemplo, vamos a ver otro ejemplo de aplicaciones que podamos hacer de las permutaciones, entonces,",
        "start": 1244.32,
        "end": 1273.32
    },
    {
        "text": " vamos a probar esta pequeña proposición, voy a tomar un número entero positivo, o sea, una naturale, mayor igual que uno, que se llama K y N, es el doble de K.",
        "start": 1274.32,
        "end": 1303.32
    },
    {
        "text": " Entonces, vamos a probar la siguiente proposición, N, factorial dividido 2 a la K, es un número natural, o sea, un entero no es un racional que no se entero.",
        "start": 1304.32,
        "end": 1328.32
    },
    {
        "text": " O sea, 2 a la K divide a N, factorial. ¿Por qué? ¿Ceta? ¿Por qué hay gente que cree que los naturales empiezan en cero? Es más o menos la mitad de la humanidad.",
        "start": 1328.32,
        "end": 1350.32
    },
    {
        "text": " Probablemente la mitad de los profesores de este curso adierran a esa filosofía, entonces, acá está claro que es mayor igual que uno, muy bien.",
        "start": 1350.32,
        "end": 1367.32
    },
    {
        "text": " Entonces, vamos a probar esto, es algo que en principio no tiene nada que ver con conteo, la firmación de que 2 a la K divide a N, factorial.",
        "start": 1367.32,
        "end": 1385.32
    },
    {
        "text": " Entonces, vamos a hacerlo de la manera siguiente, de vuelta piensen que yo tengo un juego es grave, y tengo las siguientes fichitas.",
        "start": 1398.32,
        "end": 1407.32
    },
    {
        "text": " Entonces, me tocó una fichita que tiene la letra X1, 2 fichitas que tiene la letra X2, 2 fichitas que tiene la letra X3, esta 2 fichitas que tiene la letra XK.",
        "start": 1407.32,
        "end": 1436.32
    },
    {
        "text": " Entonces, en total son N fichitas.",
        "start": 1436.32,
        "end": 1447.32
    },
    {
        "text": " Y me pregunto cuantas palabras puedo escribir yo en mi juego es grave con estas fichas.",
        "start": 1447.32,
        "end": 1467.32
    },
    {
        "text": " Entonces, si estas letras fueran distintas, o sea, si yo tuviera X1,",
        "start": 1477.32,
        "end": 1506.32
    },
    {
        "text": " X1 prima, X2, X2 prima, hasta X subca y X subca prima.",
        "start": 1507.32,
        "end": 1522.32
    },
    {
        "text": " Si las letras son todas distintas, hay tantas palabras como maneras de ordenar estos N símbolos. ¿Entonces cuantas maneras son esas?",
        "start": 1523.32,
        "end": 1537.32
    },
    {
        "text": " 2 Cafactorial o sea N factorial. Si fueran todas distintas.",
        "start": 1537.32,
        "end": 1544.32
    },
    {
        "text": " Ahora, cuando las X1 ya no son distintas, sino que son iguales, hay palabras que yo con terrepetidas. ¿Entonces cuantas viamos la palabra?",
        "start": 1544.32,
        "end": 1566.32
    },
    {
        "text": " La palabra X1, X1, X2, X2 prima, etc. hasta XK, XK prima. Cuando esta X1 era X1 prima y cuando esta era la prima,",
        "start": 1575.32,
        "end": 1591.32
    },
    {
        "text": " las conté como dos veces seguidas. Cuando pienso que son iguales, las conté tantas veces como maneras de ordenarlos 2 X1. ¿Se acuerdan eso?",
        "start": 1592.32,
        "end": 1605.32
    },
    {
        "text": " Entonces, al pensar que los 2 X1 son iguales, me doy cuenta que tengo que dividir entre 2, porque cada palabra la conté 2 veces.",
        "start": 1605.32,
        "end": 1619.32
    },
    {
        "text": " Y ahora, ¿qué pasa si pienso que los X2 son iguales?",
        "start": 1620.32,
        "end": 1626.32
    },
    {
        "text": " De vuelta, me doy cuenta que cuando pensé que eran distintas cada palabra la conté 2 veces. Y lo mismo con X3, X4, etc., hasta XK.",
        "start": 1626.32,
        "end": 1642.32
    },
    {
        "text": " Entonces, esto me queda en factoridad sobre 2 a la K, es la cantidad de palabras que puedo escribir con esta ficha de esclave.",
        "start": 1643.32,
        "end": 1656.32
    },
    {
        "text": " Y bueno, esta cantidad, por supuesto, tiene que ser un número natural.",
        "start": 1657.32,
        "end": 1662.32
    },
    {
        "text": " Muy bien. ¿Qué más?",
        "start": 1668.32,
        "end": 1671.32
    },
    {
        "text": " Un último ejemplo.",
        "start": 1674.32,
        "end": 1675.32
    },
    {
        "text": " Ahora vamos a pensar que tengo una mesa circular y que tengo seis comenzales, llamados a BCDEF, sentados a una mesa circular.",
        "start": 1686.32,
        "end": 1709.32
    },
    {
        "text": " ¿De cuántas maneras pueden sentarse?",
        "start": 1717.32,
        "end": 1725.32
    },
    {
        "text": " Y lo único que importa es si yo soy un comenzal lo único que me interesa de que no está sentado a mi izquierda y que no a mi derecha.",
        "start": 1726.32,
        "end": 1747.32
    },
    {
        "text": " No me importa si estoy sentada acá o si estoy sentada acá. Lo único que me importa es mi posición relativa al resto de los comenzales.",
        "start": 1748.32,
        "end": 1756.32
    },
    {
        "text": " Entonces, por ejemplo, una posibilidad y que hace siente por acá después c, f, d y b.",
        "start": 1756.32,
        "end": 1769.32
    },
    {
        "text": " Este es una manera posible que se podrían sentar. Entonces, ¿cuántas maneras hay?",
        "start": 1770.32,
        "end": 1775.32
    },
    {
        "text": " Aquí no es exactamente palabras porque le me está redonda. ¿Cómo podríamos contar esto?",
        "start": 1776.32,
        "end": 1786.32
    },
    {
        "text": " ¿Cómo?",
        "start": 1798.32,
        "end": 1799.32
    },
    {
        "text": " ¿Qué hubo ahí? ¿Qué es la recundación que venía en el colando barbado?",
        "start": 1800.32,
        "end": 1803.32
    },
    {
        "text": " Ahí va. Eso me encantó. Eso me encantó. El hijo uno, digamos, el hijo A.",
        "start": 1803.32,
        "end": 1809.32
    },
    {
        "text": " Y después digo, bueno, a ver quién está la derecha de A. ¿Y quién está la derecha de ESE? ¿Extra? ¿Sí?",
        "start": 1809.32,
        "end": 1816.32
    },
    {
        "text": " Entonces, comenzando con el comenzal A.",
        "start": 1816.32,
        "end": 1822.32
    },
    {
        "text": " ¿Y siendo hacia la derecha o sea mirando a la derecha de A?",
        "start": 1830.32,
        "end": 1835.32
    },
    {
        "text": " Entonces, ¿cuántas maneras hay?",
        "start": 1840.32,
        "end": 1842.32
    },
    {
        "text": " ¿Se hay factorial?",
        "start": 1848.32,
        "end": 1850.32
    },
    {
        "text": " ¿Casi? ¿Casi?",
        "start": 1850.32,
        "end": 1853.32
    },
    {
        "text": " ¿Se hay factorial? ¿Y si hay por qué vas a mirar a la derecha?",
        "start": 1854.32,
        "end": 1860.32
    },
    {
        "text": " ¿Y si hay por qué?",
        "start": 1860.32,
        "end": 1862.32
    },
    {
        "text": " Ayo.",
        "start": 1862.32,
        "end": 1863.32
    },
    {
        "text": " ¿Y si hay por qué vas a mirar a la derecha de A? ¿Y si hay por qué vas a mirar a la derecha de A?",
        "start": 1863.32,
        "end": 1868.32
    },
    {
        "text": " Sí.",
        "start": 1868.32,
        "end": 1869.32
    },
    {
        "text": " Entonces, acá ustedes dos lo están pensando en manera un poco distinta.",
        "start": 1869.32,
        "end": 1872.32
    },
    {
        "text": " Porque lo que hay que decir acá es, bueno, vamos a pensar que A está fijo y después miramos quién está la izquierda de A y la izquierda de ESE, etc.",
        "start": 1872.32,
        "end": 1881.32
    },
    {
        "text": " Entonces, eso es como pensar en una palabra que empieza con A y que acá tiene 5 en cierto orden.",
        "start": 1882.32,
        "end": 1891.32
    },
    {
        "text": " Entonces, acá, o sea, acá hay que ordenar contando a partir de A los comenzales B, C, D, E y ESE.",
        "start": 1893.32,
        "end": 1906.32
    },
    {
        "text": " Entonces, acá tienen que ir permutaciones de 5 A y permutaciones de 5 posibilidades.",
        "start": 1907.32,
        "end": 1913.32
    },
    {
        "text": " Entonces, si pensamos que A está fijo, A ESE el lugar de inicio de a la palabra y después miramos lo que como van a continuación,",
        "start": 1914.32,
        "end": 1923.32
    },
    {
        "text": " A ESE 5 factorial posibilidades.",
        "start": 1928.32,
        "end": 1931.32
    },
    {
        "text": " Si ven ese argumento, o sea, yo estoy sentada en mi lugar y lo que pienso es cómo están ordenados los demás en relación a mí mirando de derecha izquierda.",
        "start": 1937.32,
        "end": 1962.32
    },
    {
        "text": " ¿Sigue cómo dejar a dar la misión de dónde es la palabra como rentada? Claro.",
        "start": 1963.32,
        "end": 1968.32
    },
    {
        "text": " Algo así.",
        "start": 1969.32,
        "end": 1971.32
    },
    {
        "text": " Exacto. Y lo que decía el compañero por allá es algo un poco diferente. Es decir, voy a mirar los 6 y voy a mirar las palabras de 6 caracteres.",
        "start": 1971.32,
        "end": 1981.32
    },
    {
        "text": " Cuando miró las palabras de 6 caracteres, eso me da permutaciones de 6 posibilidades.",
        "start": 1982.32,
        "end": 1989.32
    },
    {
        "text": " Y después me doy cuenta de que en realidad cada reglo circularlo con te varias veces.",
        "start": 1990.32,
        "end": 1996.32
    },
    {
        "text": " ¿Sí? Porque acá, por ejemplo, en este ejemplo, o sea, hay permutaciones de 6 palabras lineales.",
        "start": 1997.32,
        "end": 2013.32
    },
    {
        "text": " Si fuera una mesa larga y no redonda habría permutaciones de 6 maneras de hacerlo.",
        "start": 2016.32,
        "end": 2021.32
    },
    {
        "text": " Pero después me doy cuenta que aquella reglo que es A C F D E B.",
        "start": 2022.32,
        "end": 2030.32
    },
    {
        "text": " En realidad es lo mismo que mirar C F D E B A. Es lo mismo que mirar F D E B A C etc.",
        "start": 2030.32,
        "end": 2045.32
    },
    {
        "text": " O sea, como disposiciones a lo largo de la mesa circular, esas tres son lo mismo.",
        "start": 2046.32,
        "end": 2052.3199999999997
    },
    {
        "text": " Entonces, cuando conté las palabras como palabras lineales, cuantas veces apareces repetidas cada palabra?",
        "start": 2054.3199999999997,
        "end": 2064.3199999999997
    },
    {
        "text": " Aparece repetidas 6 veces.",
        "start": 2068.3199999999997,
        "end": 2071.3199999999997
    },
    {
        "text": " ¿Mu? Porque está escrita una vez comenzando con cada uno de los comenzales.",
        "start": 2076.32,
        "end": 2085.32
    },
    {
        "text": " ¿Sí?",
        "start": 2088.32,
        "end": 2089.32
    },
    {
        "text": " Entonces, en realidad la respuesta pensando en la mesa circular y no lineal.",
        "start": 2091.32,
        "end": 2103.32
    },
    {
        "text": " Vemos que hay permutaciones de 6 sobre 6, o sea, 6 factorial sobre 6, que es lo mismo que 5 factorial posibilidades.",
        "start": 2106.32,
        "end": 2117.32
    },
    {
        "text": " Entonces, nos dio lo mismo lo cual es bueno.",
        "start": 2123.32,
        "end": 2126.32
    },
    {
        "text": " Muy bien. Entonces, con permutaciones podemos contar muchas cosas.",
        "start": 2136.32,
        "end": 2142.32
    },
    {
        "text": " Sí, podemos hacer cálculos que son relativamente complicados.",
        "start": 2142.32,
        "end": 2146.32
    },
    {
        "text": " Ahora vamos a ver algún poco distinto. Vamos a hablar de combinaciones.",
        "start": 2146.32,
        "end": 2157.32
    },
    {
        "text": " Entonces, para combinaciones vamos a pensar en este ejemplo suave, entre práctico.",
        "start": 2166.32,
        "end": 2173.32
    },
    {
        "text": " ¿Qué es cuantas guardas del 5 de Euro hay?",
        "start": 2177.32,
        "end": 2180.32
    },
    {
        "text": " Entonces quiero elegir 5 números de 44.",
        "start": 2196.32,
        "end": 2202.32
    },
    {
        "text": " No me salgan con la bolilla extra ni con la revanche.",
        "start": 2202.32,
        "end": 2207.32
    },
    {
        "text": " No, no. Yo sé, así. Para mí me ganas de 5 de Euro nada.",
        "start": 2207.32,
        "end": 2210.32
    },
    {
        "text": " Entonces, hay 44 números.",
        "start": 2215.32,
        "end": 2218.32
    },
    {
        "text": " Y bueno, hay en el 5 de Euro sale en 5.",
        "start": 2226.32,
        "end": 2231.32
    },
    {
        "text": " Entonces, a ver vamos a pensar cuando estamos mirando la tele viendo el 5 de Euro, van saliendo las bolillas.",
        "start": 2237.32,
        "end": 2244.32
    },
    {
        "text": " Tengo la primera bolilla.",
        "start": 2244.32,
        "end": 2247.32
    },
    {
        "text": " La segunda, la tercera, la cuarta y la quinta.",
        "start": 2248.32,
        "end": 2253.32
    },
    {
        "text": " ¿Cuántas posibilidades hay para la primera bolilla?",
        "start": 2261.32,
        "end": 2265.32
    },
    {
        "text": " 44.",
        "start": 2265.32,
        "end": 2267.32
    },
    {
        "text": " Para la otra, 43 para la tercera, 42.",
        "start": 2269.32,
        "end": 2276.32
    },
    {
        "text": " 41 para la cuarta y 40 para la quinta.",
        "start": 2276.32,
        "end": 2282.32
    },
    {
        "text": " Pero el problema es que la jugada es de 5 de Euro.",
        "start": 2282.32,
        "end": 2285.32
    },
    {
        "text": " No tiene en cuenta el orden.",
        "start": 2285.32,
        "end": 2288.32
    },
    {
        "text": " O sea, si yo elegí los números 1, 2, 3, 4, 5 y la primera bolilla que sale es la 5 y después la 13 y después la 4 y después la 12 y después la 1.",
        "start": 2288.32,
        "end": 2299.32
    },
    {
        "text": " Yo gané el 5 de Euro.",
        "start": 2299.32,
        "end": 2302.32
    },
    {
        "text": " No importa el orden.",
        "start": 2303.32,
        "end": 2305.32
    },
    {
        "text": " Entonces, en realidad esto no es el número de jugadas que hay, sino que es el número de jugadas ordenadas.",
        "start": 2308.32,
        "end": 2317.32
    },
    {
        "text": " ¿Cuántas veces conté cada jugada?",
        "start": 2319.32,
        "end": 2322.32
    },
    {
        "text": " Exacto.",
        "start": 2323.32,
        "end": 2326.32
    },
    {
        "text": " Entonces, este número que está acá es permutaciones de 44 tomadas de a 5 y cada jugada, como dijeron acá, yo la conté 5 factorias al veces que son permutaciones de 5.",
        "start": 2326.32,
        "end": 2341.32
    },
    {
        "text": " ¿Sí? Porque el orden no me importa y cada jugada que son las 5 bolillas en cualquier manera parece en todos los órdenes posibles de esos 5 números.",
        "start": 2342.32,
        "end": 2355.32
    },
    {
        "text": " A ver si estamos de acuerdo en que este número que yo escribi acá es la cantidad de jugadas posibles de 5 de Euro.",
        "start": 2362.32,
        "end": 2370.32
    },
    {
        "text": " ¿Tan de acuerdo?",
        "start": 2372.32,
        "end": 2377.32
    },
    {
        "text": " ¿Por qué te quedaba bien?",
        "start": 2380.32,
        "end": 2382.32
    },
    {
        "text": " Bueno, porque digamos que cuando...",
        "start": 2382.32,
        "end": 2389.32
    },
    {
        "text": " Cuando la primera bolilla sale el número 5, la segunda bolilla sale el 2, la tercera sale el 8, la cuarta sale el 3 y la quinta sale el 1.",
        "start": 2389.32,
        "end": 2406.32
    },
    {
        "text": " Salieron los números 5, 2, 8, 3 y 1.",
        "start": 2407.32,
        "end": 2412.32
    },
    {
        "text": " En realidad, si primero sale el 5, después el 2, después el 3, después el 5, después el 8 y esto es lo mismo.",
        "start": 2413.32,
        "end": 2421.32
    },
    {
        "text": " O sea, es el mismo resultado del 5 de hora.",
        "start": 2421.32,
        "end": 2424.32
    },
    {
        "text": " Y 5, 8, 3, 2, 1 y es el mismo resultado del 5 de hora.",
        "start": 2425.32,
        "end": 2434.32
    },
    {
        "text": " Entonces en realidad cuando yo hice esta cuenta, estos 3 los conté por separado.",
        "start": 2434.32,
        "end": 2441.32
    },
    {
        "text": " Entonces la pregunta es, ¿está jugada concreta? ¿Cuántas veces la conté?",
        "start": 2444.32,
        "end": 2450.32
    },
    {
        "text": " ¿Ese es el número por el que tengo que dividir? ¿Sí?",
        "start": 2451.32,
        "end": 2455.32
    },
    {
        "text": " Y esa jugada concreta la conté 5 factorial veces, porque son estos 5 números, o sea, la bolilla del 5, la del 2, la del 8, la del 3 y la del 1.",
        "start": 2455.32,
        "end": 2469.32
    },
    {
        "text": " En todos los órdenes posibles en las que pueden haber salido.",
        "start": 2469.32,
        "end": 2473.32
    },
    {
        "text": " Entonces esta es la cantidad de veces que cada jugada parece contada cuando lo pensamos de esta manera.",
        "start": 2474.32,
        "end": 2480.32
    },
    {
        "text": " ¿Está claro o no?",
        "start": 2483.32,
        "end": 2484.32
    },
    {
        "text": " Sin creíble como a todos están calladitos y todo el mundo tiene todo clarísimo. Nunca había este fenómeno.",
        "start": 2490.32,
        "end": 2496.32
    },
    {
        "text": " Me parece asombroso. Cada día explico mejor que todo el mundo entiende todo barbara.",
        "start": 2497.32,
        "end": 2501.32
    },
    {
        "text": " Bueno, el que no entiende grité, ¿sí? Porque si no britan yo sigo adelante.",
        "start": 2504.32,
        "end": 2510.32
    },
    {
        "text": " Pero no sea, ¿y la facilidad? La verdad que puede hacer la prueba de este bolilla.",
        "start": 2510.32,
        "end": 2517.32
    },
    {
        "text": " Claro.",
        "start": 2517.32,
        "end": 2518.32
    },
    {
        "text": " No es la cantidad de manera que se puede en parte de los números que están en la bichero.",
        "start": 2518.32,
        "end": 2526.32
    },
    {
        "text": " Pero fíjate que una jugada en realidad son, es simplemente sacar 5 números del bolillero.",
        "start": 2527.32,
        "end": 2532.32
    },
    {
        "text": " Pero no importa en qué orden salgan.",
        "start": 2533.32,
        "end": 2535.32
    },
    {
        "text": " Entonces, acá cuando yo conté esto estoy mirando además el orden en que salen del bolillero.",
        "start": 2537.32,
        "end": 2542.32
    },
    {
        "text": " Si tengo en cuenta el orden en que salen del bolillero, este no es la cantidad.",
        "start": 2544.32,
        "end": 2549.32
    },
    {
        "text": " La jugada es para hacer muchas menos que las que yo calculé teniendo cuenta el orden.",
        "start": 2550.32,
        "end": 2561.32
    },
    {
        "text": " Porque una jugada no tiene en cuenta el orden.",
        "start": 2561.32,
        "end": 2564.32
    },
    {
        "text": " O sea, cuando yo juevo al 5 de oro simplemente pongo crucesitas sobre los números que están y no importa el orden en que salen.",
        "start": 2564.32,
        "end": 2572.32
    },
    {
        "text": " Entonces, cuando yo cuento las 5 bolillas pero con su orden una jugada que es la jugada en que los números ganadores son el 1, 2, 3, 5 y 8,",
        "start": 2573.32,
        "end": 2587.32
    },
    {
        "text": " o sea, la jugada digamos cuando yo marco 1, 2, 3, 5 y 8, esa jugada la conté tantas veces como maneras tengo de ordenar esos 5 números, 5 factorial veces.",
        "start": 2587.32,
        "end": 2600.32
    },
    {
        "text": " Entonces, para saber la cantidad de jugadas reales lo que tengo que hacer es este número que es muy grande dividirlo entre 5 factorial.",
        "start": 2601.32,
        "end": 2609.32
    },
    {
        "text": " Para que todas esas me quedo con una sola. O sea, estas 120 maneras de darle un orden a estos 5 números los tengo que contar como una jugada sola.",
        "start": 2614.32,
        "end": 2626.32
    },
    {
        "text": " Entre todas las similias, 6 chances de ganar dentro de los agosto, a chica de las 6 chances, por el tema de un orden valor de uno, a una.",
        "start": 2631.32,
        "end": 2642.32
    },
    {
        "text": " Ahí con esa 1, la primera posibilidad reales de las 4.",
        "start": 2642.32,
        "end": 2647.32
    },
    {
        "text": " A ver si intentiéndo.",
        "start": 2647.32,
        "end": 2650.32
    },
    {
        "text": " ¿Vos ahí? ¿Cuál es el número tenés? ¿Ya no es 5 factorial?",
        "start": 2651.32,
        "end": 2656.32
    },
    {
        "text": " Sí, pero claro, son 5 factorial en todo esto, ¿no?",
        "start": 2656.32,
        "end": 2665.32
    },
    {
        "text": " Claro, claro.",
        "start": 2665.32,
        "end": 2667.32
    },
    {
        "text": " Sí, claro. Tengo 5 factorial chances ganades sentido de que hay 5 factorial maneras en que puedes salir esta jugada.",
        "start": 2667.32,
        "end": 2676.32
    },
    {
        "text": " Exactamente.",
        "start": 2677.32,
        "end": 2679.32
    },
    {
        "text": " Entonces, ¿cuanto es este número? Esto es permutaciones de 44 de tamaño 5, es 44 factorial sobre 44 menos 5 factorial.",
        "start": 2682.32,
        "end": 2702.32
    },
    {
        "text": " Y esto lo tengo que dividir por permutaciones de 5, que es 5 factorial. O sea, esto es 44 factorial sobre 39 factorial sobre 5 factorial.",
        "start": 2703.32,
        "end": 2720.32
    },
    {
        "text": " Y esto es la cantidad de jugadas posibles que hay al 5 de otra.",
        "start": 2721.32,
        "end": 2731.32
    },
    {
        "text": " Sí.",
        "start": 2731.32,
        "end": 2732.32
    },
    {
        "text": " Entonces, ¿cuál es la posibilidad de ganar el 5 de otra?",
        "start": 2732.32,
        "end": 2735.32
    },
    {
        "text": " Sí, la probabilidad de ganar el 5 de oro es el inverso de esto, 39 factorial por 5 factorial dividido por 44 factorial, que bueno.",
        "start": 2735.32,
        "end": 2748.32
    },
    {
        "text": " Lo calculan en su número muy pequeño. Esto es lo que quiere decir es que pueden hacer un jugado distinta a todas las semanas, de acá al día del juicio final.",
        "start": 2748.32,
        "end": 2761.32
    },
    {
        "text": " Entonces,",
        "start": 2767.32,
        "end": 2770.32
    },
    {
        "text": " vamos a definir lo que son las combinaciones. Tengo un conjunto de elementos.",
        "start": 2778.32,
        "end": 2793.32
    },
    {
        "text": " Y tomamos un número, menos igual que N, ¿no?",
        "start": 2808.32,
        "end": 2820.32
    },
    {
        "text": " La elección.",
        "start": 2823.32,
        "end": 2826.32
    },
    {
        "text": " De acá elementos, de ese conjunto.",
        "start": 2826.32,
        "end": 2831.32
    },
    {
        "text": " Y se llama una combinación.",
        "start": 2839.32,
        "end": 2845.32
    },
    {
        "text": " Dene de tamaño acá.",
        "start": 2848.32,
        "end": 2852.32
    },
    {
        "text": " O sea, elegir cada elemento de un conjunto de N. ¿En qué es diferente esto de una permutación?",
        "start": 2856.32,
        "end": 2865.32
    },
    {
        "text": " ¿Y qué no importa el orden?",
        "start": 2866.32,
        "end": 2869.32
    },
    {
        "text": " Sí.",
        "start": 2869.32,
        "end": 2871.32
    },
    {
        "text": " Como en el 5 de oro, yo elijo 5 números de 44 y no importa el orden.",
        "start": 2877.32,
        "end": 2885.32
    },
    {
        "text": " Entonces, la cantidad de combinaciones de N de tamaño acá.",
        "start": 2885.32,
        "end": 2891.32
    },
    {
        "text": " Y eso.",
        "start": 2895.32,
        "end": 2900.32
    },
    {
        "text": " Entonces, la notación que se usa para esto es el libro usa C, N, K.",
        "start": 2906.32,
        "end": 2915.32
    },
    {
        "text": " Muchos usamos C con una N arriba y un K abajo.",
        "start": 2915.32,
        "end": 2922.32
    },
    {
        "text": " Y muchos otros usan un paréntesis con una N arriba y un K abajo.",
        "start": 2922.32,
        "end": 2927.32
    },
    {
        "text": " Todo esto puede aparecer en el práctico y en los libros.",
        "start": 2927.32,
        "end": 2934.32
    },
    {
        "text": " ¿Cómo se calcula esto?",
        "start": 2937.32,
        "end": 2940.32
    },
    {
        "text": " Entonces, me vuelta para elegir cada elemento de un conjunto de N.",
        "start": 2941.32,
        "end": 2947.32
    },
    {
        "text": " Una cosa que puedo hacer es elegir un primero, un segundo, etcétera.",
        "start": 2947.32,
        "end": 2953.32
    },
    {
        "text": " O sea, elegir cada elemento ordenado.",
        "start": 2953.32,
        "end": 2957.32
    },
    {
        "text": " Eso sería una permutación de N de tamaño acá.",
        "start": 2957.32,
        "end": 2962.32
    },
    {
        "text": " Y después decir el orden de esos cada elemento no me importa.",
        "start": 2962.32,
        "end": 2966.32
    },
    {
        "text": " Entonces, en realidad, en esta cuenta, cada conjunto de cada elemento,",
        "start": 2967.32,
        "end": 2973.32
    },
    {
        "text": " lo conté K factorial veces y tengo que dividir por K factorial.",
        "start": 2973.32,
        "end": 2979.32
    },
    {
        "text": " Entonces, esto me queda N factorial dividido, N menos K factorial.",
        "start": 2982.32,
        "end": 2989.32
    },
    {
        "text": " Estos son las permutaciones dividido K factorial.",
        "start": 2990.32,
        "end": 2995.32
    },
    {
        "text": " Y lo mismo que hicimos acá para elegir 5 de entre 44.",
        "start": 3007.32,
        "end": 3014.32
    },
    {
        "text": " Acá K y 5 y N es 44.",
        "start": 3015.32,
        "end": 3020.32
    },
    {
        "text": " Una observación es que tomar las combinaciones de N de tamaño K",
        "start": 3031.32,
        "end": 3038.32
    },
    {
        "text": " se puede hacer de la misma cantidad de maneras que tomar las combinaciones de N de tamaño N menos K.",
        "start": 3039.32,
        "end": 3045.32
    },
    {
        "text": " Vamos a ver qué quiere decir esto.",
        "start": 3048.32,
        "end": 3052.32
    },
    {
        "text": " Si yo tengo N en el libros y quiero elegir cada entre ellos para llevarme en las vacaciones.",
        "start": 3052.32,
        "end": 3060.32
    },
    {
        "text": " Voy a dejar el número de maneras.",
        "start": 3083.32,
        "end": 3088.32
    },
    {
        "text": " El elegir cuál es K me voy a llevar en la balija es lo mismo que decir el hijo.",
        "start": 3088.32,
        "end": 3093.32
    },
    {
        "text": " ¿Cuáles son los que voy a dejar? Voy a dejar N menos K.",
        "start": 3093.32,
        "end": 3098.32
    },
    {
        "text": " Entonces, eso se puede hacer de esta cantidad de maneras.",
        "start": 3098.32,
        "end": 3102.32
    },
    {
        "text": " El elegir cuántos voy a dejar.",
        "start": 3102.32,
        "end": 3106.32
    },
    {
        "text": " ¿Cómo que no es el mismo?",
        "start": 3106.32,
        "end": 3110.32
    },
    {
        "text": " Estoy tratando de argumentar que tiene que ser el mismo y siga ser el mismo.",
        "start": 3112.32,
        "end": 3117.32
    },
    {
        "text": " No, mira acá. Está bien.",
        "start": 3117.32,
        "end": 3121.32
    },
    {
        "text": " Mira. ¿Cómo calculo?",
        "start": 3121.32,
        "end": 3126.32
    },
    {
        "text": " Es un poco más.",
        "start": 3126.32,
        "end": 3131.32
    },
    {
        "text": " Es un poco más.",
        "start": 3131.32,
        "end": 3136.32
    },
    {
        "text": " Dios, tengo N en el libros.",
        "start": 3136.32,
        "end": 3141.32
    },
    {
        "text": " Me quiero llevar acá lo puedo elegir de esta cantidad de maneras.",
        "start": 3141.32,
        "end": 3146.32
    },
    {
        "text": " Lo puedo elegir la cantidad de maneras,",
        "start": 3146.32,
        "end": 3149.32
    },
    {
        "text": " N menos K factorial sobre K factorial.",
        "start": 3149.32,
        "end": 3154.32
    },
    {
        "text": " Esas son las maneras en que puedo elegir los calibros que me llevo.",
        "start": 3154.32,
        "end": 3158.32
    },
    {
        "text": " ¿De cuántas maneras puedo elegir los N menos calibros que dejo?",
        "start": 3158.32,
        "end": 3164.32
    },
    {
        "text": " Entonces, esto es N factorial dividido.",
        "start": 3167.32,
        "end": 3172.32
    },
    {
        "text": " N menos esto.",
        "start": 3172.32,
        "end": 3176.32
    },
    {
        "text": " N menos N menos K factorial por K factorial.",
        "start": 3176.32,
        "end": 3188.32
    },
    {
        "text": " O sea, por este número de trabajo que es este número de trabajo.",
        "start": 3188.32,
        "end": 3194.32
    },
    {
        "text": " Si quieres, vamos a hacer a si mirad.",
        "start": 3200.32,
        "end": 3202.32
    },
    {
        "text": " Ya que tengo tantos colores lindos, cortesía de la facultad,",
        "start": 3203.32,
        "end": 3210.32
    },
    {
        "text": " tengo el número de arriba que es rojo y el número de abajo que es verde.",
        "start": 3210.32,
        "end": 3215.32
    },
    {
        "text": " Entonces, esto es el número rojo por la diferencia del rojo.",
        "start": 3215.32,
        "end": 3226.32
    },
    {
        "text": " Diferencia del rojo y el verde por el número verde.",
        "start": 3227.32,
        "end": 3233.32
    },
    {
        "text": " Entonces, si acá hago lo mismo, tengo el número rojo arriba y el número verde bajo.",
        "start": 3233.32,
        "end": 3248.32
    },
    {
        "text": " Entonces, esto es el número rojo factorial dividido,",
        "start": 3257.32,
        "end": 3263.32
    },
    {
        "text": " rojo menos verde factorial por verde factorial.",
        "start": 3263.32,
        "end": 3274.32
    },
    {
        "text": " Y bueno, ¿y esto? ¿Y esto que está acá?",
        "start": 3275.32,
        "end": 3282.32
    },
    {
        "text": " Entonces, esto de vuelta me queda N factorial sobre K factorial por N menos K factorial,",
        "start": 3294.32,
        "end": 3302.32
    },
    {
        "text": " que es lo mismo que arriba.",
        "start": 3302.32,
        "end": 3309.32
    },
    {
        "text": " Entonces, la cuenta sí de lo mismo y eso corresponde con la intuición,",
        "start": 3309.32,
        "end": 3313.32
    },
    {
        "text": " de que si yo tengo un conjunto de N elementos, elegir un subconjunto de K de ellos,",
        "start": 3313.32,
        "end": 3321.32
    },
    {
        "text": " es lo mismo que elegir un subconjunto de N menos K complementario.",
        "start": 3321.32,
        "end": 3328.32
    },
    {
        "text": " Muy bien.",
        "start": 3329.32,
        "end": 3334.32
    },
    {
        "text": " Y entonces, por ejemplo,",
        "start": 3335.32,
        "end": 3341.32
    },
    {
        "text": " y ahora, ¿y ahora?",
        "start": 3342.32,
        "end": 3348.32
    },
    {
        "text": " Y ahora, ¿y ahora?",
        "start": 3348.32,
        "end": 3355.32
    },
    {
        "text": " Y ahora, ¿y ahora?",
        "start": 3355.32,
        "end": 3361.32
    },
    {
        "text": " Entonces, sí se pide resolver 5 de los 8 de cuántas maneras puedo elegir los que resolvo.",
        "start": 3361.32,
        "end": 3384.32
    },
    {
        "text": " No se pierde resolver solo 5, ¿sí? Nunca les han tocado sus exámenes que dice de 8 de",
        "start": 3392.32,
        "end": 3414.32
    },
    {
        "text": " 5 y el proceso va a corregir 5. O sea, no pueden hacer 7 y juntar puntitos, ¿no?",
        "start": 3415.32,
        "end": 3421.32
    },
    {
        "text": " Hay que elegir 5. ¿De cuántas maneras puedo resolver este exámen?",
        "start": 3421.32,
        "end": 3429.32
    },
    {
        "text": " Exactamente, combinaciones de 8, tomadas de 5.",
        "start": 3429.32,
        "end": 3436.32
    },
    {
        "text": " O sea, este número es 8 factorial sobre 5 factorial por 3 factorial.",
        "start": 3436.32,
        "end": 3445.32
    },
    {
        "text": " Entonces, esto es lo mismo que combinaciones de 8, tomadas de 3, que es la manera de elegir",
        "start": 3445.32,
        "end": 3451.32
    },
    {
        "text": " cuáles son los 3 problemas que no hago y eso es lo que cualquier estudiante es en",
        "start": 3451.32,
        "end": 3456.32
    },
    {
        "text": " sato hace en esa situación. No eligen los 5 que van a hacer, sino eligen los 3 que no van a ser",
        "start": 3456.32,
        "end": 3462.32
    },
    {
        "text": " y hacen los otros.",
        "start": 3462.32,
        "end": 3465.32
    },
    {
        "text": " Muy bien, ¿y ahora si la consigna es?",
        "start": 3465.32,
        "end": 3472.32
    },
    {
        "text": " Si se pide resolver 3 entre los 4 primeros",
        "start": 3472.32,
        "end": 3482.32
    },
    {
        "text": " y 2 entre los 4 últimos.",
        "start": 3482.32,
        "end": 3491.32
    },
    {
        "text": " ¿De cuántas maneras se puede hacer esto?",
        "start": 3491.32,
        "end": 3500.32
    },
    {
        "text": " ¿De cuántas maneras se puede elegir el exámen que uno resuelva?",
        "start": 3500.32,
        "end": 3513.32
    },
    {
        "text": " ¿Sí?",
        "start": 3513.32,
        "end": 3520.32
    },
    {
        "text": " Entonces, para empezar, acá hay 12 etapas.",
        "start": 3520.32,
        "end": 3534.32
    },
    {
        "text": " La primera es mirar los primeros 4 ejercicios y elegir 3.",
        "start": 3534.32,
        "end": 3540.32
    },
    {
        "text": " Y la segunda etapa es mirar los últimos 4 ejercicios y elegir 2.",
        "start": 3540.32,
        "end": 3546.32
    },
    {
        "text": " Entonces, vamos a aplicar la regla de el producto exacto.",
        "start": 3547.32,
        "end": 3553.32
    },
    {
        "text": " ¿Sí?",
        "start": 3553.32,
        "end": 3554.32
    },
    {
        "text": " Entonces, va a ser la manera de elegir 3 ejercicios de los primeros 4 y las maneras de elegir",
        "start": 3554.32,
        "end": 3565.32
    },
    {
        "text": " 12 ejercicios de los últimos 4.",
        "start": 3565.32,
        "end": 3569.32
    },
    {
        "text": " ¿De cuántas maneras puede elegir 3 ejercicios entre los primeros 4?",
        "start": 3570.32,
        "end": 3577.32
    },
    {
        "text": " Este número combinaciones de 4 tomas de 3 se suele decir.",
        "start": 3580.32,
        "end": 3587.32
    },
    {
        "text": " Y de acá, de 4 tengo que elegir 2.",
        "start": 3587.32,
        "end": 3592.32
    },
    {
        "text": " O sea, esto es 4 factorial dividido, 3 factorial por 4 menos 3 factorial por 4 factorial dividido 2 factorial por 4 menos 2 factorial.",
        "start": 3592.32,
        "end": 3609.32
    },
    {
        "text": " ¿Sí? ¿Cómo ven?",
        "start": 3609.32,
        "end": 3616.32
    },
    {
        "text": " Bueno, hay algunos problemas que se pueden resolver pensando en términos de permutaciones o pensando en términos de combinaciones.",
        "start": 3616.32,
        "end": 3633.32
    },
    {
        "text": " En general, cuando nos enfrentamos a un problema de conteo, la solución es única en el sentido de que hay un único número que la respuesta,",
        "start": 3634.32,
        "end": 3643.32
    },
    {
        "text": " pero no es única la manera de hacerlo.",
        "start": 3643.32,
        "end": 3646.32
    },
    {
        "text": " Y acá hay un ejemplo de un problema que es bastante natural pensar por caminos distintos.",
        "start": 3646.32,
        "end": 3656.32
    },
    {
        "text": " Es el siguiente.",
        "start": 3663.32,
        "end": 3670.32
    },
    {
        "text": " Antes de dedicarme a la matemática, yo da la clase de educación física. No sé si sabían.",
        "start": 3670.32,
        "end": 3677.32
    },
    {
        "text": " Entonces, tenía 36 estudiantes de educación física",
        "start": 3677.32,
        "end": 3687.32
    },
    {
        "text": " y lo dividía en equipos de volevol. Entonces, a mi 36 estudiantes, yo los dividí en 4 equipos de 9 para jugar al volevol.",
        "start": 3688.32,
        "end": 3701.32
    },
    {
        "text": " Entonces, la pregunta es de cuántas maneras podía hacerlo.",
        "start": 3706.32,
        "end": 3710.32
    },
    {
        "text": " No sé por qué es hilaridad. Yo era excelente profesor de educación física.",
        "start": 3711.32,
        "end": 3717.32
    },
    {
        "text": " De cuántas maneras se pueden elegir los equipos.",
        "start": 3721.32,
        "end": 3728.32
    },
    {
        "text": " Entonces, bueno, vamos a hacer una resolución posible, es pensar de la siguiente manera.",
        "start": 3741.32,
        "end": 3754.32
    },
    {
        "text": " Es pensar que tengo 4 equipos a B, C y D.",
        "start": 3754.32,
        "end": 3763.32
    },
    {
        "text": " Y voy a elegir los estudiantes que van al primero, los que van al segundo, los que van al tercero y los que van al cuarto.",
        "start": 3764.32,
        "end": 3773.32
    },
    {
        "text": " Entonces, lo primero que voy a hacer es elegir el primer equipo.",
        "start": 3776.32,
        "end": 3783.32
    },
    {
        "text": " De cuántas maneras puedo elegir el primer equipo.",
        "start": 3783.32,
        "end": 3787.32
    },
    {
        "text": " Claro, combinaciones de 36 de tamaño 9.",
        "start": 3788.32,
        "end": 3797.32
    },
    {
        "text": " O sea, tengo 36 estudiantes y tengo que elegir 9 de entre ellos.",
        "start": 3797.32,
        "end": 3803.32
    },
    {
        "text": " Y esta es la cantidad de maneras en que pueda hacerlo.",
        "start": 3803.32,
        "end": 3807.32
    },
    {
        "text": " Entonces, ahora que ya elegí el primer equipo, voy a elegir el segundo equipo.",
        "start": 3807.32,
        "end": 3813.32
    },
    {
        "text": " Entonces, estas son las cantidades maneras que pueden elegir el equipo A.",
        "start": 3814.32,
        "end": 3820.32
    },
    {
        "text": " Una vez que elegí el equipo A, de cuántas maneras pueden elegir el equipo B.",
        "start": 3820.32,
        "end": 3825.32
    },
    {
        "text": " En 27 en 9.",
        "start": 3826.32,
        "end": 3832.32
    },
    {
        "text": " Exacto. Porque ya lo que están en el equipo A no van a estar en el B.",
        "start": 3832.32,
        "end": 3837.32
    },
    {
        "text": " Entonces, me quedan 27 estudiantes de los cuales voy a elegir 9.",
        "start": 3837.32,
        "end": 3843.32
    },
    {
        "text": " Esto va a ser, son las maneras de elegir el equipo B.",
        "start": 3843.32,
        "end": 3848.32
    },
    {
        "text": " Bien, de cuántas maneras puedo elegir el equipo C.",
        "start": 3849.32,
        "end": 3855.32
    },
    {
        "text": " De entre 18, tengo que elegir 9 y después el último equipo.",
        "start": 3855.32,
        "end": 3861.32
    },
    {
        "text": " Ya está, el último equipo son los que quedaron y más vale que este número sea 1.",
        "start": 3861.32,
        "end": 3867.32
    },
    {
        "text": " Una vez que elegí el equipo A, el equipo B y el equipo C.",
        "start": 3873.32,
        "end": 3877.32
    },
    {
        "text": " El equipo de esos son los que quedan.",
        "start": 3878.32,
        "end": 3880.32
    },
    {
        "text": " O dicho, otra manera de los 9 que me quedan, tengo que elegir 9.",
        "start": 3880.32,
        "end": 3884.32
    },
    {
        "text": " Y si calculan este número con la fórmula, esto de verdad es da 1.",
        "start": 3884.32,
        "end": 3890.32
    },
    {
        "text": " Vamos a ver cuánto es esto.",
        "start": 3895.32,
        "end": 3897.32
    },
    {
        "text": " Esto es 36 factorial dividido, 39 factorial y 36 menos 9 factorial, que es 27 factorial.",
        "start": 3898.32,
        "end": 3914.32
    },
    {
        "text": " ¿Tá? Esa es el primer número.",
        "start": 3914.32,
        "end": 3918.32
    },
    {
        "text": " Son las maneras de elegir el equipo A.",
        "start": 3919.32,
        "end": 3921.32
    },
    {
        "text": " La manera de elegir el equipo B son 27 factorial dividido 9 factorial por 18 factorial.",
        "start": 3921.32,
        "end": 3930.32
    },
    {
        "text": " La manera de elegir el equipo C son 18 factorial dividido 9 factorial y la manera de elegir el equipo de eso no es factorial dividido.",
        "start": 3930.32,
        "end": 3944.32
    },
    {
        "text": " 9 factorial por 1 factorial.",
        "start": 3945.32,
        "end": 3948.32
    },
    {
        "text": " Tacho todo lo que se tacha.",
        "start": 3948.32,
        "end": 3951.32
    },
    {
        "text": " Y esto me queda 36 factorial dividido 9 factorial por 9 factorial por 9 factorial.",
        "start": 3962.32,
        "end": 3971.32
    },
    {
        "text": " No me falta de la 4.",
        "start": 3975.32,
        "end": 3977.32
    },
    {
        "text": " Estas son las cantidades de manera de elegir el equipo.",
        "start": 3986.32,
        "end": 3989.32
    },
    {
        "text": " Muy bien, esa es una manera de pensarlo.",
        "start": 3989.32,
        "end": 3992.32
    },
    {
        "text": " Ahora vamos a pensarlo de una manera.",
        "start": 3992.32,
        "end": 3995.32
    },
    {
        "text": " Esto es, Luisimos, con combinaciones ahora a alguien que no vino a esta clase que hace.",
        "start": 3995.32,
        "end": 4003.32
    },
    {
        "text": " A alguien que se queda en la clase pasado.",
        "start": 4005.32,
        "end": 4008.32
    },
    {
        "text": " Los ponen fila.",
        "start": 4008.32,
        "end": 4010.32
    },
    {
        "text": " ¿Quién?",
        "start": 4010.32,
        "end": 4012.32
    },
    {
        "text": " A los 36.",
        "start": 4012.32,
        "end": 4013.32
    },
    {
        "text": " A los 36.",
        "start": 4013.32,
        "end": 4014.32
    },
    {
        "text": " Los ponen fila.",
        "start": 4014.32,
        "end": 4015.32
    },
    {
        "text": " Muy bien.",
        "start": 4015.32,
        "end": 4016.32
    },
    {
        "text": " Entonces, otra resolución consiste en poner en fila a los estudiantes.",
        "start": 4016.32,
        "end": 4027.32
    },
    {
        "text": " O sea, tenemos el estudiante primero, al estudiante segundo, al tercero.",
        "start": 4027.32,
        "end": 4034.32
    },
    {
        "text": " ¿Y después qué hace?",
        "start": 4034.32,
        "end": 4036.32
    },
    {
        "text": " Son los generantes.",
        "start": 4036.32,
        "end": 4039.32
    },
    {
        "text": " ¿Claro?",
        "start": 4039.32,
        "end": 4040.32
    },
    {
        "text": " Pero la persona que no vino a esta clase no sabe.",
        "start": 4040.32,
        "end": 4045.32
    },
    {
        "text": " Bueno, si, los ordena.",
        "start": 4045.32,
        "end": 4046.32
    },
    {
        "text": " ¿Pero cómo los asignan los equipos?",
        "start": 4046.32,
        "end": 4048.32
    },
    {
        "text": " Lo que tiene que hacer es sacar chiquitides y hacer.",
        "start": 4048.32,
        "end": 4051.32
    },
    {
        "text": " ¿Vos vas al equipo A?",
        "start": 4051.32,
        "end": 4052.32
    },
    {
        "text": " ¿Vos vas al equipo B?",
        "start": 4052.32,
        "end": 4053.32
    },
    {
        "text": " ¿Vos vas al equipo A? ¿Vos vas al B? ¿Vos vas al C? ¿Vos vas al D?",
        "start": 4053.32,
        "end": 4058.32
    },
    {
        "text": " Entonces, lo que tiene que hacer esta persona es sacar cada estudiante al signarle un equipo.",
        "start": 4058.32,
        "end": 4072.32
    },
    {
        "text": " Por ejemplo, A, ¿Vos vas al B? ¿Vos vas al A? ¿Etsi otra? ¿Vos vas al C?",
        "start": 4072.32,
        "end": 4079.32
    },
    {
        "text": " Entonces, lo que va a formar acá es una palabra del largo 36 en las letras ABCD.",
        "start": 4079.32,
        "end": 4091.32
    },
    {
        "text": " ¿Vos vas al B?",
        "start": 4091.32,
        "end": 4094.32
    },
    {
        "text": " Entonces, lo que hay que mirar es si tengo un alfabeto que tiene cuatro letras A.",
        "start": 4094.32,
        "end": 4101.32
    },
    {
        "text": " A, cuatro letras B, cuatro letras C y cuatro letras D.",
        "start": 4101.32,
        "end": 4111.32
    },
    {
        "text": " Perdón, cuatro no, nueve.",
        "start": 4111.32,
        "end": 4114.32
    },
    {
        "text": " Sí, nueve, no es, no es.",
        "start": 4114.32,
        "end": 4116.32
    },
    {
        "text": " Porque tengo que asignarle el equipo A a nueve personas, ¿verdad?",
        "start": 4116.32,
        "end": 4120.32
    },
    {
        "text": " Nueve letras A, nueve letras B, nueve letras C, nueve letras D.",
        "start": 4120.32,
        "end": 4125.32
    },
    {
        "text": " ¿Cuántas palabras del largo 36 se forman con estas letras?",
        "start": 4125.32,
        "end": 4132.32
    },
    {
        "text": " Volvemos al problema de las palabras con las letras repetidas.",
        "start": 4156.32,
        "end": 4167.32
    },
    {
        "text": " Entonces, si todas las letras son las fichitas del escravel,",
        "start": 4167.32,
        "end": 4172.32
    },
    {
        "text": " sí tengo nueve fichas D A, nueve fichas D B, nueve fichas C, nueve fichas D.",
        "start": 4172.32,
        "end": 4178.32
    },
    {
        "text": " A ver, tengo caras de poca convicción.",
        "start": 4179.32,
        "end": 4184.32
    },
    {
        "text": " A alguien no sabe lo que se les grabele.",
        "start": 4184.32,
        "end": 4190.32
    },
    {
        "text": " No se rían, acá me sugieren que ese es el problema.",
        "start": 4190.32,
        "end": 4195.32
    },
    {
        "text": " Son pensos que no ese es el problema.",
        "start": 4195.32,
        "end": 4198.32
    },
    {
        "text": " Bueno, sí, a ver, primero quiero que se convenzan de que este problema es equivalente a la anterior.",
        "start": 4198.32,
        "end": 4207.32
    },
    {
        "text": " O sea, de que una vez que yo tengo mis 36 estudiantes de educación física en fila,",
        "start": 4208.32,
        "end": 4217.32
    },
    {
        "text": " lo que tengo que hacer es decir, les busbas el equipo A, busbas al B, busbas a C, etc.",
        "start": 4217.32,
        "end": 4223.32
    },
    {
        "text": " Y eso corresponde a decir a dónde ver primero, a dónde ver segundo, a dónde ver tercero y así sucesivamente,",
        "start": 4223.32,
        "end": 4230.32
    },
    {
        "text": " de manera de que a nueve les toquela a nueve el B.",
        "start": 4230.32,
        "end": 4236.32
    },
    {
        "text": " Entonces, es lo mismo que decir en esta palabra del largo 36, quiero que haya nueve letras A, nueve letras B, nueve letras C y nueve letras D.",
        "start": 4236.32,
        "end": 4250.32
    },
    {
        "text": " Tanto de acuerdo en que ese problema es equivalente a los equipos de volevol,",
        "start": 4253.32,
        "end": 4260.32
    },
    {
        "text": " más o menos.",
        "start": 4261.32,
        "end": 4263.32
    },
    {
        "text": " Si ese problema es equivalente, ¿cómo lo resolvíamos?",
        "start": 4269.32,
        "end": 4275.32
    },
    {
        "text": " Si todas las letras fueran distintas, yo tendría 36 letras diferentes.",
        "start": 4276.32,
        "end": 4282.32
    },
    {
        "text": " ¿Cuántas palabras puedo formar con 36 letras diferentes?",
        "start": 4282.32,
        "end": 4287.32
    },
    {
        "text": " 36 factorial, ¿sí? Que son todas las maneras en que puedo ordenar esas letras diferentes.",
        "start": 4287.32,
        "end": 4296.32
    },
    {
        "text": " Y ahora si las A no son diferentes, en realidad son iguales.",
        "start": 4298.32,
        "end": 4304.32
    },
    {
        "text": " Entonces, ¿cuántas veces conté las A's?",
        "start": 4304.32,
        "end": 4310.32
    },
    {
        "text": " Claro, las palabras repetidas, la claro, o sea,",
        "start": 4310.32,
        "end": 4316.32
    },
    {
        "text": " en realidad digamos dos palabras distintas, digamos dos palabras que son iguales, pero tienen las A's.",
        "start": 4316.32,
        "end": 4328.32
    },
    {
        "text": " Es más difícil decir que de pensar.",
        "start": 4331.32,
        "end": 4333.32
    },
    {
        "text": " ¿Se acuerdan de cuánto veíamos el ejemplo de la palabra Lara y decíamos cuántas palabras podemos formar con esas cuatro letras?",
        "start": 4333.32,
        "end": 4342.32
    },
    {
        "text": " Entonces, cuando pensamos que las A's eran diferentes a 1 y a 2, había cuatro factorial posibilidades.",
        "start": 4343.32,
        "end": 4354.32
    },
    {
        "text": " Sí? Si las letras eran diferentes.",
        "start": 4354.32,
        "end": 4357.32
    },
    {
        "text": " Y después lo sabemos cuenta que esta palabra era igual a esta.",
        "start": 4359.32,
        "end": 4367.32
    },
    {
        "text": " Cuando pensamos que las A's no eran diferentes, sin iguales.",
        "start": 4368.32,
        "end": 4373.32
    },
    {
        "text": " Entonces, cuando conté cuatro factorial posibilidades, ¿cuántas veces conté la palabra LAR?",
        "start": 4374.32,
        "end": 4384.32
    },
    {
        "text": " Dos veces sí, una vez con las A's en este orden y otra vez con las A's en el otro orden.",
        "start": 4385.32,
        "end": 4392.32
    },
    {
        "text": " Entonces, cuando divido entre dos tengo la cantidad real de palabras cuando pienso que las A's son indistengibles.",
        "start": 4393.32,
        "end": 4404.32
    },
    {
        "text": " Y este dos, como decían por allá, en realidad es un dos factorial, que es la cantidad de manera de ordenarla.",
        "start": 4404.32,
        "end": 4412.32
    },
    {
        "text": " Después sabíamos hecho un ejemplo con la palabra Rudolfo que tenía tres O's.",
        "start": 4412.32,
        "end": 4422.32
    },
    {
        "text": " Entonces, veíamos que cuando pensamos que las tres O's eran diferentes, contábamos cada palabra tres factorial veces.",
        "start": 4425.32,
        "end": 4435.32
    },
    {
        "text": " Entonces, acá pensamos que las 36 letras son distintas, pero ahora si pensamos que las A's en realidad no son distintas, sino que son iguales,",
        "start": 4436.32,
        "end": 4448.32
    },
    {
        "text": " aparecio nueve factorial a la caba, que viene de todas las maneras posibles de ordenarlas nueveas.",
        "start": 4448.32,
        "end": 4458.32
    },
    {
        "text": " Pero después pasa lo mismo con las nueve B's, que no son distintas, sino que son iguales.",
        "start": 4459.32,
        "end": 4467.32
    },
    {
        "text": " Y lo mismo con las nueve C's y lo mismo con las nueve B's.",
        "start": 4471.32,
        "end": 4475.32
    },
    {
        "text": " Entonces, en realidad la cantidad de maneras de palabras posibles en estas letras es 36 dividido nueve factorial a la cuarta.",
        "start": 4476.32,
        "end": 4487.32
    },
    {
        "text": " Que es el mismo número que llegamos pensando a las combinaciones.",
        "start": 4489.32,
        "end": 4494.32
    },
    {
        "text": " Entonces, pensando abordando el problema de cualquiera de las dos maneras llegamos a la misma solución lo cual es bueno.",
        "start": 4506.32,
        "end": 4512.32
    },
    {
        "text": " A ver.",
        "start": 4519.32,
        "end": 4520.32
    },
    {
        "text": " Bueno, muy bien. Tenemos, muy bien, tenemos unos minutos.",
        "start": 4527.32,
        "end": 4533.32
    },
    {
        "text": " Vamos a pensar en el problema siguiente.",
        "start": 4540.32,
        "end": 4543.32
    },
    {
        "text": " Conozco los más o de cartas francesas.",
        "start": 4549.32,
        "end": 4552.32
    },
    {
        "text": " Los más o de cartas españoles son esos que tienen copas, pada, oros y basto.",
        "start": 4553.32,
        "end": 4561.32
    },
    {
        "text": " Las cartas francesas tienen...",
        "start": 4563.32,
        "end": 4565.32
    },
    {
        "text": " Eso es la época, exacto.",
        "start": 4566.32,
        "end": 4568.32
    },
    {
        "text": " Tienen diamante y que trebol y corazón.",
        "start": 4569.32,
        "end": 4573.32
    },
    {
        "text": " Entonces, un mazo tiene 52 cartas en cuatro palos.",
        "start": 4574.32,
        "end": 4581.32
    },
    {
        "text": " Tenéis 5 cartas por palo.",
        "start": 4582.32,
        "end": 4584.32
    },
    {
        "text": " Los...",
        "start": 4585.32,
        "end": 4588.32
    },
    {
        "text": " Un mano tiene 5 cartas.",
        "start": 4590.32,
        "end": 4593.32
    },
    {
        "text": " Entonces, de cuántas maneras podemos elegir 5 cartas sin que salgan ningún trebol.",
        "start": 4594.32,
        "end": 4599.32
    },
    {
        "text": " Es una bul appearance, un fromicio, una urbana conmigo y arroz.",
        "start": 4615.32,
        "end": 4620.32
    },
    {
        "text": " Voy a dibujar growlo, vários para quitar.",
        "start": 4629.32,
        "end": 4634.32
    },
    {
        "text": " ¡Estos para ventana!",
        "start": 4634.32,
        "end": 4638.32
    },
    {
        "text": " El 35,00 de美元 y lo convirt вам,",
        "start": 4638.32,
        "end": 4642.32
    },
    {
        "text": " De cuántas maneras trebol? De cuántas maneras podemos elegir 5 cargas sin que sea",
        "start": 4642.32,
        "end": 4650.099999999999
    },
    {
        "text": " algún trebol? 39 combinaciones de 39 tomadas de 5. Está bien, ¿por qué? Porque lo que",
        "start": 4650.099999999999,
        "end": 4657.94
    },
    {
        "text": " tengo que mirar es cuántas cartas hay que no son trebol? Que son 39? Porque es el",
        "start": 4657.94,
        "end": 4667.94
    },
    {
        "text": " más o sin los treboles que son 13 y elegir 5. ¿Sí? Ahora de cuántas maneras podemos elegir",
        "start": 4667.94,
        "end": 4682.5
    },
    {
        "text": " 5 cartas? De modo que haya al menos un trebol.",
        "start": 4682.5,
        "end": 4693.06
    },
    {
        "text": " ¿Qué complicado? A ver, capaz que todos esos números son iguales a ver que alguien",
        "start": 4712.5,
        "end": 4730.2
    },
    {
        "text": " me diga cómo lo pensó.",
        "start": 4730.2,
        "end": 4732.18
    },
    {
        "text": " Hay algo así se puede hacer? Porque hay una manera más fácil de hacer esto.",
        "start": 4733.1,
        "end": 4755.46
    },
    {
        "text": " Vamos a hacer todo lo que están diciendo.",
        "start": 4755.46,
        "end": 4759.46
    },
    {
        "text": " Hay una manera más fácil que simplemente pensar que las que queremos contar ahora son exactamente las que no contamos antes.",
        "start": 4759.46,
        "end": 4767.46
    },
    {
        "text": " O sea, ¿cuáles son estas manos? Las que tienen al menos un trebol.",
        "start": 4767.46,
        "end": 4772.46
    },
    {
        "text": " Son todas menos las que no tienen ningún trebol.",
        "start": 4772.46,
        "end": 4777.46
    },
    {
        "text": " ¿Tan de acuerdo?",
        "start": 4777.46,
        "end": 4780.46
    },
    {
        "text": " Entonces, las que no tienen ningún trebol, o sea, todas las manos posibles son de las 52 cartas elegir 5.",
        "start": 4780.46,
        "end": 4792.46
    },
    {
        "text": " Y las que no tienen ningún trebol ya las calculamos.",
        "start": 4792.46,
        "end": 4799.46
    },
    {
        "text": " Y este número, ustedes me creen porque el gremal de lo hizo en su casa, da 2 millones 23.203.",
        "start": 4799.46,
        "end": 4817.46
    },
    {
        "text": " Manos posibles que tengan al menos un trebol.",
        "start": 4818.46,
        "end": 4822.46
    },
    {
        "text": " Entonces, acá sugerían otras maneras de pensar esto.",
        "start": 4822.46,
        "end": 4828.46
    },
    {
        "text": " Y como faltan 3 minutos, vamos a hacer lo siguiente.",
        "start": 4828.46,
        "end": 4836.46
    },
    {
        "text": " Ustedes piensan cómo las contarían directamente. ¿Sí?",
        "start": 4836.46,
        "end": 4842.46
    },
    {
        "text": " ¿Cómo contarían las manos con al menos un trebol?",
        "start": 4843.46,
        "end": 4847.46
    },
    {
        "text": " Y vesiles del mismo número. Y la clase que viene retomamos este ejemplo.",
        "start": 4847.46,
        "end": 4853.46
    }
]