[
    {
        "text": " ¿Qué tal?",
        "start": 0.0,
        "end": 24.0
    },
    {
        "text": " Bueno, hoy vamos a hablar de funciones generatrices, que es el tema que empezamos la clase pasada con un par de ejemplos.",
        "start": 25.0,
        "end": 37.0
    },
    {
        "text": " Vamos a tomar la sucesión de números reales, así iron a uno a dos, etcétera.",
        "start": 37.0,
        "end": 61.0
    },
    {
        "text": " Y vamos a decir que su función generatriz.",
        "start": 68.0,
        "end": 90.0
    },
    {
        "text": " Y si está FDX que va a ser la suma desde igual ser infinito de A sub NXLN, o sea la suma a 0 más a 1X más a 2X cuadrado, etcétera.",
        "start": 91.0,
        "end": 114.0
    },
    {
        "text": " Entonces, da una sucesión, damos una expresión FDX de esta forma.",
        "start": 114.0,
        "end": 131.0
    },
    {
        "text": " Ahora, son una cantidad finita de términos, esto es un polinomio.",
        "start": 131.0,
        "end": 143.0
    },
    {
        "text": " Entonces, en realidad, observamos un poco esta expresión.",
        "start": 143.0,
        "end": 149.0
    },
    {
        "text": " Los asusceras, subunas, subunas, etcétera son números.",
        "start": 149.0,
        "end": 158.0
    },
    {
        "text": " Entonces, acá tenemos una serie para cada X.",
        "start": 158.0,
        "end": 166.0
    },
    {
        "text": " O sea, si X es un número, esto es una serie en U.",
        "start": 166.0,
        "end": 170.0
    },
    {
        "text": " Entonces, esto de verdad va a ser una función de X cuando la serie sea convergente, o sea, puede haber valores de X para los cuales esto de un número y valores de X para los cuales no de un número.",
        "start": 170.0,
        "end": 187.0
    },
    {
        "text": " Pero en realidad eso no nos va a importar, no vamos a estudiar la convergencia de esta serie.",
        "start": 188.0,
        "end": 196.0
    },
    {
        "text": " Lo que vamos a hacer es simplemente tomar las expresiones de esta forma, trabajar con ellas como que son polinomios infinitos y no preocuparnos por la convergencia.",
        "start": 196.0,
        "end": 216.0
    },
    {
        "text": " Entonces, esto objeto se llama una serie de potencias formal.",
        "start": 217.0,
        "end": 222.0
    },
    {
        "text": " Y estas cosas las sumamos, término a término, les hacemos de todo como si fueran polinomios.",
        "start": 222.0,
        "end": 233.0
    },
    {
        "text": " Incluso, más adelante vamos a ver estas cosas las multiplicamos como si fueran polinomios.",
        "start": 233.0,
        "end": 240.0
    },
    {
        "text": " Muy bien. Entonces, ejemplos.",
        "start": 241.0,
        "end": 245.0
    },
    {
        "text": " Este recordemos que por el teorema del binomio si yo hago uno más X a la N, esto va a ser lo mismo que la suma desde K igual.",
        "start": 246.0,
        "end": 274.0
    },
    {
        "text": " Hasta N, de combinaciones de N tomás de acá por X a la K.",
        "start": 275.0,
        "end": 282.0
    },
    {
        "text": " O sea, esto es combinaciones de N tomás de 0 más combinaciones de N tomás de 1 por X, más combinaciones de X tomás de 2, X cuadrado y así sucesivamente hasta combinaciones de N tomás de N,",
        "start": 288.0,
        "end": 303.0
    },
    {
        "text": " y X a la N.",
        "start": 303.0,
        "end": 305.0
    },
    {
        "text": " Esto por supuesto es un polinomio.",
        "start": 307.0,
        "end": 310.0
    },
    {
        "text": " Entonces, vamos a este polinomio, FDX que es 1 más X a la N,",
        "start": 313.0,
        "end": 323.0
    },
    {
        "text": " y ahora, es la función generatriz de qué sucesión.",
        "start": 323.0,
        "end": 330.0
    },
    {
        "text": " ¿De qué sucesión?",
        "start": 330.0,
        "end": 333.0
    },
    {
        "text": " Convenciones de N tomás de acá?",
        "start": 334.0,
        "end": 347.0
    },
    {
        "text": " En 0, ¿eh?",
        "start": 347.0,
        "end": 350.0
    },
    {
        "text": " entonces el primer término es combinaciones de N tomas de acero, combinaciones de N tomas de",
        "start": 350.0,
        "end": 355.62
    },
    {
        "text": " a 1, combinaciones de N tomas de 2, hasta combinaciones de N tomas de N, después que pasa.",
        "start": 355.62,
        "end": 364.08
    },
    {
        "text": " Después son todos cero.",
        "start": 366.56,
        "end": 368.04
    },
    {
        "text": " O sea, si miramos aquella sucesión, su función generatriz es exactamente este pulino.",
        "start": 368.04,
        "end": 379.96000000000004
    },
    {
        "text": " Entorno a la puerta hasta que deje de agarruridad. A ver otro ejemplo,",
        "start": 385.72,
        "end": 393.36
    },
    {
        "text": " ¿qué pasa si multiplicamos? 1 menos x por 1 más x más x cuadrado, más x cubo, así está",
        "start": 393.36,
        "end": 407.46000000000004
    },
    {
        "text": " aquí, esa es la N. O sea, hagamos el producto de estos dos pulinos míos, ¿sí?",
        "start": 407.46000000000004,
        "end": 413.24
    },
    {
        "text": " Entonces, cuando hago la distributiva, primero tengo que multiplicar el 1 por todo esto,",
        "start": 414.2,
        "end": 422.54
    },
    {
        "text": " que me da todo eso. Entonces esto me queda 1 más x más x cuadrado, más x cubo hasta",
        "start": 422.54,
        "end": 433.48
    },
    {
        "text": " la N. Y después tengo que multiplicar el menos x por todo esto, con lo cual obtengo",
        "start": 433.48,
        "end": 449.04
    },
    {
        "text": " menos x menos x cuadrado, menos x cubo hasta menos x a la N más 1.",
        "start": 449.04,
        "end": 457.28000000000003
    },
    {
        "text": " Sí, hay un montón de cosas que se van.",
        "start": 462.04,
        "end": 464.96000000000004
    },
    {
        "text": " Este también se va a ir, sí, y esto es que queda 1 menos x a la N más 1.",
        "start": 468.20000000000005,
        "end": 476.6
    },
    {
        "text": " Entonces, 1 menos x a la N más 1, sobre 1 menos x es igual a 1 más x, más x cuadrado,",
        "start": 479.04,
        "end": 506.16
    },
    {
        "text": " más x cubo hasta x a la N. Sí?",
        "start": 506.16,
        "end": 509.40000000000003
    },
    {
        "text": " Hasta ahí simplemente, y son las cuentitas con unos pulinos míos.",
        "start": 516.1600000000001,
        "end": 522.0400000000001
    },
    {
        "text": " Pero esto me dice que la función fdx igual a 1 menos x a la N más 1, dividido 1 menos x,",
        "start": 522.04,
        "end": 540.28
    },
    {
        "text": " es la función generatriz de qué sucesión.",
        "start": 540.28,
        "end": 545.8
    },
    {
        "text": " De la que tiene todos uno, N1, N1, si después, todos seros.",
        "start": 550.28,
        "end": 559.1999999999999
    },
    {
        "text": " Sí?",
        "start": 559.2,
        "end": 560.2
    },
    {
        "text": " Estoy mirando este igualdad de acá, ¿sí?",
        "start": 567.2,
        "end": 570.4000000000001
    },
    {
        "text": " Este sería fdx, y acá la tengo escrita como un pulinamiento.",
        "start": 574.2,
        "end": 580.84
    },
    {
        "text": " Entonces, los coeficientes son 1, 1, 1, 1, 1, 1, 1, ¿en veces?",
        "start": 581.84,
        "end": 587.84
    },
    {
        "text": " Y ahí se termina lo cual quiere decir que si pienso que es una serie, los demás coeficientes son todos 0.",
        "start": 588.84,
        "end": 596.24
    },
    {
        "text": " Bueno.",
        "start": 603.84,
        "end": 604.84
    },
    {
        "text": " Este...",
        "start": 605.84,
        "end": 607.84
    },
    {
        "text": " Bueno.",
        "start": 611.84,
        "end": 612.84
    },
    {
        "text": " Voy a hacer una cosa medio vegetal, pero que nadie se sucede.",
        "start": 620.84,
        "end": 624.84
    },
    {
        "text": " Se van a pasar cosas así, peor eso.",
        "start": 624.84,
        "end": 627.84
    },
    {
        "text": " Entonces, ahora voy a multiplicar 1 menos x por la serie 1 más x,",
        "start": 627.84,
        "end": 639.84
    },
    {
        "text": " más x cuadrado, más x cubo, acá está x a la N, puntos suspensivos.",
        "start": 640.84,
        "end": 646.84
    },
    {
        "text": " Si ahora eso es una serie.",
        "start": 646.84,
        "end": 649.84
    },
    {
        "text": " Entonces, de vuelta cuando hago la distributiva, hago el 1 por todo esto.",
        "start": 650.84,
        "end": 660.84
    },
    {
        "text": " Sí?",
        "start": 661.84,
        "end": 663.84
    },
    {
        "text": " Lo cual me da 1 más x, más x cuadrado, más x cubo, por acá tengo x a la N, y sigue, sigue, sigue, sigue.",
        "start": 663.84,
        "end": 674.84
    },
    {
        "text": " Y después tengo menos x por todo esto.",
        "start": 677.84,
        "end": 686.84
    },
    {
        "text": " Entonces, por acá estos puntos suspensivos tienen infinitos términos, pero yo soy así, no me pongo nerviosa.",
        "start": 687.84,
        "end": 698.84
    },
    {
        "text": " Y después, cuando multiplico por menos x, me queda menos x, menos x cuadrado, menos x cubo, por acá tengo menos x a la N, menos menos, menos sin finitas cosas.",
        "start": 699.84,
        "end": 711.84
    },
    {
        "text": " Y puedo poner otro pariente si si quiero.",
        "start": 712.84,
        "end": 716.84
    },
    {
        "text": " Este pariente si lo puse solamente para porque como ahí había infinito, no sé, es psicológico.",
        "start": 716.84,
        "end": 723.84
    },
    {
        "text": " Entonces, se me van, un montón de las cosas, todos se me van.",
        "start": 723.84,
        "end": 731.84
    },
    {
        "text": " Y lo que obtengo es que 1, que es lo que me queda acá, se me va a todo menos 1.",
        "start": 732.84,
        "end": 745.84
    },
    {
        "text": " Entonces, de este lado, me quedo, esto es igual a 1.",
        "start": 745.84,
        "end": 748.84
    },
    {
        "text": " Entonces, lo que obtengo cuando paso 1 menos x dividiendo es que 1 sobre 1 menos x es igual a 1 más x, más x cuadrado, más x cubo, etcétera, etcétera.",
        "start": 749.84,
        "end": 765.84
    },
    {
        "text": " O sea, a la serie desde N igual ser infinito de x a la N.",
        "start": 765.84,
        "end": 772.84
    },
    {
        "text": " Entonces, esto quiere decir que la función fdx está por 1 sobre 1 menos x es funcione general atriz, ¿de qué sucesión?",
        "start": 773.84,
        "end": 790.84
    },
    {
        "text": " Entonces, tengo que mirar los coeficientes de esta serie de potencias.",
        "start": 791.84,
        "end": 797.84
    },
    {
        "text": " Y los coeficientes son 1, 1, 1, 1, 1, ¿se?",
        "start": 797.84,
        "end": 802.84
    },
    {
        "text": " Entonces, la sucesión constante igual a 1.",
        "start": 802.84,
        "end": 809.84
    },
    {
        "text": " Bueno, otra manera de ver esto, si los pone nerviosos, esta cuenta aquí se acá, que por ejemplo, si yo hice algo hacia un curso de cálculo deberían ponerse muy nerviosos.",
        "start": 821.84,
        "end": 846.84
    },
    {
        "text": " Y otra manera de ver esto es recordar de cálculo que pasa con la serie geométrica. ¿Se acuerdan de la serie geométrica?",
        "start": 846.84,
        "end": 856.84
    },
    {
        "text": " ¿Se acuerdan de la serie geométrica de cálculo 1?",
        "start": 865.84,
        "end": 869.84
    },
    {
        "text": " La serie geométrica si tienen un x de modo lo menor que 1, la serie de términos general, el x a la N, justamente converge a 1 sobre 1 menos x.",
        "start": 870.84,
        "end": 889.84
    },
    {
        "text": " Esta igualdad es cierta cuando el valor absoluto de x es menor que 1.",
        "start": 889.84,
        "end": 896.84
    },
    {
        "text": " Entonces, en realidad, esta igualdad es cierta para el valor absoluto de x menos 1.",
        "start": 898.84,
        "end": 908.84
    },
    {
        "text": " Solo que caen en realidad la convergencia de la serie y esas cosas no nos va a preocupar.",
        "start": 909.84,
        "end": 914.84
    },
    {
        "text": " Pero otra manera de verlo es recordar como es la suma de la serie geométrica. ¿Y se acuerdan de cómo se probaba esto?",
        "start": 914.84,
        "end": 922.84
    },
    {
        "text": " ¿Se probaba así?",
        "start": 922.84,
        "end": 925.84
    },
    {
        "text": " Esta cuenta con polinomios, también la cuenta de esta con polinomios es correcta, ¿sí? Porque son finitos términos.",
        "start": 926.84,
        "end": 939.84
    },
    {
        "text": " La cosa misteriosa se empezó a pasar acá, pero hasta acá estábamos barbaros.",
        "start": 939.84,
        "end": 947.84
    },
    {
        "text": " Entonces, ahí lo que probamos es que 1 menos x a la N más 1 dividido 1 menos x, ¿sí?",
        "start": 947.84,
        "end": 959.84
    },
    {
        "text": " La suma 1 más x más x cuadrada hasta x a la N, ¿sí?",
        "start": 962.84,
        "end": 969.84
    },
    {
        "text": " Pero esto es una suma parcial de esta serie, o sea, esta es la reducida en esta serie.",
        "start": 970.84,
        "end": 980.84
    },
    {
        "text": " Entonces, ahora cuando tomo límite, cuando N tende más infinito, cuando tomo límite en N como el valor absoluto de x es menor que 1, esto tende a 0.",
        "start": 982.84,
        "end": 996.84
    },
    {
        "text": " Entonces, esto tende a 1 sobre 1 menos x.",
        "start": 1000.84,
        "end": 1005.84
    },
    {
        "text": " Y por otro lado, esto tende cuando N tiene infinito a la suma de la serie, porque eso es por definición la suma de la serie.",
        "start": 1008.84,
        "end": 1019.84
    },
    {
        "text": " Entonces, cuando el valor absoluto de x es menor que 1, tomando límite en N, de ambos lados de este igualdad, vemos que 1 sobre 1 menos x es igual a la suma de esta serie.",
        "start": 1020.84,
        "end": 1033.8400000000001
    },
    {
        "text": " ¿Sí? ¿Sacuerdo en esto?",
        "start": 1039.8400000000001,
        "end": 1042.8400000000001
    },
    {
        "text": " Bueno, el caso es que esta es la función generatriz de 1 sobre 1 menos x que es el ejemplo 3.",
        "start": 1043.84,
        "end": 1052.84
    },
    {
        "text": " ¿Y el último? ¿Está bien?",
        "start": 1053.84,
        "end": 1057.84
    },
    {
        "text": " Ah, lo último que está verde en el logón.",
        "start": 1066.84,
        "end": 1070.84
    },
    {
        "text": " Bueno, a ver otro ejemplo.",
        "start": 1070.84,
        "end": 1073.84
    },
    {
        "text": " El ejemplo anterior dice que 1 sobre 1 menos x es 1 más x más x cuadrado, más x cubo, etc.",
        "start": 1074.84,
        "end": 1086.84
    },
    {
        "text": " Entonces, si multiplico por x de ambos lados, tengo que x sobre 1 menos x es x por todo esto,",
        "start": 1088.84,
        "end": 1098.84
    },
    {
        "text": " sea x más x cuadrado, más x cubo y así sucesivamente.",
        "start": 1098.84,
        "end": 1108.84
    },
    {
        "text": " Entonces, la función f de x va por x sobre 1 menos x es función generatriz de que sucesión.",
        "start": 1113.84,
        "end": 1126.84
    },
    {
        "text": " Entonces, el primer conficiente que es el término independiente acá es 0.",
        "start": 1129.84,
        "end": 1140.84
    },
    {
        "text": " El conficiente de x es 1, el de 12 es 1, es de 13 es 1, etc.",
        "start": 1140.84,
        "end": 1147.84
    },
    {
        "text": " ¿Sí?",
        "start": 1147.84,
        "end": 1151.84
    },
    {
        "text": " Ya lo porqué.",
        "start": 1152.84,
        "end": 1154.84
    },
    {
        "text": " Ah, bueno.",
        "start": 1154.84,
        "end": 1156.84
    },
    {
        "text": " Entonces, de hecho, acá podemos hacer una pequeña observación general, ¿Sí?",
        "start": 1156.84,
        "end": 1165.84
    },
    {
        "text": " Sí, es la función generatriz de la sucesión a su vene, o sea, es la suma.",
        "start": 1165.84,
        "end": 1172.84
    },
    {
        "text": " De asusero, ¿Qué pasó?",
        "start": 1173.84,
        "end": 1178.84
    },
    {
        "text": " Más a su 1 de x, más a su 2 x cuadrado, etc.",
        "start": 1178.84,
        "end": 1183.84
    },
    {
        "text": " ¿Sí?",
        "start": 1183.84,
        "end": 1186.84
    },
    {
        "text": " Cuando hacemos x por f de x, ¿Sí?",
        "start": 1188.84,
        "end": 1193.84
    },
    {
        "text": " O sea, f de x es esto y es función generatriz de la sucesión a su vene, ¿Sí?",
        "start": 1193.84,
        "end": 1201.84
    },
    {
        "text": " Entonces, x por f de x es a su 0 x, más a su 1 x cuadrado, más a su 2 x cubo, etc.",
        "start": 1202.84,
        "end": 1212.84
    },
    {
        "text": " ¿Sí?",
        "start": 1212.84,
        "end": 1215.84
    },
    {
        "text": " Entonces, esto no dice que x es f de x, es la función generatriz de la sucesión.",
        "start": 1215.84,
        "end": 1225.84
    },
    {
        "text": " Entonces, acá el término independiente es 0, ¿Mmm?",
        "start": 1226.84,
        "end": 1231.84
    },
    {
        "text": " El coeficiente del término de grado 1 es a su 0, a su 1, después a su 2, etc.",
        "start": 1231.84,
        "end": 1242.84
    },
    {
        "text": " ¿Sí?",
        "start": 1242.84,
        "end": 1243.84
    },
    {
        "text": " Entonces, esta era función generatriz de la sucesión a su 0, a su 1, a su 2, etc.",
        "start": 1243.84,
        "end": 1252.84
    },
    {
        "text": " Multiplicarla por x, nos corre la sucesión a un lugar poniéndonos el 0 en primer lugar.",
        "start": 1252.84,
        "end": 1258.84
    },
    {
        "text": " Eso es lo que hicimos acá.",
        "start": 1261.84,
        "end": 1264.84
    },
    {
        "text": " Bueno, bárbaro.",
        "start": 1264.84,
        "end": 1266.84
    },
    {
        "text": " Entonces, el ejemplo 4 nos decía que x sobre 1 menos x,",
        "start": 1270.84,
        "end": 1280.84
    },
    {
        "text": " era igual a x más x cuadrado, más x cubo, más x a la cuarta, etc.",
        "start": 1281.84,
        "end": 1289.84
    },
    {
        "text": " Y bueno, ahí tengo del lado derecho, del lado izquierdo, desigualdad,",
        "start": 1293.84,
        "end": 1297.84
    },
    {
        "text": " cosas que dependen de x, ¿Sí?",
        "start": 1299.84,
        "end": 1301.84
    },
    {
        "text": " Voy a derivar respecto de x.",
        "start": 1304.84,
        "end": 1307.84
    },
    {
        "text": " Entonces, la derivada respecto de x,",
        "start": 1308.84,
        "end": 1312.84
    },
    {
        "text": " de x sobre 1 menos x va a ser igual a la derivada respecto de x,",
        "start": 1314.84,
        "end": 1321.84
    },
    {
        "text": " de x más x cuadrado, más x cubo, etc.",
        "start": 1323.84,
        "end": 1328.84
    },
    {
        "text": " O sea,",
        "start": 1331.84,
        "end": 1333.84
    },
    {
        "text": " la primera cosa es 1 menos x cuadrado por,",
        "start": 1334.84,
        "end": 1344.84
    },
    {
        "text": " entonces derivamos esta cosa, entonces es el cuadrado del denominador por,",
        "start": 1347.84,
        "end": 1354.84
    },
    {
        "text": " la derivada del numerador por el denominador,",
        "start": 1357.84,
        "end": 1361.84
    },
    {
        "text": " menos el numerador por la derivada del denominador que es menos x, ¿Sí?",
        "start": 1363.84,
        "end": 1380.84
    },
    {
        "text": " Entonces, esto es 1 sobre 1 menos x al cuadrado, ¿Ah?",
        "start": 1381.84,
        "end": 1386.84
    },
    {
        "text": " Muy bien, una manera, no, acá hice algo mal, ¿Qué? ¿Cómo?",
        "start": 1387.84,
        "end": 1401.84
    },
    {
        "text": " Y hice alguna, ¿Qué?",
        "start": 1403.84,
        "end": 1405.84
    },
    {
        "text": " 1 menos x cuando lo derrío, da menos 1, ¿Tenás razón?",
        "start": 1408.84,
        "end": 1411.84
    },
    {
        "text": " Tener razón, a ver, va de vuelta.",
        "start": 1412.84,
        "end": 1416.84
    },
    {
        "text": " La derivada de la primera por la segunda, menos la primera,",
        "start": 1419.84,
        "end": 1424.84
    },
    {
        "text": " por la derivada de la segunda, que es menos 1 y me quedó 1 sobre 1 menos x cuadrado.",
        "start": 1425.84,
        "end": 1433.84
    },
    {
        "text": " Eso está bien, bueno.",
        "start": 1434.84,
        "end": 1436.84
    },
    {
        "text": " Este...",
        "start": 1442.84,
        "end": 1444.84
    },
    {
        "text": " Este...",
        "start": 1450.84,
        "end": 1452.84
    },
    {
        "text": " A ver si es este ejemplo que quería hacer.",
        "start": 1455.84,
        "end": 1459.84
    },
    {
        "text": " ¿Y qué es algo que no me gusta nada? ¿No? Algo hice mal, porque a ver, si derrío 1 sobre 1,",
        "start": 1463.84,
        "end": 1470.84
    },
    {
        "text": " 1 menos x, esto es derivado 1 menos x al a menos 1.",
        "start": 1471.84,
        "end": 1476.84
    },
    {
        "text": " ¿Sí? Entonces, es menos 1 por 1 menos x al a menos 2 por la derivada de esto.",
        "start": 1478.84,
        "end": 1485.84
    },
    {
        "text": " Y está claro que esta función y esta función no tienen la misma derivada.",
        "start": 1486.84,
        "end": 1492.84
    },
    {
        "text": " Entonces, yo derivé mal, está en algún lugar.",
        "start": 1493.84,
        "end": 1497.84
    },
    {
        "text": " Este...",
        "start": 1498.84,
        "end": 1502.84
    },
    {
        "text": " Capaz que... Está bien, ¿capaz que podemos hacer los dos ejéntulos?",
        "start": 1502.84,
        "end": 1506.84
    },
    {
        "text": " A ver, vamos a...",
        "start": 1507.84,
        "end": 1509.84
    },
    {
        "text": " No es en la escuela primaria donde escribieron con rojo en la hoja tabare.",
        "start": 1511.84,
        "end": 1516.84
    },
    {
        "text": " ¿Sí?",
        "start": 1516.84,
        "end": 1518.84
    },
    {
        "text": " ¿Sí?",
        "start": 1519.84,
        "end": 1521.84
    },
    {
        "text": " 1 sobre 1 menos x será 1 más x más x cuadrado, más x, cu, etc. ¿Sí?",
        "start": 1522.84,
        "end": 1528.84
    },
    {
        "text": " Entonces, derivar con respecto a x.",
        "start": 1529.84,
        "end": 1534.84
    },
    {
        "text": " 1 sobre 1 menos x es lo mismo que derivar con respecto a x.",
        "start": 1536.84,
        "end": 1541.84
    },
    {
        "text": " 1 más x más x cuadrado, más x, cu, etc.",
        "start": 1541.84,
        "end": 1546.84
    },
    {
        "text": " ¿Sí?",
        "start": 1549.84,
        "end": 1550.84
    },
    {
        "text": " Entonces, derivó lo primero, que es este bicho a la menos 1.",
        "start": 1552.84,
        "end": 1558.84
    },
    {
        "text": " Entonces me queda menos 1 por el bicho a la menos 2 por la derivada del bicho que es menos 1.",
        "start": 1559.84,
        "end": 1567.84
    },
    {
        "text": " Entonces, derivar de este lado fue fácil.",
        "start": 1570.84,
        "end": 1573.84
    },
    {
        "text": " Ahora, ya tengo que derivar una suma infinita.",
        "start": 1574.84,
        "end": 1577.84
    },
    {
        "text": " Pero yo les dije que nosotros cosas hacíamos tratar como fueron polinomias.",
        "start": 1579.84,
        "end": 1583.84
    },
    {
        "text": " Y yo lo voy a derivar así sin que me tiembla el bulzo y ya está. ¿Sí?",
        "start": 1584.84,
        "end": 1588.84
    },
    {
        "text": " Entonces, cuando derivó del otro lado, eso me queda 0 más 1 más 2x más x,",
        "start": 1589.84,
        "end": 1600.84
    },
    {
        "text": " más 3x cuadrado, más 4x, cu, etc. ¿Sí?",
        "start": 1601.84,
        "end": 1612.84
    },
    {
        "text": " ¿Está bien?",
        "start": 1616.84,
        "end": 1617.84
    },
    {
        "text": " Entonces, este era el ejemplo que querías ser... Bien.",
        "start": 1619.84,
        "end": 1623.84
    },
    {
        "text": " Entonces, la función 1 sobre 1 menos x cuadrado es la función generatriz de la sucesión 1, 2, 3, 4, etc.",
        "start": 1624.84,
        "end": 1642.84
    },
    {
        "text": " ¿Sí?",
        "start": 1643.84,
        "end": 1644.84
    },
    {
        "text": " Este es el...",
        "start": 1644.84,
        "end": 1645.84
    },
    {
        "text": " Este es el ejemplo que tenía para hacer. Bien.",
        "start": 1648.84,
        "end": 1650.84
    },
    {
        "text": " Bueno.",
        "start": 1653.84,
        "end": 1654.84
    },
    {
        "text": " Bueno.",
        "start": 1654.84,
        "end": 1655.84
    },
    {
        "text": " Bueno.",
        "start": 1655.84,
        "end": 1656.84
    },
    {
        "text": " Bueno.",
        "start": 1657.84,
        "end": 1658.84
    },
    {
        "text": " Bueno.",
        "start": 1659.84,
        "end": 1660.84
    },
    {
        "text": " Bueno.",
        "start": 1661.84,
        "end": 1662.84
    },
    {
        "text": " Este es el ejemplo 5. Vamos a hacer una más.",
        "start": 1682.84,
        "end": 1685.84
    },
    {
        "text": " Ahora, por ejemplo, puedo multiplicar esto por x, o sea, multiplicando por x, el ejemplo anterior.",
        "start": 1686.84,
        "end": 1695.84
    },
    {
        "text": " Tenemos que x sobre 1 menos x al cuadrado.",
        "start": 1704.84,
        "end": 1709.84
    },
    {
        "text": " ¿Sí?",
        "start": 1710.84,
        "end": 1711.84
    },
    {
        "text": " Es x más 2x cuadrado, más 3x cubo, más 4x al 4, etc.",
        "start": 1714.84,
        "end": 1727.84
    },
    {
        "text": " Sí, simplemente multiplique por x de los dos lados.",
        "start": 1727.84,
        "end": 1730.84
    },
    {
        "text": " ¿Sí?",
        "start": 1731.84,
        "end": 1732.84
    },
    {
        "text": " ¿Sí?",
        "start": 1736.84,
        "end": 1737.84
    },
    {
        "text": " Y ahora, voy a derivar.",
        "start": 1737.84,
        "end": 1739.84
    },
    {
        "text": " La derivada con respecto a x de x sobre 1 menos x al cuadrado, va a ser lo mismo que derivar con respecto a x.",
        "start": 1746.84,
        "end": 1758.84
    },
    {
        "text": " x más 2x más 2x cuadrado, perdón, más 3x cubo, etc.",
        "start": 1760.84,
        "end": 1769.84
    },
    {
        "text": " O sea, ahora sí tengo que derivar bien.",
        "start": 1774.84,
        "end": 1779.84
    },
    {
        "text": " 1 menos x al cuadrado va a quedar a la cuarta en el denominador.",
        "start": 1782.84,
        "end": 1789.84
    },
    {
        "text": " Bueno.",
        "start": 1791.84,
        "end": 1793.84
    },
    {
        "text": " Esto me queda 1 menos x al cuadrado, menos x por 2, 1 menos x con un más acá.",
        "start": 1793.84,
        "end": 1808.84
    },
    {
        "text": " Estoy bien.",
        "start": 1808.84,
        "end": 1809.84
    },
    {
        "text": " Entonces, 1 cuadrado, 1 menos x se me va y abajo me queda 1 menos x al cubo, o sea, este y este cuadrado se me van con este 4 y me queda al cubo y me queda 1 menos x más 2x.",
        "start": 1810.84,
        "end": 1835.84
    },
    {
        "text": " Entonces, me queda 1 más x sobre 1 menos x al cubo y eso es la derivada si la hice bien esta vez.",
        "start": 1836.84,
        "end": 1845.84
    },
    {
        "text": " Y del otro lado, de divo como si fuera un polinomio, entonces me queda 1 más 2 al cuadrado x más 3 al cuadrado x cuadrado,",
        "start": 1847.84,
        "end": 1862.84
    },
    {
        "text": " más 4 al cuadrado x al cubo, etc.",
        "start": 1863.84,
        "end": 1867.84
    },
    {
        "text": " Sí, ahí simplemente derivamos de los dos lados.",
        "start": 1875.84,
        "end": 1878.84
    },
    {
        "text": " Entonces, la función 1 más x sobre 1 menos x al cubo es la función generatriz de que sucesión.",
        "start": 1878.84,
        "end": 1900.84
    },
    {
        "text": " De la sucesión de los cuadrados, de la sucesión que tiene 1, 2 al cuadrado, 3 al cuadrado, 4 al cuadrado, etc.",
        "start": 1909.84,
        "end": 1920.84
    },
    {
        "text": " 1 más 2x, acá me quedó 1 menos x más 2x, me quedó 1 más x sobre 1.",
        "start": 1924.84,
        "end": 1935.84
    },
    {
        "text": " Ustedes estén atentos porque como ven, yo uso mucho este método pedagógico para ver si están atentos, ¿eh? Eso debe hacer más las cuentas.",
        "start": 1936.84,
        "end": 1946.84
    },
    {
        "text": " Ya me sale tan natural, muy bien.",
        "start": 1948.84,
        "end": 1953.84
    },
    {
        "text": " Entonces, a ver, barro entonces hasta ahora hicimos manipulaciones con funciones que conocíamos para ver a qué sucesión es correspondía.",
        "start": 1954.84,
        "end": 1973.84
    },
    {
        "text": " Ahora yo puedo agarrar esta y multiplicarla por x cuadrado y lo que voy a hacer es correr estas sucesión 2 lugares y por 2 cero al principio.",
        "start": 1974.84,
        "end": 1985.84
    },
    {
        "text": " Y después le puedo sumar otra cosa, etc.",
        "start": 1985.84,
        "end": 1992.84
    },
    {
        "text": " Un ejemplo más por la siguiente, si yo agarró esta, habíamos quedado en que 1 más x sobre 1 menos x al cubo,",
        "start": 1993.84,
        "end": 2008.84
    },
    {
        "text": " era 1, ya más 4x más 9x cuadrado, más 16x al cubo, etc.",
        "start": 2009.84,
        "end": 2020.84
    },
    {
        "text": " Entonces, si yo agarró este mismo bicho y le resto 8x,",
        "start": 2021.84,
        "end": 2041.84
    },
    {
        "text": " y esto me va a quedar 1 menos 4x más 9x cuadrado, etc.",
        "start": 2042.84,
        "end": 2056.84
    },
    {
        "text": " Entonces esto va a hacer la función generatriz de la sucesión 1 menos 4, 9, 16, etc.",
        "start": 2056.84,
        "end": 2068.84
    },
    {
        "text": " Si se ve,",
        "start": 2072.84,
        "end": 2078.84
    },
    {
        "text": " Entonces, manipulando las funciones, podemos obtener nuevas funciones que son funciones generatrices de nuevas sucesiones.",
        "start": 2079.84,
        "end": 2097.84
    },
    {
        "text": " Ahora, si tenemos una sucesión, siempre podemos escribir su función generatriz como una serie,",
        "start": 2097.84,
        "end": 2107.84
    },
    {
        "text": " capaz que la podemos escribir también de otra manera.",
        "start": 2107.84,
        "end": 2112.84
    },
    {
        "text": " Entonces, por ejemplo, si yo tomo la sucesión a su vene igual en el cuadrado más cero,",
        "start": 2112.84,
        "end": 2125.84
    },
    {
        "text": " ¿Como tiene un majory igual que cero?",
        "start": 2126.84,
        "end": 2133.84
    },
    {
        "text": " ¿Cuál es su función generatriz?",
        "start": 2133.84,
        "end": 2139.84
    },
    {
        "text": " Bueno, por supuesto que su función generatriz, una manera de escribirla simplemente como la serie de n cuadrado más n por x,",
        "start": 2156.84,
        "end": 2168.84
    },
    {
        "text": " de términos generales o no, pero capaz que podemos escribirla de manera más amigable.",
        "start": 2168.84,
        "end": 2177.84
    },
    {
        "text": " Entonces, vamos a escribirla de otro modo.",
        "start": 2178.84,
        "end": 2184.84
    },
    {
        "text": " Entonces, ¿Qué pasa si tomamos n?",
        "start": 2185.84,
        "end": 2191.84
    },
    {
        "text": " Primero, miremos esta parte de la sucesión, este sumando.",
        "start": 2191.84,
        "end": 2204.84
    },
    {
        "text": " Entonces, la función generatriz de la sucesión de términos general n, o sea de cero, 1, 2, 3, etc., es x más x cuadrado,",
        "start": 2205.84,
        "end": 2224.84
    },
    {
        "text": " más x cubo y así sucesivamente. ¿Se ve?",
        "start": 2224.84,
        "end": 2230.84
    },
    {
        "text": " No, perdón, 1 más, perdón, x más 2x cuadrado, más 3x cubo, etc., etc.,",
        "start": 2235.84,
        "end": 2254.84
    },
    {
        "text": " pero esta función ya la habíamos calculado en un ejemplo anterior y era x, el ejemplo 6 era x dividido 1 menos x cuadrado.",
        "start": 2255.84,
        "end": 2268.84
    },
    {
        "text": " ¿Sí?",
        "start": 2268.84,
        "end": 2270.84
    },
    {
        "text": " Entonces, esta serie es x dividido 1 menos x cuadrado.",
        "start": 2270.84,
        "end": 2277.84
    },
    {
        "text": " Este era el ejemplo 6.",
        "start": 2278.84,
        "end": 2284.84
    },
    {
        "text": " Por otro lado, la función generatriz de la sucesión de términos general n,",
        "start": 2292.84,
        "end": 2306.84
    },
    {
        "text": " n cuadrado, que es 0, 1, 4, 9, 16, etc.,",
        "start": 2306.84,
        "end": 2319.84
    },
    {
        "text": " va a ser x, porque no tiene término independiente, más x cuadrado, más 4x cubo, más 9x a la 4, etc., etc.,",
        "start": 2319.84,
        "end": 2340.84
    },
    {
        "text": " ¿Sí?",
        "start": 2340.84,
        "end": 2342.84
    },
    {
        "text": " Esto no es exactamente ninguno de los ejemplos anteriores, pero aquí ejemplo se parece esto.",
        "start": 2343.84,
        "end": 2356.84
    },
    {
        "text": " Este parece exacto la derivada de este bicho, que era esto, ¿Sí?",
        "start": 2356.84,
        "end": 2377.84
    },
    {
        "text": " El que me es que es eso multiplicado por x, entonces esto es x por 1, 1 más x,",
        "start": 2377.84,
        "end": 2396.84
    },
    {
        "text": " la les querido en el 0, si 1, no, les querido en mal, a ver, es 0, 1, 4, 9,",
        "start": 2396.84,
        "end": 2405.84
    },
    {
        "text": " entonces 0 es el primer término que no está acá, 1 es este, 4, x cuadrado, más 9, x cubo,",
        "start": 2405.84,
        "end": 2416.84
    },
    {
        "text": " más 16, x, 4, etc., ¿Sí? O sea, 0 es el término independiente, 1 es el coeficiente de x, 4 es el coeficiente de x cuadrado, etc., ¿Sí?",
        "start": 2416.84,
        "end": 2430.84
    },
    {
        "text": " Entonces, al cizaco x de factor cubo, esto me queda x por 1, más 4x, más 9x cuadrado, etc.,",
        "start": 2430.84,
        "end": 2451.84
    },
    {
        "text": " y ahora esto sí es por este gelo 6 que está ahí abajo, x por 1 más x dividido, 1 menos x al cubo.",
        "start": 2451.84,
        "end": 2472.84
    },
    {
        "text": " Entonces, vamos a recapitular, yo quiero allá la función generatriz de la sucesión de término general,",
        "start": 2481.84,
        "end": 2494.84
    },
    {
        "text": " n cuadrado más n, ¿Sí? Entonces cuando mire la parte roja, ¿Sí?",
        "start": 2494.84,
        "end": 2501.84
    },
    {
        "text": " Y si esta sucesión, cuya función generatriz es esto de esta acá, ¿Sí?",
        "start": 2501.84,
        "end": 2510.84
    },
    {
        "text": " Y cuando mire la parte verde, ¿Qué es la sucesión de n cuadrado?",
        "start": 2510.84,
        "end": 2518.84
    },
    {
        "text": " ¿Mum? ¿Me queda esto de esta acá? ¿Sí? No es exactamente este ejemplo, porque esta es la función generatriz de la sucesión 1, 4, 9, 16, etc.,",
        "start": 2518.84,
        "end": 2538.84
    },
    {
        "text": " y acá en realidad cuando pienso que a su venez, o sea cuando pienso en n cuadrado desde el igual 0, quiero la sucesión de 0, 1, 4, 9, ¿Sí?",
        "start": 2538.84,
        "end": 2549.84
    },
    {
        "text": " Por eso multiplico la función generatriz por x.",
        "start": 2549.84,
        "end": 2555.84
    },
    {
        "text": " Entonces tengo la función generatriz de la parte roja y de la parte verde,",
        "start": 2558.84,
        "end": 2567.84
    },
    {
        "text": " y tengo que la función generatriz de la sucesión subn, ¿Qué es n? ¿En el cuadrado más n?",
        "start": 2567.84,
        "end": 2576.84
    },
    {
        "text": " Es la función f de x que es esto, pero que también se puede escribir como x sobre 1,",
        "start": 2576.84,
        "end": 2588.84
    },
    {
        "text": " menos x cuadrado, más x sobre 1 más x, digo x por 1 más x sobre 1 menos x al cubo.",
        "start": 2588.84,
        "end": 2605.84
    },
    {
        "text": " ¿Qué? Por supuesto es una expresión que se puede simplificar. ¿Sí?",
        "start": 2605.84,
        "end": 2614.84
    },
    {
        "text": " Muy bien. Hasta acá, vamos a menos bien.",
        "start": 2614.84,
        "end": 2632.84
    },
    {
        "text": " Bueno, vamos a dar un último ejemplo.",
        "start": 2632.84,
        "end": 2645.84
    },
    {
        "text": " Y después vamos a ver cómo estamos las funciones generatrices para resolver problemas de contigo, ¿Qué es el objetivo?",
        "start": 2645.84,
        "end": 2662.84
    },
    {
        "text": " Entonces, vamos a recordar lo siguiente. La definición de números combinatorios.",
        "start": 2663.84,
        "end": 2671.84
    },
    {
        "text": " Sí, si tengo naturales...",
        "start": 2671.84,
        "end": 2688.84
    },
    {
        "text": " Si tengo naturales nr con r, menor igual que n, ¿Sí?",
        "start": 2688.84,
        "end": 2693.84
    },
    {
        "text": " Habíamos definido las combinaciones de n tomada de r como n factorial sobre r factorial por n menos r factorial.",
        "start": 2693.84,
        "end": 2710.84
    },
    {
        "text": " ¿Sí? Entonces, esto era n por n menos 1 por n menos 2.",
        "start": 2710.84,
        "end": 2725.84
    },
    {
        "text": " Entonces, por acá tengo n menos r más 1 por n menos r, etc.",
        "start": 2725.84,
        "end": 2738.84
    },
    {
        "text": " Ahora, hasta 1. Esto es n factorial y acá tengo r factorial por n menos r factorial.",
        "start": 2738.84,
        "end": 2746.84
    },
    {
        "text": " ¿Sí?",
        "start": 2746.84,
        "end": 2750.84
    },
    {
        "text": " Solamente escribí que cosa es n factorial. Entonces, esto que tengo acá es justamente n menos r factorial.",
        "start": 2750.84,
        "end": 2764.84
    },
    {
        "text": " ¿Sí?",
        "start": 2764.84,
        "end": 2771.84
    },
    {
        "text": " ¿Ento? ¿Cómo?",
        "start": 2771.84,
        "end": 2778.84
    },
    {
        "text": " Sí, pero son naturales mayores iguales que cero.",
        "start": 2778.84,
        "end": 2785.84
    },
    {
        "text": " El problema es si vos pensás que los naturales contienen a cero o no.",
        "start": 2785.84,
        "end": 2791.84
    },
    {
        "text": " ¿Qué es un problema? ¿Cuales teológicos o el cual no me quiero pronunciar?",
        "start": 2791.84,
        "end": 2796.84
    },
    {
        "text": " Entonces, esto arriba es n por n menos 1 por n menos 2 hasta n menos r más 1 dividido r factorial.",
        "start": 2796.84,
        "end": 2814.84
    },
    {
        "text": " ¿Sí?",
        "start": 2814.84,
        "end": 2818.84
    },
    {
        "text": " Ahora, ese número combinatorio es lo que siempre fue.",
        "start": 2818.84,
        "end": 2821.84
    },
    {
        "text": " Ahora, observemos que esta expresión tiene sentido, aunque n no sea un número natural, aunque no sea mayor que darrere, aunque no nada.",
        "start": 2821.84,
        "end": 2835.84
    },
    {
        "text": " O sea, si r es un entero positivo, r factorial sí tiene sentido.",
        "start": 2835.84,
        "end": 2844.84
    },
    {
        "text": " Y después lo derribe es un producto en un montón de números.",
        "start": 2844.84,
        "end": 2848.84
    },
    {
        "text": " Entonces, esta expresión que está acá a diferencia de esta derriba tiene sentido, aunque n sea real.",
        "start": 2848.84,
        "end": 2861.84
    },
    {
        "text": " Y para todo r entero positivo o entero no negativo sí queda.",
        "start": 2865.84,
        "end": 2888.84
    },
    {
        "text": " Entonces, lo que vamos a hacer es definir para n natural, vamos a definir las combinaciones de menos n tomadas r,",
        "start": 2888.84,
        "end": 2914.84
    },
    {
        "text": " y r también tiene que ser un entero mayor o el que cero.",
        "start": 2914.84,
        "end": 2932.84
    },
    {
        "text": " Ambos mayores que iguales que cero de n.",
        "start": 2932.84,
        "end": 2938.84
    },
    {
        "text": " Definimos las combinaciones de menos r de menos n tomadas r simplemente como hacer esta cuenta con el número menos n.",
        "start": 2938.84,
        "end": 2949.84
    },
    {
        "text": " Entonces, esto va a ser r factorial abajo que si tiene sentido y después hacemos menos n por menos n, menos 1, menos n, menos 2, hasta menos n, menos r, más 1.",
        "start": 2949.84,
        "end": 2978.84
    },
    {
        "text": " Y bueno, y también vamos a definir para n real cualquiera vamos a decir que las combinaciones de n tomadas de 0, esto es 1.",
        "start": 2978.84,
        "end": 3001.84
    },
    {
        "text": " Eso es simplemente notación, más bien.",
        "start": 3002.84,
        "end": 3007.84
    },
    {
        "text": " Entonces, estos números combinatorios están definidos de manera medio caprichosa porque no son la respuesta a ningún problema de conteo real diamos, pero tienen bonitas propiedades.",
        "start": 3007.84,
        "end": 3025.84
    },
    {
        "text": " Entonces, vamos a ver, vamos a ver cuánto valen.",
        "start": 3025.84,
        "end": 3037.84
    },
    {
        "text": " Entonces, las combinaciones de menos n tomadas r, menos n, menos n, menos 1, hasta menos n, menos r, más 1. ¿Cuánto factoris hay en este número?",
        "start": 3038.84,
        "end": 3054.84
    },
    {
        "text": " ¿Cuánto factoris hay en este número?",
        "start": 3055.84,
        "end": 3066.84
    },
    {
        "text": " R factoris, ¿sí? Porque es como que este fuera menos n, menos 0, menos n, menos 1, hasta menos n, menos r, menos 1.",
        "start": 3067.84,
        "end": 3080.84
    },
    {
        "text": " Entonces, menos n y le restamos números, 0 hasta r, menos 1, son r números.",
        "start": 3081.84,
        "end": 3089.84
    },
    {
        "text": " Entonces, esto es menos 1 a la r y lo voy a cambiar todos y signo.",
        "start": 3089.84,
        "end": 3100.84
    },
    {
        "text": " Entonces, arriba tengo n por n más 1, por n más 2, por n más 3, hasta n más r, menos 1, sobre r factoria.",
        "start": 3101.84,
        "end": 3118.84
    },
    {
        "text": " Voy a seguir maquillando esto, esto es menos 1 a la r por.",
        "start": 3119.84,
        "end": 3132.84
    },
    {
        "text": " Entonces, observen que de lo que está en la rima, el más grande es este, n más r, menos 1.",
        "start": 3133.84,
        "end": 3147.84
    },
    {
        "text": " Entonces, en realidad es un producto de una sucesión de creciente que es este, menos 1, hasta n.",
        "start": 3147.84,
        "end": 3155.84
    },
    {
        "text": " Entonces, en realidad, si pongo a arriba, n, menos, más r, menos 1, factorial, acá abajo, copia la r, factorial. ¿Y qué es lo que agreguía acá?",
        "start": 3156.84,
        "end": 3178.84
    },
    {
        "text": " N factorial, acá tengo todavía el n, agregué el producto de n, menos 1, n, menos 2, n, menos 3.",
        "start": 3179.84,
        "end": 3187.84
    },
    {
        "text": " Entonces, en realidad lo que agregué es n, menos 1, factorial.",
        "start": 3187.84,
        "end": 3193.84
    },
    {
        "text": " No sé si se ve. ¿Por qué no suena la r?",
        "start": 3194.84,
        "end": 3201.84
    },
    {
        "text": " Ah, ¿por qué no suena la r?",
        "start": 3201.84,
        "end": 3203.84
    },
    {
        "text": " Bueno. Acá sea como menos 1, sí, escribo esto como menos 1 por n, esto es menos 1 por n más 1, por lo menos 1 por n más 2, etcétera.",
        "start": 3203.84,
        "end": 3219.84
    },
    {
        "text": " Entonces, ¿cuánto factores menos 1 tengo?",
        "start": 3220.84,
        "end": 3222.84
    },
    {
        "text": " R, entonces me queda menos 1 a la r, porque saqué r, factores iguales a menos 1, ¿sí? Y después de acá acá vamos a ver qué pasó.",
        "start": 3222.84,
        "end": 3243.84
    },
    {
        "text": " Vamos a hacer un paso más, siquiera, ¿está? El paso intermedio sería este.",
        "start": 3244.84,
        "end": 3249.84
    },
    {
        "text": " Copia lo que tengo, hago, menos 1 a la r por. Entonces, lo de arriba lo voy a copiar, lo voy a copiar al revés.",
        "start": 3249.84,
        "end": 3259.84
    },
    {
        "text": " Empezando por el número más grande que se den, menos 1, n más a r, menos 2, hasta acá tengo n más 1, n, dividido el factorial.",
        "start": 3259.84,
        "end": 3270.84
    },
    {
        "text": " Y después voy a multiplicar por el número 1, y el número 1 lo voy a escribir así, lo voy a escribir como n menos 1, n menos 2, etcétera, por 2 por 1 y acá lo mismo.",
        "start": 3271.84,
        "end": 3289.84
    },
    {
        "text": " ¿Sí?",
        "start": 3289.84,
        "end": 3291.84
    },
    {
        "text": " Por 2 por 1. Entonces, ahí no hice nada, y multiplique por 1, ¿sabé?",
        "start": 3292.84,
        "end": 3301.84
    },
    {
        "text": " Pero ahora esto que está arriba, esto simplemente son los mismos dado vuelta, pero esto que está arriba es el producto de todos los números consecutivos desde 1 hasta n más a r, menos 1.",
        "start": 3301.84,
        "end": 3317.84
    },
    {
        "text": " Entonces, esto que está acá es n más r, menos 1, factorial.",
        "start": 3318.84,
        "end": 3328.84
    },
    {
        "text": " Y esto que está acá abajo es n, menos 1, factorial.",
        "start": 3331.84,
        "end": 3337.84
    },
    {
        "text": " Entonces, así es como llegué a la igualdad que había acá hace un momento, que es, menos 1 a r por n más r, menos 1, factorial, sobre r, factorial por n menos 1, factorial.",
        "start": 3338.84,
        "end": 3361.84
    },
    {
        "text": " ¿Exactamente eso son las combinaciones con repetición?",
        "start": 3362.84,
        "end": 3368.84
    },
    {
        "text": " ¿Sí?",
        "start": 3369.84,
        "end": 3370.84
    },
    {
        "text": " Este número que está acá, vamos a sacar el menos 1 a la r, este número que está acá son las combinaciones de n más r, menos 1, factorial, que es lo mismo, que las combinaciones con repetición de n, factorial.",
        "start": 3370.84,
        "end": 3391.84
    },
    {
        "text": " Exactamente.",
        "start": 3392.84,
        "end": 3394.84
    },
    {
        "text": " Entonces, llegamos a la conclusión de que las combinaciones de menos n, tomadas de r, son menos 1 a la r por las combinaciones con repetición de n, tomadas de r.",
        "start": 3397.84,
        "end": 3413.84
    },
    {
        "text": " Entonces, ¿para qué vamos a usar esto?",
        "start": 3422.84,
        "end": 3432.84
    },
    {
        "text": " ¿Para varias cosas y lo primero es?",
        "start": 3433.84,
        "end": 3442.84
    },
    {
        "text": " Vamos a dar un ejemplo más de función generatriz, entonces, vamos a tomar la función f de x, igual a 1 más x a la menos n.",
        "start": 3442.84,
        "end": 3471.84
    },
    {
        "text": " Y bueno, quiero escribirla como una serie de potencias, o sea, como esto es como un polinomio pero largo.",
        "start": 3473.84,
        "end": 3486.84
    },
    {
        "text": " Y bueno, y la única manera que conozco de adarrar funciones y escribirla como polinomios, o como series, es el teorematelo.",
        "start": 3490.84,
        "end": 3501.84
    },
    {
        "text": " Entonces, vamos a hallar la serie de maclore en esta función, o sea, la serie de Taylor en el punto 0.",
        "start": 3503.84,
        "end": 3514.84
    },
    {
        "text": " Entonces, vamos a hallar la serie de Taylor en el 0, de las funciones f de x, entonces, ¿para eso qué tenemos que hacer?",
        "start": 3515.84,
        "end": 3537.84
    },
    {
        "text": " Tengo la función y calculo a la derivada, bien, entonces, ese prima de x es menos n, 1 más x a la menos n,",
        "start": 3538.84,
        "end": 3559.84
    },
    {
        "text": " por la derivada de 1 más x es que es 1, ¿sí? ¿Modern?",
        "start": 3560.84,
        "end": 3569.84
    },
    {
        "text": " ¿Y qué tenía que hacer con la derivada después? ¿Calcúo la derivada y qué tenía que hacer con ella?",
        "start": 3569.84,
        "end": 3575.84
    },
    {
        "text": " Evaluó el 0, entonces, f de prima de 0 es menos n, vamos a hallar la serie de Taylor en el 0,",
        "start": 3575.84,
        "end": 3587.84
    },
    {
        "text": " f segunda de x es, tengo el menos n, multiplicado por menos n, menos 1, por 1 menos x a la menos n,",
        "start": 3588.84,
        "end": 3602.84
    },
    {
        "text": " por la derivada de 1 más x con respecto a x es que es 1, ¿eh?",
        "start": 3602.84,
        "end": 3612.84
    },
    {
        "text": " Entonces, f segunda de 0 es, menos n por menos n, menos 1, ¿sí?",
        "start": 3612.84,
        "end": 3624.84
    },
    {
        "text": " Bueno, f tercera va a ser, el menos n, el menos n, menos 1, por menos n, menos 2, por 1 más x a la menos n,",
        "start": 3625.84,
        "end": 3642.84
    },
    {
        "text": " y bueno, ya esta altura creo que todo el mundo me cree que la derivada f de f de ordenk,",
        "start": 3643.84,
        "end": 3668.84
    },
    {
        "text": " en cero, va a ser menos n, por menos n, menos 1, por menos n, menos 2, hasta menos n, menos k,",
        "start": 3669.84,
        "end": 3689.84
    },
    {
        "text": " más 1, ¿sí?",
        "start": 3690.84,
        "end": 3696.84
    },
    {
        "text": " ¿Por qué lo determinió geometricamente? Fijate que la derivada primera me queda menos n, menos 0,",
        "start": 3696.84,
        "end": 3709.84
    },
    {
        "text": " la derivada segunda me queda hasta el último me queda menos n, menos 1, la derivada segunda,",
        "start": 3709.84,
        "end": 3716.84
    },
    {
        "text": " pero la derivada tercero me queda menos n, menos 2, entonces, ¿sacá lo que tengo que poner es menos n, menos k,",
        "start": 3717.84,
        "end": 3725.84
    },
    {
        "text": " menos 1? ¿sí? ¿o sea, el último factor es menos n, menos, el anterior acá?",
        "start": 3725.84,
        "end": 3734.84
    },
    {
        "text": " Entonces, eso es menos n, menos k, más 1, ¿sí o más o menos? ¿sí?",
        "start": 3734.84,
        "end": 3752.84
    },
    {
        "text": " Entonces, acá tenemos todas las derivadas de todos los órdebes y ninguno es 0, ¿cómo el 1 más x? ¿cómo no hay nada?",
        "start": 3752.84,
        "end": 3769.84
    },
    {
        "text": " A, tán.",
        "start": 3770.84,
        "end": 3775.84
    },
    {
        "text": " Entonces, esto se valúa en x, si no, ya lo lo vamos a hacer.",
        "start": 3778.84,
        "end": 3781.84
    },
    {
        "text": " Ah, no, esto se valúa en 0, claro, me valúa en x, me faltaría, si lo hago, hay va, si lo hago en x,",
        "start": 3781.84,
        "end": 3789.84
    },
    {
        "text": " me faltaría acá un 1 más x a la n menos k, ¿sí?",
        "start": 3789.84,
        "end": 3798.84
    },
    {
        "text": " Entonces, la derivada de orden k en 0 es esto, menos n, menos n, menos 1, menos n, menos 2, hasta menos n, menos k, más 1. ¿sí?",
        "start": 3798.84,
        "end": 3816.84
    },
    {
        "text": " Bueno, esto, también, yo lo hice a ojo, ¿sí?",
        "start": 3817.84,
        "end": 3828.84
    },
    {
        "text": " Pero si fuera una persona seria, ¿cómo lo habría hecho?",
        "start": 3828.84,
        "end": 3833.84
    },
    {
        "text": " Por inducción, ¿sí? O sea, esta fórmula para la derivada de orden k, se puede demostrar por inducción completa, ¿sí?",
        "start": 3833.84,
        "end": 3848.84
    },
    {
        "text": " N es un número que está fijo y se hace por inducción en k, por inducción en k se demuestra que la derivada cae si me han equivale esto y bueno, después se va a lo en 0, ¿sí?",
        "start": 3848.84,
        "end": 3860.84
    },
    {
        "text": " Perfecto, entonces, tenemos la derivada, tenemos la derivada en 0 y ¿qué se hacía con ellas para lo del polinomio de Taylor?",
        "start": 3864.84,
        "end": 3875.84
    },
    {
        "text": " Entonces, f de x es 1 más x a la menos n, ¿qué se hacía con el asunto del polinomio? ¿qué con la derivada? ¿qué?",
        "start": 3876.84,
        "end": 3896.84
    },
    {
        "text": " F de 0, ¿qué es igual a 1?",
        "start": 3897.84,
        "end": 3903.84
    },
    {
        "text": " 5 más f de 0 por x, más f de 0 por ¿qué?",
        "start": 3904.84,
        "end": 3925.84
    },
    {
        "text": " que este 2, muy bien, alguien dice 2 factorial, más puntito puntito puntito, el término",
        "start": 3925.84,
        "end": 3937.4
    },
    {
        "text": " cae, si no va a ser la derivada de orden C en 0 por xala k sobre k factorial, más puntito",
        "start": 3937.4,
        "end": 3955.4
    },
    {
        "text": " puntito puntito, bien, en nuestro caso esto es 1 más menos n por x, más menos n por",
        "start": 3955.4,
        "end": 3977.08
    },
    {
        "text": " menos n, menos 1 por x cuadrados sobre 2, más por acá la derivada de orden C va a ser",
        "start": 3977.08,
        "end": 3987.56
    },
    {
        "text": " menos n, menos n, menos 1 hasta menos n, menos k, más 1 por xala k sobre k factorial,",
        "start": 3987.56,
        "end": 4000.3199999999997
    },
    {
        "text": " más puntito puntito puntito, bien, precioso escribo esto como la suma desde k igual ser",
        "start": 4000.32,
        "end": 4012.6400000000003
    },
    {
        "text": " infinito, de menos n por menos n, menos 1 hasta menos n, menos k, más 1 sobre k factorial",
        "start": 4012.6400000000003,
        "end": 4029.1200000000003
    },
    {
        "text": " por xala k, tiene nombre el bicho de globo rojo, exacto, exactamente, esto es lo que",
        "start": 4029.12,
        "end": 4057.56
    },
    {
        "text": " habíamos llamado combinaciones de menos n, tomadas de acá, que era lo mismo, que decir que",
        "start": 4057.56,
        "end": 4064.44
    },
    {
        "text": " menos 1 al acá por combinaciones con repetición de n tomadas de más, entonces esto me quedó",
        "start": 4064.44,
        "end": 4072.6
    },
    {
        "text": " la suma desde k igual 0 a infinito, de combinaciones de menos n tomadas de acá por xala",
        "start": 4072.6,
        "end": 4084.04
    },
    {
        "text": " y con la suma de menos n, menos 1 por xala k, entonces vamos a comparar estos dos resultados,",
        "start": 4084.04,
        "end": 4094.52
    },
    {
        "text": " el bicho y querido teorema el binomio nos decía que 1 más x a la n era igual a la suma desde",
        "start": 4099.12,
        "end": 4109.44
    },
    {
        "text": " k igual 0 hasta n de combinaciones de n tomadas de acá por xala k, este es el binomio y ahora",
        "start": 4109.44,
        "end": 4121.32
    },
    {
        "text": " lo que acabamos de ver es que 1 más x a la menos n y si igual a la serie desde k igual",
        "start": 4121.32,
        "end": 4129.919999999999
    },
    {
        "text": " a ser infinito de combinaciones de menos n tomadas de acá por xala k, o sea para las potencias",
        "start": 4129.92,
        "end": 4151.32
    },
    {
        "text": " negativas de 1 más x vale una fórmula muy parecida a la fórmula del binomio, pero hay que tener",
        "start": 4151.32,
        "end": 4160.799999999999
    },
    {
        "text": " cuidado porque esto no es un polinomio, es una serie, pero bueno el numerito combinatorio,",
        "start": 4160.799999999999,
        "end": 4178.12
    },
    {
        "text": " este de las combinaciones de menos n, sirvió para escribir esa linda fórmula muy bien,",
        "start": 4178.12,
        "end": 4184.16
    },
    {
        "text": " entonces barbaro, entonces además vimos que la función esta f de x igual 1 más x a la",
        "start": 4186.8,
        "end": 4204.68
    },
    {
        "text": " menos n es la función generatriz de la sucesión combinaciones de menos n tomadas de 0,",
        "start": 4204.68,
        "end": 4220.4400000000005
    },
    {
        "text": " combinaciones de menos n tomadas de 1 etcétera,",
        "start": 4220.4400000000005,
        "end": 4223.52
    },
    {
        "text": " entonces que ahora es muy bien,",
        "start": 4234.68,
        "end": 4259.280000000001
    },
    {
        "text": " bueno está claro está acá porque quisimos nosotros, nosotros en el curso estábamos estudiando",
        "start": 4259.28,
        "end": 4273.88
    },
    {
        "text": " con binatoria, estábamos resolviendo problemas de conteo, después empezamos a hablar de",
        "start": 4273.88,
        "end": 4283.2
    },
    {
        "text": " funciones generatrices, vimos cómo podíamos trabajar con ellas, manipularlas como si fueran polinomios,",
        "start": 4283.2,
        "end": 4290.76
    },
    {
        "text": " etcétera y vimos un montón de ejemplos de funciones generatrices, ahora lo que vamos a hacer es",
        "start": 4292.28,
        "end": 4298.639999999999
    },
    {
        "text": " volver al conteo y ver cómo la función generatriz nos sirven para resolver problemas de conteo,",
        "start": 4298.639999999999,
        "end": 4305.599999999999
    },
    {
        "text": " entonces si alguien tiene quejas contra las funciones generatrices antes de que empecemos",
        "start": 4305.6,
        "end": 4316.76
    },
    {
        "text": " a usarlas para resolver problemas más complejos el momento de quejarse ahora,",
        "start": 4316.76,
        "end": 4321.4800000000005
    },
    {
        "text": " por escrito al decano, está claro, vamos a seguir, si después surgen dudas,",
        "start": 4321.48,
        "end": 4351.12
    },
    {
        "text": " me preguntan porque las funciones generatrices son maravillosas, resolven mucho problemas,",
        "start": 4351.12,
        "end": 4357.68
    },
    {
        "text": " pero hay que manipularlas con soltura, entonces vamos a hacer un ejemplo,",
        "start": 4357.68,
        "end": 4364.68
    },
    {
        "text": " vamos a usar el coeficiente del término en x al a 5,",
        "start": 4364.68,
        "end": 4389.400000000001
    },
    {
        "text": " en la función generatriz, uno menos dos x al a menos siete,",
        "start": 4389.4,
        "end": 4410.24
    },
    {
        "text": " entonces, un o menos dos x al a menos siete, entonces qué es lo que tenemos que hacer,",
        "start": 4410.24,
        "end": 4431.2
    },
    {
        "text": " tenemos que arrar este bicho que es f de x y escribirlo como una serie, y después ver cuál es el",
        "start": 4431.2,
        "end": 4444.72
    },
    {
        "text": " numerito que multiplica a x al a 5, entonces nosotros no sabemos a zanada con uno menos dos x,",
        "start": 4444.72,
        "end": 4455.639999999999
    },
    {
        "text": " pero si sabemos hacer algo con uno más x, entonces vamos a ponerle un nombre a menos dos x,",
        "start": 4455.64,
        "end": 4468.360000000001
    },
    {
        "text": " vamos a hacer este cambio de variable, entonces uno menos dos x al a menos siete, ahora se volvió",
        "start": 4468.36,
        "end": 4479.839999999999
    },
    {
        "text": " uno más y al a menos siete, y ahora sí eso tiene una pinta muy amigable, entonces uno más y al",
        "start": 4479.839999999999,
        "end": 4493.0199999999995
    },
    {
        "text": " a menos siete que es la serie, entonces se observen que ahora el n que está ahí abajo es 7,",
        "start": 4493.02,
        "end": 4505.02
    },
    {
        "text": " esto va a ser la suma desde k igual 0 infinito de las combinaciones de menos 7 tomadas de acá por",
        "start": 4507.580000000001,
        "end": 4519.02
    },
    {
        "text": " menos 2 al a k por x al a k, y ahora vamos a dar quién era ahí, y era menos dos x, entonces ahora esto",
        "start": 4519.02,
        "end": 4532.3
    },
    {
        "text": " es la suma desde k igual ser infinito de combinaciones de menos 7 tomadas de acá por menos 2 al a k por x al a k,",
        "start": 4532.3,
        "end": 4547.62
    },
    {
        "text": " claro, o sea lo que dice el compañero es que acá en vez de poner, de cambiarle el nombre ponga",
        "start": 4563.3,
        "end": 4572.860000000001
    },
    {
        "text": " esto ante el pariente si lo lo trabaje como un paquetito, pero hacer el cambio variable es lo mismo,",
        "start": 4572.860000000001,
        "end": 4578.9400000000005
    },
    {
        "text": " es como pensar que es un paquetes y trabajar con menos dos x como que fuera una sola cosa,",
        "start": 4578.9400000000005,
        "end": 4586.18
    },
    {
        "text": " entonces estamos de acuerdo hasta acá, y bueno, ¿y cuál es el coeficiente de x al a k,",
        "start": 4587.06,
        "end": 4594.820000000001
    },
    {
        "text": " el coeficiente de x al a k, corresponde a tomar k igual a 5,",
        "start": 4594.820000000001,
        "end": 4606.18
    },
    {
        "text": " sí, miro acá en esta serie, tomo k igual a 5 y miro igual es el numerito de este,",
        "start": 4607.06,
        "end": 4613.46
    },
    {
        "text": " es combinaciones de menos 7 tomadas de 5 por menos 2 al a 5,",
        "start": 4615.46,
        "end": 4624.14
    },
    {
        "text": " podemos mejorar esto un poco, esto va a ser menos, 2 al a k y 5 por combinaciones de",
        "start": 4627.34,
        "end": 4635.780000000001
    },
    {
        "text": " menos 7 tomadas de 5 y de 7 más 5, menos 1 tomadas de 5 por menos 1 al a 5, o sea, si manipulan un",
        "start": 4635.78,
        "end": 4652.34
    },
    {
        "text": " poco debería quedar eso, sí, si manipulan un poco debería quedar eso y eso debería calcularse",
        "start": 4652.34,
        "end": 4663.34
    },
    {
        "text": " y lo calculo este caballero, el finísimo a persona grimal bien su casa y le dio 14.784,",
        "start": 4664.14,
        "end": 4674.7
    },
    {
        "text": " bueno, el último ejemplo, porque esto no es una clase de discreta 1 si no hay galletitas y",
        "start": 4674.7,
        "end": 4697.62
    },
    {
        "text": " sobrenas, entonces",
        "start": 4697.7,
        "end": 4703.22
    },
    {
        "text": " Entonces el último ejemplo es allá del porficiente de X a la 15.",
        "start": 4703.22,
        "end": 4733.2
    },
    {
        "text": " En la función generatriz, f de X es igual a X cuadrado, más X pudo, más.",
        "start": 4733.2,
        "end": 4761.24
    },
    {
        "text": " Esto es una serie, más X cubo, más X cuarta, etcétera, a la cuarta.",
        "start": 4761.24,
        "end": 4770.24
    },
    {
        "text": " Aquí es problema de galletitas y sobrinas correspondía esto.",
        "start": 4770.24,
        "end": 4775.24
    },
    {
        "text": " Entonces esa es la pregolla jueves.",
        "start": 4775.24,
        "end": 4780.24
    },
    {
        "text": " Esta es la pregunta para el fin de semana.",
        "start": 4781.24,
        "end": 4790.24
    },
    {
        "text": " Este a la cuarta viene del hecho que yo tengo, como todos saben, cuatro sobrinas.",
        "start": 4790.24,
        "end": 4796.24
    },
    {
        "text": " Aquí es el problema de galletitas y sobrinas corresponde esto.",
        "start": 4796.24,
        "end": 4821.24
    },
    {
        "text": " Ahí va, eso es una pregunta. La función basta y finito, pero queremos el coeficiente de X a la 15.",
        "start": 4821.24,
        "end": 4829.24
    },
    {
        "text": " Entonces atentos. Si yo te dijera la función basta 43.",
        "start": 4829.24,
        "end": 4840.24
    },
    {
        "text": " El coeficiente de X a la 15 cambia? No, porque todo lo que haya acá de grado mayor que 13, dado que empieza en 2, o sea, de grado mayor que 13.",
        "start": 4840.24,
        "end": 4862.24
    },
    {
        "text": " Está claro que todo lo que haya acá, todos los términos que tienen grado mayor que 15, no van a contribuir a X a la 15.",
        "start": 4862.24,
        "end": 4874.24
    },
    {
        "text": " De hecho, todo lo que tenga grado mayor que 9 no va a contribuir a el terminar de X a la 15.",
        "start": 4874.24,
        "end": 4882.24
    },
    {
        "text": " Entonces, si lo hago, va a ser lo mismo, si lo hago hasta 9, que si lo hago, infinito.",
        "start": 4882.24,
        "end": 4894.24
    },
    {
        "text": " Entonces, para que molestarme empezar donde cortar lo infinito.",
        "start": 4894.24,
        "end": 4900.24
    },
    {
        "text": " Bueno, y la próxima vez, allá vamos el coeficiente de X a la 15 de esto sin hacer cuentas truculentas.",
        "start": 4900.24,
        "end": 4908.24
    }
]