[
    {
        "text": " Bueno, muy bien. Ahí va.",
        "start": 0.0,
        "end": 19.0
    },
    {
        "text": " Se oye. Se oye.",
        "start": 19.0,
        "end": 26.0
    },
    {
        "text": " A ver. Lo prendí bien. Está a parbar. Bueno.",
        "start": 26.0,
        "end": 33.0
    },
    {
        "text": " Bueno, ¿qué tal?",
        "start": 33.0,
        "end": 38.0
    },
    {
        "text": " Estamos contando, estudiando combinaciones con repetición.",
        "start": 38.0,
        "end": 45.0
    },
    {
        "text": " Es lo que se llama lo que estamos haciendo. Entonces, había quedado planteado un problema que era siguiente.",
        "start": 45.0,
        "end": 57.0
    },
    {
        "text": " Yo era la panadería. Voy a comprar una docena de biscochos.",
        "start": 57.0,
        "end": 63.0
    },
    {
        "text": " Entonces, tengo los biscochos que nos gustan. Son los dulces comunes, o sea, los corazones dulces comunes, los salados comunes",
        "start": 63.0,
        "end": 74.0
    },
    {
        "text": " y los pán con grasa.",
        "start": 74.0,
        "end": 81.0
    },
    {
        "text": " Y de biscochos de estos tipos, voy a elegir una docena.",
        "start": 81.0,
        "end": 90.0
    },
    {
        "text": " Y la pregunta es, ¿de cuántas maneras puedo elegirlos?",
        "start": 90.0,
        "end": 97.0
    },
    {
        "text": " Y será el problema que está mostratado resolver la clase pasada.",
        "start": 97.0,
        "end": 121.0
    },
    {
        "text": " Entonces, el diagramito que estábamos haciendo la clase pasada para resolver este tipo de problema, es el siguiente.",
        "start": 121.0,
        "end": 134.0
    },
    {
        "text": " Digamos que yo voy a pedir de la docena, voy a pedir cinco dulces, cuatro salados y tres pán con grasa.",
        "start": 134.0,
        "end": 155.0
    },
    {
        "text": " Entonces, lo que estábamos haciendo era escribir esto diagramáticamente así.",
        "start": 155.0,
        "end": 167.0
    },
    {
        "text": " Voy a escribir cinco ex para los cinco dulces. Voy a poner una rayita, cuatro salados y tres pán con grasa.",
        "start": 167.0,
        "end": 184.0
    },
    {
        "text": " Entonces, si yo pienso que acá estoy diciendo cuántos dulces, cuántos salados y cuántos pán con grasa, este diagramo tiene toda la información.",
        "start": 184.0,
        "end": 196.0
    },
    {
        "text": " Porque tengo cinco ex, el primer lado de la raya que me divide los dulces y los salados y se entenderé el diagrama.",
        "start": 196.0,
        "end": 207.0
    },
    {
        "text": " Entonces, este problema es tan alogo al que teníamos la despasada en que teníamos cierto número de comenzales,",
        "start": 207.0,
        "end": 215.0
    },
    {
        "text": " y cuando platos de un menú con cierta cantidad de opciones, acá digamos esto es lo mismo que si tuvieramos 12 comenzales,",
        "start": 215.0,
        "end": 224.0
    },
    {
        "text": " eligiendo un menú con tres opciones y cada uno de ellos se lige si va a comer un biscocho dulce, un biscocho salado o un van a grasa.",
        "start": 224.0,
        "end": 235.0
    },
    {
        "text": " Entonces, cuántas maneras hay, cuántos arreglos de este tipo hay?",
        "start": 235.0,
        "end": 242.0
    },
    {
        "text": " Esto tiene 12 ex, más dos rayitas, o sea, 14 caracteres, dos de los cuales son rayas.",
        "start": 243.0,
        "end": 260.0
    },
    {
        "text": " Entonces, para determinar una disposición de cruces y rayas de este tipo, lo que tengo que elegir es de estos 14 lugares, ¿cuáles son los dos lugares donde van a poner una raya?",
        "start": 261.0,
        "end": 279.0
    },
    {
        "text": " ¿Se acuerdan?",
        "start": 279.0,
        "end": 282.0
    },
    {
        "text": " ¿Se acuerdan?",
        "start": 282.0,
        "end": 288.0
    },
    {
        "text": " Entonces, la pregunta de cuántas maneras puede elegir la docena de discochos es equivalente a, en una palabra de 12 caracteres, de 14 caracteres, 12 de los cuales son cruces y dos de los cuales son rayas,",
        "start": 288.0,
        "end": 308.0
    },
    {
        "text": " ¿que aozco cuántas palabras con estas características hay? Entonces, de cuántas maneras puedo ubicar las dos rayas.",
        "start": 309.0,
        "end": 316.0
    },
    {
        "text": " Y eso es elegir dónde van a ir las dos rayas, que de los 14 lugares, elegir los dos lugares donde van a ir las rayas, o sea, combinaciones de 14, tomas de 2,",
        "start": 316.0,
        "end": 329.0
    },
    {
        "text": " que es 14 factorial dividido, dos factorial por 2 factorial.",
        "start": 329.0,
        "end": 338.0
    },
    {
        "text": " Entonces, acá hay dos cosas de las cuales hay que estar bien convencido antes de seguir adelante.",
        "start": 343.0,
        "end": 348.0
    },
    {
        "text": " La primera es que el problema de los discochos se puede codificar así, eso está claro para todo el mundo.",
        "start": 349.0,
        "end": 359.0
    },
    {
        "text": " O sea, si yo les digo que yo voy a hacer esta compra de discochos, ¿qué voy a comprar?",
        "start": 363.0,
        "end": 374.0
    },
    {
        "text": " Voy a comprar ocho salados y cuatro pancongrasa. Veo algunas caras de poca convicción atrás.",
        "start": 379.0,
        "end": 386.0
    },
    {
        "text": " Dehamos de la quinta fila para adelante, todos son expertos en las compras de panadería.",
        "start": 387.0,
        "end": 392.0
    },
    {
        "text": " ¿Siven por qué esto quiere decir que voy a comprar ocho salados y cuatro pancongrasa?",
        "start": 396.0,
        "end": 401.0
    },
    {
        "text": " Y después que uno está razonablemente convencido de que las maneras de elegir una docena de discochos corresponden con este tipo de sucesiones de 12 caracteres,",
        "start": 409.0,
        "end": 425.0
    },
    {
        "text": " hay que estar convencido de que las maneras de ordenar 12 cruces y dos rayas es esta cantidad, ¿sí?",
        "start": 426.0,
        "end": 439.0
    },
    {
        "text": " Son de los 14 lugares que hay las maneras de elegir las dos rayas.",
        "start": 441.0,
        "end": 444.0
    },
    {
        "text": " Entonces, este 14 es la cantidad de discochos más la cantidad de discochos que voy a comprar más, la cantidad de variedades de discochos menos uno.",
        "start": 445.0,
        "end": 462.0
    },
    {
        "text": " Entonces, ahora vamos a definir que son las combinaciones con repetición en general.",
        "start": 462.0,
        "end": 479.0
    },
    {
        "text": " Entonces, si queremos elegir.",
        "start": 493.0,
        "end": 499.0
    },
    {
        "text": " El reobjeto con repetición de un conjunto de enobjetos distintos,",
        "start": 499.0,
        "end": 521.0
    },
    {
        "text": " Podemos hacer esto de",
        "start": 529.0,
        "end": 557.0
    },
    {
        "text": " combinaciones de N más R menos 1, tomas de R maneras",
        "start": 557.0,
        "end": 569.0
    },
    {
        "text": " y esto se va a llamar combinas R en R R bajo o CR en R",
        "start": 569.0,
        "end": 586.0
    },
    {
        "text": " y esto se va a llamar combinaciones de N más R y esto se va a llamar",
        "start": 599.0,
        "end": 624.0
    },
    {
        "text": " un menú de n elementos y vamos a elegir r veces de ese menú. Entonces uno puede elegir",
        "start": 624.0,
        "end": 636.08
    },
    {
        "text": " un item del menú más de una vez. Y este es el número de veces de manera de hacer eso",
        "start": 636.08,
        "end": 643.92
    },
    {
        "text": " que se llama combinaciones con repetición. Entonces si aplicamos esto a nuestro problema",
        "start": 643.92,
        "end": 649.84
    },
    {
        "text": " de los biscochos, lo que queremos elegir es cuántos biscochos, 12 biscochos. Esta es la",
        "start": 649.84,
        "end": 663.08
    },
    {
        "text": " manera más natural de esta definición, de un conjunto de tres distintos. O sea tenemos",
        "start": 663.08,
        "end": 674.24
    },
    {
        "text": " tres variedades de biscochos. Entonces hay, entonces ¿qué pasó hagas? La cantidad",
        "start": 674.24,
        "end": 695.16
    },
    {
        "text": " de biscochos que vamos a elegir es r y la cantidad de variedades de biscochos es n. Entonces",
        "start": 695.16,
        "end": 709.56
    },
    {
        "text": " hay combinaciones con repetición de n tomadas de r o sea combinaciones con repetición de tres",
        "start": 709.56,
        "end": 727.3599999999999
    },
    {
        "text": " tomadas de 12 que es combinaciones de tres más 12 menos uno sobre 12 maneras de hacerlo.",
        "start": 727.36,
        "end": 738.84
    },
    {
        "text": " O sea combinaciones de 14 tomadas de 12 maneras de hacerlo. ¿Por qué nos dio diferente acá?",
        "start": 748.84,
        "end": 755.12
    },
    {
        "text": " Tome el orden de la. Y lo mismo si no nos dio distinto es lo que están diciendo acá. Fíjense",
        "start": 757.36,
        "end": 773.2
    },
    {
        "text": " que combinaciones de 14 tomadas de 12 es lo mismo que combinaciones de 14 tomadas de 12.",
        "start": 773.2,
        "end": 783.44
    },
    {
        "text": " ¿Sí? Porque en ambos casos esto es 14 factorial sobre 2 factorial por 2 factorial o sea por 14",
        "start": 788.36,
        "end": 800.32
    },
    {
        "text": " menos 2 factorial. ¿Sí? Se acuerdan que cuando vimos combinaciones sabíamos",
        "start": 800.32,
        "end": 807.6
    },
    {
        "text": " hablado de eso, que en realidad combinaciones de Juan tomadas de Pedro es lo mismo que combinaciones",
        "start": 807.6,
        "end": 814.88
    },
    {
        "text": " de Juan tomadas de Juan menos Pedro. ¿Sí? Entonces si se quiere esta manera de pensarlo en que ponemos el 12,",
        "start": 814.88,
        "end": 823.4
    },
    {
        "text": " que quien se llama Juan y quien se llama Pedro. No me diga que te llama Juan Pedro porque",
        "start": 823.4,
        "end": 830.12
    },
    {
        "text": " si se quiere con el 12 acá abajo, es como que en vez de estar pensando donde ponemos las",
        "start": 833.12,
        "end": 843.8
    },
    {
        "text": " rayas, estamos pensando donde ponemos las X. ¿Sí? Pero de cualquier modo son las maneras de escribir las",
        "start": 843.8,
        "end": 854.0799999999999
    },
    {
        "text": " palabras de esta forma. Las combinaciones con repetición cuentan muchas cosas, no solamente",
        "start": 854.0799999999999,
        "end": 861.52
    },
    {
        "text": " docenas y bizcochos, entonces vamos a hacer más ejemplos. Vamos a hacer ejemplos de cosas que",
        "start": 861.52,
        "end": 872.76
    },
    {
        "text": " se cuentan con combinaciones con repetición y ejemplos de cómo usamos las combinaciones con",
        "start": 872.76,
        "end": 878.88
    },
    {
        "text": " repetición combinados con otros principios del conteo. Bien, entonces vamos a hacer un ejemplo.",
        "start": 878.88,
        "end": 889.56
    },
    {
        "text": " Yo tengo cuatro sobrinas, no sé si están enterados. Mis sobrinas son Ana,",
        "start": 889.56,
        "end": 907.4399999999999
    },
    {
        "text": " Verta, Carla y Ella. ¿Cuál es el problema de llamarse Darta?",
        "start": 907.44,
        "end": 921.5200000000001
    },
    {
        "text": " Esa son mis sobrinas, digamos, a ver si, perdón la última no se llama,",
        "start": 921.52,
        "end": 935.04
    },
    {
        "text": " y se llama Dalia se llama. Bien, estos son mis sobrinas, entonces el otro día fue el",
        "start": 935.04,
        "end": 950.0799999999999
    },
    {
        "text": " niño y yo orne 10 galletas de avena para repartir entre mis sobrinas. Orne 10 galletas de",
        "start": 950.08,
        "end": 967.36
    },
    {
        "text": " avena para repartir entre mis sobrinas. Entonces la primera pregunta es de cuántas maneras las puedo repartir.",
        "start": 967.36,
        "end": 974.96
    },
    {
        "text": " Las pude haber repartido, ¿no? Porque ya pasó, pero bueno, digamos que el año que viene",
        "start": 988.52,
        "end": 994.6800000000001
    },
    {
        "text": " volverá el día del niño. De cuántas maneras las puedo repartir.",
        "start": 995.68,
        "end": 1005.4
    },
    {
        "text": " A ver, ¿por qué? No, no que número, digamos, no quiero que me dían 821, sino quiero que me digan cómo",
        "start": 1005.4,
        "end": 1017.4799999999999
    },
    {
        "text": " abordo este problema. Ahí va, esa es la pregunta, le quiero dar una cada una, no, porque la verdad que Carla",
        "start": 1017.48,
        "end": 1024.76
    },
    {
        "text": " se portó muy mal conmigo la última que la vi, no necesariamente, digamos,",
        "start": 1026.48,
        "end": 1031.72
    },
    {
        "text": " uno no tiene que tener favoritismo con los hijos, con los sobrinos lo que venga, ahí va.",
        "start": 1034.96,
        "end": 1039.1200000000001
    },
    {
        "text": " Entonces no necesariamente está claro que no le puedo dar menos dos galletas a nadie,",
        "start": 1039.1200000000001,
        "end": 1044.2
    },
    {
        "text": " y está claro que no voy a empezar a partir las galletas en pedacitos, pero no necesariamente le tengo que dar",
        "start": 1044.72,
        "end": 1049.6000000000001
    },
    {
        "text": " galletas a cada una. Entonces cómo abordo este problema?",
        "start": 1049.6000000000001,
        "end": 1055.56
    },
    {
        "text": " Con la sequisa, entonces ¿qué van a hacer las sequisas? Las galletas y las rayas,",
        "start": 1061.16,
        "end": 1068.2
    },
    {
        "text": " las chiquilinas, ahí va. Entonces esto,",
        "start": 1068.2,
        "end": 1074.72
    },
    {
        "text": " esto que quiere decir,",
        "start": 1082.56,
        "end": 1084.04
    },
    {
        "text": " que le di dos galletas a Ana, tres galletas a verta,",
        "start": 1086.68,
        "end": 1093.24
    },
    {
        "text": " cinco galletas a Carla y Dalia, no tiene galletas.",
        "start": 1094.24,
        "end": 1101.24
    },
    {
        "text": " Entonces las maneras van a ser las maneras de ordenar 10 galletas más, tres barritas, o sea, 13 símbolos,",
        "start": 1103.24,
        "end": 1113.4
    },
    {
        "text": " de los cuales tres son rayas.",
        "start": 1117.4,
        "end": 1119.2
    },
    {
        "text": " Entonces,",
        "start": 1124.24,
        "end": 1126.24
    },
    {
        "text": " esto va a ser combinaciones de 13 tomadas de a 3, o sea, las maneras de ubicar las tres rayas",
        "start": 1131.24,
        "end": 1147.24
    },
    {
        "text": " en esa secuencia de 13 símbolos, esto es lo mismo que combinaciones de 13 tomadas de a 10,",
        "start": 1147.24,
        "end": 1162.0
    },
    {
        "text": " ¿qué? Porque son las maneras, porque son tres rayas las que necesito para separar, tengo cuatro",
        "start": 1163.0,
        "end": 1177.4
    },
    {
        "text": " sobrinas, entonces con tres rayas ya indico cuántas van para mis sobrinas, la ve y la seyla de,",
        "start": 1177.4,
        "end": 1185.28
    },
    {
        "text": " entonces capaz que,",
        "start": 1185.28,
        "end": 1190.68
    },
    {
        "text": " capaz que de otra manera de pensarlo, es este, ¿eh?",
        "start": 1190.68,
        "end": 1204.92
    },
    {
        "text": " ¿Cómo lo pensarían términos de este problema? Quiero elegir qué objetos con repetición,",
        "start": 1205.92,
        "end": 1216.8000000000002
    },
    {
        "text": " ¿cómo puedo pensar en términos de combinaciones con repetición?",
        "start": 1216.8000000000002,
        "end": 1219.92
    },
    {
        "text": " Entonces este problema de las cruces y las rayas ser un problema de combinaciones con repetición.",
        "start": 1219.92,
        "end": 1224.52
    },
    {
        "text": " Quiero elegir, claro, quiero elegir 10 veces entre cuatro sobrinas, o sea, cada galleta,",
        "start": 1224.52,
        "end": 1242.4
    },
    {
        "text": " voy a elegir 10 veces entre cuatro sobrinas, entonces lo que voy a hacer es agarrar la primera galleta y elijo a",
        "start": 1242.4,
        "end": 1263.8000000000002
    },
    {
        "text": " una de mis sobrinas, se la doy, agarrar la segunda galleta, elijo a una y se la doy,",
        "start": 1263.8,
        "end": 1270.3999999999999
    },
    {
        "text": " para cada galleta lo que tengo que hacer es elegir una chiquidina a quien darle esa galleta,",
        "start": 1270.3999999999999,
        "end": 1275.68
    },
    {
        "text": " ¿sí? entonces cuando lo pienso así, lo que pienso es elijo 10 veces a una sobrina,",
        "start": 1275.68,
        "end": 1286.52
    },
    {
        "text": " entonces este 10 es el R, elijo R sobrinas con repetición del conjunto de mis cuatro sobrinas,",
        "start": 1323.8,
        "end": 1340.2
    },
    {
        "text": " entonces este 10 es el R y esto es el N más R menos 1, entonces esto me queda, perdón,",
        "start": 1340.2,
        "end": 1361.2
    },
    {
        "text": " combinaciones con repetición de, perdón, mezclé dos notaciones de cuatro tomadas de 10,",
        "start": 1361.2,
        "end": 1371.2
    },
    {
        "text": " o sea combinaciones de cuatro más 10 menos uno tomadas de 10, o sea combinaciones de 13 tomadas de 10,",
        "start": 1371.2,
        "end": 1382.0
    },
    {
        "text": " ¿sí? que es lo mismo que tenemos acá abajo, o sea este es la cantidad de sobrinas,",
        "start": 1382.0,
        "end": 1391.36
    },
    {
        "text": " o sea parece un poco ridículo, el elijo 10 sobrinas con repetición de un conjunto de cuatro sobrinas",
        "start": 1413.0,
        "end": 1421.36
    },
    {
        "text": " posibles, pero es eso lo que estoy haciendo al ajudicar cada galleta, ¿sí? si alguien tenía una",
        "start": 1421.36,
        "end": 1427.8
    },
    {
        "text": " pregunta por allá, ¿se ve o no se ve? ¿por qué este problema de las galletas es similar a ese",
        "start": 1427.8,
        "end": 1441.36
    },
    {
        "text": " este día? ¿sí? a dar randos sobrinas en vez de galletas, ¿por qué? o sea cuál sería la",
        "start": 1441.36,
        "end": 1456.1599999999999
    },
    {
        "text": " solución alternativa? claro, pero es repartir galletas a las sobrinas, pero las sobrinas son",
        "start": 1456.1599999999999,
        "end": 1467.7199999999998
    },
    {
        "text": " todos distintas y las galletas son todas iguales, entonces las sobrinas están jugando el papel del",
        "start": 1467.72,
        "end": 1480.32
    },
    {
        "text": " pan con grasa, el biscocho dulce, el biscocho salado que son distintos, ¿sí? o sea no es lo mismo,",
        "start": 1480.32,
        "end": 1489.24
    },
    {
        "text": " elegir un biscocho dulce que un biscocho salado con pan con grasa, no es lo mismo de la galleta",
        "start": 1489.24,
        "end": 1494.2
    },
    {
        "text": " sana, que a dalia, que a verta, ¿sí? ¿por qué le dije en vez de que sea una sobrina?",
        "start": 1494.2,
        "end": 1505.0800000000002
    },
    {
        "text": " no es que elija siempre la misma, lo que quiero decir es que hay tantas maneras de repartir",
        "start": 1505.0800000000002,
        "end": 1511.16
    },
    {
        "text": " las galletas entre mis sobrinas como decir, bueno, para cada galleta tengo que elegir a quien se",
        "start": 1511.16,
        "end": 1516.16
    },
    {
        "text": " salda hoy, entonces tengo que elegir 10 veces, tantas veces como galletas tengo en el conjunto",
        "start": 1516.16,
        "end": 1525.8400000000001
    },
    {
        "text": " mis cuatro sobrinas, si lo quiero, lo que estamos tratando digamos es hacer una batería de ejemplo",
        "start": 1525.8400000000001,
        "end": 1539.6000000000001
    },
    {
        "text": " que muestran, como la idea de combinaciones con repetición que es inicialmente el problema",
        "start": 1539.6,
        "end": 1547.1599999999999
    },
    {
        "text": " inicial era somos, digamos, 10 comenzales que elegimos entre cuatro items y un menú, ¿sí?",
        "start": 1547.1599999999999,
        "end": 1554.1999999999998
    },
    {
        "text": " elegimos menú, uno, dos, tres y cuatro, cada una de las 10 personas, ¿sí? me parece que esa",
        "start": 1554.1999999999998,
        "end": 1561.1999999999998
    },
    {
        "text": " idea de que somos 10 personas, elegiendo en un menú, corresponde bien a esta idea de que elegimos",
        "start": 1561.2,
        "end": 1568.6000000000001
    },
    {
        "text": " R, almuerzo digamos, de un conjunto de cuatro posibles, ¿no? me parece que esa idea es bastante",
        "start": 1568.6000000000001,
        "end": 1579.9
    },
    {
        "text": " natural y llegamos a la conclusión de que este es el número de maneras de servos. Y ahora,",
        "start": 1579.9,
        "end": 1586.88
    },
    {
        "text": " es lo que quiero enfatizar con el ejemplo es que este objeto está en número que son las",
        "start": 1586.88,
        "end": 1595.14
    },
    {
        "text": " combinaciones con repetición, sirven para muchos problemas, no solo para el resto de",
        "start": 1595.14,
        "end": 1599.24
    },
    {
        "text": " la gente, entonces ¿qué pasa si ahora? digamos, yo lo que voy a repartir es menú, uno, dos,",
        "start": 1599.24,
        "end": 1604.44
    },
    {
        "text": " tres, cuatro, digamos, tengo galletas que son todas iguales y las voy a repartir entre mis cuatro",
        "start": 1604.44,
        "end": 1610.5400000000002
    },
    {
        "text": " sobrinas y lo podemos pensar exactamente iguales como pensábamos que los 10 comenzales",
        "start": 1610.54,
        "end": 1618.1399999999999
    },
    {
        "text": " se le dien en los cuatro menúes, podemos pensar que hay tanta manera de hacerlo como cada galleta",
        "start": 1618.1399999999999,
        "end": 1624.58
    },
    {
        "text": " elige una sobrina a la cual irá para ardeamos, o sea, a los efectos de contar es lo mismo,",
        "start": 1624.58,
        "end": 1630.8999999999999
    },
    {
        "text": " es un poco grotesque el ejemplo, ¿no? pero los efectos de contar, la simetría acá se da",
        "start": 1630.9,
        "end": 1643.5800000000002
    },
    {
        "text": " en lo siguiente, que en el momento en que íbamos 10 comenzales al restaurante y elegíamos un menú,",
        "start": 1643.5800000000002,
        "end": 1649.98
    },
    {
        "text": " si acuerdan que no importaba si yo elegía milanesa y marianita sopa o marianita elegía",
        "start": 1651.3400000000001,
        "end": 1659.5400000000002
    },
    {
        "text": " milanesa y yo sopa, lo que importaba es que habíamos elegido una milanesa, una sopa y",
        "start": 1659.54,
        "end": 1665.1399999999999
    },
    {
        "text": " 18 tartas, ¿no importaba quién elegía que? entonces en el ejemplo del restaurante los 10",
        "start": 1665.1399999999999,
        "end": 1672.1399999999999
    },
    {
        "text": " comenzales seramos iguales y los ítems del menú eran distintas, acá las sobrinas son distintas y",
        "start": 1672.1399999999999,
        "end": 1680.1
    },
    {
        "text": " las galletas son iguales, esa es la similitud con el ejemplo del restaurante.",
        "start": 1680.1,
        "end": 1684.78
    },
    {
        "text": " entonces para digamos si lo pienso así con crucesitas y rayitas que yo creo que no es una mala idea,",
        "start": 1690.4199999999998,
        "end": 1698.6999999999998
    },
    {
        "text": " pensarlo con crucesitas y rayitas, uno se convence de que este tipo de diagramas codifican todas",
        "start": 1698.6999999999998,
        "end": 1705.3
    },
    {
        "text": " las maneras en las que yo puedo repartir las galletas entre las sobrinas y se llegue este número",
        "start": 1705.3,
        "end": 1711.3799999999999
    },
    {
        "text": " y este número, es un número y está perfecto, pero en realidad cualquier cosa que yo puedo escribir",
        "start": 1711.3799999999999,
        "end": 1719.34
    },
    {
        "text": " con este tipo de diagramas hay una manera de pensarla como combinación con repetición,",
        "start": 1719.34,
        "end": 1724.18
    },
    {
        "text": " en este caso lo que voy a hacer es para cada galleta elegir la sobrina de la que se la doy,",
        "start": 1724.18,
        "end": 1730.78
    },
    {
        "text": " eso es lo que el hijo, por eso el hijo dentro del conjunto es sobrina, se elijo a quien le doy la galleta,",
        "start": 1731.78,
        "end": 1739.42
    },
    {
        "text": " bueno muy bien pero es verdad me convencieron de que eso de no darle nada d'alía, no es simpático,",
        "start": 1739.42,
        "end": 1751.1399999999999
    },
    {
        "text": " entonces vamos a pensar de cuántas maneras las puedo repartir pero dándole a cada grisa al menos",
        "start": 1754.1399999999999,
        "end": 1760.06
    },
    {
        "text": " una galleta, ¿no?",
        "start": 1760.06,
        "end": 1762.06
    },
    {
        "text": " Entonces acá están proponiendo una solución, dicen bueno para empezar le doy una galleta cada una,",
        "start": 1790.06,
        "end": 1802.7
    },
    {
        "text": " así ya cada una tiene al menos una galleta y entonces en realidad me quedan 6 galletas para repartir",
        "start": 1802.7,
        "end": 1813.34
    },
    {
        "text": " entre 4 galletas, ¿no?",
        "start": 1813.34,
        "end": 1815.34
    },
    {
        "text": " Entonces ¿cómo repartiría?",
        "start": 1815.34,
        "end": 1843.34
    },
    {
        "text": " De cuántas maneras puedo repartir 6 galletas entre las 4 niñas, no, pero ya llegué al número 6 dándole",
        "start": 1843.34,
        "end": 1859.58
    },
    {
        "text": " una cada una, bueno pero no, o sea yo se le digo una cada una, ya es la restricción, yo tenía 10",
        "start": 1859.58,
        "end": 1869.1799999999998
    },
    {
        "text": " galletas, la restricción de que cada una tenga una, la cubridandole una galleta cada una y ahora tengo 6 pero",
        "start": 1869.18,
        "end": 1878.02
    },
    {
        "text": " no tengo por que darle una cada una ahora, claro ahora digamos la 6 que me quedan se las puede",
        "start": 1878.02,
        "end": 1883.5
    },
    {
        "text": " dar a Ana, porque ya todas les di algo, sí se ve uno, al menos una galleta, no, pero acordate que el",
        "start": 1883.5,
        "end": 1904.82
    },
    {
        "text": " principio yo tenía 10 galletas, yo tenía 10, le di una cada una, todavía me quedan 6, o sea por lo",
        "start": 1904.82,
        "end": 1915.9399999999998
    },
    {
        "text": " estás pensando que el total de galletas era 6, no, pero el total inicial de andies, o sea ese 6 vino",
        "start": 1915.9399999999998,
        "end": 1928.54
    },
    {
        "text": " de que ya le di una cada una, me explico, o sea acá el problema es cuando digo lo puedo hacer,",
        "start": 1928.54,
        "end": 1936.78
    },
    {
        "text": " esto quiere decir repartir 10 galletas, o sea nuestro malentendido no es matemático,",
        "start": 1938.1399999999999,
        "end": 1951.6599999999999
    },
    {
        "text": " sí, sí ven lo que están diciendo, ahora tengo que repartir 10 galletas entre las 4 niñas de manera",
        "start": 1958.54,
        "end": 1970.22
    },
    {
        "text": " que cada niña le toque al menos una galleta, entonces ya no tengo la misma libertad que antes, si",
        "start": 1970.22,
        "end": 1979.86
    },
    {
        "text": " a cada una le tiene que tocar al menos una galleta, bueno le doy una cada una y después me queda 6",
        "start": 1979.86,
        "end": 1988.26
    },
    {
        "text": " galletas y ahora sí tengo absoluta libertad para repartir las 6 galletas, por ejemplo le puedo dar 6",
        "start": 1988.26,
        "end": 1996.4599999999998
    },
    {
        "text": " galletas a una sola de las niñas, entonces de cuántas maneras el problema de de cuántas maneras",
        "start": 1996.4599999999998,
        "end": 2009.3
    },
    {
        "text": " puedo repartir 10 galletas, dando a cada sobrina al menos una galleta, es lo mismo que preguntar de",
        "start": 2009.3,
        "end": 2017.82
    },
    {
        "text": " cuántas maneras puedo repartir 6 galletas entre 4 niñas, pero sin ninguna restricción, o sea particular",
        "start": 2017.82,
        "end": 2026.94
    },
    {
        "text": " no tengo la obligación de darle a nadie, entonces ¿cómo va a ser? Para cada una de las 6 galletas",
        "start": 2026.94,
        "end": 2035.4199999999998
    },
    {
        "text": " tengo que elegir a que niñas le doy, y ahora tengo que hacer esto mismo, claro solo que con 6",
        "start": 2035.42,
        "end": 2047.78
    },
    {
        "text": " galletas, o pensar que elijo una de mis sobrinas, elijo 6 veces una sobrina, o sea elijo 6 sobrinas",
        "start": 2047.78,
        "end": 2061.66
    },
    {
        "text": " con repetición de mi conjunto de 4 sobrinas para adjudicar las galletas,",
        "start": 2061.66,
        "end": 2067.66
    },
    {
        "text": " a este número se puede llegar también mediante un diagrama de crucesitas y palitos,",
        "start": 2091.66,
        "end": 2099.3399999999997
    },
    {
        "text": " bueno",
        "start": 2104.3799999999997,
        "end": 2104.8999999999996
    },
    {
        "text": " y qué pasa si quiero?",
        "start": 2104.9,
        "end": 2120.98
    },
    {
        "text": " Repartir las 10 galletas, de cuántas maneras puedo repartir las 10 galletas, dando a cada sobrina al menos",
        "start": 2120.98,
        "end": 2135.26
    },
    {
        "text": " 4 galletas, y en realidad, y dando a mi sobrina a que es lo tan cita al menos 4 galletas,",
        "start": 2165.26,
        "end": 2182.9
    },
    {
        "text": " de cuántas maneras puedo hacer esto, entonces para cumplir con las restricciones,",
        "start": 2195.26,
        "end": 2214.5
    },
    {
        "text": " voy a dar para empezar 2 4 anas y 1 a verta, 1 a Carla y 1 a Dalia, entonces con esto ya repartí 7",
        "start": 2214.5,
        "end": 2238.7
    },
    {
        "text": " galletas, si a cada una de ellos quedan al menos 1, y a an al menos 4, le voy 4 a an a una cada una de las",
        "start": 2238.7,
        "end": 2251.62
    },
    {
        "text": " otras y me quedan 3 galletas para repartir entre 4 niñas, y ahora si esas 3 galletas las puedo repartir",
        "start": 2251.62,
        "end": 2270.62
    },
    {
        "text": " como quiera, tan de acuerdo, entonces de cuántas maneras puedo repartir 3 galletas entre 4 niñas,",
        "start": 2270.62,
        "end": 2282.7799999999997
    },
    {
        "text": " digieron 2 números que son el mismo, o sea voy a elegir 3 veces alguna de mis 4 sobrinas para dar",
        "start": 2282.78,
        "end": 2302.98
    },
    {
        "text": " una galleta, entonces van a hacer de las 4 sobrinas elijo 3 con repetición para dar la galleta,",
        "start": 2302.98,
        "end": 2311.9
    },
    {
        "text": " que esto va a ser combinaciones de 4 más 3 menos 1, tomas de 3, o sea combinaciones de 6,",
        "start": 2314.06,
        "end": 2326.46
    },
    {
        "text": " tomas de 3, o sea 6 factorial dividido, 3 factorial por 3 factorial,",
        "start": 2326.46,
        "end": 2332.58
    },
    {
        "text": " ahorarez y...",
        "start": 2332.7799999999997,
        "end": 2337.74
    },
    {
        "text": " ¿Venga?",
        "start": 2338.3199999999997,
        "end": 2339.3199999999997
    },
    {
        "text": " Ahora qué os va?",
        "start": 2343.8999999999996,
        "end": 2346.7
    },
    {
        "text": " No.",
        "start": 2351.4399999999996,
        "end": 2352.5
    },
    {
        "text": " Bueno.",
        "start": 2357.7799999999997,
        "end": 2358.9199999999996
    },
    {
        "text": " Muy bien. Entonces, vamos a hacer un ejemplo un poco distinto.",
        "start": 2367.74,
        "end": 2397.2
    },
    {
        "text": " Vamos a transmitir un mensaje que tiene 12 simbolos distintos y 45 espacios.",
        "start": 2397.2,
        "end": 2420.06
    },
    {
        "text": " Y hay una restricción que es que entre cada par de simbolos consecutivos, entre dos simbolos",
        "start": 2427.2,
        "end": 2444.08
    },
    {
        "text": " consecutivos, vamos a poner al menos 13 espacios.",
        "start": 2444.08,
        "end": 2459.88
    },
    {
        "text": " Cuántos mensajes posibles hay con estas características.",
        "start": 2459.88,
        "end": 2483.38
    },
    {
        "text": " Vamos a agregar una característica adicional para que quede bien determinado el problema,",
        "start": 2483.38,
        "end": 2491.38
    },
    {
        "text": " que comenzamos y terminamos con un simbol o sea no con un espacio en blanco.",
        "start": 2491.38,
        "end": 2501.38
    },
    {
        "text": " Cuántos mensajes distintos con estas características hay.",
        "start": 2513.38,
        "end": 2523.38
    },
    {
        "text": " Entonces, ¿qué pasaría si el mensaje tuviera solo los 12 simbolos distintos?",
        "start": 2544.38,
        "end": 2556.38
    },
    {
        "text": " Serían permutaciones de dos, que es lo mismo que 12 factorial.",
        "start": 2556.38,
        "end": 2561.38
    },
    {
        "text": " Hay permutaciones de 12 maneras de ordenar los 12 símbolos.",
        "start": 2561.38,
        "end": 2590.38
    },
    {
        "text": " Y ahora que están ordenados los símbolos, tenemos que contar de cuántas maneras podemos introducir los espacios.",
        "start": 2592.38,
        "end": 2608.38
    },
    {
        "text": " Vamos para amar el mensaje, tenemos los símbolos y van a estar los espacios ahí en el medio con la restricción entre dos simbolos consecutivos, van al menos 13 espacios.",
        "start": 2609.38,
        "end": 2626.38
    },
    {
        "text": " Pero eso es por definición lo que es un mensaje. Entonces la pregunta es cuántos mensajes hay que cumplir esto.",
        "start": 2627.38,
        "end": 2633.38
    },
    {
        "text": " O sea para mi un mensaje es de cuando yo trabajaba en el servicio secreto.",
        "start": 2633.38,
        "end": 2640.38
    },
    {
        "text": " Un mensaje tenía 12 símbolos y 45 espacios.",
        "start": 2640.38,
        "end": 2646.38
    },
    {
        "text": " Entonces mandábamos sucesiones de 12 símbolos bien separados, poníamos 13 espacios entre dos símbolos consecutivos al menos.",
        "start": 2647.38,
        "end": 2660.38
    },
    {
        "text": " Y el total de un mensaje tenía los 12 símbolos y 45 espacios.",
        "start": 2660.38,
        "end": 2666.38
    },
    {
        "text": " Entonces la pregunta es cuántos mensajes posibles podemos mandar con este formato de mensaje.",
        "start": 2667.38,
        "end": 2673.38
    },
    {
        "text": " Los símbolos son distintos. Y cada uno lo mandamos una vez.",
        "start": 2673.38,
        "end": 2678.38
    },
    {
        "text": " Ahí va, entonces él dice los símbolos son las barritas.",
        "start": 2686.38,
        "end": 2690.38
    },
    {
        "text": " Y ya tenemos la manera en que van a ir ordenado los símbolos.",
        "start": 2691.38,
        "end": 2696.38
    },
    {
        "text": " Y ahora, acá están, digamos símbolo 1, símbolo 2, símbolo 3, hasta símbolo 12.",
        "start": 2696.38,
        "end": 2706.38
    },
    {
        "text": " Y ahora cómo podemos poner los espacios?",
        "start": 2706.38,
        "end": 2711.38
    },
    {
        "text": " Hay vamos a poner 13 espacios entre cada part de símbolos, sí, porque tiene el carme de 3.",
        "start": 2712.38,
        "end": 2721.38
    },
    {
        "text": " Y después vemos que pasa con los espacios que falta, después se ubicaron los que faltan.",
        "start": 2721.38,
        "end": 2725.38
    },
    {
        "text": " Entonces ¿cuántos espacios hay entre dos símbolos?",
        "start": 2725.38,
        "end": 2731.38
    },
    {
        "text": " Hay no, pero ¿cuántos?",
        "start": 2732.38,
        "end": 2734.38
    },
    {
        "text": " Hoy hay 11 sí. Entonces acá van tres espacios.",
        "start": 2734.38,
        "end": 2739.38
    },
    {
        "text": " Aquí también, etc.",
        "start": 2743.38,
        "end": 2745.38
    },
    {
        "text": " Entonces con esto ya no tuvimos ninguna elección, sí, al ubicar, al poner tres espacios entre cada part de símbolos consecutivos.",
        "start": 2751.38,
        "end": 2760.38
    },
    {
        "text": " Hay 11 por 3 que son 33 espacios que colocamos simplemente poniendo 3 entre cada part de símbolos.",
        "start": 2760.38,
        "end": 2785.38
    },
    {
        "text": " Entre cada part de símbolos consecutivos, se entiende.",
        "start": 2791.38,
        "end": 2802.38
    },
    {
        "text": " Entonces lo que me queda son 12 espacios, o sea,",
        "start": 2802.38,
        "end": 2812.38
    },
    {
        "text": " quedan 45 menos 33 que es 12 espacios para ubicar.",
        "start": 2812.38,
        "end": 2827.38
    },
    {
        "text": " Para ubicar en cuántos lugares posibles?",
        "start": 2827.38,
        "end": 2841.38
    },
    {
        "text": " 12 o 13.",
        "start": 2841.38,
        "end": 2844.38
    },
    {
        "text": " En ¿no? Sí, porque para eso pusimos esta cláusula que dice que comenzamos y terminamos con un símbolo.",
        "start": 2844.38,
        "end": 2854.38
    },
    {
        "text": " Si no sería en 13, o sea, no estamos permitiendo que el mensaje comience o termine con un espacio.",
        "start": 2855.38,
        "end": 2863.38
    },
    {
        "text": " En 11 lugares posibles.",
        "start": 2863.38,
        "end": 2870.38
    },
    {
        "text": " Entonces ahora el negocio es tenemos 12 espacios para ubicar en 11 lugares posibles.",
        "start": 2870.38,
        "end": 2892.38
    },
    {
        "text": " Entonces para cada espacio vamos a elegir uno de los 11 lugares donde puede ir.",
        "start": 2892.38,
        "end": 2903.38
    },
    {
        "text": " Entonces tenemos que elegir entre los 11 lugares de donde vamos a elegir 12 veces.",
        "start": 2903.38,
        "end": 2927.38
    },
    {
        "text": " Con repetición, o sea, podemos elegir por ejemplo 5 veces el espacio tercero.",
        "start": 2928.38,
        "end": 2934.38
    },
    {
        "text": " Eso quiere decir que en el espacio tercero que existe aquí entre el 3 y el 4, vamos a poner cuantas veces dije que elegimos 5 espacios, 5 de estos 12 espacios.",
        "start": 2934.38,
        "end": 2948.38
    },
    {
        "text": " Hay muchas cosas que se llaman espacio en este ejemplo. Eso es para confundirla el enemigo.",
        "start": 2949.38,
        "end": 2955.38
    },
    {
        "text": " Bien.",
        "start": 2955.38,
        "end": 2956.38
    },
    {
        "text": " Entonces si para cada uno de los 12 espacios elegimos uno de los 11 lugares las maneras de hacerlos son combinaciones con repetición de 11,",
        "start": 2956.38,
        "end": 2970.38
    },
    {
        "text": " 12 o sea combinaciones de 11 más 12, menos 1, más 12 o sea 22 factorial sobre 12 factorial por 10 factorial.",
        "start": 2970.38,
        "end": 2993.38
    },
    {
        "text": " Entonces si esto son las maneras de elegir donde van los espacios.",
        "start": 2993.38,
        "end": 3013.38
    },
    {
        "text": " Entonces para elegir un mensaje, ¿cuántos mensajes sabía? Eso es nuestra problema inicial.",
        "start": 3013.38,
        "end": 3022.38
    },
    {
        "text": " Entonces lo primero que hicimos fue elegir el orden en que iban a ir los 12 símbolos que eran diferentes.",
        "start": 3022.38,
        "end": 3033.38
    },
    {
        "text": " Eso se podía hacer de 12 factorial maneras y una vez que habíamos elegido un orden de esos 12 símbolos,",
        "start": 3033.38,
        "end": 3042.38
    },
    {
        "text": " teníamos esta cantidad de maneras de elegir cómo insertar los espacios entre ellos.",
        "start": 3042.38,
        "end": 3048.38
    },
    {
        "text": " Entonces cuál es la cantidad total posible de mensajes?",
        "start": 3048.38,
        "end": 3056.38
    },
    {
        "text": " 12 factorial por eso sí, por la regla del producto.",
        "start": 3057.38,
        "end": 3063.38
    },
    {
        "text": " Hay 12 factorial por 22 factorial por 12 factorial por 10 factorial mensajes distintos.",
        "start": 3063.38,
        "end": 3085.38
    },
    {
        "text": " Les cuento que esto es del orden de 10 a la 14 de 3 por 10 a la 14, o sea es como un 3 seguido de 14 0.",
        "start": 3085.38,
        "end": 3108.38
    },
    {
        "text": " Por eso es que en el servicio secreto usábamos este formato.",
        "start": 3109.38,
        "end": 3118.38
    },
    {
        "text": " O sea ven que hay muchos mensajes diferentes que podemos mandar.",
        "start": 3118.38,
        "end": 3125.38
    },
    {
        "text": " Ahora vamos a abordar un problema que parece diferente.",
        "start": 3125.38,
        "end": 3131.38
    },
    {
        "text": " Entonces el ejemplo es... ¿qué pasó? Tengo tres trabajos.",
        "start": 3139.38,
        "end": 3145.38
    },
    {
        "text": " Ah, sí.",
        "start": 3145.38,
        "end": 3149.38
    },
    {
        "text": " Ah, está. Yo no sabía cuál es el otro pero sí este es un trabajo, ciertamente.",
        "start": 3149.38,
        "end": 3156.38
    },
    {
        "text": " Bueno.",
        "start": 3156.38,
        "end": 3158.38
    },
    {
        "text": " Vamos a abordar este problema.",
        "start": 3161.38,
        "end": 3164.38
    },
    {
        "text": " Vamos a determinar...",
        "start": 3169.38,
        "end": 3172.38
    },
    {
        "text": " ¿Cuántas soluciones tiene la ecuación?",
        "start": 3178.38,
        "end": 3185.38
    },
    {
        "text": " Entonces la ecuación es... ¿cuántas soluciones perdón entera?",
        "start": 3188.38,
        "end": 3193.38
    },
    {
        "text": " O sea, estoy buscando soluciones que sean números enteros, ¿eh?",
        "start": 3194.38,
        "end": 3198.38
    },
    {
        "text": " Tiene la ecuación X1 más X2, más X3, más X4 igual a 7 con la restricción de que los XC tienen que ser positivos.",
        "start": 3198.38,
        "end": 3215.38
    },
    {
        "text": " No negativos, perdón, no negativos.",
        "start": 3215.38,
        "end": 3218.38
    },
    {
        "text": " Entonces hay entera, claro que son números enteros o sea, y no negativos, exacto.",
        "start": 3219.38,
        "end": 3230.38
    },
    {
        "text": " Voy a cambiar al azul porque estaba muy ajustado el negro y no le puedo cambiar el cartucho.",
        "start": 3230.38,
        "end": 3241.38
    },
    {
        "text": " Bien. Entonces una solución es, por ejemplo, tomar X1 igual 3, X2 igual 0, X3 igual 2 y X4 igual 2 es una solución.",
        "start": 3242.38,
        "end": 3261.38
    },
    {
        "text": " Sí.",
        "start": 3262.38,
        "end": 3264.38
    },
    {
        "text": " ¿Tan de acuerdo?",
        "start": 3270.38,
        "end": 3273.38
    },
    {
        "text": " Eso es lo que quiero decir cuando hablo de soluciones enteras de secación.",
        "start": 3276.38,
        "end": 3281.38
    },
    {
        "text": " Quiere decir darle un valor a la variable X1 o a la variable X2, a la variable X3 y a la variable X4, que sean enteros no negativos.",
        "start": 3281.38,
        "end": 3290.38
    },
    {
        "text": " Pero por ejemplo, si tomo X1 igual 0, X2 igual 3 y X3 igual 2 y X4 igual 2, esto es otra solución.",
        "start": 3291.38,
        "end": 3306.38
    },
    {
        "text": " Sí. O sea, si importa cuál es el valor de X1, cuál es el valor de X2, concretamente.",
        "start": 3307.38,
        "end": 3321.38
    },
    {
        "text": " No es solamente cuánto vale los números, sino qué variable vale cuánto.",
        "start": 3321.38,
        "end": 3327.38
    },
    {
        "text": " ¿En qué se parece esto lo anterior?",
        "start": 3328.38,
        "end": 3332.38
    },
    {
        "text": " Exactamente. Esto es lo mismo que repartir 7 unidades entre 4 lugares. O sea, tengo...",
        "start": 3336.38,
        "end": 3344.38
    },
    {
        "text": " Estas X1 más X2 más X3 más X4 tiene que sumar 7. Esto es lo mismo que decir, tengo 7 galletas y las voy a repartir entre 4 sobrinas de manera que las galletas que le tocan a Ana, que es X1 más la que le tocan a Verta, que es X2 más la que le tocan a Carla, más la que le tocan a Ndm 7.",
        "start": 3345.38,
        "end": 3370.38
    },
    {
        "text": " Entonces, esto es lo mismo que repartir 7 galletas entre 4 sobrinas.",
        "start": 3371.38,
        "end": 3376.38
    },
    {
        "text": " ¿Y la cantidad de maneras de serie suera?",
        "start": 3381.38,
        "end": 3384.38
    },
    {
        "text": " ¿Cómo eran combinaciones con repetición de...",
        "start": 3388.38,
        "end": 3393.38
    },
    {
        "text": " ¿Bien? ¿Sí?",
        "start": 3394.38,
        "end": 3399.38
    },
    {
        "text": " O sea, es como que...",
        "start": 3402.38,
        "end": 3403.38
    },
    {
        "text": " Yo agarro las 7 galletas y cada galleta el hijo si va a sumar en la variable X1 y 12 que esté eso que es 4.",
        "start": 3405.38,
        "end": 3413.38
    },
    {
        "text": " Muy bien.",
        "start": 3414.38,
        "end": 3415.38
    },
    {
        "text": " Entonces, este número es combinaciones de 4 más 7, menos 1 que 10,",
        "start": 3422.38,
        "end": 3437.38
    },
    {
        "text": " en 7 o sea, 10 factorial sobre 7 factorial sobre 3 factorial.",
        "start": 3438.38,
        "end": 3449.38
    },
    {
        "text": " Y ese número es 120. Muy bien.",
        "start": 3454.38,
        "end": 3456.38
    },
    {
        "text": " Entonces, ahora este...",
        "start": 3458.38,
        "end": 3460.38
    },
    {
        "text": " La observación llegado a este punto es que hay varios problemas que son equivalentes. ¿Sí?",
        "start": 3468.38,
        "end": 3475.38
    },
    {
        "text": " Hemos llegado a que son equivalentes los siguientes problemas.",
        "start": 3479.38,
        "end": 3484.38
    },
    {
        "text": " El primer problema es repartir 10 galletas entre 4 sobrinas.",
        "start": 3497.38,
        "end": 3514.38
    },
    {
        "text": " El segundo problema es elegir 10 discochos entre 4 variedades.",
        "start": 3514.38,
        "end": 3529.38
    },
    {
        "text": " Y la tercera es hallar o contar más bien soluciones enteras.",
        "start": 3544.38,
        "end": 3566.38
    },
    {
        "text": " Bueno, no, hallar porque repartirlo mismo que hallar.",
        "start": 3567.38,
        "end": 3573.38
    },
    {
        "text": " X1 más X2 más X3 más X4",
        "start": 3574.38,
        "end": 3580.38
    },
    {
        "text": " igual 10 donde los X7 tienen que ser non negativo.",
        "start": 3584.38,
        "end": 3591.38
    },
    {
        "text": " Non negativos.",
        "start": 3591.38,
        "end": 3592.38
    },
    {
        "text": " O sea, ahí lo mismo repartir 10 galletas entre 4 sobrinas que elegir 10 discochos entre 4 variedades.",
        "start": 3593.38,
        "end": 3602.38
    },
    {
        "text": " Claro, en el problema eran elegíamos 1, 2, 3 variedades, pero esto es un problema teórico que no se planta en la práctica.",
        "start": 3602.38,
        "end": 3612.38
    },
    {
        "text": " Lo que de verdad hacemos es lo de la 2ena.",
        "start": 3612.38,
        "end": 3616.38
    },
    {
        "text": " Muy bien, este sí.",
        "start": 3617.38,
        "end": 3624.38
    },
    {
        "text": " Y la cantidad de maneras de hacer cada una de estas cosas es la cantidad de maneras de hacer cada una de estas cosas.",
        "start": 3624.38,
        "end": 3636.38
    },
    {
        "text": " Es combinaciones con repetición de 4 tomas de 10.",
        "start": 3646.38,
        "end": 3653.38
    },
    {
        "text": " Muy bien.",
        "start": 3653.38,
        "end": 3658.38
    },
    {
        "text": " Vamos a ver si podemos resolver algún problema un poco más divertida.",
        "start": 3658.38,
        "end": 3667.38
    },
    {
        "text": " Bien.",
        "start": 3677.38,
        "end": 3682.38
    },
    {
        "text": " Ahora, en vez de resolver una ecuación quiero resolver una inequación.",
        "start": 3682.38,
        "end": 3698.38
    },
    {
        "text": " O sea, ahora la pregunta es cuántas soluciones enteras.",
        "start": 3699.38,
        "end": 3705.38
    },
    {
        "text": " Tiene X1 más X2 más X3 más X4 más X5 más X6 menor que 10 con la restricción.",
        "start": 3705.38,
        "end": 3715.38
    },
    {
        "text": " De que las variables y quisi todas las valores no negativos.",
        "start": 3736.38,
        "end": 3742.38
    },
    {
        "text": " Ahí va, eso es una manera.",
        "start": 3753.38,
        "end": 3757.38
    },
    {
        "text": " Entonces, si ese número es menor que 10 y 0, 1, 2, hasta 9.",
        "start": 3758.38,
        "end": 3769.38
    },
    {
        "text": " Entonces, una manera es resolver.",
        "start": 3770.38,
        "end": 3776.38
    },
    {
        "text": " Vamos a contar la cantidad de soluciones de esto.",
        "start": 3776.38,
        "end": 3785.38
    },
    {
        "text": " X1 más X2 más X3 hasta X6 igual 9.",
        "start": 3786.38,
        "end": 3792.38
    },
    {
        "text": " Entonces, si calculamos cuántas soluciones hay con esa igual a 9, igual a 8, igual a 7, igual a 6 etc.",
        "start": 3800.38,
        "end": 3807.38
    },
    {
        "text": " No sumamos todo eso, eso nos va a dar la cantidad total de soluciones de este inequación.",
        "start": 3808.38,
        "end": 3814.38
    },
    {
        "text": " Entonces, cuántas soluciones tiene este ecuación?",
        "start": 3818.38,
        "end": 3825.38
    },
    {
        "text": " Convenaciones, con repetición de 6, tomadas del 9.",
        "start": 3826.38,
        "end": 3837.38
    },
    {
        "text": " Como que el número 9 lo tengo que repartir entre estas variables.",
        "start": 3839.38,
        "end": 3844.38
    },
    {
        "text": " Soluciones de lo mismo, igual a 8.",
        "start": 3845.38,
        "end": 3851.38
    },
    {
        "text": " Combinaciones, con repetición de 6, tomadas de 8.",
        "start": 3861.38,
        "end": 3867.38
    },
    {
        "text": " Y así sucesivamente.",
        "start": 3868.38,
        "end": 3873.38
    },
    {
        "text": " Entonces, la cantidad total de soluciones de la inequación.",
        "start": 3873.38,
        "end": 3879.38
    },
    {
        "text": " Entonces, la inequación era la suma de estos.",
        "start": 3897.38,
        "end": 3904.38
    },
    {
        "text": " Es menor que 10, con cada uno de ellos, mayor igual que 0, es combinaciones con repetición de 6.",
        "start": 3904.38,
        "end": 3909.38
    },
    {
        "text": " Entonces, la inequación era la suma de estos.",
        "start": 3909.38,
        "end": 3914.38
    },
    {
        "text": " Es menor que 10, con cada uno de ellos, mayor igual que 0.",
        "start": 3914.38,
        "end": 3920.38
    },
    {
        "text": " Es combinaciones con repetición de 6.",
        "start": 3921.38,
        "end": 3927.38
    },
    {
        "text": " Tomadas de 9, más combinaciones con repetición de 6, tomadas de 8.",
        "start": 3927.38,
        "end": 3934.38
    },
    {
        "text": " Más combinaciones con repetición de 6, tomadas de 7.",
        "start": 3935.38,
        "end": 3941.38
    },
    {
        "text": " Más combinaciones con repetición de 6, tomadas de 6.",
        "start": 3943.38,
        "end": 3948.38
    },
    {
        "text": " De 5.",
        "start": 3948.38,
        "end": 3951.38
    },
    {
        "text": " De 4.",
        "start": 3951.38,
        "end": 3955.38
    },
    {
        "text": " De 3.",
        "start": 3955.38,
        "end": 3958.38
    },
    {
        "text": " De 1.",
        "start": 3959.38,
        "end": 3964.38
    },
    {
        "text": " Esto quiere decir que esté resolviendo x1 más x2 más x2 igual 1.",
        "start": 3964.38,
        "end": 3970.38
    },
    {
        "text": " Y después, más 1.",
        "start": 3970.38,
        "end": 3975.38
    },
    {
        "text": " Es la solución en la que todos los xí valenceros y la sumada 0.",
        "start": 3975.38,
        "end": 3982.38
    },
    {
        "text": " Ahí está este 1.",
        "start": 3983.38,
        "end": 3987.38
    },
    {
        "text": " Porque hablar de combinaciones con repetición de 6, tomadas de 0, es una cosa medio extraña.",
        "start": 3987.38,
        "end": 3994.38
    },
    {
        "text": " Muy bien, ese hermoso número es la solución del problema.",
        "start": 4000.38,
        "end": 4005.38
    },
    {
        "text": " Capas que hay otra manera de pensarlo.",
        "start": 4005.38,
        "end": 4010.38
    },
    {
        "text": " ¿Esto es la sumatoria de R igual 1?",
        "start": 4013.38,
        "end": 4017.38
    },
    {
        "text": " Están 9 de combinaciones con repetición de 6.",
        "start": 4017.38,
        "end": 4022.38
    },
    {
        "text": " Esto es la sumatoria de R igual 1.",
        "start": 4022.38,
        "end": 4026.38
    },
    {
        "text": " Esta es la sumatoria de R igual 1.",
        "start": 4026.38,
        "end": 4029.38
    },
    {
        "text": " Esta es la sumatoria de R igual 1.",
        "start": 4029.38,
        "end": 4034.38
    },
    {
        "text": " Esto es la sumatoria de R igual 1.",
        "start": 4034.38,
        "end": 4039.38
    },
    {
        "text": " Esta es 9 de combinaciones con repetición de 6, tomadas de R, más 1.",
        "start": 4039.38,
        "end": 4049.38
    },
    {
        "text": " O sea, de combinaciones de 6, más R, menos 1, tomadas de R.",
        "start": 4049.38,
        "end": 4060.38
    },
    {
        "text": " De 6, más R, menos 1, factorial, sobre R, factorial, 6, menos 1, que sí sé cuanto vale.",
        "start": 4064.38,
        "end": 4086.38
    },
    {
        "text": " Muy bien.",
        "start": 4086.38,
        "end": 4091.38
    },
    {
        "text": " Entonces, eso es otra manera de escribir el mismo resultado.",
        "start": 4091.38,
        "end": 4095.38
    },
    {
        "text": " Capas que hay otra manera de abordar este problema.",
        "start": 4095.38,
        "end": 4100.38
    },
    {
        "text": " Vamos a ver.",
        "start": 4106.38,
        "end": 4109.38
    },
    {
        "text": " Si yo quiero, si yo quiero que esta suma sea menor que 10,",
        "start": 4109.38,
        "end": 4124.38
    },
    {
        "text": " quiere decir que la suma de todos estos números,",
        "start": 4139.38,
        "end": 4162.38
    },
    {
        "text": " más algo,",
        "start": 4162.38,
        "end": 4169.38
    },
    {
        "text": " y sigo a la 10.",
        "start": 4169.38,
        "end": 4176.38
    },
    {
        "text": " O sea, si yo quiero que la suma de los números azules sea menor que 10,",
        "start": 4176.38,
        "end": 4182.38
    },
    {
        "text": " eso quiere decir que a los números azules les falta algo positivo para llegar a 10.",
        "start": 4182.38,
        "end": 4188.38
    },
    {
        "text": " Entonces, acá lo que yo tengo es que los X,",
        "start": 4188.38,
        "end": 4198.38
    },
    {
        "text": " estamos pidiendo que sean no negativos para ahí entre 1 y 6 y el X7, como tiene que ser X7.",
        "start": 4198.38,
        "end": 4210.38
    },
    {
        "text": " Y el X7 tiene que ser mayor que 0, para que la parte azul se estrictamente en menor de 10.",
        "start": 4210.38,
        "end": 4221.38
    },
    {
        "text": " Entonces, acá, de cuántas maneras se puede resolver este problema,",
        "start": 4221.38,
        "end": 4236.38
    },
    {
        "text": " es lo mismo que repartir 10 galletas entre 7 sobrinas,",
        "start": 4236.38,
        "end": 4251.38
    },
    {
        "text": " pero a esta sobrina le toca al menos 1 galleta.",
        "start": 4251.38,
        "end": 4256.38
    },
    {
        "text": " Ahí va, y habíamos dicho que si vamos a repartir 10 galletas entre 7 sobrinas,",
        "start": 4256.38,
        "end": 4268.38
    },
    {
        "text": " pero a la última le tiene que tocar al menos 1 le damos su galleta y repartimos las otras 9.",
        "start": 4268.38,
        "end": 4278.38
    },
    {
        "text": " Entonces, esto es lo mismo.",
        "start": 4279.38,
        "end": 4281.38
    },
    {
        "text": " ¿Qué?",
        "start": 4281.38,
        "end": 4296.38
    },
    {
        "text": " X6 más una nueva variable y griega igual a 9. Esta y griega va a ser X7 menos 1.",
        "start": 4297.38,
        "end": 4317.38
    },
    {
        "text": " O sea, equivalentemente de esta igualdad restamos 1 de ambos lados, X7 menos 1, le ponemos un nuevo nombre y ahora las X son todas mayores iguales que 0 y griega es mayor igual que 0.",
        "start": 4318.38,
        "end": 4341.38
    },
    {
        "text": " A ver si estamos todos convencidos de lo siguiente.",
        "start": 4341.38,
        "end": 4346.38
    },
    {
        "text": " Primero, estamos todos convencidos de que entendemos qué es lo que pide este problema.",
        "start": 4346.38,
        "end": 4353.38
    },
    {
        "text": " La cantidad de soluciones enteras de esto donde las variables tienen que tomar valores non-negativos.",
        "start": 4355.38,
        "end": 4364.38
    },
    {
        "text": " Estamos convencidos de que la cantidad de soluciones a este problema es lo mismo que la cantidad de soluciones a este problema.",
        "start": 4365.38,
        "end": 4376.38
    },
    {
        "text": " Este problema es el mismo que éste solamente que a la diferencia entre toda esta suma y 10 le pusimos un nombre y ese nombre es X7.",
        "start": 4379.38,
        "end": 4389.38
    },
    {
        "text": " Entonces, lo que tenemos que contar es la cantidad de soluciones a este problema que ahora ya no es una desigualdad sino que es una ecuación.",
        "start": 4390.38,
        "end": 4401.38
    },
    {
        "text": " Ahora, como acá teníamos la restricción fea de que X7 fuera positivo, lo que hicimos fue restar uno de los dos lados, entonces me queda.",
        "start": 4404.38,
        "end": 4415.38
    },
    {
        "text": " La suma azul más X7 menos 1 es igual a 9 y a X7 menos 1 le pusimos un nuevo nombre que sigrega.",
        "start": 4416.38,
        "end": 4427.38
    },
    {
        "text": " Estamos de acuerdo que la cantidad de soluciones a este problema es la misma que la cantidad de soluciones a este.",
        "start": 4432.38,
        "end": 4437.38
    },
    {
        "text": " Muy bien. Entonces, ahora tenemos que hacer la cantidad de soluciones enteras a este cuasión donde todas las variables toman valores no negativos y cuantas soluciones tiene ese cuasión.",
        "start": 4446.38,
        "end": 4462.38
    },
    {
        "text": " La cantidad de soluciones es… ¿Cuál es la cantidad de soluciones de este problema?",
        "start": 4462.38,
        "end": 4488.38
    },
    {
        "text": " Esperemos que sea la misma, no me asustes. La cantidad de soluciones no puede depender de quién dijo que es distinta.",
        "start": 4493.38,
        "end": 4500.38
    },
    {
        "text": " Claro, pero ¿vos visis que la cantidad de soluciones de este es distinto que la de este?",
        "start": 4506.38,
        "end": 4510.38
    },
    {
        "text": " De acá digamos, no estas como…",
        "start": 4510.38,
        "end": 4513.38
    },
    {
        "text": " El paso sí, pero ahora tienes una… no te cambié, no te he dado tener más X y la cograta es una X más.",
        "start": 4514.38,
        "end": 4519.38
    },
    {
        "text": " Tenés una X de más, pero lo que pasa es que antes querías que la suma de las azules fuera menor que 9, entonces esta que está de más, en realidad no es completamente nueva.",
        "start": 4519.38,
        "end": 4530.38
    },
    {
        "text": " Digo, perdón, querías que las zulele, eso suele fuera menor que 10.",
        "start": 4530.38,
        "end": 4533.38
    },
    {
        "text": " Entonces, esta… digamos, acá está roja, que es donde introdujimos su nueva, no es completamente nueva, porque simplemente la diferencia de 10 menos lo otro.",
        "start": 4534.38,
        "end": 4543.38
    },
    {
        "text": " O sea, cuando contamos ahí caso por caso, cuando lo hicimos acá decíamos, bueno, vamos a contar cuantas soluciones tiene esto igual a 9.",
        "start": 4543.38,
        "end": 4555.38
    },
    {
        "text": " Eso es decir, lo mismo que vamos a contar la cantidad de soluciones con X7 igual a 1.",
        "start": 4556.38,
        "end": 4564.38
    },
    {
        "text": " Después cuando decíamos, vamos a contar la cantidad de soluciones con esto de acá igual a 8.",
        "start": 4564.38,
        "end": 4572.38
    },
    {
        "text": " Eso es lo mismo que decir la cantidad de soluciones en que X7 es 2.",
        "start": 4572.38,
        "end": 4576.38
    },
    {
        "text": " Después contamos la cantidad de soluciones en que X7 es 3, etc.",
        "start": 4576.38,
        "end": 4580.38
    },
    {
        "text": " Y sumamos todo eso. Entonces acá, si bien introdujimos una nueva variable, esta nueva variable, y si es famoso, diamos todos los valores que puede tomar, corresponde a todos los casos que consideramos en el análisis de a su momento.",
        "start": 4581.38,
        "end": 4603.38
    },
    {
        "text": " O sea, lo que estamos contando, como estamos contando la cantidad de soluciones del problema, es verdad que los convertimos en un problema con más variables.",
        "start": 4604.38,
        "end": 4615.38
    },
    {
        "text": " Por eso, lo que tenemos que… de lo que hay que convencerse es que este problema con más variables en realidad tiene la misma cantidad de soluciones.",
        "start": 4617.38,
        "end": 4624.38
    },
    {
        "text": " Vamos a verlo acá. Si yo para el problema original, digamos acá tengo el problema, la suma de estas cosas, es menor que 10.",
        "start": 4625.38,
        "end": 4639.38
    },
    {
        "text": " Y acá tengo el problema, la suma de todo esto es igual a 9.",
        "start": 4639.38,
        "end": 4651.38
    },
    {
        "text": " Para convencernos de que estos dos problemas tienen la misma cantidad de soluciones, lo que tenemos que hacer es ver como una solución de este, me da una solución de este y viceversa.",
        "start": 4652.38,
        "end": 4663.38
    },
    {
        "text": " Entonces, digamos que yo tengo una solución de este, que por ejemplo, x1, x2, x3, x5 esto es 1, x4 es 0, y x5 es 2.",
        "start": 4663.38,
        "end": 4692.38
    },
    {
        "text": " X6, perdón, x6 es 2.",
        "start": 4694.38,
        "end": 4696.38
    },
    {
        "text": " Entonces, acá tengo que x1 más x2, hasta x6, vale 6, que es menor que 10.",
        "start": 4699.38,
        "end": 4708.38
    },
    {
        "text": " Entonces, esta es una solución posible de este problema.",
        "start": 4709.38,
        "end": 4713.38
    },
    {
        "text": " ¿Cómo a partir de esta solución construiríamos una solución acá?",
        "start": 4714.38,
        "end": 4718.38
    },
    {
        "text": " X1, x2, etcétera, va a ser lo mismo.",
        "start": 4722.38,
        "end": 4725.38
    },
    {
        "text": " X4 va a ser 0, x6 va a ser 2.",
        "start": 4731.38,
        "end": 4736.38
    },
    {
        "text": " Y tiene que ser 3.",
        "start": 4737.38,
        "end": 4740.38
    },
    {
        "text": " Exactamente.",
        "start": 4741.38,
        "end": 4743.38
    },
    {
        "text": " Entonces, quién va a ser y va a ser la diferencia entre todo esto y 9, entre todo lo que está acá y 9.",
        "start": 4744.38,
        "end": 4753.38
    },
    {
        "text": " Entonces, obviamente lo que hicimos en verde fue un ejemplo, es un caso particular.",
        "start": 4754.38,
        "end": 4761.38
    },
    {
        "text": " Esto no constituye una demostración de que toda solución de estas me da una solución de estas.",
        "start": 4761.38,
        "end": 4769.38
    },
    {
        "text": " Pero ustedes se imaginan que en el caso generales, digamos, acá la solución, si acá tengo una solución, cualquiera,",
        "start": 4770.38,
        "end": 4781.38
    },
    {
        "text": " acá la solución en que los x6 son iguales y la y es 9 menos.",
        "start": 4782.38,
        "end": 4788.38
    },
    {
        "text": " La suma de todos los otros, esto me da una solución debajo.",
        "start": 4789.38,
        "end": 4797.38
    },
    {
        "text": " De el mismo modo, si yo tengo una solución de este problema, si toda esta suma vale 9,",
        "start": 4798.38,
        "end": 4806.38
    },
    {
        "text": " estos mismos x1 y x6 me dan una solución de una solución de la arriba.",
        "start": 4808.38,
        "end": 4813.38
    },
    {
        "text": " Porque si toda esta suma vale 9, sólo la parte de acá es menor igual que 9, o sea es menor que 10.",
        "start": 4814.38,
        "end": 4820.38
    },
    {
        "text": " Entonces, cualquier solución de este problema me da una solución de este, cualquier solución de este me da una solución de este.",
        "start": 4823.38,
        "end": 4829.38
    },
    {
        "text": " Entonces, si bien los problemas son diferentes a los efectos de contar las soluciones, podemos pasar de una o otro.",
        "start": 4830.38,
        "end": 4836.38
    },
    {
        "text": " Y bueno, entonces, ¿cuál es la cantidad de soluciones a este problema?",
        "start": 4837.38,
        "end": 4842.38
    },
    {
        "text": " Esto es combinaciones con repetición de, entonces acá tengo 9 galletas para repartir entre 7 sobrinas.",
        "start": 4844.38,
        "end": 4858.38
    },
    {
        "text": " Como que este número 9, lo voy a repartir en 7 sumandos.",
        "start": 4859.38,
        "end": 4866.38
    },
    {
        "text": " Entonces, esto va a ser combinaciones con repetición de 7 tomadas de 9.",
        "start": 4867.38,
        "end": 4872.38
    },
    {
        "text": " Y la gracia de esto es que este número tiene que ser lo mismo que la otra suma larga que vemos escrito.",
        "start": 4873.38,
        "end": 4889.38
    },
    {
        "text": " Bueno, con esto estaríamos terminando con conteo.",
        "start": 4892.38,
        "end": 4895.38
    }
]