[
    {
        "text": " Igual para que primero con Casona le dices...",
        "start": 0.0,
        "end": 6.0
    },
    {
        "text": " Bueno, ¿qué tal?",
        "start": 6.0,
        "end": 9.0
    },
    {
        "text": " Bueno, ¿qué tal?",
        "start": 9.0,
        "end": 12.0
    },
    {
        "text": " Bueno...",
        "start": 12.0,
        "end": 15.0
    },
    {
        "text": " Gente, me mandó el responsable del curso se on en cuesta.",
        "start": 15.0,
        "end": 21.0
    },
    {
        "text": " Con fines estadísticos, antropológicos, sociológicos y no sé qué final.",
        "start": 21.0,
        "end": 27.0
    },
    {
        "text": " Pero bueno...",
        "start": 28.0,
        "end": 30.0
    },
    {
        "text": " No sé por qué, pero yo soy buen soldado y me mandaba la suave cuesta.",
        "start": 30.0,
        "end": 35.0
    },
    {
        "text": " ¿Cuántos quieren aprobado el exigente calculo 1?",
        "start": 35.0,
        "end": 39.0
    },
    {
        "text": " Levante la mano a los que tengan aprobado el exigente calculo 1.",
        "start": 39.0,
        "end": 43.0
    },
    {
        "text": " Ahí solo un montón, ¿vale? ¿Te encuentras todo esto?",
        "start": 43.0,
        "end": 46.0
    },
    {
        "text": " Levante la mano, sí.",
        "start": 46.0,
        "end": 49.0
    },
    {
        "text": " 1...",
        "start": 49.0,
        "end": 52.0
    },
    {
        "text": " Y ha probado el curso, pero lo lo ensame.",
        "start": 58.0,
        "end": 60.0
    },
    {
        "text": " ¿Va?",
        "start": 60.0,
        "end": 63.0
    },
    {
        "text": " ¿Va?",
        "start": 63.0,
        "end": 66.0
    },
    {
        "text": " ¿Va?",
        "start": 66.0,
        "end": 69.0
    },
    {
        "text": " ¿Va?",
        "start": 69.0,
        "end": 71.0
    },
    {
        "text": " ¿Va?",
        "start": 71.0,
        "end": 74.0
    },
    {
        "text": " ¿Va?",
        "start": 74.0,
        "end": 78.0
    },
    {
        "text": " ¿Va?",
        "start": 78.0,
        "end": 81.0
    },
    {
        "text": " ¿Va?",
        "start": 81.0,
        "end": 84.0
    },
    {
        "text": " ¿Va?",
        "start": 85.0,
        "end": 87.0
    },
    {
        "text": " No, porque en la clase era 2, el curso y 2 se le examen.",
        "start": 90.0,
        "end": 95.0
    },
    {
        "text": " ¿Qué es el curso?",
        "start": 95.0,
        "end": 98.0
    },
    {
        "text": " ¿Qué es?",
        "start": 98.0,
        "end": 101.0
    },
    {
        "text": " No, no, no, no, son 5, ¿vale?",
        "start": 101.0,
        "end": 106.0
    },
    {
        "text": " No, son 5, ¿vale?",
        "start": 106.0,
        "end": 109.0
    },
    {
        "text": " Este...",
        "start": 110.0,
        "end": 113.0
    },
    {
        "text": " Muy bien.",
        "start": 121.0,
        "end": 124.0
    },
    {
        "text": " ¿Estos prendidos? No sé si se oye.",
        "start": 128.0,
        "end": 132.0
    },
    {
        "text": " ¿Estamos estudiando funciones generatrices?",
        "start": 133.0,
        "end": 137.0
    },
    {
        "text": " ¿Sí?",
        "start": 137.0,
        "end": 140.0
    },
    {
        "text": " Entonces, si tenemos una sucesión a su vene, o sea, a su cero, a su bundo, a su budo, etcétera,",
        "start": 140.0,
        "end": 157.0
    },
    {
        "text": " la asociábamos una función fdx, que era la suma desde n igual cero infinito,",
        "start": 158.0,
        "end": 166.0
    },
    {
        "text": " de a su vene x a la n, ¿sí?",
        "start": 166.0,
        "end": 170.0
    },
    {
        "text": " ¿Sí?",
        "start": 170.0,
        "end": 171.0
    },
    {
        "text": " Y si para esta serie teníamos alguna expresión más sencillo, lo usábamos, ¿sí?",
        "start": 171.0,
        "end": 176.0
    },
    {
        "text": " Por ejemplo, cuando todos los a su vene era 1, esta serie es 1 sobre 1 menos x",
        "start": 176.0,
        "end": 185.0
    },
    {
        "text": " para los valores de x entre menos 1 y 1.",
        "start": 186.0,
        "end": 192.0
    },
    {
        "text": " Entonces, teníamos este... un montón de ejemplos, habíamos hecho una lista de sucesiones y su funciones generatrices,",
        "start": 192.0,
        "end": 203.0
    },
    {
        "text": " por ejemplo, a la sucesión 1, 1, 1, etcétera correspondía 1 sobre 1 menos x, ¿sí?",
        "start": 203.0,
        "end": 213.0
    },
    {
        "text": " A la sucesión 1, 2, 3, etcétera correspondía la función 1 sobre 1 menos x al cuadrado.",
        "start": 216.0,
        "end": 227.0
    },
    {
        "text": " A la sucesión de los cuadrados, 1 al cuadrado, 2 al cuadrado, 3 al cuadrado, etcétera,",
        "start": 235.0,
        "end": 244.0
    },
    {
        "text": " correspondía 1 más x sobre 1 menos x al cubo, y teníamos otro ejemplo que era",
        "start": 244.0,
        "end": 258.0
    },
    {
        "text": " a combinaciones de menos n e tomadas de 0, combinaciones de menos n e tomadas de 1,",
        "start": 258.0,
        "end": 265.0
    },
    {
        "text": " combinaciones de menos n e tomadas de 2, etcétera correspondía 1 más x a la menos n.",
        "start": 265.0,
        "end": 273.0
    },
    {
        "text": " Estos son algunos ejemplos de funciones generatrices que teníamos de clases anteriores.",
        "start": 274.0,
        "end": 282.0
    },
    {
        "text": " Y estábamos viendo cómo estas funciones servían para resolver problemas de contigo.",
        "start": 282.0,
        "end": 290.0
    },
    {
        "text": " Entonces teníamos un ejemplo con el que habíamos estado trabajando.",
        "start": 290.0,
        "end": 294.0
    },
    {
        "text": " ¿Qué es el siguiente?",
        "start": 294.0,
        "end": 297.0
    },
    {
        "text": " Tenemos el conjunto S de los números de 1 al 15, y la pregunta es ¿cuántos sus conjuntos",
        "start": 297.0,
        "end": 316.0
    },
    {
        "text": " de S? ¿De cuatro elementos?",
        "start": 316.0,
        "end": 336.0
    },
    {
        "text": " Tenían dos números consecutivos.",
        "start": 336.0,
        "end": 350.0
    },
    {
        "text": " Entonces la vez pasada, habíamos resuelto este problema y habíamos llegado la conclusión de que la respuesta era 120.",
        "start": 350.0,
        "end": 358.0
    },
    {
        "text": " ¿Pues sea?",
        "start": 358.0,
        "end": 360.0
    },
    {
        "text": " Ahora vamos a hacer otra solución del mismo problema también usando funciones generatrices.",
        "start": 361.0,
        "end": 369.0
    },
    {
        "text": " Entonces para que vean cómo el objetivo este ejemplo, ver como un problema dado de combinatoria,",
        "start": 369.0,
        "end": 378.0
    },
    {
        "text": " se puede resolver usando funciones generatrices muchas veces de más de una manera.",
        "start": 378.0,
        "end": 383.0
    },
    {
        "text": " Sí, no hay una única manera de resolver estos ejercicios.",
        "start": 383.0,
        "end": 389.0
    },
    {
        "text": " Entonces tomemos por ejemplo un conjunto de este de cuatro elementos sin elementos consecutivos.",
        "start": 389.0,
        "end": 396.0
    },
    {
        "text": " Por ejemplo, dos cinco ocho y ocho y los seis.",
        "start": 396.0,
        "end": 406.0
    },
    {
        "text": " Entonces estos números están entre uno y quince, o sea el primero es mayor que cero,",
        "start": 406.0,
        "end": 420.0
    },
    {
        "text": " menor que el segundo, que a su vez es menor que el tercero, que a su vez es menor que el cuarto, que a su vez es menor que 16.",
        "start": 420.0,
        "end": 429.0
    },
    {
        "text": " Ahora, ahí están los números de uno y quince.",
        "start": 429.0,
        "end": 452.0
    },
    {
        "text": " De hecho va a poner los números del cero al 16.",
        "start": 453.0,
        "end": 459.0
    },
    {
        "text": " Entonces ahora lo que quiero que miremos son las rayitas, no los intervalos, la otra, la que les he pasado habíamos hecho un argumento que se basaba en que si yo tomo,",
        "start": 459.0,
        "end": 476.0
    },
    {
        "text": " los números de uno de estos conjuntos los voy a marcar acá, el dos, el cinco, el ocho y el dos.",
        "start": 477.0,
        "end": 488.0
    },
    {
        "text": " Alguien se mal, uno, dos, tres.",
        "start": 494.0,
        "end": 503.0
    },
    {
        "text": " El ocho va a haber que ser.",
        "start": 507.0,
        "end": 512.0
    },
    {
        "text": " 4, 5, 6, 7, 8, 12, 13, 14, 15 y 6.",
        "start": 512.0,
        "end": 518.0
    },
    {
        "text": " Había puesto una ralla de más, aquí están los números del cero al 16.",
        "start": 518.0,
        "end": 524.0
    },
    {
        "text": " La vez pasada habíamos hecho un argumento sobre las sumas de estas logitudes,",
        "start": 524.0,
        "end": 531.0
    },
    {
        "text": " de las logitudes que había entre el primer número y el segundo, entre el segundo y el tercero y el cuarto y la logitud que había entre uno y este número y entre este quince.",
        "start": 532.0,
        "end": 543.0
    },
    {
        "text": " Ahora no quiero que miremos las logitudes, sino que miremos las rayitas.",
        "start": 543.0,
        "end": 547.0
    },
    {
        "text": " Aquí están marcados los números dos, cinco, ocho, dos, y el tercero y el 16, que no están en el conjunto S.",
        "start": 548.0,
        "end": 562.0
    },
    {
        "text": " Y la pregunta es cuántos números hay que no estén marcados. O sea, cuántos números hay que no sean rojos.",
        "start": 563.0,
        "end": 576.0
    },
    {
        "text": " Y la respuesta es números rojos, hay los cuatro del conjunto S y los dos extremos, o sea, hay seis números rojos.",
        "start": 577.0,
        "end": 594.0
    },
    {
        "text": " Y entre el cero y el 16 hay 17 números, entonces los números con los rojos son 17 menos 6 o sea 11.",
        "start": 595.0,
        "end": 606.0
    },
    {
        "text": " O sea, hay 11 números sin marcar, o sea, marcando los números de S y los extremos ser 16 hay 11 números sin marcar.",
        "start": 606.0,
        "end": 618.0
    },
    {
        "text": " Y eso, por supuesto, entonces los números rojos son los que aparecen en estas desigualdades.",
        "start": 624.0,
        "end": 631.0
    },
    {
        "text": " Y eso, por supuesto, no depende de cuál sea el conjunto de cuatro elementos de S que elegimos.",
        "start": 631.0,
        "end": 638.0
    },
    {
        "text": " Porque acá hay cuatro elementos de S, como los números de S están entre uno y quince.",
        "start": 638.0,
        "end": 645.0
    },
    {
        "text": " Estos números están entre uno y quince, le agregamos el 16 y eso son seis números siempre.",
        "start": 645.0,
        "end": 652.0
    },
    {
        "text": " Y en este dibujo marcamos esos seis números en rojo y siempre va a haber 11 que queden negro.",
        "start": 653.0,
        "end": 659.0
    },
    {
        "text": " Entonces, la distribución de los 11 puntos rojos determina, perdón, la distribución de los puntos rojos separa los negros empaquetes.",
        "start": 659.0,
        "end": 676.0
    },
    {
        "text": " Entonces, lo que sucede con los puntos rojos es que acá queda un paquetito de números negros, acá queda otro paquetito de números negros, otro y otro.",
        "start": 677.0,
        "end": 692.0
    },
    {
        "text": " Y como estas desigualdades son todas estrictas, esos seis números rojos separan los 17 puntos en los 11 puntos negros en cinco paquetes.",
        "start": 693.0,
        "end": 708.0
    },
    {
        "text": " Y a la vez, si yo les digo que el primer paquetito tiene un punto, ya saben que si el cero es el primer número rojo quiere decir que el 2 es de vuelta rojo, etc.",
        "start": 709.0,
        "end": 721.0
    },
    {
        "text": " Entonces, decir, de qué tamaño son los paquetes de puntos negros, esos que en ese renuncírculo, es lo mismo que decía donde están ubicados los puntos rojos, o sea es lo mismo que decir que elementos de ese estamos considerando.",
        "start": 722.0,
        "end": 741.0
    },
    {
        "text": " Se ve eso.",
        "start": 742.0,
        "end": 746.0
    },
    {
        "text": " Entonces, el problema de cuántos subconjuntos de ese 4 elementos hay que no contienen dos números consecutivos, se puede escribir así.",
        "start": 748.0,
        "end": 758.0
    },
    {
        "text": " De cuántas maneras se pueden repartir 11 puntos negros en cinco paquetes, ¿sí? con algunas restricciones.",
        "start": 759.0,
        "end": 773.0
    },
    {
        "text": " Entonces, hay una restricción que este punto y este punto no tiene que ser consecutivo, o sea, este paquetito tiene que tener al menos dos elementos.",
        "start": 773.0,
        "end": 785.0
    },
    {
        "text": " ¿Se ve? Al menos dos.",
        "start": 786.0,
        "end": 788.0
    },
    {
        "text": " Al menos dos, claro, porque al menos uno es verdad perdón, ¿qué este tiene que tener al menos uno?",
        "start": 788.0,
        "end": 793.0
    },
    {
        "text": " Este tiene que tener al menos uno y este tiene que tener al menos uno.",
        "start": 794.0,
        "end": 799.0
    },
    {
        "text": " Y en realidad acá no hay restricciones porque el último número de estos podría ser el 15.",
        "start": 799.0,
        "end": 806.0
    },
    {
        "text": " Y acá el primer número del conjunto de este 4 elementos podría ser el 1.",
        "start": 807.0,
        "end": 813.0
    },
    {
        "text": " Entonces, voy a tratar de reescribir este problema.",
        "start": 813.0,
        "end": 820.0
    },
    {
        "text": " Lo que queremos contar, las soluciones enteras de la siguiente cuasión.",
        "start": 820.0,
        "end": 832.0
    },
    {
        "text": " Entonces, la cantidad de numeritos que hay en el primer paquetes, más la cantidad de numeritos que hay en el segundo, más la que en el tercero, más la que en el cuarto, más los que en el quinto, pasér once.",
        "start": 837.0,
        "end": 854.0
    },
    {
        "text": " Todos los PI van a ser mayores iguales que 0 y P2, T3 y P4 van a tener que ser mayores iguales que 1.",
        "start": 855.0,
        "end": 867.0
    },
    {
        "text": " Entonces, estos P son la cantidad de puntos negros que hay en los paquetes esos.",
        "start": 873.0,
        "end": 882.0
    },
    {
        "text": " Esta es la condición que nos dice que los puntos que corresponden a los elementos de acá, o sea, los que están marcados con una pelotita roja, no son consecutivos.",
        "start": 882.0,
        "end": 902.0
    },
    {
        "text": " Capas que voy a marcar los puntos rojos más grandes, así se ven ahí, 2 con cruz, que son los extremos y están los marcados con una pelotita que son los elementos de su conjunto de 4 elementos de ese, que no tiene 2 consecutivos.",
        "start": 913.0,
        "end": 940.0
    },
    {
        "text": " Entonces, a ver si estamos de acuerdo con la firmación de que la cantidad de soluciones de este problema es la misma que la cantidad de sus conjuntos de 4 elementos que no tienen 2 números consecutivos.",
        "start": 941.0,
        "end": 964.0
    },
    {
        "text": " Eso es lo primero en los que tenemos que estar de acuerdo.",
        "start": 964.0,
        "end": 967.0
    },
    {
        "text": " Ahora, ahora, ya tenemos esto escrito.",
        "start": 970.0,
        "end": 996.0
    },
    {
        "text": " Como un problema de galletitas y sobringeamos.",
        "start": 997.0,
        "end": 1005.0
    },
    {
        "text": " Entonces, eso es el problema, ya lo sabemos transformar en problemas de funciones generatrices.",
        "start": 1005.0,
        "end": 1015.0
    },
    {
        "text": " Entonces, para P1, voy a mirar la función, que P1 puede ser 0, puede ser 1, puede ser 2, etcétera.",
        "start": 1016.0,
        "end": 1039.0
    },
    {
        "text": " P2, P3 y P4, digamos, esta función va a ser, le vamos a asociar esta función, a P1 y a P5, porque P1 y P5 son mayoros iguales que 0.",
        "start": 1039.0,
        "end": 1058.0
    },
    {
        "text": " Y P2, P3 y P4 pueden valer 1, pueden valer 2, pueden valer 3, etcétera.",
        "start": 1058.0,
        "end": 1067.0
    },
    {
        "text": " Entonces, consideramos la siguiente función generatriz. ¿Cuál es la función generatriz?",
        "start": 1073.0,
        "end": 1080.0
    },
    {
        "text": " La arriba?",
        "start": 1089.0,
        "end": 1098.0
    },
    {
        "text": " Sí, claro, pero yo les acción el pregunta más sencilla.",
        "start": 1098.0,
        "end": 1106.0
    },
    {
        "text": " Primero, vemos todas las posibilidades para P1, entonces escribimos esto.",
        "start": 1107.0,
        "end": 1113.0
    },
    {
        "text": " Simplemente.",
        "start": 1113.0,
        "end": 1116.0
    },
    {
        "text": " Después vemos todas las posibilidades para P2 y escribimos esto.",
        "start": 1116.0,
        "end": 1123.0
    },
    {
        "text": " Sí, acá tenemos en cuenta P1 y P2.",
        "start": 1124.0,
        "end": 1127.0
    },
    {
        "text": " Para P3, es esta misma y para P4 es esta misma, si que en definitiva esta la vamos a tener el cubo.",
        "start": 1128.0,
        "end": 1136.0
    },
    {
        "text": " Y después para P5 de vuelta tenemos que mirar esta función.",
        "start": 1136.0,
        "end": 1147.0
    },
    {
        "text": " Entonces, acá de vuelta, esta función que está acá, X más X cuadrado, más X cubo, etcétera,",
        "start": 1148.0,
        "end": 1157.0
    },
    {
        "text": " es X por 1 más X, más X cuadrado, etcétera.",
        "start": 1157.0,
        "end": 1166.0
    },
    {
        "text": " Entonces, esta función al cubo es X al cubo por esta cosa al cubo.",
        "start": 1167.0,
        "end": 1177.0
    },
    {
        "text": " Y bueno, esta cosa al cubo y acá hay otra, y acá hay otra.",
        "start": 1181.0,
        "end": 1184.0
    },
    {
        "text": " Entonces, esto va a ser X al cubo por esta cosa a la quinta.",
        "start": 1184.0,
        "end": 1192.0
    },
    {
        "text": " Y ahora sí, esta cosa que está acá, como me decían es, 1 sobre 1 menos X.",
        "start": 1193.0,
        "end": 1200.0
    },
    {
        "text": " Entonces, esto va a ser X a la quinta sobre 1 menos X al cubo.",
        "start": 1200.0,
        "end": 1207.0
    },
    {
        "text": " No, al revés, X al cubo sobre 1 menos X al quinta.",
        "start": 1207.0,
        "end": 1213.0
    },
    {
        "text": " Sí o más o menos, ¿qué pasó?",
        "start": 1223.0,
        "end": 1225.0
    },
    {
        "text": " Entonces, ¿qué es lo que queremos mirar esta función?",
        "start": 1233.0,
        "end": 1236.0
    },
    {
        "text": " Esto, esto.",
        "start": 1238.0,
        "end": 1241.0
    },
    {
        "text": " ¿Qué es esto?",
        "start": 1242.0,
        "end": 1243.0
    },
    {
        "text": " Díamos, antes de los exponentes, lo que dije es, esto X más X cuadrado, etcétera,",
        "start": 1244.0,
        "end": 1252.0
    },
    {
        "text": " es X por 1 más X más X cuadrado, ¿no?",
        "start": 1252.0,
        "end": 1257.0
    },
    {
        "text": " Y después, se le va al cubo, es se le va al cubo cada cosa.",
        "start": 1259.0,
        "end": 1262.0
    },
    {
        "text": " De cual lado?",
        "start": 1267.0,
        "end": 1268.0
    },
    {
        "text": " Y acá tampoco, porque esto elevado al cubo, o sea, mira,",
        "start": 1269.0,
        "end": 1274.0
    },
    {
        "text": " lo primero que yo hice fue observar esto.",
        "start": 1274.0,
        "end": 1277.0
    },
    {
        "text": " Que X más X cuadrado, etcétera, acá yo puedo sacar X de factor común",
        "start": 1280.0,
        "end": 1286.0
    },
    {
        "text": " y esto es X por esto. Hasta ahí estamos, ¿de acuerdo?",
        "start": 1286.0,
        "end": 1291.0
    },
    {
        "text": " Bueno, y después, cuando quiero elevar esto al cubo,",
        "start": 1292.0,
        "end": 1296.0
    },
    {
        "text": " como he lebo un producto al cubo, digamos, si yo tengo que A,",
        "start": 1296.0,
        "end": 1300.0
    },
    {
        "text": " es igual a B por C.",
        "start": 1300.0,
        "end": 1302.0
    },
    {
        "text": " A al cubo es B por C al cubo, que es B al cubo por C al cubo.",
        "start": 1302.0,
        "end": 1311.0
    },
    {
        "text": " Sí?",
        "start": 1313.0,
        "end": 1314.0
    },
    {
        "text": " Entonces, acá, como en realidad, yo no quería este,",
        "start": 1314.0,
        "end": 1318.0
    },
    {
        "text": " sino que quería este al cubo para elevarlo al cubo,",
        "start": 1318.0,
        "end": 1321.0
    },
    {
        "text": " elevó al cubo cada uno de los factores.",
        "start": 1321.0,
        "end": 1324.0
    },
    {
        "text": " Sí?",
        "start": 1324.0,
        "end": 1325.0
    },
    {
        "text": " Entonces, está bien, acá no hay términos en X, pero en realidad,",
        "start": 1325.0,
        "end": 1330.0
    },
    {
        "text": " acá tampoco, porque cuando eleve al cubo,",
        "start": 1330.0,
        "end": 1334.0
    },
    {
        "text": " esto el término más chico más que a NX3.",
        "start": 1334.0,
        "end": 1337.0
    },
    {
        "text": " Muy bien, más preguntas,",
        "start": 1342.0,
        "end": 1345.0
    },
    {
        "text": " más preguntas?",
        "start": 1346.0,
        "end": 1348.0
    },
    {
        "text": " Sí.",
        "start": 1348.0,
        "end": 1350.0
    },
    {
        "text": " Ah, ¿por qué?",
        "start": 1355.0,
        "end": 1357.0
    },
    {
        "text": " Porque la manera de traducir un problema de este tipo,",
        "start": 1357.0,
        "end": 1362.0
    },
    {
        "text": " a un problema de funciones generatrices es el siguiente.",
        "start": 1362.0,
        "end": 1366.0
    },
    {
        "text": " A ver, puedo borrar las consideraciones de cómo llegamos este problema.",
        "start": 1369.0,
        "end": 1374.0
    },
    {
        "text": " O sea, hay que les queda dudas de cómo de este problema pasamos a este.",
        "start": 1376.0,
        "end": 1380.0
    },
    {
        "text": " Bueno, entonces borro acá y respondo la pregunta de la compañera.",
        "start": 1384.0,
        "end": 1388.0
    },
    {
        "text": " Entonces, la pregunta que ya hace es la siguiente es, ¿por qué?",
        "start": 1394.0,
        "end": 1398.0
    },
    {
        "text": " Para P1 y P5 tomé esta función y para P2, P3 y P4 tomé esta función.",
        "start": 1398.0,
        "end": 1403.0
    },
    {
        "text": " Entonces, acá lo que tenemos es que P2, P3 y P4 pueden tomar en principio cualquier valor mayor igual que 1.",
        "start": 1404.0,
        "end": 1416.0
    },
    {
        "text": " Entonces, la regla nemo técnica que ahora voy a explicar por qué es la buena,",
        "start": 1418.0,
        "end": 1423.0
    },
    {
        "text": " o sea, por qué funciona, es si yo tengo, digamos, que P2 es mayor igual que 1,",
        "start": 1423.0,
        "end": 1430.0
    },
    {
        "text": " eso quiere decir que P2 puede tomar los valores 1, 2, 3, etc.",
        "start": 1431.0,
        "end": 1437.0
    },
    {
        "text": " Entonces, cuando puede tomar esos valores, le asuciábamos la función generatrizX más X cuadrado,",
        "start": 1447.0,
        "end": 1454.0
    },
    {
        "text": " más X³, más X³, etc.",
        "start": 1455.0,
        "end": 1458.0
    },
    {
        "text": " Porque esto es el término de grado 1, esto es el término de grado 2,",
        "start": 1461.0,
        "end": 1466.0
    },
    {
        "text": " esto es el término de grado 3, etc.",
        "start": 1466.0,
        "end": 1469.0
    },
    {
        "text": " Y acá P1 puede ser mayor igual que 0,",
        "start": 1470.0,
        "end": 1474.0
    },
    {
        "text": " entonces P1 puede tomar los valores 0, 1, 2, 3, etc.",
        "start": 1474.0,
        "end": 1484.0
    },
    {
        "text": " Y lo que hacíamos era asociarle la función generatriz 1, más X, más X cuadrado, más X³, etc.",
        "start": 1485.0,
        "end": 1495.0
    },
    {
        "text": " Porque esto es el término de grado 0, esto es el término de grado 1,",
        "start": 1496.0,
        "end": 1502.0
    },
    {
        "text": " esto es el término de grado 2, esto es el término de grado 3.",
        "start": 1502.0,
        "end": 1506.0
    },
    {
        "text": " Entonces, hasta acá lo que dije es una receta, la pregunta es ¿por qué esta receta funciona?",
        "start": 1506.0,
        "end": 1514.0
    },
    {
        "text": " ¿Sí?",
        "start": 1515.0,
        "end": 1516.0
    },
    {
        "text": " Y si P1 está a la mejor que 0 y se amplica esta receta, ¿qué estáis a P5?",
        "start": 1519.0,
        "end": 1525.0
    },
    {
        "text": " P5 no tiene que estar a la otra.",
        "start": 1525.0,
        "end": 1527.0
    },
    {
        "text": " P5 era mayor igual que 0.",
        "start": 1527.0,
        "end": 1529.0
    },
    {
        "text": " Ah, pero no se usa nada más que P5.",
        "start": 1530.0,
        "end": 1532.0
    },
    {
        "text": " Claro, acá los que son mayores iguales que 1 son P2, P3 y P4,",
        "start": 1533.0,
        "end": 1537.0
    },
    {
        "text": " por eso son las variables a los que les asociamos esta función y P1, P5 son mayores iguales que 0,",
        "start": 1538.0,
        "end": 1546.0
    },
    {
        "text": " o sea pueden tomar los valores 0, 1, etc.",
        "start": 1546.0,
        "end": 1549.0
    },
    {
        "text": " Entonces, esto, ¿cómo, a partir de los valores que puede tomar una variable,",
        "start": 1550.0,
        "end": 1555.0
    },
    {
        "text": " cómo asociarlo una función generatriz?",
        "start": 1555.0,
        "end": 1557.0
    },
    {
        "text": " Eso es una receta, ¿sí?",
        "start": 1557.0,
        "end": 1559.0
    },
    {
        "text": " Ahora la pregunta es, lo que es importante entender es ¿por qué esta receta funciona?",
        "start": 1559.0,
        "end": 1565.0
    },
    {
        "text": " ¿Os una cosa es saber que la torta lleva por bodear y otra muy distinta es saber por qué el por bodear se crece la torta?",
        "start": 1566.0,
        "end": 1575.0
    },
    {
        "text": " Entonces, ¿por qué funciona esta receta?",
        "start": 1577.0,
        "end": 1582.0
    },
    {
        "text": " La receta funciona por la razón siguiente ¿sí?",
        "start": 1583.0,
        "end": 1586.0
    },
    {
        "text": " Pensemos que tenemos solamente P1 y P2 para...",
        "start": 1588.0,
        "end": 1592.0
    },
    {
        "text": " para hacer un caso simple, ¿sí? Supongamos que nuestro problema es P1 más P2 igual a el número que quieran,",
        "start": 1595.0,
        "end": 1606.0
    },
    {
        "text": " no sé, 8, P1 es mayor igual que 0 y P2 es mayor igual que 5, perdón que es que 1.",
        "start": 1606.0,
        "end": 1615.0
    },
    {
        "text": " Entonces, a P1 le asocio esta función y a P2 le asocio esta función,",
        "start": 1617.0,
        "end": 1623.0
    },
    {
        "text": " y miro el producto de ambas.",
        "start": 1625.0,
        "end": 1629.0
    },
    {
        "text": " Entonces miro 1 más X más X cuadrado más X cube, etc.",
        "start": 1629.0,
        "end": 1637.0
    },
    {
        "text": " Esta es la que correspondía P1 y miro X más X cuadrado más X al cube más, etc.",
        "start": 1637.0,
        "end": 1647.0
    },
    {
        "text": " ¿Ve entonces?",
        "start": 1647.0,
        "end": 1650.0
    },
    {
        "text": " P1 más P2 es igual a 8, vamos a ver qué pasa si tenemos una solución de este ecuación,",
        "start": 1658.0,
        "end": 1666.0
    },
    {
        "text": " por ejemplo la solución es 2 más 6 igual a 8, entonces acá P1 es 2 y P126 ¿sí?",
        "start": 1666.0,
        "end": 1682.0
    },
    {
        "text": " ¿Esto aquí corresponde acá?",
        "start": 1683.0,
        "end": 1686.0
    },
    {
        "text": " corresponde acá decíamos que cuando P1 vale 2, eso corresponde a mirar acá el término en X cuadrado.",
        "start": 1686.0,
        "end": 1694.0
    },
    {
        "text": " Entonces, que P1 valga 2 quiere decir que acá voy a mirar esto y acá en algún lugar voy a tener X a las 6 y cuando que P2 vale 6 quiere decir que miro esto acá.",
        "start": 1697.0,
        "end": 1716.0
    },
    {
        "text": " Entonces estas cosas son infinitas pero yo le dije que uno la multiplica como si fueran bolinamias.",
        "start": 1717.0,
        "end": 1725.0
    },
    {
        "text": " Entonces cuando multiplico que hago, hago este con este y este con este y este con este y este con este y este con este.",
        "start": 1725.0,
        "end": 1735.0
    },
    {
        "text": " Así se multiplica, ¿sí? ¿Qué va a pasar cuando haga este con este?",
        "start": 1735.0,
        "end": 1744.0
    },
    {
        "text": " Lo que va a pasar cuando haga ese con este es que me va a quedar X a la 2 por X a las 6 que es X a las 2 más 6 o sea X a la 8.",
        "start": 1746.0,
        "end": 1760.0
    },
    {
        "text": " ¿sí?",
        "start": 1761.0,
        "end": 1762.0
    },
    {
        "text": " Entonces para esta solución 2, 6 de esta solución en este producto voy a obtener 1, X a la 8.",
        "start": 1763.0,
        "end": 1774.0
    },
    {
        "text": " Pero ahora puedo mirar otra solución, por ejemplo otra es 4 más 4, es igual a 8.",
        "start": 1775.0,
        "end": 1789.0
    },
    {
        "text": " Entonces acá voy a agarrar, X a la 4 que va a estar por acá y acá voy a agarrar, X a la 4 que va a estar acá y los voy a multiplicar.",
        "start": 1789.0,
        "end": 1801.0
    },
    {
        "text": " Y cuando haga este, X a la 4 con este, X a la 4, voy a obtener X a la 4 por X a la 4 que es X a la 4 más 4 que también es X a la 8.",
        "start": 1802.0,
        "end": 1815.0
    },
    {
        "text": " Entonces, al hacer esta distributiva, ¿sí? Al hacer el producto de 1 sumando de acá con 1 sumando de acá de todas las maneras posibles.",
        "start": 1816.0,
        "end": 1833.0
    },
    {
        "text": " ¿Cuánta vez se puede obtener X a la 8?",
        "start": 1833.0,
        "end": 1836.0
    },
    {
        "text": " Y la respuesta es tantas como manera saja de escribir el exponente 8 como suma de 1 exponente que aparezca acá y otro exponente que aparezca acá.",
        "start": 1839.0,
        "end": 1853.0
    },
    {
        "text": " Entonces acá aparecen todos los exponentes mayores iguales que 0, porque habíamos elegido los exponentes de acá como siendo los posibles valores de P1, que era mayor igual que 0.",
        "start": 1854.0,
        "end": 1868.0
    },
    {
        "text": " Y acá aparecen todos los exponentes mayores iguales que 1.",
        "start": 1868.0,
        "end": 1873.0
    },
    {
        "text": " Entonces, para cada par de exponentes P1 y P2 con estas condiciones va a ver una manera de hacer un producto y obtener X a la 8.",
        "start": 1874.0,
        "end": 1885.0
    },
    {
        "text": " Entonces, cuando al final hallamos hecho todas las infinitas distributivas y después reacomodemos el exponente cuando logremos escribir este producto como un terreno independiente, más algo por X, más otro algo por X cuadrado, más otro algo por X cubo, etcétera.",
        "start": 1886.0,
        "end": 1907.0
    },
    {
        "text": " ¿Cuál es el algo que va a estar multiplicando aquí a la 8?",
        "start": 1908.0,
        "end": 1912.0
    },
    {
        "text": " O sea, ¿cuál es el coeficiente del término en X a la 8?",
        "start": 1912.0,
        "end": 1916.0
    },
    {
        "text": " El numerito es que va a decir 25 por X a la 8.",
        "start": 1916.0,
        "end": 1920.0
    },
    {
        "text": " Entonces, ese numerito va a ser la cantidad de veces que al hacer productos obtuvimos aquí a la 8, que es lo mismo que la cantidad de soluciones de esta ecuación.",
        "start": 1920.0,
        "end": 1936.0
    },
    {
        "text": " Está bien, fumo rápido.",
        "start": 1936.0,
        "end": 1943.0
    },
    {
        "text": " Esto ya lo expliqué varias veces, pero si no lo entienden, lo vuelven a preguntar.",
        "start": 1943.0,
        "end": 1952.0
    },
    {
        "text": " ¿Por qué?",
        "start": 1952.0,
        "end": 1954.0
    },
    {
        "text": " Es importante, si queremos usar las funciones generatrices para resolver problemas de contenido, tenemos que saber por qué eso funciona.",
        "start": 1954.0,
        "end": 1963.0
    },
    {
        "text": " ¿Sí?",
        "start": 1963.0,
        "end": 1964.0
    },
    {
        "text": " Es la única manera de no equivocarse cuando no lo hace.",
        "start": 1965.0,
        "end": 1969.0
    },
    {
        "text": " Bueno, entonces nuestro problema no era así, era así.",
        "start": 1969.0,
        "end": 1975.0
    },
    {
        "text": " Tenemos cinco variables, p1 a p5, p1 a p5, la mayor es igual es que 0, p2, p3 y p4, la mayor es igual es que 1.",
        "start": 1975.0,
        "end": 1984.0
    },
    {
        "text": " ¿Y esta es la función generatriz?",
        "start": 1984.0,
        "end": 1987.0
    },
    {
        "text": " ¿Y qué queríamos mirar de esa función generatriz?",
        "start": 1987.0,
        "end": 1992.0
    },
    {
        "text": " Este es el problema que estamos estudiando, ¿Sí?",
        "start": 1997.0,
        "end": 2001.0
    },
    {
        "text": " Queremos saber cuántas soluciones centeras tienen este problema.",
        "start": 2001.0,
        "end": 2005.0
    },
    {
        "text": " Entonces, la cantidad de soluciones centeras de este problema.",
        "start": 2006.0,
        "end": 2012.0
    },
    {
        "text": " Entonces, ¿qué es la función generatriz que tenemos que mirar?",
        "start": 2028.0,
        "end": 2033.0
    },
    {
        "text": " ¿Qué es la función generatriz?",
        "start": 2036.0,
        "end": 2039.0
    },
    {
        "text": " ¿Hay que decir el coeficiente de él?",
        "start": 2042.0,
        "end": 2046.0
    },
    {
        "text": " Ahora es este problema, de quizá la 11. ¿Sí?",
        "start": 2048.0,
        "end": 2052.0
    },
    {
        "text": " Entonces, es el coeficiente de quizá la 11 de esta función generatriz.",
        "start": 2052.0,
        "end": 2057.0
    },
    {
        "text": " Entonces, esta función generatriz es...",
        "start": 2058.0,
        "end": 2062.0
    },
    {
        "text": " ¿Y quizá el cubo por algo?",
        "start": 2062.0,
        "end": 2066.0
    },
    {
        "text": " ¿Sí?",
        "start": 2066.0,
        "end": 2069.0
    },
    {
        "text": " Entonces, es lo mismo que el coeficiente.",
        "start": 2074.0,
        "end": 2079.0
    },
    {
        "text": " ¿Y qué es la función generatriz?",
        "start": 2079.0,
        "end": 2083.0
    },
    {
        "text": " ¿Y que que el coeficiente...",
        "start": 2083.0,
        "end": 2088.0
    },
    {
        "text": " Si ahora mire esta en que lesaque el cubo,",
        "start": 2096.0,
        "end": 2100.0
    },
    {
        "text": " lesaque el equivocar.",
        "start": 2103.0,
        "end": 2106.0
    },
    {
        "text": " el coeficiente del término de Xala a la que será.",
        "start": 2106.0,
        "end": 2113.0
    },
    {
        "text": " A la 8 que es 11 menos 13, se entiende por qué?",
        "start": 2113.0,
        "end": 2137.64
    },
    {
        "text": " O vuelvo a explicar cómo era esto.",
        "start": 2137.64,
        "end": 2144.64
    },
    {
        "text": " A ver, voy a explicar de vuelta cómo era esto.",
        "start": 2144.64,
        "end": 2148.64
    },
    {
        "text": " S de X es X al cubo por 1 sobre 1 menos X a la quinta, o sea X al cubo por G de X.",
        "start": 2148.64,
        "end": 2163.64
    },
    {
        "text": " G de X va a ser una cierta función general triste que va a ser a 0 más a 1 X más a 2 X cuadrado, etc.",
        "start": 2163.64,
        "end": 2177.64
    },
    {
        "text": " O sea va a ser la serie de términos general a su vene X a la E.",
        "start": 2177.64,
        "end": 2185.64
    },
    {
        "text": " Entonces cuando multiplico esto por X cubo me va a quedar a 0 por X cubo más a 1 por X a la 4 más a 2 por X a la quinta, etc.",
        "start": 2185.64,
        "end": 2210.64
    },
    {
        "text": " O sea la suma de la serie de términos general a N por X a la N más 3.",
        "start": 2210.64,
        "end": 2220.64
    },
    {
        "text": " Entonces si quiero mirar N f de X, el coeficiente de X a la 11 tengo que hacer que esto sea 11.",
        "start": 2221.64,
        "end": 2240.64
    },
    {
        "text": " Y eso para que ese N más 3 sea 11, N tiene que ser 8.",
        "start": 2240.64,
        "end": 2247.64
    },
    {
        "text": " Entonces estoy buscando a su 8 y a su 8 era el coeficiente del término N x a la 8 de esta G.",
        "start": 2247.64,
        "end": 2260.64
    },
    {
        "text": " Y esta G para mirarle el coeficiente la tenemos que escribir como una serie.",
        "start": 2270.64,
        "end": 2277.64
    },
    {
        "text": " Y cómo se escribía esta bicha como una serie?",
        "start": 2277.64,
        "end": 2282.64
    },
    {
        "text": " Esta bicha se escribía como una serie así como la suma desde K igual a 0 a infinito de combinaciones del menos 5 tomadas de acá por menos 1 a la K por X a la K.",
        "start": 2282.64,
        "end": 2309.64
    },
    {
        "text": " Entonces el coeficiente de X a la 8 o sea la respuesta a nuestro problema es combinaciones de menos 5 tomadas de 8 por menos 1 a la 8.",
        "start": 2309.64,
        "end": 2334.64
    },
    {
        "text": " Y esto es combinaciones de 5 más 8 menos 1 tomadas de 8 combinaciones de 12 tomadas de 8 y bueno.",
        "start": 2340.64,
        "end": 2356.64
    },
    {
        "text": " Y vamos a esperar que esto sea 120 ver.",
        "start": 2357.64,
        "end": 2361.64
    },
    {
        "text": " Esto es 12 por 11 por 10 por 5 sobre 4 factorial que es 2 por 3 por 4.",
        "start": 2361.64,
        "end": 2378.64
    },
    {
        "text": " Ay que fea situación 3 por 4 es 12 ¿verdad?",
        "start": 2379.64,
        "end": 2383.64
    },
    {
        "text": " No estamos tan mal. Entonces esto me queda 11 por 5 por 9. Esto no tiene buen aspecto ¿no?",
        "start": 2383.64,
        "end": 2400.64
    },
    {
        "text": " ¿Más de 120?",
        "start": 2401.64,
        "end": 2407.64
    },
    {
        "text": " ¿Qué?",
        "start": 2407.64,
        "end": 2414.64
    },
    {
        "text": " ¿No era 120? ¿Cuánto es?",
        "start": 2414.64,
        "end": 2420.64
    },
    {
        "text": " 495 ¿verdad? Entonces 120 era respuesta a algún otro problema que hicimos la vez pasada.",
        "start": 2420.64,
        "end": 2427.64
    },
    {
        "text": " Entonces si no cien lo mismo que la vez pasada.",
        "start": 2427.64,
        "end": 2431.64
    },
    {
        "text": " Muy bien ¿sí? Bueno. Entonces con esto terminamos el ejemplo de la clase pasada que era un ejemplo más de uso de funciones generatrices en problemas de conteo.",
        "start": 2432.64,
        "end": 2453.64
    },
    {
        "text": " Ahora vamos a hacer un par de cosas más que tienen que ver con la manipulación de funciones generatrices.",
        "start": 2453.64,
        "end": 2463.64
    },
    {
        "text": " Porque vieron que una cosa que es muy importante es lograr escribir las funciones generatrices de una forma que sea fácil para que podamos escribirlas como una serie.",
        "start": 2463.64,
        "end": 2476.64
    },
    {
        "text": " Y a veces las funciones generatrices son cosas relativamente complicadas.",
        "start": 2477.64,
        "end": 2485.64
    },
    {
        "text": " O sea son productos de cosas y tenemos que lograr llevarlos a una forma sencilla.",
        "start": 2485.64,
        "end": 2492.64
    },
    {
        "text": " Entonces este.",
        "start": 2493.64,
        "end": 2498.64
    },
    {
        "text": " Una.",
        "start": 2500.64,
        "end": 2505.64
    },
    {
        "text": " Una manipulación que es útil conocer es lo que se conoce como el método de fracciones simples.",
        "start": 2508.64,
        "end": 2515.64
    },
    {
        "text": " Entonces el método de fracciones simples es algo que vieron en cálculo 1.",
        "start": 2523.64,
        "end": 2536.64
    },
    {
        "text": " Es un mecanismo para escribir funciones racionales o sea funciones que son cosientes de polinomios.",
        "start": 2536.64,
        "end": 2544.64
    },
    {
        "text": " Funciones que son cosientes de polinomios como suma de cosas más sencillas.",
        "start": 2545.64,
        "end": 2553.64
    },
    {
        "text": " Entonces vamos a repasar como se hacía esto.",
        "start": 2553.64,
        "end": 2557.64
    },
    {
        "text": " Acá lo bueno que no vamos a integrar nada.",
        "start": 2557.64,
        "end": 2560.64
    },
    {
        "text": " Entonces.",
        "start": 2560.64,
        "end": 2564.64
    },
    {
        "text": " Por ejemplo, ¿qué pasa si yo tengo esta función?",
        "start": 2565.64,
        "end": 2570.64
    },
    {
        "text": " Uno sobre x menos 2.",
        "start": 2570.64,
        "end": 2573.64
    },
    {
        "text": " Perdón.",
        "start": 2573.64,
        "end": 2578.64
    },
    {
        "text": " Uno sobre x menos 2 por x menos 3.",
        "start": 2578.64,
        "end": 2586.64
    },
    {
        "text": " Y quiero escribir esta función como una serie de potencias.",
        "start": 2587.64,
        "end": 2592.64
    },
    {
        "text": " De nada, porque el problema que yo estoy resolviendo me llevó a querer mirar un coeficiente de ahí.",
        "start": 2592.64,
        "end": 2598.64
    },
    {
        "text": " Entonces tengo a escribir la como serie de potencias.",
        "start": 2598.64,
        "end": 2602.64
    },
    {
        "text": " Entonces lo primero que vamos a hacer es descomponerla como suma de dos cosas fáciles.",
        "start": 2602.64,
        "end": 2609.64
    },
    {
        "text": " Sí, este producto es algo con lo cual no sabemos qué hacer.",
        "start": 2609.64,
        "end": 2616.64
    },
    {
        "text": " Entonces vamos a cambiarlo por algo con lo cual sí sepamos qué hacer.",
        "start": 2616.64,
        "end": 2622.64
    },
    {
        "text": " Entonces el método de fracciones simples consistía en escribir esto de la siguiente manera.",
        "start": 2622.64,
        "end": 2630.64
    },
    {
        "text": " Escribirlo como algo por x menos 2 más otro algo por x menos 3.",
        "start": 2630.64,
        "end": 2640.64
    },
    {
        "text": " Sí, acá hay ve, son numeritos.",
        "start": 2640.64,
        "end": 2645.64
    },
    {
        "text": " Entonces, ¿cómo se hallan a y ve?",
        "start": 2645.64,
        "end": 2651.64
    },
    {
        "text": " Con la taparita.",
        "start": 2651.64,
        "end": 2654.64
    },
    {
        "text": " Entonces, ¿qué sepa el método de la taparita?",
        "start": 2654.64,
        "end": 2662.64
    },
    {
        "text": " No es el método de la taparita.",
        "start": 2662.64,
        "end": 2665.64
    },
    {
        "text": " El método de la taparita no es magia negra.",
        "start": 2665.64,
        "end": 2669.64
    },
    {
        "text": " Mira cómo se hallan a y ve por el procedimiento usual.",
        "start": 2669.64,
        "end": 2676.64
    },
    {
        "text": " Y en realidad, si uno mira esa deducción, ahí se ve la prueba del método de la taparita.",
        "start": 2676.64,
        "end": 2684.64
    },
    {
        "text": " El problema con la taparita es que hay que saber hacerla y que si uno no se acercara.",
        "start": 2684.64,
        "end": 2691.64
    },
    {
        "text": " Por eso le da rabanitos.",
        "start": 2691.64,
        "end": 2693.64
    },
    {
        "text": " Entonces lo que siempre funciona es lo que dice el compañero que es a prueba de,",
        "start": 2693.64,
        "end": 2698.64
    },
    {
        "text": " ¿a? ¿Vos desista para o vos desista hacerlo?",
        "start": 2698.64,
        "end": 2704.64
    },
    {
        "text": " Sí.",
        "start": 2704.64,
        "end": 2707.64
    },
    {
        "text": " Claro.",
        "start": 2707.64,
        "end": 2710.64
    },
    {
        "text": " Entonces el compañero dice que hagas un denominador común de estas fracciones.",
        "start": 2710.64,
        "end": 2716.64
    },
    {
        "text": " Acá me queda x menos 2 por x menos 3.",
        "start": 2716.64,
        "end": 2720.64
    },
    {
        "text": " Y al hacer denominador común, acá tengo a por x menos 3.",
        "start": 2720.64,
        "end": 2727.64
    },
    {
        "text": " Por x menos 3.",
        "start": 2727.64,
        "end": 2734.64
    },
    {
        "text": " Más b por x menos 2.",
        "start": 2734.64,
        "end": 2739.64
    },
    {
        "text": " Entonces, acá dice denominador común.",
        "start": 2739.64,
        "end": 2745.64
    },
    {
        "text": " Digamos, este método es a prueba del vidadizos.",
        "start": 2745.64,
        "end": 2749.64
    },
    {
        "text": " La taparita no. La taparita se puede usar si uno las sabe.",
        "start": 2749.64,
        "end": 2754.64
    },
    {
        "text": " Este método es a prueba de gente como yo.",
        "start": 2754.64,
        "end": 2757.64
    },
    {
        "text": " Ahí da.",
        "start": 2757.64,
        "end": 2760.64
    },
    {
        "text": " Entonces esto es, abajo tengo x menos 2 por x menos 3.",
        "start": 2760.64,
        "end": 2765.64
    },
    {
        "text": " Y tengo, acá me queda a más b por x menos 3 a menos 2b.",
        "start": 2765.64,
        "end": 2778.64
    },
    {
        "text": " ¿Me queda en dos situaciones exactamente?",
        "start": 2778.64,
        "end": 2784.64
    },
    {
        "text": " Si yo quiero que esta función racional se iguala esta,",
        "start": 2784.64,
        "end": 2789.64
    },
    {
        "text": " más vale que lo que hay acá arriba,",
        "start": 2789.64,
        "end": 2793.64
    },
    {
        "text": " esto que está acá arriba va a tener que ser 1 o 1.",
        "start": 2793.64,
        "end": 2798.64
    },
    {
        "text": " Entonces esto que está acá arriba para empezar no tiene que tener x.",
        "start": 2798.64,
        "end": 2804.64
    },
    {
        "text": " Sí, porque acá arriba no hay x, entonces acá arriba no tiene que haber x.",
        "start": 2804.64,
        "end": 2808.64
    },
    {
        "text": " Entonces esto y esto van a ser iguales cuando a más b,",
        "start": 2808.64,
        "end": 2814.64
    },
    {
        "text": " que es lo que está multiplicando de x sea 0,",
        "start": 2814.64,
        "end": 2820.64
    },
    {
        "text": " y menos 3a menos 2b sea 1.",
        "start": 2820.64,
        "end": 2828.64
    },
    {
        "text": " Sí?",
        "start": 2828.64,
        "end": 2834.64
    },
    {
        "text": " Entonces va a tener que ser igual a menos b.",
        "start": 2834.64,
        "end": 2840.64
    },
    {
        "text": " Y acá tenemos que 3b menos 2b para tener que ser igual a 1 o sea b igual a 1.",
        "start": 2846.64,
        "end": 2855.64
    },
    {
        "text": " Sí?",
        "start": 2858.64,
        "end": 2865.64
    },
    {
        "text": " Entonces la conclusión a la que llegamos es que f de x va a ser",
        "start": 2865.64,
        "end": 2875.64
    },
    {
        "text": " menos 1 sobre x menos 2,",
        "start": 2875.64,
        "end": 2882.64
    },
    {
        "text": " más 1 sobre x menos 3.",
        "start": 2882.64,
        "end": 2887.64
    },
    {
        "text": " Y ahora tenemos que escribir, bueno hasta acá sí,",
        "start": 2887.64,
        "end": 2893.64
    },
    {
        "text": " se acuerdan de haber hecho estas cuentas alguna vez en su vida.",
        "start": 2893.64,
        "end": 2899.64
    },
    {
        "text": " Y ahora tenemos que escribir ese bicho como una serie.",
        "start": 2900.64,
        "end": 2906.64
    },
    {
        "text": " Entonces,",
        "start": 2913.64,
        "end": 2918.64
    },
    {
        "text": " 1 sobre x menos 2.",
        "start": 2921.64,
        "end": 2925.64
    },
    {
        "text": " Nosotros sabíamos que hacer con 1 sobre 1 menos x, ¿cierto?",
        "start": 2925.64,
        "end": 2932.64
    },
    {
        "text": " O sea nosotros sabemos que 1 sobre 1 menos x es igual a la serie de ternelongeneral y quizá la n.",
        "start": 2932.64,
        "end": 2943.64
    },
    {
        "text": " O sea la función generatriz de la sucesión constante igual a 1.",
        "start": 2943.64,
        "end": 2949.64
    },
    {
        "text": " Entonces vamos a tratar de que se vaya pareciendo esto a que yo.",
        "start": 2950.64,
        "end": 2956.64
    },
    {
        "text": " Aéba, un poco más parecido.",
        "start": 2956.64,
        "end": 2961.64
    },
    {
        "text": " Sí?",
        "start": 2961.64,
        "end": 2964.64
    },
    {
        "text": " El problema es que acá no tenemos 1 menos algo, tenemos 2 menos algo.",
        "start": 2964.64,
        "end": 2970.64
    },
    {
        "text": " Entonces lo que hacemos en este denominador",
        "start": 2970.64,
        "end": 2974.64
    },
    {
        "text": " es sacar 2 de factor común y me queda 2 por 1 menos 1,",
        "start": 2974.64,
        "end": 2981.64
    },
    {
        "text": " 1,2 de x exactamente.",
        "start": 2981.64,
        "end": 2986.64
    },
    {
        "text": " Entonces, acá tengo, esto me quedó 1,1 por 1 sobre 1 menos algo.",
        "start": 2986.64,
        "end": 2997.64
    },
    {
        "text": " Y ahora esto sí lo sabemos escribir.",
        "start": 2998.64,
        "end": 3003.64
    },
    {
        "text": " Ah, podría haber sacado menos 2 de acá.",
        "start": 3010.64,
        "end": 3015.64
    },
    {
        "text": " Es lo mismo, claro, primero.",
        "start": 3015.64,
        "end": 3018.64
    },
    {
        "text": " Lo fui tratando de hacer que se pareciera esto, digamos, con empujones chiquitos.",
        "start": 3018.64,
        "end": 3024.64
    },
    {
        "text": " Podría haber sacado menos 2 de factor común y me voy a llevar lo mismo.",
        "start": 3024.64,
        "end": 3029.64
    },
    {
        "text": " Exacto.",
        "start": 3029.64,
        "end": 3030.64
    },
    {
        "text": " Entonces ahora esto sí es, este es menos 1,2, que tengo acá, que no pinta nada por la serie de ternelongeneral.",
        "start": 3030.64,
        "end": 3039.64
    },
    {
        "text": " X sobre 2 a la n.",
        "start": 3040.64,
        "end": 3044.64
    },
    {
        "text": " O sea, la serie de ternelongeneral x a la n sobre 2 a la n.",
        "start": 3044.64,
        "end": 3057.64
    },
    {
        "text": " Entonces, este pedazo sí lo pude escribir como una serie de potencias.",
        "start": 3058.64,
        "end": 3069.64
    },
    {
        "text": " Está claro.",
        "start": 3072.64,
        "end": 3075.64
    },
    {
        "text": " Ahora vamos a mirar a 1 sobre x menos 3.",
        "start": 3077.64,
        "end": 3080.64
    },
    {
        "text": " Vamos a hacer lo que dice el compañero de acá abajo, sacamos menos 3 de factor común.",
        "start": 3080.64,
        "end": 3085.64
    },
    {
        "text": " ¿Sí?",
        "start": 3085.64,
        "end": 3088.64
    },
    {
        "text": " Entonces voy a tener menos 1 tercio, 1 menos.",
        "start": 3088.64,
        "end": 3093.64
    },
    {
        "text": " Cuando acasa que menos 3 de factor común, me voy a quedar 1 menos x sobre 3.",
        "start": 3093.64,
        "end": 3102.64
    },
    {
        "text": " Y esto me va a quedar igual a menos 1 tercio por la serie de ternelongeneral x a la n sobre 3 a la n.",
        "start": 3103.64,
        "end": 3124.64
    },
    {
        "text": " Bien.",
        "start": 3125.64,
        "end": 3129.64
    },
    {
        "text": " Observen que esto este 3 lo puedo meter para dentro si quiero, ¿sí?",
        "start": 3130.64,
        "end": 3135.64
    },
    {
        "text": " Y esto me queda menos la serie de ternelongeneral x a la n sobre 3 a la n más 1.",
        "start": 3135.64,
        "end": 3144.64
    },
    {
        "text": " Y acá lo mismo, esto me queda menos la serie de ternelongeneral x a la n sobre 2 a la n más 1.",
        "start": 3145.64,
        "end": 3156.64
    },
    {
        "text": " Muy bien.",
        "start": 3156.64,
        "end": 3159.64
    },
    {
        "text": " Entonces, volviendo a nuestra función generatriz de acá, si queremos escribir fdx como serie,",
        "start": 3159.64,
        "end": 3169.64
    },
    {
        "text": " y fdx va a ser menos esta,",
        "start": 3170.64,
        "end": 3176.64
    },
    {
        "text": " más esta otra.",
        "start": 3184.64,
        "end": 3189.64
    },
    {
        "text": " O sea, me va a quedar la suma de 1 sobre 2 a la n menos 1 sobre 3 a la n más 1.",
        "start": 3190.64,
        "end": 3211.64
    },
    {
        "text": " 1 sobre 2 a la n más 1 menos 1 sobre 3 a la n más 1 es x a la n.",
        "start": 3211.64,
        "end": 3218.64
    },
    {
        "text": " Simplemente sume las series.",
        "start": 3224.64,
        "end": 3229.64
    },
    {
        "text": " Y aquí, si esta era menos, tengo menos de acá, que se me fue con este menos.",
        "start": 3230.64,
        "end": 3236.64
    },
    {
        "text": " Entonces, fdx es la función generatriz de la sucesión esta.",
        "start": 3241.64,
        "end": 3253.64
    },
    {
        "text": " De término general a su vn igual 1 sobre 2 a la n más 1 menos 1 sobre 3 a la n más 1.",
        "start": 3253.64,
        "end": 3265.64
    },
    {
        "text": " Más o menos o...",
        "start": 3284.64,
        "end": 3290.64
    },
    {
        "text": " Bueno, vamos a hacer otro ejemplo.",
        "start": 3302.64,
        "end": 3307.64
    },
    {
        "text": " En ejemplo 2, vamos a mirar la función generatriz,",
        "start": 3313.64,
        "end": 3330.64
    },
    {
        "text": " dada por 1 sobre x menos 2 por x menos 3 al cuadrado.",
        "start": 3331.64,
        "end": 3337.64
    },
    {
        "text": " Bueno, cuando descomponíamos esta infracción simple, ¿cuánto sumando van a aparecer ahí?",
        "start": 3338.64,
        "end": 3361.64
    },
    {
        "text": " Entonces, uno va a hacer de la forma a sobre x menos 2.",
        "start": 3362.64,
        "end": 3375.64
    },
    {
        "text": " Otro sumando va a hacer de la forma b sobre x menos 3 y otro va a hacer de la forma",
        "start": 3375.64,
        "end": 3389.64
    },
    {
        "text": " b sobre x menos 3 al cuadrado.",
        "start": 3390.64,
        "end": 3396.64
    },
    {
        "text": " Entonces, cuando aquel denominador tenemos uno de los factores de graudo elevado a la potencia 26,",
        "start": 3396.64,
        "end": 3411.64
    },
    {
        "text": " y eso nos da 26 sumando, uno en el cual el bicho está solo, otro elevado al cuadrado,",
        "start": 3412.64,
        "end": 3418.64
    },
    {
        "text": " en otro elevado al cubo y en otro elevado hasta la 26.",
        "start": 3418.64,
        "end": 3424.64
    },
    {
        "text": " Acá vamos a hacer hasta el cuadrado el ejercicio con la potencia 26 lo propuse para el parcer.",
        "start": 3424.64,
        "end": 3432.64
    },
    {
        "text": " Bueno, entonces, a ver cómo hallamos a b y c, como la anterior.",
        "start": 3433.64,
        "end": 3446.64
    },
    {
        "text": " Entonces, vamos a hacer de nominador común y que menos 2 por x menos 3 al cuadrado.",
        "start": 3446.64,
        "end": 3454.64
    },
    {
        "text": " Entonces, a lo tengo que multiplicar por x menos 3 al cuadrado, b lo tengo que multiplicar por x menos 2 por x menos 3 y c lo tengo que multiplicar por x menos 2.",
        "start": 3455.64,
        "end": 3476.64
    },
    {
        "text": " Entonces, esto va a ser, voy a tener x cuadrado, voy a tener a más b,",
        "start": 3476.64,
        "end": 3503.64
    },
    {
        "text": " en x voy a tener menos 6a, menos 5b, más c, x, ¿sí?",
        "start": 3504.64,
        "end": 3531.64
    },
    {
        "text": " Y después voy a tener 9a, más 6b, menos 12. ¿sí? ¿Está bien eso?",
        "start": 3531.64,
        "end": 3552.64
    },
    {
        "text": " Entonces, ahora si esta función va a ser igual a esta, tiene los denominadores iguales,",
        "start": 3553.64,
        "end": 3564.64
    },
    {
        "text": " este numerador va a tener que ser igual a este numerador.",
        "start": 3564.64,
        "end": 3572.64
    },
    {
        "text": " Entonces, lo que nos va a quedar es que a más b va a ser 0 menos 6a, menos 5b, más c, va a ser 0 y 9a, más 6b, menos 12, va a ser 1.",
        "start": 3573.64,
        "end": 3601.64
    },
    {
        "text": " Entonces, ahí va a ser, van a ser opuestos, entonces, menos 6a, menos 5b, va a ser b, más c igual 0,",
        "start": 3602.64,
        "end": 3627.64
    },
    {
        "text": " o sea b y c, van a ser opuestos, ahí se van a ser iguales, y acá tengo 9a, menos 6a, me dan quedando 3a, menos 12a, una, entonces me queda a es igual a 1.",
        "start": 3628.64,
        "end": 3649.64
    },
    {
        "text": " Entonces, me queda y sí, son iguales a 1 y que veis igual a menos 1.",
        "start": 3649.64,
        "end": 3659.64
    },
    {
        "text": " Entonces, esto me va a quedar, fdx me quedó así, me quedó, 1 sobre x menos 2, menos 1 sobre x menos 3,",
        "start": 3680.64,
        "end": 3705.64
    },
    {
        "text": " más 1 sobre x menos 3 al cuadrado, y ahora queremos escribir eso como una serie de potencias.",
        "start": 3706.64,
        "end": 3715.64
    },
    {
        "text": " Hasta ahí estamos bien, entonces, ya sabemos que 1 sobre x menos 2 era menos la serie de términos general",
        "start": 3715.64,
        "end": 3740.64
    },
    {
        "text": " y ahora que pasa con 1 sobre x menos 3 al cubo?",
        "start": 3740.64,
        "end": 3763.64
    },
    {
        "text": " Nosotros sabíamos que hacer con algo que era parecido, ¿no? Con qué cosa parecide sabíamos hacer algo?",
        "start": 3771.64,
        "end": 3780.64
    },
    {
        "text": " 1 sobre 1 menos x al cuadrado, y 1 sobre 1 menos x al cuadrado, cual era la 1, 2, 3, 4, etc.",
        "start": 3786.64,
        "end": 3799.64
    },
    {
        "text": " Entonces, esto era la serie de términos general, n por x la n, empezó en 1, ¿no?",
        "start": 3799.64,
        "end": 3811.64
    },
    {
        "text": " 1, ¿no? ¿Entonces, era n más 1 por x a la n? ¿no?",
        "start": 3811.64,
        "end": 3823.64
    },
    {
        "text": " Sí, era eso, esa era la serie, entonces tenemos que llevar esto algo que se parezca a 1 menos x al cuadrado,",
        "start": 3823.64,
        "end": 3833.64
    },
    {
        "text": " entonces, x menos 3 y 3 veces por x menos 1, ¿no? 3 veces por x dividido 3 menos 1, ¿tán? ¿de acuerdo?",
        "start": 3833.64,
        "end": 3859.64
    },
    {
        "text": " O sea, menos 3 veces por 1 menos x sobre 3, precioso, entonces, x menos 3 al cuadrado va a ser igual a",
        "start": 3859.64,
        "end": 3875.64
    },
    {
        "text": " menos 3 al cuadrado, que es 9 por 1 menos x sobre 3 al cuadrado, ¿no? O sea 9 por 1 menos x sobre 3 al cuadrado, ¿no?",
        "start": 3875.64,
        "end": 3890.64
    },
    {
        "text": " Entonces, vamos a escribirlo así, esto es 9 dividido 1 menos x sobre 3 al cuadrado, y bueno, y acá tenemos lo que pasa con la función que es 1 dividido 1 menos algo al cuadrado,",
        "start": 3890.64,
        "end": 3913.64
    },
    {
        "text": " lo único que cae es algo es x y acá el algo es x sobre 3, pero estamos guardando, ¿por qué esto es 1 menos 1 por x sobre 3 a la n?",
        "start": 3913.64,
        "end": 3935.64
    },
    {
        "text": " O sea, esto me quedó 1 menos por la serie de n más 1 sobre 3 a la n, por x a la n, este es el coeficiente, ¿sí?",
        "start": 3935.64,
        "end": 3950.64
    },
    {
        "text": " Y bueno, esto que está acá, este 9 es un 3 al cuadrado y lo puedo meter para dentro, ¿no? Entonces, esto lo puedo mejorar un poquito, me queda n más 1 sobre 3 a la n más 2 por x a la n,",
        "start": 3950.64,
        "end": 3968.64
    },
    {
        "text": " entonces ya los 3 sumandos que componen los tenamos escribidos como una serie de potencias, ¿porra acá?",
        "start": 3968.64,
        "end": 3982.64
    },
    {
        "text": " No, ¿a casi no?",
        "start": 3982.64,
        "end": 3989.64
    },
    {
        "text": " Entonces, ccdx va a ser 1 sobre x menos 2, va a ser menos esta serie, menos 1 sobre x menos 3,",
        "start": 4012.64,
        "end": 4034.64
    },
    {
        "text": " más 1 sobre x menos 3 al cuadrado,",
        "start": 4042.64,
        "end": 4049.64
    },
    {
        "text": " O sea, esto es la serie,",
        "start": 4073.64,
        "end": 4079.64
    },
    {
        "text": " poniendo todo eso junto, llegamos a esta serie, entonces, ccf es la función generatriz de la sucesión de término general,",
        "start": 4079.64,
        "end": 4108.639999999999
    },
    {
        "text": " a su vene igual menos 1 sobre 2 a la n más 1, más 1 sobre 3 a la n más 1, más 1 sobre 3 a la n más 2.",
        "start": 4108.64,
        "end": 4126.64
    },
    {
        "text": " Bueno, ¿dúdas?",
        "start": 4138.64,
        "end": 4167.64
    },
    {
        "text": " sobre estos ejemplos.",
        "start": 4167.64,
        "end": 4170.64
    },
    {
        "text": " El Real nos queda ver una cosa más sobre función de genera trices, que se llama",
        "start": 4170.64,
        "end": 4199.64
    },
    {
        "text": " con volución de sucesiones, que es responder a la siguiente pregunta.",
        "start": 4199.64,
        "end": 4206.64
    },
    {
        "text": " Si tengo dos funciones genera trices, FIG, la función genera F es la función genera",
        "start": 4206.64,
        "end": 4213.64
    },
    {
        "text": " tris de sucesión a subene, Y G es la función genera tris de sucesión P subene.",
        "start": 4213.64,
        "end": 4220.64
    },
    {
        "text": " ¿Qué pasa con el producto F por G?",
        "start": 4221.64,
        "end": 4224.64
    },
    {
        "text": " Eso es una función genera tris, y cómo llamamos la sucesión asociada.",
        "start": 4224.64,
        "end": 4230.64
    },
    {
        "text": " Pero eso nos va a llevar más que los 10 minutos que nos quedan de clase de hoy,",
        "start": 4230.64,
        "end": 4234.64
    },
    {
        "text": " así que hoy vamos a dejar por acá.",
        "start": 4234.64,
        "end": 4237.64
    },
    {
        "text": " Y otra cosa que no sé si les pusieron en la página, ¿qué va hasta el parcial?",
        "start": 4237.64,
        "end": 4244.64
    },
    {
        "text": " El parcial va hasta el práctico F5 de funciones genera trices, entonces en el teórico,",
        "start": 4245.64,
        "end": 4250.64
    },
    {
        "text": " vamos a empezar con el tema siguiente, pero no en el práctico.",
        "start": 4250.64,
        "end": 4255.64
    }
]