[{"text": " Bueno, ¿qué tal buen día?", "start": 0.0, "end": 20.0}, {"text": " Vamos a comenzar haciendo una mini resumen de lo que vimos al final la clase pasada,", "start": 20.0, "end": 28.0}, {"text": " que ahora el sella lo vamos a aplicar, que esencialmente lo que voy a llamar las ecuaciones del transistor,", "start": 28.0, "end": 33.0}, {"text": " mos referidas al sustrato, lo referidas al sustrato es porque se acuerdan trabajados con todas las tensiones", "start": 33.0, "end": 39.0}, {"text": " referidas al terminal V, al sustrato del transistor.", "start": 39.0, "end": 44.0}, {"text": " Entonces, esencialmente primero vimos la situación de la zona lineal, la cual se acuerdan el punto de vista físico,", "start": 45.0, "end": 61.0}, {"text": " lo que teníamos era que bueno acá votar la atención V, que la atención referida al sustrato,", "start": 61.0, "end": 70.0}, {"text": " que es el V, que es el sustrato como si lo considerábamos la referencia en todos los casos,", "start": 70.0, "end": 77.0}, {"text": " acá tenemos la atención de sur, acá tenemos la atención de drain y cuando el transistor está en sola lineal,", "start": 77.0, "end": 86.0}, {"text": " las tensiones son tales que ahora hemos llegado a las condiciones, las tensiones son tales que digamos la carga de inversión,", "start": 86.0, "end": 94.0}, {"text": " acá la estoy haciendo muy exageradamente grande, porque es mucho más chica, filtivo, lo punto de vista físico,", "start": 94.0, "end": 100.0}, {"text": " pero el espacio que ocupa es casi nulo, el espacio que ocupa es como una lámina de carga más bien,", "start": 100.0, "end": 106.0}, {"text": " pero digo para representar, para que se vea, digamos no teníamos esa especie de perfil,", "start": 106.0, "end": 111.0}, {"text": " de ciudad de carga, si esto lo mirábamos en el diagrama gráfico,", "start": 111.0, "end": 123.0}, {"text": " que graficamos las cosas en función de la atención en el calo largo y el canal,", "start": 125.0, "end": 130.0}, {"text": " básicamente lo que tenemos es que una cierta atención V, luego graficábamos la recta esa que era la ecuación de V", "start": 130.0, "end": 139.0}, {"text": " T0 más 1 más delta por VCH y se acuerdan que entonces la corriente era proporcional a la integral entre estas dos rectas,", "start": 139.0, "end": 157.0}, {"text": " la diferencia entre estas dos rectas era proporcional en la carga de inversión y la integral de la carga inversión a lo largo del canal,", "start": 157.0, "end": 166.0}, {"text": " no es que era lo que nos daba la corriente, o sea que si este es VS y este es VD,", "start": 166.0, "end": 173.0}, {"text": " entonces esta área era ID sobre V, donde V era muy por si ox por W sobre él,", "start": 173.0, "end": 187.0}, {"text": " y por acá teníamos otro punto notable, digamos que era la atención de Pinchof, o sea el punto en el cual,", "start": 187.0, "end": 201.0}, {"text": " si la atención de Dreyna llega ahí, esto se convierte en un triángulo o sea la carga en estas puntas,", "start": 201.0, "end": 209.0}, {"text": " si hace prácticamente 0, porque la carga que era proporcional a la diferencia entre estas dos rectas,", "start": 209.0, "end": 215.0}, {"text": " en este punto se haría 0, y la atención VPS y uno la educe porque estas dos rectas sean se corten,", "start": 215.0, "end": 224.0}, {"text": " digamos era VG menos VT0 sobre 1 más delta,", "start": 224.0, "end": 232.0}, {"text": " entonces esto salía de que ID, en definitiva tenías también haciendo Veta por la integral,", "start": 232.0, "end": 247.0}, {"text": " bueno, realidad es lo exactamente el sodio,", "start": 247.0, "end": 254.0}, {"text": " vamos simplemente, esto salía de que ID era proporcional a la integral entre VS y VD de Cuprima I,", "start": 255.0, "end": 265.0}, {"text": " de VSH por DVSH, adiós, en definitiva la verdad, cuando dibujimos la corriente,", "start": 265.0, "end": 273.0}, {"text": " lo hallamos de esta forma y entonces eso terminaba haciendo que la corriente estuillada por esa área,", "start": 273.0, "end": 281.0}, {"text": " siempre estamos hablando por ahora en la zona lineal, y bueno y finalmente usando la edución primera", "start": 281.0, "end": 290.0}, {"text": " o calculando el área del trapecio S, en definitiva en la zona lineal la corriente terminaba haciendo Veta por VG menos VT0,", "start": 290.0, "end": 303.0}, {"text": " menos 1 más delta sobre 2 por VD más VS por VD menos VS,", "start": 304.0, "end": 315.0}, {"text": " y esto para estar en zona lineal entonces lo que precisábamos era que una manera pensarlo mirábamos en el diagrama,", "start": 315.0, "end": 334.0}, {"text": " este es que tanto VS como VD los 12 ammenores que BP,", "start": 334.0, "end": 337.0}, {"text": " o sea la condición inicial que ha puesto nosotros, bueno 0, VS es mayor que 0,", "start": 338.0, "end": 343.0}, {"text": " menor que VD, y a su vez es menor que BP.", "start": 344.0, "end": 349.0}, {"text": " Esta vez no es la forma más común de ponerlo, al menos de punto de esta vez,", "start": 349.0, "end": 368.0}, {"text": " si miramos de acá la condición VS menor que BP, esto en definitiva quiere decir que VS es menor que VG menos VT0 sobre 1 más delta,", "start": 369.0, "end": 386.0}, {"text": " y entonces esto a su vez es definitiva uno lo puede poner simplemente como que VG es mayor que VT0 más 1 más delta por VS,", "start": 387.0, "end": 401.0}, {"text": " esto es totalmente equivalente, decir esto o decir esto por supuesto, pero van a ver a veces,", "start": 402.0, "end": 410.0}, {"text": " si es en los libros o una manera mirarlo que capaz que puede ser una rapaz más físicamente natural,", "start": 410.0, "end": 419.0}, {"text": " si desde algún punto de vista es pensarlo esta forma, que es decir que una primera condición para que el transistor extenzonal", "start": 419.0, "end": 425.0}, {"text": " que se forma el canal y que se forma el canal es que VG, que la atención que yo pongo a Canalgate sea suficientemente alta para formar el canal,", "start": 426.0, "end": 437.0}, {"text": " y esta sería la condición mirada del punto vista de VG, al mismo pero miad punto vista de VS,", "start": 437.0, "end": 444.0}, {"text": " y la segunda condición que estamos imponiendo acá es que VS sea menor que BP, que esto es bueno, es decir que VS sea menor que VG menos VT0 sobre 1 más delta,", "start": 444.0, "end": 462.0}, {"text": " que esta atención sería el lo que a veces es la atención de Pinch Off, también se puede eso se le llama VSAT,", "start": 463.0, "end": 472.0}, {"text": " porque es la atención en la cual el transistor satura, en la atención en la cual se acaba la zona lineal.", "start": 472.0, "end": 480.0}, {"text": " ¿Hay una pregunta está ahí?", "start": 493.0, "end": 499.0}, {"text": " ¿Dónde la roja? ¿Dónde la roja? ¿Dónde la roja? ¿Dónde?", "start": 500.0, "end": 519.0}, {"text": " ¿Era la verdad? Si yo impongo estas dos cosas, o sea sin pongo en definitiva estas dos, ¿no?", "start": 520.0, "end": 530.0}, {"text": " Vamos a ponerlas con otro color, porque se vean estas, sin pongo estas dos, que sería lo mismo que imponer estas otras dos,", "start": 530.0, "end": 539.0}, {"text": " hay alguna cosa arriba que no estoy imponiendo, ¿no? ¿Qué me está faltando imponer?", "start": 539.0, "end": 544.0}, {"text": " ¿Díamos? Que sea mayor que cero, que eso es algo que es en el funcionamiento del transistormos, es como digamos de cajón,", "start": 544.0, "end": 555.0}, {"text": " es lo que siempre pasa, es seguro porque básicamente acá teníamos una zona N, acá teníamos una zona N, acá teníamos una zona P,", "start": 555.0, "end": 564.0}, {"text": " en el transistor que tenemos, es decir que en definitiva entre acá y acá uno tiene un diodo, y entre acá y acá uno tiene un diodo.", "start": 564.0, "end": 573.0}, {"text": " Y la idea de funcionar del transistormos es que estos dos dios se están cortados, o sea que no cambien la corriente que pasa por los terminales debido a que conduce.", "start": 573.0, "end": 585.0}, {"text": " El transistor N, hemos estado pensado para funcionar con V, S y V, de mayores que la tensión de sustrato, o sea que la condición V, S mayor que Cero y V,", "start": 585.0, "end": 599.0}, {"text": " mayor que Cero, en realidad también es otra condición, pero es como digamos que uno va a tratar que se cumpla siempre, digamos, pero es otra condición.", "start": 599.0, "end": 611.0}, {"text": " Y hay otra condición más que estaría implícita, cadentro que no la estamos imponiendo acá abajo.", "start": 611.0, "end": 618.0}, {"text": " Gente que estudió varios años matemáticas, ¿verdad? ¿Qué otra condición ahí ahí?", "start": 618.0, "end": 626.0}, {"text": " Que V, S sea menor que V, que eso en realidad también es una condición como que se va a cumplir siempre porque es de una hora es por definición, o sea la corriente va a de, o sea los portadores van de la, salen siempre la fuente, por eso se llama fuente, siempre salen del sur.", "start": 626.0, "end": 653.0}, {"text": " Como acaso en el electrón es los portadores, quiere decir que los electrones van a ir del sur al drain, por lo tanto la corriente va a ir del drain al sur.", "start": 653.0, "end": 665.0}, {"text": " Y por lo tanto el sur va a ser aquel que esté a menor potencial, porque digamos la corriente va a ir de más potencial a menos potencial.", "start": 665.0, "end": 675.0}, {"text": " Entonces, siempre el sur va a ser el terminal que esté en un transistor enemos.", "start": 675.0, "end": 682.0}, {"text": " Entonces, tenemos que la S es el terminal a menor potencial entre drain y sur, por supuesto, tomo hablando.", "start": 686.0, "end": 703.0}, {"text": " Y drain es el que está por lo tanto a mayor potencial. Es decir, eso es algo que en un transistor, en un circuito, en un transistor que lo tengo ahí funcionando a lo largo del tiempo puede cambiar.", "start": 703.0, "end": 714.0}, {"text": " En un momento las tensiones que tienen aplicadas van por un lado y entonces la que está de este lado es la sur y la que está de este lado es el drain y en otro momento las tensiones de entrada del circuito, lo que sea cambian y se da vuelta, la corriente pasa para el otro lado y el que está de un lado, ser sur, el que está de el otro lado, ser sur, si el que está de este lado es el drain.", "start": 714.0, "end": 732.0}, {"text": " Entonces, eso es algo que puder de poder cambiar con el tiempo depende de las tensiones aplicadas y en realidad cuando uno plantea las ecuaciones, ¿quién es la sur si quieres el drain?", "start": 733.0, "end": 746.0}, {"text": " O sea que el drain va a estar a mayor tensión que el sur, eso es por definición, tiene que ser así. ¿Se ve eso?", "start": 746.0, "end": 753.0}, {"text": " Bien, bueno esto sería entonces lo que refiere a la zona lineal, capaz que si borramos alguna cosita accesoria, como la integral está,", "start": 753.0, "end": 769.0}, {"text": " o pasar una línea y abajo tratar de dibujar y escribir qué es lo que pasaba en saturación.", "start": 772.0, "end": 778.0}, {"text": " En saturación estábamos en una situación en que la tensión de drain había crecido y entonces la carga cerca del drain se hacía prácticamente cero", "start": 784.0, "end": 808.0}, {"text": " y teníamos una situación más bien así digamos, la tensión de drain es mayor que la tensión de pinchof, esajerando un poco, teníamos una especie de triángulo y acá la carga es prácticamente cero en esta zona, habíamos ya comentado que no podía ser exactamente cero porque si no el transistor dejaba de conducir pero que en realidad a los efectos no estuvo modelo simplificado, ahí sería prácticamente cero.", "start": 809.0, "end": 834.0}, {"text": " Esto mismo lo veíamos en el diagrama agráfico.", "start": 835.0, "end": 841.0}, {"text": " En esta situación digamos que tenemos el V se por acá y el VD va a estar por acá y por lo tanto ahora, la área de este triángulo es lo que va a ser y de sobrevisto.", "start": 841.0, "end": 868.0}, {"text": " Y por acá tenemos entonces el área del triángulo definido por la tensión de pinchof.", "start": 869.0, "end": 876.0}, {"text": " Y entonces si haciendo las cuentas de eso llegábamos a que la corriente ID era beta sobre dos por uno más delta por VG menos vT0, más uno más delta por VS elevado el cuadrado.", "start": 876.0, "end": 903.0}, {"text": " O sea que la tensión varía cuadraticamente con la tensión de GATE, pero en la corriente varía cuadraticamente con la tensión de GATE en la zona de saturación y era y es en primera aproximación independiente de la tensión de drain.", "start": 903.0, "end": 917.0}, {"text": " Por eso es que en esa zona el transistor funciona como una fuente de corriente.", "start": 917.0, "end": 922.0}, {"text": " Y bueno y acá las condiciones para que esto pase es que VS sea menor que BP o dicho otra forma que el transistor conduzca, o sea que VG sea mayor que VT0 más uno más delta por VS.", "start": 923.0, "end": 943.0}, {"text": " Esta es una primera condición y la segunda condición es que justamente que esté saturado, o sea que el VD sea más grande que el BP.", "start": 943.0, "end": 953.0}, {"text": " Y ahora vamos a ver si es una condición de PX, si es una condición de PX, si es una condición de PX, si es una condición de PX, si es una condición de PX, si es una condición de PX, si es una condición de PX, si es una condición de PX, si es una condición de PX, si es una condición de PX, si es una condición de PX, si es una condición de PX, si es una condición de PX, si es una condición de PX, si es una condición de PX, si es una condición de PX, si es una condición de PX, si es una condición de PX, si es una condición de PX, si es una condición de PX, si es una condición de PX, si es una condición de PX, si es una condición de PX, si es una condición de PX,", "start": 973.0, "end": 974.0}, {"text": " bien, y nos faltaría una última, de hecho, nos falta una última zona de funcionamiento del transistor MOS, si acuerdan cuando arrancamos a ver transistores dijimos que la razón de ser de los transistores es o implementar amplificadores, que para eso prisamos algo o una de las formas de tener algo funciona como una fuente corriente contolada por tensión o por corriente, o sea contolada por una tabaríable eléctrica,", "start": 1003.0, "end": 1033.0}, {"text": " y la otra razón de ser es implementar llaves contoladas por también por una magnituélectrica de manera de poder implementar o circuitos digitales.", "start": 1033.0, "end": 1047.0}, {"text": " La zona lineal va a corresponder a la llave conduciendo a la llave cerrada, digamos, y la situación de la llave abierta desconectada, digamos, este sin conducir es lo que se llama la zona de corte.", "start": 1047.0, "end": 1062.0}, {"text": " Sería la tercera zona que no faltaría de... el transistor MOS, donde básicamente, siguiendo en mismos quema, bueno, no tenemos canal, no hay canal, no se formó el canal de inversión todavía,", "start": 1062.0, "end": 1091.0}, {"text": " el curso I es más o menos 0, digamos, y de despunto he vista del diagrama gráfico, para que eso pase, dado un cierto VG positivo, si tiene un cierto VG positivo,", "start": 1091.0, "end": 1114.0}, {"text": " podrías ser el VG negativo y también el transistor estaría cortado, pero digamos, si tenemos un cierto VG positivo, acá tenemos la curva v0 más 1 más delta por VCH,", "start": 1114.0, "end": 1130.0}, {"text": " la situación para que eso pase es que digamos tanto VS como VD sean los dos mayores a VP.", "start": 1130.0, "end": 1140.0}, {"text": " Entonces, en definitiva, el área que uno tendría que integrar en esta visualización sería como el área ahí, ¿no?, que es 0, la carga sería esta y se hace prácticamente 0 en este puro.", "start": 1140.0, "end": 1158.0}, {"text": " Entonces, acá la ecuación, básicamente en principio, vamos a considerar que si des igual a 0, va a ver fugas como hay en los diodos, de hecho, incluso podrían estar las corrientes inversas de estos diodos hacia el sustrato,", "start": 1159.0, "end": 1179.0}, {"text": " así que ver, que eso me daría una corriente que entra por acá, la realidad van a estar, pero digamos, despreciando las fugas, va a considerar que ahí la corriente es 0,", "start": 1179.0, "end": 1195.0}, {"text": " y la condición para que pase eso, entonces es que VS sea mayor que VP, o sea que esto es lo mismo que decir que VG sea menor, que V0 más 1 más delta por VS, o sea que el VG no es suficientemente grande como para hacer conducir el transistor, como para hacer generar el canal de inversión,", "start": 1195.0, "end": 1218.0}, {"text": " y bueno, VD por definiciones mayor que VS, como si yo soy, o sea que VD también va a ser mayor que VP.", "start": 1219.0, "end": 1226.0}, {"text": " Pero básicamente la condición es la que está en rojo, porque una vez que uno verifica que se cumple esa CWVS es mayor que VP, como si yo como VD tiene que ser necesariamente mayor igual a VS,", "start": 1236.0, "end": 1246.0}, {"text": " entonces, o sea mayor igual podría ser VD igual a VS, entonces VD también va a ser mayor a VP.", "start": 1246.0, "end": 1255.0}, {"text": " La realidad acá sería con un igual esto para hacer exacto, porque si VS es igual a VP, estaríamos en el borde conducir, pero no estaríamos conduciendo todavía.", "start": 1255.0, "end": 1267.0}, {"text": " Bueno, ahí tenemos una primera visión completa del transistor,", "start": 1276.0, "end": 1305.0}, {"text": " este NEMOS que nos falta, creo que nada, bueno, una cosa que vimos la vez pasada, se acuerdan es que en zona lineal, si este términos despreciable frente a este otro frente a VG menos V0,", "start": 1305.0, "end": 1327.0}, {"text": " entonces tenemos la situación en que la corriente nos queda proporcionada a la diferencia ante que VD y VS, o sea que el transistor se comporta como una resistencia, la zona, la parte de la zona lineal en la cual lo podíamos aproximar como una resistencia,", "start": 1328.0, "end": 1346.0}, {"text": " pero el otro día hemos resultado en zona lineal, si VD más VS por uno más delta sobre dos es mucho menor que VG menos V0,", "start": 1346.0, "end": 1366.0}, {"text": " entonces VD es la próxima antigua, la Veta por VG menos V0 por VD menos VS, entonces tenemos la resistencia a un del transistor que es uno sobre Veta por VG menos V0.", "start": 1366.0, "end": 1385.0}, {"text": " Entonces, vamos a ver si es una resistencia a un del transistor, si es una resistencia a un del transistor, si es una resistencia a un del transistor,", "start": 1396.0, "end": 1415.0}, {"text": " si no hay preguntas hasta acá,", "start": 1415.0, "end": 1442.0}, {"text": " Bueno, vamos a empezar a aplicar esto.", "start": 1442.0, "end": 1448.12}, {"text": " Vamos a hacer dos cosas a continuación.", "start": 1448.12, "end": 1450.64}, {"text": " Primero vamos a presentar el símbolo del transistor enemos,", "start": 1450.64, "end": 1454.72}, {"text": " que por supuesto, cuando uno escribe,", "start": 1454.72, "end": 1455.96}, {"text": " dibujo un esquemático, no va a dibujar esto que venimos dibujándose", "start": 1455.96, "end": 1460.0}, {"text": " a su estructura física, sino que hay un símbolo de circuito", "start": 1460.0, "end": 1463.16}, {"text": " para presentar el transistor enemos.", "start": 1463.16, "end": 1466.44}, {"text": " Vamos a ver ese símbolo, vamos a ver algún primer,", "start": 1466.44, "end": 1468.88}, {"text": " vamos a ver un par de ejemplos, uno en zona lineal,", "start": 1468.88, "end": 1471.84}, {"text": " el hidetonsaturación o no lean, no entre corte y liñal", "start": 1471.84, "end": 1475.08}, {"text": " hidetonsaturación.", "start": 1475.08, "end": 1478.6}, {"text": " Y después vamos a presentar el hermano mellizo, no gemelo,", "start": 1478.6, "end": 1485.6}, {"text": " porque sería más identico si fuera gemelo, no gemelo.", "start": 1485.6, "end": 1488.84}, {"text": " El hermano mellizo del transistor enemos, que es el transistor", "start": 1488.84, "end": 1492.72}, {"text": " pemos, en día, es el hermano dual, que van a haber que", "start": 1492.72, "end": 1496.52}, {"text": " en especial para, bueno, para muchas cosas es práctico tener un", "start": 1496.52, "end": 1499.84}, {"text": " transistor que es como dual, o sea que en vez de prenderse", "start": 1499.84, "end": 1503.1999999999998}, {"text": " con la tensión de gate está por arriba de sus tratos,", "start": 1503.1999999999998, "end": 1505.3999999999999}, {"text": " se prende con la tensión de gate está por debajo de sus", "start": 1505.3999999999999, "end": 1507.1999999999998}, {"text": " tratos, como todas las cosas al revés, digamos.", "start": 1507.1999999999998, "end": 1513.52}, {"text": " Y que especial para hacer circuitos digitales es muy", "start": 1513.52, "end": 1516.9599999999998}, {"text": " práctico, vamos a ver tener transistores de los dos tipos.", "start": 1516.9599999999998, "end": 1520.72}, {"text": " Entonces, pero bueno, veamos primero el símbolo de circuito", "start": 1520.72, "end": 1524.08}, {"text": " del transistor enemos.", "start": 1524.08, "end": 1525.1599999999999}, {"text": " Bien, la idea es vamos a sería como si uno lo, como si lo", "start": 1529.84, "end": 1547.32}, {"text": " dibujáramos en vertical, bueno, realmente, muy símbolo,", "start": 1547.32, "end": 1551.8}, {"text": " vamos a vertical, la realidad sería más bien, más", "start": 1551.8, "end": 1555.56}, {"text": " bien, vamos a hacer una correspondencia más exacta, se", "start": 1555.56, "end": 1558.56}, {"text": " tiene una cosa así.", "start": 1558.56, "end": 1562.56}, {"text": " Ya tenemos el sustrato, tenemos el sustrato tipo", "start": 1562.56, "end": 1571.6399999999999}, {"text": " pen, las zonas N que corresponden al drain y al surz.", "start": 1571.6399999999999, "end": 1581.6399999999999}, {"text": " Y el guía está acá, separado el canal poelóxido,", "start": 1581.64, "end": 1585.0800000000002}, {"text": " si lo miramos así el transistor, el símbolo correspondiente,", "start": 1585.0800000000002, "end": 1589.2}, {"text": " circuito hay varias variantes que la vamos a dibujar acá,", "start": 1589.2, "end": 1592.2800000000002}, {"text": " la primera capaz que la más formal es esta.", "start": 1592.2800000000002, "end": 1600.92}, {"text": " Esto sería el drain y el surz.", "start": 1606.16, "end": 1609.44}, {"text": " Y acuérdense que son decimetes, que con dispositivos,", "start": 1609.44, "end": 1611.96}, {"text": " o sea, son de algunas intercambiables.", "start": 1611.96, "end": 1614.3200000000002}, {"text": " Y este, como una flechita así para allá,", "start": 1614.3200000000002, "end": 1620.04}, {"text": " es representa el terminal de sustrato.", "start": 1620.04, "end": 1622.16}, {"text": " La flechita, y a ver esto tiene un trata de ser más o menos", "start": 1622.16, "end": 1642.3200000000002}, {"text": " nemo técnico, digamos, fíjense que se representa,", "start": 1642.3200000000002, "end": 1647.44}, {"text": " digamos, como que tenemos el gate que está acá,", "start": 1647.44, "end": 1649.8400000000001}, {"text": " que está separado por un espacio de lo que va a ser el canal,", "start": 1649.84, "end": 1653.08}, {"text": " la conexión entre el gate y surz.", "start": 1653.08, "end": 1656.12}, {"text": " Y además, en el símbolo éste que es el más purista,", "start": 1656.12, "end": 1661.6}, {"text": " esto se hace como interrumpido, que no una línea continua,", "start": 1661.6, "end": 1667.8799999999999}, {"text": " que eso en una área simboliza que esto es un transistor,", "start": 1667.8799999999999, "end": 1671.12}, {"text": " enemos de enriquecimiento, es decir, que es un transistor enemos,", "start": 1671.12, "end": 1675.32}, {"text": " que si uno no le aplica atención en el gate, no tiene canal.", "start": 1675.32, "end": 1679.1999999999998}, {"text": " Porque existen los transistores enemos de enpobrecimiento,", "start": 1679.2, "end": 1683.32}, {"text": " que no lo vamos a estudiar, pero que sería lo mismo,", "start": 1683.32, "end": 1686.48}, {"text": " pero que por cómo está fabricado, por defecto,", "start": 1686.48, "end": 1689.6000000000001}, {"text": " el canal está formado, y uno lo que hace es aplicar", "start": 1689.6000000000001, "end": 1693.44}, {"text": " tensión para hacer que se corte el transistor.", "start": 1693.44, "end": 1696.48}, {"text": " Acá tenemos que aplicar tensión para hacer que conduzca.", "start": 1696.48, "end": 1700.0}, {"text": " Entonces, y esta flechita va en el sentido directo de la juntura surz,", "start": 1700.0, "end": 1721.72}, {"text": " perdón, de la juntura sus tratos, surz, por ejemplo,", "start": 1721.72, "end": 1726.12}, {"text": " su tratos, ahí mismo, digamos, no sea,", "start": 1726.12, "end": 1729.3999999999999}, {"text": " si yo miro acá, acá tengo un diodo desde PAN,", "start": 1729.3999999999999, "end": 1733.04}, {"text": " o sea que conduciría para allá, entonces la flechita es entrante.", "start": 1733.04, "end": 1737.8}, {"text": " Apunta en el sentido en que conduce el diodo,", "start": 1737.8, "end": 1741.6799999999998}, {"text": " la juntura sus tratos sus.", "start": 1741.6799999999998, "end": 1748.84}, {"text": " Bueno, otros estudiamos a veces, no se están puristas,", "start": 1748.84, "end": 1753.84}, {"text": " y el transistor se lo representa así.", "start": 1753.84, "end": 1756.6}, {"text": " O sea, no se hace la línea interrumpida.", "start": 1764.28, "end": 1768.8799999999999}, {"text": " Eso es un símbolo que se usa habitualmente también.", "start": 1768.8799999999999, "end": 1772.6399999999999}, {"text": " Y ahí cuando se quiere representar un transistor que no fuera de enriquecimiento,", "start": 1772.6399999999999, "end": 1776.48}, {"text": " se hace más gruesa hasta parte, se hace de la presenta distinto.", "start": 1776.48, "end": 1780.76}, {"text": " Perdón, esto es trein acá.", "start": 1780.76, "end": 1782.32}, {"text": " Y un tercer símbolo que se usa en ciertos contextos es este.", "start": 1783.84, "end": 1801.6}, {"text": " En ese tercer símbolo, la flechita sigue estando en el sentido directo", "start": 1814.76, "end": 1820.6}, {"text": " de la juntura sus tratos, surz, pero simplemente en este tercer símbolo", "start": 1820.6, "end": 1834.04}, {"text": " no se indica dónde está la conexión a sus tratos.", "start": 1834.04, "end": 1838.8799999999999}, {"text": " Eso puede ser por dos razones.", "start": 1838.8799999999999, "end": 1841.84}, {"text": " Uno, la primera razón puede ser que se sobreentiende donde está.", "start": 1843.84, "end": 1867.08}, {"text": " Ejemplo a tierra, o sea, yo tengo por ejemplo en un circuito integrado", "start": 1874.84, "end": 1879.0}, {"text": " donde terminas tecnologías todos los transistores tenemos por cómo se fabrica.", "start": 1879.0, "end": 1883.8}, {"text": " Vamos a después tienen sus tratos a tierra.", "start": 1883.8, "end": 1885.84}, {"text": " Entonces, no se dibuja para cada uno a veces dónde está conectado su trato,", "start": 1885.84, "end": 1890.4399999999998}, {"text": " porque ya se sabe que quien está mirando ese circuito,", "start": 1890.4399999999998, "end": 1893.36}, {"text": " sabiendo con qué tecnología está trabajando,", "start": 1893.36, "end": 1895.08}, {"text": " ya sabe que el sustrato va a estar a tierra y no quiere perder tiempo", "start": 1895.08, "end": 1898.84}, {"text": " dibujando el sustrato para cada transistor.", "start": 1898.84, "end": 1900.72}, {"text": " Pero también hay una segunda posibilidad.", "start": 1904.36, "end": 1906.52}, {"text": " O sea, este es un símbolo que de alguna era es un poquito ambivo.", "start": 1906.52, "end": 1910.08}, {"text": " Una segunda posibilidad es que eso esté dibujado así porque el sustrato está conectado", "start": 1910.08, "end": 1920.84}, {"text": " a la sursu.", "start": 1920.84, "end": 1921.84}, {"text": " Es decir, que en definitiva, en realidad, lo que no se están representando", "start": 1927.32, "end": 1931.72}, {"text": " es que...", "start": 1931.72, "end": 1932.72}, {"text": " Es que en realidad lo que el circuito que tenemos es este.", "start": 1941.72, "end": 1946.1200000000001}, {"text": " Y en realidad, este es un caso interesante porque esta es la situación de los transistores", "start": 1961.72, "end": 1978.8}, {"text": " mos discretos.", "start": 1978.8, "end": 1979.8}, {"text": " O sea, si ustedes van a rondar y aledaños y piden que quiero compriar un transistor", "start": 1979.8, "end": 1985.96}, {"text": " y la gente se va a dar un dispositivo que tiene tres patas.", "start": 1985.96, "end": 1991.2}, {"text": " No tiene cuatro patas.", "start": 1991.2, "end": 1992.96}, {"text": " O sea, todos los transistores mos discretos tienen ya internamente hecha esta conexión.", "start": 1992.96, "end": 1998.64}, {"text": " O sea, uno de los terminales está conectado al sustrato y entonces eso tiene varias", "start": 1998.64, "end": 2006.16}, {"text": " implicancias.", "start": 2006.16, "end": 2007.16}, {"text": " La primera implicancia que el dispositivo ya no es más simétrico,", "start": 2007.16, "end": 2013.0}, {"text": " porque ya de ahí ni sur ya no son iguales, o sea, el punto está físico,", "start": 2013.0, "end": 2017.04}, {"text": " porque hay uno que está conectado al sustrato y el otro no.", "start": 2017.04, "end": 2019.56}, {"text": " Y la segunda implicancia que tiene es que decíamos entonces el caso de transistor", "start": 2019.56, "end": 2030.96}, {"text": " mos discreto.", "start": 2030.96, "end": 2031.96}, {"text": " La segunda implicancia que tiene es que si tenemos esta situación, en realidad lo que", "start": 2031.96, "end": 2044.8400000000001}, {"text": " vamos a tener es", "start": 2044.8400000000001, "end": 2061.7200000000003}, {"text": " esto, porque este diodo que dibujamos acá, que está entre que es de gain y sustrato,", "start": 2061.72, "end": 2072.6}, {"text": " si uno conecta el sustrato a la sur, termina quedando como se dice habitualmente en anti", "start": 2072.6, "end": 2077.9199999999996}, {"text": " paralelo, porque quedan paralelo pero apuntando para el otro lado, o sea, conduciendo corriente", "start": 2077.9199999999996, "end": 2082.68}, {"text": " para el otro lado, queda en anti paralelo con el transistor mos.", "start": 2082.68, "end": 2088.04}, {"text": " O sea que los transistores mos discretos le vienen cayendo, ya padiamos un diodo en", "start": 2088.04, "end": 2096.8}, {"text": " anti paralelo intrínsecamente, digamos.", "start": 2096.8, "end": 2105.6}, {"text": " Que es algo que hay que tener en cuenta que está ahí, porque si le ponemos tensiones", "start": 2105.6, "end": 2110.2799999999997}, {"text": " tales que pueda conducir, va a conducir, eso a veces molesta, a veces ayuda.", "start": 2110.2799999999997, "end": 2116.56}, {"text": " Ya hemos ahí circuitos, pues empecé a circuitos de la ectónica potencia que usan mucho", "start": 2116.56, "end": 2120.96}, {"text": " el diodo en anti paralelo, que saben que está ahí, y el circuito está pensado para que", "start": 2120.96, "end": 2124.56}, {"text": " en ciertos momentos el diodo conduzca y haga algo útil en el circuito.", "start": 2124.56, "end": 2130.88}, {"text": " Bueno, entonces cuando, cuando hablemos de un transistor en hemos de ahora en elante,", "start": 2130.88, "end": 2145.2799999999997}, {"text": " vamos a representarlo de alguna de estas formas, usualmente de la segunda, pero también", "start": 2145.28, "end": 2152.2400000000002}, {"text": " a veces de la tercera.", "start": 2152.2400000000002, "end": 2153.7200000000003}, {"text": " Bueno, si no hay preguntas hasta acá, vamos a ver un ejemplo antes de ver el transistor", "start": 2175.28, "end": 2192.1200000000003}, {"text": " en hemos como llave, que es bastante típico, que es, supongamos que tengamos este circuito,", "start": 2192.12, "end": 2216.1}, {"text": " o sea que queremos usar el transistor en hemos como driver digamos para manejar un led.", "start": 2216.1, "end": 2238.46}, {"text": " Ya a veces los leds, un led, podías un red let, también sería un ejemplo similar,", "start": 2238.46, "end": 2247.78}, {"text": " requiere una corriente, hoy en día hay led de menor corriente, pero bueno, sin que", "start": 2247.78, "end": 2251.46}, {"text": " hablarse y hablamos de los leds que se usan para iluminación, pero mismo los leds que", "start": 2251.46, "end": 2255.86}, {"text": " se usan como indicadores, hoy en día hay con menos corriente que se prenden bien con", "start": 2255.86, "end": 2260.5}, {"text": " unos par de miliamperts, pero lo tradicional de que prisaba más o menos 10 miliamper.", "start": 2260.5, "end": 2265.26}, {"text": " Y si es un led para iluminación, va a ser más o, pero hay algún ejemplo, tiene un ejemplo", "start": 2265.26, "end": 2272.9}, {"text": " en el práctico, pero digamos, en muchos casos yo quiero manejar ese dispositivo y esa corriente", "start": 2272.9, "end": 2279.86}, {"text": " es demasiado para que la de el circuito, por ejemplo un circuito lógico que decide si el", "start": 2279.86, "end": 2285.02}, {"text": " led se tiene que prender o no, no puede dar esa corriente. Entonces imaginemos que acá", "start": 2285.02, "end": 2291.18}, {"text": " tenemos una señal lógica entre 0 voltios y 5 voltios que trata de decirme cuando tengo", "start": 2291.18, "end": 2299.06}, {"text": " que prender el led y cuando lo quiero apagar, acá tenemos también la misma tensión de", "start": 2299.06, "end": 2305.38}, {"text": " alimentación, VDD, digamos que fueran 5 voltios y la idea es bueno que nuestro transistormos", "start": 2305.38, "end": 2316.1800000000003}, {"text": " no actúe como llave, controlada por esta tensión para prender y apagar el led. Tenemos digamos", "start": 2316.1800000000003, "end": 2327.94}, {"text": " los datos del transistormos, me gusta, ya mismo le, por una vez para recordarles ya que recién", "start": 2327.94, "end": 2336.86}, {"text": " lo estamos empezando a usar, este es el gate, este va a ser el drain, porque digamos, el", "start": 2336.86, "end": 2343.82}, {"text": " va a ser que va a estar a más tensión de los dos, además acá tenemos, aquí en acá tenemos", "start": 2343.82, "end": 2351.94}, {"text": " la sur, si acá tenemos el sustrato que están interconectuelos, están a tierras. Y bueno y tenemos", "start": 2351.94, "end": 2363.64}, {"text": " los datos del transistor, tenemos que es que tiene un VT0 de 1 con 5 voltios, tiene un VT de 0", "start": 2363.64, "end": 2374.02}, {"text": " 1 ampere por volcuadgado, o sea 100 miliamper cada volcuadgado, porque digamos acá se ve bien", "start": 2374.02, "end": 2384.18}, {"text": " claro que las relaciones, el VT es una relación de corriente y cuadrado de la tensión, cuando esto", "start": 2384.18, "end": 2390.6}, {"text": " vale un voltio, lo que está en todo el paréntesis, o sea esto vale un volcuadgado y entonces con ese", "start": 2390.6, "end": 2397.38}, {"text": " VT, me daría 100 miliamper de corriente del transistor, perdón 100 miliamper no porque hay que", "start": 2397.38, "end": 2403.4}, {"text": " decirlo entre dos por uno más del, bueno eso es lo que refiere al transistor, buena idelta,", "start": 2403.4, "end": 2412.26}, {"text": " vale 0 con mátales y el LED, vamos a suponer que tiene una tensión de LED de 1,4 voltios a", "start": 2413.62, "end": 2424.02}, {"text": " 1,10 miliamper y lo que queremos allá sería cuánto tiene que valer RD, tal que", "start": 2424.02, "end": 2435.58}, {"text": " el diodo se encienda con 10 miliamper", "start": 2441.42, "end": 2444.06}, {"text": " lo primero siempre lo ideal inicialmente es entender cuál es la idea del circuito, si como funciona el", "start": 2485.02, "end": 2494.06}, {"text": " circuito, en particular cuando conduce el LED y cuando no conduce el LED,", "start": 2494.06, "end": 2501.9}, {"text": " y os sabemos que la entrada de lo que comanda a nuestro circuito, o sea la entrada de la", "start": 2514.9, "end": 2521.14}, {"text": " tensión acá en el gate es una tensión que varía entre, señal lógica digamos que varía", "start": 2521.14, "end": 2527.82}, {"text": " entre 0 y 5 voltios, cuando va conducir el LED, cuando VGATE se acero, cuando sea 5 voltios,", "start": 2527.82, "end": 2535.86}, {"text": " o sea 5 está bien porque", "start": 2536.86, "end": 2538.38}, {"text": " no, digo VGATE que es ser grande pero no mayor a quien tiene que ser VGATE que conduzca.", "start": 2545.86, "end": 2552.54}, {"text": " En los dos casos en el transistor conduce sean zona lineal o sea saturado, VG es mayor que", "start": 2552.54, "end": 2566.82}, {"text": " VGATE 0 más 1 más delta o sea tiene que ser suficiente en el grande para que se forme el canal y para", "start": 2566.82, "end": 2572.18}, {"text": " el transistor conduzca. Si VG es 0, vamos a estar más bien en esta situación que VG es menor que", "start": 2572.18, "end": 2579.2599999999998}, {"text": " el dio a KBS vale 0 o sea que el 1 más delta por VS no juega, VS es VSB, o sea V está conectado", "start": 2579.98, "end": 2590.26}, {"text": " el azur con el drain o sea que con el azur con el sustrato o sea que VSB es igual a 0,", "start": 2590.26, "end": 2595.5400000000004}, {"text": " entonces en realidad el transistor va a conducir cuando le pongo, puede conducir,", "start": 2598.0600000000004, "end": 2605.26}, {"text": " y cuando le pongo 5 volt en el gate, en realidad va a conducir porque el VT0 es más chico que 5 voltios,", "start": 2605.26, "end": 2611.6600000000003}, {"text": " está correcto, y cuando le pongo a 0 en el gate el transistor va a estar cortado,", "start": 2611.6600000000003, "end": 2617.6600000000003}, {"text": " entonces bueno cheque dio, hagamos eso un poquito más formalmente,", "start": 2617.6600000000003, "end": 2621.6200000000003}, {"text": " si está conectado el sustrato VS va a ser 0, entonces ahí se van 2, si todos los términos que", "start": 2621.62, "end": 2639.94}, {"text": " se llaman VS son 0 y se van, y delta no juega, bueno del tan realidad juega si cuando estás en", "start": 2639.94, "end": 2647.06}, {"text": " saturación que te aparece acá digamos, bueno también son alinial si conciélase este término", "start": 2647.06, "end": 2652.22}, {"text": " también juega multiplicando. VG tiene ese mayor que VT0, exactamente, entonces veamos", "start": 2652.22, "end": 2663.66}, {"text": " primero el primer caso que VG es igual a 0, recordemos esto no lo está escribiendo otra vez,", "start": 2663.66, "end": 2669.74}, {"text": " pero cuando hablamos en estas cuestiones de VG, VG, bueno, podría podremos recordarlo allá,", "start": 2669.74, "end": 2673.7799999999997}, {"text": " más bien me dejarcillo, todos estas ecuaciones quiere decir que VG estamos hablando de VG,", "start": 2673.78, "end": 2684.86}, {"text": " VS estamos hablando de VS y VD estamos hablando de VB, entonces VG que es VG, VG, VS tierra,", "start": 2684.86, "end": 2698.34}, {"text": " 0, cuando consigamos VG igual a 0, VS también es 0, porque VY se conectados.", "start": 2699.06, "end": 2711.1400000000003}, {"text": " Y entonces bueno el transistor al igual que los diodos por ejemplo cuando consideran los diodos", "start": 2715.6200000000003, "end": 2721.9}, {"text": " con un modelo en partes tenemos una, tenemos ecuaciones según la región, entonces se trabaja", "start": 2722.62, "end": 2734.34}, {"text": " igual que con los diodos, yo supongo que estoy en cierta zona, resuelvo el circuito y veo después", "start": 2734.34, "end": 2741.3}, {"text": " verificos si estoy en esa zona efectivamente, entonces en este caso, se llena en mi potes y", "start": 2741.3, "end": 2751.6200000000003}, {"text": " sería que M1 está cortado y esto se va a cumplir si VG es menor que VT0, porque V es", "start": 2751.6200000000003, "end": 2766.6200000000003}, {"text": " valecero y bueno, esto efectivamente se cumple porque esto es 1,5 voltios y esto es 0, entonces", "start": 2766.62, "end": 2780.2999999999997}, {"text": " id valecero id que es la corriente de drain que es igual a la corriente del led, pues tan en", "start": 2782.2999999999997, "end": 2790.7799999999997}, {"text": " serie, es igual a 0, entonces el led va a estar apagado, ahí esa es la parte fácil del ejercicio,", "start": 2790.78, "end": 2806.98}, {"text": " ahora bien la parte interesante que es cuando entonces ponemos VG igual 5 voltios,", "start": 2821.34, "end": 2832.94}, {"text": " que ahí queremos que el transistor conduzca para que pase corriente y el led se prenda, es más", "start": 2835.1000000000004, "end": 2841.3}, {"text": " lo que queremos es que el led se prenda con los 10 miliamperques, no se especifica la hoja de datos", "start": 2841.3, "end": 2846.5400000000004}, {"text": " para tener cierta luminosidad, este o sea queremos que cuando te pongas 5 voltios en el gate,", "start": 2846.54, "end": 2853.42}, {"text": " el transistor, la corriente de drain sean esos 10 miliamperques y lo que tenemos la si quieren", "start": 2853.42, "end": 2862.1}, {"text": " el grabo libertad que tenemos es cuánto tiene que valer la tensión RD, entonces acá si uno quiere", "start": 2862.1, "end": 2876.18}, {"text": " uno puede ver que ya como VS es igual a 0, este término no está o sea que VG es mayor que VT0,", "start": 2876.18, "end": 2883.5}, {"text": " VG es mayor que VT0, o sea que en realidad las condiciones para que el transistor conduzca", "start": 2883.5, "end": 2888.3799999999997}, {"text": " están, la duda que nos puede quedar o la duda que nos quedaría sería si va a conducir en zona", "start": 2888.3799999999997, "end": 2899.1}, {"text": " lineal o va a conducir en saturación o si lo podemos hacer conducir en zona lineal o lo", "start": 2899.1, "end": 2905.22}, {"text": " podemos hacer conducir en saturación o si lo debemos hacer conducir en zona lineal o si lo", "start": 2905.22, "end": 2910.22}, {"text": " debemos hacer conducir en saturación al elegir el valor de RD.", "start": 2910.22, "end": 2913.22}, {"text": " ¿Y qué les parece ahí alguna idea de qué conviene o cómo, ¿por qué son al", "start": 2919.22, "end": 2925.92}, {"text": " lineal por qué es saturación?", "start": 2925.92, "end": 2927.84}, {"text": " VG es mayor que VT0, entonces M1 conduce.", "start": 2927.84, "end": 2939.76}, {"text": " Está bien, exisaturio no, está perfecto, va a depender de cómo es el VD respecto al VPingChoff.", "start": 2939.76, "end": 2964.88}, {"text": " Eso cierto, se va a hacer un dato que nos va a lo vamos a apreizar, VPingChoff es VG menos", "start": 2965.88, "end": 2972.32}, {"text": " VT0 sobre 1 más delta, creo que lo tengo 8 la cuenta por ahí, terminando, terminando,", "start": 2972.32, "end": 2984.6800000000003}, {"text": " 2,7 voltios, o sea esto es 3,5 dividido, o sea 5 menos 1 con 5 dividido 1,3.", "start": 2984.68, "end": 2998.7999999999997}, {"text": " Entonces, dependiendo de si la atención acá es mayor o menor a 2,7 voltios cuando", "start": 2998.8, "end": 3013.6400000000003}, {"text": " si cuito está funcionando, el transistor va a estar en saturación o va a estar en zona", "start": 3013.6400000000003, "end": 3020.5600000000004}, {"text": " al lineal. Y en efectiva, eso va a depender de valor de RD que elijamos, si el valor", "start": 3020.56, "end": 3041.4}, {"text": " de RD que elegimos es grande, la caída va a ser más grande de atención y esta atención", "start": 3041.4, "end": 3046.04}, {"text": " va a ser más baja y va a estar y lo va a poder ser menor que Pinchoff si el RD es chico,", "start": 3046.04, "end": 3053.56}, {"text": " en un esteremo si el RD fuera 0, ¿cuánto quedaría la atención acá? 5 menos la caída", "start": 3053.56, "end": 3063.8}, {"text": " en el diodo que es 1 con 4, o sea que 5 menos 1 con 4 son 3,5 más edas y que es más", "start": 3063.8, "end": 3070.0}, {"text": " grande que esto, o sea si el RD es muy chiquito, teniendo a 0 digamos hay un momento", "start": 3070.0, "end": 3074.84}, {"text": " de encipar a cierto RD esto podría estar saturado. A la pregunta de punto como diseñadores", "start": 3074.84, "end": 3080.88}, {"text": " que nos conviene hacer lo que estén saturación o no hacer los que estén en zona al lineal.", "start": 3080.88, "end": 3085.44}, {"text": " Hay una diferencia, va a haber una diferencia más cierta y diferencia importante.", "start": 3085.44, "end": 3097.1200000000003}, {"text": " El consumo en realidad si cumplimos lo que nos pidió nuestro cliente o nuestro compañero", "start": 3097.1200000000003, "end": 3103.28}, {"text": " o nuestro jefe o que nosotros mismos lo sabemos, va a ser 10 miliamper cuando le de", "start": 3103.28, "end": 3108.32}, {"text": " este funcionando. El tema es ¿cuánto va a valer la corriente si elegimos que el transistor", "start": 3108.32, "end": 3123.0}, {"text": " estén saturación? Esta expresión que está acá que depende únicamente de VG, o sea que", "start": 3123.0, "end": 3132.6400000000003}, {"text": " digamos si elegimos que esté saturada la corriente está, para este transistor está", "start": 3132.64, "end": 3139.8799999999997}, {"text": " y esta tensión de gate va a lecierto valor que capaz de casualidad a 10 miliamper pues sería", "start": 3139.8799999999997, "end": 3146.2799999999997}, {"text": " como una gran casualidad, no pueden ser 10 miliamperos, puede ser cualquier otra cosa,", "start": 3146.2799999999997, "end": 3150.0}, {"text": " podemos hacer la cuenta pero va a ser más que, va a ser bastante más que 10 miliamper", "start": 3150.0, "end": 3157.16}, {"text": " o sea que en realidad si elegimos que esté saturado la corriente va a estar terminada por", "start": 3157.8799999999997, "end": 3163.12}, {"text": " la tensión de gate y por el transistor. Lo cual no es del todo bueno porque también quiere decir", "start": 3163.12, "end": 3171.48}, {"text": " que cuando este varíe por ejemplo el beta, el transistor o el vete cero, el transistor o", "start": 3171.48, "end": 3176.68}, {"text": " el delta, el transistor esa corriente va a cambiar. Es decir no va a ser una corriente", "start": 3176.68, "end": 3181.3199999999997}, {"text": " que nosotros podamos fijar con demasiada precisión y además puede pasar que devuelta que con", "start": 3181.32, "end": 3187.96}, {"text": " los 5V que tenemos la entrada, que eso digamos que está impuesto por el circuito anterior,", "start": 3187.96, "end": 3191.88}, {"text": " este transistor nos da una corriente que nos sirva. Entonces en este circuito la idea más", "start": 3191.88, "end": 3200.2400000000002}, {"text": " bien es en general es que el transistor funcione como llave, es decir que lo que haga idealmente", "start": 3200.2400000000002, "end": 3207.4}, {"text": " sería que fuera un corto circuito, esto no va a ser un corto circuito, va a ser una resistencia", "start": 3207.4, "end": 3211.36}, {"text": " pequeña que vimos acá como se calculaba y entonces si esto cuando lo pondo lo hago conducir", "start": 3211.36, "end": 3218.44}, {"text": " está en zona lineal con una caída tensión pequeña acá como una resistencia pequeña,", "start": 3218.44, "end": 3224.4}, {"text": " básicamente quien me va a determinar la corriente por el LED se redé, que entonces ahí redé", "start": 3224.4, "end": 3230.7200000000003}, {"text": " si le alijo con poca tolerancia o voy a tener poca tolerancia la corriente por el LED,", "start": 3230.72, "end": 3236.52}, {"text": " este voy a tener buen control de mi diseño. Entonces básicamente la idea es que tratar de", "start": 3236.52, "end": 3245.72}, {"text": " trabajar en zona lineal. Bien, entonces aquí estamos borremos la saturación que", "start": 3245.72, "end": 3263.24}, {"text": " no lo vamos a usar en este ejercicio, así podemos espacio para seguir por acá.", "start": 3263.24, "end": 3270.7999999999997}, {"text": " Entonces podemos usar la ecuación del transistor en zona lineal, esta ecuación que va", "start": 3270.8, "end": 3298.36}, {"text": " a hacer una ecuación cuadratica con la tensión BD, si usamos esa la ecuación completa", "start": 3298.36, "end": 3306.6}, {"text": " esta, Dios se puede hacer pero va a quedar un poco espeso en cuentas la cosa, no va a", "start": 3306.6, "end": 3314.28}, {"text": " quedar más citrivial en cuentas, es más podemos sin embargo decir buenos, tal vez podemos", "start": 3314.28, "end": 3324.1600000000003}, {"text": " garantizar de que la tensión está BD que yo tengo acá, se asuficientemente chica como", "start": 3324.16, "end": 3330.64}, {"text": " para que se cumpla esta condición y entonces el transistor se va a comportar simplemente", "start": 3330.64, "end": 3338.3999999999996}, {"text": " como una resistencia de este valor. Entonces arranquemos viendo este valor cuanto es para", "start": 3338.3999999999996, "end": 3344.04}, {"text": " ver si es grande si es chico y si sabemos que por acá van a pasar 10 miliamper, si yo sé", "start": 3344.04, "end": 3349.52}, {"text": " que la resistencia tengo acá, sé cuanto va a valer BD. Entonces, sigue en nuestra hipote", "start": 3349.52, "end": 3356.0}, {"text": " si sé que estoy en zona lineal y que lo puedo y que tengo una reón.", "start": 3356.0, "end": 3369.7599999999998}, {"text": " Una reón que es uno sobre beta por BG menos beta 0, o sea que esta reón en definitiva,", "start": 3379.52, "end": 3393.12}, {"text": " en este ejemplo sería uno sobre 0,1 ampere, o sea 0,1, digamos si estamos hablando,", "start": 3393.12, "end": 3405.24}, {"text": " el Tiosiampere, es como un ampere por lo cuadrado, por BG menos beta 0 que 5 menos 1", "start": 3405.24, "end": 3414.8399999999997}, {"text": " con 5 y esto termina dando 2,9 omios. Que no es un valor extraño para un transistor", "start": 3414.8399999999997, "end": 3430.56}, {"text": " discreto que se va a usar como llave, hay transistores mos que dan algunas decenas de omios", "start": 3430.56, "end": 3436.7999999999997}, {"text": " cuando están prendidos con su tensión nominal, hay transistores mos que dan miliamios incluso", "start": 3436.7999999999997, "end": 3444.68}, {"text": " o unos pocos miliamios para pacícitos más de potencia, o sea que unos pocos omios no", "start": 3444.68, "end": 3451.36}, {"text": " es un valor extraño para un transistor discreto. Entonces, si reón son 2,9 omios,", "start": 3451.36, "end": 3462.32}, {"text": " entonces cuanto vale la atención en el drain del transistor.", "start": 3462.32, "end": 3478.1200000000003}, {"text": " ¿Te acorriente que queremos ser 10 miliamper?", "start": 3478.12, "end": 3480.4}, {"text": " No, sigue en BD, Arroba, ID igual 10 miliamper, es igual a la multiplicación más bien,", "start": 3480.4, "end": 3499.64}, {"text": " sería reón por ID, que son 2,9 omios, por 10 miliamper, esto me da 29 mili voltes.", "start": 3499.64, "end": 3520.68}, {"text": " Y esos 29 mili voltios, uno tendría que ver si efectivamente entonces son despreciables", "start": 3520.68, "end": 3526.92}, {"text": " acá para que me quede, para que pueda usar la hipótesis y de que esto se comporta", "start": 3526.92, "end": 3532.6800000000003}, {"text": " básicamente como una resistencia. O dicho, de otra forma, si son despreciables frente", "start": 3532.6800000000003, "end": 3540.84}, {"text": " a la atención de pinchofes o de manera de mirarlo, pero Dios, y eso efectivamente se va", "start": 3540.84, "end": 3548.0}, {"text": " a dar, digamos, no sea que...", "start": 3548.0, "end": 3556.68}, {"text": " de sobredo por uno más delta.", "start": 3556.68, "end": 3584.7999999999997}, {"text": " Y ahora lo que está viendo es que este término acá, que vese el ser o ahora en el caso", "start": 3584.8, "end": 3589.34}, {"text": " estamos trabajando, se va mucho más chico que este, en manera que lo podamos despreciar", "start": 3589.34, "end": 3592.86}, {"text": " y quedarnos con la expresión de las fíjense que esta condición es que definitiva lo que", "start": 3592.86, "end": 3602.6400000000003}, {"text": " estamos pidiendo es que Vd sea mucho menor que 2 por Vg menos Vt0 sobre 1 más delta.", "start": 3602.6400000000003, "end": 3612.3}, {"text": " Ya estamos pidiendo que vedece a mucho menor que dos veces la tensión de pinchof.", "start": 3612.3, "end": 3619.0600000000004}, {"text": " Muchas veces en realidad simplemente lo uno lo que mira es que vedece a mucho menor que", "start": 3619.0600000000004, "end": 3622.9}, {"text": " la tensión de pinchof y listo de lo que muchas veces se verifica, porque bueno es una", "start": 3622.9, "end": 3626.6200000000003}, {"text": " condición más fuerte que esta y que también nos sirve.", "start": 3626.6200000000003, "end": 3635.86}, {"text": " Tan todos de acuerdo hasta acá.", "start": 3635.86, "end": 3638.6600000000003}, {"text": " Entonces resumen, trabajar en zona de saturación no nos sirve porque la corriente que impuesta", "start": 3638.66, "end": 3643.7}, {"text": " por el transistor para un bejelado, tratamos de trabajar más bien en zona lineal, en", "start": 3643.7, "end": 3650.46}, {"text": " zona lineal, uno te puede usar la ecuación parabólica con el vede cuadrado y el vede,", "start": 3650.46, "end": 3658.54}, {"text": " pero eso complica las cosas, en general cuando notas a la insana lineal te trata de trabajar", "start": 3658.54, "end": 3662.8999999999996}, {"text": " contra vede igual 0, o sea con caídas pequeñas en transistor y en ese caso es más fácil", "start": 3662.8999999999996, "end": 3668.14}, {"text": " no lo modela como una resistencia y simplemente hay que verificar que esté con un vede", "start": 3668.14, "end": 3672.7799999999997}, {"text": " suficientemente pequeño, que en este caso se cumple.", "start": 3672.7799999999997, "end": 3677.5}, {"text": " Bien y bueno y ahora pasa a hacer un ejercicio de teoría circuitos muy sencillito, ¿no?", "start": 3677.5, "end": 3682.7799999999997}, {"text": " Esto tiene que valer a redé.", "start": 3682.78, "end": 3704.5}, {"text": " Tal vez podemos expresiar el vede pues son 29 mili voltios frente a 5 voltios menos 1 con", "start": 3704.5, "end": 3711.1000000000004}, {"text": " 4, o sea no es una manera o si no uno hace las cuentas teniendo en cuenta la redé", "start": 3711.1, "end": 3715.54}, {"text": " pero estamos acuerdos que sí que la redé, perdón el vede, estamos acuerdos que el vede", "start": 3715.54, "end": 3722.46}, {"text": " es despreciable digamos.", "start": 3722.46, "end": 3729.14}, {"text": " Lo podemos, la ecuación es exacta para que no pende dudas pero podemos despreciar", "start": 3729.14, "end": 3733.94}, {"text": " pues ahí despreciamos el, o sea redé en definitiva va a ser este vede menos vede, menos", "start": 3733.94, "end": 3745.02}, {"text": " vede sobre id que queremos que sea 10 miliamper.", "start": 3745.02, "end": 3754.86}, {"text": " Estos son 5 voltios, estos son 1 con 4 voltios, estos son 29 mili voltios, o sea que", "start": 3754.86, "end": 3761.66}, {"text": " como si también por ahí lo podemos despreciar tranquilamente y entonces nos queda una redé", "start": 3761.66, "end": 3772.42}, {"text": " en realidad, si despreciamos que a 360 ohm sin despreciar que a 360 ohm menos los tres", "start": 3772.42, "end": 3784.3799999999997}, {"text": " son del transistormos queda 357 ohm pero bueno en realidad es va a ser 360 ohm.", "start": 3784.38, "end": 3794.94}, {"text": " Si, ¿qué pasa si le ocurriendo el vede de la red?", "start": 3794.94, "end": 3798.46}, {"text": " ¿Cómo?", "start": 3798.46, "end": 3799.46}, {"text": " ¿Qué pasa si le ocurriendo el vede de la red?", "start": 3799.46, "end": 3804.1400000000003}, {"text": " Ah y con el red simplemente pasa que prende maso que prende menos, digamos si seguís", "start": 3804.1400000000003, "end": 3809.94}, {"text": " subiendo un momento romper pero dio abrillar mas y si le pude menos corriente, abrillar", "start": 3809.94, "end": 3815.2200000000003}, {"text": " menos, normalmente los fabricantes en la hoja de datos te dicen, este LED está pensado", "start": 3815.2200000000003, "end": 3821.34}, {"text": " para trabajar con 10 miliamper entonces uno sabe que si le pone 10 miliamper tiene la luminosidad", "start": 3821.34, "end": 3826.46}, {"text": " nominal que quieren el LED.", "start": 3826.46, "end": 3828.34}, {"text": " ¿Tú también es la poca o vean?", "start": 3828.34, "end": 3830.18}, {"text": " Está bien, es cierto el 1 con 4 voltios va a tener su dispersión y eso me va a alterar", "start": 3830.18, "end": 3836.9}, {"text": " un poco, pero justamente ese cambio de 100 lia en vez de 10 miliamperten o 9 o 11 va", "start": 3836.9, "end": 3843.02}, {"text": " a ser que brillen un poquito más o que brillen un poquito más.", "start": 3843.02, "end": 3850.2200000000003}, {"text": " No, no preguntamos mucha precisión en esto, digo tratar de ver bueno, más o menos que", "start": 3850.2200000000003, "end": 3854.14}, {"text": " resistencia elegimos para poner acá, después mas si, después no tiene una resistencia", "start": 3854.14, "end": 3858.5}, {"text": " estándar que a mí me apoyen de 390 ohm o no sé, 270 o 390 o 330, serían las que están", "start": 3858.5, "end": 3866.3}, {"text": " cerca de ahí bien, bien, alguna otra pregunta, bueno muy bien, bueno veamos otro ejercicio,", "start": 3866.3, "end": 3895.42}, {"text": " otro ejemplo ahora usando el transistor en saturación.", "start": 3895.42, "end": 3898.82}, {"text": " Bueno, bueno, bueno, bueno, bueno, bueno, bueno, bueno, bueno, bueno, bueno, bueno, bueno,", "start": 3925.42, "end": 3947.14}, {"text": " bueno, bueno, bueno, bueno, bueno, bueno, bueno, bueno, bueno, bueno, bueno, bueno,", "start": 3947.14, "end": 3968.8599999999997}, {"text": " bueno, bueno, bueno, bueno, bueno, bueno, bueno, bueno, bueno, bueno, bueno, bueno,", "start": 3968.86, "end": 3990.58}, {"text": " bueno, bueno, bueno, bueno, bueno, bueno, bueno, bueno, bueno, bueno, bueno, bueno, bueno, bueno, bueno, bueno, bueno, bueno, bueno, bueno, bueno, bueno, bueno, bueno, bueno, bueno, bueno, bueno, bueno, bueno, bueno, bueno, bueno, bueno, bueno, bueno, bueno, bueno, bueno, bueno, bueno, bueno, bueno, bueno, bueno, bueno, bueno, bueno, bueno, bueno, bueno, bueno, bueno, bueno, bueno, bueno, bueno, bueno, bueno, bueno, bueno, bueno, bueno, bueno, bueno, bueno, bueno, bueno, bueno, bueno, bueno, bueno, bueno, bueno, bueno, bueno, bueno, bueno, bueno, bueno, bueno, bueno, bueno, bueno, bueno, bueno, bueno, bueno, bueno, bueno, bueno, bueno, bueno, bueno, bueno, bueno, bueno, bueno, bueno, bueno, bueno, bueno, bueno, bueno, bueno, bueno, bueno, bueno, bueno, bueno, bueno", "start": 3990.58, "end": 4020.58}, {"text": " que le dije Arduino.Muchas gracias por esta 불icia.", "start": 4020.58, "end": 4029.58}, {"text": " que es como el punto de partida para después aplicarle una señal, pequeña señal variable", "start": 4050.58, "end": 4056.38}, {"text": " que ese transistor va amplificar. En breve vamos a pasar a ver el uso del transistor", "start": 4056.38, "end": 4063.46}, {"text": " como amplificador y van a ver que cuando hacemos un amplificador con transistores, lo primero", "start": 4063.46, "end": 4068.9}, {"text": " es asegurarse que esté trabajando bien en la zona de saturación y luego entonces variar", "start": 4068.9, "end": 4075.1}, {"text": " en torno a ese punto con la señal que queremos amplificar. Entonces por ahora está", "start": 4075.1, "end": 4081.46}, {"text": " un continuo y tenemos ese circuito y queremos ver en ese circuito saber calcular cuánto vale", "start": 4081.46, "end": 4089.42}, {"text": " la corriente por el transistor. Y bueno, vamos a tomar como hipótesis de que el transistor", "start": 4089.42, "end": 4095.3399999999997}, {"text": " está saturado y podemos dar que verificar que el hipótesis es correcta. Podría no estar", "start": 4095.34, "end": 4113.74}, {"text": " lo pero digo sabemos que es una hipótesis razonable para lo que está hecho el circuito es para", "start": 4113.74, "end": 4122.58}, {"text": " entonces fijar el transistor funcionando en un punto en la zona de saturación. Bien, entonces", "start": 4123.46, "end": 4134.22}, {"text": " si sabemos que está en saturación, sabemos cómo es la recorredemos cómo es la ecuación del", "start": 4138.22, "end": 4144.1}, {"text": " transistor en saturación y de la beta sobre 2 por 1 más delta por VG menos VT0 menos 1 más delta", "start": 4144.1, "end": 4155.46}, {"text": " por VS al cuadrado y las condiciones para que esto pasara era que VG tiene que ser mayor que VT0", "start": 4155.46, "end": 4163.46}, {"text": " más 1 más delta por VS que era la condición para que el transistor conduzca básicamente y la", "start": 4163.46, "end": 4170.740000000001}, {"text": " condición para que estén saturaciones que la tensión de dragin tiene que ser mayor que la", "start": 4170.74, "end": 4174.66}, {"text": " tensión de pinchof o sea VG mayor que VD mayor que VG menos VT0 sobre 1 más delta. O sea que sabemos", "start": 4174.66, "end": 4185.5}, {"text": " que tenemos estas ecuaciones para nuestro transistor. O esta ecuación y estas condiciones que", "start": 4185.5, "end": 4197.42}, {"text": " vamos a dar que verificar. Bueno, ¿cómo hacemos? Que calculamos primero.", "start": 4197.42, "end": 4217.3}, {"text": " Puede tal vez calcular VG. Sí, creo que VG les están llamando a lo que uno llamaría VG pero", "start": 4217.3, "end": 4232.06}, {"text": " digamos acá tenemos el cuidado con los nombres, a qué les están llamando VG. La tensión en el", "start": 4232.06, "end": 4241.46}, {"text": " GATE respecto a quién. Lo que acá se llama VG es VGB y lo que llamamos VS es VGB y acá es", "start": 4241.46, "end": 4261.86}, {"text": " 0. Pero digo pero está bien que lo que podemos calcular muy fácilmente es la tensión de este", "start": 4263.86, "end": 4270.62}, {"text": " punto para que no haya confusión, vamos a llamarle VGG por ejemplo, la tensión entre acá y acá", "start": 4270.62, "end": 4279.74}, {"text": " que cuánto va esa tensión. Cuatro con cinco o sea vale en VDD y VD2 porque estas", "start": 4279.74, "end": 4287.82}, {"text": " dos restencias son iguales porque en su característica importante, en transistormos que", "start": 4287.82, "end": 4293.46}, {"text": " continúa y abajo frecuencia, digamos, tenemos una capacidad acá entre el GATE y el canal, no tenemos", "start": 4294.18, "end": 4301.82}, {"text": " conexión directa, digamos, o sea que esta corriente llamamos el IG es 0, o sea acá tenemos un divisor", "start": 4301.82, "end": 4308.58}, {"text": " resistivo perfecto y sabemos que entonces VGG es VDD por R1 sobre R1 más R2 que es 4,5", "start": 4308.58, "end": 4320.86}, {"text": " bonilla, perfecto, tenemos la tensión en este punto y como observábamos recién, ahí va entre", "start": 4321.38, "end": 4336.099999999999}, {"text": " acá y acá yo tengo una tensión que le podría llamar VGS si quieren, destrictamente la tensión", "start": 4336.099999999999, "end": 4343.099999999999}, {"text": " entre GATE y SURS o también es la tensión entre GATE y sus tratos porque están conectados la", "start": 4343.099999999999, "end": 4350.139999999999}, {"text": " SURS y el SURS trato y entonces ¿qué ecuación podemos plantear ahora para tratar de resolver", "start": 4350.14, "end": 4361.22}, {"text": " el circuito?", "start": 4361.22, "end": 4362.9400000000005}, {"text": " pues te da la corriente por el RES de qué manera digamos?", "start": 4363.94, "end": 4375.74}, {"text": " es la corriente por el transistor, y básicamente por acá sabemos que pasa la corriente LID y entonces", "start": 4378.5, "end": 4387.54}, {"text": " en definitiva tenemos por un lado tenemos esta especie de Maya, cada día vamos, Especie", "start": 4387.54, "end": 4395.58}, {"text": " no, esa Maya que nos dice que VGG la tensión entre acá y acá es la tensión entre acá y acá que es", "start": 4395.58, "end": 4407.82}, {"text": " VGS o VGB como le querramos llamar o llamarles VGB, lo que nosotros venimos llamando VG más la caída", "start": 4407.82, "end": 4424.42}, {"text": " que es RES por ID, entonces si sustituimos, por un lado diatos lo habitual digamos cuando uno", "start": 4424.42, "end": 4434.98}, {"text": " resuelve circuitos con dispositivos por un lado tiene una ecuación que viene el dispositivo, o", "start": 4434.98, "end": 4442.0199999999995}, {"text": " sea por cómo es el diodo, por cómo es el transistor o como es la resistencia y después tiene una", "start": 4442.0199999999995, "end": 4447.179999999999}, {"text": " ecuación que viene del resto del circuito, o sea esta es la que viene del resto del circuito,", "start": 4447.179999999999, "end": 4451.74}, {"text": " o sea del circuito donde ese dispositivo está inserto y después tenemos la ecuación del dispositivo", "start": 4451.74, "end": 4459.0199999999995}, {"text": " que es esta, entonces usamos la ecuación del transistor, usando la ecuación del transistor", "start": 4459.02, "end": 4477.14}, {"text": " en saturación nos termina quedando que VG es igual a VG más RES por VT sobre 2 por 1 más delta", "start": 4477.14, "end": 4491.02}, {"text": " por VG menos VT0 menos 1 más delta por VS al cuadrado, esto sería el caso general", "start": 4492.3, "end": 4503.02}, {"text": " VG si te vas a pasar a día allá es lo que acá ya vamos VG es siempre VG", "start": 4503.02, "end": 4509.660000000001}, {"text": " si quieren pongámosle VGV para que no haya luz, ya te pongamosle VG", "start": 4517.820000000001, "end": 4524.660000000001}, {"text": " entonces de esa ecuación saldría nuestra solución y bueno y como ven ahí algo que ocurre", "start": 4524.66, "end": 4535.0199999999995}, {"text": " habitualmente con los muchas veces no siempre pero casi siempre una área siempre a veces se", "start": 4535.0199999999995, "end": 4541.0199999999995}, {"text": " resobre más fácil a veces hay que resolver la ecuación con un transistor en saturaciones que", "start": 4541.0199999999995, "end": 4545.98}, {"text": " como la dependencia corriente de tensiones cuadráticas no ha notido una termina en una ecuación de", "start": 4545.98, "end": 4553.62}, {"text": " segundo grado donde termina termina se en VG cuadrado y termina se en VG", "start": 4553.62, "end": 4558.38}, {"text": " entonces bueno veamos en nuestro caso tenemos que delta valesero que VB valesero porque están", "start": 4562.82, "end": 4570.22}, {"text": " conectados sursis sus tratos o sea la ecuación se simplifica un poquito pero en definitiva", "start": 4570.22, "end": 4576.099999999999}, {"text": " nos termina quedando VG igual a VGV más RSS por VG sobre 2 por VGV menos VT0 al cuadrado", "start": 4583.62, "end": 4605.62}, {"text": " entonces nos queda una ecuación de segundo grado en VGV", "start": 4606.62, "end": 4614.38}, {"text": " no la no la ha desarrollado toda porque el desarrollamos el cuadrado SVGV menos VT0 y no termina", "start": 4627.62, "end": 4632.98}, {"text": " tener una ecuación de segundo grado en VGV", "start": 4632.98, "end": 4635.259999999999}, {"text": " VGS en este circuito lo mismo que VGV porque se ibe están conectados VGS es la", "start": 4643.82, "end": 4650.2}, {"text": " la tensión entre gate y source pero yo digo ahí no lo tengo hasta VGS", "start": 4650.2, "end": 4655.259999999999}, {"text": " pero no puse VGS disculpen si también", "start": 4655.26, "end": 4662.26}, {"text": " bien bueno entonces y como buena ecuación de segundo grado tiene dos raíces no con", "start": 4670.26, "end": 4676.22}, {"text": " soluciones este que en este caso terminan siendo entonces si uno hace las cuentas le", "start": 4676.22, "end": 4683.22}, {"text": " queda dos soluciones que son VGV igual 2 con 18 voltios y VGV menos 0,79 voltios", "start": 4683.22, "end": 4696.22}, {"text": " bueno entonces cuál es el verdadero VGV tiene dos soluciones el circuito o tiene una solución o no tiene ninguna que les parece", "start": 4736.22, "end": 4754.22}, {"text": " hay va cuál sería la solución la clague es positiva digamos no se ha ido hecho tiene que ser", "start": 4767.22, "end": 4775.22}, {"text": " mayor que el VT0 para para estar efectivamente en saturación esta sería una solución que es una", "start": 4775.22, "end": 4782.7}, {"text": " solución matemática la ecuación pero que no no se condice con las condiciones del problema", "start": 4782.7, "end": 4789.22}, {"text": " o sea que esta la descartamos porque el transistor no estaría no conduciría", "start": 4790.22, "end": 4798.22}, {"text": " VGV es menor que VT0 y entonces se han efectiva la solución que efectivamente", "start": 4803.22, "end": 4810.22}, {"text": " vamos a verificar pero que cumple es que cumple que es mayor que VT0 es VGV con 18 voltios", "start": 4811.22, "end": 4822.22}, {"text": " bien y entonces ahora como calculamos la corriente id que era lo que queríamos calcular", "start": 4827.22, "end": 4832.22}, {"text": " la tengo más de un lado donde dirían de agarrar la diamo", "start": 4840.22, "end": 4848.22}, {"text": " una opción es sustituir en la ecuación del transistor también otra es sustituir", "start": 4858.22, "end": 4864.22}, {"text": " la ecuación que viene del circuito capaz que es un poquito más fácil pero digo la diferencia es", "start": 4864.22, "end": 4869.22}, {"text": " menor digamos en un caso tengo hace un cuadrado en el otro caso no tengo casi un cuadrado y de", "start": 4869.22, "end": 4874.06}, {"text": " un lado por el otro podemos calcular la corriente id que en este caso termina quedando 0,7", "start": 4895.22, "end": 4903.22}, {"text": " ni ni amplia y bueno y que no faltaría ahora digamos para terminar nos faltaría verificar", "start": 4903.22, "end": 4915.22}, {"text": " que efectivamente estoy en verificar la hipótesis de que el transistor opera en saturación", "start": 4915.22, "end": 4922.22}, {"text": " y ahora vamos a ver que el transistor opera en la corriente id que es el transistor opero", "start": 4924.22, "end": 4930.22}, {"text": " y ahora vamos a ver que el transistor opero en el circuito es el transistor opero", "start": 4930.22, "end": 4936.22}, {"text": " y bueno por un lado la primera es ver si VGV es efectivamente mayor que VT0", "start": 4936.22, "end": 4945.22}, {"text": " más 1 más delta por VCV este en este caso es 0 y esto es ízelo sí 2 con 18 es mayor que el 1 con 5", "start": 4945.22, "end": 4957.22}, {"text": " voltios del VT0 o sea que efectiva es un voltio de acá un voltio de VT0 1 con 5 en el ejemplo anterior", "start": 4957.22, "end": 4967.22}, {"text": " o sea que efectivamente se cumple y la segunda condición que si se quieren la un poquito", "start": 4967.22, "end": 4978.22}, {"text": " más la menos obvia digamos la esta era clara que a golpe de vista la que menos obvia es bueno ver que efectivamente", "start": 4978.22, "end": 4984.22}, {"text": " la resistencia redé no sea demasiado grande como para que la caída en el redé sea demasiado grande", "start": 4984.22, "end": 4992.22}, {"text": " y me aprete acá la atención VD me haga que la atención VD sea muy chiquita y haga que el transistor no tenga el VD suficiente para estar en saturación", "start": 4992.22, "end": 5005.22}, {"text": " no podemos que verificar que VD sea mayor que VGV menos VT0 sobre 1 más delta", "start": 5005.22, "end": 5019.22}, {"text": " entonces lo primero es calcular cuanto vale VDV", "start": 5019.22, "end": 5025.22}, {"text": " no sea la diferencia atención entre acá entre el decaín y el sustrato en ese caso VDV", "start": 5025.22, "end": 5042.22}, {"text": " como?", "start": 5042.22, "end": 5046.22}, {"text": " hay va tengo la corriente tengo redé tengo los nuevos voltios o sea que lo hay local incundo no", "start": 5046.22, "end": 5052.22}, {"text": " VDV va a ser bueno tengo la caída abajo perdón te va a dar mirad atención en el tengo la atención en el bulca", "start": 5052.22, "end": 5059.22}, {"text": " cuando efectiva esto termina siendo vamos por la expresión sería 9 volt", "start": 5059.22, "end": 5066.22}, {"text": " pero VD menos RD por id ahí tengo la atención en el terminal de decaín respecto a tierra", "start": 5066.22, "end": 5078.22}, {"text": " y a esto hay que restarle la atención en el terminal de surzo de bulca respecto a tierra que es RS por id", "start": 5079.22, "end": 5090.22}, {"text": " por ejemplo y esto termina quedando 2,32 voltios", "start": 5093.22, "end": 5099.22}, {"text": " no pero 2,76 voltios o sea esto da 5,08 y esto da 2,32 y en efectiva el resultado es 2,76 voltios", "start": 5100.22, "end": 5119.22}, {"text": " o sea que en definitiva esto es 2,76 voltios y la atención de saturación", "start": 5119.22, "end": 5127.22}, {"text": " la atención de pinchof es 2,18 menos 1 voltio dividido 1 más 0 porque el delta va a la 0", "start": 5127.22, "end": 5138.22}, {"text": " o sea que es 1,18 voltios o sea que efectivamente también se cumple por suerte", "start": 5139.22, "end": 5153.22}, {"text": " no tenemos que volver al primer casillero y analizar todo el bueno", "start": 5153.22, "end": 5162.22}, {"text": " bueno alguna pregunta hasta acá", "start": 5163.22, "end": 5166.22}, {"text": " no este circuito acá lo único que no está haciendo nada útil, digamos lo único útil que está haciendo es", "start": 5170.22, "end": 5176.22}, {"text": " fijarle una cierta corriente conocida el transistor que es esta idea que hallamos", "start": 5176.22, "end": 5182.22}, {"text": " fijarle que pase esta corriente por el transistor contó la por lo que va a la resistencia", "start": 5182.22, "end": 5188.22}, {"text": " y de tal manera que el transistor que es esa duración", "start": 5189.22, "end": 5193.22}, {"text": " entonces ahí el transistor va a estar funcionando en la zona que funciona como una fuente de corriente", "start": 5193.22, "end": 5198.22}, {"text": " nada por esta ecuación y de esta manera es como vamos a usar después el transistor como amplificador", "start": 5198.22, "end": 5205.22}, {"text": " o sea alguna manera lo que vamos a ver después es que uno puede de alguna hora a este circuito que todo es continuo", "start": 5205.22, "end": 5212.22}, {"text": " a sumarle una tensión variable acá o sea hacer que por ejemplo que esta tensión se mueva un poquito y esa tensión que chiquita que le vamos a sumar", "start": 5213.22, "end": 5221.22}, {"text": " acá va a parecer amplificada la salida por ejemplo pero lo primero es asegurarse de esta sensación", "start": 5221.22, "end": 5229.22}, {"text": " bien en algún bueno no es que de animación minutitos pero", "start": 5229.22, "end": 5235.22}, {"text": " bueno capaz de vamos dejar por acá la próxima vamos a ver una variante la secuación es que es muy", "start": 5236.22, "end": 5244.22}, {"text": " usada a veces ustedes van a encontrar más comúnmente muchos libros que es una pequeña variante pero", "start": 5244.22, "end": 5250.22}, {"text": " eso está bueno conocerla y no vamos a meter entonces ya en el transistor vemos si en algunos otros aspectos", "start": 5250.22, "end": 5257.22}, {"text": " el laboratorio la idea es que la letra este probablemente se publica entre hoy mañana ya está pronta hasta", "start": 5258.22, "end": 5265.22}, {"text": " todavía corregir una cosita pero probablemente se publica entre hoy mañana", "start": 5265.22, "end": 5268.22}]